{
  "FacilityID": 1000079218,
  "FacilityName": "Doswell Energy Center",
  "FacilityStr1": "10098 Old Ridge Road",
  "FacilityStr2": null,
  "FacilityCity": "Ashland",
  "FacilityState": "VA",
  "FacilityZipCode": "23005",
  "Facility4DigitZipExt": "7312",
  "FacilityCountyFIPS": "51085",
  "LEPC": "Hanover County LEPC",
  "FacilityLatDecDegs": "37.818236",
  "FacilityLongDecDegs": "-077.447792",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 135474588,
  "ParentCompanyName": "Doswell Limited Partnership",
  "Company2Name": null,
  "CompanyDUNS": 135474588,
  "Company2DUNS": 0,
  "OperatorName": "Doswell Limited Partnership",
  "OperatorStr1": "10098 Old Ridge Road",
  "OperatorStr2": null,
  "OperatorCity": "Ashland",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23005",
  "OperatorZipCodeExt": "7312",
  "FTE": 29,
  "OtherEPAFacilityID": "23005DSWLL10098",
  "EPAFacilityID": "100000050464",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "51018",
  "SafetyInspectionDate": "2019-02-05 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-09-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-05-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-05-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-05-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 37.8129,
  "FRS_Long": -77.4364,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "15",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000098786,
      "AltID": "Ammonia",
      "FacilityID": 1000079218,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000123856,
          "ProcessID": 1000098786,
          "ChemicalID": 56,
          "Quantity": 90000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000100027,
          "ProcessID": 1000098786,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000083718,
              "Process_NAICS_ID": 1000100027,
              "SafetyReviewDate": "2018-06-19 00:00:00",
              "PHA_Date": "2018-06-19 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-06-14 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-04-03 00:00:00",
              "TrainingReviewDate": "2019-05-17 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-11-21 00:00:00",
              "EquipmentInspectionDate": "2018-06-19 00:00:00",
              "EquipmentTested": "Control valves",
              "ChangeMgmtDate": "2012-03-09 00:00:00",
              "ChangeMgmtReviewDate": "2014-03-18 00:00:00",
              "PreStartupReviewDate": "2012-03-09 00:00:00",
              "ComplianceAuditDate": "2018-06-21 00:00:00",
              "AuditCompletionDate": "2018-08-02 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2018-08-02 00:00:00",
              "HotWorkPermitReviewDate": "2018-06-30 00:00:00",
              "ContractorSafetyReviewDate": "2014-10-06 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000104277,
                  "PreventionProgram3ID": 1000083718,
                  "ProcessChemicalID": 1000123856
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000079218,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2017-06-06 00:00:00",
    "ERTrainingDate": "2018-12-18 00:00:00",
    "CoordinatingAgencyName": "Hanover County LEPC",
    "CoordinatingAgencyPhone": "8045376195",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "Virginia 9 VAC 25-91-170, oil discharge"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079218,
      "SummaryText": "1.    Accidental Release Prevention and Emergency Response\n\nAll Doswell Team Members are instilled with the shared values of an injury free workplace and environmental responsibility.  A Job Safety Analysis (JSA) is performed before each job or task.  If a job cannot be done safely, it is not done.  If a job is safe but has environmental concerns, it is not done. \n\nStandard operating procedures and a preventive maintenance program partnered with the shared values are the backbone of Doswell's prevention program.  All Operation and Maintenance Technicians are required to be qualified on the system before being allowed to work with/on that system.  The operator qualification program defines the knowledge and skill an individual must possess to operate or maintain any given system.  In addition to basic system knowledge, an individual must possess knowledge related to safety, emergency, security, integrated plant operations, and environmental impact as applies to that system.\n\nDoswell utilizes a Computerized Maintenance Management System (CMMS).  Preventive maintenance (PM) work orders are issued on a periodic basis established by equipment manufacturers and equipment history.  PM's are used to maintain plant equipment in a good working order and prevent accidental releases due to normal equipment aging.  The CMMS issues and tracks corrective work orders. Premature failures, abnormal operating conditions, releases, safety incidents, and re-occurring corrective work orders are also tracked in the CMMS. \n\nDoswell has procedures and equipment for responding to emergencies in an orderly and safe manner. Emergency plans are utilized to provide guidance and direction in the event of an emergency.  As a part of protecting employee health and safety, Doswell designates itself as a \"non-responding\" facility. Facility self-designation as non-responding is recognized by the U.S. Environmental Protection Agency (EPA) and the U.S. Occupational Safety and Health Administration (OSHA). "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079218,
      "SummaryText": "Non-responder status was established as a risk ceiling for employee response.  Under no circumstances shall personnel jeopardize their health and safety or that of others in responding to an emergency. In responding, employees shall not exceed the level of risk that is addressed in daily required PPE. \n\n\n\n2.    Stationary Source and Regulated Substance Handled\n\nDoswell Energy Center is an independent electric power production facility. The site consists of a combined cycle facility (CC) and a simple cycle facility (SC). The CC facility consists of 2 units, each containing two combustion turbines, two heat recovery steam generators (HRSGs), one steam turbine, one air-cooled condenser, and their plant support equipment.  The SC facility consists of three single simple cycle combustion turbines. The primary for the CC facility fuel is natural gas with light distillate fuel oil as a backup fuel. The primary fuel for the SC facility is natural gas. \n\nThe CC facility uses anhydrous ammonia to control nitrous oxide emissions while the burning of fuel oil and natural gas for electric power production.  The ammonia is stored as a liquid under pressure, which is vaporized and mixed with air before being injected into the Selective Catalytic Reduction unit on each HRSG. The ammonia is stored in two, 10,000-gallon tanks, which have a total capacity of 103,200 pounds of anhydrous ammonia. \n\n\n\n3.    Prevention Program and Chemical-Specific Prevention Steps\n\nDoswell is a Program 3 facility under the classification system in 40 CFR 69, and it has a prevention program that meets the regulatory requirements. \n\n3.1.    Process Safety Information is found in the Doswell PSM / RMP Program Manual.  The summary discusses ammonia recognition, safety profile, normal handling, emergency handling, first aid, firefighting, and regulatory information. \n\n3.2.    The most recent Process Hazard Analysis was completed to comply with 29 CFR 1910.119(e).  The What If method was used by Doswell Team members to re"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079218,
      "SummaryText": "view and analyze the ammonia system.\n\n3.3.    The Facility's Operating Procedures include the Ammonia System Normal Startup, Operations, and Shutdown Operating Procedure, the Ammonia Receiving and Unloading Procedure, and the Ammonia Storage and Supply System Description.  Procedures are reviewed and revised regularly or as a result of the Event Response process.\n\n3.4.    Training is defined in the Ammonia Safety and Training Program. All personnel who may be involved with the handling or maintenance of anhydrous ammonia product or equipment shall receive safety training.  This training will be conducted and documented before an employee is allowed to work around the anhydrous ammonia product or equipment. \n\n3.5.    The ammonia system and equipment was designed and constructed according to American Society of Mechanical Engineers (ASME) standards. Maintaining the Mechanical Integrity of the ammonia system is accomplished through Facility procedures and the computer based maintenance system. Preventive maintenance (PM) work orders are issued on a periodic basis established by equipment manufacturers and equipment history. \n\n3.6.    Management of change is addressed in the Change Management Process.  All plant design changes are reviewed for safety and environmental impact.  For any changes involving the ammonia system, a second more in depth procedure is followed to address the additional safety and environmental requirements of the Prevention Program.\n\n3.7.    A Pre-startup Review is a requirement of the Change Management process.\n\n3.8.    Compliance Audits will be conducted and scheduled as required or as the result of a release or system change.  \n\n3.9.    Incident Investigation of an incident which resulted in, or could reasonably result in a catastrophic release of ammonia will be conducted by a Root Cause Analysis (RCA) team.  The team will be assembled and investigate the incident in a timely manner. The RCA report shall be issued and countermeasures incorporated in the CMMS for t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000079218,
      "SummaryText": "racking to closure.\n\n3.10.    Employee Participation is developed through Doswell System Owner program.  Each Doswell Team member is assigned a system or process.  System owners are involved with all aspects of their system, from Operating Procedures to reviewing proposed physical or control changes. \n\n3.11.    Doswell has a Hot Work Permit Procedure in compliance with 29 CFR 1910.252(a).\n\n3.12.    Contractors performing work at the Facility are required to attend a safety orientation that includes ammonia awareness, before work can begin.  Contractors are required to abide by Doswell safety rules and procedures.\n\n \n\n4.    Five-Year Accident History\n\nDoswell has had no offsite or significant release of ammonia since beginning its storage and use at in the SCR process.\n\n\n\n5.    Emergency Response Program\n\nDoswell's emergency action plan instructs employees on emergency actions for employee protection and first aid, including for ammonia-related incidents. Doswell employees shall not respond to an occurrence that results or is likely to result in an uncontrolled release of a hazardous substance. In the event of such an occurrence, Doswell shall (1) take measures to protect its employees and (2) call the Hanover County Communications Center for emergency personnel and equipment to respond to the release.  \n\nDoswell expects employees to take actions to end a leak (e.g., by shutting a valve) or clean up a spill that do not pose an immediate health or safety hazard. Those measures shall be considered incidental emergency responses and employees are allowed such activities.\n\nThe Emergency Plan has instructions for notifying and coordinating with the local agency for response activities, Hanover County, in the event of a significant ammonia release at the Facility.  Hanover County will be immediately notified of any ammonia release that carries over the security fence.  Doswell's integrated plan has been shared with Hanover County officials.  Doswell has conducted ammonia release drills w"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000079218,
      "SummaryText": "ith Hanover and Henrico County response teams. \n\n\n\n6.    Planned Safety Improvements\n\nNone at this time.\n\n"
    }
  ]
}