{
  "FacilityID": 1000056469,
  "FacilityName": "Paradise Rail Siding",
  "FacilityStr1": "495 Railroad Ave",
  "FacilityStr2": null,
  "FacilityCity": "Paradise",
  "FacilityState": "MT",
  "FacilityZipCode": "59859",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "30089",
  "LEPC": "Sanders County LEPC",
  "FacilityLatDecDegs": "47.393933",
  "FacilityLongDecDegs": "-114.809556",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "IO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Plains Midstream Canada",
  "OperatorStr1": "607 8th Ave SW Suite 1400",
  "OperatorStr2": null,
  "OperatorCity": "Calgary",
  "OperatorStateFIPS": null,
  "OperatorZipCode": null,
  "OperatorZipCodeExt": null,
  "RMPContact": "John Soenning",
  "RMPTitle": "EHS, Plains",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000232296",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": "Alberta",
  "ForeignZipCode": "T2P0A7",
  "ForeignCountry": "CA",
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-09-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-09-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-09-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-07-10 00:00:00",
  "DeRegistrationEffectiveDate": "2020-07-02 00:00:00",
  "AnniversaryDate": "2021-09-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "We no longer store rail cars here",
  "_processes": [
    {
      "ProcessID": 1000070845,
      "AltID": "Rail Storage",
      "FacilityID": 1000056469,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000072047,
          "ProcessID": 1000070845,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000092715,
          "ProcessID": 1000070845,
          "ChemicalID": 118,
          "Quantity": 21915000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000592715,
          "ProcessID": 1000070845,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000056469,
      "SummaryText": "Paradise Rail Storage Facility\n\n\n\nIntroduction and Policies\n\n\n\nPlains LPG Services, L.P., is committed to managing all operations in a manner that protects the environment and the health and safety of employees, customers, contractors and the public while fully complying with applicable laws and regulations. Plains management philosophy goals are achieved through the implementation of the environmental, health and safety management systems, by the personal commitments of employees and contractors, and by open communication with employees, customers, neighbors, and regulators.\n\n\n\nThe purpose of this Risk Management Plan (RMPlan) is to provide information about operations at the facility, programs to prevent accidental chemical releases, emergency response plans in the event an accidental release should occur, the five-year accident history of the facility, and planned changes to improve safety at the facility.\n\n\n\nStationary Source and Regulated Substance\n\n\n\nThe Paradise facility is owned by Plains LPG Services, L.P. and operated by Plains Marketing Canada, L.P. At the facility, railcars are stored on the property until marketing can find a suitable market for the liquids. Butane is the substance regulated under the Risk Management Program (RMP) that is present at the Paradise facility in amounts above threshold quantity. The facility is classified as Program Level 2 under the regulation.\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nThe accidental release prevention and emergency response programs in place at the facility are part of the high standards striven for by Plains. These high standards include:\n\n?    Operating in compliance with required environmental permits and regulations.\n\n?    Operating and maintaining the assets in such a manner that unintentional releases are minimized.\n\n?    Operating and maintaining assets in such a manner that the small releases associated with normal operation and maintenance will be minimized to the extent possible."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000056469,
      "SummaryText": " \n\n?    Correcting non-compliance found during regular audits of the facility.\n\n\n\nPrevention Program\n\n\n\nThe Paradise Facility does not operate under the guidelines of the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program since the facility is normally unmanned and remote. However, it does operate under the requirements of Program Level 2 in the RMP regulations. Analysis of the potential hazards of the process, training of employees, and emphasis on safety has helped avoid any serious chemical release accidents since operations began. Part of this program has also involved identifying and taking steps to avoid potential accidental chemical releases.\n\n\n\nFive-Year Accident History\n\n\n\nNo incident resulting in onsite injuries, death or property damage or offsite impacts from a butane release has occurred at the Paradise Facility within the last five years.\n\n\n\nEmergency Response Program\n\n\n\nThe facility has developed an emergency response plan, which will be coordinated with local emergency response groups such as the Plains-Paradise Rural Fire District. Also involved in emergency response for the facility would be the Sanders County Sheriff's Office and County Emergency Services. The facility operator is responsible for coordinating the notifications required to initiate an emergency response. The Emergency Response Plan provides the essential planning for effectively protecting workers, the public, and the environment during emergency situations.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nCompliance with the RMP Prevention Program coupled with the environmental, health and safety management systems, forms the framework for continuous safety improvement. Some of the key components of the safety program are:\n\n?    The Management of Change provisions ensure that the potential safety and health impacts of any change made to process chemicals, technology, equipment or procedures are considered.\n\n?    The maintenance provisions ensure that proces"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000056469,
      "SummaryText": "s equipment and instrumentation are designed, constructed, installed and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of the safety program.\n\n\n\nSpecific actions that will be taken in the future to improve the level of safety at the facility include:\n\n?    Compliance audits will ensure that the level of safety protection at the facility is periodically being evaluated for improvements.\n\n?    An ongoing dialogue with the local Fire Department will ensure a constant state of readiness to respond to any potential emergencies, as well as a means to implement improvements as the need develops.\n\n\n\n"
    }
  ]
}