{
  "FacilityID": 1000079041,
  "FacilityName": "Sanders Lead Co",
  "FacilityStr1": "1 Sanders Road",
  "FacilityStr2": null,
  "FacilityCity": "Troy",
  "FacilityState": "AL",
  "FacilityZipCode": "36079",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01109",
  "LEPC": "Pike County LEPC",
  "FacilityLatDecDegs": "31.788862",
  "FacilityLongDecDegs": "-85.978614",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 46481032,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sanders Lead Company",
  "OperatorStr1": "1 Sanders Road",
  "OperatorStr2": null,
  "OperatorCity": "Troy",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36079",
  "OperatorZipCodeExt": null,
  "RMPContact": "Chris Rutherford",
  "RMPTitle": "Environmental Affairs+",
  "FTE": 450,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000241687",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "210-0005",
  "SafetyInspectionDate": "2018-11-14 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-11-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-09-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-09-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-09-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000099192,
      "AltID": "Ammonia Absorber",
      "FacilityID": 1000079041,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000100436,
          "ProcessID": 1000099192,
          "NAICSCode": "331492",
          "_desc": {
            "NAICS_CODE": "331492",
            "NAICS_DESCRIPTION": "Secondary Smelting, Refining, and Alloying of Nonferrous Metal (except Copper and Aluminum)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000124315,
          "ProcessID": 1000099192,
          "ChemicalID": 56,
          "Quantity": 262000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000624315,
          "ProcessID": 1000099192,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079041,
      "SummaryText": "Purpose\n\nThe purpose of the Risk Management Program is to learn of the potential hazards an ammonia release can cause and to give tools to determine what to do in the event of a release.\n\n \n\nScope\n\nSafety Manager has the overall responsibility for the development, implementation and integration of the verification of Risk Management Program Requirements.\n\n\n\nExecutive Summary\n\nHealth and safe work environments for employees are Sanders Lead Company's main priorities.  This facility has strict policies and procedures to reduce the risk of an accidental hazardous release.  The Process Safety Management Program is a facility and personnel driven document imbedded in the Sanders Lead Company culture to ensure the surrounding community and employees are protected.  The requirements set by OSHA's PSM Standard CFR 1910.119 is integrated in the Risk Management's Prevention Program, including 14 PSM elements.  The facility has committed to completing audits and inspections as well as holding employee meetings to establish current procedures, ensure there is employee buy in for procedures and seek new opportunities for improvement to health and safety policies.  In the event of an emergency, the facility will evacuate or shelter in place depending upon factors of the emergency due to the facility housing a refrigeration system with anhydrous ammonia as a refrigerant.  \n\n\n\nFacility summary of Process Safety Management Programs: \n\n?    Employee Participation - Employees are given shared responsibility with management in the continued evolution of the program.\n\n?    Process Safety Information - Chemical, equipment, and system information has been compiled to ensure the safe design and operation.\n\n?    Process Hazard Analysis - What-if Checklist completed to identify potential hazards and minimize their impact.\n\n?    Operating Procedures - Standard Operating Procedures developed to ensure the safe operation of the process.\n\n?    Training - Training program established and operators trained to en"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079041,
      "SummaryText": "sure the safe operation of the process.\n\n?    Contractors - Contractor program established to ensure only qualified and trained contractor work on or near the process.\n\n?    Pre-Startup Safety Review - Procedures and checklist developed to ensure all safety requirements completed before startup of new or modified process.\n\n?    Mechanical Integrity - Program developed to ensure equipment and systems installed per design specifications and maintained per manufacturer recommendations and good engineering practices.\n\n?    Hot Work Permit - Permit program established to prevent the potential of fire/explosion resulting from hot work near hazardous chemicals.\n\n?    Management of Change - Procedures established to manage process changes to ensure the integrity of the PSM program is maintained.\n\n?    Incident Investigation - Procedures established to investigate releases that resulted in or could have resulted in a catastrophic release of a hazardous chemical to prevent reoccurrence.\n\n?    Compliance Audits - Procedures established to periodically review program implementation and to correct as necessary.\n\n?    Trade Secrets - Policy implemented to provide all necessary information regardless of trade secrets to ensure the employee safety.\n\n\n\nAccident History\n\nSanders Lead Company will report any and all qualifying incidents to the EPA as well as record them in the submission of the Risk Management Program.\n\n\n\nEmergency Response Program\n\nSanders Lead Company is included in the written community emergency response plan.  The facility has its own emergency plan for emergencies that can be handled in house, without outside resources.  The plan includes policies and procedures for alerting outside agencies and resources in the event of a chemical release. \n\nSanders Lead Company does not respond to emergencies.\n\n\n\nPlanned Changes to Improve Safety\n\nSanders Lead Company is proactive in their approach to health and safety of its employees and surrounding community. Any areas of improvement that can be i"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079041,
      "SummaryText": "dentified in audits, hazard analyses and inspections are identified and corrective actions are taken in the event a recommendation is made promptly.  \n\n\n\n\n\n"
    }
  ]
}