{
  "FacilityID": 1000057098,
  "FacilityName": "Georgia-Pacific Consumer Operations LLC",
  "FacilityStr1": "401 NE Adams Street",
  "FacilityStr2": null,
  "FacilityCity": "Camas",
  "FacilityState": "WA",
  "FacilityZipCode": "98607",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53011",
  "LEPC": "Clark County",
  "FacilityLatDecDegs": "45.585018",
  "FacilityLongDecDegs": "-122.406282",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.gp.com",
  "FacilityEmailAddress": "jeff.dambrun@gapac.com",
  "FacilityDUNS": 808215706,
  "ParentCompanyName": "GP Consumer Products Operations LLC",
  "Company2Name": null,
  "CompanyDUNS": 80991302,
  "Company2DUNS": 0,
  "OperatorName": "G-P Consumer Operations LLC",
  "OperatorStr1": "401 NE Adams Street",
  "OperatorStr2": null,
  "OperatorCity": "Camas",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98607",
  "OperatorZipCodeExt": null,
  "RMPContact": "Shawn Wood",
  "RMPTitle": "Vice President",
  "FTE": 435,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000139771",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "WA0000256",
  "SafetyInspectionDate": "2012-03-01 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-05-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-05-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-05-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-07-03 00:00:00",
  "DeRegistrationEffectiveDate": "2018-04-26 00:00:00",
  "AnniversaryDate": "2021-05-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 45.585,
  "FRS_Long": -122.40444,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000071327,
      "AltID": "R-8 Reactor",
      "FacilityID": 1000057098,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000072529,
          "ProcessID": 1000071327,
          "NAICSCode": "32211",
          "_desc": {
            "NAICS_CODE": "32211",
            "NAICS_DESCRIPTION": "Pulp Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000088154,
          "ProcessID": 1000071327,
          "ChemicalID": 71,
          "Quantity": 5692.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 71,
            "ChemicalName": "Chlorine dioxide  [Chlorine oxide (ClO2)]",
            "CASNumber": "10049-04-4",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000588154,
          "ProcessID": 1000071327,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000057098,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICY\n\n\n\nThe management and employees of Georgia-Pacific Consumer Products (Camas) LLC are committed to responsible stewardship of the environment, protection of the community, preservation of employee health, and assurance of product safety.  Management systems have been developed, and are continually improved, to prevent the release of regulated substances, especially in locations which may have a detrimental impact on employees, the community, or the environment.\n\n\n\nFACILITY DESCRIPTION, REGULATED SUBSTANCES/PROCESSES\n\n\n\nFacility Description\n\n\n\nThe Georgia-Pacific Consumer Products (Camas) LLC facility is a 661 acre pulp and paper manufacturing complex established in 1883 as the Columbia River Paper Company.  It began as a pioneer newsprint mill and has evolved into a fully integrated pulp and paper facility.  Current products include communication papers, market pulp, and toweling.  The mill site is bounded on three sides by the City of Camas.  Approximately 185 acres of the mill site lie north of the Camas Slough (an arm of the Columbia River) and are heavily developed.  Lady Island is situated directly south of the slough and covers some 476 acres.  It hosts the wastewater treatment system and several solid waste handling facilities.  The mill employs 435 people from communities in Southwest Washington and Northwest Oregon.  Pulp and paper manufacturing processes operation around the clock, seven days per week, and throughout the year.  \n\n\n\nRegulated Substances/Processes\n\n\n\nThe Camas Mill uses a variety of materials to brighten pulp and paper products including oxygen, hydrogen peroxide, and chlorine dioxide.  Chlorine dioxide is a regulated substance under the RMP rule.  It is manufactured in the R-8 Chloride Dioxide Generator.  On November 18, 2010, the mill reduced the amount of chlorine dioxide stored on site by 81% (500,000 gallons to 65,000 gallons).  The chemical is produced as a 0.9% solution with a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000057098,
      "SummaryText": "n interlock at a maximum of 1.1% solution.  For the purposes of this report, we have assumed that the concentration is 1.1%, which is the maximum possible concentration in our system.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\n\n\nThe Camas Mill Accidental Release Prevention Program has been developed to comply with the RMP Rule (40 CFR Part 68), the Process Safety Management rule for Highly Hazardous Chemicals, as administered by the Occupational Health and Safety Administration (OSHA)(29 CFR 1910.119), and WAC 296-67, Safety Standards For Process Safety Management of Highly Hazardous Chemicals, as administered by the Washington Department of Labor & Industries.  The Process Safety Management Program, or PSM, is comprised of fourteen different elements, each of which contributes to the health and safety of workers whose jobs place them in contact with hazardous chemicals.  The mill has a qualified PSM coordinator managing the program.  In addition, to this resource, the mill maintains a PSM Steering Committee that meets regularly to oversee, audit, and implement all aspects of the PSM program.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThe Camas Mill has not experienced a covered accidental release (as defined in 40 CFR 68.42) of chlorine dioxide in the last five years.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe Camas Mill maintains a comprehensive written emergency response program, which is intended to protect employees, the community, and the environment.  The program includes plans and procedures for responding to a wide range of events, either accident or natural, that could result in a release of regulated materials.  Procedures have also been developed for addressing potential fire or explosion situations involving flammable substances.  The Camas Mill employs a full time emergency response team, which is fully qualified to respond to all hazardous materials events.  Mill personnel are trained in the use of Incident Command System (ICS) protocols for responding to emergency si"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000057098,
      "SummaryText": "tuations.  Training and drills are conducted annually to ensure our ability to respond to spill events.\n\n\n\nThe Camas Mill manages a community warning system that was developed with Camas Fire and Police Departments.  This system consists of two electronic sirens -- one located at each end of the mill property -- which can broadcast a 360 degree warning to a distance of at least one mile from the mill (and downtown Camas).  These sirens are available to alert the community to an emergency that may require people to evacuate or stay inside (shelter in place) until an all clear is given.  Examples of such emergencies are earthquakes, severe weather, train derailments, and hazardous chemical spills and releases.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Camas Mill constantly strives to improve the safety of their processes through the following programs:\n\n--Revalidation of existing and new PHAs (if applicable)\n\n--Job Hazard Analyses of tasks conducted throughout the facility are performed along with the creation of Standard Operating Procedures and Hazard Identification Risk Assessments.  These are reviewed regularly to ensure that all potential hazards are identified.\n\n--Operator training for persons working in a covered process is provided and reviewed on a regular basis.\n\n--Emergency response drills are performed on a regular, prescribed, basis.\n\n--Pre-startup safety reviews are performed prior to startup of any source after a major down.\n\n--Various audits are conducted throughout the year to ensure fire prevention and emergency procedures are up-to-date and accurate. \n\n\n\n**Note - The total reported chemical amount for this submittal is different than amount submitted in the last report. The total amount of chemical on-site has not changed, but the calculation of total pounds for this submittal was conducted taking into account interlocks controlling the maximum concentration of chlorine dioxide in the system as well as a high level interlock for the storage tank. "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000057098,
      "SummaryText": "These were not accounted for in the last submittal."
    }
  ]
}