{
  "FacilityID": 1000080572,
  "FacilityName": "National Beef Packing Company, LLC, Hummels Wharf",
  "FacilityStr1": "1811 N. Old Trail",
  "FacilityStr2": null,
  "FacilityCity": "Selinsgrove",
  "FacilityState": "PA",
  "FacilityZipCode": "17870",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42109",
  "LEPC": "Snyder County LEPC",
  "FacilityLatDecDegs": "40.830111",
  "FacilityLongDecDegs": "-076.838389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "bud.ludwig@nationalbeef.com",
  "FacilityDUNS": 147950794,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "National Beef Packing Company, LLC",
  "OperatorStr1": "12200 N Ambassador Drive",
  "OperatorStr2": "Dept 200",
  "OperatorCity": "Kansas City",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "64163",
  "OperatorZipCodeExt": "1244",
  "RMPContact": "Micah Miner",
  "RMPTitle": "General Manager",
  "FTE": 416,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000175623",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-06-14 00:00:00",
  "SafetyInspectionBy": "SCS Engineers",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.83028,
  "FRS_Long": -76.83833,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100650,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000080572,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000101895,
          "ProcessID": 1000100650,
          "NAICSCode": "31199",
          "_desc": {
            "NAICS_CODE": "31199",
            "NAICS_DESCRIPTION": "All Other Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000126032,
          "ProcessID": 1000100650,
          "ChemicalID": 56,
          "Quantity": 25000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000626032,
          "ProcessID": 1000100650,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080572,
      "SummaryText": "NATIONAL BEEF PACKING CO., L.L.C. - HUMMELS WHARF, PENNSYLVANIA\n\n\n\n1. EXECUTIVE SUMMARY\n\n\n\nNational Beef Packing Company, L.L.C. (National Beef) owns and operates a meat cutting and tray packaging facility in Hummels Wharf, Pennsylvania.  On site, National Beef has an ammonia refrigeration system which contains anhydrous ammonia, a regulated hazardous substance, for the refrigeration of meat at the facility.  The maximum intended inventory of anhydrous ammonia on site is above the threshold quantity listed in 40 Code of Federal Regulations (CFR) 68.130.\n\n\n\nSince the quantity of anhydrous ammonia exceeds the threshold quantity, National Beef is required to implement a Risk Management Program (RMP) at the Hummels Wharf facility which includes three (3) major elements: hazard assessment, prevention program, and emergency response program.  The submission of the RMP Plan presents the details of the RMP compliance measures conducted by National Beef.  The required RMP information was electronically submitted to the United States Environmental Protection Agency (U.S. EPA) in a timely manner before the date on which a regulated substance is first present above a threshold quantity in a process.\n\n\n\nNational Beef is also subject to OSHA's Process Safety Management Program (PSM).  Based on the information presented in this program, National Beef is subject to Program Level 3 requirements of the RMP regulation.\n\n\n\n1.1 Accidental Release Prevention and Emergency Response Policies\n\n\n\nNational Beef is committed to the protection of the safety, health, and environment in our routine operations and emergency responses.  Our prevention and emergency response practices are developed to protect the public as well as our own employees.  It is our policy to comply with applicable laws, and to support and work with local emergency response agencies.  To implement this policy, the following plans are maintained and implemented at the Hummels Wharf facility:\n\n\n\nPreparedness, Prevention, an"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080572,
      "SummaryText": "d Contingency (PPC) Plan\n\nQuality Assurance (QA) & Production Floor Evacuation Procedure\n\nProcess Safety Management (PSM) Program\n\nRisk Management Program (RMP)\n\n\n\nThese programs and procedures provide comprehensive planning for accidental and emergency situations. \n\n\n\n1.2 Description of National Beef and the Regulated Substance Handled\n\n\n\nThe National Beef, L.L.C. Hummels Wharf, PA plant located at 301 Old Trail Road and Elm Street is a meat cutting and tray pack plant.  Fresh meat in large cuts is cut into consumer portions and packaged in consumer trays.  No slaughtering takes place at the plant and no live animals are received.  The ammonia refrigeration system provides the necessary refrigeration of the meat.  In addition, the ammonia refrigeration system is utilized to provide cooling for the plant itself.  There are approximately 25,000 pounds of anhydrous ammonia located within the closed-loop ammonia refrigeration system. \n\n\n\n1.3 The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nNational Beef has specific process controls in-place to minimize the risks of spills. National Beef is subject to OSHA's Process Safety Management Program (PSM). National Beef has a preventative maintenance program in place to address maintenance of all vital parts of the ammonia refrigeration system.  All inspection and testing procedures are addressed within this program.  In addition, there are many safety controls installed within the system.  These include an interlock system, relief and check valves, manual and automatic shutoffs and alarms located within the ammonia refrigeration system.  \n\n\n\n1.4 Five year Accident History\n\n\n\nThere were no accidental releases of ammonia to include in the Five Year Accident History for the Hummels Wharf facility. \n\n\n\n1.5 The Emergency Response Program\n\n\n\nNational Beef's emergency response policies identify the actions to be taken in response to a chemical spill. National Beef conducts emergency respons"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080572,
      "SummaryText": "e training and drills throughout the year.  In the event of a spill, National Beef will react with the proper actions as listed in the Emergency Response Plan (Preparedness, Prevention and Contingency (PPC) Plan), in association with the local emergency response agencies listed in the PPC plan. Local emergency responders are familiar with the facility and the hazards of release.\n\n\n\n1.6 Planned Changes to Improve Safety\n\n\n\nNational Beef makes safety a first priority in its every day operations to ensure a safe working environment for all of its employees. National Beef is committed to continuously improving the facility's safety and working practices through the use of newly-identified protocols and through employee involvement and development.\n\n\n\nA Process Hazard Assessment (PHA) was recently reviewed at the National Beef facility.  A number of additional safeguards identified during the PHA have been implemented to improve the safety of the anhydrous ammonia process as well as reduce the chances and magnitude of any anhydrous ammonia spill.\n\n\n\n\n\n\n\n"
    }
  ]
}