{
  "FacilityID": 1000003394,
  "FacilityName": "Abbott Nutrition Division, Casa Grande",
  "FacilityStr1": "1250 West Maricopa Highway",
  "FacilityStr2": null,
  "FacilityCity": "Casa Grande",
  "FacilityState": "AZ",
  "FacilityZipCode": "85193",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04021",
  "LEPC": "Pinal County LEPC",
  "FacilityLatDecDegs": "32.888111",
  "FacilityLongDecDegs": "-111.786139",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.abbott.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 121457485,
  "ParentCompanyName": "Abbott Laboratories, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1307602,
  "Company2DUNS": 0,
  "OperatorName": "Abbott Laboratories, Inc.",
  "OperatorStr1": "1250 West Maricopa Highway",
  "OperatorStr2": null,
  "OperatorCity": "Casa Grande",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85193",
  "OperatorZipCodeExt": null,
  "RMPContact": "Roger Hill",
  "RMPTitle": "Plant Manager",
  "FTE": 450,
  "OtherEPAFacilityID": "85222RSSLB1250",
  "EPAFacilityID": "100000132215",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-01-08 00:00:00",
  "SafetyInspectionBy": "Arizona Radiation Regulatory Commission",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.88972,
  "FRS_Long": -111.77902,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000004197,
      "AltID": "Refrigeration System",
      "FacilityID": 1000003394,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000004373,
          "ProcessID": 1000004197,
          "NAICSCode": "311514",
          "_desc": {
            "NAICS_CODE": "311514",
            "NAICS_DESCRIPTION": "Dry, Condensed, and Evaporated Dairy Product Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000004639,
          "ProcessID": 1000004197,
          "ChemicalID": 56,
          "Quantity": 13700.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000504639,
          "ProcessID": 1000004197,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000003394,
      "SummaryText": "The Abbott LaboratoriesA? Nutritional Products Division Casa Grande facility is located at 1250 West Maricopa Highway in Casa Grande, Arizona. The facility manufactures milk-based infant formulas and adult medical nutritional products. Ammonia, used as a refrigerant, is the only USEPA Risk Management Program (RMP) regulated chemical present at the facility. The ammonia refrigeration system is subject to both the Occupational Safety and Health Administration (OSHA) and the USEPA RMP Process Safety Management (PSM) regulatory programs.\n\nThe ammonia is contained within a refrigeration system that is used to cool raw materials and products in the facility. The ammonia refrigeration system is a sealed, closed-loop system that refrigerates water which is then pumped into the manufacturing area of the facility where it is used to cool tanks and other equipment. The ammonia never comes into contact with the cooling water. Except for the compressors, the majority of the ammonia refrigeration system will be replaced with new equipment in 2009. The new system employs state-of-the-art design, and will include many of the existing ammonia system safety features, such as ammonia leak detectors and alarms. The new system is expected to hold less ammonia than the present system, and the worst-case modeling performed for this RMP submission reflects the maximum amount of ammonia within the present system.\n\nThere have been no accidental releases of ammonia from the facility within the past five years. This excellent record is the result of an active safety and spill prevention program that incorporates the latest ammonia system management technologies, including detailed operational procedures, preventive maintenance practices, and worker training. Emergency response procedures at the facility incorporate both internal (Abbott) and external (Casa Grande and Pinal County) resources and emergency response services. The facilityA?s ammonia refrigeration system workforce is highly traine"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000003394,
      "SummaryText": "d and experienced in both managing the system and in responding to any contingency. The facility's Emergency Response Team (ERT) is trained to OSHA's \"Hazardous Materials Technician\" level and is available 24-hours a day onsite. The ammonia refrigeration system operators are very familiar with the system, and are also trained ammonia incident emergency responders. Both the ERT and the ammonia system operators are trained to use specialized ammonia incident response equipment to mitigate any accidental release of ammonia, and will immediately respond to any ammonia system emergency. \n\nAbbott is a global healthcare company, and has a global environmental, health, and safety policy applicable to all operations. The policy requires that all operations maintain a safe and healthy workplace and environment and comply with all applicable laws designed to protect human health, safety and the environment. In addition to the active safety and spill prevention programs described earlier, the ammonia refrigeration system undergoes formalized process hazard analyses and audits on a regular frequency to assure compliance with relevant PSM regulations. The ammonia refrigeration system is equipped with a leak detection system that alerts the facility of any ammonia leaks so that they can be promptly fixed. The facility maintains self-contained breathing apparatus for ammonia leak or adverse event response. Access to the ammonia refrigeration system is controlled, and only trained and experienced operators or maintenance personnel are allowed access to the system.\n\nThe ammonia refrigeration system has an active preventive maintenance program that inspects and maintains the equipment at regular intervals to prevent breakdown. A certified ammonia system contractor performs a complete inspection and preventive maintenance program on each of the ammonia system compressors annually. All ammonia refrigeration system controls, leak sensors, and alarms are included in the preventive mainten"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000003394,
      "SummaryText": "ance program. The ammonia refrigeration systemA?s pressure safety relief valves are replaced every 5-years, and are located throughout the ammonia refrigeration system to prevent the rupture of the ammonia system should abnormal pressures develop. Pressure safety relief valves are directed into a common exhaust pipeline that contains an ammonia detector and alarm that promptly alerts the facility of any abnormal ammonia refrigeration system events.\n\nProcess Hazard Analyses (PHA's) were conducted on the ammonia system in 1999, 2004, and on May 6, 2009. Abbott is a concerned citizen of the community and we are proud of our safety and environmental compliance program. Our careful operation of the ammonia refrigeration system is an integral part of these efforts.\n"
    }
  ]
}