{
  "FacilityID": 1000080173,
  "FacilityName": "Haynes Generating Station",
  "FacilityStr1": "6801 East 2nd Street",
  "FacilityStr2": null,
  "FacilityCity": "Long Beach",
  "FacilityState": "CA",
  "FacilityZipCode": "90803",
  "Facility4DigitZipExt": "4324",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.765560",
  "FacilityLongDecDegs": "-118.096111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "www.ladwp.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 172058471,
  "ParentCompanyName": "City of Los Angeles Department of Water and Power",
  "Company2Name": null,
  "CompanyDUNS": 603080136,
  "Company2DUNS": null,
  "OperatorName": "Department of Water and Power",
  "OperatorStr1": "111 North Hope Street, Room 1050",
  "OperatorStr2": null,
  "OperatorCity": "Los Angeles",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90012",
  "OperatorZipCodeExt": null,
  "FTE": 187,
  "OtherEPAFacilityID": "CAD000633248",
  "EPAFacilityID": "100000139646",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "800074",
  "SafetyInspectionDate": "2019-02-11 00:00:00",
  "SafetyInspectionBy": "City of Long Beach, Bureau of Environmental Health",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-07-30 17:34:28",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-14 14:53:57",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-06-14 14:53:57",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 33.7639,
  "FRS_Long": -118.0948,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100098,
      "AltID": "Ammonia Solution Storage",
      "FacilityID": 1000080173,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125377,
          "ProcessID": 1000100098,
          "ChemicalID": 57,
          "Quantity": 1348900.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000101339,
          "ProcessID": 1000100098,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000062180,
              "Process_NAICS_ID": 1000101339,
              "SafetyReviewDate": "2019-06-12 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "API, UBC, UFC",
              "FR_Comments": "Engineering standards and codes are used in the design and construction of tanks and process piping.",
              "HazardReviewDate": "2019-06-03 00:00:00",
              "ChangeCompletionDate": "2020-12-03 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-06-12 00:00:00",
              "TrainingReviewDate": "2019-05-23 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-05-24 00:00:00",
              "EquipmentInspectionDate": "2019-05-29 00:00:00",
              "EquipmentTested": "Scrubbers, pressure/vacuum relief valves, ammonia gas detectors, emergency eyewash stations, and personal protective equipment. Storage tanks NDE tested in 2018.",
              "ComplianceAuditDate": "2017-11-15 00:00:00",
              "AuditCompletionDate": "2019-06-30 00:00:00",
              "IncidentInvestigationDate": "2017-09-26 00:00:00",
              "InvestigationChangeDate": "2017-12-05 00:00:00",
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000062948,
                  "PreventionProgram2ID": 1000062180,
                  "ProcessChemicalID": 1000125377
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000080173,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Long Beach Fire Department",
    "CoordinatingAgencyPhone": "5624308102",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "California Business Plan, CCR Title 19, Sections 2729-2732"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080173,
      "SummaryText": "he aqueous ammonia handling and storage subsystem supplies ammonia solution to \r\nthe nitrogen oxide emission control catalyst in the SCR. Aqueous ammonia solution is used instead of anhydrous ammonia because the latter has some serious inherent safety hazards requiring significant precautions and safety equipment in handling and storing.  The risks and safety related costs of anhydrous ammonia are found to outweigh the higher costs for transportation and storage of ammonia solution.\r\n\r\nAmmonia solution is stored in aboveground tanks that are surrounded by a concrete\r\ncontainment system. A pump dispenses ammonia solution to the emission control equipment. Other safety equipment associated with these tanks are: pressure/vacuum relief valves, liquid level alarms, two ammonia vapor scrubbers, quick fill connections, vapor recovery and associated piping, eight strategically-located ammonia vapor detectors, three emergency eyewash/shower stations, two containment sumps equipped with normally closed drain valves, and a water cannon to control ammonia vapor..\r\n\r\nAmmonia solution is delivered by truck that parks within a sloped containment area, \r\nwhich drains to a sump (unloading area sump). The solution unloading to the \r\nstorage tanks is done through a quick fill connection. A truck-mounted vapor recovery \r\nsystem is connected to the tank vapor recovery system during the unloading. The storage \r\ntanks are equipped with pressure and vacuum relief valves and the tanks are maintained at ambient temperature and atmospheric pressure.\r\n\r\nA redundant dispensing pump is placed into service when either the main pumps fails \r\nor are out of service for preventative maintenance. The tanks are equipped with remote \r\ncontrols for pump and valve operations. The loading operator is provided with a readily \r\naccessible water supply to wash spills quickly into the unloading area sump. Flashing lights alarms at the tanks and in the main control room are activated when the ammonia gas monito"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080173,
      "SummaryText": "rs detect the gas concentration above 20 parts per million (ppm) in the surroundings storage area. A second alarm at 50 ppm will initiate a system shutdown and the lock-out of the ammonia feed pumps.\r\n\r\nEmission Control\r\n\r\nAmmonia solution is pumped from storage tanks to evaporator and air mixing chamber systems for the Units. The air/water vapor/ammonia mixture is then piped to the Ammonia Injection Grid (AIG), which is located in the flue gas duct up stream of the SCR. The injection is done through an arrangement of nozzles to assure an even ammonia gas distribution throughout the flue gas. The flue gas enters the SCR bed where the catalyst promotes the reaction.\r\n\r\nSummary of the Accidental Release Prevention Program and Ammonia \r\n\r\nAccidental Release Prevention\r\n\r\nThe general LADWP accidental release prevention program is based on the following key \r\nelements:\r\n* High level of training of the operators in safe handling of chemicals.\r\n* Effective preventive maintenance program.\r\n* Use of state-of-the-art process and safety equipment.\r\n* Use of accurate and effective operating procedures, written with the participation \r\nof the operators.\r\n* Performance of a hazard review of equipment and procedures.\r\n* Implementation of an auditing and inspection program.\r\n\r\nOther specific steps to prevent accidental ammonia releases include:\r\n\r\n* The extensive training of the operators in the safe handling of ammonia, with \r\nemphasis on the hazardous and toxic properties of the chemical.\r\n* Required ammonia safe handling training of tank truck drivers from suppliers as \r\nwell as their equipment preventive maintenance program.\r\n* The installation of tank liquid levels alarm, pressure levels alarm, \r\npressure/vacuum relief valve, vapor recovery system, gas scrubbers, and \r\nammonia gas detectors around the storage area.\r\n* The installation of secondary containment system and sumps\r\n* Water cannon system to dilute and wash spilled ammonia solution into the sumps \r\nequipped with a hi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000080173,
      "SummaryText": "he ammonia process, and each employee newly assigned to this process, has been trained or tested for competence on the topics listed below that pertain to their duties.  LADWP also ensures that operators are trained in any updated or new procedures prior to startup of a process after a major change.  The LADWP employee training documentation includes training records for each employee assigned to operate or maintain the process.  The training asserts that the employee has the required knowledge, skills, and abilities to safely carry out the duties and responsibilities as provided in the operations and maintenance procedures.  The training topics include:\r\n\r\n- RMP program contents,\r\n- Aqueous ammonia safety information,\r\n- Operator training modules, including NH3 process technology/equipment and safety equipment,\r\n- Operating procedures, including delivery and unloading procedures,\r\n- Maintenance procedures,\r\n- Emergency action plan and procedures,\r\n- Incident Commander and First Responder Operations,\r\n- Hazardous materials management and DOT, and\r\n- Hazardous waste management.\r\n\r\nInitial and refresher training is provided to each employee operating the ammonia process to ensure that the employee understands and adheres to the current operating procedures of the process.  The frequency of refresher training will be at least once every three years or sooner as determined by LADWP, in consultation with the employees operating the process.\r\n\r\n\r\nMaintenance \r\n\r\nThe LADWP operates a MAXIMO System that generates a task order for performance of the preventive maintenance routine after a designated time past the closing of the previous task order for that maintenance. Description of the work to be performed is included with the printed work order.  \r\n\r\nLADWP documents inspection, testing, and maintenance of ammonia injection equipment and assures the performance is done in accordance with the recommendations of the manufacturer and industry groups.\r\n\r\nInternal Compliance Aud"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080173,
      "SummaryText": "Aqueous ammonia (ammonia) is the most commonly used substance for reducing oxides of nitrogen from the electric power generating stations. The Los Angeles Department of Water and Power (LADWP) also uses ammonia for reducing the emissions of oxides of nitrogen from its Haynes Generating Station (HNGS). Storing and handling large quantities of ammonia can create hazardous situations. LADWP prioritizes safety, as well as safe ammonia storage and handling. The LADWP Haynes Generating Station ammonia handling process is subject to the U.S. Environmental Protection Agency (EPA) Risk Management Program and Plan and also to the California Accidental Release Prevention (CalARP) Program. The facilities subject to the EPA and CalARP regulations are required to prepare and update Risk Management Plans (RMPs). The RMP is to include policies and procedures followed to safely operate the facility and the actions which will be taken by the facility in an event of an emergency. LADWP prepared and submitted the original RMP for the Haynes Generating Station in June 1999 and this submittal is the forth five-year update since the original RMP. The following information is specifically required in the \r\nRMP Update Executive Summary: \r\n\r\n* Accidental release prevention and emergency response policies.\r\n* General facility and regulated substances information.\r\n* Summary of the accidental release prevention program and chemical-specific prevention steps.\r\n* Five-year accident history summary.\r\n* Emergency response program summary.\r\n* Planned changes to improve safety.\r\n\r\nThe above information for the Haynes Generating Station is provided below.\r\n\r\nAccidental Release Prevention and Emergency Response Policies\r\n\r\nThe City of Los Angeles Department of Water and Power accidental release prevention policy involves a unified approach that integrates technologies, procedures, and \r\nmanagement practices. All applicable procedures of the California Accidental Release \r\nPrevention (CalARP) Program a"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000080173,
      "SummaryText": "its\r\n\r\nThe LADWP certifies every three years (or earlier) that compliance with Program 2 \r\nPrevention Program requirements are met and that procedures and practices developed are \r\nadequate and being followed.\r\n\r\nThe compliance audit consists of separating the RMP program elements or sections, \r\nand auditing each element to determine compliance and effectiveness. For each internal \r\naudit, the audit team completes a Compliance Audit Certification Page and a Compliance \r\nAudit Checklist. The Compliance Audit Certification Page provides process identification, the dates of the audit, team members, and certification by the audit leader and the Plant Manager. The Compliance Audit Checklist details the requirements of each RMP element and contains questions that may assist with the auditing process. The audit checklist for each element consists of the following three sections:\r\n\r\n* Records Review: A review of the RMP written Prevention Program.\r\n* On-Site Conditions: The audit team reviews the program elements based on \r\nobservation of the plant conditions and safety practices.\r\n* Interviews:  The program elements are evaluated by interviewing personnel from \r\nappropriate functions including operations, maintenance, management, and contractors.\r\n\r\nTeam members record RMP program deficiencies identified during the audit on the \r\nchecklist.\r\n\r\nIncident Investigation\r\n\r\nThe LADWP incident investigation procedures describe incident reporting, investigation, and investigation reporting steps to be followed by plant personnel.  The incident investigation is started promptly but no later than 48 hours after the event.  The \r\nLADWP promptly addresses and resolves all recommendations and implements the \r\nrecommendations in a timely manner to prevent an incident recurrence.  All incident \r\ninvestigation reports are retained on LADWP file for at least a period of five years from the date the reports are completed.\r\n\r\nFive-year Accident History Summary\r\n\r\nNo accidental releases of a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080173,
      "SummaryText": "nd U.S. Environmental Protection Agency Prevention \r\nProgram are adhered to.  \r\n\r\nThe HNGS facility is a non-responding facility, which means that the facility employees will not respond to ammonia accidental release. Instead, the facility has coordinated with local response agencies (City of Long Beach Fire Department) to respond to any ammonia release that may occur at the HNGS facility.\r\n\r\nGeneral Description of the Stationary Source and Regulated Substance\r\n\r\nHaynes Generating Station is located in Long Beach, California. The HNGS is a gas-fired electricity generating facility that supplies electrical power to the LADWP system.  The facility has three steam turbines and eight combustion turbines normally fueled by natural gas to drive electric generators. The total capacity of the plant is 1600 megawatts of electric power.  The facility is managed and operated around the clock. There is a minimum crew of ten operators and one shift supervisor.  On a normal day shift, there are approximately 187 on-site personnel including Operations, Technical, Maintenance, Clerical, and Warehouse staff.\r\n\r\nUnits 1, 2, and 9 through 16 are equipped with selective catalytic reduction (SCR) systems to control emissions of oxides of nitrogen (NOx), a combustion byproduct that is a precursor to ozone. In the presence of a catalyst housed in the SCR, ammonia (NH3) gas, a reducing agent, is injected into the flue gas to react with NOx to form nitrogen gas (N2) and water vapor (H2O) according to the following chemical reactions:\r\n      \r\n   4 NH3   +   6 NO --> 5  N2   +   6 H2O\r\n   8 NH3   +   6 NO2 -->  7  N2   +   12 H2O\r\n   \r\nAmmonia Process Description\r\n\r\nThe ammonia solution storage and supply system (ammonia process) has the function \r\nof storing and delivering ammonia for injection for NOx emissions control in Units 1, 2, and 9 through 16. The ammonia process consists of two subsystems:\r\n\r\n* Ammonia Handling and Storage.\r\n* Emission Control.\r\n\r\nAmmonia Handling and Storage\r\n\r\nT"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000080173,
      "SummaryText": "gh liquid level alarm.\r\n\r\nSafety Information\r\n\r\nComprehensive chemical data has been assembled to include regulatory reporting and \r\naction thresholds, health hazard, and chemical exposure limitations, as well as detailed \r\nphysical properties of ammonia. This information includes ammonia background \r\ninformation and SDS sheets.\r\n\r\nEquipment safety information was compiled on the ammonia process. Specifications \r\nfor the ammonia process are collected and provided in one place for easy reference. Details such as maximum intended inventory; safe upper and lower temperatures; and safe upper and lower pressures for the ammonia handling facility are on file at the facility. LADWP also has procedures in place that are triggered to update safety information if there is a major change that makes existing information inaccurate.\r\n\r\nHazard Review \r\n\r\nIn 1999, a detailed hazard review was conducted for the ammonia facility equipment \r\nand procedures. The hazard review was further reviewed in April 2004, June 2009, May 2014, and June 2019. The hazard review will be updated again within a five-year period or whenever there is major change in the process.\r\n\r\nA seismic walkthrough was performed in May 2019 based on the LEPC Region 1 \r\nguidance document, and recommendations were provided to LADWP staff for their \r\nevaluation and implementation. \r\n\r\nOperating Procedures\r\n\r\nLADWP has prepared written operating procedures for the Haynes Generating \r\nStation that provide clear instructions or steps for safely conducting activities relating to ammonia injection process. They are consistent with the ammonia safety information. Written operating procedures included in the facility Operation and Maintenance Manual include:\r\n* Delivery of Ammonia\r\n* Initial Startup Procedure\r\n* Normal Operation\r\n* Normal Shutdown\r\n* Temporary Operations\r\n* Emergency Operations\r\n* Emergency Shutdown\r\n* Startup Following Emergency Shutdown\r\n\r\nTraining \r\n\r\nLADWP ensures that each employee presently operating t"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000080173,
      "SummaryText": "mmonia gas or solution that meet the reporting \r\nrequirement of the EPAs RMP have occurred at this facility for the past five years.\r\n\r\nEmergency Response Program Summary\r\n\r\nThe HNGS facility is a non-responding facility, which means that the facility \r\nemployees will not respond to aqueous ammonia accidental release. Instead, the facility has coordinated with local response agencies to respond to any aqueous ammonia release than may occur at the HNGS facility.\r\n\r\nPlanned Changes to Improve Safety\r\n\r\nAs part of the preparation of a Risk Management Program, a hazard review was \r\nperformed in June 2019 for the ammonia handling system. The hazard review was \r\nperformed using the Hazard and Operability (HAZOP) technique and covered both \r\nequipment and procedures used for the ammonia handling system. The same hazard review will be conducted if there are any changes in the system that may have potential impacts on the environmental and nearby community."
    }
  ]
}