{
  "FacilityID": 1000027837,
  "FacilityName": "Lone Star Bakery No.1",
  "FacilityStr1": "6905 Hwy. 87 East",
  "FacilityStr2": null,
  "FacilityCity": "China Grove",
  "FacilityState": "TX",
  "FacilityZipCode": "78263",
  "Facility4DigitZipExt": "6029",
  "FacilityCountyFIPS": "48029",
  "LEPC": "Bexar County LEPC",
  "FacilityLatDecDegs": "29.391111",
  "FacilityLongDecDegs": "-098.354444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "PP",
  "FacilityURL": "www.lonestarbakery.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 8110322,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Mac S. Morris Jr. President",
  "OperatorStr1": "P.O. Box 201960",
  "OperatorStr2": null,
  "OperatorCity": "San Antonio",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78220",
  "OperatorZipCodeExt": "1862",
  "RMPContact": "Mike Brehm",
  "RMPTitle": "Chief Engineer",
  "FTE": 250,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000132019",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-01-13 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-10-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-05-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-05-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-05-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": 29.39167,
  "FRS_Long": -98.35,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000033964,
      "AltID": "ammonia refrigeration",
      "FacilityID": 1000027837,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000034226,
          "ProcessID": 1000033964,
          "NAICSCode": "311813",
          "_desc": {
            "NAICS_CODE": "311813",
            "NAICS_DESCRIPTION": "Frozen Cakes, Pies, and Other Pastries Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000041048,
          "ProcessID": 1000033964,
          "ChemicalID": 56,
          "Quantity": 29000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000541048,
          "ProcessID": 1000033964,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000027837,
      "SummaryText": "This is to inform all interested persons, including employees that Lone Star Bakery is complying with OSHA's Process Safety Management Standard (called Process Safety Management or PSM), Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA's Risk Management Program regulations (called RM Program), Title 40 CFR Part 68, to deal with the risks involved with the storage, handling, and processing of hazardous chemicals. \n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nLone Star Bakery, Plant No. 1, located in China Grove, Texas, provides refrigeration for frozen cakes, pies, and other pastries.  Lone Star Bakery's senior management is committed to maintain a safety and environmental program to promote a safe environment for all its employees and the surrounding communities.  Lone Star Bakery administers safety and environmental policies at the facility to ensure compliance with OSHA's Process Safety Management (PSM) and EPA's Risk Management Program (RMP).These programs include forklift safety, hazard communications, lockout/tagout, employee safety manuals, manufacturers documentation, and the Emergency Response Plan.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nLone Star Bakery is located at 8100 Highway 87 East, China Grove, Texas 78263.  The system was designed and constructed in accordance with all applicable federal, state, and local regulations.\n\n\n\nThe system uses 29,960 pounds of ammonia to provide refrigeration for frozen cakes, pies, and other pastries.  The majority of the system including vessels and compressors is located within facility walls.  The condensers are mounted on the roof and all of the evaporators are located in their respective freezer/cold storage areas.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe Lone Star Bakery ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000027837,
      "SummaryText": "f the system.    For example, Lone Star Bakery operates in accordance with OSHA's Process Safety Management regulation.\n\n\n\nOther safety features of the ammonia refrigeration system include: ammonia sensors that sound a facility-wide alarm, an emergency shut down button that kills power to engine room equipment, relief valves on all pressure vessels, and continuous ventilation in the engine room to prevent ammonia explosions.\n\n\n\nIn addition the facility has based its maintenance program on the industry standard: the International Institute of Ammonia Refrigeration (IIAR) guidelines.  In particular, the IIAR Bulletin 110, \"Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems is used at the facility.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\n\n\nAn investigation into Lone Star Bakery's accident history showed that there had been no reportable ammonia releases over the past five years that exceeded the Federal Reportable Quantity of 100 pounds.  In addition, there have been no injuries resulting from an ammonia release.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nLone Star Bakery has an emergency response plan in effect at the facility.  The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM document, which is maintained at the facility.  This Plan was designed to meet the following objectives:\n\n\n\n  1.)  To save lives.\n\n  2.)  To minimize and avoid injuries.\n\n  3.)  To protect the environment.\n\n  4.)  To minimize property damage.\n\n\n\nLone Star Bakery maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan will be reviewed and updated to ensure compliance with the PSM an"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000027837,
      "SummaryText": "d RMP regulations, as well as to incorporate facility changes due to the renovation of the facility.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Process Hazard Analysis (PHA) performed on December 11, 2003, generated mitigation measures (recommendations) to improve safety at the Lone Star Bakery facility located at 8100 Highway 87 East, China Grove, Texas 78263.  The Lone Star Bakery safety committee has completed several items, including the recommendations, in a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n\n\n1. Continue to train all employees in Process Safety Management and the facility Safety Plan/Programs.\n\n\n\n2. Continue to have employee involvement in Safety Plan Development.\n\n\n\n3. Continue employee involvement through safety team participation.\n\n\n\n4. Continue internal and external safety audits/inspections and implement changes as needed."
    }
  ]
}