{
  "FacilityID": 1000059079,
  "FacilityName": "Royce W. Simpson Water Treatment Plant",
  "FacilityStr1": "800 Water Plant Road",
  "FacilityStr2": null,
  "FacilityCity": "Decatur",
  "FacilityState": "TX",
  "FacilityZipCode": "76234",
  "Facility4DigitZipExt": "0478",
  "FacilityCountyFIPS": "48497",
  "LEPC": "Wise County LEPC",
  "FacilityLatDecDegs": "33.232900",
  "FacilityLongDecDegs": "-097.622600",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "The City of Decatur, Texas",
  "OperatorStr1": "P.O. Box 1299",
  "OperatorStr2": "201 East Walnut Street",
  "OperatorCity": "Decatur",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76234",
  "OperatorZipCodeExt": "1299",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000188307",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-02-27 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-08-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-08-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-08-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-08-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 33.2329,
  "FRS_Long": -97.6226,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "12000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000073687,
      "AltID": "Municipal Water Treatment",
      "FacilityID": 1000059079,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000090974,
          "ProcessID": 1000073687,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000074849,
          "ProcessID": 1000073687,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000046249,
              "Process_NAICS_ID": 1000074849,
              "SafetyReviewDate": "2016-03-22 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2016-03-22 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-03-22 00:00:00",
              "TrainingReviewDate": "2016-03-22 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-03-22 00:00:00",
              "EquipmentInspectionDate": "2016-07-11 00:00:00",
              "EquipmentTested": "Chlorine storage containers and injection system",
              "ComplianceAuditDate": "2016-03-22 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000047075,
                  "PreventionProgram2ID": 1000046249,
                  "ProcessChemicalID": 1000090974
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000059079,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2016-03-22 00:00:00",
    "ERTrainingDate": "2016-03-22 00:00:00",
    "CoordinatingAgencyName": "Decatur Fire Department",
    "CoordinatingAgencyPhone": "9406271500",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000059079,
      "SummaryText": "der.  In the event of a chlorine injection line or connection break, the equipment automatically and immediately detects the loss of vacuum and shuts down the flow of chlorine from the cylinder.  With this feature, the amount of chlorine released to the atmosphere is limited to the small amount contained in the injection tubing at the time of the failure.\r\n\r\nThe chlorine injection equipment is housed in a structure that is provided with a continuous chlorine release detection system.  In the event of a release, the detector will sound a loud, audible alarm to alert plant operators of a chlorine release within the injection building.\r\n\r\nFIVE-YEAR ACCIDENT HISTORY\r\n\r\nThe City of Decatur Water Plant has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there have been no accidental releases during this period.\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\nThe City of Decatur Water Plant features a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\r\n\r\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\r\n\r\nThe site emergency plan is coordinated with and verified by the Wise County Local Emergency Planning Committee (LEPC)and a newly organized City of Decatur Emergency Management Plan.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nThe City of Decatur Water Plant chlorine storage and injection facilities were recently upgraded using state-of-the-art equipment."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000059079,
      "SummaryText": "ws of compliance with various regulations and standards; and\r\n\r\n- In the unlikely event of their occurrence, all incidents, unsafe conditions, or other near-misses are promptly and thoroughly investigated by a qualified team to determine their cause and to implement corrective actions to ensure that the condition will not reoccur.\r\n\r\nCHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nThe chlorine system is designed to meet current design standards for chlorine storage and handling systems.  A Hazard Review was conducted to verify design and operational safety, and to identify the potential for safety enhancements.  The analysis included the delivery and connection of chlorine containers, as well as the storage and injection systems and operating practices.\r\n\r\nThe chlorine system is subjected to regular inspection and maintenance to ensure its ongoing integrity.  As part of regular duties of the operations staff, the chlorine vessels and injection equipment, piping, and injection system are visually inspected to ensure that no undue hazards are present.  The chlorine containers are periodically subjected to testing by the chlorine supplier to verify their integrity.\r\n\r\nProtection of the chlorine storage system includes a completely fenced operating area with a controlled access gate to the entrance to the facility.  Only site employees are allowed access to the area.  The delivery of chlorine containers is strictly managed and controlled.  Container delivery vehicles are secured, and trained delivery staff use container-specific equipment to place the containers into position.  The delivery operation is constantly manned by a trained individual who can immediately respond to any abnormal conditions that may occur during delivery or connection to the injection system.\r\n\r\nChlorine injection systems utilize industry-specific equipment with built in release mitigation features.  At the point of mixing with the water side stream, a vacuum is created to draw chlorine gas from the cylin"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000059079,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nWe at the Royce W. Simpson Water Treatment Plant (City of Decatur Water Plant) are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, we are completely coordinated with the Decatur Fire Department who provides highly trained emergency response personnel to control and mitigate the effects of the release.\r\n\r\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\r\n\r\nThe City of Decatur Water Plant is located in Decatur, Texas.  The facility's primary activity is the treatment of surface water and delivery of treated, potable water to the city for public use.\r\n\r\nThe only regulated substance present at our facility is chlorine.  Chlorine is used for biological treatment of surface water for public use.  The maximum capacity of chlorine at our facility is 4,000 pounds.  Gaseous chlorine is drawn from one of two ton-containers and mixed with a side stream of untreated water, and the side stream is then returned to the water plant facility.  The rate of chlorine addition is adjusted based on measurements of residual chlorine at the discharge of the water treatment facility.\r\n\r\nThe facility is classified under North American Industry Classification System (NAICS) code 22131, and is not subject to OSHAAA¿s 29 CFR 1910.119, the Process Safety Management standard.  This set of conditions dictates Prevention Program Level 2 applicability under the RMP regulation. \r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\r\n\r\nOur facility has taken all the necessary steps to comply with the accidental release preven"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000059079,
      "SummaryText": "tion requirements put forth by EPAAA¿s 40 CFR Part 68, the Risk Management Program (RMP) regulation.  This facility was designed in accordance with applicable codes and standards, and is operated per manufacturerAA¿s recommendations which are based on current industry standards.  The facility is also subject to EPCRA Section 302 notification requirements.    \r\n\r\nThe Decatur Water Plant implements management systems and practices that meet or exceed RMP Level 2 Prevention Program requirements.  These requirements are defined according to the following elements:\r\n\r\n- Safety information;\r\n\r\n- Hazard review;\r\n\r\n- Operating procedures;\r\n\r\n- Training;\r\n\r\n- Maintenance;\r\n\r\n- Compliance audits; and\r\n\r\n- Incident investigation.\r\n\r\nThe requirements of these elements are met or exceeded through implementation of safety procedures and safety management systems.  These programs are embodied in written documentation as well as continual training and awareness programs to reinforce the importance of facility safety.  Highlights of these policies and procedures are as follows:\r\n\r\n- Information regarding chemical and other hazards is incorporated into site training programs, is well understood, and continually reinforced with employees and contractors;\r\n\r\n- The chlorine system is subjected to periodic hazard reviews to identify hazards, safeguards, and opportunities for improved chlorine risk management;\r\n\r\n- Operations of all aspects of the facility are controlled through written procedures which are arranged to ensure the safe operation of the plant, including steps needed to control hazards in the event of abnormal conditions;\r\n\r\n- All personnel involved with operating or maintaining the facility are thoroughly trained and qualified; \r\n\r\n- Equipment throughout the facility is subjected to continual inspection, testing, and maintenance to ensure the continual functionality of equipment and safety support systems;\r\n\r\n- The facility conducts regular safety inspections and self-revie"
    }
  ]
}