{
  "FacilityID": 1000021596,
  "FacilityName": "OMNOVA Solutions Inc - Green Bay Facility",
  "FacilityStr1": "1701 Cornell Road",
  "FacilityStr2": null,
  "FacilityCity": "Green Bay",
  "FacilityState": "WI",
  "FacilityZipCode": "54313",
  "Facility4DigitZipExt": "8934",
  "FacilityCountyFIPS": "55009",
  "LEPC": "Brown County LEPC",
  "FacilityLatDecDegs": "44.588889",
  "FacilityLongDecDegs": "-088.072778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PP",
  "FacilityURL": "www.omnova.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 784667826,
  "ParentCompanyName": "OMNOVA Solutions Inc.",
  "Company2Name": null,
  "CompanyDUNS": 88498618,
  "Company2DUNS": 0,
  "OperatorName": "OMNOVA Solutions Inc",
  "OperatorStr1": "175 Ghent Road",
  "OperatorStr2": null,
  "OperatorCity": "Fairlawn",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44333",
  "OperatorZipCodeExt": "3300",
  "RMPContact": "Bill Verhasselt",
  "RMPTitle": "Director of Operations",
  "FTE": 55,
  "OtherEPAFacilityID": "54313GNCRP1701",
  "EPAFacilityID": "100000095121",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-08-19 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-05-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-05-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-05-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-05-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 44.58778,
  "FRS_Long": -88.06935,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000026184,
      "AltID": "Latex Manufacturing",
      "FacilityID": 1000021596,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000026546,
          "ProcessID": 1000026184,
          "NAICSCode": "32521",
          "_desc": {
            "NAICS_CODE": "32521",
            "NAICS_DESCRIPTION": "Resin and Synthetic Rubber Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000031128,
          "ProcessID": 1000026184,
          "ChemicalID": 120,
          "Quantity": 230000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 120,
            "ChemicalName": "1,3-Butadiene",
            "CASNumber": "106-99-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000031129,
          "ProcessID": 1000026184,
          "ChemicalID": 25,
          "Quantity": 300000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 25,
            "ChemicalName": "Acrylonitrile  [2-Propenenitrile]",
            "CASNumber": "107-13-1",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000031130,
          "ProcessID": 1000026184,
          "ChemicalID": 57,
          "Quantity": 67000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000531128,
          "ProcessID": 1000026184,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000531129,
          "ProcessID": 1000026184,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000531130,
          "ProcessID": 1000026184,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000021596,
      "SummaryText": "This document was prepared as part of the Risk Management Program (\"RMP\") of the Green Bay Performance Chemicals Plant of OMNOVA Solutions Inc.  The RMP conforms to the legal requirements established by the U.S. Environmental Protection Agency (\"EPA\").  The purpose of the RMP plan is to:\n\n--Describe existing safety systems at the Green Bay Performance Chemicals Plant designed to protect employees, the community, the environment, and plant process.\n--Comply with applicable environmental laws and EPA regulations (Section 112r of the Clean Air Act Amendments of 1990 and Title 40, Part 68 of the Code of Federal Regulations).\n\nThe following executive summary presents an overview of the OMNOVA Solutions Green Bay Performance Chemicals Plant's accident prevention and emergency response programs.\n\nOMNOVA SOLUTIONS' COMMITMENT TO SAFETY:\n\nOMNOVA Solutions and its Green Bay Performance Chemicals Plant are and always have been committed to safe operations as their number one priority since the Company began the early design of the Green Bay Plant in 1991, and startup in 1993.  The commitment begins with qualified people and is reflected in all levels of the operation.  All employees at the Green Bay Performance Chemicals Plant are given the training, tools, and empowerment to perform their part of the operation in a safe manner.  Strict operational controls are in place to ensure safety from the conceptual stage through product development, manufacturing, handling and storage, and delivery to customers.  The Green Bay Performance Chemicals Plant has a staff of highly qualified safety and environmental professionals, engineers, and security personnel to assure implementation of, and an ongoing commitment to, the highest standards of safe process management.  Their experience and professional competence have resulted in many years of safe operation which consistently exceed industry averages.\n\nDESCRIPTION OF REGULATED PROCESS:\n\nThe Green Bay Performance Chemicals Plant produces "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000021596,
      "SummaryText": "synthetic styrene-butadiene and styrene-butadiene-acrylonitrile polymer products used mainly in the paper and textile industries.  The RMP-regulated substances used to manufacture these products are 1,3-butadiene (CAS 106-99-0), acrylonitrile (CAS 107-13-1), and 29% ammonium hydroxide solution (CAS 7664-41-7 for ammonia).  Acrylonitrile and 29% ammonium hydroxide solution are the regulated toxic substances on site; and 1,3-butadiene is the only regulated flammable substance on site.  Finished products are non-hazardous and are in the form of a low-viscosity, milky-white liquid emulsion.  \n\n5-YEAR ACCIDENT HISTORY:\n\nThe EPA regulations require regulated facilities to provide information about all accidents in the last 5 years involving an RMP regulated substance if the accident resulted in (1) death, injury according to the RMP definition, or significant property damage on site, or (2) known deaths, injuries, property or environmental damage off site.  The Green Bay Performance Chemicals Plant had no accidents meeting this regulatory definition in the last five years. \n\nHAZARD ASSESSMENTS:\n\nEPA regulations, Process Safety Management requirements under the Occupational Safety and Health Administration (\"OSHA\"), and the Responsible Care Management System Initiative of the American Chemical Council require the Green Bay Performance Chemicals Plant to conduct Hazard Assessments of the regulated process.  EPA regulations specifically require offsite consequence analyses in the form of worst-case scenarios and alternative release scenarios for certain regulated substances. \n\nOMNOVA Solutions remains concerned that these worst-case scenarios required to be disclosed under the regulations may overstate the risk of a worst-case release.  For example, the EPA-published look-up tables do not take any local physical conditions into account.  An alternative to the look-up tables (allowed by the regulation) is to calculate release scenarios based upon recognized risk analysis tech"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000021596,
      "SummaryText": "niques, or models.  Limited consideration of local conditions is used in the models within strict EPA guidelines.  Accordingly, OMNOVA Solutions used one of the EPA-recognized models in preparing its release scenarios.  While these models may be more accurate than the look-up tables, they can still result in highly improbable and, in some cases, physically impossible risk scenarios.  For example, neither look-up tables nor the models allow consideration of existing active safety devices, such as sprinkler or deluge systems, which can reduce the severity of an accidental release.  The models also increase the number of specific data points examined and, thus, present the most accurate information possible using all required inputs. \n\nOMNOVA Solutions has also prepared alternative release scenarios which it believes are more accurate predictions of potential accidental releases from the Green Bay Performance Chemicals Plant.  Alternative release scenarios are, by definition, more likely to occur than worst-case scenarios but they are still very improbable due to engineering and administrative controls in place at the Green Bay Performance Chemicals Plant. \n\nWORST-CASE AND ALTERNATIVE RELEASE SCENARIOS:\n\nDescriptions of the worst-case and alternative release scenarios have been removed from this Executive Summary consistent with the requirements at 40 CFR 68.155, as amended on April 9, 2004 (69 FR 18819).\n\nACCIDENTAL RELEASE PREVENTION PROGRAM:\n\nOMNOVA Solutions began a formal Process Safety Management Program at the Green Bay Performance Chemicals Plant in 1992 before our initial startup as a new facility when OSHA promulgated regulations at 29 CFR 1910.119.  The effectiveness of the Process Safety Management Program, in conjunction with high-quality engineering design, employee safety programs, Responsible Care implementation, EPA's RMP requirements, and emergency response programs make up the OMNOVA Solutions' Accidental Release Prevention Program.  Safety systems i"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000021596,
      "SummaryText": "n place at the Green Bay Performance Chemicals Plant include combustible gas sensors and alarms, automatic controls, automatic shutdown systems, deluge water systems, secondary containment dikes and vaults, and employees specially trained in chemical handling and emergency response.\n\nEMERGENCY RESPONSE PLAN:\n\nOMNOVA Solutions' overall safety efforts at the Green Bay Performance Chemicals Plant consist of measures to prevent the release of hazardous materials, as well as programs to mitigate the effects of an actual release.  The Green Bay Performance Chemicals Plant has a trained and properly equipped team of volunteer emergency responders capable of handling most foreseeable emergency situations.  Importantly, coordination with local safety forces is a key element of the emergency response planning process.  Specific plans are in place to respond to chemical emergencies within the Green Bay Performance Chemicals Plant.\n\nPLANNED CHANGES TO IMPROVE SAFETY:\n\nIntrinsic safety is a key element in the design of all process equipment at OMNOVA Solutions' Green Bay Performance Chemicals Plant.  All covered process equipment designs and modifications are subject to formal Process Hazards Analysis procedures.  During a Process Hazards Analysis, recommendations are made for the improvement of the process.  In addition, formal accident and incident investigation procedures are in place so that causes of even the smallest failures are identified and corrected.\n"
    }
  ]
}