{
  "FacilityID": 1000081673,
  "FacilityName": "Chemtrade Solutions LLC - Syracuse",
  "FacilityStr1": "1421 Willis Ave",
  "FacilityStr2": null,
  "FacilityCity": "Syracuse",
  "FacilityState": "NY",
  "FacilityZipCode": "13204",
  "Facility4DigitZipExt": "1051",
  "FacilityCountyFIPS": "36067",
  "LEPC": "Onondaga County LEPC",
  "FacilityLatDecDegs": "43.062167",
  "FacilityLongDecDegs": "-076.199500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.chemtradelogistics.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 151503281,
  "ParentCompanyName": "Chemtrade Solutions LLC",
  "Company2Name": null,
  "CompanyDUNS": 790024636,
  "Company2DUNS": 0,
  "OperatorName": "Chemtrade Solutions LLC",
  "OperatorStr1": "1421 Willis Ave",
  "OperatorStr2": null,
  "OperatorCity": "Syracuse",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13204",
  "OperatorZipCodeExt": "1051",
  "RMPContact": "Robert Bishop",
  "RMPTitle": "Plant Manager",
  "FTE": 33,
  "OtherEPAFacilityID": "110000325620",
  "EPAFacilityID": "100000095764",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "7313200009",
  "SafetyInspectionDate": "2019-05-29 00:00:00",
  "SafetyInspectionBy": "RMP Inspection",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-10-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-08-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-08-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-08-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 43.06211,
  "FRS_Long": -76.19896,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000102057,
      "AltID": "Ammonia",
      "FacilityID": 1000081673,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000103338,
          "ProcessID": 1000102057,
          "NAICSCode": "32518",
          "_desc": {
            "NAICS_CODE": "32518",
            "NAICS_DESCRIPTION": "Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000127917,
          "ProcessID": 1000102057,
          "ChemicalID": 56,
          "Quantity": 510000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000627917,
          "ProcessID": 1000102057,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000081673,
      "SummaryText": "Executive Summary\n\n\n\nThis Risk Management Plan (RMP) update is submitted by Chemtrade Solutions, LLC. Syracuse Works in compliance with the requirements of section 112(r)(7) of the Clean Air Act (CAA) and was prepared in accordance with United States Environmental Protection Agency (USEPA) regulations contained in 40 CFR Part 68, Accidental Release Prevention Provisions.  This update will serve as the facility's five-year update as required in 40 CFR Part 68.190.\n\n\n\nAt Chemtrade Solutions, LLC. Syracuse Works, one listed chemical, Anhydrous Ammonia, is managed on-site in quantities greater than the threshold quantity under the program level 3 criteria (according to applicability thresholds listed in 40 CFR Part 68.10). No chemicals are managed on-site under program level 1 or program level 2 criteria.\n\n\n\nThis RMP executive summary describes Syracuse Work's risk management program which includes a release prevention program and an emergency response program.  The release prevention and emergency response programs at this site were developed based on requirements from the CAA's Accidental Release Prevention Provisions as well as OSHA's Process Safety Management standard (29 CFR 1910.119). \n\n\n\n* Section 1.0 - Accidental Release Prevention and Emergency Response Policies\n\n* Section 2.0 - Description of Stationary Source and Regulated Substances \n\n* Section 3.0 - General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\n* Section 4.0 - Five Year Accident History\n\n* Section 5.0 - Emergency Response Program \n\n* Section 6.0 - Planned Changes to Improve Safety\n\n\n\n1.0  Accidental Release Prevention and Emergency Response Policies\n\n\n\nChemtrade Solutions, LLC. recognizes that the responsible management of health, safety and the environment in and around its facilities is a key element in its successful business plan. Chemtrade Solutions, LLC. is committed to implementing policies and procedures which confirm that its operations are conducted in c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000081673,
      "SummaryText": "ompliance with applicable laws and regulations.  Achieving responsible health, safety and environmental management will be accomplished by: operating our facilities safely and prudently; assessing and mitigating environmental risks; seeking ways to minimize or reuse wastes; and complying fully with all applicable local, state, and federal laws and regulations.  Our policy is to implement reasonable controls to prevent and/or mitigate foreseeable releases of regulated substances.\n\n\n\n2.0  Description of Stationary Source and Regulated Substances\n\n\n\nChemtrade Solutions, LLC. Syracuse Works manufactures Sodium Nitrite.  The process of producing Sodium Nitrite requires Anhydrous Ammonia to be used as a raw material. Sodium Nitrite has a broad range of applications.  For example, it is used as a corrosion inhibitor, and a meat-curing agent.  It is also used in the production of textile dyes, rubber compounds, and charcoal briquettes.\n\n \n\nAnhydrous Ammonia is received by the Syracuse facility as a pressurized liquid in rail cars and tank trucks and is unloaded into two storage tanks.\n\n\n\n3.0  General Accidental Release Prevention Programs and Chemical - Specific Prevention Steps \n\n\n\nChemtrade Solutions, LLC. maintains a comprehensive release prevention program designed to prevent accidental releases and foster safe operations of our processes.  The accidental release prevention program implemented at Syracuse Works includes procedures and practices which address each of the required elements of the risk management program including:\n\n\n\n* Process Safety Information - Information relating to the hazards of the chemical(s), process technology and equipment information is maintained to ensure proper operation.  This information includes: P&IDs, Safety Data Sheets, equipment specifications, operating limits, etc.  \n\n\n\n* Process Hazard Analysis - Processes are routinely analyzed to identify and correct potential hazards, as well as increase the safety of the operating conditions."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000081673,
      "SummaryText": "  A third party is engaged to assist Chemtrade Solutions, LLC. with the completion of Process Hazard Analysis.  \n\n\n\n* Standard Operating Procedures - Detailed procedures are in place identifying actions necessary for multiple phases of operation, operating limits and safety considerations.\n\n\n\n* Training - Employees are trained to facilitate proper operation of the plant.  Instruction takes place in the classroom as well as on the job.  Safety training is conducted annually or at other appropriate intervals. \n\n\n\n* Mechanical Integrity - Equipment is routinely inspected and maintenance activities are managed in a manner to maintain the integrity of the equipment. The mechanical integrity program identifies the schedule for inspecting and testing critical equipment and controls.  Records of equipment inspections and testing is maintained on paper and/ electronically.  \n\n\n\n* Management of Change - Process parameters are maintained through a management of change system which documents the changes as well as evaluates changes for safety.\n\n\n\n* Pre-startup Safety Review - Significant changes to affected processes are evaluated in order to verify that the proper procedures for engineering, operations, emergency response and overall safety are addressed prior to start-up.\n\n\n\n* Compliance Audits - At three-year intervals, a third party is engaged to assist Chemtrade Solutions, LLC. with audits to verify compliance with 40 CFR Part 68.  Results of compliance audits are summarized in a report, including findings and recommendations.  \n\n\n\n* Incident Investigation - All incidents involving releases are investigated to identify root cause and corrective actions to prevent re-occurrence.\n\n\n\n* Employee Participation - Employees at multiple levels are involved in key roles of the release prevention program.  Employees may be involved in incident investigations, Process Hazard Analysis, SOP updating, etc.  \n\n\n\n* Safe Works Practices - Standard safety practices are in place to help prom"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000081673,
      "SummaryText": "ote worker safety including lockout/tagout procedures, control of entry into process areas, line breaking procedures, confined space entry procedures and hot work procedures.\n\n\n\n* Contractor Safety - Contractors are evaluated and trained prior to performing work on affected processes to reduce the potential of an incident. \n\n\n\n* Emergency Response - The facility maintains a written emergency response plan, employees are trained as to their roles under this plan, and the plan is periodically tested including participation with outside emergency response officials, when possible.  \n\n \n\nIn addition to the above accidental release prevention program, Chemtrade Solutions, LLC. Syracuse Works has taken additional chemical-specific prevention steps designed to perform the following: \n\n\n\n* quickly detect a release of Anhydrous Ammonia; \n\n* contain or control a release of Anhydrous Ammonia;\n\n* and/or, reduce the consequences of a release of Anhydrous Ammonia.\n\n\n\nThe following types of safety features are used in the process:\n\n\n\nRelease Detection\n\n\n\n* Process temperature and pressure controls\n\n\n\n* Area release detection systems with alarms \n\n\n\n* Operator surveillance of process areas \n\n\n\nRelease Containment and Control\n\n\n\n* Pressure relief devices on pressurized storage units and process vessels\n\n\n\n* Secondary containment around storage tanks\n\n\n\n* Check valves on unloading systems \n\n\n\n* Automatic and manual shutdown systems on process and unloading equipment\n\n\n\nRelease Mitigation\n\n\n\n* Emergency shutdown procedures\n\n\n\n* Fire suppression and extinguishing systems\n\n\n\n* Deluge system \n\n\n\n* Notification procedures for plant personnel and local officials\n\n\n\n* Emergency Response plans \n\n\n\n4.0  Five Year Accident History\n\n\n\nDue to proactive actions taken to prevent accidents and the strong safety culture developed by Chemtrade Solutions, LLC. Syracuse Works, there have been no incidents in the past 5 years that meet the reporting requirements for the USEPA's Accidental Release Preven"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000081673,
      "SummaryText": "tion Provisions.\n\n\n\n5.0  Emergency Response Program\n\n\n\nChemtrade Solutions, LLC. Syracuse Works maintains an integrated contingency plan which consolidates all of the various federal, state and local regulatory requirements for emergency response planning.  Our program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, we coordinate our program with the Onondaga County Local Emergency Planning Committee (LEPC).  Syracuse Works, the LEPC and local fire departments have coordinated communication to notify the public quickly, if necessary, as well as facilitate quick response to an incident.\n\n\n\n6.0  Planned Changes to Improve Safety\n\n\n\nChemtrade Solutions, LLC. Syracuse Works performs periodic process hazard analyses and RMP audits.  The findings and recommendations from these activities provides a framework for developing and implementing corrective action plans to improve safety systems.\n\n"
    }
  ]
}