{
  "FacilityID": 1000073546,
  "FacilityName": "Wilbur-Ellis Company LLC (Denton, KS)",
  "FacilityStr1": "12730 334th Road",
  "FacilityStr2": null,
  "FacilityCity": "Huron",
  "FacilityState": "KS",
  "FacilityZipCode": "66041",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20005",
  "LEPC": "Atchison LEPC",
  "FacilityLatDecDegs": "39.652586",
  "FacilityLongDecDegs": "-095.285681",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "http://www.wilburellis.com",
  "FacilityEmailAddress": "EHSS@WILBURELLIS.COM",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Wilbur-Ellis Company LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Wilbur-Ellis Company LLC",
  "OperatorStr1": "P.O.  Box 66",
  "OperatorStr2": null,
  "OperatorCity": "Troy",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66087",
  "OperatorZipCodeExt": null,
  "RMPContact": "Curtis Windmeyer",
  "RMPTitle": "Operations Manager",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000177177",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-01-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Advanced Agronomics",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-10-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-10-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-10-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-11-13 00:00:00",
  "DeRegistrationEffectiveDate": "2020-11-01 00:00:00",
  "AnniversaryDate": "2023-10-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 39.65233,
  "FRS_Long": -95.28575,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) STANDARD POSITION (SA OFF)",
  "HorizontalAccMeasure": "60",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000091788,
      "AltID": "Storage & Transfer",
      "FacilityID": 1000073546,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000093010,
          "ProcessID": 1000091788,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000114687,
          "ProcessID": 1000091788,
          "ChemicalID": 56,
          "Quantity": 170000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000614687,
          "ProcessID": 1000091788,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000073546,
      "SummaryText": "Executive Summary\n\n\n\nThe Plan describes procedures implemented by Wilbur-Ellis Company, Agribusiness Division (\"Wilbur-Ellis\") to prevent accidental releases of ammonia that could cause harm to the public and the environment from short-term exposures.  The Plan includes an analysis of the potential offsite consequences of an accidental release, a five-year accident history, and a release prevention and emergency response program.\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nWilbur-Ellis has implemented release prevention and emergency response procedures to minimize the potential for accidental releases of hazardous materials.  Emergency response procedures including evacuation procedures and notification procedures have been implemented by Wilbur-Ellis.  In addition, Wilbur-Ellis has developed operating procedures and preventative maintenance activities to reduce the likelihood of accidental releases.\n\n\n\nThis Plan and the emergency response procedures document the accidental release prevention, safety, and emergency policies in place at Wilbur-Ellis.\n\n\n\nDescription of Stationary Source and Regulated Substances\n\n\n\nWilbur-Ellis is located at 12730 334th Road in Huron, Kansas (the \"facility\").  Wilbur-Ellis is a retailer of fertilizer in the form of anhydrous ammonia stored under pressure.  There are two anhydrous ammonia storage tanks located at the facility with maximum capacities of approximately 18,000 gallons each.  The anhydrous ammonia is transferred from the storage tanks into 1,000 gallon nurse tanks.  A maximum total of 28 nurse tanks containing anhydrous ammonia are stored at the facility at any given time.  The contents of the nurse tanks are sold to the local farming community for use as fertilizer.  \n\n\n\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\n  \n\nWilbur-Ellis has developed and implemented this Plan with the objective of complying with the requirements and guidelines set forth by the Fed"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000073546,
      "SummaryText": "eral Risk Management Plan program.  The Plan's purpose is to enhance the facility's existing safety programs implemented at the site to reduce the possibility of accidental releases of anhydrous ammonia that could cause harm to employees, the public and the environment.  The emergency response program, documented in the emergency response procedures, includes accidental release prevention and chemical specific prevention steps.\n\n\n\nWilbur-Ellis ensures that equipment meets the appropriate industry standards prior to use.  Wilbur-Ellis implements operating procedures and maintenance procedures, in accordance with manufacturer and industry specifications, to prevent accidental releases at the facility.  Chemical specific prevention steps implemented at the site include excess flow valves, pressure relief valves.  Emergency shut off valves with cables that run along the length of the horizontal storage tanks for quick access, and ammonia training for personnel.\n\n \n\nFive-Year Accident History\n\n\n\nThere have been no qualifying accidents involving ammonia in the five-year period prior to the completion of this Plan.\n\n\n\nEmergency Action Program\n\n\n\nEach Wilbur-Ellis branch has an Emergency Action Plan (EAP), maintained on-site, that describes the actions to be taken in the event of an accidental release.   The facility is not equipped to responds to an accidental release of NH3 or ammonia therefore, employees are trained to call 911 in the event of an emergency, including an accidental release.  Response efforts are coordinated with the local emergency response agency.\n\n\n\nBecause the facility is not equipped to respond in the event of an accidental release, the covered processes at the facility should be incorporated into the Local Emergency Response Plan (LERP) prepared under the Emergency Planning and Community Right-To-Know Act (EPCRA).   The facility shall coordinate response efforts with the Local Emergency Planning Committee (LEPC), if available, and the Local Emergency"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000073546,
      "SummaryText": " HazMat Response Team.   Emergency response coordination with local agencies should be documented on the LEPC and Emergency Responder Site Visit Form. \n\n\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nTo improve the safety of ammonia and all other aspects of operations, Wilbur-Ellis has implemented a comprehensive, risk-based safety management process to help guide employees to improved safety performance.  The safety management process, branded Guiding People to Safety (GPS), is designed to be implemented in four steps, step one comprising of the foundational and fundamental elements of a strong safety program and positive safety culture.\n\n\n\nThe GPS process provides guidelines for each safety program that describe methods for effective implementation. The GPS program includes measures for tracking progress and success and for addressing opportunities for improvement within the process and individual safety programs.  These measures include action tracking software to facilitate timely corrections of deficiencies and recommended improvements identified during inspections, audits, and hazard analyses.\n\n\n\nWilbur-Ellis is committed to preventing incidents cultivating a positive safety culture throughout the company.   The mission of our Environmental Health, Safety and Security (EHSS) team is to drive effective results in reducing incidents and employee injuries by combining the GPS process with a positive safety culture.  \n\n"
    }
  ]
}