{
  "FacilityID": 1000079627,
  "FacilityName": "Shell Catalysts &Technologies",
  "FacilityStr1": "2840 Willow Pass Road",
  "FacilityStr2": null,
  "FacilityCity": "Bay Point",
  "FacilityState": "CA",
  "FacilityZipCode": "94565",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06013",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "38.028333",
  "FacilityLongDecDegs": "-121.943056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 186283909,
  "ParentCompanyName": "Shell",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dave Schofield",
  "OperatorStr1": "P.O. Box 5159",
  "OperatorStr2": null,
  "OperatorCity": "Bay Point",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94565",
  "OperatorZipCodeExt": null,
  "RMPContact": "Eric Brink",
  "RMPTitle": "Environmental Manager",
  "FTE": 65,
  "OtherEPAFacilityID": "94564CRTRN2850W",
  "EPAFacilityID": "100000111032",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "A0227",
  "SafetyInspectionDate": "2018-11-01 00:00:00",
  "SafetyInspectionBy": "Contra Costa County Health Services - Haz Mat Div",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-05-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-05-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-05-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-05-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.02688,
  "FRS_Long": -121.94337,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000099349,
      "AltID": "Aqueous Ammonia AST",
      "FacilityID": 1000079627,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000100594,
          "ProcessID": 1000099349,
          "NAICSCode": "32518",
          "_desc": {
            "NAICS_CODE": "32518",
            "NAICS_DESCRIPTION": "Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000124518,
          "ProcessID": 1000099349,
          "ChemicalID": 57,
          "Quantity": 160000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000624518,
          "ProcessID": 1000099349,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079627,
      "SummaryText": "This document presents the five-year update for the EPA Risk Management Plan (RMP) dated June 2014. This is also an update of the April 2017 Cal-ARP document presented to the Contra Costa County Health Services Department (CCCHSD), for the Shell Catalysts & Technologies Pittsburg facility located at 2840 Willow Pass Road in Bay Point, California. Shell Catalysts & Technologies Pittsburg qualifies for Program Level 1 under the Environmental Protection Agency (EPA) RMP and Cal-ARP regulations.\n\n\n\nThis RMP update summarizes the accidental release prevention and emergency response policies at Shell Catalysts & Technologies Pittsburg that minimize the public's exposure to regulated substances used at the facility.  \n\n\n\n\n\n1.1 ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES \n\n\n\nSince Shell Catalysts & Technologies Pittsburg is ISO 9001 certified, several programs are in place to maintain the safe operation, installation, and modification of process equipment at the facility, and to minimize errors and accidents. Shell is committed to being a responsible member of the community by operating in a safe and environmentally sound manner. This commitment is documented in the company's policy on health, security, safety and environmental (HSSE) performance.  Included in this policy are statements that Shell companies are committed to: \n\n  \n\n?    Pursue the goal of no harm to people\n\n?    Protect the environment\n\n?    Use material and energy efficiently to provide our products and services;\n\n?    Respect our neighbors and contribute to the societies in which we operate;\n\n?    Develop energy resources, products and services consistent with these aims;\n\n?    Publicly report on our performance;\n\n?    Play a leading role in promoting best practice in our industries;\n\n?    Manage HSSE matters as any other critical business activity; and\n\n?    Promote a culture in which all Shell employees share this commitment.\n\n\n\nIn this way we aim to have an HSSE performance we can be proud of, to earn the confid"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079627,
      "SummaryText": "ence of customers, shareholders and society at large, to be a good neighbor and to contribute to sustainable development.\n\n\n\n    We believe that every Shell Company:\n\n?    Has a systematic approach to HSSE management designed to ensure compliance with the law and to achieve continuous performance improvement;\n\n?    Sets targets for improvement and measures, appraises and reports performance;\n\n?    Requires contractors to manage HSSE in line with this policy;\n\n?    Requires joint ventures under its operational control to apply this policy, and uses itsinfluence to promote it in its other ventures;\n\n?    Engages effectively with neighbors and impacted communities; and\n\n?    Includes HSSE performance in the appraisal of staff and rewards accordingly.\n\n    \n\nThe HSSE Management System is designed to ensure compliance with the law and to achieve continuous performance improvement.\n\n     \n\nThe HSSE policy is implemented through Shell's Management System which is designed to identify and manage risk. Although the Pittsburg facility is not subject to California's Occupational Safety and Health Administration (OSHA) Process Safety Management requirements, Shell has developed several similar procedures to protect the health and safety of their workers, the public, and the environment. The following summarizes portions of the Management System that are most closely aligned with OSHA's Process Safety Management requirements:\n\n    \n\n    Management of Change\n\n    \n\nShell has a Management of Change (MOC) procedure requiring a comprehensive review of all proposed process changes prior to implementation. Projects including installation of new equipment must be evaluated by the appropriate department managers (e.g., technical, operations, maintenance, safety, and environmental). Written documentation of department approvals, hazard evaluation, changes in process and instrumentation drawings (P&IDs), and operating procedures are maintained. \n\n    \n\n    Pre-Startup Safety Review\n\n    \n\nAs part of the MOC process, Shell requires t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079627,
      "SummaryText": "hat new or modified equipment meet all design requirements prior to operation. This review includes updating P&IDs, employee/contractor training, documenting operating/maintenance/safety/emergency procedures, environmental permits, chemical information (including safety data sheets [SDS]), and information on technology/equipment.\n\n    \n\n        Contractors\n\n    \n\nShell's contractor management program requires HSSE review of each contractor. All contractors are required to complete training on the hazards and emergency response activities at the facility prior to starting work. Contractor activities are monitored to verify safe work practices and appropriate training. \n\n    \n\n    Safety Work Permits/Hot Work Permits/Confined Space Permits \n\n    \n\n    All equipment installation and maintenance work requires use of a work permit process, including issuance of safety work permits for general work permits, hot work permits, and confined space permits when applicable. Each Safety Work Permit identifies the work to be performed, equipment involved, precautions to be taken, dates, and authorized signatures. For Hot Work Permits, fire prevention measures are also included. Shell staffs a confined space rescue team which must be present during confined space entries. Copies of all permits are maintained.\n\n    \n\n    Training\n\n    \n\nTo ensure that processes are operated by competent individuals, training is a key component of Shell's Management System. Initial training is given to employees at the time of hire. Subsequent training is given when there has been a change to relevant systems. On-the-job-training qualification is required for each operator. \n\n    \n\n    Incident Investigation\n\n    \n\nEach HSSE incident or near-miss incident involving an RMP/CalARP material is analyzed and evaluated to determine the underlying cause(s). A Root Cause Analysis (RCA) is conducted and appropriate corrective actions to prevent recurrence are determined.  Risk analysis is used to prioritize established actions, and records are"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000079627,
      "SummaryText": " maintained to track these actions to completion.\n\n    \n\n    Process Safety Information\n\n    \n\nShell maintains copies of all SDS for all raw materials and substances used at the facility. A list of maximum inventory and largest container sizes for all regulated substances is maintained. SDS and inventory data is updated as necessary. SDS are maintained electronically on the network drive to allow access to all employees and also with two hard copies (Guard Shack and HSSE Department). Inventory information (i.e., Business Plan) is maintained at the HSSE Department. \n\n    \n\n    Process Hazard Review/Hazard Control Sheets\n\n    \n\nAs part of the Management of Change procedures at the facility, safety and operating hazards are evaluated for new or modified equipment. Appropriate personnel involved with the equipment operation, maintenance and safety participate in the hazard review which are documented on Hazard Control Sheets. The review is designed to identify the hazards of the process, possible equipment failures, and safeguards to prevent failures or errors. Results of the hazard review, along with any design changes identified as a result of the hazard review, are incorporated into the project.\n\n    \n\n    Operating Procedures\n\n    \n\nWritten procedures for aqueous ammonia and other bulk liquids are located in the H2 Plant Operating Procedures. Procedures include handling, off-loading, and tank line-up for ammonia service.\n\n    \n\n    Maintenance\n\n    \n\nShell has a preventive maintenance/inspection program established for process equipment and tanks. Ultrasonic thickness (UT) testing is conducted on the AST on a regular basis. The passive mitigation vapor suppression balls are evaluated annually and replaced if necessary. Criterion's maintenance department conducts preventive maintenance to assure mechanical integrity of the AST and associated pumps. \n\n    \n\n    Compliance Audits\n\n    \n\nCriterion's Management System includes a compliance auditing component made up of internal compliance audits, as well as externa"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000079627,
      "SummaryText": "l assessments by Shell's parent organization. HSSE performance compliance issues are documented and require prompt follow up with action plans to prevent reoccurrence.\n\n    \n\n    Emergency Procedures\n\n    \n\nEmergency procedures have been established at this facility. These include response and management of any accidental release and/or injury that may pose an impact to the community. These procedures are included in the Hazardous Material Business Plan (HMBP) submission annually. In 2015, the site established a fully functioning Hazardous Material Emergency Response Team and is now a \"responding facility\". Emergency response activities for RMP/CalARP and other hazardous materials may be handled internally with the Shell Emergency Response Team or can be coordinated with the Contra Costa County Hazardous Material Team or the San Ramon Valley Hazardous Material Team. Emergency response activities for medical, rescue and other emergencies are coordinated with Contra Costa Fire Department, located two blocks from the facility.\n\n    \n\n"
    }
  ]
}