{
  "FacilityID": 1000012557,
  "FacilityName": "Domtar Maine LLC",
  "FacilityStr1": "144 Main Street",
  "FacilityStr2": null,
  "FacilityCity": "Baileyville",
  "FacilityState": "ME",
  "FacilityZipCode": "04694",
  "Facility4DigitZipExt": "9656",
  "FacilityCountyFIPS": "23029",
  "LEPC": "Washington County LEPC",
  "FacilityLatDecDegs": "45.156944",
  "FacilityLongDecDegs": "-067.402500",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "www.domtar.com",
  "FacilityEmailAddress": "jay.beaudoin@domtar.com",
  "FacilityDUNS": 128561235,
  "ParentCompanyName": "Domtar, Corporation",
  "Company2Name": null,
  "CompanyDUNS": 202169744,
  "Company2DUNS": null,
  "OperatorName": "Domtar Maine LLC",
  "OperatorStr1": "144 Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Baileyville",
  "OperatorStateFIPS": "ME",
  "OperatorZipCode": "04694",
  "OperatorZipCodeExt": "9656",
  "FTE": 308,
  "OtherEPAFacilityID": "04694GRGPCMILLA",
  "EPAFacilityID": "100000110505",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "A-215-70-A-I",
  "SafetyInspectionDate": "2008-12-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2010-02-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-02-19 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2010-02-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2018-12-21 00:00:00",
  "DeRegistrationEffectiveDate": "2018-12-15 00:00:00",
  "AnniversaryDate": "2015-02-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 45.156894,
  "FRS_Long": -67.402006,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000015620,
      "AltID": "Chlorine Dioxide System",
      "FacilityID": 1000012557,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000018382,
          "ProcessID": 1000015620,
          "ChemicalID": 71,
          "Quantity": 41100.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000016004,
          "ProcessID": 1000015620,
          "NAICSCode": "32211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000012798,
              "Process_NAICS_ID": 1000016004,
              "SafetyReviewDate": "2009-03-12 00:00:00",
              "PHA_Date": "2009-03-12 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-10-27 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "ClO2 Generator relief hatch",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Sumps, sewers, drains, etc.",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Each crew should use explosion proof flashlights",
              "OpProceduresReviewDate": "2009-09-08 00:00:00",
              "TrainingReviewDate": "2009-10-05 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-09-29 00:00:00",
              "EquipmentInspectionDate": "2009-12-22 00:00:00",
              "EquipmentTested": "ClO2 process equipment",
              "ChangeMgmtDate": "2010-01-11 00:00:00",
              "ChangeMgmtReviewDate": "2009-03-12 00:00:00",
              "PreStartupReviewDate": "2010-01-11 00:00:00",
              "ComplianceAuditDate": "2007-12-07 00:00:00",
              "AuditCompletionDate": "2009-04-03 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-08-01 00:00:00",
              "HotWorkPermitReviewDate": "2009-12-18 00:00:00",
              "ContractorSafetyReviewDate": "2008-02-29 00:00:00",
              "ContractorSafetyEvalDate": "2007-08-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000015300,
                  "PreventionProgram3ID": 1000012798,
                  "ProcessChemicalID": 1000018382
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000012557,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-11-12 00:00:00",
    "ERTrainingDate": "2008-10-09 00:00:00",
    "CoordinatingAgencyName": "Washington County LEPC",
    "CoordinatingAgencyPhone": "8004327303",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000012557,
      "SummaryText": "1.  Executive Summary\n\nDomtar Maine LLC (Woodland Mill) is a Kraft Market pulp manufacturing facility, located at 144 Main Street, Baileyville, Washington County, Maine. The facility employees approximately 308 people, producing approximately 1,250 tons/day of bleached hardwood pulp.\n\nThe Woodland Mill is committed to operating in a manner that is safe for our workers, the public, and the environment. As part of this commitment, the company has established a system to help ensure safe operation of the hazardous chemical processes at this facility. One component of this system is a Risk Management Program (RMP) that helps manage the risks at the facility and addresses compliance with the requirements of the Environmental Protection Agency's (EPA) Regulation 40 CFR 68, Accidental Release Prevention Requirements: Risk Management Program (the RMP Rule). One of the requirements of the RMP Rule is to submit a Risk Management Plan (RMPlan) describing the Risk Management Program at the Woodland Mill in Baileyville. This document is intended to satisfy the RMPlan requirements of the RMP Rule and to provide the public with a description of the Risk Management Program established at the facility.\n\nThe Risk Management Program at the facility consists of four elements:\n\n1.\tA hazard assessment to help understand (a) the potential off-site consequences of a  hypothetical accidental release and (b) accidents that may have occurred during the last five years associated with the use of the substance regulated by the RMP Rule (chlorine dioxide) - see topic 1.3\n\n2.\tA prevention program to help maintain and safely operate the processes containing more than the threshold quantity of the regulated substance (covered processes) - see topic 1.5\n\n3.\tAn emergency response program to help respond to accidental releases of the regulated substances from the covered processes - see topic 1.7\n\n4.\tA management system that delineates responsibility for implementing and maintaining the Risk Managemen"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000012557,
      "SummaryText": "facility. The facility requires that the contractor supervisors train each of their employees who will work on or near a covered process before that employee begins work at the site. The facility periodically reviews contractors' training documents and work performance to ensure that safe practices are followed.\n\n7.\tPre-startup Safety Reviews: The Woodland Mill performs a safety review of new or modified equipment in the covered process before the process is placed into service to help ensure that the process has been prepared to operate safely. This review confirms that:\n\no\tConstruction and equipment are in accordance with design specifications.\n\no\tAdequate safety, operating, maintenance, and emergency procedures are in place.\n\no\tEmployee training has been completed.\n\no\tFor a covered process, a PHA has been performed if the process is new or management of change requirements have been completed if an existing process has been modified.\n\nA pre-startup safety review checklist is completed to document the review and to ensure that the appropriate issues have been addressed.\n\n8.\tMechanical Integrity: The Woodland Mill maintains the mechanical integrity of the covered process equipment to help prevent equipment failures that could endanger workers, the public, or the environment. The facility mechanical integrity program includes (1) an inspection and testing program to help identify equipment deterioration and damage before the equipment fails and (2) a quality assurance program to help ensure that new and replacement equipment meets the design standards required for service in the mill's covered processes. The facility mechanical integrity program also includes:\n\no\tSpecifications for inspection and testing of process equipment\n\no\tSpecifications for replacement parts and equipment\n\no\tStandard maintenance procedures for inspecting, testing, and maintaining process equipment\n\no\tProcedures for safe work practices, such as lockout/tag out, hot work, and confined space entr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000012557,
      "SummaryText": "t Program - see topic 1.8\n\nInformation further describing these elements is provided in this plan.\n\nAlthough the Risk Management Program at the facility helps provide assurance that the facility is maintained and operated in a safe manner, it is only one component of the safety program at the Woodland Mill. \n\nIn fact, the facility has a comprehensive safety program in place establishing many levels of safeguards that are designed to minimize the potential for the release of any hazardous substance and injuries and damage resulting from the release of a hazardous substance.\n\nThe Woodland Mill minimizes the potential releases of the hazardous substances used at the facility. When hazardous substances are used at the facility, the equipment is carefully designed, engineered, built, and operated to reduce the possibility of an accidental release. Industry and government standards are closely adhered to in design, construction, and operation of the equipment. In addition to equipment design, operating procedures and training are established for each covered process, to further minimize the risk of any accidental release. \n\nThe Woodland Mill limits damage from a release, if such a release occurs. The facility trains workers to respond to upset conditions, reducing the consequences of a release if it occurs. In addition, the facility has coordinated efforts with the Local Municipalities (Baileyville) to help ensure that the community is well aware of and prepared for, emergency response in case an accidental release does occur.\n\nThe safety program at the Woodland Mill consists of a number of elements, only some of which are required by the RMP Rule. This RMPlan is primarily intended to describe those parts of the safety program at the facility that are required by the RMP Rule.\n\n\n1.1   Accidental Release Prevention and Emergency Response Policies\n\nThe Woodland Mill is committed to the safety of workers and the public, as well as the preservation of the environment through"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000012557,
      "SummaryText": "the prevention of accidental releases of hazardous substances. The facility has installed State-Of-The-Art CLO2 Emergency Shut Down controls to prevent foreseeable releases of the hazardous substances.\n\nThe prevention of accidental releases at the Woodland Mill is accomplished by utilizing an Occupational Safety and Health Administration (OSHA) Process Safety Management program. The PSM program consists of a series of policies that address the safe operation and control of the covered processes. PSM policies and procedures help ensure safety in design, installation, operation, and maintenance of the covered process, including training programs with personnel (Mill employees and contractors).\n\nIn the event of an accidental release, the facility will control and contain the release to the maximum extent possible. This will be performed in a manner that will be safe for workers and will help minimize affects to the public and/or the environment.\n\nThe Woodland Mill has developed an Emergency Response Plan.  This plan consolidates State and Federal emergency response requirements.  Response training for facility personnel is provided to properly manage upset conditions.  Also, personnel are available to oversee response activities for each type of incident, and coordinate response efforts with the local emergency response organization.\n\nIn order to effectively implement the policies, the facility has established a management system directed by the General Manager.\n\n\n1.2   The Woodland Mill. and Our Regulated Substance\n\nThe Woodland Mill uses a Kraft chemical pulping process to convert hardwood chips into approximately 1,250 tons/day of high quality bleached pulp. Pulp bleaching is accomplished with utilization of Chlorine Dioxide Solution. The Chlorine Dioxide System includes the generation (production), storage and delivery of chlorine dioxide. The process starts with the ClO2 generation and ends at the point of injection in the Bleach Plant. \n\nThe ClO2 solution produce"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000012557,
      "SummaryText": "d is stored in two identical storage tanks, each with a capacity of 176,000 gallons. The quantity of ClO2 stored in each tank, based on a maximum concentration of 14 grams per liter (g/l) (1.4% by weight), is 20,550 pounds (lbs). Because each tank contains ClO2 in an amount greater than the threshold quantity (1,000 lbs), both tanks are covered by the RMP Rule. Chlorine Dioxide is considered a Program Level 3 process.\n\n\n1.3   Omitted Off-site Consequence Analysis\n\n\n1.4.   Administrative Controls & Mitigation Measures:\n\n1.4.1.  Chlorine Dioxide Process:\n\nThe existing Chlorine Dioxide Solution System process came on line in July 1998. The process was all designed to control and retain accidental releases within the process area (ClO2 Plant Building).\n\nThe bottom floor of the ClO2 Building is provided with sumps, which are connected with the mill's wastewater treatment system. Each floor of the building, and outside area of the tanks has ClO2 gas detectors. These detectors are activated when the ClO2 concentration is approximately 1 part per million (ppm) at the surrounding area.\n\nThe two storage tanks are located half inside, and half outside of the ClO2 Building. All pipes, valves, and process lines are located inside of the building.\n\nFor the worst-case scenario, loss of the entire contents of one storage tank in 10 minutes, the tank, area layout and elevation were designed to avoid the formation of a liquid pool of ClO2. The ClO2 released will flow to the closest process sewer manhole and will be neutralized in the wastewater treatment system. The ClO2 process is also equipped with remotely activated shut-off valves, which will be activated in case of an accidental release.\n\nThere are also specific operating procedures for control and operation of the process, as per the PSM requirement. The establishment of these procedures will minimize the quantity released if a chlorine dioxide accidental release does occur.\n\n\n1.5   Accidental Release Prevention Program\n\nThe Wo"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000012557,
      "SummaryText": "odland Mill has used a prevention program to help prevent accidental releases of hazardous substances. The facility formalized this prevention program for the Chlorine Dioxide Solution System to comply with the 14 elements of the OSHA's PSM prevention program. In 1996, the EPA RMP Rule established that a Program Level 3 Prevention Program would become a requirement for these processes as well. The facility's Program Level 3 Prevention Program under the RMP Rule is essentially the same as the OSHA PSM Program, except that the program also focuses on protecting the public and the environment. \n\n1.5.1  The following sections briefly describe the elements of the Woodland Mill's Program Level 3 Prevention Program that address the EPA RMP Rule prevention program requirements for the Chlorine Dioxide Solution System.\n\n1.\tEmployee Participation: The facility has developed a written employee participation program for the covered process to help ensure that the safety concerns of the Woodland Mill's employees are addressed. The facility encourages active participation from personnel in the development and maintenance of the prevention program activities for all processes at the facility. Employees are consulted on, and informed about, all aspects of the RMP Rule prevention program, including the development of Process Hazard Analysis and Operating Procedures.\n\n2.\tProcess Safety Information: The facility maintains a variety of technical documents that are used to help ensure the safe operation of the processes. The documents address (1) the hazards of the chemicals used in the process, (2) the technical data of the process, and (3) the design basis and configurations of the equipment used in the processes. The facility ensures that this process safety information is maintained, accurate, and available to all Woodland Mill employees, and the LEPC. All of the information and documentation for the RMP Prevention Program is maintained at the facility.\n\nMaterial safety data sheets"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000012557,
      "SummaryText": "(MSDSs) document the physical and chemical properties of the hazardous substances handled at the facility, including non-regulated substances in the covered process. MSDS's for hazardous substances handled in each process are available in the control rooms and electronically so the operators have ready reference to this information. In addition, MSDS's are provided to the LEPC and/or Plant Emergency Response teams for use in helping formulate emergency response plans.\n\nMany of the operating parameters are included in the technical information to help with the safe operation of the process. These documents are also used (1) to train employees, (2) to perform process hazard analysis, and (3) to help maintain the equipment to the design specification.\n\n3.\tProcess Hazard Analysis: The Woodland Mill performs and periodically updates process hazard analyses (PHAs) of the covered processes to help identify process hazards and generate recommendations that might improve the safe operation of the process. A team composed of personnel with engineering and process operating experience and a team leader with experience in performing process hazard analyses is assembled to analyze the process. The facility primarily uses the Hazard and Operability (HAZOP) and/or What If technique, supplemented with a checklist, to perform this analysis. The PHA team prepares a written report describing the results of the analysis, including recommendations. Responsibility for resolving the recommendations is assigned to personnel and, when appropriate, changes to enhance the safety of the process are implemented.\n\n4.\tOperating Procedures: Operators, supervisors, and engineers work together to develop and maintain accurate operating procedures to define how tasks related to process operations should be safely performed. The operating procedures (1) are used to train employees and (2) serve as reference guides for appropriate actions to take during both normal operations and upset operating co"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000012557,
      "SummaryText": "nditions. The operating procedures include:\n\no\tSteps for safely conducting activities\n\no\tApplicable process safety information, such as safe operating limits and consequences of process deviations\n\no\tSafety and health considerations, such as chemical hazards, personal protective equipment requirements, and actions to take if exposure to a hazardous substance occurs\n\nThe facility personnel develop and maintain operating procedures that cover all phases of the operations, including initial start up, normal operations, normal shutdown, emergency shutdown, start-up following a standby condition or emergency shutdown, and temporary operations. The facility reviews and certifies the operating procedures annually.\n\n5.\tTraining:   Employees are trained to safely and effectively perform their assigned tasks. The facility training program for process operators includes both the initial training and refresher training that covers (1) a general overview of the process, (2) the properties and hazards of the substance in the process, and (3) a detailed review of the process operating procedures and safe work practices. Written tests and oral reviews are used to verify that the employee understands the training materials before the employee can operate the process.\n\nThe operators are consulted annually about the frequency of the training and the materials to be used for the training. Recommendations from the operators are reviewed and changes to the training are implemented as appropriate.\n\n6.\tContractors: A program has been established to help ensure that contractor activities at the facility are performed in a safe manner. The program reviews the safety record of all contractors to help ensure that the facility only hires contractors who can safely perform the desired job tasks. Mill personnel explain to the contract supervisors the hazards of the process on which they and their employees will work, the facility safe work practices, and the emergency response procedures for the"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000012557,
      "SummaryText": "y\n\no\tTraining of maintenance personnel\n\no\tDocumentation of maintenance activity\n\n9.  Hot Work Permit: The Woodland Mill has established a hot work permit program to control spark or flame- producing activities that could result in fires or explosions in covered processes at the facility. The facility reviewed OSHA's fire prevention and protection requirements in 29 CFR 1910.252(a) and created a Hot Work Permit form to comply with these requirements. Personnel who are to perform hot work are required to fill out the Hot Work Permit form. The supervisor reviews the completed form before work can be initiated.\n\n10. Management of Change: The Woodland Mill's Management Of Change program evaluates and approves all proposed changes to chemicals, equipment, and procedures for a covered process to help ensure that the change does not negatively affect safe operations. Process changes that are determined to be replacements in kind are allowed without completing a management of change form. All other changes must be confirmed through the full management of change program to help ensure that inadvertent consequences of the process changes are prevented, safety consequences of the changes are addressed, affected process safety information and operating procedures are updated, and affected employees are notified of the changes.\n\n11. Incident Investigations: The Woodland Mill investigates all incidents that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  The Mill also investigates all incidents that have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented. The facility trains employees to identify and report any incident requiring investigation. An incident investigation team is assembled, and the investigation is initiated within 48 hours of the incident. The results of the inve"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000012557,
      "SummaryText": "stigations are documented, recommendations are resolved, and appropriate process enhancements are implemented. \n12. Compliance Audits: The Woodland Mill audits the covered processes to be certain that the facility's prevention program is effectively addressing the safety issues of the operations. The facility assembles an audit team that includes personnel knowledgeable in the PSM/RMP Rule and in the process, and this team evaluates whether the prevention program satisfies the requirements of the PSM/RMP Rule, and also whether the prevention program is sufficient to help ensure safe operations of the process. The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n\n\n1.5.2   Chemical-specific Prevention Steps\n\nIn addition to the required prevention program elements, The Woodland Mill has implemented safety features specific to the Chlorine Dioxide Solution System. Chlorine Dioxide is produced at the facility and stored as a diluted aqueous solution to avoid the necessity of transporting large quantities of the solution. Chlorine dioxide is produced in the chlorine dioxide generator and piped to an absorber column, where as high as 14.0-gram-per-liter strength in solution is absorbed.\n\n1.6    Five - Year Accident History\n\nThere have been no accidents in the past five years from the chlorine dioxide process that resulted in deaths, injuries, or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n1.7   Emergency Response Program\n\nThe Woodland Mill has established a written Emergency Response Program. \n\nThis plan includes the following procedures:\n\no\tInforming the local response organizations and the public about accidental releases that could reasonably result in off-site consequences\n\no\tProviding proper first aid and emergency medical treatment to treat accidental human exposure to hazar"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000012557,
      "SummaryText": "dous substances at the facility\n\no\tControlling and containing accidental releases of hazardous substances, including the use of emergency response equipment\n\no\tInspecting and maintaining emergency response equipment\n\no\tReviewing and updating the Emergency Response Plan\n\nAlso, the plan describes post incident analysis, where procedures and systems are reviewed to determine if all appropriate steps were taken and if future incidents can be prevented and/or managed more efficiently.\n\nThe facility maintains an emergency response team. Specific training is provided to covered process operational employees, facility emergency responders and to outside local emergency responders, as part of the Woodland Mill / State of Maine Department of Environmental Protection mutual aid agreement.\n\nAll the facility personnel are trained in evacuation procedures. The facility periodically conducts emergency response drills, which are coordinated with local emergency responders, and local and state authorities. \n\nThe written Emergency Response Plan complies with other federal contingency plan regulations and is communicated to local emergency response officials. The facility maintains a regular dialogue with the local emergency response organizations and provides appropriate information to them.\n\n1.8   RMP Management System\n\nThe Woodland Mill has established and maintains a management system that assigns responsibility for specific elements of the program. These elements include preparation and maintenance of the hazard assessment, accident prevention program (including OSHA PSM), and emergency response plan; RMPlan preparation and submittal; and communication. This system ensures that the Mill's employees work as a responsible and accountable team, ensuring that the Mill operates in a safe and reliable manner, protecting workers, the community and the environment."
    }
  ]
}