{
  "FacilityID": 1000041570,
  "FacilityName": "Arch Chemicals, Inc.--Rochester, N.Y. Facility",
  "FacilityStr1": "100 McKee Road",
  "FacilityStr2": null,
  "FacilityCity": "Rochester",
  "FacilityState": "NY",
  "FacilityZipCode": "14611",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36055",
  "LEPC": "Monroe County LEPC",
  "FacilityLatDecDegs": "43.153056",
  "FacilityLongDecDegs": "-077.666944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "P1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.archchemicals.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 2220804,
  "ParentCompanyName": "Arch Chemicals, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1643170,
  "Company2DUNS": 0,
  "OperatorName": "Arch Chemicals, Inc.",
  "OperatorStr1": "100 McKee Road",
  "OperatorStr2": null,
  "OperatorCity": "Rochester",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14611",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gregory Barnard",
  "RMPTitle": "Director, Operations",
  "FTE": 168,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000108821",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-05-25 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-10-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 43.15306,
  "FRS_Long": -77.66694,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000051208,
      "AltID": "Chlorine Handling",
      "FacilityID": 1000041570,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000051712,
          "ProcessID": 1000051208,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000062097,
          "ProcessID": 1000051208,
          "ChemicalID": 62,
          "Quantity": 360000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000562097,
          "ProcessID": 1000051208,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000041570,
      "SummaryText": "The Arch Chemicals, Inc. Rochester, N.Y. (Arch) facility is committed to operating and maintaining its processes in a safe and responsible manner. This is done by a combination of employee training, accidental release prevention programs, and emergency response planning programs to help ensure the safety of our employees and the public along with the environment. This summary provides a brief overview of the comprehensive risk management activities that Arch has designed and implemented and includes:\n\n\n\n   + A brief description of the facility and use of substances regulated by the EPA Risk Management regulation.\n\n   + An overview of the worst case release and alternate case release scenarios required by the rule.\n\n   + An overview of the site's accidental release prevention programs.\n\n   + The five year accident history for the facility.\n\n   + An overview of the plant emergency response program.\n\n   + An overview of planned improvements at the facility to minimize the number and severity of release incidents.\n\n   + Certification of the executive summary and risk management plan.\n\n\n\nDESCRIPTION OF FACILITY\n\n\n\nThe Arch Rochester facility produces biocides, personal care intermediates, and specialty chemical products.  The biocide products are ingredients in anti-dandruff shampoos, marine and anti-foulant paints, coatings, etc. They are also used to prevent formation of mold and mildew in wall board.  Personal care intermediate products are utilized in various lotions and creams. Specialty chemical products are used in pharmaceutical, paint, coatings, and other products. The Arch Rochester facility has been in operation since 1950, and it operates 24 hours per day seven days per week 365 days per year.  The facility is ISO 9000 and SOCMA certified.\n\n\n\nWORST CASE AND ALTERNATE CASE RELEASE SCENARIOS\n\n\n\nThe EPA Risk Management regulation requires that each facility subject to the rule provide a worst case release scenario for toxic and flammable chemicals and an alterna"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000041570,
      "SummaryText": "te release scenario for each toxic chemical handled.  The Arch Rochester facility handles one toxic chemical, chlorine, regulated by the EPA risk management regulation.  Chlorine is used as a raw material and is received in 90 ton railcars.  The maximum inventory of chlorine on site would be approximately 360,000 pounds. Arch does not handle any of the EPA listed flammable chemicals.\n\n\n\nFollowing are the worst case and alternate release scenarios for chlorine at the Arch Rochester facility.\n\n\n\nWORST CASE\n\n\n\nAs required by the EPA Risk Management regulation, the worst case is presumed to be a release from the largest vessel or container. For this site, the largest vessel is the railcar that the chlorine is received in.  Thus, using the assumptions required by the rule, the worst case release would be 180,000 pounds of chlorine released to air in a 10 minute period with a wind speed of 1.5m/sec.  \n\n\n\nArch has implemented many safety layers to ensure that such an out right failure of a railcar should not occur.  Examples include:\n\n\n\n   +Substantial construction of chlorine railcars per ASTM codes.\n\n   +Regular preventive maintainance of chlorine railcars and ancillary equipment.\n\n   +Excess flow valves installed on each car to minimize a release.\n\n   +Chlorine monitors in chlorine handling areas to give early warning of a releas.e\n\n   +Written operating procedures for handling and unloading railcars.\n\n   +Highly trained/certified operators that perform handling operations.\n\n\n\nALTERNATE RELEASE\n\n\n\nThe alternate release of chlorine assumes a leak and subsequent vaporization of chlorine from the 2-chloropyridine manufacturing process.  Therefore, the alternate release would be the entire contents of the chlorine process piping system released due to a piping or gasket failure.  This incident would result in a release of approximately 667 pounds of chlorine with the assumption that it would take eight minutes for the operator to be alerted by the chlorine monitor system an"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000041570,
      "SummaryText": "d to shut off the emergency shut off valve on the chlorine railcar.\n\n\n\nTo minimize the possibility of such a release, the facility has implemented the following:\n\n\n\n   +Written operating procedures and highly trained/certified operators.\n\n   +Routine preventative maintainance and equipment inspection.s\n\n   +Installation of chlorine monitors in area for early warning of a release.\n\n   +Routine safety and emergency response drills.\n\n   +Closely working with Monroe County LEPC to plan emergency response.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\n\n\nThe Arch Rochester facility takes a systematic and proactive approach to preventing accidental releases of hazardous chemicals.  The management systems address each of the key features of a successful prevention program, which includes the following:\n\n\n\n   +Process safety information\n\n   +Process hazard analysis\n\n   +Written operating procedures\n\n   +Operator training\n\n   +Mechanical integrity\n\n   +Management of change\n\n   +Pre-startup hazard reviews\n\n   +Compliance audits\n\n   +Incident investigation and root cause analysis\n\n   +Employee participation\n\n   +Hot work permit system\n\n   +Contractor safety qualification/evaluation\n\n\n\nIn addition to the above measures, the facility conducts thorough cross functional process hazard reviews on a step wise basis from the process conception in research all the way to the plant operating phase.  Introduction of a new chemical manufacturing process requires qualification/certification of both the physical plant and human factors/elements.  High standards are maintained throughout each stage to insure compliance with all applicable safety and environmental regulations.  This certification process is known as \" Safety in Engineering, Technology, Constuction, and Operations or the \"SETCO\" process.\n\n\n\nAll of these elements work together to prevent accidents when handling chemicals. Arch is committed to provide a safe work place for its employees and a safe environment for its neighbors. Arch"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000041570,
      "SummaryText": " has committed to a management system that minimizes the possiblities of a chemical release.  There is also a \"Vision of Zero\" initiative with the goal of achieving zero incidents of any kind--- zero injuries, zero accidental releases of chemicals, zero impact on its neighbors.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThe Arch Rochester facility has had no chemical release incidents of risk management regulated chemicals that resulted in on site deaths, injuries, or significant property damage or had any off site impact in this five year period.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe facility maintains a comprehensive emergency response plan that is coordinated with the Monroe County emergency response plan.  The site's plan provides essential planning and training for effectively protecting the employees, the public, and the environment on an ongoing basis and during emergencies.  \n\n\n\nPLANNED SAFETY IMPROVEMENTS\n\n\n\nThe Arch Rochester facility is committed to the continual improvement of its safety and environmental programs and to the achievement of the \"Vision of Zero\".  \n\n\n\n   +Enhanced incident investigation and root cause analysis/drill down and specific corrective actions to prevent reoccurance of any safety or environmental incident.\n\n   +Reporting, tracking near miss incidents and investigation/corrective actions for serious events.\n\n   +Increased physical observation/behavioral based safety observations to eliminate at risk employee and contractor behaviors.\n\n   +Enhanced contractor safety qualification/performance evaluation.\n\n\n\nCERTIFICATION\n\n\n\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information provided in this Risk Management Plan is true, accurate, and complete.\n\n\n\nSignature: James Bentinck-Smith\n\nTitle: Plant Manager\n\nDate: June 13, 2014"
    }
  ]
}