{
  "FacilityID": 1000061621,
  "FacilityName": "Milton Hub",
  "FacilityStr1": "14703 Hwy 80",
  "FacilityStr2": null,
  "FacilityCity": "Karnes City",
  "FacilityState": "TX",
  "FacilityZipCode": "78118",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48255",
  "LEPC": "Karnes County LEPC",
  "FacilityLatDecDegs": "29.063976",
  "FacilityLongDecDegs": "-097.79892",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": "www.eogresources.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "EOG Resources, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 186830733,
  "Company2DUNS": 0,
  "OperatorName": "EOG Resources, Inc.",
  "OperatorStr1": "P.O. Box 592929",
  "OperatorStr2": null,
  "OperatorCity": "San Antonio",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78259",
  "OperatorZipCodeExt": "0196",
  "RMPContact": "Billy Kimbro",
  "RMPTitle": "Facilities Superintendent",
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000215279",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-06-05 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-01-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-12-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-12-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-12-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000077171,
      "AltID": "Natural Gas Liquids Extra",
      "FacilityID": 1000061621,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000078349,
          "ProcessID": 1000077171,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000095826,
          "ProcessID": 1000077171,
          "ChemicalID": 118,
          "Quantity": 124176.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000095827,
          "ProcessID": 1000077171,
          "ChemicalID": 125,
          "Quantity": 44132.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000095828,
          "ProcessID": 1000077171,
          "ChemicalID": 107,
          "Quantity": 36534.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 107,
            "ChemicalName": "Isobutane  [Propane, 2-methyl]",
            "CASNumber": "75-28-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000095829,
          "ProcessID": 1000077171,
          "ChemicalID": 115,
          "Quantity": 35509.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 115,
            "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
            "CASNumber": "78-78-4",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000595826,
          "ProcessID": 1000077171,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000595827,
          "ProcessID": 1000077171,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000595828,
          "ProcessID": 1000077171,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000595829,
          "ProcessID": 1000077171,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000061621,
      "SummaryText": "Executive Summary\n\nEOG Resources, Inc. \n\nMilton Hub\n\n\n\n\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\n\n\nEOG Resources has a longstanding commitment to public welfare and worker safety.  EOG addresses accidental release prevention through four factors:  design, training, operating parameters and regular maintenance.  Through design efforts, we have limited the public exposure.  Through training, we have prepared our personnel to respond effectively.  Limiting the operating parameters reduces the stress on process equipment.  And regular maintenance serves to prolong equipment life as well as discover potential problems before they become a safety issue.\n\n\n\nShould an accidental release of a regulated substance occur, EOG personnel will evaluate the  conditions, take actions within their capabilities to minimize the risk and notify the appropriate outside agencies.\n\n\n\nFACILITY BACKGROUND INFORMATION\n\n\n\nThe Milton Hub is located in a rural area in Karnes County, Texas.  This facility is a natural gas dew point control plant with condensate stabilization utilizing fixed and skid mounted processing equipment as well as liquid storage tanks. \n\n\n\nMarplot indicates that there is no population within the area affected by the worst case scenario and no residential housing units.  However, there is other light industrial and agricultural activities conducted within the area defined by the worst case scenario endpoint.\n\n\n\nThere are no public receptors within the area of the alternate release scenario. Additionally, there are no environmental receptors in either the worst case scenario or the alternate release scenario area.\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM \n\nThe referenced process at the Milton Hub is regulated under both the Environmental Protection Agency's (EPA) Risk Management Plan (RMP)) and the Occupational Safety and Health Administration's (OSHA) Process Safety Management (PSM) standards.  Since the scope of these two programs encompass much of th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000061621,
      "SummaryText": "e same material, we have presented the pertinent information following the outline establish in the PSM program.\n\n\n\nEmployee Participation\n\n\n\nEmployee participation is mandated by the corporate PSM manual.  In response to this mandate the Milton Hub has:\n\n 1.  Created a matrix of required employee participation.\n\n 2.  Posted information for employee participation in the Control Room.\n\n 3.  Reported the finding for PHAs, Compliance Audits and incident investigations during regularly scheduled Safety Meetings.\n\n 4.  Directly involved employees in the establishment of maintenance and operating procedures.\n\n 5.  Sought input for training, both in subject matter and timing from employees.\n\n 6.  Trained all employees in the Management of Change (MOC) process.\n\n 7.  Included employee input in the Process Safety Information (PSI).\n\n 8.  Included employees with appropriate knowledge in the Process Hazard Analysis (PHA).\n\n 9.  Made all information associated with Accident Prevention available to all employees at the facility.\n\n\n\nThe Milton Hub actively encourages employee participation in all aspects of operation and safety.  The result is a more invested group of personnel and an ever increasing accident prevention awareness.\n\n\n\nProcess Safety Information\n\n\n\nThe Milton Hub maintains a variety of information used to analyze the steps necessary to ensure the safe operation of the process.  This information includes:\n\n 1.  Inventories of regulated chemicals.\n\n 2.  Data on chemical properties and associated release and exposure hazards and appropriate responses.\n\n 3.  Piping and Instrumentation Diagrams.\n\n 4.  Relief and vent system studies and designs.\n\n 5.  Process design as well as operating parameters and limits.\n\n 6.  Safety interlocks.\n\n 7.  Information on equipment design, materials, ratings and testing.\n\n 8.  Electrical equipment class and ratings.\n\n 9.  Maintenance history and records.\n\n10.  Historical operating records.\n\n\n\nMilton Hub then uses this information to asses"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000061621,
      "SummaryText": "s potential hazards, modify maintenance steps and frequency, adjust operating procedures, change process and equipment functioning limits as well as alter safety requirements necessary to ensure the effectiveness of the accident prevention program.\n\n\n\nProcess Hazard Analysis (PHA)\n\n\n\nThe Milton Hub uses the Process Hazard Analysis (PHA) findings to improve operating procedures, consequence of deviations and mechanical integrity.  The PHA systematically evaluates each process for potential hazards and then recommends change where needed.  These PHAs are revalidated every five years.\n\n\n\nThe PHA team is selected from management and employees.   Members are chosen based on their knowledge in operating and maintaining the process and engineering expertise.\n\n\n\nThe Milton Hub considers a variety of factors when conducting the PHA using a combination of the \"What if\" and HAZOP methods for evaluating potential hazards.  Some of the factors considered are:\n\n 1.  Process Safety Information (PSI).\n\n 2.  Cause and Effects.\n\n 3.  Human factors.\n\n 4.  Public health.\n\n 5.  Environmental factors.\n\n 6.  Safeguards in place.\n\n 7.  Facility siting.\n\n 8.  Incidents, accidents and near miss reports.\n\n 9.  Management of Change (MoC) information.\n\n10.  All previous PHAs.\n\n\n\nThe results of the PHAs are published and made available to all personnel.  The PHA follow-up items are promptly addressed based on their priority ranking.  The responses to the PHA recommendations are tracked until they are resolved.  Milton Hub retains these records of previously PHAs. \n\n\n\nOperating Procedures\n\n\n\nThe Milton Hub maintains easily obtainable operating procedures that address various aspects of the process.  These procedures cover normal startup, startup after turnaround, normal operation, temporary operation, emergency operation, normal shutdown and emergency shutdown.  In addition, the procedures list operating limits, consequence of deviations and responses, safety and health concerns and  safety syste"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000061621,
      "SummaryText": "ms.  Milton uses these procedures for reference by experienced personnel and to provide a basis for consistent training of new operators.\n\n\n\nOperating procedures are reviewed and modified whenever there are changes in process chemicals, technology, equipment and/or facility.  Reviewing operating procedures is an element of the Management of Change (MoC) procedure.  In addition, the accuracy of all operating procedures are recertified annually.\n\n\n\nTraining\n\n\n\nThe Milton Hub has implemented a comprehensive training program to prepare potential process operators to safely and efficiently operate the facility.  Operators-in-training are taught an overview of the process, operating procedures, lock out/tag out, consequences of deviation, emergency response and operating parameters.  After an initial training phase, each candidate is paired with a senior operator for a minimum of 90 days to learn process specific tasks and duties.  The operator-in-training may remain paired with a senior operator beyond the 90 days if necessary, until they can demonstrate enough proficiency to satisfy the Operations Foreman.  The final step in becoming an operator is passing a rigorous written exam called the Compressor Operator Signoff (COS).  After all these requirements have been met, the new Operator can work independently.  New Operators are monitored by the Operations foremen.  Education is an ongoing process and as such, all operators receive periodic training related to their job duties.  In addition to all of this instruction, formal refresher training is conducted every three years. Each step of the operator training course is documented and becomes a permanent part of the employee's file.\n\n\n\nAdditionally, process maintenance personnel receive detailed training in each of the maintenance procedures as well as knowledge to diagnose and repair the process equipment.  They must demonstrate a proficiency in their field of maintenance.  Only after the foreman of their discipline deem"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000061621,
      "SummaryText": "s them competent, will they be allowed to perform maintenance tasks on process equipment.  Documentation of the individual's training and a record of their competence is kept as part of their personal training file.  Like the Operators, maintenance personnel receive ongoing training in their field and a formal refresher every three years.\n\n\n\nContractors\n\n\n\nThe Milton Hub uses contractors to supplement its workforce for construction, maintenance and testing.  To ensure that these contractors meet the safety and workplace standard, Milton personnel complete contractor evaluation forms at regular intervals.  These completed forms are evaluated by safety and management to determine compliance with the established policies, procedures and guidelines.  Contractors must maintain an acceptable score on these reviews to continue working at the facility.  In addition, the Safety Group reviews the contractor's written safety program, its implementation, training and accident history to ensure that it complies with the Milton Hub requirements.\n\n\n\nThe Milton Hub provides contractors with:\n\n 1.  A process overview\n\n 2.  Safety orientation and ensures their understanding through testing.\n\n 3.  Information about health and safety hazards.\n\n 4.  Emergency evacuation procedures and mustering location.\n\n 5.  All site specific safe work practices.\n\n\n\nPre-startup Safety Reviews (PSSRs)\n\n\n\nThe Milton Hub conducted a Pre-startup Safety Review (PSSR) before commencing initial process operations.  The records of those PSSRs are maintained at the facility.  In addition a PSSR is conducted anytime a change is made that effects the Process Safety Information or before startup after a turnaround.  The records of those PSSRs are maintained as part of the MOC process.  Milton uses a standardized corporate PSSR checklist.  The PSSR serves to ensure that:\n\n 1.  Appropriate training has been conducted.\n\n 2.  Equipment, instruments, safety equipment and other elements are properly installed.\n\n 3.  Va"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000061621,
      "SummaryText": "lves and controls are in the normal/safe position.\n\n 4.  Compressors and process equipment have been prepared for startup. \n\n\n\nMechanical Integrity\n\n\n\nThe elements of the Milton Hub Mechanical Integrity program are periodic tests and inspections, regular maintenance, trained personnel, work order systems, written procedures and  record keeping.  The program includes pressure vessels, atmospheric tanks, piping, relief and vent systems, process equipment, pumps, compressors as well as dehydration, hot oil and flaring equipment.\n\n\n\nMaintenance personnel receive training including:\n\n(1) an overview of the process, \n\n(2) safety and health hazards, \n\n(3) applicable maintenance procedures, \n\n(4) emergency procedures, and \n\n(5) work practices to help ensure that they can perform their jobs in a safe manner.\n\n\n\nWritten inspection, testing and maintenance procedures provide that work is performed properly, and serve as a basis for training maintenance personnel in their assigned duties\n\n\n\nInspections and tests are performed to ensure that the equipment functions as intended and to establish a baseline for future monitoring. If a deficiency is identified that presents a safety concern, Milton Hub personnel will correct the deficiency before placing the equipment back into service.\n\n\n\n\n\nSafe Work Practices\n\n\n\nSafe work practices at the Milton Hub are defined by  (1) the corporate safe practices manual, (2) a lockout/tag out procedure to isolate energy sources for equipment and piping undergoing maintenance, (3) a permit and procedure to control spark producing activities (i.e., hot work), and (4) a permit and procedure to verify that adequate precautions are in place before entry into a confined space. (5) procedures to control entry into the facility.  These practices along with training and procedures help to ensure that operating and maintenance activities at the hub are performed safely.\n\n\n\nManagement of Change\n\n\n\nThe Milton Hub has a comprehensive system to manage changes "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000061621,
      "SummaryText": "to all covered processes. This system requires that changes such as process equipment, chemicals, technology (including operating conditions of the process), procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to (1) determine that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change. Affected chemical hazard information, process operating limits, equipment information, and operating procedures are updated prior to incorporating these changes. In addition, operating and maintenance personnel and affected contractors are provided any necessary training on the change.\n\n\n\nIncident Investigation\n\n\n\nThe Milton Hub promptly investigates all incidents related to a covered process that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury. The goal of each investigation is to determine the factors that may have led to the incident, and develop corrective actions to prevent a recurrence of the incident or a similar incident. The investigation team documents its recommendations to prevent a recurrence, and forwards these results to Milton Hub management for resolution. Corrective actions taken in response to the investigation team's recommendations are tracked until they are complete. The final resolution of each recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the recommendations. Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future and revalidated PHAs.\n\n\n\nCompliance Audits\n\n\n\nTo determine that the Accident Prevention Program is functioning properly, the Milton Hub conducts compliance audits every three years.  Milton Hub employs a third party to conduct the audit to ensure impar"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000061621,
      "SummaryText": "ins the appropriate steps for the different types of emergencies and contact information for corporate and emergency responders.\n\n\n\nIn addition, all employees receive recurring training in environmental, safety and medical emergencies.  Also, Milton Hub has conducted periodic training events with Gonzales County Emergency Management agencies.\n\n\n\nDRIVING DIRECTIONS:\n\nFrom the intersection of FM119 and Hwy 80 in Gillett, travel southwest for 4.8 miles.  Turn right onto a lease road located on the south side of the NGL Water Solutions site.  Continue on the Lease Road for 0.2 miles.  The Lease Road dead ends into the plant entrance.\n\n"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000061621,
      "SummaryText": "tiality and a fresh perspective.  The audit results and any findings are shared with all personnel at a regularly scheduled safety event.  In addition, the final report is available at the Control Room for reference.\n\n\n\nAll audit findings are corrected in a timely fashion based upon priority ranking.  A record of all findings and the actions taken to resolve them is maintained at the hub for the two most recent audits. \n\n\n\nCHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe Milton Hub has safety features to manage potential hazards, contain and control a spill, detect a release, mitigate the consequences of a release and ensure the continued safe operation of the process.  These features include:\n\n 1.  Monitoring and control with SCADA software.\n\n 2.  Management, surveillance and control by trained onsite operational personnel.\n\n 3.  Offsite monitoring and shutdown capabilities.\n\n 4.  Hazardous chemical and gas level detection, alarm and automatic shutdown.\n\n\n\nContainment and control features include:\n\n 1.  Pressure relief devices to avoid over pressurizing.\n\n 2.  Valves that control and/or isolate part or all of the process.\n\n 3.  Interlocks and shutdowns for specific process parameters.\n\n 4.  Curbing and/or diking to contain spills.\n\n\n\nActive and Passive mitigation features:\n\n 1.  Fire extinguishing equipment.\n\n 2.  Established and documented emergency procedures.\n\n 3.  Coordination with emergency responders.\n\n 4.  Personal Protective Equipment and other safety equipment.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\n\n\nNo RMP or PSM accidents have occurred at the Milton Hub during the past five (5) years.\n\n\n\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\n\n\nThe Milton Hub operates under the San Antonio Division Emergency Response Plan and the Milton Hub Supplement to that plan.  This supplement contains a site specific Emergency Action Plan including a drawing showing evacuation routes and Muster Point.  The Emergency Action Plan diagram is posted in the Control Room.  The supplement also conta"
    }
  ]
}