{
  "FacilityID": 1000077267,
  "FacilityName": "Assumption Parish Water Works District #1",
  "FacilityStr1": "4633 Highway 1",
  "FacilityStr2": null,
  "FacilityCity": "Napoleonville",
  "FacilityState": "LA",
  "FacilityZipCode": "70390",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22007",
  "LEPC": "Assumption Parish LEPC",
  "FacilityLatDecDegs": "29.934639",
  "FacilityLongDecDegs": "-091.016000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.apwwla.com",
  "FacilityEmailAddress": "grushing@apwwla.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Assumption Parish WaterWorks Dis.#1",
  "OperatorStr1": "P.O. Drawer 575",
  "OperatorStr2": null,
  "OperatorCity": "Napoleonville",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70390",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ginger Rushing",
  "RMPTitle": "Plant Superintendent",
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000155627",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-05-18 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-06-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-03-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-03-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-03-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 29.93444,
  "FRS_Long": -91.01778,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "5.8",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000096192,
      "AltID": null,
      "FacilityID": 1000077267,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000097453,
          "ProcessID": 1000096192,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000120428,
          "ProcessID": 1000096192,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000620428,
          "ProcessID": 1000096192,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000077267,
      "SummaryText": "27981 LDEQ Facility ID Number\n\n\n\nThis Executive Summary is being written for Assumption Parish Waterworks District #1(APWD) for the process of chlorine. APWD uses chlorine to kill harmful bacteria in our drinking water. According to the Center for Disease Control and Prevention (CDC), the addition of chlorine to drinking water for the purpose of disinfection is one of the Ten Greatest Public Health Achievements of the 20th century. Chlorination and other treatments of drinking water began in the early 1900s and became widespread Public Health Practices, further decreasing the incidence of Waterborne Diseases.  \n\n\n\nThis is a full update submittal for APWD. APWD has a maximum total inventory of 8000 pounds of chlorine which is located at the rear of the facility. This amount is greater than the threshold limit set by EPA. \n\n\n\nAPWD'S Risk Management Program (RMP) is kept on file in the plant at all times. We obtained our guidelines for our RMP from \"Compliance Guidance and Model Risk Management Program for Water Treatment Plants\". This is a book released by The American Water Works Association Research Foundation. The RMP is in \"RMP eSubmit\" format which is a program obtained through EPA.\n\n\n\nIn order to ensure the safety of the community, APWD is coordinated with Assumption Parish Local Emergency Planning Committee (LEPC). The LEPC is notified of any leak and will assist APWD in any way possible to ensure the safety of the community. APWD has also coordinated with the local fire department and have invited the fire department to attend several classes on chlorine safety.\n\n\n\nThe Hazard Assessment is conducted to identify the possibility of a release or an accident. Conducting a five-year accident history survey is part of the Hazard Assessment. There were no accidents to report at APWD. \n\n\n\nThe Prevention Program is conducted to prevent the possibility of a chemical release. All chlorine equipment is inspected and maintained once a year regularly to make sure that all t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000077267,
      "SummaryText": "he equipment is working properly. Every inspection and routine maintenance procedure is documented and kept on file with all Risk Management Program information. There is also a procedure followed for receiving and hooking up a chlorine cylinder. APWD has a chlorine system that runs on a vacuum system. This means that in the event of a leak in the line the vacuum is broken and the chlorine cylinder shuts off automatically. A written operating procedure is kept on file and followed by operators at all times. There is a form on file entitled \"Designation of Management Program\". In this form, the chain of authority is defined according to the RMP. There is a specific amount of safety information on file at APWD at all times. The Material Safety Data Sheets for chlorine and all other chemicals are readily available for all employees at all times. Chemical Inventories and safe upper and lower temperatures and pressures are also available at any given time. A hazard review was conducted and is on file with all RMP information. Any hazards identified will be corrected immediately to ensure a safe working climate and community. A compliance audit was conducted and a checklist was put on file for future use. A compliance audit will be conducted every three years or in the event of a major change. Forms for an incident investigation are kept on file in case a situation would arise.\n\n\n\nThe emergency response plan is written to be certain that employees and certain agencies know what to do in the event of a release or an emergency.  APWD is coordinated with Assumption Parish LEPC and local fire departments. LEPC will assist APWD in any way and communicate information to the public concerning a chlorine leak by way of radio transmission or cable over-ride as needed. The Louisiana State Police will be contacted in the event of a leak for any assistance they can give. The chlorine distributor and ChemTrec will be called also to offer help in fixing a leaking cylinder if they are n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000077267,
      "SummaryText": "eeded.\n\n\n\nAPWD has made several changes to the plant to improve safety conditions. Self-contained breathing apparatus equipment is on site at the plant in case of an emergency.  Chlorine leak detectors and a wind sock were also installed."
    }
  ]
}