{
  "FacilityID": 1000101524,
  "FacilityName": "Plaquemine NGL Fractionation Plant",
  "FacilityStr1": "60985 Derrick Rd",
  "FacilityStr2": null,
  "FacilityCity": "Plaquemine",
  "FacilityState": "LA",
  "FacilityZipCode": "70764",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22047",
  "LEPC": "Iberville Parish LEPC",
  "FacilityLatDecDegs": "30.2386111",
  "FacilityLongDecDegs": "-91.2443394",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "www.enlink.com",
  "FacilityEmailAddress": "ehsdept@enlink.com",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "EnLink Processing Services, LLC",
  "OperatorStr1": "1722 Routh St Suite 1300",
  "OperatorStr2": null,
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75201",
  "OperatorZipCodeExt": null,
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000227051",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "1280-00163-V1",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-07-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-07-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-07-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-07-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 30.238611,
  "FRS_Long": -91.244339,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000125991,
      "AltID": "Natural Gas Processing",
      "FacilityID": 1000101524,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000157633,
          "ProcessID": 1000125991,
          "ChemicalID": 155,
          "Quantity": 1256930.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000139225,
              "ProcessChemicalID": 1000157633,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000139226,
              "ProcessChemicalID": 1000157633,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000139227,
              "ProcessChemicalID": 1000157633,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000139228,
              "ProcessChemicalID": 1000157633,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000139229,
              "ProcessChemicalID": 1000157633,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000139230,
              "ProcessChemicalID": 1000157633,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000139231,
              "ProcessChemicalID": 1000157633,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000127384,
          "ProcessID": 1000125991,
          "NAICSCode": "21111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000101524,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": "2022-01-31 00:00:00",
    "ERTrainingDate": "2022-06-16 00:00:00",
    "CoordinatingAgencyName": "Iberville Parish OEP",
    "CoordinatingAgencyPhone": "2256875140",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000101524,
      "SummaryText": "1.0 Executive Summary  \r\nThe Plaquemine PF-1 Plant (\"Plant\" or \"Facility\") utilizes more than the threshold quantity of a \"regulated flammable substance (10,000 pounds)\" in the processing of natural gas, where natural gas liquids (NGL) or raw make are extracted from the inlet gas using cryogenic gas cooling and liquid separation. Therefore, this Facility is subject to the Risk Management Plan (RMP) requirements codified in Title 40 of the Code of Federal Regulations Part 68 (40 CFR 68) administered by the U.S. Environmental Protection Agency (EPA). \r\nPlaquemine PF-1 Plant is located in Iberville Parish, Louisiana (latitude 30o 14' 14.52\" North, longitude 91o 14' 44.06\" West). The estimated flammable endpoint for a worst-case release is less than the distance to any public or environmental receptor. MARPLOT indicates one housing unit (population 3) based on 2010 Census data within 0.5 miles radius (worst-case release scenario) around PF-1 plant. However, the facility employee survey and aerial photography do not indicate any housing unit (zero public receptor) within 0.5 miles radius around Plaquemine PF-1 Plant. In addition, Area Tax Assessor office confirmed that there are no public receptor within 0.5 miles radius around PF-1. Therefore, EnLink classified PF-1 facility as RMP Program Level 1.  Furthermore, emergency response procedures have been coordinated between the Facility and local emergency planning and response organizations. Therefore, the Plaquemine PF-1 Plant is subject to Program level 1 requirements as stated in 40 CFR 68.10. The Plant has not had an accidental release of a regulated substance where exposure to the substance, its reaction products, overpressure generated by an explosion involving the substance, or radiant heat generated by a fire involving the substance led to any off-site death, injury, or response or restoration activities for an exposure of an environmental receptor. The Plant employs 15 full-time employees on-site who ensure the p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000101524,
      "SummaryText": "roper operation and maintenance of the Facility. EnLink Midstream Operating, L.P. (EnLink) last submitted a complete RMP 5-year update to the United States Environmental Protection Agency (USEPA) in July 2017. The current RMP includes administrative updates associated with the Plant. \r\n\r\n1.1 68.155(a) Accidental Release Prevention and Emergency Response Policies  \r\nThe Plant maintains a policy of safe NGL extraction operations, reducing to the greatest extent possible hazards associated with the extraction processes, and reducing subsequent risk to the surrounding community, employees, and the environment. The Plant has procedures in place, including both on-site activities and coordination with off-site responders that are to be followed in the event of an NGL release.\r\n \r\n1.2 68.155(b) Stationary Source and Regulated Substances Handled.\r\nThe Plant processes NGL / Condense in various aboveground vessels and associated piping and valves. NGL is a regulated flammable mixture that is an aliphatic and aromatic hydrocarbon mixture. The regulated flammable chemicals contained in the NGL mixture include methane, ethane, propane, isobutane, N-butane, isopentane, and N-pentane, Hexane and Heptane.\r\n\r\n1.3 68.155(d) General Accidental Release Prevention Program and Chemical-specific Prevention Steps.\r\n Because the Facility is regulated under RMP Program Level 1, it is not subject to the RMP Prevention Program required under 40 CFR 68.  However,  the  Facility  is  subject  to  the  Occupational  Safety  and  Health Administration's (OSHA) Process Safety Management (PSM) Program. The Plaquemine PF-1 Facility's PSM Plan is kept on-site as a separate document. \r\n\r\n1.4 68.155(e) Five-Year Accident History.\r\n The Plant has had no accidental releases of flammable materials regulated under the RMP program that resulted in deaths, injuries, or significant property damage on-site, or off-site deaths, injuries, evacuations, sheltering in place, property damage or any environmental impa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000101524,
      "SummaryText": "ct for the period of five (5) years prior to June 2022.\r\n\r\n1.5 68.155(f) Emergency Response Program \r\nThe Emergency Response Program requirements for Program 1 Facilities are very similar to those required under the PSM rule. The Emergency Response Program required under the RMP and PSM Rules must be site-specific and comprehensive, including the following elements: &#61623; Public and emergency response agency notification procedures &#61623; Proper first aid and emergency medical treatment &#61623; Emergency response measures &#61623; Procedures for inspecting, testing, and maintaining emergency response equipment &#61623; Employee training &#61623; Program review procedures \r\nThe Plant maintains written Emergency Shutdown and Startup Procedures (ESSP) that provide guidance for emergencies expected at the Facility. Further safety information is also detailed in the ESSP. In addition, operating procedures and equipment design codes and standards associated with the operations at the Facility are maintained. Furthermore, the Facility has coordinated the emergency response plan with Iberville Perish LEPC and Plaquemine Fire Department. The Iberville Parish LEPC and Plaquemine Fire Department is designated as the first responder in the event of NGL release. For these reasons, the Plant meets the exceptions listed in 40 CFR 68.90(b). Note that the Plant is \"non-responding\" facility. A site map and SDSs for the chemicals kept on-site are maintained on the company's intranet. Complete details on the Emergency Response Program required under the PSM Rules are included in the Plant's PSM Plan, which is kept on-site as a separate document.\r\n\r\n1.6 68.155(g) Safety Improvements \r\nEnLink has a continued commitment to update equipment and improve safety pertaining to the covered process when necessary. The most recent Process Hazard Analysis for the Facility was completed on March 2018, at which time several action items / recommendations were generated."
    }
  ]
}