{
  "FacilityID": 1000013199,
  "FacilityName": "Harvey Lyman Company, Walnut Grove Facility",
  "FacilityStr1": "14301 Railroad Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Walnut Grove",
  "FacilityState": "CA",
  "FacilityZipCode": "95690",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06067",
  "LEPC": "Sacrmento County Env. Mgmt.",
  "FacilityLatDecDegs": "38.236930",
  "FacilityLongDecDegs": "-121.514930",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "The Lyman Group, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 29623956,
  "Company2DUNS": 0,
  "OperatorName": "The Lyman Group, Inc.",
  "OperatorStr1": "14301 Railroad Ave.",
  "OperatorStr2": "PO Box 279",
  "OperatorCity": "Walnut Grove",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95690",
  "OperatorZipCodeExt": null,
  "RMPContact": "Greg McCosker",
  "RMPTitle": "Facility Manager",
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000028882",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-09-14 00:00:00",
  "SafetyInspectionBy": "Sacramento County Envi. Mgmt. Dept.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-04-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-04-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-04-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-04-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.23871,
  "FRS_Long": -121.51257,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000016468,
      "AltID": "Anhydrous Ammonia Storage",
      "FacilityID": 1000013199,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000016880,
          "ProcessID": 1000016468,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000019592,
          "ProcessID": 1000016468,
          "ChemicalID": 56,
          "Quantity": 65900.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000519592,
          "ProcessID": 1000016468,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000016469,
      "AltID": "Aqua Ammonia Storage",
      "FacilityID": 1000013199,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000016881,
          "ProcessID": 1000016469,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000019593,
          "ProcessID": 1000016469,
          "ChemicalID": 57,
          "Quantity": 249700.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000519593,
          "ProcessID": 1000016469,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000013199,
      "SummaryText": "Harvey Lyman Company\nWalnut Grove Facility\n\n1.    FACILITY ACCIDENTAL RELEASE POLICY\nThe owners, management, and employees of the The Lyman Group, Inc. (TLG), Walnut Grove Facility (Facility) at 14301 Railroad Avenue, Walnut Grove, California 95690 are committed to the prevention of any accidental release of anhydrous ammonia, aqua ammonia, or regulated pesticides.  If an accidental release should occur, the Facility is prepared to work with the local fire department, or other authorities to mitigate any release and minimize the impact of the release to people and the environment.  A detailed Consolidated Contingency Plan has been developed and will be implemented in the event of an accidental release.\n2.    FACILITY INFORMATION\nA?    The Facility is a retail agricultural facility whose primary activity is the storage and sale of fertilizers in addition to the sale of pre-packaged agricultural chemicals to agricultural operations in the Sacramento Delta Area of Northern California.\nA?    Anhydrous ammonia and aqua ammonia is received, stored, and distributed for direct application for crop production nutrients. Regulated pesticides will be received, stored, and distributed for direct application in pest control.\nA?    Anhydrous ammonia is received by truck and stored in one 15,000-gallon storage tank (bullet) at the site.  The maximum quantity of anhydrous ammonia handled in this process is 65,900 pounds.\nA?    Aqua ammonia is received by truck and stored in two 20,500-gallon, above-ground tanks at the site.  The maximum quantity of aqua ammonia handled is 249,700 pounds.    \n3.    THE WORST-CASE RELEASE SCENARIO AND ALTERNATIVE RELEASE SCENARIO\na.  Anhydrous Ammonia Worst-Case and Alternative Release Scenarios  \nThe worst-case release scenario is the failure of the largest storage tank when filled to the greatest amount, which would release 65,900 pounds of anhydrous ammonia; this represents the volume of the largest storage tank limited at 85% of capacity.  The alternative release sce"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000013199,
      "SummaryText": "nario based on the hazard review (or a more plausible potential incident) is a release from a broken 2-inch diameter pipe with an increased wind speed and A?DA? stability modeling parameters. \nb.  Aqua Ammonia Worst-Case and Alternative Release Scenarios  \nThe worst-case scenario is failure of the largest storage tank when filled to the greatest amount, which would release 124,850 pounds of aqua ammonia within a secondary containment structure.  The alternative release scenario based on the hazard review (or a more plausible potential incident) is a release from a pipe break modeled with an increased wind speed and \"D\" Stability modeling parameters. \n4.    ACCIDENTAL RELEASE PREVENTION PROGRAM\nThe Facility has implemented the following prevention program elements.\nSafety Information:  TLG ensures that information concerning covered processes and regulated substances are up-to-date and available for review by employees.  The most review of safety information pertaining to the covered processes took place on October 7, 2009.\nHazard Review:  A hazard review of the ammonia and pesticide process is conducted every five years or as needed by changes in the processes.  The most recent update of the hazard review was conducted on February 24, 2010.  Results indicate that no high risk hazards were identified through the hazard review update.\nOperating Procedures:  Written standard operating procedures have been developed for the covered processes and are reviewed and revised as needed.  The operating procedures were last revised in June 2008.\nTraining:  The Facility staff, as well as TLG corporate staff, understands that incidents involving the accidental release of regulated substances can be reduced by having trained operations and maintenance staff.  A training program, which incorporates specific operating procedures and safe work practices, is an essential element of an effective prevention program.  The current training program is comprised of the following:\nA?    Initial em"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000013199,
      "SummaryText": "ployee training;\nA?    Periodic refresher training;\nA?    Training provided as a result of a new equipment addition or modification;\nA?    Competency testing involving written tests and observation following training; and\nA?    Training records for each employee.\nMaintenance:  The maintenance program at the Facility is intended to preserve the mechanical integrity of the process equipment to minimize the potential for an accidental release.  The maintenance program includes equipment inspection, preventative maintenance, recordkeeping, and training.  The latest equipment inspections were conducted on February 19, 2010, and the latest review of maintenance procedures was conducted on February 24, 2010.\nCompliance Audits:  Periodic compliance audits to assess the effectiveness of the written plan must be conducted every three years.  Records of the audits and follow-up documentation are maintained to indicate findings and resolution of findings.  The most recent compliance audit was conducted in May 2008. \nIncident Investigation:  Although no incidents involving regulated substances have occurred at the Facility in the last five years, an incident investigation program is in place.  The program includes investigation requirements and reporting and would be implemented in the event of an incident.\nIn addition to the prevention program elements described above, the following chemical-specific prevention steps have been implemented.\nAnhydrous Ammonia and Aqua Ammonia:  The Facility implements the provisions of the A?Safety Requirements for Storage and Handling of Anhydrous Ammonia, K-61.1\", published by the American National Standards Institute, Inc.; California Code of Regulations, Title 8, Subchapter 1, A?Unfired Pressure Vessel Safety OrdersA?; and the standards of the U.S. Occupational Safety and Health Administration (OSHA), 29 CFR 1910.111, A?Storage and Handling of Anhydrous Ammonia.A?\n5.    FIVE-YEAR ACCIDENT HISTORY\nThere have been no accidental releases of anhydrous ammonia, "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000013199,
      "SummaryText": "aqua ammonia, or regulated pesticides during the last five years resulting in death, injuries, evacuations, sheltering in place, or property or environmental damage.\n6.    THE EMERGENCY RESPONSE PROGRAM\nThe facilityA?s emergency response program is developed in accordance with Section 25503, Division 6.95 of the California Health and Safety Code, Hazardous Materials Business Plan requirements.  A Consolidated Contingency Plan has been prepared and will be implemented in the event of an accidental release of a regulated substance.\n7.    PLANNED CHANGES TO IMPROVE SAFETY\nSafety improvement is an on-going process at the Facility.  Periodic evaluations will be performed to assess the maintenance of safe conditions.  Specific changes to the anhydrous ammonia, aqua ammonia, and regulated pesticides processes at the Facility will be implemented as needed.\n"
    }
  ]
}