{
  "FacilityID": 1000119305,
  "FacilityName": "FMC Mobile Site",
  "FacilityStr1": "12650 Highway 43",
  "FacilityStr2": null,
  "FacilityCity": "Axis",
  "FacilityState": "AL",
  "FacilityZipCode": "36505",
  "Facility4DigitZipExt": "0525",
  "FacilityCountyFIPS": "01097",
  "LEPC": "Mobile County LEPC",
  "FacilityLatDecDegs": "30.954444",
  "FacilityLongDecDegs": "-88.018889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G5",
  "LatLongDescription": "CE",
  "FacilityURL": "www.fmc.com",
  "FacilityEmailAddress": "George.West@fmc.com",
  "FacilityDUNS": 93179315,
  "ParentCompanyName": "FMC Corporation",
  "Company2Name": null,
  "CompanyDUNS": 1315704,
  "Company2DUNS": null,
  "OperatorName": "FMC Corporation",
  "OperatorStr1": "12650 Highway 43",
  "OperatorStr2": null,
  "OperatorCity": "Axis",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36505",
  "OperatorZipCodeExt": "0525",
  "FTE": 123,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000128541",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "5035001",
  "SafetyInspectionDate": "2024-11-05 00:00:00",
  "SafetyInspectionBy": "ADEM Land Division",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2025-02-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2025-02-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2025-02-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2030-02-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 30.954444,
  "FRS_Long": -88.018889,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) STANDARD POSITION (SA OFF)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000148920,
      "AltID": "MP 062",
      "FacilityID": 1000119305,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000186193,
          "ProcessID": 1000148920,
          "ChemicalID": 98,
          "Quantity": 48000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000150475,
          "ProcessID": 1000148920,
          "NAICSCode": "32532",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000127229,
              "Process_NAICS_ID": 1000150475,
              "SafetyReviewDate": "2020-11-25 00:00:00",
              "PHA_Date": "2020-11-25 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Structured What-If",
              "PHACompletionDate": "2022-08-09 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Foam Monitors",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-08-06 00:00:00",
              "TrainingReviewDate": "2021-07-10 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2024-08-06 00:00:00",
              "EquipmentInspectionDate": "2024-05-09 00:00:00",
              "EquipmentTested": "V-B902 Interstage Surge Drum",
              "ChangeMgmtDate": "2024-02-08 00:00:00",
              "ChangeMgmtReviewDate": "2024-12-17 00:00:00",
              "PreStartupReviewDate": "2024-09-24 00:00:00",
              "ComplianceAuditDate": "2022-09-22 00:00:00",
              "AuditCompletionDate": "2023-11-29 00:00:00",
              "IncidentInvestigationDate": "2022-08-05 00:00:00",
              "InvestigationChangeDate": "2023-05-30 00:00:00",
              "ParticipationPlansReviewDate": "2023-07-19 00:00:00",
              "HotWorkPermitReviewDate": "2024-06-10 00:00:00",
              "ContractorSafetyReviewDate": "2024-12-19 00:00:00",
              "ContractorSafetyEvalDate": "2023-07-19 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000159408,
                  "PreventionProgram3ID": 1000127229,
                  "ProcessChemicalID": 1000186193
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000119305,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-07-18 00:00:00",
    "ERTrainingDate": "2025-01-28 00:00:00",
    "CoordinatingAgencyName": "Emergency Management Agency",
    "CoordinatingAgencyPhone": "2514608000",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "Yes",
    "ExercisePlanDate": "2025-02-11 00:00:00",
    "NotificationDrill": "Yes",
    "NotificationDrillDate": "2024-10-04 00:00:00",
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "Yes",
    "LEPCCoordinationDate": "2025-01-09 00:00:00",
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "Yes",
    "LocalResponseAgencyCoordinationDate": "2025-01-09 00:00:00",
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "Yes"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000119305,
      "SummaryText": "The FMC Agricultural Products Mobile Site is located on Highway 43 North, two miles north of Axis, Alabama.  Shell Chemical Company originally built the plant in 1968.  DuPont acquired the plant in October 1986 as part of its Agricultural Products business.  The facility was acquired by FMC Corporation in November 2017.  The site currently has approximately 160 employees and 120 resident contractors working on site every day.  The employees are active in churches, youth sports, schools, and other activities around our plant, in Mobile, Baldwin, and Washington counties.\n\nFMC is committed to improving the quality of life and enhancing the vitality of communities in which the company has a major business presence.  The FMC Agricultural Products Mobile Site primarily produces crop protection chemicals for use in agricultural applications.  Some of the products include insecticides such as RYNAXYPYR, INDOXACARB, and CYAZYPYR.   The products contribute to an abundant and safe supply of food for the world's people.  The site adheres to the highest standards for safe operations and for the protection of the environment, our people, customers, and the citizens of the communities in which we do business. \n\nEvery person on site has the right and responsibility to stop ANY work he or she sees as unsafe.  This includes shutting a process unit down if conditions are unsafe.  The site will not make a product if it cannot be made safely.  FMC Mobile continuously works toward the company core value of Zero Accidents and Zero harm to the environment.  \n\nAt the FMC Agricultural Products Mobile Site, the employees are committed to operating and maintaining all of the processes (especially those using hazardous substances) in a safe and responsible manner.  A combination of accidental release prevention programs and emergency response planning programs are used to help ensure the safety of the employees and the public as well as protection of the environment.  The FMC ERT Team work with"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000119305,
      "SummaryText": "the Local Emergency Planning Committee (LEPC) in the review and usage of response plans.   This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:  \n\n- A description of the facility and use of substances regulated by EPA's RMP regulation\n- A summary of results from the site's assessment of the potential offsite consequences from accidental chemical releases\n- An overview of the site's accidental release prevention programs\n- A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\n- An overview of the emergency response program\n- An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting the site's employees, the public, and the environment\n- The certifications that EPA's RMP rule requires the site to provide\n- The detailed information (called data elements) about the risk management program\n\nRisk Management Planning:\n\nThe Environmental Protection Agency (EPA) has established regulations that require FMC and other companies who handle certain chemicals to develop a Risk Management Plan.  The Mobile plant uses one listed chemical (Propane) that meets the minimum storage quantities for reporting.  The site has analyzed its potential effects to the workers and the community, if something should happen that caused this chemical to be released into the air by using EPA's guidance for Worst Case Scenarios and Alternative Release Scenarios.  This information, along with a well-developed risk management system, the Process Safety Management program, Emergency Response programs coordinated with local response agencies, and a 5-year accident history make up the site's Risk Management Plan.\n\nWorst Case Scenarios:\n\nThe EPA established the assumptions for these unlikely scenarios.  The worst-case release scenario for our site is a catastrophic failure of a propane storage vessel, resul"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000119305,
      "SummaryText": "ting in a BLEVE (Boiling Liquid Expanding Vapor) explosion. Using the assumptions established by EPA, the entire contents of this vessel would instantaneously vaporize with no active mitigation and form a cloud that explodes.  This explosion may be heard off-site but would not have any other off-site impact.  The site has SAFER Real-time atmospheric monitor that can track weather conditions and plume positions.\n\n\nAlternative Release Scenarios...\n\nWhile the worst-case scenario focuses on catastrophic potential, the EPA also established assumptions for an alternative release scenario, which looked at a more realistic situation that could potentially impact our neighbors.  For these scenarios, the site can take credit for all of the things that are done to make the plant a safer place through design and operation of the processes.  None of the alternative releases would impact residential or environmental areas.  \n\n\n5 Year Accident History\n\nAs an indication of how realistic these Alternative Release Scenarios are, the site reviewed releases for the last 5 years.  The EPA defined RMP accidents as those involving listed chemicals that resulted in injuries or serious on-site or off-site impact.  There have not been any releases that meet EPA's definition.                                                                   \n\n\nGeneral Accidental Release Prevention Program\n\nSeveral examples of how processes are designed for safety are the following: automatic fail-safe valving systems are included as part of the design, Process Hazard Analyses are done as part of the design process prior to construction and start-up, Process Hazard Analyses are repeated every five years and improvements made. \n\nThe site takes care of the equipment by the following methods: preventive maintenance programs, all maintenance work is preplanned and safety checks and reviews are done after the work is completed, periodic inspections and tests are performed on critical devices such as pressure relief"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000119305,
      "SummaryText": "devices and rupture discs, alarm and interlock systems are periodically tested, and maintenance technicians are trained and qualified in proper safe work practices. \n\nThe ways the site ensures that processes are operated safely are the following:  process technicians are trained and qualified in proper safe work practices and handling techniques as well as OSHA Process Safety Management, computerized control systems provide continuous monitoring of the operating process, written operating procedures are reviewed and certified annually, process and maintenance technicians are retrained prior to each campaign of a product.\n\nThe operations are audited in a number of different ways.  Some examples of how this is done are the following: operators patrol the process units throughout each shift, the site performs weekly Environmental, Health and Safety audits of the operating areas, Site and Corporate personnel carry out internal audits and reviews of Process Safety Management systems, pressure relief devices and critical interlocks are routinely inspected, safety reviews precede all startups, the processes are certified under International Organization for Standardization (ISO 9002), all incidents are investigated and recommendations are acted on, and annual audits are conducted by ADEM, FRA, DOT, Aetna Casualty, and other third party agencies to assure regulatory compliance.\n\n\nEmergency Response Program\n\nThe site maintains an emergency response plan, which contains all of the various federal, state, and local regulatory requirements for emergency response planning.  The program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  The site coordinates the site plan with the community emergency response plan.  Some specific aspects of the emergency response program are the following: the Emergency Response Team (ERT) is on-site 24 hours per day year-round, quarterly training for ERT"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000119305,
      "SummaryText": "on-site and at recognized Fire School or FM Global facility, active preventive maintenance and inspection program for on-site fire protection systems, conduct drills and coordinate training with neighboring industry and local fire departments, and coordinated responses to aid other local industries through the Emergency Management Agency (EMA).  \n\nThe FMC Mobile Site has and will continue to reduce the risks associated with handling and using the chemicals on site.  FMC Mobile will continue to maintain an active community involvement process that has been developed to keep our neighbors abreast of risk management issues related to the site."
    }
  ]
}