{
  "FacilityID": 1000010996,
  "FacilityName": "Linde Gas North America LLC",
  "FacilityStr1": "11603 Strang Road",
  "FacilityStr2": null,
  "FacilityCity": "LaPorte",
  "FacilityState": "TX",
  "FacilityZipCode": "77571",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "LaPorte LEPC",
  "FacilityLatDecDegs": "29.706291",
  "FacilityLongDecDegs": "-095.057016",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 132970505,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Linde Gas L.L.C.",
  "OperatorStr1": "11603 Strang Road",
  "OperatorStr2": null,
  "OperatorCity": "LaPorte",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77571",
  "OperatorZipCodeExt": null,
  "FTE": 65,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000088861",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-12-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-09-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-09-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-09-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 29.71389,
  "FRS_Long": -95.06833,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000013067,
      "AltID": null,
      "FacilityID": 1000010996,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000015070,
          "ProcessID": 1000013067,
          "ChemicalID": 129,
          "Quantity": 55000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000013426,
          "ProcessID": 1000013067,
          "NAICSCode": "32512",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000010843,
              "Process_NAICS_ID": 1000013426,
              "SafetyReviewDate": "2009-09-16 00:00:00",
              "PHA_Date": "2009-09-16 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2010-05-31 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "hydrant monitors",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-05-27 00:00:00",
              "TrainingReviewDate": "2010-05-27 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "CBT",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": "CBT",
              "MaintenanceReviewDate": "2007-07-02 00:00:00",
              "EquipmentInspectionDate": "2007-10-25 00:00:00",
              "EquipmentTested": "Receiver intercooler, subcooler, system pressure and vacuum checked",
              "ChangeMgmtDate": "2008-11-18 00:00:00",
              "ChangeMgmtReviewDate": "2008-02-26 00:00:00",
              "PreStartupReviewDate": "2004-05-03 00:00:00",
              "ComplianceAuditDate": "2010-06-15 00:00:00",
              "AuditCompletionDate": "2010-08-30 00:00:00",
              "IncidentInvestigationDate": "2007-10-25 00:00:00",
              "InvestigationChangeDate": "2010-04-30 00:00:00",
              "ParticipationPlansReviewDate": "2009-05-27 00:00:00",
              "HotWorkPermitReviewDate": "2009-09-04 00:00:00",
              "ContractorSafetyReviewDate": "2009-08-28 00:00:00",
              "ContractorSafetyEvalDate": "2009-08-28 00:00:00",
              "CBI_Flag": 0,
              "Description": "Propylene is stored as a liquid in a vessel built to pressure vessel code.  The vessel is interconnected to a refrigeration unit which utilizes the propylene to reduce temperature to -300 F.  This cryogenic process separates the syngas into carbon monoxide and hydrogen, which is consumed in other processes.  The storage vessel utilizes pressure relief devices and local LEL detection for protection.  The portions of the unit operations at cryogenic temperatures utilize materials designed for use at this temperature.  A firewater system with hydrant monitors allows this system to mitigate leaks.  The unit has a DCS control system which provides the operators with information, warnings and alarms that ensure safe operation.  Operators are trained to follow standard operation procedures that ensure safe operation during normal, abnormal and emergency situations.  Linde Gas participates in a complex Emergency Response Team which allows trained responders to handle fire and hazardous materials response.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000012631,
                  "PreventionProgram3ID": 1000010843,
                  "ProcessChemicalID": 1000015070
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000010996,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-08-28 00:00:00",
    "ERTrainingDate": "2008-04-15 00:00:00",
    "CoordinatingAgencyName": "LaPorte LEPC",
    "CoordinatingAgencyPhone": "2814712141",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000010996,
      "SummaryText": "Linde is committed to maintaining a safe and healthy workplace, to operate its facilities in an environmentally responsible manner, and assure that utmost care is taken in the manufacture and storage of its products.  Linde actively participates in the LaPorte Citizen's Advisory Council and LaPorte Local Emergency Planning Committee through funding and commitment of plant personnel time to these activities.  The facility has an established, and tested, method for notifying our employees and surrounding community of an event which could, or would impact them.  The complex has standard operation procedures in place which define responsibilities and reporting requirements, depending upon the nature of the emergency.  The manufacturing complex has an Emergency Response Team that is trained to respond to fire, hazardous materials, medical and rescue emergencies.  Additionally, the complex is a member of the Channel Industries Mutual Aid organization and can call upon allof their expertise, manpower and equipment if needed.  Linde falls under the OSHA Process Safety Management (PSM) standard.  Our facility has adopted these recognized 14 components of PSM to govern how we run all our processes, not just those required by regulation.\n\nLinde produces several final products at the LaPorte facility including methanol and syngas (which is a mixture of carbon monoxide and hydrogen.  Methanol is sold into the merchant market as well as being a feedstock for the production of acetic acid. Syngas is separated into carbon monoxide and hydrogen and sent via pipeline to other facilities for consumption.  Linde has one chemical which falls under the RMP regulations, which is propylene.  The total amount of propylene in the system is 55,000 pounds.  \n\nLinde has conducted an offsite consequence analysis (OCA) to estimate the potential impact to offsite environmental receptors and the public for an accidental release of a regulated substance.  The OCS evaluates both a worst-case (WCS) an"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000010996,
      "SummaryText": "d an alternate release scenario (ARS).  Linde does not anticipate a WCS to occur, but has planned for and communicated the information concerning a WCS to the public.  The ARS is a more realistic scenario.  Alternate release scenarios are based upon a more likely set of circumstance.  Information on the ARS and WCS have been presented and distributed to the public and the LaPorte LEPC.  If you are interested in further information, please contact our RMP Coordinator at 713-767-4135.\n\nLinde maintains an active accident prevention program consisting of many elements.  The LaPorte site falls under the Risk Management Program (RMP) and Process Safety Management (PSM) standard.  Linde goes beyond the requirements of the PSM standard by adopting these procedures for all processes at the facility, not just covered processes.  The LaPorte facility has an in-depth training program for operators.  The program includes standard operating procedures, mentoring, on-the-job training, and testing.  All on-site contractors participate in the facility safety programs.  Linde maintains a Request for change (RFC) and Management of change (MOC) process.  Employees and contractors participate in both these programs.  Linde has a predictive and preventative maintenance program in place and uses risk based evaluations to validate the revise the program.  The site has a comprehensive work permit procedure covering all types of work including; hot work, confined space entry, cold work and excavation.  Linde uses third party auditing to verify safety, health, environmental and mechanical integrity throughout the facility.  The facility conducts weekly safety and housekeeping audits of all plant area.  Safety information is a priority communication to employees.  \n\nNo releases of the RMP covered chemical at the Linde LaPorte facility has occurred in the last five years that has resulted in any fatalities, injuries, or significant damage both onsite or offsite, or environmental receptors offsi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000010996,
      "SummaryText": "te.\n\nLinde has a written Emergency Response Plan (ERP) for the protection of employees, contractors, visitors, the public and environmental receptors.  The ERP details how employees should report a variety of emergencies, including fire, hazardous material release, medical and rescue situations.  Actions to be taken by all onsite personnel are detailed in the ERP.  The LaPorte Complex maintains an Emergency Response Team with personnel trained (to the applicable standard) to respond and actively mitigate in fire and hazardous materials emergencies.  Additionally, the ERT has medical and rescue trained personnel for these situations.  The complex is a member of Channel Industries Mutual Aid (CIMA) which gives the facility access to all the manpower, expertise and equipment of the other 100+ member.  Linde regularly has drills to test the ERP and ERT response.  Changes are made based upon these drills.\n\nLinde regularly reviews all areas of plant safety.  These reviews involve all levels of the organization from Plant Manager to technician.  There are procedures in place that allow any employee to stop a process or job and question any safety aspect of that job.  Linde has a regular schedule to review and revise standard operation procedures."
    }
  ]
}