{
  "FacilityID": 1000048028,
  "FacilityName": "Santa Maria Facility",
  "FacilityStr1": "2555 Willow Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Arroyo Grande",
  "FacilityState": "CA",
  "FacilityZipCode": "93420",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06079",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "35.038889",
  "FacilityLongDecDegs": "-120.589722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "www.phillips66.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 139333736,
  "ParentCompanyName": "Phillips 66 Company",
  "Company2Name": null,
  "CompanyDUNS": 118819478,
  "Company2DUNS": null,
  "OperatorName": "Phillips 66 Company",
  "OperatorStr1": "PO Box 4428",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77210",
  "OperatorZipCodeExt": null,
  "FTE": 125,
  "OtherEPAFacilityID": "NMD986676005",
  "EPAFacilityID": "100000137611",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "44",
  "SafetyInspectionDate": "2014-10-15 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2015-12-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-12-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-12-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2023-04-26 00:00:00",
  "DeRegistrationEffectiveDate": "2023-04-04 00:00:00",
  "AnniversaryDate": "2019-12-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 35.038889,
  "FRS_Long": -120.589722,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000059994,
      "AltID": "Refining/Offplot",
      "FacilityID": 1000048028,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000073412,
          "ProcessID": 1000059994,
          "ChemicalID": 63,
          "Quantity": 2487.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000073413,
          "ProcessID": 1000059994,
          "ChemicalID": 155,
          "Quantity": 44004.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000062320,
              "ProcessChemicalID": 1000073413,
              "ChemicalID": 95
            },
            {
              "FlamMixChemID": 1000062321,
              "ProcessChemicalID": 1000073413,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000062322,
              "ProcessChemicalID": 1000073413,
              "ChemicalID": 129
            },
            {
              "FlamMixChemID": 1000062323,
              "ProcessChemicalID": 1000073413,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000062324,
              "ProcessChemicalID": 1000073413,
              "ChemicalID": 154
            },
            {
              "FlamMixChemID": 1000062325,
              "ProcessChemicalID": 1000073413,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000062326,
              "ProcessChemicalID": 1000073413,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000062327,
              "ProcessChemicalID": 1000073413,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000062328,
              "ProcessChemicalID": 1000073413,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000062318,
              "ProcessChemicalID": 1000073413,
              "ChemicalID": 149
            },
            {
              "FlamMixChemID": 1000062319,
              "ProcessChemicalID": 1000073413,
              "ChemicalID": 93
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000061104,
          "ProcessID": 1000059994,
          "NAICSCode": "32411",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000048028,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-06-25 00:00:00",
    "ERTrainingDate": "2014-12-03 00:00:00",
    "CoordinatingAgencyName": "San Luis Obispo County Fire Dept.",
    "CoordinatingAgencyPhone": "8055434244",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000048028,
      "SummaryText": "Phillips 66 Santa Maria Facility \r\nRMP: Executive Summary\r\n\r\n\r\nFacility & Regulated Substances Handled\r\n\r\nThe United States Environmental Protection Agency (EPA) requires companies such as Phillips 66 to submit a Risk Management Plan (RMP) for any processes containing regulated substances above a threshold quantity (TQ); this applies to the Santa Maria Facility.  The Santa Maria Facility handles hazardous materials onsite, and recognizes a responsibility to safely operate the facility in order to protect the employees, surrounding community, and the environment.  The Facility has taken a proactive stance to promote the overall safe operation of the processes, with programs to prevent accidents from occurring, planning for emergencies, and maintaining the equipment needed if an emergency does occur.  The RMP formalizes existing programs and procedures so that these programs may be reviewed more efficiently.\r\n\r\nThe Santa Maria Facility processes crude oil into intermediate products for further processing at other locations to produce gasoline.  The Facility receives crude oil from many sources via pipeline, stores it in tanks onsite, and processes the crude oil into products to be shipped elsewhere by pipeline, railcar, and truck.  The refining process separates the crude oil into four products: gas oil, naphtha (pressure distillate), sulfur, and coke (solid carbon based material).  The sulfur is generated because oil contains significant quantities of sulfur that must be removed to produce gasoline. The gas oil and naphtha products are also stored in the Facility's Storage Tanks prior to shipping by pipeline, while the solid sulfur and solid coke are shipped offsite by truck or railcar.   The Facility also has the utility and support systems required to provide for safe operation of the plant, including a power generation facility to make use of gas generated in the Refining Process.\r\n\r\nThe RMP effort at the Facility was divided into three phases. First, the Facility"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000048028,
      "SummaryText": "determined which processes are covered by the EPA Regulation. Phase I measured the quantities of regulated substances to determine which processes are subject to EPA RMP and Cal-ARP.  In Phase II, the Facility conducted the required Hazard Assessment as defined by the regulation.  The Hazard Assessment modeled accidental release scenarios that provided Phillips 66 with insight about the potential for onsite processes to affect the surrounding community and the environment.  Phase III of the RMP contains our Executive Summary of the overall RMP effort at the Facility, a synopsis of the Prevention Program, and a description of the Management Systems in place to implement and maintain the Facility's risk management measures. The Executive Summary and Data Elements are submitted to the Federal EPA, the State of California, and the County of San Luis as part of its Risk Management Plan.\r\n\r\nThe Santa Maria Facility Refining & Offplot Units are covered by EPA RMP with the Regulated Substance Class of Flammables over the TQ at Program Level 1.\r\n\r\n    \r\nAccident & Release Prevention Program\r\n\r\nThe following is a summary of the general Accident & Release Prevention Program in place at the Santa Maria Facility.  Because processes at the Facility that are regulated by the EPA RMP regulation are also subject to the Cal-OSHA PSM standard, this summary addresses each of  the Cal-OSHA PSM elements and  describes  the management  system in place to implement the accident prevention  program.   Each section below contains a brief summary of the prevention program elements and the department responsible for implementation.   Each summary also designates the responsible party for each element.\r\n\r\nEmployee Participation\r\n     \r\nThe Santa Maria Facility encourages employees to participate in all facets of process safety management and accident prevention. The program actively involves employees in all parts of PSM, Risk Management, and Loss Control Programs. Examples of employee partici"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000048028,
      "SummaryText": "pation include the following:\r\n\r\n¿\tIntroductory and refresher training for all Facility personnel regarding the hazards of the process and process safety management\r\n¿\tOperator preparation and annual review of written operating procedures\r\n¿\tOperations participation in various Process Hazard Analyses at the Facility\r\n¿\tJob-specific training programs for all employees, including safe work practices\r\n¿\tRegular Safety Meetings on pertinent topics at the Facility\r\n¿\tOperations and Maintenance participation in incident investigations\r\n¿\tReview of Management of Change projects by personnel in Technical Services, Operations, and Maintenance\r\n¿\tA unified Emergency Response Program and inclusion of various personnel in annual drills\r\n     \r\nAll PSM and RMP related documents are available to personnel through the Facility's computer network and through document copies throughout the Facility. Specific ways that employees can be involved in the accident prevention program are documented in the PSM Program and Loss Control Procedures.  The Facility also utilizes its Joint Labor-Management Health and Safety Committee to participate in the requirements outlined by PSM. The Health & Safety Department is responsible for administering the Employee Participation portion of the Prevention Program.\r\n\r\nProcess Safety Information\r\n    \r\nThe Santa Maria Facility keeps all technical documents that are used to help maintain safe operation of the processes.  The Facility utilizes a computer-based document management system known as Livelink. Livelink enables personnel to access documentation required for PSM.  The Livelink system operates through the Facility's computer network and is accessible from many computer terminals throughout the Facility.    In addition to the Livelink system, the Facility maintains paper copies of all design data sheets, SDSs, process hazard analyses, operating procedures, and emergency response procedures at various locations throughout the Facility.   It  is  th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000048028,
      "SummaryText": "e Facility's  goal  to  make  the Process  Safety  Information easily accessible  to  all personnel  as  required by PSM and RMP.  All personnel have been trained about the basics of navigating the Livelink system.  Chemical-specific information,   including exposure hazards and emergency response/exposure treatment considerations, is provided in Safety Data Sheets (SDS).  SDSs are available online through the WebMSDS system and in SDS manuals in the Health & Safety Department.  The Facility also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment, etc.   This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and Facility changes to ensure that safety features in the process are not compromised.  All Process Safety Information is updated regularly as part of the MOC process, and procedures are updated at least every 3 years as part of the procedure review.  All process drawings are maintained by the Drafting Department and are available for viewing on the Livelink system.   All Process Safety Information is made available for any Process Hazard Analysis conducted at the Facility. The Technical Services and Operations Departments are responsible for implementing the Process Safety Information portion of the Prevention Program.\r\n\r\nProcess Hazard Analysis (PHA)\r\n     \r\nThe Santa Maria Facility has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled.  Within this program, each Facility Unit is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.  The PHA  team identifies and evaluates hazards of the process a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000048028,
      "SummaryText": "s well as accident  prevention and mitigation  measures,  and makes suggestions  for additional  prevention  and/or mitigation  measures when  the  team  believes  such measures are necessary. The Santa Maria Facility uses the Hazard and Operability Analysis (HazOp) and Layers of Protection Analysis (LOPA) techniques to perform these evaluations.  HazOp and LOPA analysis are recognized as two of the most systematic and thorough hazard evaluation techniques.  PHAs are conducted using a team of people who have operating and engineering experience.  At a minimum, the PHA Team consists of at least three full time members:  a PHA Leader with process industry experience and training in HazOp and LOPA methodology, an Operations representative, and a Process Engineer.  The combined experience between the Operations representative and the Process Engineer must be at least eight years experience working on the process under review   Other team members are included as needed.  These members may include personnel from Maintenance, Project Managers, and Contractors. The PHA Team recommendations are reviewed and tracked using our Facility's IMPACT system.   The appropriate Facility   Engineering and Operations personnel review the recommendations from the PHA for their feasibility and impact. The Facility revalidates the Unit PHAs every five years as required by EPA and Cal-OSHA.   The PHA revalidation process incorporates any changes that occurred in the Unit during the last five years and also reviews any incidents that occurred in the Unit.  All Facility Process Units subject to Process Safety Management have undergone a PHA.  The refinery PHA Coordinator maintains a list of the Units and their respective revalidation dates. The Facility utilizes the services of a Contractor to facilitate and scribe the Process Hazard Analyses.  The Facility also utilizes a computer program (PHAPro) specifically programmed to document the Process Hazard Analyses.  For each PHA, the Operations"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000048028,
      "SummaryText": "representative and other inexperienced PHA Team members are given HazOp and LOPA introductory training  and  receive guidance  from  the  PHA Team Leader  of  their  PHA  responsibilities.   All PHA documents are available for review on the Livelink system and from the PHA Coordinator. The Health & Safety Department is responsible for implementing the Process Hazard Analysis portion of the Prevention Program.\r\n\r\nOperating Procedures\r\n     \r\nThe Santa Maria Facility maintains a complete set of written procedures for Operations and Maintenance that address all modes of process operations, including Unit startup, normal operations, shutdown, and emergency shutdown.   Operating Procedures serve as a basis for training and operation of the Units, and ensure that the process is operated consistently and safely by all personnel.    As part of the Operations Administration Procedure, the Facility reviews and updates the procedures to ensure that they are accurate and reflect the current state of operation and process improvement. The scheduled procedure review addresses at a minimum:\r\n\r\n¿\tCurrent operating practices, including changes that result from changes to process chemicals, technology and equipment.\r\n¿\tOperating Limits including consequences of process deviation and steps necessary to avoid deviation.\r\n¿\tSafety and health considerations, including: \r\n\t        - Properties of, and hazards presented by, chemicals in the process\r\n             \t- Precautions necessary to prevent exposure, including Personal Protective Equipment, engineering controls, and administrative controls\r\n             \t- Quality control of raw materials and control of hazardous chemical inventory\r\n    \t\t- Special or unique hazards\r\n    \t\t- Safety systems and their functions\r\n¿\tHazards control during operation, including lockout/tagout, hot work, confined space entry, and opening process equipment or piping.\r\n     \r\nThe Santa Maria Facility Management of Change program also includes a provision to"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000048028,
      "SummaryText": "ensure that any procedures modified by changes in the process are completed prior to implementation of the change.   All Operating Personnel are notified any time a new procedure is issued or an existing procedure is modified.  All Operating Procedures are available to Facility personnel through our online Livelink system.  Additionally, hard copies of all Operating Procedures are available at specified locations in the event of a power interruption. The Operations Department is responsible for implementing the Operating Procedures portion of the Prevention Program.\r\n\r\nTraining\r\n     \r\nThe Facility believes that well-trained Operators help ensure safe operation of the Process Units.   The Facility's training program requires employees to qualify in the operation a Process Unit prior to being assigned to that Unit, to understand the nature and causes of problems arising from process operation, and to elevate their awareness with respect to hazards of operating the processes.  Each employee assigned to a Process Unit proceeds sequentially through a planned training program to familiarize new personnel, and personnel transferring from another Unit, with Unit operations.   Personnel are not assigned to work jobs that they are unqualified to perform. Personnel must proceed through a structured, performance-based training system prior to operating the Units.   After initial Unit qualification, operators continue to learn operation of other Units in order to become more versatile and aware of other processes at the Facility.   The training program consists of the following steps:\r\n \r\n¿\tInitial Training\r\n¿\tInitial Training Testing\r\n¿\tJob Specific Training/MTS Training Manual\r\n¿\tJob Specific On-The-Job Training Equipment Check-off\r\n¿\tJob Specific Written/Practical Demonstration Test\r\n¿\tJob Specific Refresher Training\r\n\r\nOperators must pass both the Qualification Test and Performance Test when qualifying for a Unit.   The Qualification Test consists of a written test pertaini"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000048028,
      "SummaryText": "ng to the Unit Process, procedures, health hazards, and safety on the job.  The Performance Test is a field test administered to determine if an employee can transfer written knowledge acquired to the actual hands-on tasks in the field.  All tests and training materials are maintained in personnel files.  Prior to assignment at a Unit, Management and the Operator's Supervisor must sign-off that the affected Operator is prepared to work the Unit by reviewing with the Operator both the written and in-the-field tests. A general outline for initial and refresher training for personnel includes:\r\n\r\n     I.   An overview of the process (job specific)\r\n     II. Operating Procedures applicable to each job\r\n     III. Steps for each operating phase including:\r\n¿\tInitial Startup\r\n¿\tNormal Operation\r\n¿\tTemporary Operation\r\n¿\tEmergency Operation\r\n¿\tEmergency Shutdown\r\n¿\tNormal Shutdown\r\n¿\tStartup following a Turnaround\r\n¿\tStartup following an Emergency Shutdown\r\n     IV. Operating Limits and consequences of deviation\r\n     V.  Safety and Health considerations\r\n     VI. Safety Systems and their functions\r\n\r\nPersonnel may also take part in the Facility's Emergency Response Team by completing specific training and testing.   The Facility utilizes trained onsite personnel to respond in case of emergency. The Human Resources Department is responsible for implementing the Operator Training portion of the Prevention Program.\r\n\r\nContractors\r\n     \r\nThe Santa Maria Facility employs numerous Contractors to perform Unit maintenance and construction. Therefore, Contractors must adhere to similar or identical safety standards as Facility personnel. The Facility outlines safety and training programs for Contractors.  Contractors are trained by onsite personnel about the hazards of the Process, safety procedures and equipment requirements, and the emergency response procedures onsite prior to commencement of work.   All Contractors performing operations at the Facility must complete the Facili"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000048028,
      "SummaryText": "ty Safety Orientation Program.  The Safety Orientation Program includes Rules of Conduct, Emergency Procedures, HazCom, PSM, Hearing Conservation, TSCA and RCRA topics, which are required by Phillips 66' Contractor Standard.  Contractor companies must also provide basic safety training to their own employees as required by State and Federal Regulations.  Contractors are advised of the Facility's Communication Program. The Facility screens Contractors' own Safety Programs and safety performance prior to awarding contracts at the Facility.    Contractors must be approved via a qualification procedure.  The review process ensures the Facility's compliance to Corporate Standards and to regulatory requirements for employing the services of Contractors.  Information regarding a Contractor's area of expertise, financial stability, safety history, safety and health policies and programs, employee training, regulatory compliance, insurance coverage and other areas of interest to the Facility are solicited prior to starting work at the Facility. Facility personnel periodically monitor Contractor performance to ensure that Contractors are fulfilling their conduct, training, and safety obligations. The Procurement Department and the Health & Safety Department are responsible for implementing the Contractors portion of the Prevention Program.\r\n\r\nPre-Startup Safety Reviews (PSSRs)\r\n     \r\nThe Santa Maria Facility conducts a PSSR for any new Facility or Facility modification that requires a change in the Process Safety Information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.   This review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready.  The PSSR is conducted as part of the Facility's Management of Change process just prior to startup a"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000048028,
      "SummaryText": "nd final acceptance of the project.  Department Supervisors review and approve their department checklists to ensure that the project is safe and operable.  Technical Services, Operations, Maintenance, Reliability, and Environmental Department Supervisors all review and sign off on their respective checklists prior to startup. The Operations/Technical Services Department is responsible for implementing the Pre-Startup Safety Review portion of the Prevention Program.\r\n\r\nMechanical Integrity\r\n     \r\nThe Santa Maria Facility has well-established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems, in a safe operating condition.  The main parts of the program are outlined below.  In combination, these activities form a system that maintains the mechanical integrity of the process equipment.\r\n\r\n     Program Section     \tPurpose\r\n\r\n     Code Compliance            Ensuring that all process equipment is designed with the appropriate codes and industry standards.\r\n\r\n     Training            \tEnsuring that inspectors and operators are inspecting properly and are alert to abnormal conditions and corrosion/wear.\r\n\r\n     Inspection Procedures      Ensuring that inspections are consistent throughout the Facility and that all inspections are conducted safely.\r\n                \r\n     Inspection Schedules       Ensuring that inspections are conducted as frequently as required by code or by equipment service/life time, and providing a baseline for corrosion rates.\r\n\r\n     Quality Assurance   \tEnsuring that all changes and equipment replacements/upgrades are compliant with code requirements and meet design specifications prior to startup.\r\n     \r\nThe Mechanical Integrity Program is maintained by nearly all Facility departments. Each department has responsibilities for different program aspects.   The equipment type and primary responsibility are outlined below.\r\n     \r\n     \tEqu"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000048028,
      "SummaryText": "ipment Type        \t\tPrimary Responsibility\r\n\r\n    \tPressure Vessels       \t\tInspection Department\r\n\tHeat Exchangers       \t\tInspection Department\r\n \tFired Heaters & Boilers   \tInspection Department\r\n    \tPiping & Fittings      \t\tInspection Department\r\n \tPressure Relief Devices   \tInspection Department\r\n      \tStorage Tanks        \t\tInspection Department\r\n   \tRotating Equipment           \tMaintenance\r\n        Valves                          Maintenance\r\n     \tControl Valves                  Maintenance\r\n     \tInstrumentation            \tMaintenance\r\n  \tElectrical Equipment          \tMaintenance\r\n \tStructures/Foundations      \tTechnical Services\r\n \tHoists/Lifts/Materials Handling Maintenance\r\n \tFire Protection Systems         Health & Safety\r\n     \r\nThe Mechanical Integrity Program covers equipment used to process, control, and store hazardous chemicals and assigns responsibility for the inspection and testing of such equipment. Written procedures help ensure that work is performed in a consistent manner and provide a basis for training.  Inspections and tests are performed to help ensure that equipment functions as intended, and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels).  If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or a Management of Change Team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment. The Santa Maria Facility incorporates quality assurance measures into equipment purchases and repairs. This helps ensure that new equipment is suitable for its intended use, and that proper materials and spare parts are used when repairs are made.  Quality Assurance is determined as part of the Management of Change Program. The Technical Services Department is responsible for implementing the Mechanical Integrity portion of the Prevention Program.\r\n\r\nSaf"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000048028,
      "SummaryText": "e Work Practices\r\n     \r\nPhillips 66 Santa Maria Facility provides a safe and healthy work place for the employees at the Facility, Contractors, visitors, and the community surrounding the Facility.  Safe work practices are in place to ensure that common hazardous activities are conducted safely. These safe work practices and procedures, along with training of affected personnel and Contractors, form a system to help ensure that operations and maintenance activities are performed safely.   Examples of standard safe work practices at the Santa Maria Facility include:\r\n\r\n¿\tTracking and control of the entry/presence/exit of employees and contractors into and out of the Facility\r\n¿\tA hazardous energy procedure to ensure isolation of energy sources for equipment undergoing maintenance (i.e., Lock/Tag/Try)\r\n¿\tA procedure for safe removal of hazardous material before process piping or equipment is opened\r\n¿\tA permit and procedure to control spark producing activities (i.e., Hot Work)\r\n¿\tA permit and procedure to ensure that adequate precautions are in place before entry into a confined space \r\n\r\nIn addition to the Safe Work Practices outlined above, the Santa Maria Facility conducts regular Physical Conditions Audits to ensure compliance with Federal, State, local regulations, and Company loss control requirements.  The intent of the inspections is to:\r\n\r\n¿\tDetermine the effectiveness of the Facility's loss control system\r\n¿\tEstablish a level of compliance\r\n¿\tIdentify hazards and substandard conditions/practices for correction\r\n¿\tGive recognition for exceptional compliance\r\n\r\nSpecific physical conditions inspections are conducted for each Process Unit, storage and tankage areas, maintenance facilities, warehouse, laboratory, office buildings, and contractor work sites. The Health & Safety Department administers the Safe Work Practice portion of the Prevention Program.\r\n\r\nManagement of Change\r\n\r\nThe Santa Maria Facility has a comprehensive system to manage changes to proces"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000048028,
      "SummaryText": "ses.  The Management of Change procedure has been implemented in order to ensure that all installations and changes to equipment are made in a manner that ensures safety and operability.    Whenever equipment or installations are modified, new facilities are added, or process changes are necessary, a review by appropriate Engineering, Operations, Maintenance, Safety, and Environmental personnel is conducted.   For all changes, a Management of Change proposal is submitted for consideration through our KMS Resolution Tracker system. This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other Facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to:\r\n\r\n¿\tEnsure that adequate controls are in place to manage any new hazards, and\r\n¿\tVerify that existing controls have not been compromised by the change\r\n\r\nProjects proceed from the initial MOC proposal through a planned sequence of signoffs designed to ensure that all parties are aware of the changes being implemented.  Affected Process Safety Information, including chemical hazard information, process operating limits, and equipment information, as well as procedures, is updated to incorporate these changes.  In addition, operating and maintenance personnel are provided any necessary training on the change.  Prior to startup, the MOC procedure requires a Pre-Startup Safety Review (PSSR) described above. The Technical Services Department is responsible for implementing the Management of Change portion of the Prevention Program.\r\n\r\nIncident Investigation\r\n    \r\nThe Santa Maria Facility promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury. Notification of incidents is made immediately so appropriate action can be taken and investigations can be initia"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000048028,
      "SummaryText": "ted.   Investigation activities are directed toward defining the facts and circumstances related to the event, determining the causes, and developing corrective measures.  The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings. Investigations of serious incidents include Management, Engineering, Operations, and Health & Safety staff as appropriate. Incident investigation reports are retained for at least five years so that the reports can be reviewed during future Unit Process Hazard Analyses.   The Santa Maria Facility uses the web-based IMPACT Enterprise incident reporting and tracking system. The Health & Safety Department is responsible for coordinating the Incident Investigation portion of the Prevention Program.\r\n\r\nCompliance Audits\r\n    \r\nTo help ensure that the Accident Prevention Program is functioning properly, the Santa Maria Facility periodically conducts audits to determine whether the procedures and practices required by the Accident Prevention Program are being implemented. Compliance audits currently are conducted for PSM at least every three years.  The RMP Program and Hazard Assessment are included in the triennial audit. The audit is typically broken down into three phases. Phase I involves a question and answer session with various Facility personnel to determine regulatory compliance.  Phase II involves performing spot verifications to confirm that programs meet the intent of the standards.  Phase III consists of a series of interview questions with various employee groups to gauge the effectiveness of the programs. Audit Findings are forwarded to appropriate Facility personnel for tracking and resolution.   The final resolution of each Finding is documented and the two most recent audit reports are retained. The Health & Safety Department is responsible for implementing the Compliance Audit portion of the Pr"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 1000048028,
      "SummaryText": "evention Program.\r\n\r\nChemical Specific Prevention Steps\r\n    \r\nThe processes at the Santa Maria Facility have hazards that must be managed to ensure continued safe operation.  The Accident Prevention Program summarized previously is applied to all processes at the Facility.    Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors. Some of the administrative programs to prevent, detect, or mitigate an incident at the Facility are presented above.  Specific safety equipment and procedures, know as safeguards, are in place at the Facility.   These safeguards are listed as part of the Process Hazard Analyses, Process Safety Information, and in the Operating Procedures.  Some examples of safeguards are presented below:\r\n\r\nRelease Detection\r\n¿\tHydrogen Sulfide detectors with alarms\r\n¿\tFacility Alarm System to notify personnel in case of emergency\r\nRelease Containment/Control\r\n¿\tProcess relief valves to protect all pressure vessels\r\n¿\tOperating materials recovery system with process flare to incinerate excess materials from the process\r\n¿\tManual and automatic valves to permit isolation of the process\r\n¿\tAutomated shutdown systems for specific process parameters\r\n¿\t\"Fail-Safe\" valves to isolate equipment in case of unplanned events such as power failures and earthquakes\r\n¿\tContainment around all tanks and process areas to contain liquid materials\r\n¿\tBackup power supply for critical process equipment\r\n¿\tTank vapor recovery system to contain hazardous tank vapors\r\nRelease Mitigation\r\n¿\tFire suppression and extinguishing systems\r\n¿\tDeluge system for specific equipment\r\n¿\tTrained emergency response personnel\r\n¿\tPersonal Protective Equipment (e.g., protective clothing, self-contained breathing apparatus)\r\n¿\tBlast-resistant buildings to help protect control systems and personnel\r\n¿\tBackup fire protection equipment\r\n\r\n\r\nFive Year Accident History\r\n\r\nThe EPA RMP rule requires facilitie"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 1000048028,
      "SummaryText": "s to compile a Five-Year Accident History for certain releases.  The release must be from a covered process and involve a regulated substance held above its threshold quantity in the process.  The release must have caused at least one of the following:\r\n\r\n¿\tOnsite deaths, injuries, or significant property damage\r\n¿\tKnown offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering-in-place\r\n\r\nThe Facility documents and tracks all incidents and near misses that occur within the Facility.  This incident database served as the basis for the Five-Year Accident History presented here.\r\n\r\nThe Santa Maria Facility did not experience any incidents in the past five years that qualify for reporting in the five year accident history. \r\n\r\n     \r\nEmergency Response Program\r\n     \r\nThe Phillips 66 Santa Maria Facility has adopted the Incident Command System to ensure a safe and effective response to Facility emergencies.  The Facility is prepared to respond to all emergencies internally, with support from outside authorities if needed. The Facility's Emergency Response Team (ERT), consisting of at least two Supervisory personnel and four operators, responds to all Facility emergency incidents.  If Initial Response personnel cannot mitigate the incident, an Advanced Response is implemented utilizing additional Facility personnel and external assistance.  Emergencies requiring response by the Facility include:\r\n\r\n¿\tFire or potential fire\r\n¿\tGas or Oil Release\r\n¿\tSerious injury/illness\r\n¿\tRelease of toxic chemical\r\n¿\tEmergency requiring search and rescue\r\n\r\nThe Facility has prepared for onsite emergencies through a variety of training drills and procedures.   As part of the Emergency Response Plan - Pre-Emergency Planning & Training Program the Facility has provided:\r\n\r\n¿\tPersonnel training for fire fighting, hazard communication, incident command, first aid/CPR, SCBA, and hazardous waste worker training to prevent and respond to emergencies.\r\n¿\tEvacua"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 1000048028,
      "SummaryText": "tion routes and safe areas for all Facility personnel, visitors, and Contractors, as well as attendance and check in procedures.\r\n¿\tAvailability of external assistance of local fire and rescue, medical, and environmental clean-up organizations to provide assistance during advanced responses.\r\n¿\tEmergency equipment and supplies maintained throughout the Facility to respond to anticipated incidents.\r\n¿\tCommunications networks, including back-up systems, established for internal and external communications.\r\n¿\tPre-emergency plans, including ongoing hazard specific pre-fire plans, developed to provide guidance in responding to emergencies in an organized and effective manner to protect onsite personnel, surrounding communities, and the environment.\r\n¿\tEmergency response drills scheduled on a monthly and annual basis to ensure efficient response by onsite personnel.\r\n\r\nThe Santa Maria Facility supplies Emergency Response Team members with respiratory protection and personal protective clothing for use while responding to emergencies.  This equipment is designed to allow the ERT to work safely during an emergency.  A variety of fire fighting and spill containment materials are located at the Facility or stationed nearby for response to emergencies.  All equipment is inspected, maintained, and replaced regularly to ensure dependable performance. The Facility uses five different systems to disseminate emergency instructions and information within the Facility.  Those systems include:\r\n\r\n¿\tPlant Alarms (Facility General Alarm, Sulfur Plant Alarm, H2S Gas Release Alarm, Evacuation Alarm)\r\n¿\tEmergency Public Address System\r\n¿\tInternal Portable Radio Network\r\n¿\tPlant and External Telephones\r\n¿\tPagers\r\n\r\nThe  Facility's initial response to  an  emergency  is essential  to successfully control an incident  without the  need  for  advanced response.  By controlling an incident during initial response, the Facility reduces the risk to the initial responders, ERT, operating personne"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 1000048028,
      "SummaryText": "l, the public, and the environment.   The Facility has predefined emergency response responsibilities, which onsite personnel fill in case of an emergency.  Those positions include:\r\n     \r\n        Incident Commander\r\n\tCommand Staff Coordinator\r\n\tPublic Information Officer\r\n\tCommunications Officer\r\n\tLiaison Officer\r\n\tOperations Chief\r\n\tStaging Support\r\n\tPlanning Chief\r\n\tPlanning Support\r\n\tLogistics Chief\r\n\tLogistics Support\r\n\tSafety Officer\r\n\tFinance Chief\r\n             \r\nWhen the Incident Commander believes that additional Phillips 66 emergency response personnel are required to handle an emergency, the IC will direct the Communications Officer to contact standby shift personnel and will notify the Security Office to activate our automated personnel emergency notification system (Communicator! NXT).  The Incident Commander makes the determination when external assistance or reporting is required.   The Facility may request assistance from any of the following agencies:\r\n     \r\n          San Luis Obispo County CalFIRE               \t        Pacific Gas & Electric\r\n          Arroyo Grande Hospital    \t\t\t\tUnion Pacific Railroad\r\n          California Highway Patrol       \t\t\tSan Luis Obispo County Emergency Services\r\n          San Luis Obispo County Sheriff    \t\t\tCalifornia Office of Emergency Services\r\n          Federal Bureau of Investigation (FBI)\t\t        National Response Center\r\n          San Luis Obispo County CUPA\r\n     \r\nExternal assistance will normally be called only during advanced emergencies at the instruction of the Incident Commander.  The Facility has around-the-clock communications capability with appropriate officials and emergency response organizations.  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  Emergency situations that may endanger human health or the environment outside the Facility will be reported to the Local Emergency Services Organization (San Luis Obis"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 1000048028,
      "SummaryText": "po County Emergency Services).  They, in turn, may notify appropriate State and local response organizations to respond to the scene and lead offsite evacuation efforts.\r\n\r\n¿\tIn the event of an uncontrolled release of potentially toxic chemicals or flammable materials, the Facility will perform emergency exposure air monitoring in addition to the emergency response efforts.  This monitoring will be conducted primarily to help quantify atmospheric exposures to the community and to help identify protection requirements.\r\n\r\nThe Facility is also prepared to deal with offsite incidents potentially affecting the Facility.   The nature of the emergency shall dictate the degree of response:   Minimal, Moderate, or Advanced.   The responses are outlined below:\r\n\r\n¿\tMinimal Response: Incident requires minimal onsite response, typically Security\r\n¿\tModerate Response: Incident requires resources such as Security, EMT personnel, and ambulance or law enforcement notification\r\n¿\tAdvanced Response: Incident such as wildland fire, flood or earthquake, requiring an advanced response of the ICS System, potentially using outside resources like the San Luis Obispo County CUPA, San Luis Obispo County CalFIRE, California Highway Patrol, local and county fire and paramedic resources, and law enforcement.\r\n\r\nA copy of the Facility's Emergency Response Plan is provided to the local emergency response agencies.  The Plan provides detailed information on the Facility's emergency response organization, procedures and resources.  Facility emergency response personnel periodically meet with local agency representatives to discuss response capabilities and to look for new ways to improve overall emergency response preparedness."
    }
  ]
}