{
  "FacilityID": 1000044951,
  "FacilityName": "Helena Agri-Enterprises, LLC - Albion, NE Facility",
  "FacilityStr1": "2493 State Highway 14",
  "FacilityStr2": null,
  "FacilityCity": "Albion",
  "FacilityState": "NE",
  "FacilityZipCode": "68620",
  "Facility4DigitZipExt": "5040",
  "FacilityCountyFIPS": "31011",
  "LEPC": "Boone LEPC",
  "FacilityLatDecDegs": "41.698102",
  "FacilityLongDecDegs": "-098.007373",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "helenachemical.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7036759,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Helena Agri-Enterprises, LLC",
  "OperatorStr1": "P.O. Box 110",
  "OperatorStr2": null,
  "OperatorCity": "Albion",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68620",
  "OperatorZipCodeExt": "0110",
  "RMPContact": "Bryant Borer",
  "RMPTitle": "Operations Manager",
  "FTE": 15,
  "OtherEPAFacilityID": "47-267-NB003",
  "EPAFacilityID": "100000104291",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-03-05 00:00:00",
  "SafetyInspectionBy": "Nebraska State Fire Marshall",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-02-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-12-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-12-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-12-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.69883,
  "FRS_Long": -98.00917,
  "FRS_Description": "OTHER",
  "FRS_Method": "ADDRESS MATCHING-NEAREST INTERSECTION",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055638,
      "AltID": "Storage & Handling (AA)",
      "FacilityID": 1000044951,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000056556,
          "ProcessID": 1000055638,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067886,
          "ProcessID": 1000055638,
          "ChemicalID": 56,
          "Quantity": 130771.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000567886,
          "ProcessID": 1000055638,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000055639,
      "AltID": "Fertilizer Blending",
      "FacilityID": 1000044951,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000060552,
          "ProcessID": 1000055639,
          "NAICSCode": "325314",
          "_desc": {
            "NAICS_CODE": "325314",
            "NAICS_DESCRIPTION": "Fertilizer (Mixing Only) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067887,
          "ProcessID": 1000055639,
          "ChemicalID": 56,
          "Quantity": 84067.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000567887,
          "ProcessID": 1000055639,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044951,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nThis Process Safety Management (PSM) and Risk Management Plan (RMP) Program document (PSM/RMPr) was prepared on behalf of Helena Chemical Company (HCC) pursuant to the requirements of the Clean Air Act ? 112(r) as codified by the Occupational Safety and Health Administration (OSHA) at 29 CFR ? 1910.119 and by the U.S. Environmental Protection Agency (EPA) at 40 CFR ?68.  The OSHA PSM and EPA Subpart D RMP standards are applicable to operations at the Albion, NE Facility.  At this Facility, HCC engages in the agricultural chemical storage and handling, fertilizer blending, and technical support and distribution (i.e. retail) to customers, most of who use HCC's products to support agricultural operations.\n\n\n\nThis electronic submittal provides conservative estimates of the offsite consequences of an accidental release of anhydrous ammonia from the Albion Facility located at 2493 State Highway 14, Albion, NE 68620.  The electronic RMP summarizes the policies and procedures implemented by the Albion Facility to minimize the likelihood of an accident.  The electronic RMP also summarizes the actions that the Albion Facility has taken to ensure that a response to a release (even though a release is unlikely) will be implemented in a proper and timely manner.\n\n\n\nPURPOSE FOR UPDATING RMP\n\n\n\nHCC is resubmitting this RMP as a 5-Year update.  All relevant sections for a Program 3 PSM/RMPr Facility have been addressed.\n\n\n\nFACILITY\n\n\n\nThe Operations at the Albion Facility consists of agricultural chemical storage and handling, blending, retail sale and distribution.  As related to the PSM/RMPr, the Albion Facility stores and handles one covered chemical (i.e. anhydrous ammonia) at quantities that exceed the threshold quantity established by EPA.  Two covered processes are operated at this Facility and they include:\n\n\n\no    Covered Process 1: Storage and Handling (Anhydrous Ammonia)\n\no    Covered Process 2: Fertilizer Blending\n\n\n\nAnhydrous ammonia is transported to t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044951,
      "SummaryText": "he Facility via a commercial tanker truck (9,600- gallon) and then transferred to one (1) 18,000-gallon stationary storage tank.  The commercial tanker truck operator (Vendor/Contractor) performs these transfer operations.  \n\n\n\nAt this Facility, anhydrous ammonia is either loaded out into nurse tanks for retail sale to the end user or is blended with water and phosphoric acid to make ammonium polyphosphate.  Ammonium polyphosphate is a liquid fertilizer that is used by farmers on a seasonal basis.  Covered process equipment used in this process includes a stationary storage tank for the storage of the anhydrous ammonia and a Mobile Pipe Reactor (MPR).  The stationary storage tank is owned by HCC, and the MPR is owned and operated by an Independent Fertilizer Reacting Contractor (IFRC).  When the IFRC arrives to the Facility, the Facility transfers the responsibility of the anhydrous ammonia in the stationary storage tank to the IFRC.  At this point, the IFRC connects the stationary storage tank or commercial tanker truck to the MPR by transfer hoses and prepares to operate the MPR to blend the ammonium polyphosphate.  When the IFRC is complete with its operations, the IFRC transfers the responsibility for the anhydrous ammonia in the stationary storage tank back to the Facility.  \n\n\n\nOFF-SITE CONSEQUENCE ANALYSIS\n\n\n\nWorst case and alternative case offsite consequence analyses were completed for both the ammonia storage process and the reacting process.  The worst case release scenario is the same for the both the ammonia storage and the reacting process because the largest vessel (i.e. an 18,000-gallon stationary storage tank) is common to both of the covered processes when connected.  The worst case scenario release for the Albion Facility was modeled as if the 18,000-gallon stationary storage tank was punctured on the side at the ground level and the resulting release being a ground level horizontal jet at the maximum temperature.\n\n\n\nThe alternative (or more likel"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044951,
      "SummaryText": "y to occur) scenarios are the same for the two processes.  For the anhydrous ammonia storage and handling covered process, the alternative consequence analysis assumes that a 30-second release from a ruptured 3-inch transfer hose caused by an impact from a vehicle or some other source on the liquid ammonia transfer hose during a loading or unloading operation.  For the fertilizer blending process, the alternative consequence analysis assumes that a 30-second release from a ruptured 3-inch liquid transfer hose is severed during the blending process.  Although these events are classified as an alternative scenario, even an accident of these types is unlikely to occur due to the safety equipment (excess flow devices and emergency shutoff valves) and operating procedures that the Facility and the IFRC uses to safeguard ammonia transfer operations.\n\n\n\nACCIDENT PREVENTION PROGRAM\n\n\n\nThe Operations Manager implements the risk management planning process at this Facility.  The Operations Manager is assisted by other Helena staff, as directed.  The Operations Manager is responsible for ensuring that Facility Operators are properly trained in the implementation of the Program 3 Accident Prevention Program elements: Management System, Employee Participation, Process Safety Information, Process Hazard Analysis, Operating Procedures, Training, Contractor, Pre-Startup Review, Mechanical Integrity, Hot Work Permit, Management of Change, Incident Investigation, Emergency Response, and Compliance Audits.  \n\n\n\nThe Operations Manager is responsible for managing the IFRC in accordance with the Contractor PSM/RMP requirements.  However, the IFRC is responsible for ensuring that its Operators are properly trained in the implementation of its OSHA PSM accident prevention program.\n\n\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nHCC's Albion Facility is a non-responding facility. The Facility has coordinated emergency response activities with its local emergency response agency and local fire department"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000044951,
      "SummaryText": ".  \n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere have been no on-site deaths, injuries, or significant property damage; or off-site deaths, injuries, property damage, evacuations, or sheltering in place, in the past five (5) years because of the ammonia operations at the Abernathy Facility.\n\n\n\nCONCLUSION\n\n\n\nThe Risk Management Plan implemented by Helena Chemical Company at the Albion Facility complies with the requirements of the Clean Air Act, Section 112(r). The RMP will be updated as the Albion Facility adds, deletes, or changes processes. The Emergency Response Program has been coordinated with the Boone County LEPC.\n\n\n\nNOTE: Sections 4, 5, 6 of the standard RMP produced by EPA's RMP Submit Program are not applicable to the Albion Facility.\n\n"
    }
  ]
}