{
  "FacilityID": 1000024699,
  "FacilityName": "J.B. Gifford WWTP",
  "FacilityStr1": "1100 E. 8th Street",
  "FacilityStr2": null,
  "FacilityCity": "Michigan City",
  "FacilityState": "IN",
  "FacilityZipCode": "46360",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18091",
  "LEPC": "Laporte County LEPC",
  "FacilityLatDecDegs": "41.718300",
  "FacilityLongDecDegs": "-86.882908",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "AV",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Sanitary District of Michigan City",
  "OperatorStr1": "1100 E. 8th Street",
  "OperatorStr2": null,
  "OperatorCity": "Michigan City",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46360",
  "OperatorZipCodeExt": null,
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000213262",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-03-09 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2011-11-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-11-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2011-11-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-11-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 41.71676,
  "FRS_Long": -86.88473,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000030307,
      "AltID": "Water disinfection",
      "FacilityID": 1000024699,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000036429,
          "ProcessID": 1000030307,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000036430,
          "ProcessID": 1000030307,
          "ChemicalID": 49,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000030627,
          "ProcessID": 1000030307,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000026237,
              "Process_NAICS_ID": 1000030627,
              "SafetyReviewDate": "2011-05-26 00:00:00",
              "PHA_Date": "2010-05-11 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-04-02 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2011-03-31 00:00:00",
              "TrainingReviewDate": "2011-04-06 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-05-11 00:00:00",
              "EquipmentInspectionDate": "2011-03-28 00:00:00",
              "EquipmentTested": "Chlorinator/Sulfonator; Vacuum Regulators; Chlorine/Sulfur Dioxide Gas Detectors; Flow Proportional Controller; Container Scales; Pigtails (PE tubing); Drip Legs; System Valves; Piping and Accessories",
              "ChangeMgmtDate": "2011-03-25 00:00:00",
              "ChangeMgmtReviewDate": "2011-05-11 00:00:00",
              "PreStartupReviewDate": "2011-03-28 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "2010-04-11 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2010-05-11 00:00:00",
              "HotWorkPermitReviewDate": "2010-05-11 00:00:00",
              "ContractorSafetyReviewDate": "2011-11-10 00:00:00",
              "ContractorSafetyEvalDate": "2011-11-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000031262,
                  "PreventionProgram3ID": 1000026237,
                  "ProcessChemicalID": 1000036430
                },
                {
                  "PrimaryKey": 1000031261,
                  "PreventionProgram3ID": 1000026237,
                  "ProcessChemicalID": 1000036429
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000024699,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2010-05-11 00:00:00",
    "ERTrainingDate": "2010-03-17 00:00:00",
    "CoordinatingAgencyName": "Michigan City Fire Department",
    "CoordinatingAgencyPhone": "2198731440",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000024699,
      "SummaryText": "'s entire contents to the atmosphere in 10 minutes, the release rate would be 200 pounds per minute. The toxic end-point for the worst-case release is 1.3 miles. The distance to the toxic end-point worst-case release distance was taken from EPA's Supplemental Risk Management Program Guidance for Wastewater Treatment Plants. \r\n\r\n\r\nAlternative Release Scenario\r\nOne alternative release scenario was evaluated for the chlorine and sulfur dioxide process per USEPA 40 CFR 68.165(a)(2). The alternative release scenarios considered is in accordance with the guidelines provided in 40 CFR 68.22 and 68.28.\r\n\r\nThe scenario for the alternative release follows:\r\n\r\nConsideration was given to alternative release scenarios that were considered \"more likely.\" Even though the SDMC WWTP has never experienced a shipping container incident, this failure represented the most reasonable scenario for an alternative release to reach offsite. The worst alternate release scenario was determined to be a leak occurring during tank hook-up to the system (estimated to equate to a 1/4 inch diameter hole).\r\n\r\nThe alternative release scenario release rate and distance to the toxic endpoint was estimated using the EPA's Supplemental Risk Management Program Guidance for Wastewater Treatment Plants. The information is presented below.\r\n\r\nChlorine System\r\nHole Diameter - 1 /4 inch\r\nRelease rate - 83#/min (55% release-rate multiplicative factor by mitigation of release within a building).\r\nDistance to toxic end point (urban area) - 0.1 miles\r\n\r\nSulfur Dioxide System\r\nHole Diameter - 1 /4 inch\r\nRelease rate - 83#/min (55% release-rate multiplicative factor by mitigation of release within a building).\r\nDistance to toxic end point (urban area) - 0.1 miles\r\n\r\n68.155(d) Accidental Release Prevention Program\r\nThe Prevention Program required for compliance with 40 CFR Part 68 for Program 3 processes is identical to the prevention program required under OSHA PSM. The SDMC's WWTP aligned its prevention program with"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000024699,
      "SummaryText": "Risk Management Plan\r\nExecutive Summary\r\nUSEPA 40 CFR Part 68\r\nSubpart G\r\n\r\n\r\nIntroduction\r\n\r\nThe U.S. Environmental Protection Agency (EPA) Risk Management Program (RMP) regulations 40 CFR Part 68, require facilities that have a regulated substance above the listed threshold quantities to develop a formal Risk Management Program. The Sanitary District of Michigan City (SDMC) maintains quantities of chlorine and sulfur dioxide above the RMP threshold quantity of 2,500 and 5,000 pounds, respectively, and as such, is subject to the requirements of 40 CFR Part 68. A hazard review was completed to determine that RMP program level 3 is applicable to SDMC's chlorine and sulfur dioxide systems. \r\n\r\nThe information presented in this section is intended to describe the elements of SDMC's Risk Management Program. The format of the section corresponds to the executive summary data elements as dictated in 40 CFR Part 68 Executive Summary Section. \r\n\r\nExecutive Summary Data Elements\r\n\r\nAccording to EPA guidance the executive summary must include a brief description of the facility's Risk Management Program. The following sections list each of the required executive summary data elements by rule citation. \r\n\r\n68.155(a) Accidental Release and Emergency Response Policies\r\nThe Sanitary District of Michigan City Wastewater Treatment Plant (SDMC's WWTP) has operated their chlorination and sulfur dioxide systems without incident since starting operations. This successful operating record is due to the WWTP's commitment to training programs, operating procedures, and maintenance activities. \r\n\r\n68.155(b) Stationary Source and the Substance Handled\r\nThe Sanitary District of Michigan City WWTP operates a 15-MGD municipal wastewater treatment plant in the City of Michigan City. Chlorine is used at the treatment facility as the disinfectant for the discharge water. Sulfur dioxide is used at the treatment facility to remove chlorine prior to final discharge.\r\n\r\nChlorine for the chlorination"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000024699,
      "SummaryText": "process is stored in ton cylinders. Normally four ton cylinders are stored with two cylinders attached to the process at one time. Our present chlorine supplier is local. The chlorination process is contained within the confines of the secure wastewater treatment plant site. This prevents unauthorized personnel from accessing the area. The WWTP maintains chlorine leak detection devices within the chlorine process and in other areas where chlorine may be released. There are audible and visual alarms in the facility. \r\n \r\nSulfur dioxide for the chlorine removal process is stored in ton cylinders. Normally four ton cylinders are stored with two cylinders attached to the process at one time. Our present sulfur dioxide supplier is local. The chlorine removal process is contained within the confines of the secure wastewater treatment plant site. This prevents unauthorized personnel from accessing the area. The SDMC WWTP maintains sulfur dioxide leak detection devices within the chlorine removal process and in other areas where sulfur dioxide may be released. There are audible and visual alarms in the facility. \r\n\r\n68.155(c) Offsite Consequence Analysis\r\nOne worst-case release scenario and one alternative release scenario was assessed for the chlorine and sulfur dioxide process. To ensure a common basis for comparisons, EPA defined the worst-case scenario as the release of the largest quantity of a regulated substance from a single vessel or process line that results in the greatest distance to an endpoint. The alternative release rate is a release that is considered more reasonable or \"more likely.\" \r\n\r\nThe toxic endpoint for chlorine has been defined by EPA to be 0.0087 mg/L (3 ppm)and sulfur dioxide to be 0.0078 mg/L (3 ppm). This airborne concentration that is used as the toxic endpoint is the maximum airborne concentration below which it is believed that nearly all individuals can be exposed for up to one hour without experiencing or developing irreversible or other s"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000024699,
      "SummaryText": "erious health effects. \r\n\r\nThe distance to the toxic endpoint becomes a radius for a circle around the covered process. Residential population within the circle is required to be determined based on available census information. The population number is reported as part of the EPA submittal. This method greatly over estimates the population potentially exposed to a single chlorine or sulfur dioxide release, because the chlorine and/or sulfur dioxide plume would seek lowest elevations in the direction of the prominent winds. Since wind direction cannot be anticipated for an accidental release, EPA mandated the circle estimation method.\r\n\r\nRelease scenarios and distances to toxic endpoints are discussed in more detail in the subsequent paragraphs.\r\n\r\nWorst-Case Release Scenario\r\nWorst-Case Release Scenario is determined in accordance with the req\r\nuirements provided in 40 CFR 88.22 and 40 CFR 68.25(b,c). \r\n\r\nAs described in USEPA 40 CFR Part 68.25(b) the worst-case release shall be the greater of the following:\r\n\r\n1. The greatest amount held in a single vessel or\r\n2. The greatest amount in a pipe. \r\n\r\nFor the chlorine process at the SDMC's WWTP the worst-case release is that a 1-ton cylinder (maximum amount held in a single vessel) of chlorine ruptures and it's contents escape to the atmosphere in 10 minutes. In the event the 1-ton cylinder would release its entire contents to the atmosphere in 10 minutes the release rate would be 200 pounds per minute. The toxic end-point for the worst-case release is 1.3 miles. The distance to the toxic end-point worst-case release distance was taken from the EPA's Supplemental Risk Management Program Guidance for Wastewater Treatment Plants. \r\n\r\n\r\nFor the sulfur dioxide (chlorine removal) process at SDMC's WWTP, the worst-case release is that a 1-ton cylinder (maximum amount held in a single vessel) of sulfur dioxide ruptures and it's contents escape to the atmoshphere in 10 minutes. In the event the 1-ton cylinder would release it"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000024699,
      "SummaryText": "OSHA in 2010. The SDMC's WWTP continuously evaluates and updates their safety and prevention procedures as needed. The SDMC's WWTP prepared the process hazard analysis for the chlorine and sulfur dioxide systems in preparation for the development of the Risk Management Plan.\r\n\r\n68.155(e) Five-year Accident History\r\nThe chlorination and dechlorination facility has been in place since 1955. No accidents, as described under 40 CFR 68.42(a), have occurred at this facility since it began operation.\r\n\r\n68.155(f) Emergency Response Program\r\nThe emergency response program established by the SDMC's WWTP does not require personnel to act as the site incident commander. In the case of an incident, the Michigan City Fire Department becomes the incident commander and assumes the role of directing response activities, including any community emergency evacuation measures. The facility's Emergency Response Plan is coordinated with the LaPorte County LEPC.\r\n\r\n68.155(g) Safety Improvements\r\nThe facility is currently in the process of evaluating the safety improvement recommendations developed from a 3rd party health and safety inspection of the facility. Any improvements made in response to the recommendations will be documented and added to the PSM/RMP documentation.\r\n\r\nConclusion\r\n\r\nAs part of the Sanitary District of Michigan City Wastewater Treatment Facility's commitment to safety and respect for the hazards associated with the handling and storing of chlorine and sulfur dioxide, the SDMC's WWTP continually strives to find and implement opportunites to reduce the risk associated with these chemicals."
    }
  ]
}