{
  "FacilityID": 1000038749,
  "FacilityName": "Central Valley Ag  Bradshaw West NH3",
  "FacilityStr1": "1365 C Road",
  "FacilityStr2": null,
  "FacilityCity": "Bradshaw",
  "FacilityState": "NE",
  "FacilityZipCode": "68319",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31185",
  "LEPC": "York LEPC",
  "FacilityLatDecDegs": "40.881009",
  "FacilityLongDecDegs": "-097.789422",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "www.cvacoop.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Central Valley Ag",
  "OperatorStr1": "2803 North Nebraska Avenue",
  "OperatorStr2": null,
  "OperatorCity": "York",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68467",
  "OperatorZipCodeExt": null,
  "RMPContact": "Phil Pelc",
  "RMPTitle": "Senior Safety Director",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000017625",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-02-09 00:00:00",
  "SafetyInspectionBy": "Nebraska State Fire Marshal",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-09-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-01-31 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-01-31 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-01-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.8872,
  "FRS_Long": -97.7457,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ZIP+2 CENTROID",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000047599,
      "AltID": "Product Storage",
      "FacilityID": 1000038749,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000048023,
          "ProcessID": 1000047599,
          "NAICSCode": "49313",
          "_desc": {
            "NAICS_CODE": "49313",
            "NAICS_DESCRIPTION": "Farm Product Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000057748,
          "ProcessID": 1000047599,
          "ChemicalID": 56,
          "Quantity": 753000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000557748,
          "ProcessID": 1000047599,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000038749,
      "SummaryText": "CENTRAL VALLEY AG                                         BRADSHAW  WEST  NH3 PLANT\n\nCompany Name                                                     Plant Location\n\n\n\nP.O. Box 429  York, NE  68467\n\nMailing Address\n\n\n\nRisk Management Plan- EXECUTIVE SUMMARY\n\n\n\n\n\nFacility Policy:\n\n\n\nThe management and employees operating each of our facilities are committed to the prevention of an accidental release of hazardous material transported or stored on our locations.  In the event an accidental release should occur, we are prepared to work with our Local Fire Company(s), Emergency Response Personnel, and other appropriate authorities deemed applicable depending on the specific incident, to best mitigate any release and to minimize the impact of the release to people and the environment.\n\n\n\nFacility Information:\n\n\n\nThe primary activity of our company is NAICS code 422510, A?establishments primarily engaged in operating country or terminal grain elevators,A? however we are also engaged in providing A?agricultural inputsA? that include the receiving, storage, and reloading of Anhydrous Ammonia for delivery to farmers in our area.  The NAICS code we feel most applicable for receiving, storing, and reloading Anhydrous Ammonia is #493130 A?farm product warehousing and storage.A?  Although Anhydrous Ammonia is the only product subject to the EPA Risk Management Plan at this time, it should be noted that we also handle Propane for both agricultural uses and home heating, which is under consideration as a listed substance.  We include Propane (as well as all crop protectants and petroleum products) in our planning, training, and maintenance programs, however only the Anhydrous Ammonia facilities will be included in this report.\n\n\n\nAnhydrous Ammonia is received, stored, and distributed for direct application to farm fields during the early spring and fall months.  During the balance of the year little if any product transfer occurs.  The maximum Quantity stored in pressurized permane"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000038749,
      "SummaryText": "nt storage vessels at the location described is 753,000 Lbs.  The maximum on site vessel  is 30,000 Gallons, storing 131, 325 Lbs.  The maximum quantity handled at a given time would be the off loading of a semi-trailer tank (ranging from 40,000 to 42,000 lbs.)\n\n\n\nThe facility is operated on an as needed basis with staff present only during the receiving and reloading of product for delivery.  Total annual hours for these needs do not meet the 2,080-hour requirement to qualify as a A?full-time employeeA? on site, therefore item number 1.11 is zero.  Time expended for these inspections is not included in our staffing calculation.\n\n\n\n\n\n\n\nAccidental Release Program:\n\n\n\nOur Anhydrous Ammonia accidental release program is based on guidelines found in the American National Standards Institute, Inc. (ANSI) standard K-61.1 Safety Requirements for the Storage and Handling of Anhydrous Ammonia; and the U.S. Occupational Safety and Health Administration (OSHA)standard 29CFR 1910.111 Storage and Handling of Anhydrous Ammonia.  We conduct annual employee training on the safe handling, transportation and distribution of Anhydrous Ammonia, and have installed safety equipment including, but not limited to: Excess flow valves, Breakaway couplers at risers, Emergency shut-off valves, Barriers to avoid damage by trucks or other vehicles, and Lock outs to prevent tampering when the site is unattended.  We also maintain routine contact with our local fire department and emergency response personnel; and have provided and/or participated in safety training exercises on Anhydrous Ammonia.  We have developed an Emergency Action Plan for employees, customers, and visitor's protection in event of fire, explosion, tornado, and other acts of god that initiates evacuation, emergency medical care, contacts for assistance, etc. for all areas of our company including the Anhydrous Ammonia facility included in this plan.  The primary emergency coordinator is listed in the Registration Section of th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000038749,
      "SummaryText": "is document.  If unable to contact this individual, either of the employees listed below may be contacted:\n\n\n\n      Name                Work Phone                 24 Hour Phone\n\n\n\nDon Ellis                (402) 362-6691            (402) 366-5080\n\nPhil Pelc                (402) 362-8440            (402) 366-3226\n\n\n\nFive-Year Accident History:\n\n\n\nThere has not been a release of Anhydrous Ammonia within the past five years that has caused any death, injuries, or significant property damage at the facility; not to out knowledge have resulted in offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n\n\nEmergency Response Program:\n\n\n\nThis facility is included in the written Community Emergency Response Plan as prepared by the Local Emergency Planning Committee (LEPC), and the Nebraska Emergency Management Agency (NEMA) (former Nebraska State Civil Defense Agency).  We also include these materials in our own Emergency Action Plan in accordance with OSHA Standard 29CFR 1910.38.  We have provided State and Local authorities all Community Right-to-Know information requested as well as that required under SARA Title III (EPCRA).  Our written employee safety programs include pre-emergency planning and employee training in accordance with OSHA standards, and are offered for review at any time by our Local Emergency Planning Committee (LEPC) to ensure they conform to the community plan(s).  We actively encourage participation in our Anhydrous Ammonia and Propane training programs by the local fire department(s), local emergency response team, community planners, etc. that may be expected to respond to an incident at our site.\n\n\n\nPlanned changes to improve safety:\n\n\n\nSafety improvement is an on-going process at all of our facilities.  Periodic evaluations are performed to assess the maintenance of safe conditions.  There are no additional specific recommendations for implementation at this time.\n\n\n\nAdditional information:\n\n\n\nFor addit"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000038749,
      "SummaryText": "ional information, response to questions, or comments, please contact:\n\n\n\nPhil Pelc, Senior Safety Director   at   (402)362-8440.\n\n\n\n{end}"
    }
  ]
}