{
  "FacilityID": 1000093330,
  "FacilityName": "Resolute FP US Inc. - Calhoun Operations",
  "FacilityStr1": "5020 Highway 11 South",
  "FacilityStr2": null,
  "FacilityCity": "Calhoun",
  "FacilityState": "TN",
  "FacilityZipCode": "37309",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47107",
  "LEPC": "Mcminn County LEPC",
  "FacilityLatDecDegs": "35.296944",
  "FacilityLongDecDegs": "-084.754167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PP",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 12291704,
  "ParentCompanyName": "Resolute Forest Products Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1946011,
  "Company2DUNS": 0,
  "OperatorName": "Resolute FP US Inc.",
  "OperatorStr1": "5020 Highway 11 South",
  "OperatorStr2": null,
  "OperatorCity": "Calhoun",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37309",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael Yoder",
  "RMPTitle": "Environmental Manager",
  "FTE": 531,
  "OtherEPAFacilityID": "TND003329539",
  "EPAFacilityID": "100000065065",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "575960",
  "SafetyInspectionDate": "2015-06-07 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-04-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-04-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-04-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-04-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.29694,
  "FRS_Long": -84.75417,
  "FRS_Description": "PLANT ENTRANCE (PERSONNEL)",
  "FRS_Method": "GPS, WITH CANADIAN ACTIVE CONTROL SYSTEM",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000115863,
      "AltID": "Chlorine Cylinders",
      "FacilityID": 1000093330,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000117278,
          "ProcessID": 1000115863,
          "NAICSCode": "32211",
          "_desc": {
            "NAICS_CODE": "32211",
            "NAICS_DESCRIPTION": "Pulp Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000144809,
          "ProcessID": 1000115863,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000644809,
          "ProcessID": 1000115863,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000115864,
      "AltID": "Chlorine Dioxide Plant",
      "FacilityID": 1000093330,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000117279,
          "ProcessID": 1000115864,
          "NAICSCode": "32211",
          "_desc": {
            "NAICS_CODE": "32211",
            "NAICS_DESCRIPTION": "Pulp Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000144810,
          "ProcessID": 1000115864,
          "ChemicalID": 71,
          "Quantity": 41658.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 71,
            "ChemicalName": "Chlorine dioxide  [Chlorine oxide (ClO2)]",
            "CASNumber": "10049-04-4",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000644810,
          "ProcessID": 1000115864,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000093330,
      "SummaryText": "RMP EXECUTIVE SUMMARY\n\n\n\n1. Accidental Release Prevention and Emergency Response Polices\n\nWe at Resolute FP US Inc. - Calhoun operations (Resolute) are strongly committed to employee, public and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, our highly trained emergency response personnel are at hand to control and mitigate the effects of the release.  We are also completely coordinated with Calhoun and Charleston Fire Departments which provides additional emergency response expertise.\n\n\n\n2. The Stationary Source and the Regulated Substances Handled    \n\nOur facility's primary activities encompass Pulp and Paper Manufacturing.  We have 2 regulated substances present at our facility.  These substances include chlorine dioxide and chlorine.  The regulated substances at our facility are involved in several uses.  Chlorine dioxide is used as a bleaching agent for pulp.  Chlorine is used as a disinfectant for drinking water.  \n\n\n\n3. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition.  A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119.  Our facility is also subject to EPCRA Section 302 notification requirements.  The following sections briefly describe the elements  of the release prevention program that is in place at our stationary source.       \n\n\n\nProcess Safety Information\n\nReso"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000093330,
      "SummaryText": "lute maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\n\n\nProcess Hazard Analysis    \n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is Hazard and Operability Study (HAZOP).  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations.  Any findings related to the hazard analysis are addressed in a timely manner.\n\n\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our covered processes, Resolute maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\n\n\nTraining\n\nResolute has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these PSM processes.  \n\n\n\nMechanical Integrity\n\nResolute carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.   Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nPre-Startup Reviews    \n\nPre-start up safety reviews related to new processes and to modificat"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000093330,
      "SummaryText": "ions in established processes are conducted as a regular practice at Resolute.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits    \n\nResolute conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.     \n\n\n\nIncident Investigation\n\nResolute promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of five years.\n\n\n\nEmployee Participation\n\nResolute truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition,  our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.    \n\n\n\nContractors \n\nOur company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. Resolute has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur. \n\n\n\n4. Five-year Accident History        \n\nResolute has had an excellent record of preventing accidental release over the la"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000093330,
      "SummaryText": "st five years.  Due to our stringent release prevention policies, there has been no accidental release above the threshold quantity during this period.      \n\n    \n\n5. Emergency Response Plan \n\nResolute carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first-aid and medical treatment, evacuations, notification of local emergency response agencies and the public; as well as post-incident decontamination of affected areas.  To ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n\n6. Planned Changes to Improve Safety    \n\nResolute is always seeking ways to improve their overall safety program.  Any findings or developments resulting from the implementation of the various elements of our accidental release prevention program will be implemented as soon as practical.  \n\n\n\n"
    }
  ]
}