{
  "FacilityID": 1000055438,
  "FacilityName": "Loveland Products Inc.",
  "FacilityStr1": "56908 Hwy 8",
  "FacilityStr2": null,
  "FacilityCity": "Fairbury",
  "FacilityState": "NE",
  "FacilityZipCode": "68352",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31095",
  "LEPC": "Jefferson County - John McKee",
  "FacilityLatDecDegs": "40.120833",
  "FacilityLongDecDegs": "-097.160278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I5",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Agrium U.S. Inc.",
  "Company2Name": null,
  "CompanyDUNS": 808957229,
  "Company2DUNS": 0,
  "OperatorName": "Loveland Products Inc.",
  "OperatorStr1": "3005 Rocky Mountain Ave",
  "OperatorStr2": null,
  "OperatorCity": "Loveland",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80538",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jerry McKenzie",
  "RMPTitle": "Plant Manager",
  "FTE": 26,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000184463",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-01-15 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-03-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-03-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-03-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-03-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.12041,
  "FRS_Long": -97.16164,
  "FRS_Description": "OTHER",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000069327,
      "AltID": "Ammonia Process",
      "FacilityID": 1000055438,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000070509,
          "ProcessID": 1000069327,
          "NAICSCode": "325998",
          "_desc": {
            "NAICS_CODE": "325998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000085555,
          "ProcessID": 1000069327,
          "ChemicalID": 56,
          "Quantity": 150000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000585555,
          "ProcessID": 1000069327,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000069328,
      "AltID": "10-34-0 Process",
      "FacilityID": 1000055438,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000070510,
          "ProcessID": 1000069328,
          "NAICSCode": "325998",
          "_desc": {
            "NAICS_CODE": "325998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000085556,
          "ProcessID": 1000069328,
          "ChemicalID": 56,
          "Quantity": 84200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000585556,
          "ProcessID": 1000069328,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000055438,
      "SummaryText": "LOVELAND PRODUCTS INC. \n\nFAIRBURY, NEBRASKA\n\n\n\nEXECUTIVE SUMMARY Risk Management Plan\n\n40 CFR 68.155(a)       Accidental Release Prevention and Emergency Response\n\nPolicies at the Stationary Sources\n\n\n\nLoveland Products, Inc. (LPI) is an agricultural micronutrient manufacturing facility located in Fairbury, Nebraska. There are two stationary sources covered by this Risk Management Plan at the Fairbury site.  These are the Ammonia Process and the 10-34-0 Process. The Ammonia Process is an existing manufacturing process covered under previous RMPs.  The new process, the 10-34-0 Process, will be subject to the RMP regulation when it becomes operational in the spring of 2016.  LPI maintains and/or manages all of the equipment in its processes by employing the best engineering practices in the industry.  LPI strives for excellence in the facility operations and for full compliance with all local, state, and federal laws and regulations.\n\n\n\nMeeting environmental regulations is part of LPI's policies and by developing and maintaining this Risk Management Program, LPI is complying with the Federal Accidental Prevention Provisions (40 CFR Part 68). LPI is committed to the accidental release prevention program.\n\n\n\nLPI maintains a thorough, detailed Emergency Response Plan designed specifically for an ammonia release from either the Ammonia Process or the 10-34-0 Process.  The plan is periodically reviewed with outside emergency response organizations.\n\n\n\n40 CFR 68.155(b)       Stationary Sources and Regulated Substances Handled\n\n\n\nLPI Ammonia Process (currently in operation):\n\n\n\nThe LPI Ammonia Process produces a fertilizer solution by reacting water, anhydrous ammonia, acetic acid, and a variety of metal salts (minerals) in two low pressure mix tanks. Liquid anhydrous ammonia is stored in a 30,000 gallon (150,000 pound) pressure vessel under ambient temperature. The pressure vessel has a maximum fill level of 85% resulting in a maximum storage capacity of 25,000 gallons or 125,000"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000055438,
      "SummaryText": " pounds.   The pressure vessel is protected by a padlocked 8' cyclone fence.  The vessel is equipped with a flash valve that prohibits a ruptured line or valve from emptying the vessel.\n\n\n\nApproximately 200 feet of 2\" service line connected the pressure vessel to the process building. The first 100 feet of the service line is underground.  The service line is equipped with an emergency trip valve, a 2\" gate valve, an electronic flow valve, and a manual 1\" ball valve.\n\n\n\nLPI 10-34-0 Process (expected startup in spring 2016):\n\n\n\nThe LPI 10-34-0 process produces 10-34-0 fertilizer solution by reacting anhydrous ammonia with super phosphoric acid.   The process is self-contained on a trailer-mounted Mobile Pipe Reactor (MPR), owned and operated by Blick's Phosphate Conversions, LLC, of Garden City, KS.   For this process, the anhydrous ammonia is supplied via 42,000 pound tank trucks, which directly feed the 10-34-0 process.  The phosphoric acid is supplied via railcar.  The result 10-34-0 fertilizer solution is then subsequently stored on site for distribution to customers.  The MPR is equipped with a safety relief valve to protect against overpressure.  \n\n\n\n40 CFR 68.155(c)       Worst-Case Release Scenario(s) and Alternative Release\n\nScenario(s), Including Administrative Controls and Mitigation\n\nMeasures to Limit the Distance for Each Reported Scenario\n\n\n\nUnder the Risk Management Program, an offsite consequence analysis is required for an accidental release of a regulated substance.  In LPI's case, anhydrous ammonia is the regulated substance. Modeling of a worst-case release scenario and two alternative release scenarios for anhydrous ammonia are required for the offsite consequence analysis under Program 3.  \n\n\n\nThe worst-case scenario for the Loveland Products, Inc. Fairbury site is the loss of 125,000 pounds of pressurized anhydrous ammonia representing a complete failure of the pressure vessel. Per the definition of the worst-case scenario under the RMP regulation"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000055438,
      "SummaryText": ", the entire content of the pressure vessel is assumed to be released to the atmosphere in 10 minutes.  This corresponds to a release rate of 12,500 pounds/min. of anhydrous ammonia.   \n\n\n\nThe offsite toxic endpoint concentration for an ammonia release has been established by EPA to be 0.14 mg/L or 200 ppm by mass (40 CFR Part 68, Appendix A).  This is the concentration to which an ordinary person could be exposed for up to one (1) hour without experiencing permanent health effects.  RMP-Comp, a computerized dispersion modeling program available from USEPA, was used to determine the maximum downwind distance that an anhydrous ammonia release could travel at the toxic endpoint concentration.  The computer modeling shows that for the worst-case scenario, a toxic endpoint concentration of anhydrous ammonia would extend to 6.9 miles downwind.  This is an updated and corrected distance from the previous RMP submission; the previous endpoint distance was 2.5 miles.  The amount of anhydrous ammonia potentially released under the worst-case scenario has not increased.  Rather, an incorrect atmospheric stability factor was used when calculating the WCS.  Based on population data from MARPLOT, the potentially affected population has not increased, due to the rural location of the Fairbury site.\n\n\n\nThere are two (2) alternative release scenarios applicable to the Loveland Products, Inc. Fairbury site, one for each process:\n\n\n\nFor the LPI Ammonia Process, the alternate case scenario is for the release of 125,000 pounds of pressurized anhydrous ammonia resulting from a failed connection on the pressure vessel.  The entire contents of the pressure vessel is released to the atmosphere over a 60 minute period, resulting in a release rate of 2,083 pounds/min.  The computer modeling via RMP-Comp shows that for the alternate-case scenario for the LPI Ammonia Process, a toxic endpoint concentration of anhydrous ammonia would extend to 0.8 miles downwind.  \n\n\n\nFor the LPI 10-34-0 Proces"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000055438,
      "SummaryText": "s, the alternate-case scenario is for the release of anhydrous ammonia from a failed transfer hose connection between the ammonia tank trailer and the Mobile Pipe Reactor (MPR) trailer.  The anhydrous ammonia tank trailers are equipped with excess flow valves (per 40 CFR 172) which will shut off all flow within 20 seconds of a catastrophic hose failure.  The Process Hazard Analysis Software Tool (PHAST), by DNV was used to estimate the release rate from the failed hose connection.  The failed transfer hose will release 1620 pounds of anhydrous ammonia before the excess flow valve activates.   The computer modeling via RMP-Comp shows that for the alternate-case scenario for the LPI 10-34-0 Process, a toxic endpoint concentration of anhydrous ammonia would extend to 1.3 miles downwind.  \n\n\n\n40 CFR 68.155(d)       General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nLPI has a Release Prevention Program in place to prevent accidental releases of hazardous materials at this facility. The Release Prevention Program includes:\n\n\n\nProcess Safety Information (PSI)\n\nLPI has developed and kept current, working copies of PSI documentation including information pertaining to hazards of the processes, the technology of the processes and the equipment employed in the processes.  All employees involve in the processes have been trained in the operation of the processes and all contractors will be given training before performing work in the process areas. The PSI will enable the employees and contractors of LPI to identify and understand the hazards posted by the process involving anhydrous ammonia.\n\n\n\nProcess Hazard Analysis (PHA)\n\nLPI is committed to performing PHAs to identify, evaluate, and control hazards associated with plant operations.  These PHAs are intended to identify potential hazardous consequences, determine the likelihood and severity of these consequences, and evaluate whether safety systems, mitigation systems, and emergency systems "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000055438,
      "SummaryText": "will function properly to eliminate or reduce the likelihood that the hazardous consequences will occur.\n\n\n\nThe PHAs will be updated at least every five (5) years to assure that they are consistent with the current processes.\n\n\n\nOperating Procedures (OPs)\n\nLPI is committed to the development of OPs to assure safe work practices are maintained. The\n\nOPs are reviewed regularly and are updated and revised as required.\n\n\n\nTraining\n\nLPI is committed to provide its employees with comprehensive training to assure that the work force can perform their duties safely, efficiently, and effectively.\n\n\n\nMechanical Integrity (MI)\n\nLPI has developed a written program of maintaining the MI of process equipment. The MI program includes pressure vessels, storage tanks, piping systems and ancillary equipment, relief and vent systems and devices, emergency shutdown systems, controls and pumps. Maintenance procedures are developed or promulgated by equipment vendors, federal or state regulations, or industry codes.\n\n\n\nIncident Investigation\n\nThe current LPI Emergency Ammonia Release Response Plan is a component of the Incident Investigation process. Incident reporting procedures are well defined. Responsibilities, titles, and phone numbers are given in a highly readable document.  \n\n\n\nCompliance Audit\n\nA compliance audit of the LPI facility is conducted at least every three (3) years to evaluate compliance with the release prevention program (RPP).  The audit team includes at least one person knowledgeable in audit skills and techniques, and the audit team members have the appropriate process knowledge and technical expertise.\n\n\n\nManagement of Change (MOC)\n\nLPI has developed a MOC system to ensure that changes at the Ammonia Process and 10-34-0 Process will not result in undetected unsafe situations and employees will be aware of all changes and their implications.  Proposed changes are evaluated for their impact to affect the safety of the processes, and any impacts to employee safety "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000055438,
      "SummaryText": "and health, prior to the change being made.  After any changes, all employees are informed about the change, and affected employees are trained on the changes prior to startup of the modified process. In addition, the PSI, maintenance procedures, and OPs are updated as necessary to reflect the changes made.\n\n\n\nPre-Startup Safety Review (PSSR)\n\nWhen a new process is installed, or changes to the existing processes are significant enough to require a change in process safety information, LPI will conduct a PSSR.  The purpose of the PSSR is to ensure the following:\n\n1.    Construction and equipment are in accordance with design specifications\n\n2.    Safety, operating, maintenance, and emergency procedures are in place and are adequate\n\n3.    For new processes, a PHA has been conducted and recommendations resolved, or for existing processes, that all requirements of the MOC process have been met\n\n4.    Training of each employee involved in operating a process has been completed.\n\nA PSSR Team Leader will develop a checklist and assemble a team of key personnel review each key element during the PSSR. All PSSR team members will be knowledgeable about the process and trained in the MOC and PSSR requirements.\n\n\n\nContractors\n\nLPI has developed and implemented safe work practices to control the entrance, presence and exit of contract employees in the plant.  It is LPI's policy to select contractors who have demonstrated safe work histories, provide them with the appropriate safety and health information, ensure they follow all safe work practices, and periodically evaluate their safety performance.\n\n\n\nLPI will inform contractors of the known potential fire, explosion, or toxic release hazards related to the contractor's work and the process.  LPI will also explain to contractor the applicable provisions of LPI's emergency response plan.\n\n\n\nThe 10-34-0 Process involves use of a trailer-mounted Mobile Pipe Reactor (MPR).  The MPR is owned and operated by Blick's Phosphate Conversions, LLC, "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000055438,
      "SummaryText": "of Garden City, KS.  Blick's is contracted to operate the 10-34-0 process under the auspices of LPI's contractor management procedures.   Blick's maintains their own Process Safety Management program under the OSHA PSM regulation.  Blick's PSM program has been audited by LPI.  Blick's PSM program contains all elements required by 40 CFR Part 68 for a Program 3 Risk Management Plan, and its program functions as a subset of that of Loveland Products, Inc.  \n\n\n\nEmployee Participation\n\nLPI is committed to involving employees and their representatives on the conduct and development of PHAs and on the development of the other elements of plant safety, process safety management, and risk management planning.  LPI encourages employees to read, review, and provide comments on all RMP/PSM documents.\n\n\n\nHot Work Permit\n\nHot work is defined as work that could generate a flame, intense heat, or sparks as a result of electric or gas welding, cutting, brazing, grinding or similar operations. A permit is required when hot work is to be conducted in the LPI plant. \n\n\n\n\n\n\n\n\n\n40 CFR 68.155(e)   Five-Year Accident History\n\n\n\nThe five-year accident history involves an examination of the effects of any accidental releases of anhydrous ammonia in the five year prior to the submission of a Risk Management Program. An accidental release is defined under the RMP regulation as a release of ammonia from the facility that has caused at least one of the following:\n\n\n\n1. Onsite deaths, injuries, or significant property damage (40 CFR Part 68.42(a)); or\n\n2.  Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (40 CFR Part 68.42(a)).\n\n\n\nThe LPI Ammonia Process and the LPI 10-34-0 process have had no releases that have caused death, injuries, property damages, or environmental damage either on or off site since the startup of either process at the LPI Fairbury site.\n\n\n\n40 CFR 68.155(f)   Emergency Response Program\n\n\n\nLPI maintains a thorough, de"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000055438,
      "SummaryText": "tailed Emergency Response Plan designed specifically for an ammonia release from either the Ammonia Process or the 10-34-0 Process.  The plan is periodically reviewed with outside emergency response organizations.\n\n\n\n40 CFR 68.155(g)   Planned Changes to Improve Safety\n\n\n\nLPI maintains a continuous improvement philosophy regarding safety.  The following safety initiatives are scheduled for 2016:\n\n\n\n1.    Adopting the TapRoot &copy; root cause analysis technique and training key personnel in its use\n\n2.    Acquiring and utilizing personal NH3 (ammonia) monitors/alarms for continuous environmental assessment\n\n3.    With the help of the Nebraska Safety Council, update the site ambient noise survey\n\n\n\n\n\n\n\n"
    }
  ]
}