{
  "FacilityID": 1000033460,
  "FacilityName": "Foamex Innovations Cornelius NC, Plant 26",
  "FacilityStr1": "18801 Old Statesville Road",
  "FacilityStr2": null,
  "FacilityCity": "Cornelius",
  "FacilityState": "NC",
  "FacilityZipCode": "28031",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37119",
  "LEPC": "Mecklenburg County LEPC",
  "FacilityLatDecDegs": "35.466060",
  "FacilityLongDecDegs": "-080.850398",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.fxi.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6250492,
  "ParentCompanyName": "Foamex Innovations Operating Company d/b/a FXI Foa",
  "Company2Name": null,
  "CompanyDUNS": 829462535,
  "Company2DUNS": 0,
  "OperatorName": "FXI, Inc",
  "OperatorStr1": "Rose Tree Corporate Center II",
  "OperatorStr2": "1400 N Providence Road Suite 2000",
  "OperatorCity": "Media",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19063",
  "OperatorZipCodeExt": "2076",
  "RMPContact": "Mike Gill",
  "RMPTitle": "Plant Engineer",
  "FTE": 78,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000037532",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-10-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-03-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-03-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-03-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-03-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.47085,
  "FRS_Long": -80.85164,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "12.2",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000040830,
      "AltID": "Polyurethane Foam",
      "FacilityID": 1000033460,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000041250,
          "ProcessID": 1000040830,
          "NAICSCode": "32615",
          "_desc": {
            "NAICS_CODE": "32615",
            "NAICS_DESCRIPTION": "Urethane and Other Foam Product (except Polystyrene) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000049052,
          "ProcessID": 1000040830,
          "ChemicalID": 77,
          "Quantity": 924000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 77,
            "ChemicalName": "Toluene diisocyanate (unspecified isomer)  [Benzene, 1,3-diisocyanatomethyl-]",
            "CASNumber": "26471-62-5",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000549052,
          "ProcessID": 1000040830,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000033460,
      "SummaryText": "Facility Name: Foamex, LP, Cornelius, NC  28031\n\nParent Company: Foamex International, Inc.\n\nRMP Facility ID: 100000037532\n\n\n\n\n\nEXECUTIVE SUMMARY\n\nAccidental release prevention and emergency response policies\n\nAt the Foamex Innovations Plant in Cornelius, NC, we handle toluene diisocyanate (TDI), which is considered hazardous and regulated by the EPA.  The same properties that make TDI valuable for use at our facility also make it necessary to observe certain safety precautions in the handling of the substance.  Safety precautions have been implemented to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as our co-workers, and to reduce the threat to nearby members of our community.  It is our policy to adhere to all applicable federal and state rules and regulations.\n\nWe are committed to the safety of our employees and the public, and to the preservation of the environment, through the prevention of accidental releases of hazardous substances.  Successful implementation of our accidental release prevention program will help ensure that emergencies are unlikely and reduce the likelihood that emergency response procedures will be needed.  Nevertheless, an emergency such as a release of TDI is possible.  We have emergency response procedures to help ensure that accidents will be mitigated properly without undue risk to the public, environment, employees, contractors, or other personnel within the plant.\n\n\n\nDescription of the facility and the regulated substances handled:\n\nThe primary purpose of this facility is to produce flexible polyurethane foam, which is sold to other facilities and used to produce bedding, furniture, and a number of other products.  TDI is one of the reactants required to produce polyurethane foam and carpet pad.  TDI is received by rail car and by tank truck, and is stored in outdoor storage tanks.  The maximum quantity of TDI stored in rail cars and in storage tanks at our plant is about 1,750,000 pound"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000033460,
      "SummaryText": "s.  The TDI is piped to a mix head where it is mixed with other reactants to produce a slab of polyurethane foam.  The foam is conveyed to a warehouse where it is cured, then transferred to cutting stations where it is cut to the  and shape specified by our customers.\n\n\n\nTDI is the only substance handled at our plant that is regulated by EPAA?A?s risk management program (RMP) rule.  TDI is covered because the maximum quantity stored onsite exceed EPAA?A?s threshold quantity (TQ) of 10,000 pounds.\n\nOffsite consequence analysis of release scenarios\n\n\n\nAn offsite consequence analysis (OCA) was performed in 2012 to estimate the potential for an accidental release to affect the public or the environment.  The OCA consists of evaluating worst-case release scenarios (WRSs) and alternative release scenarios (ARSs).  We do not expect a worst-case release scenario to ever occur.  An ARS represents a release that might occur during the lifetime of a facility like ours.  ARSs help us to work with the local emergency planning committee (LEPC) to improve the community emergency response plan.\n\n\n\nThe main objective of performing the OCA is to determine the distance at which certain effects might occur to the public because of an accidental release (called the endpoint distance).  The following effects could occur at the endpoint distance:\n\nA?A?    Most people at the endpoint distance of a TDI release would be able to walk away from the exposure without any long-term health consequences, although some short-term consequences (e.g., strong eye or throat irritation) are likely.  Some people who are particularly susceptible to the released substance could be incapacitated.\n\nThe general accidental release prevention program and specific prevention steps\n\nThe plant has implemented programs and procedures that comply with EPAA?A?s Level 2 Accidental Release Prevention Program Rule.  Our facility qualifies for Level 2 coverage because (1) our worst-case release scenarios for TDI can impact p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000033460,
      "SummaryText": "ersons across the property boundary of the nearest public receptor, and (2) TDI is not a substance covered by OSHAA?A?s process safety management standard (PSM).  Our accidental release program is designed to systematically accomplish the following functions:\n\nA?A?    Control the creation and retention of safety information regarding the regulated substances, processes and equipment\n\nA?A?    Conduct hazard reviews to identify, evaluate, and control process hazards associated with the regulated substances, processes, and procedure\n\nA?A?    Create, maintain and evaluate operating procedures for processes that use regulated substances\n\nA?A?    Provide training for personnel who operate covered processes so that they safely perform their jobs\n\nA?A?    Monitor and control maintenance activities that can affect the mechanical integrity of equipment used in covered processes\n\nA?A?    Confirm through compliance audits that RMP practices at the plant are consistent with our written programs and that the programs are adequate to address all of the requirements of the RMP rule\n\nA?A?    Ensure that process incidents, particularly those of catastrophic magnitude or potential, are thoroughly investigated using our incident investigation procedures and that relevant findings are communicated throughout the company to help prevent recurrence\n\n  \n\nThe TDI process at our plant has hazards that are carefully managed to ensure continued safe operation.  The prevention program outlined above is applied to the TDI process.  Collectively, these prevention program activities help prevent potential accidental releases that could be caused by equipment failures, human errors, and by management system failures.\n\n\n\nIn addition to the accidental release prevention program, our plant has safety features on many units to help (1) contain or control a release, (2) quickly detect a release, and (3) reduce the consequences of or mitigate a release.  The following types of safety features are used in various units of the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000033460,
      "SummaryText": " TDI process:\n\n\n\nRelease detection \n\nA?A?    Three stage alarm system on TDI tanks\n\nA?A?    Process alarms\n\nA?A?    Low and high flow monitors on chemical streams on foam production machine\n\n \n\n\n\nRelease Containment/Control\n\nA?A?    TDI storage tanks have high level unloading pump shut-off\n\nA?A?    Curbing or dikes to contain TDI liquid releases\n\nA?A?    TDI storage tanks located inside a bermed area\n\nA?A?    Automated shutdown systems for critical process parameters (e.g. high level, high pressure)\n\nA?A?    Pressure/vacuum relief devices on vessels to prevent rupture or collapse\n\nA?A?    Remote shutdown of unloading and transfer pumps\n\nA?A?    Magnetic drive TDI centrifugal pumps without seals for unloading and transfer\n\nA?A?    Valves to permit isolation of the process\n\nA?A?    TDI railcar inner tank is surrounded by an outer shell filled with insulation\n\nA?A?    TDI railcars are top unloaded through a nozzle in the top of the tank\n\nA?A?    Vapor from storage tank is piped to a carbon bed adsorber\n\n \n\n Release Mitigation\n\nA?A?    Fire suppression and extinguishing systems\n\nA?A?    Trained emergency response personnel\n\nA?A?    Personal protective equipment (e.g., protective clothing, self-contained breathing apparatus, breathing air stations)\n\n\n\nFive-year accident history\n\nWe have had no releases of TDI in the last 5 years that resulted in deaths, injuries, or significant property damage on site, or known deaths, injuries, evacuations, sheltering-in-place, property damage, or environmental damage off site.  \n\nEmergency Response Program\n\n\n\nOur emergency response program is based on the requirements in OSHAA?A?s emergency action and fire prevention plan regulation, OSHAA?A?s hazardous waste and emergency operations regulation, and EPAA?A?s emergency response program requirements in its RMP rule.  Our program consists of procedures for responding to a release of TDI.  The \n\nprocedures address all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and account"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000033460,
      "SummaryText": "ing for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident cleanup and decontamination requirements.  In addition, the plant has procedures that address maintenance, inspection and testing of emergency response equipment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is updated when necessary, based on modifications made to plant processes or other facilities.  Personnel affected by changes in the program are informed and or trained on those changes.\n\n\n\nThe overall emergency response program for the plant is coordinated with the LEPC.  This coordination includes participation in periodic meeting of the committee, which includes local emergency response officials, local government officials, and other industry representatives.  The plant has around-the-clock communications capability with the appropriate LEPC officials and emergency response organizations such as the fire department.  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  The plant also conducts periodic emergency response drills. \n\n\n\nRecent changes to improve safety in the facility:\n\nWe strive to continuously improve the safety of our plant TDI process through periodic safety reviews and a program of soliciting safety suggestions from employees.  Our hazard review and incident investigation programs are especially designed to identify needed process safety improvements, some of which result in changes to the processes.  The following changes have been completed:\n\nA?A?    Upgraded inspections and tests of selected equipment and instrumentation designed to prevent TDI releases.\n\nA?A?    Revised operating procedures to resolve findings from the latest TDI process hazard review.\n\nA?A?    Added additional containment of the Railcar and Tank truck unloading."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000033460,
      "SummaryText": "\n\n"
    }
  ]
}