{
  "FacilityID": 1000058067,
  "FacilityName": "Gerald Grain Center - Wauseon Agronomy",
  "FacilityStr1": "16134 County Road B",
  "FacilityStr2": null,
  "FacilityCity": "Wauseon",
  "FacilityState": "OH",
  "FacilityZipCode": "43567",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39051",
  "LEPC": "Fulton County LEPC",
  "FacilityLatDecDegs": "41.500889",
  "FacilityLongDecDegs": "-084.176167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "clark.carrol@geraldgrain.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Gerald Grain Center, Inc.",
  "Company2Name": "Gerald Grain Center",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Mark Nofziger",
  "OperatorStr1": "16134 County Road B",
  "OperatorStr2": null,
  "OperatorCity": "Wauseon",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43567",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mark Nofziger",
  "RMPTitle": "Branch Manager",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000075376",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-06-17 00:00:00",
  "SafetyInspectionBy": "Ohio Department of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-06-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-06-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-06-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-06-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.5651,
  "FRS_Long": -84.1546,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000072578,
      "AltID": "Ammonia Fertilizer",
      "FacilityID": 1000058067,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000073759,
          "ProcessID": 1000072578,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        },
        {
          "Process_NAICS_ID": 1000073760,
          "ProcessID": 1000072578,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000089525,
          "ProcessID": 1000072578,
          "ChemicalID": 56,
          "Quantity": 293840.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000589525,
          "ProcessID": 1000072578,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000058067,
      "SummaryText": "Risk Management Plan\n\nExecutive Summary\n\nAmmonia\n\nGerald Grain Center, Inc. - Wauseon Agronomy Branch\n\nCompany Policies: \n\nThe management and employees of Gerald Grain Center are committed to the prevention of any accidental releases of anhydrous ammonia. It case an accidental release should occur, the facility is prepared to work with the local fire department and other authorities to mitigate any release and minimize the impact of the release on people and the environment. \n\nGeneral Operations: \n\nWe are located in the country. Our business is purchasing grain from, and selling fertilizer, pesticides, seeds, and related items to the farmers in our surrounding area. We also provide custom application of fertilizer and pesticides to farms owned by our customers. We have employees who are well versed in the safe handling of all of our hazardous materials. Any new employees are trained by management plus are given on-the- job training by experienced employees. \n\nAmmonia: \n\nWe have a storage tank for anhydrous ammonia and several mobile tanks on wagons. We do not mix or react the ammonia with any other chemical. We receive all of our ammonia by truck; the incoming trucks are unloaded by the truck drivers with their equipment according to DOT and other regulations,. The truck drivers are well trained. \n\nAfter the ammonia is in our storage tank it is loaded into the mobile tanks and delivered to farms by our employees or by the farmers themselves. The use of ammonia by farmers is very seasonal. Most of the handling of ammonia takes place in April-May-June in the spring and then also in October-November in the fall. \n\nAccident History: \n\nWe have had no accidents in the last five years. We have a safe history of  handling anhydrous ammonia. Our employees recognize the potential dangers of unsafe handling of ammonia and thus treat it very carefully. \n\nWorst Case Releases and Alternative Release Scenarios: \n\nIn preparing this data we have utilized the U S Environmental Protec"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000058067,
      "SummaryText": "tion Agency (EPA) model RMP Submit. We have reported in Program 2 as this document suggests. The releases were calculated using the model EPA RMP Comp. This information will be discussed by officers of our company if you care to visit our office. \n\nRisk Management: \n\nIn Ohio we operate our anhydrous ammonia installation under the rules and regulations of the Ohio Department of Agriculture. Their representative inspects our operation annually and lists any deficiencies in the operation. Any deficiencies are immediately corrected. Normally, very few deficiencies are found. For instance: ammonia hoses have the date of manufacture stamped on them and all hoses are replaced five years after date of manufacture or anytime there is evidence of damage. \n\nWe inspect our ammonia tank and piping prior to each season of use. Also as our employees are loading ammonia from the storage tank to the mobile tanks, they are visually looking for any problems which might potentially occur. \n\nTraining: \n\nWe believe that hands on training is the best training for an employee who will handle anhydrous ammonia. We have safety procedures and operation procedures for the handling of ammonia. Annually The Ohio Agribusiness Association puts on a one day training seminar on Safe Handling of Anhydrous Ammonia. We often send employees to attend this seminar. \n\nWe have an annual employee Right-to-Know training session and we cover anhydrous ammonia along with other hazardous materials. We do emphasize the use of personal protective equipment and the inspection of tanks, piping, hoses, and wagons. \n\nEmergence Response: \n\nWe have an Emergency Action Plan and a Safety book which spell out actions to be taken in case of spills or releases of any hazardous materials including anhydrous ammonia. We will call the local Fire Department and the County Emergency Coordinator in any case of any spill which creates a danger to people or the environment. In the case of an ammonia release of substance we will cal"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000058067,
      "SummaryText": "l the state EPA and The National Response Center. \n\nWe do not have Self-Contained Breathing Apparatus respirators on hand and thus cannot approach leaks of ammonia unless the mist or vapor is very lowly concentrated. We will call the Hazmat people immediately in case of a release of ammonia. We will cooperate with the local fire department and emergency personnel in any exercises which might help us be prepared for an emergency."
    }
  ]
}