{
  "FacilityID": 1000042860,
  "FacilityName": "Owensboro Specialty Polymers",
  "FacilityStr1": "5529 US Hwy 60 East",
  "FacilityStr2": null,
  "FacilityCity": "Owensboro",
  "FacilityState": "KY",
  "FacilityZipCode": "42303",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21059",
  "LEPC": "Daviess County LEPC",
  "FacilityLatDecDegs": "37.811389",
  "FacilityLongDecDegs": "-087.048417",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "info@onssp.com",
  "FacilityDUNS": 606703051,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Owensboro Specialty Polymers",
  "OperatorStr1": "5529 US Hwy 60 East",
  "OperatorStr2": null,
  "OperatorCity": "Owensboro",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "42303",
  "OperatorZipCodeExt": null,
  "RMPContact": "Barry Sparks",
  "RMPTitle": "EH&S Specialist",
  "FTE": 42,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000028766",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-06-26 00:00:00",
  "SafetyInspectionBy": "Finger, Lynes Engineering P.E.  C.H.M.M.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-05-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-05-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 37.81056,
  "FRS_Long": -87.04944,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000052859,
      "AltID": "Vinyl Acetate",
      "FacilityID": 1000042860,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000053594,
          "ProcessID": 1000052859,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000064158,
          "ProcessID": 1000052859,
          "ChemicalID": 29,
          "Quantity": 205000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000564158,
          "ProcessID": 1000052859,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000052860,
      "AltID": "Vinylidene Chloride",
      "FacilityID": 1000042860,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000053595,
          "ProcessID": 1000052860,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000064159,
          "ProcessID": 1000052860,
          "ChemicalID": 110,
          "Quantity": 407100.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 110,
            "ChemicalName": "Vinylidene chloride [Ethene, 1,1-dichloro-]",
            "CASNumber": "75-35-4",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000564159,
          "ProcessID": 1000052860,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000052861,
      "AltID": "Acrylonitrile",
      "FacilityID": 1000042860,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000053596,
          "ProcessID": 1000052861,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000064160,
          "ProcessID": 1000052861,
          "ChemicalID": 25,
          "Quantity": 139939.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 25,
            "ChemicalName": "Acrylonitrile  [2-Propenenitrile]",
            "CASNumber": "107-13-1",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000564160,
          "ProcessID": 1000052861,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000042860,
      "SummaryText": "General Executive Summary for Owensboro Specialty Polymers, Inc.\n\nOwensboro, Ketucky\n\n\n\n1.    Accidental Release Prevention and Emergency Response Policies\n\nWe at Owensboro Specialty Polymers, Inc. (OSP) are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n\n\n\n2.    The Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities encompass the production of various latex polymers, NAICS code 325211 (formerly Standard Industrial Classification (\"SIC\") Code 2821).  We have 3 regulated substances present at our facility.  These substances include Acrylonitrile  [2-Propenenitrile], Vinyl acetate monomer  [Acetic acid ethenyl ester] and Vinylidene chloride [Ethene, 1,1-dichloro-].  The regulated substances at our facility are involved in several uses.  Acrylonitrile, Vinyl Acetate and Vinylidene Chloride are used for manufacturing liquid latex emulsion polymers.\n\n\n\nThe total quantities handled/stored for each regulated substance, used for determination of Offsite Consequence Analysis (OCA), are - Vinyl acetate monomer [Acetic acid ethenyl ester] is 200,724 lb., Vinylidene chloride [Ethene, 1,1-dichloro-] is 403,600 lb., and Acrylonitrile  [2-Propenenitrile] is 67,200 lb.  A summary description of each of the production processes is set forth below. \n\n\n\n1.    Polyvinylidene Chloride (DARAN)\n\n\n\na.    Process Description: Emulsion polymerizations of 1,1-Dichloroethylene with other monomers such as acrylonitrile and various acrylates.   Polyvinylidene Chloride emulsions are high barrier, flexible, crystalline polymers designed for coating paper, paperboard, plastic films and metal.  Polyvinylidene "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000042860,
      "SummaryText": "Chloride is made in glass-lined or stainless steel reactors by semi-batchwise emulsion polymerization.\n\n\n\nb.    Primary Equipment:  Reactor trains 200 (A), 210 (B), 220 (C) and 230 (154).\n\n\n\n2.    Acrylic Polymers (DAXAD)\n\n\n\na.    Process Description:  A poly-methacrylate dispersing agent used in latex paints, ceramics and electronics.  Acrylic polymers are made in a stainless steel reactor by batchwise saponification and subsequent polymerization of methyl methacrylate or methacrylic acid.\n\n\n\nb.    Primary Equipment:  Reactor train 360.\n\n\n\n3.    Polyvinyl Acetate (PVA)\n\n\n\na.    Process Description:  PVA consists of a wide variety of polyvinyl acetate emulsion polymers used in adhesives, caulk, concrete and paint.  PVA is made in a stainless steel reactor by batchwise and semi-batchwise emulsion polymerization.\n\n\n\nb.    Primary Equipment:  Reactor train 157.\n\n\n\n4.    Developmental Process (R-1117)\n\n\n\na.    Process Description:  R-1117 is a cationic acrylic polymer emulsion. This acrylic polymer emulsion is used in the production of various types of container labels.  R-1117 is made in the 1000 gallon experimental glass-lined  reactor. \n\n\n\nb.    Primary Equipment:  Reactor train 650.\n\n\n\n\n\n3.    The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n\nIn compliance with EPA's revised rule governing the changes to the Chemical Accident Prevention Rule (Risk Management Program) in 2004, the Worst Case and Alternative Case Release Scenarios have been omitted from the Executive Summary.\n\n\n\n\n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119.  Our facility is subject to EPCRA Section 302 no"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000042860,
      "SummaryText": "tification requirements and we also have a Clean Air Act, Conditional Major air operating permit.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\n\n\nProcess Safety Information\n\nOwensboro Specialty Polymers maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.  Some examples of the process safety information included Safety Data Sheets (SDS) on all raw materials and products, Equipment Specification Sheets, and Process Instrumentation and Design drawings (P&ID).\n\n\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is Checklist and Whatif.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of not greater than five (5) years.  Any findings related to the hazard analysis are addressed in a timely manner. The most recent PHA/update was performed on 12-11-2012\n\n\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our covered processes, Owensboro Specialty Polymers maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\n\n\nTraining\n\nOwensboro Specialty Polymers has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every three (3) years and more "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000042860,
      "SummaryText": "frequently as needed.\n\n\n\nMechanical Integrity\n\nOwensboro Specialty Polymers carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\nWritten procedures are in place at Owensboro Specialty Polymers to manage changes in process chemicals, technology, equipment and procedures.  The most recent review/revision of maintenance procedures was performed on 3-05-2014.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\n\n\nPre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Owensboro Specialty Polymers.  The most recent review was performed on 5-14-2013.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits\n\nOwensboro Specialty Polymers conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The most recent compliance audit was conducted on 6/26/2012.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation\n\nOwensboro Specialty Polymers promptly investigat"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000042860,
      "SummaryText": "es any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\n\n\nEmployee Participation\n\nOwensboro Specialty Polymers truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\n\n\nContractors\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. Owensboro Specialty Polymers has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n\n\n\n5.    Five-year Accident History\n\nOwensboro Specialty Polymers has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, no accidental releases have occurred during this period.\n\n\n\n\n\n6.    Emergency Response Plan\n\nOwensboro Specialty Polymers carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000042860,
      "SummaryText": "\n\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n\nOwensboro Daviess County is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n\n\n\n\n7.    Planned Changes to Improve Safety\n\nOwensboro Specialty Polymers continues to improve safety through reviewing and implementing PHA/PHA reviews findings, PSM Compliance Audit and Incident Investigations recommendations, MoC items, and general safety tasks tracked in OSPA?s Task Management System.  \n\n\n\n\n\nName:  Eric F. Squire\n\n"
    }
  ]
}