{
  "FacilityID": 1000077564,
  "FacilityName": "The Andersons - Sergeant Bluff Facility",
  "FacilityStr1": "2717 Port Neal Circle",
  "FacilityStr2": null,
  "FacilityCity": "Sergeant Bluff",
  "FacilityState": "IA",
  "FacilityZipCode": "51054",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19193",
  "LEPC": "Woodbury County Emergency Serv",
  "FacilityLatDecDegs": "42.310833",
  "FacilityLongDecDegs": "-096.361111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "https://andersonsinc.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 71035708,
  "ParentCompanyName": "The Andersons, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "The Andersons, Inc.",
  "OperatorStr1": "1947 Briarfield Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Maumee",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43537",
  "OperatorZipCodeExt": null,
  "RMPContact": "Maria Schoen",
  "RMPTitle": "Specialist II, EHS",
  "FTE": 22,
  "OtherEPAFacilityID": "IAR000007310",
  "EPAFacilityID": "100000158474",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-06-29 00:00:00",
  "SafetyInspectionBy": "AXA Matrix Insurance",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-04-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-04-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-04-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-04-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 42.3992,
  "FRS_Long": -96.3534,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "ZIP CODE-CENTROID",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000096581,
      "AltID": "1",
      "FacilityID": 1000077564,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000097823,
          "ProcessID": 1000096581,
          "NAICSCode": "325311",
          "_desc": {
            "NAICS_CODE": "325311",
            "NAICS_DESCRIPTION": "Nitrogenous Fertilizer Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 1000097824,
          "ProcessID": 1000096581,
          "NAICSCode": "325314",
          "_desc": {
            "NAICS_CODE": "325314",
            "NAICS_DESCRIPTION": "Fertilizer (Mixing Only) Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 1000097825,
          "ProcessID": 1000096581,
          "NAICSCode": "325312",
          "_desc": {
            "NAICS_CODE": "325312",
            "NAICS_DESCRIPTION": "Phosphatic Fertilizer Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000120931,
          "ProcessID": 1000096581,
          "ChemicalID": 56,
          "Quantity": 128265.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000620931,
          "ProcessID": 1000096581,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000077564,
      "SummaryText": "Executive Summary\n\n\n\n1.    Accidental Release Prevention and Emergency Response Policies\n\n\n\nWe at the Andersons Sergeant Bluff facility are strongly committed to employee, public, and environmental safety. This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. If such an unforeseeable release does occur, we are completely coordinated with the Salix Fire Department and the Sioux City Hazardous Material Response Team which provides highly trained emergency response personnel to control and mitigate the effects of the release. We have staff that are trained to assist emergency responders to an anhydrous ammonia release at the Operations Level. We have conducted joint training with the outside agencies and both local hospitals.\n\n\n\n2.    The Stationary Source and the Regulated Substances Handled\n\n\n\nOur facility's primary activities encompass the production of zinc based micro-nutrients for fertilizer and animal feed supplements. We have one regulated substance present at our facility. This substance is Anhydrous Ammonia, which is involved in two uses. Ammonia is used (1) to control the pH and (2) to react with zinc, sulfur, and chlorides to form the zinc amine complex for our products.\n\n\n\nThe maximum inventory of Ammonia at the facility is 128,265 pounds (Tank) and 48,000 pounds (Trailer).\n\n\n\n3.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\n\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA. This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition. Several processes at our facility are subject to the OSHA PSM"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000077564,
      "SummaryText": " standard under 29 CFR 1910.119. Our facility is also subject to EPCRA Section 302 notification requirements. We also have an air operating permit ID under Title V of the Clean Air Act. The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\n\n\nProcess Safety Information\n\n\n\nThe Andersons Sergeant Bluff facility maintains a detailed record of safety information that describes the chemical hazards, operating parameters, and equipment designs associated with all processes.\n\n\n\nProcess Hazard Analysis\n\n\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently. The methodology used to carry out these analyses is the HAZOP review. These studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of every five years. Any findings related to the hazard analysis are addressed in a timely manner.\n\n\n\nOperating Procedures\n\n\n\nFor the purposes of safely conducting activities within our covered processes, the Andersons Sergeant Bluff facility maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown, and startup after a turnaround. This information is regularly reviewed and is readily accessible to operators involved in the processes.\n\n\n\nTraining\n\n\n\nThe Andersons Sergeant Bluff facility has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. Refresher training is provided at least every three years and more frequently as needed.\n\n\n\nMechanical Integrity\n\n\n\nThe Andersons Sergeant Bluff facility carries out highly documented maintenance checks on process\n\nequipment to en"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000077564,
      "SummaryText": "sure proper operations. Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps. Qualified personnel carry out maintenance operations with previous training in maintenance practices. Furthermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\n\n\nWritten procedures are in place at the Andersons Sergeant Bluff facility to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and given training to deal with the modification. Contractor personnel affected by the changes are also made aware of and given training to deal with the modification.\n\n\n\nPre-startup Reviews\n\n\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at the Andersons Sergeant Bluff. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits\n\n\n\nThe Andersons Sergeant Bluff conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out at least every 3 years and any corrective actions required, as a result of the audits, are undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation\n\n\n\nThe Andersons Sergeant Bluff promptly investigates any incident that has resulted in, or could reasonably result in, a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000077564,
      "SummaryText": "ny corrective actions to prevent the release from reoccurring. All reports are retained for a minimum of 5 years.\n\n\n\nEmployee Participation\n\n\n\nThe Andersons Sergeant Bluff truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses.\n\n\n\nContractors\n\n\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. The Andersons Sergeant Bluff has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n\n4.    Five-year Accident History\n\n\n\nThe Andersons Sergeant Bluff has a good record of preventing accidental releases of ammonia over the last 5 years. Due to our release prevention policies, no RMP reportable ammonia releases have occurred in the past 5 years.\n\n\n\n5.    Emergency Response Plan\n\n\n\nThe Andersons Sergeant Bluff carries a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas. To ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000077564,
      "SummaryText": " modified emergency response.  Woodbury County Disaster and Emergency Services is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified. We have staff that are trained to assist emergency responders to an anhydrous ammonia release at the Operations Level\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}