{
  "FacilityID": 1000084924,
  "FacilityName": "Sioux-Preme Packing Company",
  "FacilityStr1": "4241 US 75 Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Sioux Center",
  "FacilityState": "IA",
  "FacilityZipCode": "51250",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19167",
  "LEPC": "Sioux County LEPC",
  "FacilityLatDecDegs": "43.035500",
  "FacilityLongDecDegs": "-096.177200",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": "www.siouxpreme.com",
  "FacilityEmailAddress": "sxpreme@siouxpreme.com",
  "FacilityDUNS": 48732242,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sioux-Preme Packing Company",
  "OperatorStr1": "4241 US 75 Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Sioux Center",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "51250",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Kentner",
  "RMPTitle": "Compliance Manager",
  "FTE": 220,
  "OtherEPAFacilityID": "IAD984594259",
  "EPAFacilityID": "100000195488",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-02-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-02-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-02-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-02-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000106114,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000084924,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000107385,
          "ProcessID": 1000106114,
          "NAICSCode": "311611",
          "_desc": {
            "NAICS_CODE": "311611",
            "NAICS_DESCRIPTION": "Animal (except Poultry) Slaughtering"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000132874,
          "ProcessID": 1000106114,
          "ChemicalID": 56,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000632874,
          "ProcessID": 1000106114,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084924,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nThe Perdue Premium Meat Company, Inc. refrigeration systems use anhydrous ammonia (a commonly used refrigerant for industrial systems) as the refrigerant.  Given the quantity handled, anhydrous ammonia is considered a hazardous substance by EPA. \n\n \n\nMany of the properties that make ammonia valuable as a refrigerant also requires that precautions and procedures be in place to protect employee and public health and safety during a chemical emergency.  It is the policy of Perdue Premium Meat Company, Inc. to be in compliance with all applicable federal and state rules and regulations.\n\n\n\nSafety at our facility is inherent on the manner in which anhydrous ammonia is handled.  While the design of the facility incorporates many safety devices, safe handling procedures combined with appropriate training of our personnel are key aspects to maintaining safety at our facility.\n\n\n\nWe have a written Process Safety Management (PSM) plan that complies with the regulations stipulated by 29 CFR 1910.119.  A crucial component of this plan is the Emergency Response Plan, developed in compliance with the Emergency Response provisions of 29 CFR 1910.120(q).  The Emergency Response Plan includes pre-emergency planning and coordinating with outside parties. This enables those who deal with emergencies to have a course of action to effectively deal with unplanned events.\n\n\n\nFacility Description and Substances Handled\n\n\n\nThe Perdue Premium Meat Company, Inc. stores and distributes refrigerated and non-refrigerated foods and other items. Storage requires the use of a refrigeration system to preserve the integrity of the food items.  This refrigeration process uses ammonia as a refrigerant.  Access to the facility is restricted to authorized employees, management personnel, and contractors.\n\n\n\nThe regulated substance handled at this facility is anhydrous ammonia.\n\n\n\nThe ammonia refrigeration system maximum"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084924,
      "SummaryText": " inventory is 39,178 pounds of anhydrous ammonia.  There is no standby make-up inventory kept on-site.\n\n\n\nThe worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n\n\n\nRelease scenarios were modeled using RMP*Comp (Version 1.07), a software program developed by the National Oceanic and Atmospheric Administration (NOAA) and EPA.  Offsite receptors were defined using the LandView 5 (Version 1.0) system.  This system estimates residential population within the circle defined by the endpoint of the worst-case and alternative release scenarios. In addition, it lists whether certain types of public receptors and environmental receptors are within the circles.\n\n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nPerdue Premium Meat Company, Inc. complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations. The design and construction of this facility is in accordance with published standards, tests or recommended methods of trade, industry or governmental organizations.\n\n\n\nPerdue Premium Meat Company, Inc. written PSM plan incorporates many policies and procedures to ensure safe operation and maintenance of this facility.  Plan elements essential to safe operation of the refrigeration system include employee participation, process safety information, process hazard analysis, operating procedures, training, contractor safety, pre-startup safety review, mechanical integrity, management of change, hot-work permits, incident investigation, emergency response and planning, and compliance audits. \n\n \n\nTraining is provided to ensure that each employee involved in operating a process has been trained in an overview of the process, the operating procedures, and safety considerations.  Only qualified maintenance personnel operate and interact with the refrigeration system.  Thi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084924,
      "SummaryText": "s minimizes the chances of inadvertent error in operation that could lead to a release of ammonia.  Startup, shutdown, and any onstream adjustments are handled by these qualified persons.\n\n\n\nFive-Year Accident History\n\n\n\nThere have been no reportable accidents in the last five years.\n\n\n\nEmergency Response Program\n\n\n\nPerdue Premium Meat Company, Inc. has a written Emergency Response Plan to ensure that precautions and procedures are in place to protect employee and public health and safety during a chemical emergency.  It complies with the provisions of OSHA Emergency Response regulations, 29 CFR 1910.120(q).  The Emergency Response Plan includes pre-emergency planning and coordinating with outside parties.  This enables those who deal with emergencies to have a course of action to effectively deal with unplanned events. This plan has been reviewed with the Sioux Center / Le Mars Fire and Rescue Department.\n\n\n\nThe approach in the development of this plan has been to identify the ammonia emergencies most likely to occur at Perdue Premium Meat Company, Inc. and establish precautions and procedures to protect life safety and health during an emergency.  The refrigeration process has back-up prevention systems to keep processing malfunctions from becoming ammonia release emergencies.  \n\n\n\nIf an emergency does occur, the following response personnel, facilities, and equipment are in place:\n\n\n\n? Emergency Alarm and Communication System\n\n? Evacuation Plans and Assembly Points\n\n? Personal Protective Equipment\n\n\n\nThe role and procedures for obtaining external emergency assistance have been formally established with the Sioux Center / Le Mars Fire and Rescue Department. \n\n\n\nAll Perdue Premium Meat Company, Inc. personnel will be trained to fulfill their designated responsibilities in an emergency.  Mock emergency drills will be held periodically to maintain familiarity with response actions and identify plan elements requiring improvement.\n\n\n\nThis plan will be reviewed annuall"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000084924,
      "SummaryText": "y and updated as necessary by the Premium Meat Company, Inc. Facility Maintenance Manager.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nAny upgrades or extensive maintenance work performed in the future will be in compliance with codes and standards applicable at that time.\n\n\n\nAll Perdue Premium Meat Company, Inc. personnel are trained to fulfill their designated responsibilities in an emergency.  Mock emergency drills will be held periodically to maintain familiarity with response actions and identify elements requiring improvement.\n\n\n\nHigh priority items identified in the Process Hazard Analysis (PHA) and Priority List of Recommendations are scheduled to be completed by July 2020.  Lower priority items are scheduled for completion by May 2020.  \n\n\n\n"
    }
  ]
}