{
  "FacilityID": 1000037139,
  "FacilityName": "Sysco Arizona, Inc.",
  "FacilityStr1": "611 S. 80th Ave",
  "FacilityStr2": null,
  "FacilityCity": "Tolleson",
  "FacilityState": "AZ",
  "FacilityZipCode": "85353",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.441953",
  "FacilityLongDecDegs": "-112.230981",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "www.syscoarizona.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 51099661,
  "ParentCompanyName": "Sysco Corporation",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Sysco Arizona, Inc.",
  "OperatorStr1": "611 S. 80th Ave",
  "OperatorStr2": null,
  "OperatorCity": "Tolleson",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85353",
  "OperatorZipCodeExt": null,
  "FTE": 335,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000222724",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-10-08 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2015-06-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-09-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-09-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-09-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 33.44174,
  "FRS_Long": -112.23245,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000045448,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 1000037139,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000054972,
          "ProcessID": 1000045448,
          "ChemicalID": 56,
          "Quantity": 19200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000045891,
          "ProcessID": 1000045448,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000039665,
              "Process_NAICS_ID": 1000045891,
              "SafetyReviewDate": "2014-07-17 00:00:00",
              "PHA_Date": "2014-06-24 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-12-24 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Emergency dump tank",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-07-21 00:00:00",
              "TrainingReviewDate": "2014-07-21 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-07-21 00:00:00",
              "EquipmentInspectionDate": "2014-07-17 00:00:00",
              "EquipmentTested": "5 Year mechanic integrity inspection performed by engineer with Innovative Refrigeration Contractors.  The system is maintained and repaired as required by Industrial Refrigeration and Boiler Company.",
              "ChangeMgmtDate": "2014-07-17 00:00:00",
              "ChangeMgmtReviewDate": "2014-07-17 00:00:00",
              "PreStartupReviewDate": "2014-07-18 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2014-07-21 00:00:00",
              "HotWorkPermitReviewDate": "2014-07-21 00:00:00",
              "ContractorSafetyReviewDate": "2013-07-21 00:00:00",
              "ContractorSafetyEvalDate": "2013-07-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000047049,
                  "PreventionProgram3ID": 1000039665,
                  "ProcessChemicalID": 1000054972
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000037139,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-10-30 00:00:00",
    "ERTrainingDate": "2013-06-13 00:00:00",
    "CoordinatingAgencyName": "Tolleson Fire Department",
    "CoordinatingAgencyPhone": "6239367186",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000037139,
      "SummaryText": "Sysco Arizona incorporates the What-If/Checklist analysis during the PHA session. Human factors such as lighting, accessibility, and overall working conditions were incorporated in the analysis. The following forms, relating to human factors and facility siting are also used to identify potential hazards: Human Factors, Facility Siting, and Emergency and Fire Prevention Plan.\r\n\r\n4.  OPERATING PROCEDURES\r\nFor the purpose of safely conducting activities related to the ammonia refrigeration process, Sysco Arizona maintains written operating procedures.  Operating procedures describe all employee tasks, data to be recorded, operating conditions to be maintained, and safety and health precautions to be utilized in operation of the process containing regulated substances. The procedures need to be technically accurate and will result in safe operation of the facility. In addition, they need to be understandable to the employees and/or contractors. The procedures must be updated as changes are made to the facility or to the operating limits of the system. The regulations require that the employer annually certify that the operating procedures are current and accurate.\r\n\r\nAll phases of system operation must be covered by written procedures. Specifically, procedures must be available for:\r\n\r\n¿\tInitial Startup\r\n¿\tNormal Operations\r\n¿\tTemporary Operations\r\n¿\tEmergency Shut Down\r\n¿\tEmergency Operations\r\n¿\tNormal Shutdown\r\n¿\tStart Up Following an Emergency Shut Down\r\n\r\nThe procedures contain process operation limits and provide information of the consequences of deviation from these limits and the steps required to correct any deviations. Safety and health measures are included in the procedures to warn employees of potential risks and protective action that should be taken.\r\n\r\n5.  EMPLOYEE TRAINING\r\nAll employees, including maintenance and contractor employees involved with regulated substances (i.e. ammonia), need to fully understand the health and safety hazards associated"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000037139,
      "SummaryText": "Sysco Arizona, Inc.\r\n                                                    Executive Summary / Overview\r\n\r\n                                                          INTRODUCTION\r\n\r\nIn response to Local Emergency Management Agencies, the Occupational Safety and Health Administration (OSHA), and the Environmental Protection Agency (EPA), this Process Safety Management/Risk Management Program (PSM/RMP) document has been developed for Sysco Arizona, Inc. This document has been prepared to satisfy multiple regulations and is governed by the following agencies:\r\n\r\n¿\tOSHA'S Code of Regulations, OSHA 29 CFR 1910.119, Process Safety Management of Highly Hazardous Chemicals (PSM).\r\n\r\n¿\tFederal EPA's, Code of Federal Regulations, Title 40, Part 68, Accidental Release Prevention Requirements: Risk Management Programs Under Clean Air Act Section 112(r), Program 3 Requirements (RMP)\r\n\r\n¿\tGeneral Duty Clause, Title 40, Clean Air Act, Section 112(r)(1).\r\n\r\nThe purpose of this document is to:\r\n\r\n¿\tIncrease the protection of public health, the environment, and Sysco Arizona, Inc. employees by ensuring proper emergency response and mitigation procedures when handling regulated substances.\r\n\r\n¿\tAssist Sysco Arizona, Inc. and local government agencies in their communication and coordination efforts to improve safety while handling regulated substances.\r\n\r\nThis document addresses Sysco Arizona, Inc. administrative and operational programs to prevent accidents related to regulated substances and to reduce potential risks. The regulated substance of concern and focus of this document is anhydrous ammonia. Ammonia is used to provide refrigeration for warehouse cold/freezer storage, and dock operations.\r\n\r\n\r\n                                                      PROCESS DESCRIPTION\r\n\r\nSysco Arizona, Inc. operates a refrigeration system utilizing anhydrous ammonia as the primary refrigerant. The refrigeration system is located in the main bu"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000037139,
      "SummaryText": "nes make a good basis for developing an internal audit program. Corrective actions related to the audit will need to be documented and kept on record to show how the audit is improving the overall performance of the risk management programs in place.\r\n\r\nSysco Arizona conducts audits on a regular basis to determine whether the provisions set out under the RMP Rule are being implemented.  Sysco Arizona subscribes to an online MSDS scheduling system to insure that all required audits are conducted in a timely fashion.  All corrective actions required as a result of an audit are undertaken in a safe and prompt manner.\r\n\r\n14.  TRADE SECRETS\r\nThere are no trade secret processes, information, or designs related to this refrigeration system\r\n\r\n                                                     FIVE YEAR ACCIDENT HISTORY\r\n\r\nSysco Arizona has had no reportable incidents in the last 5 years and has an excellent record of preventing accidental releases."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000037139,
      "SummaryText": "ilding.\r\n\r\nMechanical refrigeration is a thermodynamic process where the refrigerant, ammonia, is used as a heat exchanging fluid to maintain a desired temperature in an enclosed environment. The refrigeration cycle consists of evaporation, compression, condensation, and expansion. Evaporation and condensation are designed to alter the quantity of energy associated with refrigerant. Compression and expansion are designed to change the availability of the associated energy. The refrigeration cycle is a closed-loop process. The refrigeration cycle utilizes fluid temperature, pressure, and latent heat of vaporization for cooling. The refrigeration system utilizes these phenomenon's to remove heat from a desired area, and then to discard that heat, through condensation, to an area where it is of no consequence.\r\n\r\n                 GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nSysco Arizona has taken all the necessary steps to comply with the accidental release prevention requirements set forth under 40 CFR Part 68 of the EPA.  In Addition, our facility is subject to the OSHA PSM standard under 29 CFR 1910.119.  Our facility is also subject to EPCRA Section notification requirements.  The following sections briefly describe the elements of the release prevention program that is in place at our facility.\r\n\r\n1.  EMPLOYEE PARTICIPATION\r\nEvery section of the PSM/RMP program must allow for employee participation in its development and implementation. The plan allowing for this participation must be documented. Employees and their representatives must have access to all information required to be developed for the Process Safety Management program without regard to possible trade secret status of such information.  Sysco Arizona believes that safety and accident prevention is a team effort.  Company employees are encouraged to express their views concerning accident prevention issues and to recommend improvements.\r\n\r\n2.  PROCESS SA"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000037139,
      "SummaryText": "FETY INFORMATION\r\nComplete and accurate written information concerning process chemicals, process technology, and process equipment is essential to an effective PSM/RMP program and to other aspects such as the Process Hazard Analysis (PHA). The information to be compiled about the chemicals needs to be comprehensive enough for an accurate assessment of the fire and explosion characteristics, reactivity hazards, the health and safety hazards to workers, and the corrosion effects on process equipment as well as monitoring and safety related equipment. MSDS information can provide a portion of the required data but other information will be required.\r\n\r\nProcess technology information is also required. This includes information on the amount of hazardous material stored and used at the facility as well as operating limits for the process. Diagrams of the system and information on all of the equipment utilized in the system are required. Piping and instrumentation diagrams (P&IDs) are included in the Process Safety Information.\r\n\r\nSysco Arizona maintains a detailed record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with the ammonia refrigeration process.\r\n\r\n3.  PROCESS HAZARD ANALYSIS\r\nThe Process Hazard Analysis (PHA) is the basis for many of the decisions and procedures associated with an effective PSM/RMP program. It is a systematic effort to determine the potential hazards associated with the process and to evaluate mitigation alternatives including equipment modifications, procedural modifications, training, and administrative controls. An effective PHA considers and analyzes the potential consequences associated with a release of the hazardous materials including fires, explosions, and exposure of people to toxic materials. It focuses on equipment, instrumentation, utilities, human actions, and external events.\r\n\r\nTo ensure that both operator safety as well as off-site safety is addressed,"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000037139,
      "SummaryText": "with the chemical with which they are working. This will allow them to better protect themselves, fellow employees, and the neighboring communities. In addition to the normal awareness training, which informs personnel of the hazards of the chemical and the safety precautions to use, training in operating procedures and practices, emergency response, and other required management controls are required.\r\n\r\nSysco Arizona has identified the personnel who require training, developed a training protocol with procedures and objectives, and maintains a record of personnel training. Regular evaluation of the training programs are completed to ensure that it is appropriate information to the employees in a useful and understandable way.\r\n\r\nIf outside employees (maintenance or contract) are performing work which might impact the refrigeration system, the (Facility Manager - David Karlsrud)(Safety Manager - Todd Larson) has an obligation to assure that they have been properly trained by their employer and have been informed of any hazardous conditions and the proper procedures to be utilized at the Sysco Arizona, Inc. facility.\r\n\r\n6.  CONTRACTOR SAFETY\r\nAny use of outside contractors who work in and around the refrigeration system requires that these contractors have accomplished the training, utilize proficient personnel, and have been informed of the necessary health and safety aspects of working in the area. The goal is to assure that contractor employees perform work in a safe manner and do not endanger themselves, other employees, or the facility. Sysco Arizona has developed a plan for screening potential contractors to ensure satisfactory performance.\r\n\r\n7.  PRE-STARTUP SAFETY REVIEW\r\nFor a new design or the addition of significant changes to the process, Sysco Arizona conducts a Pre-Startup Safety Review (PSSR)  to determine that the changes are not themselves deficient or that the addition of the new portions of the system will adversely affect the original system. Ma"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000037139,
      "SummaryText": "nagement procedures have been developed to ensure that a satisfactory hazard analysis has been completed before the system is started. The records from this Pre-Startup Safety Review are kept on file.\r\n\r\n8.  MECHANICAL INTEGRITY\r\nSysco Arizona has a formal maintenance program in place for all systems using regulated substances (i.e. ammonia). This program consists of routine (scheduled) inspection, testing, overhaul, and replacement as needed. Equipment is categorized and ranked with respect to the maintenance involved. This maintenance and inspection information includes all equipment such as storage tanks, compressors, condensers, evaporators, process piping relief and vent systems, fire protection system components, emergency shutdown systems, and alarms. Each component has been placed into a category that indicates how maintenance and inspection will be performed on that class of components.\r\n\r\n9.  HOT WORK PERMIT\r\nA Hot Work Permit management control program has been employed at Sysco Arizona that recognizes that extra care is required for non-routine work practices. This program advises the personnel that significant potential hazards exist and that extra care should be taken in certain circumstances. This ensures that employees, contractors, and company property are protected against fire, explosion, and other dangers resulting from hot work. Formal procedures exist for these programs and paperwork associated with ongoing work are kept on file.\r\n\r\n10.  MANAGEMENT OF CHANGE\r\nAt Sysco Arizona, other than replacement in kind, any change to the system is documented. In particular, the change of any equipment, control system, or procedure is evaluated to determine that it will not have an adverse effect on the safety aspects of the system. In addition, procedures are revised to reflect the changes in the system.\r\n\r\n11.  INCIDENT INVESTIGATION\r\nIncident investigation is the process of identifying the underlying causes of incidents and implementing steps to preven"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000037139,
      "SummaryText": "t similar events from occurring. It is required that employers will recognize and investigate events that resulted in or could reasonably have resulted in a hazardous chemical release. Sysco Arizona has developed in-house capabilities to investigate incidents that occur at our facility. A team has been assembled by Sysco Arizona and trained to collect and document information related to any incident. The Sysco Arizona team is multi-disciplinary and is better able to gather the facts and evaluate what happened and why. All employees with information will be interviewed and other facts will be gathered to develop a complete picture of the facts concerning the incident. Recommendations are then developed for changes in equipment, procedures, or safety systems to prevent recurrence of the event.\r\n\r\n12.  EMERGENCY PLANNING AND RESPONSE\r\nEmergency plans are required in case there is a release of ammonia (or other emergency such as fire or earthquake). Sysco Arizona has adopted a formal plan on how to handle an emergency situation and also a plan to educate employees as to what they should do. This plan is detailed and includes procedures for notifying local authorities and following up with written accident reports, should the release meet or exceed the reportable quantity (100 pounds of ammonia). Many local site factors will be included in the ammonia emergency and fire prevention plan. Sysco Arizona, Inc. has a stated policy of responding to all leaks to determine the proper response. Sysco Arizona, Inc. will respond to and mitigate all leaks within the limits of training and with the proper use of PPE.\r\n\r\n13.  COMPLIANCE AUDITS\r\nAn effective audit program is required to determine that facility personnel and contractors are following the procedures and intents of the overall PSM requirements. Periodic reviews of all areas of the management programs are required to verify compliance. OSHA has published compliance guidelines for their compliance personnel. These guideli"
    }
  ]
}