{
  "FacilityID": 1000101229,
  "FacilityName": "Daily's Premium Meats",
  "FacilityStr1": "3535 S. 500 West",
  "FacilityStr2": null,
  "FacilityCity": "Salt Lake City",
  "FacilityState": "UT",
  "FacilityZipCode": "84115",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "49035",
  "LEPC": "Salt Lake City LEPC",
  "FacilityLatDecDegs": "40.694336",
  "FacilityLongDecDegs": "-111.904076",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.dailysmeats.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 786105700,
  "ParentCompanyName": "Seaboard Foods LLC",
  "Company2Name": "Seaboard Corporation",
  "CompanyDUNS": 128499121,
  "Company2DUNS": 128499121,
  "OperatorName": "Seaboard Foods corp",
  "OperatorStr1": "3535 W. 500 South",
  "OperatorStr2": null,
  "OperatorCity": "Salt Lake City",
  "OperatorStateFIPS": "UT",
  "OperatorZipCode": "84115",
  "OperatorZipCodeExt": null,
  "FTE": 470,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000209428",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-07-30 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2025-02-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-09-06 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-09-06 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-09-06 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 40.698889,
  "FRS_Long": -111.905,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-OTHER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R05",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000125577,
      "AltID": "Meat Processed from Carca",
      "FacilityID": 1000101229,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000156941,
          "ProcessID": 1000125577,
          "ChemicalID": 56,
          "Quantity": 29605.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000126970,
          "ProcessID": 1000125577,
          "NAICSCode": "311612",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000108250,
              "Process_NAICS_ID": 1000126970,
              "SafetyReviewDate": "2021-03-29 00:00:00",
              "PHA_Date": "2020-07-23 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2021-09-22 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Emergency exterior dump stations",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2025-01-09 00:00:00",
              "TrainingReviewDate": "2021-03-29 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Alchemy Interactive Training System, APSM Software.",
              "MaintenanceReviewDate": "2021-03-29 00:00:00",
              "EquipmentInspectionDate": "2022-03-01 00:00:00",
              "EquipmentTested": "Compressor #9",
              "ChangeMgmtDate": "2020-11-25 00:00:00",
              "ChangeMgmtReviewDate": "2021-03-29 00:00:00",
              "PreStartupReviewDate": "2020-11-25 00:00:00",
              "ComplianceAuditDate": "2023-03-29 00:00:00",
              "AuditCompletionDate": "2025-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2021-03-29 00:00:00",
              "HotWorkPermitReviewDate": "2021-03-29 00:00:00",
              "ContractorSafetyReviewDate": "2021-05-11 00:00:00",
              "ContractorSafetyEvalDate": "2021-03-29 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000135611,
                  "PreventionProgram3ID": 1000108250,
                  "ProcessChemicalID": 1000156941
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000101229,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-02-07 00:00:00",
    "ERTrainingDate": "2021-03-26 00:00:00",
    "CoordinatingAgencyName": "South Salt Lake City Fire Dept",
    "CoordinatingAgencyPhone": "8014836043",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000101229,
      "SummaryText": "EXECUTIVE SUMMARY\r\n\r\n1. Accidental Release Prevention and Emergency Response Policies:\r\nWe at Daily's Premium Meats are committed to employee, public, and environmental safety. This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as the design, installation, operating procedures, maintenance, and employee training associated with the ammonia refrigeration system at our facility. It is our policy to implement appropriate control measures to prevent possible releases of anhydrous ammonia. If such a release were to occur, our highly trained employees are on hand to control and mitigate the release. We are also completely coordinated with the South Salt Lake City Fire Department, who provides our emergency response services. In addition, we work with multiple ammonia refrigeration Company's to ensure we are provided 24-hour service and emergency response on the ammonia refrigeration system.\r\n\r\n2. The Stationary Source and the Regulated Substances Handled:\r\nWe have one regulated extremely hazardous substance present at our facility. This substance is Ammonia (anhydrous). The maximum inventory of Ammonia (anhydrous) that is expected to be present in this facility, is greater than the threshold of 10,000 lbs.\r\n\r\n3. The General Accidental Release Prevention Program and the Chemical Specific\r\nPrevention Steps:\r\nWe have taken the following steps as required by 40CFR, Part 68 of the EPA Clean Air Act regulation. Our ammonia process is subject to the OSHA PSM regulation, 29CFR1910.119. Our ammonia process is also subject to the EPCRA Section 302 reporting requirements. The following sections briefly describe the elements of the accidental release prevention program that we have in place.\r\nProcess Safety Information: Our facility conducts comprehensive studies to ensure that hazards associated with our ammonia refrigeration process are identified and controlled efficiently and safely. The methodology used to conduct th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000101229,
      "SummaryText": "ese analyses is the What-If Checklist. These studies are conducted by the qualified engineers and technicians of our selected refrigeration contractors and are revalidated at a regular interval of every three years. Any findings related to the hazard analysis are corrected as soon as possible. \r\nOperating Procedures: Daily's Premium Meats maintains written operating procedures. These procedures address various modes of operation including initial start-up, normal operations, emergency shutdown, emergency operations, normal shutdown, and a start-up after a turnaround. The information is regularly reviewed and is readily accessible to all operators and contractors involved in the process. \r\nTraining: Our facility has a comprehensive training program in place to ensure that employees and contractors who are operating the ammonia system are qualified to follow the required procedures. Our Facility Manager is RETA certified and maintains a CIRO certification. Our technicians also receive ammonia Operator training through GCAP (Garden City Ammonia Program). We evaluate each operator independently to evaluate their readiness to operate ourplant. All employees also receive interactive training through APSM software as well as the Alchemy Training System at least annually. Our Operators are signed up on a yearly subscription to the RETA training courses and they are given time weekly to study.\r\nMechanical Integrity: We conduct well documented maintenance and inspections for the ammonia refrigeration system to ensure that it is operating properly. Process equipment examined during the maintenance and inspections includes pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Only qualified personnel with specialized ammonia system training conduct maintenance operations. Any deficiencies identified during maintenance or inspection are corrected as soon as possible. \r\nManagement of Change: Written procedures ar"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000101229,
      "SummaryText": "e in place to manage changes to the ammonia refrigeration system process, chemicals, technology and equipment. Process operations, maintenance and contractor personnel, or any other employees whose job tasks are affected by a modification of process operations, are promptly informed of and given training to safely manage the modification and operate the system. \r\nPre-Startup Reviews: Pre-startup reviews related to new processes, and/or modifications to existing processes are conducted as a regular practice at our facility. These reviews are conducted to confirm that the design, installation, maintenance and operation of the ammonia refrigeration plant is safe prior to any equipment operation. \r\nCompliance Audits: We conduct audits on a regular basis to determine whether the provisions required by the Process Safety and Risk Management regulations are being consistently implemented. These audits are conducted at least every three years and any corrective actions noted during the audits are corrected as soon as possible. \r\nIncident Investigation: Daily's Premium Meats has not had to conduct an incident investigation. We are prepared to investigate any incident that has resulted in, or could reasonably have resulted in, a catastrophic release of ammonia. These investigations would be conducted to identify the situation leading to the incident, as well as any corrective actions to prevent the incident from recurring. All reports from the investigation would be kept for a minimum of five years.\r\nEmployee Participation: Our Company believes that Process Safety, Risk Management and accident prevention require a team effort to be successful. We include Operators in regular PSM meetings. Company and contractor employees are strongly urged to express their concerns about the ammonia refrigeration system and recommend any improvements to the system. They are also encouraged to report any possible safety issues with the ammonia plant. In addition, all employees and contractors"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000101229,
      "SummaryText": "have access to all information related to the facility Process Safety and Risk Management plans. \r\nContractors: Occasionally we hire contractors to conduct specialized testing, maintenance and construction activities for the ammonia refrigeration system. The qualified Ammonia refrigeration contractors for Daily's are L.A. Roser Company, Kemper Northwest, Wasatch Refrigeration, and JRG Refrigeration. Prior to using any contractor, we conduct a thorough evaluation of their safety performance. We have a strict policy of informing all contractors of any potential hazards with our ammonia system and throughout the plant. \r\nContractors are also informed of all procedures for emergency notification, evacuation and employee accountability in the event of an ammonia release. \r\n\r\n4. Five Year Accident History:\r\nThere have been no reportable accidents or incidents at this facility during the past five years.\r\n\r\n5. Emergency Action Plan:\r\nDaily's Premium Meats is included in the Salt Lake City emergency response plan. This facility also has a written emergency action plan. The emergency plan includes specific actions to be taken in response to an accidental release of ammonia. The emergency action plan also includes procedures for informing the public and local, state and federal response agencies of an ammonia release. This plan also identifies the facility First Responders. These are designated employees who have been certified in First Aid, CPR and emergency evacuation. The local agency that is coordinating our emergency response plan is the South Salt Lake City Fire Department. Their non-emergency number is 801-483-6043. \r\n\r\n6. Planned Changes to Improve Safety:\r\nOur RETA trained Facility Manager, working together with our trained Ammonia Operators and Contractors, maintains our Anhydrous Ammonia plant in excellent condition. We will continue to work with the South Salt Lake City Fire Department to conduct mock incident drills at our facility. All employees will be trained"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000101229,
      "SummaryText": "on ammonia safety and emergency evacuation at least annually. We will continue to ensure that only qualified; specifically, trained personnel will operate and maintain our ammonia plant. At Daily's Premium Meats, we take our obligation to handle our anhydrous ammonia safely very seriously. In doing so, we protect our employees, vendors, contactors, and the local community from exposure to anhydrous ammonia."
    }
  ]
}