{
  "FacilityID": 1000057397,
  "FacilityName": "Bessemer Water Filtration Facility",
  "FacilityStr1": "250 Link Road",
  "FacilityStr2": null,
  "FacilityCity": "Bessemer",
  "FacilityState": "AL",
  "FacilityZipCode": "35023",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01073",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "33.515907",
  "FacilityLongDecDegs": "-087.122200",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "GUSC of the City of Bessemer, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "GUSC of the City of Bessemer, Inc.",
  "OperatorStr1": "250 Link Road",
  "OperatorStr2": null,
  "OperatorCity": "Bessemer",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35023",
  "OperatorZipCodeExt": null,
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000177104",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-04-06 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-05-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-05-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-05-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2019-05-22 00:00:00",
  "DeRegistrationEffectiveDate": "2019-04-24 00:00:00",
  "AnniversaryDate": "2021-05-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 33.515907,
  "FRS_Long": -87.1222,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R06",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000071778,
      "AltID": "Water Disinfecting Proces",
      "FacilityID": 1000057397,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000088675,
          "ProcessID": 1000071778,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000072977,
          "ProcessID": 1000071778,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000045045,
              "Process_NAICS_ID": 1000072977,
              "SafetyReviewDate": "2016-03-30 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "MSDS, Chlorine Institute, AWWA",
              "FR_Comments": null,
              "HazardReviewDate": "2016-03-30 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-03-30 00:00:00",
              "TrainingReviewDate": "2016-04-13 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-04-13 00:00:00",
              "EquipmentInspectionDate": "2016-05-09 00:00:00",
              "EquipmentTested": "Scrubber system checks, inspection of associated piping and all leak detectors",
              "ComplianceAuditDate": "2016-03-30 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2013-10-23 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000045833,
                  "PreventionProgram2ID": 1000045045,
                  "ProcessChemicalID": 1000088675
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000057397,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2016-04-06 00:00:00",
    "ERTrainingDate": "2010-12-09 00:00:00",
    "CoordinatingAgencyName": "Jefferson County LEPC",
    "CoordinatingAgencyPhone": "2052542039",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000057397,
      "SummaryText": "evising or updating the procedures related to the processes.\r\n\r\nFIVE-YEAR ACCIDENT HISTORY\r\n\r\nThere have been no accidental releases as defined in 40 CFR §68.42 at the BWFF that resulted in injuries or death either on-site or offsite.  Since there has not been an accidental release, there has not been a need for sheltering in place or evacuation; nor has damage to property or environmental receptors ever occurred as a result of an accidental release.\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\nThe BWFF has a site-specific community Emergency Response Plan (ERP) that defines the sequence of actions to be taken by the BWFF employees in the event of an accidental release of chlorine.  This ERP has been communicated to local fire departments, the Local Emergency Planning Committee (LEPC), and the Alabama Department of Environmental Management (ADEM). Individuals who are likely to witness or discover a release have been trained to initiate an emergency response sequence by notifying the proper authorities.  It is currently the BWFF's policy that individuals that have received the requisite training shall attempt to secure a release of chlorine if the action can be taken without significant risk of injury or death.  The Incident Commander from the local emergency response agency is presently responsible for determining when sheltering-in-place or evacuation of off site areas is necessary, and also for public notification.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nRecommendations for safety improvements are identified in both compliance audits and hazard reviews.  Existing facility procedures are designed to improve employee safety awareness and enhance safe operations.  Further, emergency response procedures are reviewed and coordinated with local response entities to increase the speed and effectiveness of a response should a release occur.\r\n\r\nFinal recommendations and target dates of implementation are documented in the RMP."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000057397,
      "SummaryText": "EXECUTIVE SUMMARY\r\n\r\nSection 112r of the Clean Air Act requires that the U.S. Environmental Protection Agency (EPA) issue a rule specifying the types of actions to be taken by facilities in order to prevent accidental releases of hazardous chemicals into the atmosphere, and to reduce their potential impact on the public and the environment.  This resulting rule, Chemical Accident Prevention Provisions (part 68 of Title 40 of the Code of Federal Regulations, or part 68), applies to a wide variety of facilities that handle, manufacture, store, or use toxic substances.\r\n\r\nIf a stored container or process at a facility (referred to as  a stationary source) contains any of the hazardous toxic and flammable substances listed in part 68 in an amount above the threshold quantity specified, then that stationary source is required to develop and implement a corresponding Risk Management Program, the goal of which is to prevent and/or mitigate accidental releases that can cause serious harm to the public and the environment from short-term exposure.\r\n\r\nSubsequent to the development of a Risk Management Program, covered facilities must also implement and maintain documentation of their program on-site, including a hazard assessment, a prevention program, an emergency response program, and registration of such program constituents with the EPA as an official Risk Management Plan (RMP).\r\n\r\nCovered facilities must subsequently submit this documentation to the EPA.  These RMPs must be updated periodically or when certain process or other changes occur, as required by the rule.\r\n\r\nThis report is intended to satisfy this requirement, and was prepared in accordance with guidance data provided by the EPA, following such in both organization and content.\r\n \r\nNote that the phrase Risk Management Program refers to all of the requirements of part 68, which must be implemented on an ongoing basis.  The phrase Risk Management Plan (RMP) refers to the actual document describing the ri"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000057397,
      "SummaryText": "sk management program, which must be submitted to the EPA.\r\n\r\nThe Bessemer Water Filtration Facility (BWFF) is an 18 million-gallons-per-day water treatment and filtration plant, owned and operated by The Governmental Utility Services Corp. of the City of Bessemer, Inc. (GUSC).\r\n\r\nThe BWFF currently utilizes chlorine as a chemical disinfectant for the purification of drinking water. Chlorine is a strong oxidant that rapidly kills many harmful microorganisms, but because chlorine in its elemental form is a toxic gas, there is a danger associated with its accidental release.  It is thus necessary to observe certain safety precautions during handling to prevent unnecessary human exposure, to reduce the threat to personal health, and to reduce any potential threat to the nearby community.\r\n\r\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nThe GUSC operates the BWFF in a manner that is cognizant of these safety precautions.  In addition, the GUSC is committed to operating the facility in full compliance with applicable federal regulatory requirements and state and/or local requirements.  The GUSC previously fell under the Occupational Safety and Health Administration (OSHA), and although no longer applicable, many current policies still reflect those standards.\r\n\r\nIn the event of a release, the BWFF has established specific subsequent procedures and policies in a formal Emergency Response Plan (ERP).\r\n \r\nThe BWFF prevention policy and Emergency Response Plan utilize the latest technologies, management practices, and procedures to both reduce the likelihood of accidental releases and minimize effects should they occur.\r\n\r\nBWFF employees are trained on the safe operation of the chlorination system, and daily inspections of the areas storing and using chlorine are conducted.\r\n\r\nThe chlorine storage area is fully enclosed and is equipped with a scrubber for control during a chlorine gas release.  The dry media scrubber system is equipped with detectors that"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000057397,
      "SummaryText": "should automatically activate if a set chlorine concentration is present.  In addition, the BWFF has installed an emergency chlorine valve actuator that should shut off flow from the cylinders after detecting a leak.\r\n\r\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\r\n\r\nThe BWFF currently utilizes eight one-ton containers/cylinders of chlorine on-site, the quantity of which (16,000 pounds) is in excess of the 2,500-pound threshold.\r\n \r\nChlorine is received by truck, and except during delivery, all of the cylinders are stored within an enclosed building.  Access to the site is restricted to authorized facility employees, authorized management personnel, and authorized contractors.\r\n\r\nBoth passive and active mitigation measures are used by the BWFF to limit the likelihood and/or severity of an accidental release of chlorine.  Passive mitigation systems, such as physical containment structures, do not require human, mechanical or energy input whereas active mitigation systems do.  A chlorine scrubber, leak detectors and alarms, excess flow valves, pressure sensing valves, and emergency shut-off devices are examples of the active mitigation systems in place.\r\n\r\nACCIDENTAL RELEASE PREVENTION PROGRAM\r\n\r\nThe BWFF has an accidental release prevention program that is based upon a foundation of employee awareness and proactive system maintenance.\r\n\r\nThe BWFF provides process safety information to employees through written materials, such as Material Safety Data Sheets, various operating and maintenance manuals, system descriptions, and safety procedures.  Employees attend periodic training and contractors are briefed on process hazards prior to working on-site.  Preventive maintenance and regular inspections are conducted for maintaining mechanical integrity.  Inspections and testing are scheduled through the preventative maintenance program.  Hazard analysis documents are reviewed periodically and updated as required.  Compliance audits are used to evaluate the need for r"
    }
  ]
}