{
  "FacilityID": 1000010092,
  "FacilityName": "Hiland Dairy - Springfield, MO",
  "FacilityStr1": "1133 E. Kearney",
  "FacilityStr2": null,
  "FacilityCity": "Springfield",
  "FacilityState": "MO",
  "FacilityZipCode": "65803",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29077",
  "LEPC": "Greene County LEPC",
  "FacilityLatDecDegs": "37.241667",
  "FacilityLongDecDegs": "-093.275274",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "IO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 31137391,
  "ParentCompanyName": "Prairie Farms Dairy, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6312995,
  "Company2DUNS": null,
  "OperatorName": "Hiland Dairy",
  "OperatorStr1": "1133 E. Kearney",
  "OperatorStr2": null,
  "OperatorCity": "Springfield",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "65803",
  "OperatorZipCodeExt": null,
  "FTE": 252,
  "OtherEPAFacilityID": "MOD981707573",
  "EPAFacilityID": "100000025475",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-03-02 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-09-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-07-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-07-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-07-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 37.24066,
  "FRS_Long": -93.27566,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000011861,
      "AltID": "Refrigeration System",
      "FacilityID": 1000010092,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000013670,
          "ProcessID": 1000011861,
          "ChemicalID": 56,
          "Quantity": 42400.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000012260,
          "ProcessID": 1000011861,
          "NAICSCode": "31151",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000009825,
              "Process_NAICS_ID": 1000012260,
              "SafetyReviewDate": "2007-12-17 00:00:00",
              "PHA_Date": "2007-12-17 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Transportation accident",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "High level alarms",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "All SRV's are now piped to the outside of the building",
              "OpProceduresReviewDate": "2009-02-18 00:00:00",
              "TrainingReviewDate": "2008-12-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-12-17 00:00:00",
              "EquipmentInspectionDate": "2007-03-10 00:00:00",
              "EquipmentTested": "Recripricating compressor overhaul.",
              "ChangeMgmtDate": "2007-06-15 00:00:00",
              "ChangeMgmtReviewDate": "2007-12-17 00:00:00",
              "PreStartupReviewDate": "2007-12-17 00:00:00",
              "ComplianceAuditDate": "2007-12-17 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-12-17 00:00:00",
              "HotWorkPermitReviewDate": "2007-12-17 00:00:00",
              "ContractorSafetyReviewDate": "2007-12-17 00:00:00",
              "ContractorSafetyEvalDate": "2007-12-17 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000011454,
                  "PreventionProgram3ID": 1000009825,
                  "ProcessChemicalID": 1000013670
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000010092,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2007-12-17 00:00:00",
    "ERTrainingDate": "2009-05-19 00:00:00",
    "CoordinatingAgencyName": "Springfield Fire Department No. 4",
    "CoordinatingAgencyPhone": "4178641534",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000010092,
      "SummaryText": "Executive Summary\r\n \r\n\r\n1.0     ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICY\r\nHiland Dairy is committed to the preservation of all resources vital to the continued success and heath of the organization, including its employees and the neighboring community.\r\nIn fulfilling this commitment to the protection of people, property and the surrounding community, management will provide and maintain a safe and healthy work environment and enforce all environmental protections, in accordance with industry standards and good practices.  Beyond this, Hiland Dairy will strive to recognize and eliminate any foreseeable hazards which may result in personal harm or negative impacts to the environment.\r\nAccidental loss can be controlled through good management in combination with active employee involvement. Safety and environmental stewardship is the direct responsibility of all managers, supervisors, employees, and contractors.\r\nAll management activities will comply with company safety requirements as they relate to planning, operation and maintenance of facilities and equipment. All employees will perform their jobs properly in accordance with established procedures and safe work practices.\r\nShould a release occur, the safety and protection of our employees, neighbors and surrounding environment is paramount.  Through the cooperative relationship with local responders, personal safety and mitigation of any impact to the environment is the top priority.\r\n\r\n\r\n2.0\tSOURCE AND PROCESS DESCRIPTION\r\nThe Hiland Dairy in Springfield, Missouri is subject to the USEPA's Risk Management Program (RMP) for Accidental Chemical Release regulation (40 CFR 68) because it has a refrigeration system that contains more than the threshold quantity (10,000 pounds) of anhydrous ammonia (CAS Number 7664-41-7).  Anhydrous ammonia (NH3), is a gas at ambient conditions.  The anhydrous ammonia (ammonia) refrigeration system is used to manufacture and store fluid milk, ice cream,  and related"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000010092,
      "SummaryText": "products.  It is a closed system that contains approximately 45,400  pounds (i.e., 9,000 gallons) of ammonia in various physical states (gas, liquid, and saturated vapor).  The largest vessel is the high stage accumulator that operates at approximately 25 psig and can contain as much as 14,800  pounds of liquid ammonia (at its maximum safe fill volume of 80%).  However, during typical operation, the vessel contains only 2,000 pounds of ammonia.  Most of the ammonia equipment is located indoors.  The condensing towers, receiver, and some piping runs are located outdoors.\r\nAmmonia is the oldest and most common refrigerant in general industrial use throughout the world.  It is a high capacity refrigerant that operates at reasonable pressure.  Although exposure to ammonia is irritating and potentially toxic in large doses, personnel exposure to more than a small leak is rare because ammonia operates within a closed system of vessels, piping, and equipment.  In addition, ammonia can be easily detected by smell at levels well below its toxic endpoint.\r\nThe ammonia refrigeration system is a two-stage system, consisting of a high pressure and low pressure side.  Various storage freezers and ice cream manufacturing units operate on the low side to quickly freeze and/or store product.  Ammonia suction from the low side at about 0 psig (or slight vacuum) passes through the low accumulator before entering the booster compressors.  Any liquid ammonia in the low side suction is trapped in the low accumulator and pumped out to the low side load units.  The booster discharge passes through an intercooler before entering the high side compressors.\r\nThe high side compressor suction draws from the intercooler and high accumulator at about 25 psig.  This accumulator receives suction from the refrigerated tanks, glycol chillers, and cooler units.  Liquid which is trapped in the accumulator is returned to the system by pumps.\r\nThe major discharge from the high side compressors (hot gas),"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000010092,
      "SummaryText": "at 150 to 175 psig, is vented to roof-mounted condensing towers.   The condensed liquid is returned to the high pressure receiver where it is fed to the refrigeration equipment and accumulators.\r\nThe ammonia refrigeration system is protected by the existence of specific safety systems/hardware, including safety relief valves, engine room ventilation, and system safety interlocks.  Safety relief valves protect the compressor discharge, condensers, suction accumulators, receiver, and chillers from the hazards associated with overpressure.  Safety interlocks include high pressure and high temperature alarms and cutouts for the compressors, as well as high level floats and sensors for the accumulators and intercooler.  The high pressure cutouts for the compressors are set at 200 psig.\r\nThe refrigeration system is a totally closed system.  Historically, releases of ammonia from industrial refrigeration systems most often occur from leaking valves, malfunctioning pressure relief devices, or inadvertent releases during repair activities.  While these incidents can impact employees, they seldom lead to a release of a reportable quantity or represent an off-site impact.  Moreover, a release of ammonia that could affect the environment is unlikely for the following reasons:\r\nA¿\tMany of the high pressure liquid lines are located in enclosed areas that could help to contain such a release, and the outside piping is elevated to promote dispersion;\r\nA¿\tIndustrial standards were followed for the manufacture and quality control of these lines;\r\nA¿\tAmmonia is not corrosive in this service;\r\nA¿\tMost of the lines are elevated to minimize potential damage from fork lifts;\r\nA¿\tThe facility has a preventive maintenance program in place to maintain the ongoing integrity of the system;\r\nA¿\tThe facility has a training program designed to ensure that the system is operated by qualified personnel; and\r\nA¿\tThe facility has emergency response procedures which enable trained personnel to respon"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000010092,
      "SummaryText": "d quickly to isolate any potential releases by closing valves in the liquid lines.\r\n \r\n3.0\tPREVENTION PROGRAM\r\nThe facility has carefully considered the potential for accidental releases of ammonia, such as the occurrence of the worst-case and alternative-release scenarios required by 40 CFR 68.  To help minimize the probability and severity of an ammonia release, a prevention program that satisfies the Occupational Safety and Health Administration (OSHA), Process Safety Management (PSM) of Highly Hazardous Chemicals  standard (29 CFR 1910.119) has been implemented.  The key components of the prevention program are summarized below:\r\nA¿\tThe development, documentation, and operator availability of critical process safety information regarding the hazards of ammonia, the design basis of the system, and the equipment.  This information is used to fully understand and safely operate the ammonia refrigeration system.\r\nA¿\tThe development of an extensive employee participation program, which includes employees from all levels of the organization and from all areas within the plant (i.e., production and maintenance).  This program also assures that employees that utilize the ammonia system and are most knowledgeable about it are best able to easily, effectively, and regularly recommend changes or improvements which enhance safety.\r\nA¿\tThe performance of a formal process hazard analysis (PHA), using the What-if/checklist technique.  A team with expertise in engineering, operations, maintenance, and safety evaluated the existing refrigeration system in depth and developed recommendations to improve the safety and operability of the system.  The PHA addressed:  (1) process hazards; (2) previous incidents; (3) engineering and administrative controls applicable to the hazards; (4) the consequence of control failure; (5) facility siting; (6) human factors; and (7) a qualitative evaluation of possible safety and health effects of control system failures.  The PHA will be updated"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000010092,
      "SummaryText": "and revalidated every five years.\r\nA¿\tWritten operating procedures (OPs) were prepared to provide the basis for proper and safe operation of the ammonia refrigeration system.  The OPs include procedures for normal operation, startup, shutdown, emergency operation, and emergency shutdown.  They also describe safe operating limits for temperature and pressure, the consequences of operating outside these safe operating limits, and a description of safety systems and how they operate.\r\nA¿\tRefrigeration system operators receive refresher training at least every three years.  The training content is based upon the process safety information and operating procedures.  The training program ensures that the operators understand the nature and causes of problems arising from system operations and serves to increase awareness with respect to the hazards particular to ammonia and the refrigeration process.\r\nA¿\tFormal authorization systems (i.e., management of change procedure, pre-startup safety review) are in place to ensure that system changes or expansions are as safe as the original design and that an independent recheck, prior to start-up, confirms that the changes are consistent with the engineering design and safety requirements.  \r\nA¿\tEvents that might (or did) cause an accidental or unexpected release of ammonia are subjected to a formal investigation.  The objective of the investigation is to correct deficiencies in such a way as to prevent recurrence.\r\nA¿\tContractors that are hired to work on, or adjacent to, the refrigeration system are pre-qualified based upon their knowledge of ammonia refrigeration, understanding of applicable codes and standards, and their demonstrated ability to work safely.  \r\nA¿\tPrior to the performance of any hot work (i.e., spark or flame producing operations such as welding, cutting, brazing, grinding), management must approve the work by executing a written hot work authorization permit to verify that precautions to prevent fire have b"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000010092,
      "SummaryText": "een implemented.\r\nA¿\tPeriodic formal walk-throughs occur to find unusual or increasing vibration, incipient leaks, or other indications of potential upsets or failures that could lead to a release.\r\nA¿\tReplacement of all pressure relief valves occurs every five years.\r\nA¿\tNumerous safety systems, including pressure relief valves, ammonia vessel level controls, and safety interlocks are used in the refrigeration system.\r\nA¿\tPeriodic inspections are performed for major powered equipment, including compressors, pumps and large fans, bearings, couplings, shaft seals, mountings, etc., for vibration or incipient mechanical failure.\r\nA¿\tProper design, including adherence to recognized safety codes.\r\nA¿\tAdherence to fire codes and preparation for fires, storms, or events which could impact the ammonia system.\r\nA¿\tPlanning with the local fire department to ensure a rapid response to potential incidents involving the system or external events, such as storms or tornadoes.\r\nA¿\tPrevention program compliance audits are performed to verify that the elements are being properly implemented.  Any deficiency found in an audit is corrected.\r\n \r\n4.0\tACCIDENT HISTORY\r\nThere have been no accidental releases of ammonia at the facility in the last five years (since June 1999) that have resulted in death, injury, or significant property damage on-site or off-site death, injury, evacuation, sheltering in place, property damage, or environmental damage.  \r\n \r\n5.0\tEMERGENCY RESPONSE PROGRAM\r\nThe facility has implemented a detailed written Emergency Action Plan (EAP).  The EAP is intended to address all emergencies at the facility, in addition to incidents related to a release of ammonia.\r\nThe EAP includes awareness and response training for employees, coordination with the local fire department, and evacuation of the facility.  The plan details what personal protective equipment and spill response equipment is available; identifies specific individuals, their 24-hour telephone numbers, and the"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000010092,
      "SummaryText": "ir responsibilities; identifies procedures for emergency medical care; and refers to other pertinent elements of the management system (i.e., standard operating procedures).\r\n \r\n6.0\tPLANNED CHANGES TO IMPROVE SAFETY\r\nThe prevention program that is described in Section 2.0 of this Executive Summary is a management system that is designed to proactively identify, evaluate, and reduce the potential for a ammonia release and/or a release's impact or consequence, due to failures in process, procedures, and equipment.  As safety improvements are identified by the management system they are evaluated and, where appropriate, implemented.  For example, the facility may implement the following changes to further improve the safety of the process:\r\nA¿\tAdditional training,\r\nA¿\tPeriodic repair and replacement of equipment, and\r\nA¿\tContinued implementation and improvement of the PSM program."
    }
  ]
}