{
  "FacilityID": 1000099023,
  "FacilityName": "Airgas USA, LLC",
  "FacilityStr1": "160 Glendale Milford Rd",
  "FacilityStr2": null,
  "FacilityCity": "Miamiville",
  "FacilityState": "OH",
  "FacilityZipCode": "45147",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39025",
  "LEPC": "Clermont County LEPC",
  "FacilityLatDecDegs": "39.215278",
  "FacilityLongDecDegs": "-084.310526",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.airgas.com",
  "FacilityEmailAddress": "mike.miller@airgas.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Airgas, Inc",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Airgas USA, LLC",
  "OperatorStr1": "6055 Rockside Woods Blvd",
  "OperatorStr2": null,
  "OperatorCity": "Independence",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44131",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jon Newell",
  "RMPTitle": "Plant Manager",
  "FTE": 13,
  "OtherEPAFacilityID": "45147RCDSTSTRT1",
  "EPAFacilityID": "100000034688",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-09-30 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-01-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-01-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2022-01-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-01-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.21111,
  "FRS_Long": -84.29722,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000122529,
      "AltID": "Acetylene Generation",
      "FacilityID": 1000099023,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000123902,
          "ProcessID": 1000122529,
          "NAICSCode": "32512",
          "_desc": {
            "NAICS_CODE": "32512",
            "NAICS_DESCRIPTION": "Industrial Gas Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000153191,
          "ProcessID": 1000122529,
          "ChemicalID": 96,
          "Quantity": 45000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 96,
            "ChemicalName": "Acetylene  [Ethyne]",
            "CASNumber": "74-86-2",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000653191,
          "ProcessID": 1000122529,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000122530,
      "AltID": "LPG system",
      "FacilityID": 1000099023,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000123903,
          "ProcessID": 1000122530,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000153192,
          "ProcessID": 1000122530,
          "ChemicalID": 129,
          "Quantity": 115000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 129,
            "ChemicalName": "Propylene  [1-Propene]",
            "CASNumber": "115-07-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000653192,
          "ProcessID": 1000122530,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000099023,
      "SummaryText": "The Airgas Great Lakes Miamiville OH facility, which is owned and operated by Airgas USA LLC, an Air Liquide company, is located at 160 St. Rt. 126, Miamiville, Ohio.  Management and employees at the Miamiville facility are committed to the prevention of any accidental release of covered chemicals to include acetylene and propylene.  If an accidental release should occur, the facility is prepared to work with local emergency response personnel to mitigate the release and minimize the impact of the release to the community and the environment.\n\n\n\nThe facilities' primary operation is the manufacture, storage and distribution of acetylene gas and the transfill and distribution of propylene cylinders.  Acetylene is manufactured by the addition of calcium carbide into water in a reactor vessel.  A chemical reaction takes place and acetylene gas is produced.  The acetylene gas is compressed and filled into cylinders containing an inert filler material and acetone.  The acetylene gas is dissolved into the acetone in the cylinder.  Each cylinder is checked by weight to verify they have the appropriate amount of product.  Cylinders are then stored for distribution.  Propylene is transfilled from a bulk storage tank to portable cylinders and staged for transportation.\n\n\n\nThe worst-case and alternative release scenario reports can be viewed at the facility and were prepared using the EPA look up tables and RMP*Comp.  Mitigation systems are in place throughout the process system.  These reduce the likelihood of a release and are also designed to reduce the magnitude of release should it occur.  The mitigation methods include check valves, pressure relief devices, flash-back arrestors, vents, grounding equipment, purge systems and written maintenance and operating procedures.  \n\n\n\nThe facility has developed a comprehensive prevention plan designed to prevent accidental releases of acetylene and propylene.  The program utilizes technology, sound engineering practices, administrat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000099023,
      "SummaryText": "ive controls and active employee participation.\n\n\n\nEmployees are frequently consulted concerning various aspects of the program and process and are asked to provide input regarding safety and operational improvement.\n\n\n\nWritten process safety information was developed for the acetylene system and propylene system to enable managers, supervisors and employees to identify and understand the process hazards.  This information was utilized to develop a Process Hazard Analysis which assists management and employees in making decisions for improving safety and reducing the consequences of an acetylene release.  The PHA focuses attention on equipment, instrumentation, utilities, human actions (routine and non routine), and external factors that might impact the process by identifying potential failure points or failure modes in the process. \n\n\n\nDetailed operating procedures exist which describe tasks to be performed, operating conditions to be maintained, samples to be collected and safety and health precautions to be taken.  The operating procedures are reviewed periodically and revised as necessary.\n\n\n\nEmployees are thoroughly trained, including maintenance and contract employees.  The training meets and exceeds the requirements as outlined in the OSHA hazard communication standard (29 CFR 1910.1200).  Training includes operating procedures, safe work practices, emergency procedures (including alarms), special assignments, evacuation and emergency response, safety rules and procedures, routine and non-routine work authorization, and other pertinent process safety information.  Training is provided to employees by traditional classroom and hands-on methods. Demonstrations, observations and written tests are used to evaluate employee understanding.\n\n\n\nA contractor screening process is in place to ensure contract employees hired to perform work can accomplish their assigned tasks without compromising the safety and itegrity of the covered process.  The contractor program in"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000099023,
      "SummaryText": "cludes are review of contractor safety qualifications and knowledge of the work being performed.  \n\n\n\nPre-startup safety reviews (PSSR) are used with new or modified processes to improve the design and construction of the process from a reliability, quality and safety standpoint.  PSSR recommendations are resolved prior to final installation or process start up.  Items completed prior to the initial process start up include piping and instrumentation diagrams, operating procedures and initial employee training.  \n\n\n\nAn on-going mechanical integrity program (maintenance) is used to ensure safe process operations.  Equipment used to store, process or handle acetylene has been designed, constructed, installed and maintained to minimize the potential for a release.  The maintenance program includes the required inspections/tests, the appropriate frequency, written procedures, and training of maintenance personnel, criteria of successful test results, documentation of results and documentation of manufacturer recommendations to prevent failure of equipment and instrumentation.\n\n\n\nHazardous work or non-routine work is controlled in a consistent manner.  The hazards identified are communicated to all affected employees and appropriate control measures are taken to prevent an accident release.  The program references and requires lock out/tag out, hot work, elevated work, line breaking and appropriate authorizations.\n\n\n\nManagement of Change (MOC) procedures have been developed to review proposed changes to the covered process.  MOC procedures include changes to equipments, processes or procedures that are not considered \"replacement in kind.\"\n\n\n\nProcess incidents that result in or could have resulted in a release are investigated and documented.  The purpose of the incident investigation process is to ensure appropriate and adequate corrective actions are implemented to prevent a recurrence of similar incidents.  Process incidents are investigated by a team that consists of"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000099023,
      "SummaryText": " management personnel as well as knowledgeable employees.  All resolutions are communicated to affected employees.\n\n\n\nThe facility has an emergency preparedness/response plan.  The plan outlines what actions employees are to take when there is a release of acetylene.  The plan complies with OSHA 29 CFR 1910.38) and has been coordinated with local emergency response personnel.\n\n\n\nThe facility receives a compliance audit in accordance with EPA's Risk Management Standard Part 68 at least once every 3 years.  The audit includes an evaluation of the design and effectiveness of the risk management system.  An audit tool is used to conduct the audit, document deficiencies and track status of identified action items.  A procedure is in place to ensure appropriate follow-up.  Safety improvement is an on-going process at the facility.  Periodic evaluations are performed to assess the maintenance of safe conditions."
    }
  ]
}