{
  "FacilityID": 1000089005,
  "FacilityName": "Frosty Packing Co, LLC",
  "FacilityStr1": "1225 N 28th Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Yakima",
  "FacilityState": "WA",
  "FacilityZipCode": "98902",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53077",
  "LEPC": "Yakima County LEPC",
  "FacilityLatDecDegs": "46.3713",
  "FacilityLongDecDegs": "-120.3240",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Paul Martinez",
  "OperatorStr1": "PO Box 1552",
  "OperatorStr2": null,
  "OperatorCity": "Yakima",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98907",
  "OperatorZipCodeExt": null,
  "RMPContact": "Stanley Q Bostrom",
  "RMPTitle": "CFO",
  "FTE": 95,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000230369",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-06-30 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-07-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-07-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-07-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-07-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "0.1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000110712,
      "AltID": "Fresh Fruit/Veg Whlse",
      "FacilityID": 1000089005,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000112005,
          "ProcessID": 1000110712,
          "NAICSCode": "42448",
          "_desc": {
            "NAICS_CODE": "42448",
            "NAICS_DESCRIPTION": "Fresh Fruit and Vegetable Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000138338,
          "ProcessID": 1000110712,
          "ChemicalID": 56,
          "Quantity": 13651.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000638338,
          "ProcessID": 1000110712,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000089005,
      "SummaryText": "Frosty Packing Co, LLC operates an apple packing and refrigeration storage facility in northern Yakima, WA  at 1225 N 28th Avenue.  Apples are harvested and loaded in cold storage rooms over a several week period in the fall.  Apples are removed from storage and washed, sorted and packaged for fresh fruit markets year round.  Packaged apples are stored in refrigerated rooms or controlled atmosphere rooms until shipment.  A refrigeration operator checks the system every day and continuous monitoring and alarming is done by the facility computer control system 24 hours/day.\n\n\n\nAmmonia is used as the refrigerant in the system.  Ammonia is a colorless gas with a pungent odor that is irritating to the eyes, nose and throat.  It is present as both a liquid under pressure and as a vapor in the system.  There is approximately 13,651 pounds of ammonia throughout the refrigeration system.\n\n\n\nTo maintain a safe facility operation, Frosty Packing Co has developed an emergency action plan that provides instructions to all employees of actions to take if an ammonia release is detected.  The plan is coordinated with the Local Emergency Planning Committee (LEPC)who is responsible for first response to any emergency situation at the plant.  Refrigerated areas in the facility are monitored by ammonia detectors which also send an alert to the refrigeration operators.  Since employees are not trained or equipped for HAZMAT responding, the emergency action plan instructs all employees to evacuate the facility and allow Yakima County Fire Department to take control of the incident upon arrival.  All employees receive annual training on the emergency action plan.\n\n\n\nConstruction of the facility was completed, and ammonia added to the system the first week of August 2015. Since that time, the facility has run smoothly with no serious complications or incidence.  The maintenance has been done and documented as per regulations. The facility has complied with both State and Federal regulation"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000089005,
      "SummaryText": "s regarding ammonia used as a refrigerant, and has in place both the OSHA Process Safety Management (PSM 29 CFR 1910.119)program and EPA Risk Management Program (RMP 40 CFR Part 68). Both programs are available to on-site personnel to help maintain a safe operating facility.  As required by the RMP an \"off-site Consequence Analysis\" has been done to determine what impact the \"Worst Case\" and more realistic \"Alternative Case\" releases of ammonia would have, if any, on the surrounding area.\n\n\n\nThere have been no reportable releases of ammonia from the system.\n\n\n\nTo deal with any possible release of ammonia, Frosty Packing Co maintains an ongoing relationship with an experienced refrigeration contractor located less than 1/2 mile away from the facility.  In the event of a significant release the Yakima Fire Department has a fully trained and equipped HAZMAT team approximately 5 minutes away.  The facility has an action plan, not a response plan, so it is not expected or intended that employees would attempt to enter the facility until the responding HAZMAT team has determined it safe to do so.\n\n\n\nFrosty Packing Co has constructed this facility to comply with all OSHA and EPA regulations, educated and equipped the refrigeration team for safe operation, and continues to update practices and procedures as recommended by industry recognized experts (IIAR, ASME and ASTI).      \n\n\n\n "
    }
  ]
}