{
  "FacilityID": 1000067559,
  "FacilityName": "Costco Wholesale Frederick Combo Depot #1053",
  "FacilityStr1": "5236 Intercoastal Drive",
  "FacilityStr2": null,
  "FacilityCity": "Monrovia",
  "FacilityState": "MD",
  "FacilityZipCode": "21770",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24021",
  "LEPC": "Frederick County LEPC",
  "FacilityLatDecDegs": "39.374713",
  "FacilityLongDecDegs": "-077.280922",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Costco Wholesale (Risk Management)",
  "OperatorStr1": "5236 Intercoastal Drive",
  "OperatorStr2": null,
  "OperatorCity": "Monrovia",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21770",
  "OperatorZipCodeExt": null,
  "FTE": 150,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000209231",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-08-01 00:00:00",
  "SafetyInspectionBy": "Customers Come First",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-01-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-01-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-01-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-01-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000084755,
      "AltID": null,
      "FacilityID": 1000067559,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000105743,
          "ProcessID": 1000084755,
          "ChemicalID": 56,
          "Quantity": 22000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000085937,
          "ProcessID": 1000084755,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000071531,
              "Process_NAICS_ID": 1000085937,
              "SafetyReviewDate": "2017-04-21 00:00:00",
              "PHA_Date": "2014-06-24 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-06-24 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Update of Process Safety Information and Standard Operating Procedures",
              "OpProceduresReviewDate": "2017-04-21 00:00:00",
              "TrainingReviewDate": "2017-04-21 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-04-21 00:00:00",
              "EquipmentInspectionDate": "2017-02-01 00:00:00",
              "EquipmentTested": "Annual IIAR B109 Overall System Safety Inspection",
              "ChangeMgmtDate": "2017-04-20 00:00:00",
              "ChangeMgmtReviewDate": "2017-04-21 00:00:00",
              "PreStartupReviewDate": "2017-04-21 00:00:00",
              "ComplianceAuditDate": "2015-06-23 00:00:00",
              "AuditCompletionDate": "2015-10-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2017-04-21 00:00:00",
              "HotWorkPermitReviewDate": "2017-04-21 00:00:00",
              "ContractorSafetyReviewDate": "2017-04-21 00:00:00",
              "ContractorSafetyEvalDate": "2017-04-21 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000088850,
                  "PreventionProgram3ID": 1000071531,
                  "ProcessChemicalID": 1000105743
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000067559,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Frederick Office of Life Safety",
    "CoordinatingAgencyPhone": "3016003463",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000067559,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nCostco Wholesale maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan will be reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes.\n\n\n\nCostco Wholesale has coordinated emergency response efforts with the local fire department, Frederick Fire Department.  In the case of an ammonia related emergency, it is the policy of Costco Wholesale to evacuate the employees and to allow the responders to respond to the emergency (potentially with the assistance of trained facility personnel).  The refrigeration contractor will be available for guidance.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nCostco Wholesale began operation of the facility in September 2009.  The ammonia system at the Costco Wholesale consists primarily of vessels, compressors, condensers, evaporators and associated piping.  The majority of the equipment is located inside the Engine Room.  The system is a closed loop refrigeration system similar to a residential refrigerator.  There are no emissions or planned releases of ammonia.\n\n\n\nThe Costco Wholesale facility provides cold storage space and a cross docking area for refrigerated items.  Ammonia sensors are located in the Engine Room and Warehouse that alert facility personnel, activate the ventilation system in the Engine Room, and close all feed lines out of the Engine Room.  The ammonia detection system also has the capability to shut off all electrical power to the Engine Room.  \n\n\n\nThe maximum intended inventory of ammonia is 22,020 pounds.  \n\n\n\nRefrigeration process equipment at the facility operates continuously. "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000067559,
      "SummaryText": " Compressors and condensers cycle on and off to comply with system demand during operation.  The ammonia refrigeration system provides cooling for the refrigerated depot.  The majority of the system equipment is located in the ammonia Engine Room.  Condensers are mounted on the Engine Room roof, the water diffusion tank is located underground outside the Engine Room, and the evaporators are placed in the cold storage and dock areas. \n\n\n\nRISK MANAGEMENT PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\n\n\nThe Costco Wholesale ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the facility operates in accordance with OSHA's Process Safety Management regulation and EPA's Risk Management Program (RMP).  The facility also maintains a contract with a professional refrigeration service firm to conduct preventative maintenance and any necessary repairs.\n\n\n\nThere are ammonia sensors strategically located in the Engine Room and the Warehouse.  The ammonia sensor in the Engine Room has a detection set point of 25 ppm for alarm and 50 ppm for initiation of the auto dialer and the emergency exhaust fan.  The ammonia detectors in the warehouse will activate the audible and visual alarms in the area and initiate the auto dialer at 25 ppm. At 50 ppm, the zone is deactivated.\n\n\n\nIn the event of a power failure, ammonia operations would automatically shut down (solenoid valves close, compressors shut down, condenser fans and water pumps shut down, evaporator fans shut down, etc.), thereby limiting the possibility of any ammonia releases. \n\n\n\nThe system also incorporates a pressure relief system.  In the event of over pressurization, vessels will vent to a common header which relieves to an underground water diffusion tank until the system pressure decreases sufficiently to reseat the valves.  This mechanism prevents vessels from rupturing in case they b"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000067559,
      "SummaryText": "ecome over pressurized.\n\n\n\nIn addition to the Uniform Mechanical Code, Costco Wholesale has developed a preventive maintenance program that utilizes the services of a professional refrigeration contractor to complete regularly scheduled inspections and tests of the ammonia refrigeration system as well as repairs as needed to process equipment.  This program is implemented throughout the company.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThe EPA's RMP Program defines \"accident\" as the following:\n\n\n\n\"The release must be from a covered process and involve a regulated substance held above its threshold quantity in the process.\n\n\n\nThe release must have caused at least one of the following:\n\n\n\n?    On-site deaths, injuries, or significant property damage (?68.42(a)); or\n\n?    Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (?68.42(a)).\"\n\n\n\nBased on the above definition and an investigation into the facility's accident history, there have been no releases of ammonia that exceeded this criteria or the Federal Reportable Quantity of 100 pounds in the last five years (January 2013 - January 2018). In addition, there have been no injuries resulting from an ammonia release, nor any releases or \"near misses\" that warranted an internal incident investigation.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nCostco Wholesale has an emergency action plan in effect at the facility.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP document, which is maintained at the facility.  Emergency response activities are coordinated with the Frederick Fire Department.  In case of a major ammonia emergency, the facility will first call 9 1 1 to alert the local Police and Fire Department.  Other responders will be called as needed.  If a release exceeds the federal reporting quantity of 100 pounds for ammonia, calls will be made to the following organizations:  the National Response Center and within 15 minut"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000067559,
      "SummaryText": "es, the Maryland Department of the Environment, and the EPA Region 3 Main Office.\n\n\n\nCostco Wholesale will be responsible for evacuating and ensuring the safety of its employees and will coordinate emergency response efforts with the Fire Department and its refrigeration contractor on a periodic and ongoing basis.  The facility holds evacuation training at least once per year.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nCostco Wholesale has a corporate program that includes annual review meetings with an on-site personnel to ensure on-going compliance with the Process Safety Management and Risk Management Programs. The programs are monitored by this annual program as well as by the services of a 3rd party auditor to ensure the program continues to be properly implemented and managed. \n\n"
    }
  ]
}