{
  "FacilityID": 1000080051,
  "FacilityName": "Charles M. Bolton Plant",
  "FacilityStr1": "6800 East River Road",
  "FacilityStr2": null,
  "FacilityCity": "Fairfield",
  "FacilityState": "OH",
  "FacilityZipCode": "45014",
  "Facility4DigitZipExt": "5610",
  "FacilityCountyFIPS": "39017",
  "LEPC": "Butler County LEPC",
  "FacilityLatDecDegs": "39.315000",
  "FacilityLongDecDegs": "-084.608611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "S1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Greater Cincinnati Water Works",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Greater Cincinnati Water Works",
  "OperatorStr1": "6800 East River Road",
  "OperatorStr2": null,
  "OperatorCity": "Fairfield",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45014",
  "OperatorZipCodeExt": "5610",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000065314",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-06-05 14:29:35",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-05 14:29:35",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-06-05 14:29:35",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 39.315,
  "FRS_Long": -84.608611,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000099923,
      "AltID": "Chlorination System",
      "FacilityID": 1000080051,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125184,
          "ProcessID": 1000099923,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000101166,
          "ProcessID": 1000099923,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000084472,
              "Process_NAICS_ID": 1000101166,
              "SafetyReviewDate": "2019-05-23 00:00:00",
              "PHA_Date": "2019-05-22 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-05-23 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-05-23 00:00:00",
              "TrainingReviewDate": "2019-05-23 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-05-23 00:00:00",
              "EquipmentInspectionDate": "2019-05-14 00:00:00",
              "EquipmentTested": "Ton cylinders, connections, valves, flexible tubing, gauges, regulators, and chlorinators.",
              "ChangeMgmtDate": "2019-05-30 00:00:00",
              "ChangeMgmtReviewDate": "2019-05-30 00:00:00",
              "PreStartupReviewDate": "2019-06-03 00:00:00",
              "ComplianceAuditDate": "2019-05-31 00:00:00",
              "AuditCompletionDate": "2019-05-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2019-05-22 00:00:00",
              "HotWorkPermitReviewDate": "2019-05-23 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000105251,
                  "PreventionProgram3ID": 1000084472,
                  "ProcessChemicalID": 1000125184
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000080051,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "City of Fairfield Fire Department",
    "CoordinatingAgencyPhone": "5138675378",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080051,
      "SummaryText": "e scenario is a total release from one of the one-ton containers of chlorine (greatest amount held in a single vessel).  It is assumed that the container ruptures and its entire contents escape to the outside air in 10 minutes.   Additionally, the worst-case scenario requires a ground level release height.  The rate of chlorine release for the worst case scenario is 200 pounds of chlorine per minute.  Using the USEPA RMP Comp software, a toxic endpoint of 3.0 miles was determined for the worst case scenario.  Using Circular Area Profiling System(CAPS)the residential population within a 3.0 mile radius of influence for Charles M. Bolton Plant was determined to be approximately 25,450 people.  Also included within this radius are several schools, parks and industrial areas.\r\nNeither the passive mitigation of the building nor the functions of the scrubber were taken into consideration for this scenario. \r\n\r\nThe facility is also required to complete at least one alternative release scenario.  The alternative release scenario was evaluated in accordance with the guidelines provided in 40 CFR 68.22 and 40 CFR 68.28.  The alternative release scenario selected was that of a 3/16 inch diameter opening in a valve, gasket, flexible tubing, or piping occurring inside the enclosed Storage/Unloading Room or Chlorine Feed Room.  This results in a release rate of 3.0 pounds of chlorine per minute for 30 minutes. The USEPA Comp software gives a distance of 0.1 miles to the toxic endpoint for the alternative scenario.  The residential population within a 0.1 mile radius of influence of the CMBP Chlorination System as determined by Circular Area Profiling System(CAPS) is approximately zero persons.  The radius of influence does go offsite and includes the East River Road; however it does not encompass any residences, schools, hospitals, parks, or prisons. Neither the passive mitigation of the building nor the functions of the scrubber were taken into consideration for this scenario."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000080051,
      "SummaryText": "Section 68.155(c): Accidental Release Prevention Program.\r\n\r\nThe Charles M. Bolton Plant facility has a documented Prevention Program for the Chlorination System that documents release prevention measures.  These prevention measures include elements such as employee participation, process safety information, process hazard analysis, operating procedures, training, contractors, pre-startup review, mechanical integrity, hot work permits, management of change, incident investigation, and compliance audits.  \r\n\r\nThe Chlorination Facility is equipped with many safety features to prevent public exposure in the event of a chlorine leak.  One chlorine leak detector is located in the Storage/Unloading Room and one in the Chlorine Feed Room.  To allow safety personnel time to respond to emergencies, an audible warning alarm sounds inside and outside of the building when chlorine levels reach 1.0 ppm.  At 1.0 ppm a high level alarm is sounded and the normal building ventilation system automatically shuts down to contain the chlorine.  In addition, the chlorine detector alarms are connected to the CMBP control panel, and the CMBP, Mason Water Treatment Plant, and Richard Miller Water Treatment Plant SCADA system.  This alerts the staff at all plants in the event of a chlorine release. CMBP employees who are involved in chlorine operations are trained in specific procedures regarding handling and storage of chlorine at the facility.\r\n\r\nThere is also a dry media single-pass chlorine scrubber designed to neutralize the entire contents of a fully loaded one-ton cylinder. The scrubber is activated by an alarm state on either of the two chlorine detectors. The system will run until manually shut down from a switch located outside the chlorine areas. \r\n\r\n\r\nSection 68.155(d): Five-Year Accident History.\r\n\r\nThe Charles M. Bolton Plant has had no accidental releases of chlorine in the last five years that have resulted in on-site injuries or off-site injuries or other impacts."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080051,
      "SummaryText": "Introduction\r\n\r\nThe USEPA Risk Management Program (RMP) Rule (40 CFR 68), published in the Federal Register on June 20, 1996, was developed to assist facilities in preventing accidental releases of highly toxic or flammable chemicals.  The RMP applies to an owner or operator of a stationary source that has more than a threshold quantity of a regulated substance in a process, as determined under Section 68.115.\r\n\r\nThe USEPA has established three tiers of requirements to reduce the level of effort for facilities with a lower risk of offsite impacts.  These tiers are known as Programs 1, 2, and 3.  Program 1 applies to any process that has not had an accidental release with prescribed offsite consequences for five years and has no public receptors impacted by a worst-case release.  Program 3 applies to processes in specified industries, and to all processes subject to the OSHA Process Safety Management (PSM) Standard, unless the process is eligible for Program 1.  Program 2 applies to processes not covered by Programs 1 or 3.\r\n\r\nThe Greater Cincinnati Water Works, Charles M. Bolton Plant (CMBP) utilizes more than a threshold quantity of chlorine (2,500 pounds) in their process.  Therefore, this facility is required to submit a Risk Management Plan (RMP) as defined in Section 68.150 by May 2019 (five years after the previous May, 2014 RMP submission).  Public employees are covered under the State of Ohio Public Employee Risk Reduction Program (PERRP), which has adopted by reference the requirements of OSHAA's (PSM) Standard.  Based on the March 1999 revised USEPA RMP Guidance for Wastewater Treatment Plants (WWTPs) (EPA 550-B-98-010), the Charles M. Bolton Plant is subject to the OSHA Process Safety Management (PSM) Standard and the worst case release scenario impacts public receptors.  Therefore, the Charles M. Bolton Plant Chlorination Facility is subject to the Program 3 requirements of the RMP Regulation.  \r\n\r\nUSEPAA's RMP Rule requires that covered facilities prepa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080051,
      "SummaryText": "re an Executive Summary.  The following pages represent the Executive Summary, summarizing the items required as described in 40 CFR 68.155 (a) through (f).\r\n\r\n\r\nSection 68.155(a): Accidental Release and Emergency Response Policies.\r\n\r\nThe Charles M. Bolton Plant (CMBP) has emergency response procedures in place, as documented in the facilityA¿s Emergency Action Plan.  This plan has been documented by the City staff responsible for the operation and maintenance of the CMBP.  The CMBP has procedures in place, including both onsite activities and coordination with offsite responders, which must be followed in the event of a chlorine leak.  All personnel involved in handling chlorine are trained with regard to chlorine safety and accident prevention.\r\n\r\n\r\nSection 68.155(b): Stationary Source and Substance Handled.\r\n\r\nThe stationary source subject to 40 CFR Part 68 is the Charles M. Bolton Plant (CMBP) Chlorination System.  The CMBP has a design capacity of 40 million gallons of water per day (MGD) and treats groundwater to drinking water standards.  The CMBP Chlorination System is located in the Administration and Filtration Building, and is divided into two rooms dedicated to specific tasks: the Storage/Unloading Room, and the Chlorine Feed Room.\r\n\r\nThe Storage/Unloading Room houses a maximum of ten (10) one-ton containers that store chlorine as a pressurized liquid.  For normal operating conditions, there are four one-ton containers of chlorine on a scale connected to the main manifold system.  There is a second scale with three one-ton containers of chlorine connected to the main manifold system.  There is also room for three more containers of chlorine.  Chlorine gas is fed from the containers through an automatic, vacuum operated switchover valve, and then under vacuum to the chlorinators in the Chlorine Feed Room.  Four vacuum chlorinators and three water operated injectors are provided for solution chlorine feed at various process locations.\r\n\r\nThe Chlorination"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000080051,
      "SummaryText": "Section 68.155(e): Emergency Response Program.\r\n\r\nThe Charles M. Bolton WTP has developed an Emergency Action Plan to ensure employee safety as allowed by 40 CFR 68.90(b).  The Bolton WTP facility Emergency Action Plan outlines actions required to respond to a chlorine emergency and has coordinated this plan with the City of Fairfield Fire Department.  Fire Department personnel are the designated first responders in the event of a non incidental chlorine emergency.  Charles M. Bolton WTP employees are not designated first responders to a serious or unplanned chlorine release.  As specified in 40 CFR 68.90(b), Charles M. Bolton WTP's Emergency Action Plan meets the exception listed, and therefore the facility is not required to have the Emergency Response Program of 40 CFR 68.95.\r\n\r\n\r\nSection 68.155(f): Safety Improvements:\r\n\r\nA Process Hazard Analysis (PHA) was completed per OSHA 29 CFR 1910.119(e) on May 22, 2019.  There were no recommended safety improvements.  additional recommendations may be made upon review of any accidents and/or when the PHA is updated every five years."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080051,
      "SummaryText": "Facility is equipped with many safety features to prevent public exposure in the event of a chlorine leak.  One chlorine leak detector is located in the Storage/Unloading Room and one in the Chlorine Feed Room.  To allow safety personnel time to respond to emergencies, an audible warning alarm sounds inside and outside of the building when chlorine levels reach 1.0 ppm.  At 1.0 ppm a high level alarm is sounded and the normal building ventilation system automatically shuts down to contain the chlorine.  In addition, the chlorine detector alarms are connected to the CMBP control panel, and the CMBP and Richard Miller Water Treatment Plant SCADA system.  This alerts the staff at all plants in the event of a chlorine release.\r\nThere is also a dry media single-pass chlorine scrubber designed to neutralize the entire contents of a fully loaded one-ton cylinder. The scrubber is activated by an alarm state on either of the two chlorine detectors. The system will run until manually shut down from a switch located outside the chlorine areas. \r\n\r\n\r\nSection 68.165: Offsite Consequence Analysis.\r\n\r\n As a Program 3 Process with one toxic gas, one worst-case release scenario and one alternative release scenario has been assessed for the Chlorination System.  The Charles M Bolton Plant has chosen to use software developed by the USEPA to determine endpoints of a hypothetical chlorine release. RMP Comp software is for facilities storing above a threshold quantity, as a guide to determine off-site consequences.  This software addresses a variety of chemicals, including chlorine.  Therefore, this guidance document is applicable to the Charles M. Bolton Plant's chlorination process. The dry scrubber is not considered as a mitigating factor in either scenario. It is assumed the scrubber is not available. \r\n\r\nThe worst-case release scenario was determined in accordance with the requirements provided in 40 CFR 68.22 and 40 CFR 68.25(b,c).  For the CMBP Chlorination Facility the worst-cas"
    }
  ]
}