{
  "FacilityID": 1000068779,
  "FacilityName": "Sunoco Partners Mktg. and Terminals LP Romulus, MI",
  "FacilityStr1": "29120 Wick Road",
  "FacilityStr2": null,
  "FacilityCity": "Romulus",
  "FacilityState": "MI",
  "FacilityZipCode": "48174",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26163",
  "LEPC": "Wayne County LEPC",
  "FacilityLatDecDegs": "42.240359",
  "FacilityLongDecDegs": "-83.324195",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "www.sunocologistics.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 43063473,
  "ParentCompanyName": "Sunoco Partners Mktg. and Terminals LP Romulus, MI",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sunoco Partners Mktg. and Terminals",
  "OperatorStr1": "One Fluor Daniel Drive",
  "OperatorStr2": "Building A",
  "OperatorCity": "Sugar Land",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77478",
  "OperatorZipCodeExt": "5095",
  "FTE": 4,
  "OtherEPAFacilityID": "MID053320677",
  "EPAFacilityID": "100000221128",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "6833011",
  "SafetyInspectionDate": "2017-02-02 00:00:00",
  "SafetyInspectionBy": "MIOSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-03-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-03-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-03-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-03-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000086235,
      "AltID": null,
      "FacilityID": 1000068779,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000107644,
          "ProcessID": 1000086235,
          "ChemicalID": 118,
          "Quantity": 290000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000087456,
          "ProcessID": 1000086235,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000072872,
              "Process_NAICS_ID": 1000087456,
              "SafetyReviewDate": "2016-10-04 00:00:00",
              "PHA_Date": "2016-10-04 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-10-27 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Hydrocarbon detector (pump area, blending skid), flow monitor along with temperature, pressure and liquid level indicators.",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-11-01 00:00:00",
              "TrainingReviewDate": "2016-11-18 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-02-14 00:00:00",
              "EquipmentInspectionDate": "2017-08-30 00:00:00",
              "EquipmentTested": "Butane vessel",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2012-07-19 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2015-11-18 00:00:00",
              "AuditCompletionDate": "2016-11-18 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2016-11-18 00:00:00",
              "HotWorkPermitReviewDate": "2015-02-16 00:00:00",
              "ContractorSafetyReviewDate": "2018-01-12 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "The Butane Blending System consisting of one (1) 59,784 gallon vessel plus lines.  Butane, liquefied under pressure is blended with refined product (gasoline) via lines feeding a truck loading rack.  Butane is delivered via truck.  Blending occurs during the blending season, September 16 - April 30.  The system design meets or exceeds NFPA #58 (LP gas).",
              "_chemicals": [
                {
                  "PrimaryKey": 1000090551,
                  "PreventionProgram3ID": 1000072872,
                  "ProcessChemicalID": 1000107644
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000068779,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "City of Romulus Fire Department",
    "CoordinatingAgencyPhone": "7349418585",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000068779,
      "SummaryText": "Sunoco Partners Marketing and Terminals L.P.\n\nRomulus Terminal\n\nRMP EXECUTIVE SUMMARY\n\n\n\n5-YEAR RESUBMISSION (MARCH 2018)\n\nThe 5-year resubmission of the Romulus Terminal Risk Management Plan included a complete review and update to the program. All elements of the submittal have been verified and updated as applicable and the worst-case and alternative scenarios have been reevaluated. The modeling reevaluation did not result in an increase in the off-site impact of the Butane Blending system as measured by the distance to end point of the worst-case scenario and the population affected .  Due to a recent change in company policy, the maximum intended inventory was changed as a part of this resubmission. Previous practice was to include the operational safeguard that restricted the butane storage vessel to 85% capacity. While that control is still in place, current company policy is to assume that the vessel is 100% full for RMP related calculations. This resulted in an increase of approximately 40,000 lbs. of butane but was not significant enough to alter the worst-case scenario. \n\n\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RELEASE POLICIES\n\n\n\nSunoco Partners Marketing and Terminals L.P. - Romulus Terminal is an onshore, light products, bulk petroleum storage terminal used in the storage and distribution of petroleum products to retail and commercial end-users in the vicinity of Romulus, Michigan. The Terminal handles and stores various grades of unleaded gasoline, diesel, butane, ethanol, and petroleum based additives.\n\n\n\nSunoco Partners Marketing and Terminals L.P.- Romulus Terminal in Romulus, MI, hereafter referred to as Romulus Terminal, is committed to operating in a safe, reliable, and environmentally sound manner, in keeping with the core philosophy that a strong and emphasized health, safety, and environment program goes hand in hand with operating reliably and integrity. Outstanding HSE performance is of paramount importance.\n\n\n\nRomulus Terminal is d"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000068779,
      "SummaryText": "esigned, operated and maintained in a manner that protects the environment as well as the health and safety of our employees, contractors, and the surrounding community. HSE is promoted through programs of awareness, compliance, prevention, and protection. These programs include a combination of accidental release prevention and emergency response planning. This document provides a brief overview of the comprehensive risk management activities that are currently implemented including:\n\n\n\nA. A description of the facility and the use of regulated substances\n\nB. An overview of the accidental release prevention programs\n\nC. A five-year accident history for accidental releases of regulated chemicals\n\nD. An overview of the emergency response program\n\nE. An overview of planned changes to improve safety\n\n\n\nA. STATIONARY SOURCE AND REGULATED SUBSTANCES\n\n\n\nThe primary function of the Romulus Terminal is to act as a refined petroleum distribution facility. The Butane Blending process has been classified as Program level 3. No Program level 1 or Program level 2 processes containing regulated substances were identified at Romulus Terminal. Due to the flammable effects associated with butane, it is necessary to observe certain safety precautions in handling butane to prevent unnecessary human exposure, to reduce the threat to employee health, and to minimize the threat and impact to nearby members of the community. Romulus Terminal is strongly committed to employee, public, and environmental safety and health. Safety at the Facility depends upon the manner in which butane is handled as well as the various safety devices incorporated into the design of the process. Furthermore, comprehensive training is provided to employees, which reinforces the safety policies and procedures of the Romulus Terminal.\n\n\n\nThe facility has fixed inventories of butane. Butane is received by truck (transports) and stored in one (1) 59,784-gallon storage vessel. Specifically, liquefied butane is off-lo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000068779,
      "SummaryText": "aded by truck for storage under pressure (pressure reliefs set at 250 psi on the storage vessel). The butane is pumped to the Butane Injection Skid for direct injection into regular and premium unleaded gasoline lines feeding the site gasoline truck-loading rack.  Injection quantities are controlled via the Injection Skid and Bartec-Benke Analyzer. Process safety controls include excess flow valves, low-melting point feeds (fusible links) to pneumatic valves that fail in a safe position, 85% fill shutoff (80% alarm) on the vessel, emergency shut-off devices on the system, in-line hydrostatic reliefs, and grounding/interlock devices. Access to Romulus Terminal is restricted to authorized employees, management personnel, authorized contractors/visitors and tenants.\n\n\n\nB. GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION MEASURES\n\n\n\nAccidental release prevention programs and emergency planning and response programs are in place to effectively manage the hazards posed by the regulated substances to employees, the public, and the environment. The covered process is regulated by the EPA RMP regulation 40 CFR Part 68, as well as the OSHA Process Safety Management standard 29CFR 1910.119. The following accident prevention program elements are in place at the Romulus Terminal:\n\n\n\n1) Employee Participation\n\n2) Process Safety Information\n\n3) Process Hazard Analysis (PHA) with Risk Assessments\n\n4) Standard Operating Procedures\n\n5) EHS Operator Training\n\n6) Contractors\n\n7) Pre-startup Safety Review\n\n8) Mechanical Integrity with Preventive Maintenance\n\n9) Work Permits\n\n10) Management of Change\n\n11) EHS Accident or Potential Catastrophic Event Investigation\n\n12) Emergency Response\n\n13) Compliance Audits\n\n14) Trade Secrets\n\n\n\nThe fourteen (14) individual elements of the prevention program work together to prevent accidental chemical releases. Romulus Terminal is committed to the standards required by these management programs. In addition to the above e"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000068779,
      "SummaryText": "lements, specific prevention measures have been developed and are employed as part of our operating procedures and in the form of engineering and administrative controls to help contain/control a release, quickly detect a release, and reduce the consequences of a release. These are briefly summarized as follows:\n\n\n\nGeneral Risk Reduction and Safety Measures\n\n\n\n-Engineering and construction is in accordance with recognized industry and company standards\n\n-Equipment is properly designed with protection from overpressure (pressure safety relief valves, etc.)\n\n-Updated technical drawings, Piping & Instrument Diagrams and Process Flow Diagrams are available\n\n-Operating systems are monitored and controlled by trained Operators\n\n-Computerized monitoring and controls are incorporates in process operation\n\n-Redundant control systems are in place\n\n-Automatic and manual shutdown devices are available for critical systems\n\n-Instruments, measuring equipment, and safety devices are maintained and inspected\n\n-Vehicular traffic is prohibited from critical areas\n\n-Facility is secure and access is controlled\n\n-Regular safety meetings and safety awareness programs are scheduled\n\n-Safety inspections and audits are routinely conducted\n\n-Radio communication system is in place\n\n-Units are frequently surveilled by operators\n\n\n\nGeneral Release Mitigation\n\n\n\n-Automatic and remotely operated shut-offs to limit release quantity are installed\n\n-Strategically located valves are installed to isolate leaks\n\n-Hydrocarbon detectors are installed at key areas to warn of a chemical release\n\n\n\nGeneral Emergency Response\n\n\n\n-Emergency alert system is in place\n\n-Periodic emergency training for employees occurs.\n\n-Communication systems with local emergency responders and regulatory agencies are employed\n\n-Emergency drills with plant personnel, regulatory agencies, and community emergency responders are conducted to enhance response skills and coordination among agencies\n\n-Mutual Aid program in place with "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000068779,
      "SummaryText": "Local Fire Departments\n\n-Facility participates with the Local Emergency Planning Committee (LEPC)\n\n\n\nFurther, the Romulus Terminal complies with the National Fire Protection Association's (NFPA's) Liquefied Petroleum Gas (LPG) Code (NFPA-58 [2011]) requirements for LP Gas storage. In addition to the presence of appropriate controls to prevent possible releases of butane, if a release does occur, an Integrated Contingency Plan (ICP)  is in place for the Facility and response activities are coordinated with the City of Romulus Fire Department, Wayne County Department of Homeland Security and Emergency Management, and the Wayne County LEPC.\n\n\n\nC. FIVE YEAR ACCIDENT HISTORY\n\n\n\nThe Romulus Terminal has an excellent record of accident prevention. The terminal keeps records for all significant accidental chemical releases that occur at our facility. There have been no reportable incidents within the past five (5) years resulting from the chemical release of materials covered under the EPA RMP regulation.\n\n\n\nD. EMERGENCY RESPONSE PROGRAM\n\n\n\nResponse actions are coordinated with the City of Romulus Fire Department. An Integrated Contingency Plan (ICP) is in place to inform employees what to do in case of a release or fire, and to notify emergency responders when there is a need for a response.\n\n\n\nThe Terminal maintains compliance with local, state and federal regulations including OSHA CFR 1910.120, and Sara Title III. The programs are reviewed and updated as required. The Discharge Prevention, Containment and Countermeasure Plan (DPCC) and Integrated Contingency Plan (ICP) provide the essential planning and training for protecting employees, the public, and the environment during emergency situations. Contained in these Plans are written procedures that outline the actions to be taken for various types of emergencies that could occur at the terminal. These emergencies include: airborne releases of chemical substances, spills to the water or ground, fires, explosions. The Pr"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000068779,
      "SummaryText": "ograms address all aspects of emergency response including:\n\n\n\n- Roles and responsibilities of personnel responding to the incident\n\n- Procedures for notifying employees that a release has occurred\n\n- Procedures for terminal evacuation and accounting of personnel\n\n- Procedures to notify local emergency response organizations and other appropriate authorities that a release has occurred\n\n- Guidance on proper first aid treatment\n\n- Procedures for post incident cleanup and decontamination\n\n\n\nThe terminal also maintains its own dedicated emergency response equipment. This equipment includes portable fire extinguishers, flame retardant clothing and first aid equipment. An inspection, testing and maintenance program is in place for emergency response equipment. Fire extinguishers are inspected monthly and receive annual maintenance per the international fire code. Inspection reports for emergency response equipment are filed onsite.\n\n\n\nIn the event of an emergency involving the Romulus Terminal butane blending system, it is the policy of the Facility to initially contact the City of Romulus Fire Department and request their assistance. The Facility maintains a trained (annually) incipient fire capability. The Facility's emergency response plans are coordinated with the City of Romulus Fire Department and LEPC. The Wayne County Homeland Security and Emergency Management and Detroit Metropolitan Wayne County Airport also maintain a full hazardous material response team, are aware of the Facility's butane blending system access and sources. Romulus Terminal maintains a vegetation control program to minimize plant growth within 10 feet of the system.\n\n\n\nThe Facility also maintains a relationship with the City of Romulus Fire Department. Tours and drills with members of local emergency response organizations are held routinely. These tours and drills enable the public emergency responders to become familiar with the hazards, equipment, resources and personnel in the terminal.\n"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000068779,
      "SummaryText": "\n\n\nE. PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nRomulus Terminal is continually striving to be the safest and most reliable workplace possible for employees, and the surrounding community. The facility's focus is \"Nobody Gets Hurt\".  The goal of the Sunoco Partners Marketing and Terminals L.P. - Romulus Terminal is to demonstrate continuous improvement in our health, environmental and safety performance. In addition, the Facility intends to work cooperatively with the community to address any concerns. \n\n"
    }
  ]
}