{
  "FacilityID": 1000047090,
  "FacilityName": "Black Hawk Northeast Central Delivery Point",
  "FacilityStr1": "1155 Oliver Road",
  "FacilityStr2": null,
  "FacilityCity": "Cuero",
  "FacilityState": "TX",
  "FacilityZipCode": "77954",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48123",
  "LEPC": "De Witt County LEPC",
  "FacilityLatDecDegs": "29.263027",
  "FacilityLongDecDegs": "-97.388365",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.Bhpbilliton.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 45271561,
  "ParentCompanyName": "BHP Billiton Petroleum \"Eagleford Gathering\" LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "BHP Billiton Petroleum LLC",
  "OperatorStr1": "1360 Poast Oak Blvd",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77056",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000227177",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-02-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-02-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-02-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-09-11 00:00:00",
  "DeRegistrationEffectiveDate": "2017-09-25 00:00:00",
  "AnniversaryDate": "2020-02-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "the site does not exceed the threshold quantity for a regulated substance",
  "_processes": [
    {
      "ProcessID": 1000058784,
      "AltID": "Blackhawk NE",
      "FacilityID": 1000047090,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000071770,
          "ProcessID": 1000058784,
          "ChemicalID": 155,
          "Quantity": 490000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000062295,
              "ProcessChemicalID": 1000071770,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000062296,
              "ProcessChemicalID": 1000071770,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000062297,
              "ProcessChemicalID": 1000071770,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000062298,
              "ProcessChemicalID": 1000071770,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000062299,
              "ProcessChemicalID": 1000071770,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000062300,
              "ProcessChemicalID": 1000071770,
              "ChemicalID": 115
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000059806,
          "ProcessID": 1000058784,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000047090,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "DeWitt County LEPC",
    "CoordinatingAgencyPhone": "3612750878",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000047090,
      "SummaryText": "Blackhawk North East Gas Plant\n\nBHP Billiton Petroleum \"Eagleford Gathering\" LLC\n\n\n\nEPA Identifier:  1000 0022 7177 \n\nRisk Management Plan\n\n\n\nExecutive Summary\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nThe Blackhawk North East Gas Plant has a standing commitment to worker and public safety, demonstrated by the resources invested in accident prevention.  These resources include safety in the design, installation, operation and maintenance of the facility's process and training of operations personnel and contractors.  BHP Billiton Petroleum \"Eagleford Gathering\" LLC (Eagleford Gathering) implements reasonable controls to prevent foreseeable releases of regulated substances.  Should a release occur, trained personnel will respond to control and contain the release, and/or mitigate any off-site consequences.\n\n\n\nDescription of the Stationary Source and Regulated Substances\n\n\n\nThe Blackhawk North East Gas Plant located in DeWitt County, Texas is owned by Eagleford Gathering.  Blackhawk North East is a natural gas processing plant comprised of natural gas liquid processing and natural gas treatment and compression equipment.  The natural gas liquid recovery equipment is designed to recover natural gas liquids from the inlet gas.  Produced gas and liquids are delivered to the facility from gathering systems and pipelines.  The facility processes natural gas, natural gas liquids, and stabilized condensate.  The facility equipment operates to separate, stabilize, treat (as necessary to remove hydrogen sulfide), compress (gas), dehydrate (gas), store (natural gas liquids and stabilized condensate), and transfer the above to sales.  Natural gas and stabilized condensate are transported by pipeline from the facility. Natural gas liquids are trucked from the facility.  Blackhawk North East was evaluated to determine if any regulated flammable or toxic substances exceed the threshold quantity.  Eagleford Gathering identified the regulated substances and "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000047090,
      "SummaryText": "quantities kept on site based on analytical data and process knowledge.  Regulated flammable mixtures of the listed flammable substances methane, ethane, propane, iso-butane, normal butane, and pentane are found above the threshold quantities at the Blackhawk North East Plant.  The evaluation identified no toxic substances above RMP-regulated threshold quantities in the process.  The facility is subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) regulation and is classified as a Program 1 process per the U.S. EPA's Accidental Release Prevention Risk Management Program (RMP). \n\n\n\n\n\n\n\n\n\n\n\nFive Year Accident History\n\n\n\nThere have been no large or small accidental releases resulting in injuries to site personnel or contractors, or offsite consequences. \n\n\n\nEmergency Response Program Information\n\n\n\nThe Blackhawk North East Plant maintains written emergency procedures to protect worker and public safety and the environment.  Procedures for a fire or explosion and notification of local emergency response agencies in the event of an accidental release are included.  Employees are trained on the emergency procedures.  The emergency procedures are updated as needed for modifications made to the facility.  Changes to the emergency procedures are administered through the Management of Change process.\n\n\n\nBlackhawk North East Plant plans for the overall emergency program for this facility to be coordinated with the DeWitt County Local Emergency Planning Committee (LEPC).  Coordination includes periodic meetings of the committee, which includes BHP Billiton representatives, local emergency response officials, local government officials, and industry representatives.  Blackhawk North East plans to have 24/7 communications capability with appropriate LEPC officials and emergency response organizations (e.g., Volunteer Fire Department and DeWitt County Sheriff's office).  This will provide a means of notifying the public of an incident"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000047090,
      "SummaryText": ", if necessary, as well as facilitating response to an incident.  In addition to periodic LEPC meetings, Blackhawk North East plans to conduct periodic emergency drills that involve the LEPC and emergency response organizations.  Blackhawk North East plans to provide periodic refresher training to local emergency responders regarding the hazards of regulated substances in the facility.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nThe Blackhawk North East Plant tracks and resolves all PHA recommendations.  All personnel, employees, and contractors are encouraged to notify their supervisor of any changes or modifications to the facility that could result in improved safety.  Plans to improve the safety include:  1) Revisions to Operating Procedures to reflect changes to the process and provide clear instruction for operator response; 2) Installation of more reliable process controls, as such devices become available; and 3) Installation of more reliable process area detection systems, as such systems become available.\n\n"
    }
  ]
}