{
  "FacilityID": 10058,
  "FacilityName": "City of Quincy, Wastewater Treatment Facility",
  "FacilityStr1": "700 W. Lock & Dam Road",
  "FacilityStr2": null,
  "FacilityCity": "Quincy",
  "FacilityState": "IL",
  "FacilityZipCode": "62301",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17001",
  "LEPC": null,
  "FacilityLatDecDegs": "39.901389",
  "FacilityLongDecDegs": "91.416667",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Quincy",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Quincy",
  "OperatorStr1": "730 Maine Street",
  "OperatorStr2": null,
  "OperatorCity": "Quincy",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62301",
  "OperatorZipCodeExt": null,
  "RMPContact": "David Kent",
  "RMPTitle": "Superintendent",
  "FTE": 21,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000007912",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-04-11 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-05-13 00:00:00",
  "ErrorReportDate": "1999-05-13 00:00:00",
  "ReceiptDate": "1999-05-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-05-11 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-05-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0.5e",
  "FRS_Lat": 39.90655,
  "FRS_Long": -91.40907,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 12553,
      "AltID": null,
      "FacilityID": 10058,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 12855,
          "ProcessID": 12553,
          "NAICSCode": "56221",
          "_desc": {
            "NAICS_CODE": "56221",
            "NAICS_DESCRIPTION": "Waste Treatment and Disposal"
          }
        },
        {
          "Process_NAICS_ID": 12856,
          "ProcessID": 12553,
          "NAICSCode": "562998",
          "_desc": {
            "NAICS_CODE": "562998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Waste Management Services"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 14299,
          "ProcessID": 12553,
          "ChemicalID": 62,
          "Quantity": 34000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 14300,
          "ProcessID": 12553,
          "ChemicalID": 98,
          "Quantity": 42000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 514299,
          "ProcessID": 12553,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 514300,
          "ProcessID": 12553,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 10058,
      "SummaryText": "The City of Quincy, Illinois (Quincy) operates a wastewater treatment facility that uses chlorine and propane.  Since 2,500 or more pounds (lb) of chlorine and 10,000 or more pounds of propane are stored at the facility, the facility is subject to the requirements of the Clean Air Act Amendments (CAAA), Section 112(r).  These requirements are stipulated by the United States Environmental Protection Agency (EPA) Accidental Release Prevention regulations (40 CFR, Part 68), also known as EPA's Risk Management (RM) regulations.\n\nThis RM plan fulfills the requirements of EPA's RM regulations.  This plan presents the management plan the City of Quincy uses to ensure compliance; the potential offsite impacts of releases (worst case and alternate case scenarios); how releases are prevented; and how the emergency response program works in the event of a chemical release.  In addition, this plan presents the specific data elements that are electronically reported to the EPA as required by the RM planning program regulations.\n\nManagement Plan\nThe Director of Utilities is responsible for overall compliance with RM regulations.  The wastewater treatment facility supervisor assists the Director of Utilities.  The facility supervisor is responsible for ensuring that the facility complies with the RM program regulations.  The facility supervisor is supported locally by the maintenance supervisor, operators and staff level personnel for completion of the RM program compliance duties.\n\nChemical Release Prevention Program\nElements of the RM program have been developed with this document.  Key provisions of the Quincy wastewater treatment facility release prevention program are as follows:\n\n7 Employees who operate the chlorine and propane systems must receive training initially and periodically on safe startup/shutdown, operations, and emergency shutdown of the processes.\n7 Release incidents are investigated, and the results are used to improve the safety of the process.\n7 Release inci"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10058,
      "SummaryText": "dent investigation results are shared with all employees who could be affected by the process.\n7 Employees participate in a hazard review that identifies potential hazards and ways to improve the safety of the process every five years, or when significant changes are made to the process.\n\nWorst Case and Alternate Case Release Scenarios\nSeveral potential chlorine release events were modeled for the Quincy wastewater treatment facility.  EPA guidance (EPA November 1998) was used to identify worst case release scenarios (WCS) and alternate case release scenarios (ACS) as defined by the RM regulations.  Toxic endpoints were identified using EPA-approved methods.\n\nThe worst case chemical release (chlorine, 2,000 lb in 10 minutes) could potentially affect a radius of 1.3 miles in an urban environment.  An estimated population of 1,808 is located within this radius.\n\nThe ACS for chlorine consists of =-inch valve shear from the chlorine tank, releasing liquefied chlorine under pressure for 30 minutes.  The endpoint distance for this scenario is 0.45 miles.  An estimated population of 116 is located within this radius.\n\nThe worst case flammable release (propane, 42,000 lb in 10 minutes) could potentially affect a radius of 0.3 miles (explosion causing 1 pound per square inch [psi] over pressure).  An estimated population of 15 is located within this radius.\n\nThe ACS for propane consists of a 3-inch pipe break while pumping liquid propane and an explosion of the released propane.  The endpoint distance for this explosion is 0.2 miles.  An estimated population of 7 is located within this radius.\n\nFive-Year Accident History\nIn the past five years, the Quincy wastewater treatment facility has not had a chemical release that resulted in offsite property damage or offsite health consequences requiring medical attention.  However, three chlorine releases were reported to the Quincy Fire Department in the past five years.  An employee was taken to the hospital by the ambulance for o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 10058,
      "SummaryText": "ne of these three releases.  This particular release occurred on June 24, 1997 and was the result of a leaking chlorine tank.\n\nNo releases associated with the propane system have been reported in the past five years.\n\nEmergency Response Program\nThe emergency response program at the Quincy wastewater treatment facility consists of a facility leak response plan that incorporates the Quincy Comprehensive Disaster Plan (CDP).  The two plans reflect coordination between the facility supervisor and the City of Quincy fire department, local and state hazardous materials unit, emergency medical service, police department, regional emergency planning authorities, and other organizations.  The facility leak response plan covers the responsibilities of facility employees and supervisors.  The CDP covers a wide range of emergency and non-emergency situations.  Incorporated within the CDP are elements addressing emergency response to releases of toxic and flammable materials that might affect people or the environment near the wastewater treatment facility."
    }
  ]
}