{
  "FacilityID": 10202,
  "FacilityName": "MOBILIZATION AND EQUIPMENT TRAINING SITE (MATES)",
  "FacilityStr1": "WIARNG - MATES",
  "FacilityStr2": "242 EAST G STREET",
  "FacilityCity": "SPARTA",
  "FacilityState": "WI",
  "FacilityZipCode": "54656",
  "Facility4DigitZipExt": "5225",
  "FacilityCountyFIPS": "55081",
  "LEPC": "Monroe County LEPC",
  "FacilityLatDecDegs": "44.029167",
  "FacilityLongDecDegs": "-90.673806",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "mates@wi-arng.ngb.army.mil",
  "FacilityDUNS": null,
  "ParentCompanyName": "WISCONSIN ARMY NATIONAL GUARD (WIARNG)",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "WIAR-F, LTC JEFFREY J. LIETHEN",
  "OperatorStr1": "WI DEPT. OF MILITARY AFFAIRS",
  "OperatorStr2": "P.O. BOX 14587",
  "OperatorCity": "MADISON",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53714",
  "OperatorZipCodeExt": "0587",
  "FTE": 63,
  "OtherEPAFacilityID": "WID981780786",
  "EPAFacilityID": "100000014539",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-05-28 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-05-25 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2011-08-01 00:00:00",
  "DeRegistrationEffectiveDate": "2009-10-05 00:00:00",
  "AnniversaryDate": "2004-05-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.4",
  "FRS_Lat": 44.029167,
  "FRS_Long": -90.673806,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 12726,
      "AltID": "FUEL FOR HEATING BUILDING",
      "FacilityID": 10202,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 14525,
          "ProcessID": 12726,
          "ChemicalID": 98,
          "Quantity": 220000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 13037,
          "ProcessID": 12726,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 10202,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "MONROE COUNTY EMERGENCY MGT.OFFICE",
    "CoordinatingAgencyPhone": "6082698711",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 10202,
      "SummaryText": "e from the process, entry within the distance to the specified endpoint may pose a danger to public emergency responders.  Therefore, public emergency responders should not enter this area except as arranged with the emergency contact indicated in the RMP.  The undersigned certifies that, to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate, and complete.\n\n_______________________________________                     ______________________\nKenneth Uting, MAJ, WIARNG                                                                   (Date)\nMATES Superintendent\n\n\n\nEXECUTIVE SUMMARY\n\n\nAccidental release prevention and emergency response policies at our facility:\nThis facility complies with NFPA-58 requirements for LP-Gas storage, and it is WIARNG policy to adhere to all applicable federal, state, and local laws.  If an emergency were to occur, it is MATES policy to request the Fort McCoy Fire Department respond to the emergency by dialing 911.\nFacility description and the regulated substances handled:\nThe mission of the MATES facility is to provide direct and general support of WIARNG units by storing, servicing, maintaining, and repairing primarily large tracked vehicles (tanks, personnel carriers, etc.) and construction engineering equipment.  MATES also handles some wheeled vehicles.  The MATES differs from other maintenance facilities in the WIARNG in the way that it provides storage of tactical equipment that is used at Ft. McCoy for training and exercise purposes.  This is because the equipment is difficult and costly to transport to the training site from its assigned unit;  and requires specialized maintenance technicians.\n\nThe MATES occupies Building No. 242 (constructed in 1993) and adjacent storage buildings at Fort McCoy, a U.S. Army Reserve installation.  While it is located within the boundaries of Fort McCoy, it is nevertheless a separate function belonging to the Wisconsin Army"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 10202,
      "SummaryText": "Clean Air Act Risk Management Plan -  Level 1\nFor\nWisconsin Army National Guard\nMobilization and Training Equipment Site -  Propane Storage\n\n21 May 1999\n\n\nIn 1996 the Environmental Protection Agency (EPA) established a new rule under the Clean Air Act (CAA) titled Chemical Accident Prevention Provisions (Part 68 of Title 40 of the Code of Federal Regulations (CFR), or Section 112(r) to the CAA).  This rule applies to a wide variety of facilities that manufacture, store, or use toxic and flammable substances, including propane.  Facilities falling under the rule are required to submit to EPA by 21 June 1999 a Risk Management Plan pertaining to the occurrence of the regulated substances onsite.\n\nThe goal of a risk management program is to prevent accidental releases of toxic and flammable substances that can cause serious harm to the public and the environment, and to mitigate the effects of releases that do occur.  The 1990 Amendments to the CAA outline the actions to be taken by facilities (referred to in the law as stationary sources) to prevent and mitigate accidental releases of such chemicals into the atmosphere and reduce their potential impact on the public and the environment.\n\nThis RMP applies to the Wisconsin Army National Guard (WIARNG) Mobilization and Training Equipment Site (MATES), and meets all the requirements of a Program Level 1 RMP. \n\n\n\nCERTIFICATION STATEMENT\n\nBased on the criteria in 40 CFR 68.10, the distance to the specified endpoint for the worst case accidental release scenario for the process of propane storage for building heating purposes is less than the distance to the nearest public receptor.  Within the past five years, the process of storing propane has had no accidental release that caused offsite impacts provided in the risk management program rule (40 CFR 68.10(b)(1)).  No additional measures are necessary to prevent offsite impacts from accidental releases.  In the event of fire, explosion, or a release of a regulated substanc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 10202,
      "SummaryText": "National Guard, with its own restricted area bound by a fence and lockable gates.  The MATES employs approximately 63 full-time maintenance technicians, supervisors, and office staff.\n\nPropane is stored on site as a backup fuel for building heating (natural gas is the primary fuel, obtained from the local pipeline distribution system).  The propane is stored in two 30,000-gallon aboveground storage tanks outside the northwest corner of Building 242.  The heating system consists of the two tanks and associated piping, valves, burners, and other miscellaneous equipment.  See Appendix A for the site plan and photos of the area.\n\n\n\nWorst case release scenario:\nThe worst case release expected is failure of one 30,000-gallon tank when filled to the greatest amount allowed (88% at 60:F), resulting in a vapor cloud explosion.  According to EPA's look-up tables and formulaic guidance in EPA's Offsite Consequence Analysis Guidance, the distance to the overpressure endpoint is 0.4 miles.  See Appendix B for a more detailed discussion of worst case release information and calculation of the endpoint.  \n\nNo public- or environmental receptors (defined in Section 13 of EPA's Offsite Consequence Analysis Guidance) are located within a radius of 0.4 miles from MATES.\n\n\n\nGeneral accidental release prevention program and chemical-specific prevention efforts:\nThis facility complies with EPA's accident prevention rule and all applicable state and local codes and regulations.  The propane system is designed, installed, and maintained in accordance with NFPA-58.  The storage tanks and associated aboveground piping are inspected monthly by the Fort McCoy Fire Department Inspector.  The tanks are located inside a fenced enclosure, making them inaccessible to the general public, and affording only limited accessibility to MATES employes.\n\nThe Gas Curtailment Plan (4 Nov 98) describes procedures for changing the MATES heating-fuel source during times of natural gas service interruption.  The"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 10202,
      "SummaryText": "plan, coordinated with the natural gas company (Northern States Power Company) lists specific steps to take to change the fuel source from the piped natural gas to the propane from the storage tanks.  Seven MATES employes are identified as potential individuals to be recalled during off-duty hours to report to the MATES facility and carry out the procedures.  These individuals are knowledgeable about the valve and piping portion of the propane storage and transfer system.  They may be able to respond to minor leak situations associated with the valves and piping.  During winter months, these individuals conduct a monthly test of the heating system with propane as the fuel.  The test is conducted by opening/closing the appropriate valves to allow the storage tanks to supply propane to the boilers, and running the propane-fueled boilers run for two to four hours.  Tanks, valves, and piping are monitored for leaks, and boilers monitored for proper operation.  Once the test is complete, the fuel supply is switched back to natural gas lines.  During the summer months, the same test is conducted twice (approximately quarterly).\n\nFive-year accident history:\nThe propane tanks were installed in 1993.  There has never been an accident on site involving propane that led to deaths, injuries, property or environmental damage, evacuations, or shelterings in place. \n\nEmergency response program:\nIn the event of an emergency involving propane, MATES policy is to request the Fort McCoy Fire Department respond to the emergency by dialing 911.  This policy has been discussed with the Fire Department and Monroe County Emergency Planning Committee.  The Fire Department inspects the propane storage system monthly.\n\nThe Fire Emergency Instructions are found at Appendix C (orignally published as Appendix D of the MATES Internal SOP, revised 31 Oct 94).  \n\nFor major propane incidents, the Fire Emergency Instructions should be followed with the following exceptions, due to the explosion hazar"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 10202,
      "SummaryText": "d:  \nAfter calling 911 and notifying others in the building:\n\t-  All personnel will evacuate the MATES facility and grounds without delay.\n\t-  Since the potential impact area from an explosion is large (0.4 miles, as calculated in \t   \t    Appendix B), and since evacluation of the area should occur as fast as possible,\n\t    personnel are to find any means available to travel to Building 1122, Rumpel\n\t    Athletic Center.  Personnel should use their personal cars for transportation, and look\n\t    for others in need of \ta ride.\n\t-  No one should remain in the 0.4 mile-radius area of MATES (see Appendix A for\n\t    map showing impact area).\n\t-  Once at the Athletic Center, all individuals are to assemble for roll call and further\n\t    instructions.\n\n\n\nPlanned changes to improve safety:   No facility changes.  Emergency response program to be briefed at annual Shop Superintendent's Meeting."
    }
  ]
}