{
  "FacilityID": 10239,
  "FacilityName": "Chilton Products",
  "FacilityStr1": "300 Breed Street",
  "FacilityStr2": null,
  "FacilityCity": "Chilton",
  "FacilityState": "WI",
  "FacilityZipCode": "53014",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55015",
  "LEPC": "Calumet County",
  "FacilityLatDecDegs": "44.0375",
  "FacilityLongDecDegs": "-88.161111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6426431,
  "ParentCompanyName": "Western Industries, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6095277,
  "Company2DUNS": 0,
  "OperatorName": "Chilton Products",
  "OperatorStr1": "300 Breed Street",
  "OperatorStr2": null,
  "OperatorCity": "Chilton",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53014",
  "OperatorZipCodeExt": null,
  "RMPContact": "Lynn C Rogers",
  "RMPTitle": "Project Engineer",
  "FTE": 500,
  "OtherEPAFacilityID": "53014CHLTN300BR",
  "EPAFacilityID": "100000016831",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-05-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-05-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.4",
  "FRS_Lat": 44.0368,
  "FRS_Long": -88.17115,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 12772,
      "AltID": "Flammable gas",
      "FacilityID": 10239,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 13085,
          "ProcessID": 12772,
          "NAICSCode": "332116",
          "_desc": {
            "NAICS_CODE": "332116",
            "NAICS_DESCRIPTION": "Metal Stamping"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 14586,
          "ProcessID": 12772,
          "ChemicalID": 98,
          "Quantity": 108000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 514586,
          "ProcessID": 12772,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 12773,
      "AltID": "Flammable Gas",
      "FacilityID": 10239,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 13086,
          "ProcessID": 12773,
          "NAICSCode": "332116",
          "_desc": {
            "NAICS_CODE": "332116",
            "NAICS_DESCRIPTION": "Metal Stamping"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 14587,
          "ProcessID": 12773,
          "ChemicalID": 129,
          "Quantity": 25000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 129,
            "ChemicalName": "Propylene  [1-Propene]",
            "CASNumber": "115-07-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 514587,
          "ProcessID": 12773,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 10239,
      "SummaryText": "EXECUTIVE SUMMARY\n\nA. Chilton Products, a division of Western Industries, has instituted an \"Accidental Release Prevention\" policy utilizing an integrated procedural, technological and managerial plan. That plan incorporates the following points:\n\n i. Full incorporation of Process Safety Management principals for the handling and storage of regulated materials\nii.Utilization of a well trained unloading crew or personnel\niii.Utilization of a safe, well maintained unloading facilities\niv. Ongoing Management interest, involvement, oversight and process support\n\nChilton Product's \"Emergency Response\" policy, based on an \"Integrated Contingency Plan\" approach has been compiled.  The \"ICP\" method incorporates various response scenarios.  The specific scenarios detail appropriate response activities and agency or service contacts that may or are required during incident responses and subsequent follow up actions.  The \"ICP\" also designates a command and control structure for ensuring clear communications between responding personnel and local, state or federal agencies.  Implementation of all applicable procedures (or suggested practices) of the Environmental Protection Agency's Risk Management Program, (RMP), has been included, ensuring complete regulatory compliance.\n\nB. Chilton Products manufactures small, (@ 14 oz.) flammable-gas filled, steel canisters.  The canisters are normally utilized as MAPP, Propylene or Propane gas-operated, homeowner torches.  Bulk delivery, of the gases, occurs by either commercial truck or tanker rail car(s).  The gases are transferred to bulk storage (a tank farm) prior to the manufacturing bottle filling process.  Packaged bulk storage (after bottling, before shipping) occurs within an on-site warehouse.  Typically, the total amount of any one gas on-site is between 25000 to 500000 lbs.  \n\nC. The Offsite Consequence Analysis includes consideration of both a \"Worst Case\" release and an \"Alternative\" release scenario for all regulated mater"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10239,
      "SummaryText": "ials.  The \"Worst Case\" release scenario has been defined by the EPA as \"the owner or operator shall assume that the maximum quantity of product, from the largest storage vessel, is released in its \"normal\" state over a 10 minute period.  In the case of liquefied gases, the \"normal\" state would be primarily a vapor state.  The \"Alternative\" release scenario has been defined as \"the case more likely to occur than a \"Worst Case\" scenario.\n\nLiquefied Petroleum Gas\n\nThe \"Worst Case\" scenario would entail the rupture of a Storage Tank suddenly releasing    approximately 108000 pounds of PROPANE gas.  By company specified, operational policy, this amount represents 85% of the storage tanks capacity.  The release will be assumed to occur over 10 minutes.\n\nUsing a Vapor Cloud explosion model, OCA Section 5.1, the Endpoint distance, the distance required to reach the specified 1 PSI Overpressure limit, may be found by either utilizing the EPA OCA Reference Tables or by direct calculation employing Equation C-1.\n\nThe estimated endpoint distance using OCA Reference Table 9 is 0.38 miles\nThe calculated endpoint for a vapor cloud explosion, utilizing Equation C-1 is 0.38 miles*.\n\nThe \"Alternative Case\" scenario would be the rupture or breakage of an unloading hose or transfer pipeline releasing less than 100 pounds of PROPANE gas.  Certified Piping and Tank    installations, utilizing Excess Flow, Spring-Loaded Emergency Shutoff, Check and Globe valves would limit any gas release to the contents of the unloading hose or transfer pipelines.  Again any release would be limited to a maximum 10 minute duration.\n\nFor the \"Alternative Case\" scenario, the Endpoint LFL distance (the distance to which radiant heat effects of a Vapor Cloud fire would have serious consequences) may be derived utilizing for guidance, OCA Section 12.1.  Section 12.1 discusses the impact distance resulting from Vapor Cloud detonation issuing from an evaporating pool of flammable liquid.\n\nUsing OCA Table 21, the res"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 10239,
      "SummaryText": "ulting estimated Vapor Cloud detonation Endpoint distance is <0.06 Mi.\n\nD. The Chilton Products accidental release prevention program is based on the following parameters:\n\nX Full compliance with the OSHA mandated PSM rule\n\nX Use of clear, appropriate and accurate operating procedures\n\nX Use of well trained and conscientious operators\n\nX Use of well maintained and properly equipped facilities\n\nX Ongoing Hazard Reviews of equipment and/or processes\n\nX Full Management involvement and oversight\n\nE. Chilton Products has experienced no accidental, regulated material releases in the past five years.\n\nF. Chilton Products has implemented and distributed an Integrated Contingency Plan, which has been coordinated with the City of Chilton Fire and Police Departments, the Local Emergency Response Planning Committee (LEPC) and the Calumet Medical Center."
    }
  ]
}