{
  "FacilityID": 10288,
  "FacilityName": "Power Systems Development Facility",
  "FacilityStr1": "Highway 25 North",
  "FacilityStr2": null,
  "FacilityCity": "Wilsonville",
  "FacilityState": "AL",
  "FacilityZipCode": "35186",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01117",
  "LEPC": "Shelby County LEPC",
  "FacilityLatDecDegs": "33.243333",
  "FacilityLongDecDegs": "-86.469722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Southern Company",
  "Company2Name": null,
  "CompanyDUNS": 6925341,
  "Company2DUNS": null,
  "OperatorName": "Southern Company Services",
  "OperatorStr1": "P.O. Box 1069",
  "OperatorStr2": null,
  "OperatorCity": "Wilsonville",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35186",
  "OperatorZipCodeExt": null,
  "FTE": 140,
  "OtherEPAFacilityID": "ALR000000216",
  "EPAFacilityID": "100000020648",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "411-0023",
  "SafetyInspectionDate": "1998-10-29 00:00:00",
  "SafetyInspectionBy": "Alabama LPG Board",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-04 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2001-09-25 00:00:00",
  "DeRegistrationEffectiveDate": "2001-09-21 00:00:00",
  "AnniversaryDate": "2004-06-04 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.4",
  "FRS_Lat": 33.243401,
  "FRS_Long": -86.469803,
  "FRS_Description": "AIR RELEASE STACK",
  "FRS_Method": "UNKNOWN",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 12835,
      "AltID": "Propane Storage",
      "FacilityID": 10288,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 14658,
          "ProcessID": 12835,
          "ChemicalID": 98,
          "Quantity": 330000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 13148,
          "ProcessID": 12835,
          "NAICSCode": "54171",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 6123,
              "Process_NAICS_ID": 13148,
              "SafetyReviewDate": "1999-04-14 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "NPGA Safety Bulletin #106-83",
              "FR_Comments": "Facility constructed in 1995 per NFPA 58-1992",
              "HazardReviewDate": "1999-04-14 00:00:00",
              "ChangeCompletionDate": "1999-06-30 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-09-09 00:00:00",
              "TrainingReviewDate": "1999-05-05 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Written notice of changes are posted and signed by operators.",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-03 00:00:00",
              "EquipmentInspectionDate": "1998-10-29 00:00:00",
              "EquipmentTested": "Annual inspection by AL LPG Board inspector Barnie Gilliland was done on 10/29/98. Propane pump vibration is checked periodically with last check on 5/11/98. Vaporizer relief valve tested on 10/13/97.",
              "ComplianceAuditDate": "1998-10-29 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-04-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 6345,
                  "PreventionProgram2ID": 6123,
                  "ProcessChemicalID": 14658
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 10288,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-11-20 00:00:00",
    "ERTrainingDate": "1999-05-21 00:00:00",
    "CoordinatingAgencyName": "Wilsonville Volunteer Fire Dept.",
    "CoordinatingAgencyPhone": "2056697190",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Clean Air Act"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 10288,
      "SummaryText": "The following summary addresses six (6) key elements of the Risk Management Plan for the propane storage facility at the Power Systems Development Facility (PSDF). This plan complies with Program 2 requirements as specified in the United States Environmental Protection Agency's (USEPA) Accidental Release Prevention Provisions (40 CFR 68.170).\n\n1. Accidental Release Prevention and Emergency Response Policies\nThe primary function of the PSDF is to develop new electric power producing processes using coal as the primary fuel. Southern Company Services (SCS) operates the facility under a cooperative agreement with the Department of Energy (DOE) Fossil Energy Technology Center (FETC). The facility is staffed with SCS engineers and experienced Alabama Power Company (APCO) operators and mechanics.\n\nThe propane storage facility is new, constructed in 1995 in accordance with Alabama Liquefied Petroleum Gas Board regulations. State inspectors visit the PSDF annually to inspect the facility and observe operations. The facility design complies with rules recommended by the National Fire Protection Association (NFPA) and the National Propane Gas Association (NPGA).   \n\nThe PSDF propane storage facility has no history of major releases capable of impacting neighboring residences. If a release does occur, PSDF personnel are trained in incipient-level fire fighting and use of the facility's fire protection system. The PSDF's fire protection system is substantial and includes:\n \n7 One (1) 235,000 gallon firewater storage tank\n7 Two (2) 1500 GPM diesel powered firewater pumps with automatic start at 80 and 100 psig firewater pressure\n7 One (1) 30 GPM jockey pump maintaining 110 psig supply pressure\n7 An 8 underground distribution loop\n7 Eight (8)  hydrant-mounted deluge monitors\n7 A standpipe with 1 = pre-connected hand-lines on each floor of a 10-story structure\n7 Six (6) outdoor hose cabinets equipped with 1 = hose, fog nozzles, tools, and appliances\n\nThe PSDF is located in Shel"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10288,
      "SummaryText": "by County within the coverage area of the Wilsonville Volunteer Fire Department. This department has demonstrated ability to provide additional manpower and apparatus if needed for fire control, hazard zone isolation, and community evacuation. \n\n2. The Stationary Source and the Regulated Substances Handled\nPropane is delivered by truck and is stored in three (3) storage tanks containing 110,000 pounds each giving the PSDF a total storage inventory of 330,000 pounds. A distribution system, consisting of a vaporizer and electric-traced piping, supplies superheated propane gas to PSDF process equipment such as air heaters, flares, and thermal oxidizers. Access to the PSDF is restricted to facility employees, SCS management personnel and approved contractors. \n\n3. The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), Including Administrative Controls and Mitigation Measures to Limit the Distances for Each Reported Scenario\nBased on storage quantity and proximity of neighboring homes, a Program 2 Risk Management Plan (RMP) is required for the PSDF propane storage facility. A Program 3 plan is not required since the site is not subject to regulation under 29 CFR 1910.119 Process Safety Management program. \n\nAs required in 49 CFR 68.25, the effect of an unconfined vapor cloud explosion (VCE) was considered. The total site inventory of 330,000 lb was used to determine the size of the VCE because the storage tanks are coupled together by a common header. The estimated distance to the USEPA's specified endpoint (1- psi overpressure) for this quantity exceeds the distance to the nearest residence (0.32 miles).\nThe TNT equivalence method described in the USEPA's RMP Offsite Consequence Analysis Guidance predicts a 0.56 mile distance to endpoint. The distance to endpoint is reduced to 0.48 miles if the VCE is sufficiently elevated to permit blast dissipation in all directions. \n\nAs required by 49 CFR 68.28, the effect of an alternative scenario was also est"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 10288,
      "SummaryText": "to work independently. Training is done annually to insure readiness for incipient fire attack and awareness of the hazards related to propane.\n\ne.) Maintenance\nPropane is the primary auxiliary fuel at the PSDF and is required for plant start-up and operation. The PSDF propane storage facility is new and well maintained. State inspectors complete an annual review of the facility condition and operation to verify compliance with state LPG regulations. A checklist review of the facility has been completed as well to measure compliance with NPGA guidelines as described on page 77 of EPA 550-B-98-011. This review is documented and will be updated every three years.\n\nf.) Compliance Audits\nPower System Development Facility will conduct audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.  \n\ng.) Incident Investigation\nPower System Development Facility promptly investigates any incident that has resulted in, or could reasonably result in, an OSHA recordable injury. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from recurring.  All reports are retained for a minimum of 5 years.\n\n5. Five-year Accident History\nTo date, no releases of propane at the PSDF have caused injury, property damage, environmental damage, sheltering in place, or evacuations.\n\n6. Emergency Response Plan\nPower System Development Facility has a written emergency response plan to deal with accidental releases of propane.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, and notification of local emergency response agencies. To ensure readiness, the PSDF incipient fire brigade conducts annual on-site fire training. Fire protection eq"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 10288,
      "SummaryText": "uipment is regularly inspected and serviced. \n\nThe PSDF emergency response plan is coordinated with the Shelby County Emergency Management Agency's (EMA) Emergency Operation Plan (EOP). Fire departments from local communities responded in the recent past to a large fire at the Alabama Power plant just south of the PSDF."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 10288,
      "SummaryText": "imated. A 10-minute propane vapor release from a broken unloading hose could cause second degree burns on unprotected personnel up to 200 feet away from the center of the fireball according to estimating methods recommended by the USEPA (Quantitative Evaluation of Fireball Hazards, Process Safety Progress, Vol.13, No. 2).\n\n4. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nThe propane release prevention plan is composed of the seven elements required by 40 CFR 68.48-60. \n\na.) Safety Information\nThe PSDF maintains a detailed record of written process safety information describing the chemical hazards, operating parameters and equipment designs as specified on the Process Safety Information Worksheet: Propane Storage, page 56 of EPA 550-B-98-011. This detailed record will be updated every three years.\n\nb.) Hazard Review\nThe PSDF propane storage facility is currently in a safe operating condition based on review of NFPA Standard 58, 1995 Edition. This review is documented and will be updated every three years.\n\nA design hazard review is done for all changes to the PSDF propane storage facility. Any findings related to the hazard reviews are addressed in a safe and timely manner. \n\nc.) Operating Procedures\nFor the purposes of safely conducting activities within our processes, Power System Development Facility maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  Procedures are updated as changes are made and are readily accessible to operators involved with the processes.\n\nd.) Training\nPower System Development Facility has an active training program in place to establish and maintain operator competency.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent"
    }
  ]
}