{
  "FacilityID": 10311,
  "FacilityName": "CONDEA Vista Company",
  "FacilityStr1": "HWY 25S",
  "FacilityStr2": null,
  "FacilityCity": "Aberdeen",
  "FacilityState": "MS",
  "FacilityZipCode": "39730",
  "Facility4DigitZipExt": "3403",
  "FacilityCountyFIPS": "28095",
  "LEPC": "Monroe County LEPC",
  "FacilityLatDecDegs": "33.8125",
  "FacilityLongDecDegs": "-88.558333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 115270624,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "CONDEA Vista Company",
  "OperatorStr1": "P.O. Box 91",
  "OperatorStr2": null,
  "OperatorCity": "Aberdeen",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39730",
  "OperatorZipCodeExt": "3403",
  "RMPContact": "Kenneth G. Akins",
  "RMPTitle": "Environmental Coordinator",
  "FTE": 220,
  "OtherEPAFacilityID": "MS0001970",
  "EPAFacilityID": "100000022067",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "1840-00014",
  "SafetyInspectionDate": "1996-04-15 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.4",
  "FRS_Lat": 33.8125,
  "FRS_Long": -88.55417,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 12874,
      "AltID": "PVC Polymerization",
      "FacilityID": 10311,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 13190,
          "ProcessID": 12874,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 14728,
          "ProcessID": 12874,
          "ChemicalID": 101,
          "Quantity": 6000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 101,
            "ChemicalName": "Vinyl chloride  [Ethene, chloro-]",
            "CASNumber": "75-01-4",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 514728,
          "ProcessID": 12874,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 12875,
      "AltID": "Plant Utilities",
      "FacilityID": 10311,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 13191,
          "ProcessID": 12875,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 14729,
          "ProcessID": 12875,
          "ChemicalID": 98,
          "Quantity": 1500000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 514729,
          "ProcessID": 12875,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 10311,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\nCONDEA Vista Companys Aberdeen PVC plant has a long history of safe operation in the Aberdeen community.  Our employees work hard every hour, every day to provide a safe workplace for themselves while protecting the environment inside and outside our fences.  \n\nPLANT INFORMATION\nThe Aberdeen plant produces polyvinyl chloride (PVC or vinyl) resins and compounds.  These materials are used by our customers to produce wire and cable insulation, vinyl siding, pipe and packaging to name a few.  We produce the resins and compounds by polymerizing vinyl chloride monomer (VCM).   After the polymerization, the resin is dried and stored for shipping.  Most of the VCM we consume comes from CONDEA Vista Companys operations in Lake Charles, Louisiana by rail.  The VCM is a gas at normal conditions, but is kept under pressure and handled as a liquid much the way propane gas is handled.  At certain concentrations, the VCM is flammable and we have many safety systems in place to deal with this hazard.\n\nWORST-CASE SCENARIO\nIn calculating the worst-case scenario, the Environmental Protection Agency (EPA), requires the following assumptions be made:\nCatastrophic (complete) failure of the largest storage vessel\nComplete loss of the contents of the vessel and vaporization of the liquid in ten minutes\nMixing of sufficient air with the vapors to generate an explosion with a 10 per cent yield-the worst seen for mixtures of flammable vapors with air\nNone of the plants procedures or emergency systems work\nIgnition of the vapor cloud as soon as all the material vaporizes\n\nThe impact from these worst-case events decreases as you move away from the facility.  It is important to understand the standard measure of impact for determining the impacted zones.  These limits are developed by the EPA and are used in the alternate case scenarios as well.  For flammable releases, the company is required to define the impacted areas within which one could see a shock wave of 1 "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10311,
      "SummaryText": "pound per square inch (psi) overpressure.  A 1 psi overpressure can cause damage such as shattering of windows and partial demolition of houses.\n\nThe possibility of a worst-case scenario happening is extremely remote and is of limited value for planning purposes.  This scenario defines the largest possible impacted zone.\n\nVCM is unloaded from railcars and is stored in a spherical tank.  The capacity of this vessel is 6 million pounds of VCM.  If the vessel was completely full, ruptures, none of our safety systems worked, it was a hot day and all the liquid vaporized in ten minutes, the wind mixed in just enough air without dispersing the vapor cloud, just then a spark set off an explosion and the maximum explosive yield was generated, the off-site area impacted would include the area in a 1.1 mile circle around this vessel.\n\nALTERNATE RELEASE SCENARIO\nOther release scenarios are also required to be considered.  These alternate-case scenarios generally involve smaller releases and safety systems can be considered in determining the extent of the impact.  For the Aberdeen Plants alternate-case, it was assumed that 8-inch piping was broken from a vinyl chloride storage vessel in the production unit releasing 486,000 of vinyl chloride in 12 minutes.  It is assumed that the plants gas detection system detects the release and sets off the plants firewater system.  This will knock-down half the vapor.  For this scenario, impact is limited to a 0.2 mile circle around the vessel with no off-site impact.\n\nCONDEA Vista Companys Aberdeen plant is proud of the fact that we have never experienced any release resulting in damage to our neighbors.  With our safety systems and employees working every hour, every day to prevent chemical accidents, we are confident of extending this record of safe operation.\n\nACCIDENT PREVENTION\nAccident prevention is a large part of everyones job at the Aberdeen Plant.  We work hard to make sure that our systems, procedures and people ar"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 10311,
      "SummaryText": "e all working together to prevent accidents from occurring.  To ensure safe operations of our plant, we have many systems in place including:\n\n\nEngineering\nStationary air monitors\nIncinerators for combusting vapors\nRelief valves for excess pressure\nEmergency shut down procedures\nDistributive control systems\nStructural fireproofing\nBack-up power supply\nAutomatic water spray systems\nTank containment systems\n\n\n\nOperations\nQualified personnel\nDetailed training courses\nThorough operating procedures\n24-hour instrument monitoring\nAll changes or work on equipment includes a complete review\nRoutine audits ensure safe work\nRegular inspections of equipment\nIncident reporting and investigations\n\n\n\n\nMaintenance\nPreventative and predictive maintenance programs\nVibration monitoring\nInfrared thermography\nCorrosion monitoring programs\nDetailed permitting procedures\nStationary vapor detection\nSafe work procedures\nQuality assurance/control\n\n\nACCIDENT HISTORY\nThe Aberdeen Plant is proud of the fact that we have not had any incidents in the past five years that require reporting under the EPAs Risk Management Plan.  \n\nEMERGENCY RESPONSE\nAt CONDEA Vista, we want to be able to respond to any situation.  To accomplish this goal, our emergency preparedness efforts focus on four areas:\n\nPersonnel-The most important part of any response plan is well trained, qualified people.  At CONDEA Vista, we have a voluntary Emergency Response Team (ERT).  The team is made up of employees from various departments within the plant.  They train regularly at Texas A&Ms school for firefighters and the Mississippi State Fire Academy.  On-site drills are conducted to test and refine response plans.  The ERT members have specialized training in hazardous materials, confined-space rescue and medical training.\n\nResources-The proper equipment is a necessary requirement for any job.  In the field of emergency response, it is necessary that equipment, materials and labor be available immediately as needed.  CONDEA"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 10311,
      "SummaryText": " Vistas Aberdeen facility is equipped with state-of-the-art equipment.  The equipment includes chemical transportation response equipment, automatically activated fire water systems, movable fire water monitors, firefighting gear, fire extinguishers and other necessary equipment.\n\nAlthough we dont expect it to happen, CONDEA Vista Company has provided sirens to alert the community to off-site emergencies.  These sirens are located in the community and are controlled by the Aberdeen Police Department.  The community may use them in case of severe weather, chemical accidents or any situation requiring action.\n\nPlanning-Complete plans are a must to help guide people and resources in the event of an emergency.  CONDEA Vista has plans in place to handle on-site and off-site incidents.  Our plans have been developed in coordination with the Local Emergency Planning Commission.\n\nAlliances-To provide for additional resources in the event of a major incident, the Aberdeen plant has agreements with the Aberdeen Fire Department and local emergency medical responders to provide additional resources if requested.  These potential responders are given tours of the plant and are familiarized with processes at the plant in the event they are called on to provide assistance."
    }
  ]
}