{
  "FacilityID": 10491,
  "FacilityName": "Bath Petroleum Storage Inc.",
  "FacilityStr1": "7535 Eagle Valley Road",
  "FacilityStr2": null,
  "FacilityCity": "Savona",
  "FacilityState": "NY",
  "FacilityZipCode": "14879",
  "Facility4DigitZipExt": "9784",
  "FacilityCountyFIPS": "36101",
  "LEPC": "Steuben County LEPC",
  "FacilityLatDecDegs": "42.308889",
  "FacilityLongDecDegs": "-77.255833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 107672172,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Bath Petroleum Storage Inc.",
  "OperatorStr1": "P.O. Box 708",
  "OperatorStr2": null,
  "OperatorCity": "Bath",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14810",
  "OperatorZipCodeExt": "0708",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000045523",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-08-31 00:00:00",
  "SafetyInspectionBy": "US DOT Federal Railway Administration",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": "RMP for Bath Petroleum Storage Inc.",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP Pro 98",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 42.30761,
  "FRS_Long": -77.25514,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 13299,
      "AltID": "LPG Storage Facility",
      "FacilityID": 10491,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 15403,
          "ProcessID": 13299,
          "ChemicalID": 98,
          "Quantity": 23488374.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 15404,
          "ProcessID": 13299,
          "ChemicalID": 118,
          "Quantity": 246967672.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 13623,
          "ProcessID": 13299,
          "NAICSCode": "42271",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 6242,
              "Process_NAICS_ID": 13623,
              "SafetyReviewDate": "1999-06-11 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "API , NFPA , NPGA  and NSC Recommended Practices",
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-11 00:00:00",
              "ChangeCompletionDate": "1999-06-30 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "4000 GPM Fire Water Supply Well",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "High Pressure, Low Pressure, Flow Rate and Fire Sensing Shut Down",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-11 00:00:00",
              "TrainingReviewDate": "1999-02-17 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Computer Based Training",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-09 00:00:00",
              "EquipmentInspectionDate": "1999-06-09 00:00:00",
              "EquipmentTested": "Fire Protection, Product Handling, Well Monitoring , , Alarm System, Remote Shut-down , Rail and Truck Loading, Valves, Pumps and Compressors, Vehicles",
              "ComplianceAuditDate": "1999-05-26 00:00:00",
              "AuditCompletionDate": "1999-06-30 00:00:00",
              "IncidentInvestigationDate": "1999-03-31 00:00:00",
              "InvestigationChangeDate": "1999-04-09 00:00:00",
              "MostRecentChangeDate": "1999-04-09 00:00:00",
              "CBI_Flag": 0,
              "Description": "LPG Storage Facility; BPSI Accident Prevention Program",
              "_chemicals": [
                {
                  "PrimaryKey": 6485,
                  "PreventionProgram2ID": 6242,
                  "ProcessChemicalID": 15403
                },
                {
                  "PrimaryKey": 6486,
                  "PreventionProgram2ID": 6242,
                  "ProcessChemicalID": 15404
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 10491,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-06-11 00:00:00",
    "ERTrainingDate": "1999-02-17 00:00:00",
    "CoordinatingAgencyName": "Bath Volunteer Fire Department",
    "CoordinatingAgencyPhone": "6077762222",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 10491,
      "SummaryText": "BATH PETROLEUM STORAGE INC.\nP.O. BOX 708 \nBATH, NEW YORK 14810\n\n(607)776-4201\nFAX (607) 776-6610\n\nJUNE 15, 1999\n\n\n\nGeneral Executive Summary for Chemical, Manufacturing and Oil Refining Facilities\n\n1.    Accidental Release Prevention and Emergency Response Policies\nWe at Bath Petroleum Storage Inc. are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n2.    The Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities encompass a Bulk terminal for rail and truck transportation and storage of LPG (Flammable Gas - UN1075).  We have 2 regulated substances present at our facility.  These substances include Butane and Propane.  Butane is delivered to customers (refiners) for Gasoline Blend Stock.  Propane is delivered to customers (wholesalers) for heating fuel..\n\nThe maximum inventory of Butane that is expected to be present in this facility based on customers' process/operational  requirements is 246967672.00 lb. while Propane is expected to be present at our facility in a maximum quantity of 23488374.00 lb..\n\n3.    The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), are evaluated including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\nTo perform the required offsite consequence analysis for our facility, we have used the EPA's OCA Guidance Reference Tables or Equations.  The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for Program 2  flammable substances as a class involves a catastrophic release from a LPG Storage Facility butane storage tank.  In t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10491,
      "SummaryText": "his scenario 130140 lb. of Butane is released.  The release quantity has been limited to 90% of the maximum water capacity of the source by a system of administrative controls that comply with NFPA 58 requirements.  It is assumed that the entire quantity is released as a vapor, which finds an ignition source, with 10 percent of the released quantity participating in a vapor cloud explosion.  Under worst case weather conditions, the calculated distance of 0.41 miles is obtained corresponding to an endpoint of 1 psi overpressure.\n\nBath Petroleum Storage has evaluated four alternate release scenarios. These scenarios evaluate release scenarios from storage caverns using maximum possible release quantities while the facility is operating or not operating. \n\nOne alternative release scenario submitted for Program 2  flammable substances involves a release of propane gas from No. 4 Storage Cavern at the maximum possible release rate.  The release is assumed to result in a Vapor Cloud Explosion.  The scenario involves the release of 263315.13 lb. of Propane in 480 minutes.  Passive mitigation controls such as the topographic features which would mitigate movement of heavier than air vapor toward populated areas were not considered in this evaluation. The active mitigation measures that include automatic facility shut down and the use of a 4000 gpm fire water system would further mitigate the effect of this release.  Under neutral weather conditions, the maximum distance to the flammable endpoint of 1 psi overpressure is 0.32 miles.\n\nAnother alternative release scenario submitted for Program 2 flammable substances involves a release of Butane gas  from No. 7 Storage Cavern at the maximum possible release rate.  The release is assumed to result in a Vapor Cloud Explosion.  The scenario involves the release of 82841.72 lb. of Butane in 480 minutes.  Passive mitigation controls such as the topographic features which would mitigate the movement of heavier than air vapor toward p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 10491,
      "SummaryText": "opulated areas were not considered in this evaluation. The active mitigation measures that include automatic shut-down  and the use of a 4000 GPM fire water system would further mitigate the effect of this release. Under neutral weather conditions, the maximum distance to the flammable endpoint of 1 psi overpressure is 0.16 miles.\n\nAnother alternative release scenario submitted for Program 2 flammable substances involves a maximum possible release of Butane liquid from No. 7 Storage Cavern. The rapid vaporization of the release is assumed to result in a Vapor Cloud Explosion.  The scenario involves the release of 15048 lb. of Butane in 1 minute. This is the release that would occur with sudden failure of No. 7 well.  Passive mitigation controls such as the topographic features that would mitigate the movement of heavier than air vapor toward populated areas  are not taken into account to calculate the scenario.  The release is also controlled by active mitigation measures that include automatic shut down. Under neutral weather conditions, the maximum distance to the flammable endpoint of 1 psi overpressure is 0.09 miles.\n\nAnother alternative release scenario submitted for Program 2  flammable substances involves a maximum possible release of propane liquid from No. 4 Cavern.  The release is assumed to result in the rapid vaporization of the propane and a Vapor Cloud Explosion.  The scenario involves the release of 6430 lb. of Propane in 1 minute.  Passive mitigation controls such as the topographic features that would mitigate the movement of the heavier than air vapor toward populated areas are not taken into account to calculate the scenario.  The release is also controlled by active mitigation measures that include automatic shut down.  Under neutral weather conditions, the maximum distance to the flammable endpoint of 1 psi overpressure is 0.09 miles.\n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility h"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 10491,
      "SummaryText": "as taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition and has been kept in compliance throught the 1995 Edition.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\n\nBath Petroleum Storage Inc. maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is What If/Check List.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of two years.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA/update was performed on 06/11/1999.\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our covered processes, Bath Petroleum Storage Inc. maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\n\nBath Petroleum Storage Inc. has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every two years and more frequently as needed.\n\nMechanical Integrity\n\nBath Petr"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 10491,
      "SummaryText": "oleum Storage Inc. carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; storage caverns, pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, pumps and compressors.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\n\nWritten procedures are in place at Bath Petroleum Storage Inc. to manage changes in process chemicals, technology, equipment and procedures.  The most recent review/revision of maintenance procedures was performed on 06/11/1999.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Bath Petroleum Storage Inc..  The most recent review was performed on March 9, 1999.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\n\nBath Petroleum Storage Inc. conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The most recent comliance audit was conducted on 05/26/1999.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\n\nBath Petroleum Storage Inc. promptly investigates any incident th"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 10491,
      "SummaryText": "at has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\n\nBath Petroleum Storage Inc. truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Bath Petroleum Storage Inc. has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n5.    Five-year Accident History\n\nBath Petroleum Storage Inc. has had an excellent record of preventing accidental releases from covered processes over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period. \n\n\n6.    Emergency Response Plan\n\nBath Petroleum Storage Inc. carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident inspectiuons of affected areas.\n\nTo ensure "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 10491,
      "SummaryText": "proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nSteuben County LEPC is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n7.    Planned Changes to Improve Safety\n\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program. A major installation of state of the art equipment to prevent the accidental release of flammable gas  was made in 1984. The continued maintenance and testing of this equipment and all other safety systems are some of the major steps we want to take to improve safety at our facility.  All maintenance and changes are expected to be implemented by December 31, 1999."
    }
  ]
}