{
  "FacilityID": 10554,
  "FacilityName": "Chapel Hill Gas Processing Plant",
  "FacilityStr1": "4426 F.M. 757",
  "FacilityStr2": null,
  "FacilityCity": "Winona",
  "FacilityState": "TX",
  "FacilityZipCode": "75792",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48423",
  "LEPC": "Smith County LEPC",
  "FacilityLatDecDegs": "32.384639",
  "FacilityLongDecDegs": "-95.109361",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 31076073,
  "ParentCompanyName": "Mustang Fuel Corporation",
  "Company2Name": null,
  "CompanyDUNS": 152025045,
  "Company2DUNS": null,
  "OperatorName": "Mustang Fuel Corporation",
  "OperatorStr1": "2000 N. Classen Blvd-800E",
  "OperatorStr2": null,
  "OperatorCity": "Oklahoma City",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "73106",
  "OperatorZipCodeExt": "6036",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000050696",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2024-07-08 00:00:00",
  "DeRegistrationEffectiveDate": "2024-07-08 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 32.36598,
  "FRS_Long": -95.11055,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-BLOCK FACE",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 13409,
      "AltID": "Natural Gas Liquid Extrac",
      "FacilityID": 10554,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 15806,
          "ProcessID": 13409,
          "ChemicalID": 98,
          "Quantity": 560000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 15807,
          "ProcessID": 13409,
          "ChemicalID": 118,
          "Quantity": 252000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 15808,
          "ProcessID": 13409,
          "ChemicalID": 107,
          "Quantity": 167000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 15809,
          "ProcessID": 13409,
          "ChemicalID": 125,
          "Quantity": 54000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 15810,
          "ProcessID": 13409,
          "ChemicalID": 115,
          "Quantity": 52000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 15811,
          "ProcessID": 13409,
          "ChemicalID": 94,
          "Quantity": 34000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 13734,
          "ProcessID": 13409,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 6428,
              "Process_NAICS_ID": 13734,
              "SafetyReviewDate": "1999-04-30 00:00:00",
              "PHA_Date": "1998-02-17 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-04-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-11-15 00:00:00",
              "TrainingReviewDate": "1999-05-13 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-11-15 00:00:00",
              "EquipmentInspectionDate": "1999-05-13 00:00:00",
              "EquipmentTested": "Compressors",
              "ChangeMgmtDate": "1998-02-15 00:00:00",
              "ChangeMgmtReviewDate": "1998-11-15 00:00:00",
              "PreStartupReviewDate": "1998-03-01 00:00:00",
              "ComplianceAuditDate": "1999-05-20 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-11-15 00:00:00",
              "HotWorkPermitReviewDate": "1998-11-15 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-15 00:00:00",
              "ContractorSafetyEvalDate": "1998-11-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 8254,
                  "PreventionProgram3ID": 6428,
                  "ProcessChemicalID": 15806
                },
                {
                  "PrimaryKey": 8255,
                  "PreventionProgram3ID": 6428,
                  "ProcessChemicalID": 15807
                },
                {
                  "PrimaryKey": 8256,
                  "PreventionProgram3ID": 6428,
                  "ProcessChemicalID": 15808
                },
                {
                  "PrimaryKey": 8257,
                  "PreventionProgram3ID": 6428,
                  "ProcessChemicalID": 15809
                },
                {
                  "PrimaryKey": 8258,
                  "PreventionProgram3ID": 6428,
                  "ProcessChemicalID": 15810
                },
                {
                  "PrimaryKey": 8259,
                  "PreventionProgram3ID": 6428,
                  "ProcessChemicalID": 15811
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 10554,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-16 00:00:00",
    "ERTrainingDate": "1999-04-30 00:00:00",
    "CoordinatingAgencyName": "Jackson Community Vol. F Department",
    "CoordinatingAgencyPhone": "9035663250",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 10554,
      "SummaryText": "Chapel Hill Gas Processing Plant\nRisk Management Plan\n\nExecutive Summary\n\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\n\tThe Chapel Hill Gas Processing Plant management and employees are committed to both worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as personnel training and safety considerations in the design, installation, operation, and maintenance of plant processes.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances; however, if a release does occur, trained gas plant personnel will respond to control and contain the release.\n\n\nDESCRIPTION OF STATIONARY SOURCE AND REGULATED SUBSTANCES\n\n\tThe Chapel Hill Gas Processing Plant is located in Smith County, Texas, near the town of Winona.  This facility is one mile north of Texas Highway 31 along FM 757.  The Chapel Hill Plant operates a variety of processes to produce petroleum products (e.g. natural gas, propane, butane, gasoline, condensate) from natural gas.  The Chapel Hill Plant processes several regulated flammables such as propane and butane.\n\n\nOFFSITE CONSEQUENCE ANALYSIS RESULTS\n\n\tThe Chapel Hill Plant cryogenically processes sweet natural gas to recover hydrocarbon liquids and deliver pipeline quality natural gas.  In this process, there are no substances requiring the analysis of either a worst-case scenario or an alternative-release scenario for toxics.\n\n\tThe worst-case scenario associated with the release of flammable substances in the Program Level 3 process at the Gas Plant is a vapor cloud explosion involving the full inventory of the largest storage tank containing butane.  The full inventory is assumed to release and ignite, resulting in a vapor cloud explosion.  The maximum distance to 1-psi overpressure for the worst-case scenario is 0.51 mile.  Although we have many controls to prevent such releases and to manage their consequences, no credit for passive mitigation mea"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10554,
      "SummaryText": "sures was taken into account in evaluating this worst-case scenario.\n\n\tThe alternative-release scenario for flammable substances at the gas plant is a vapor cloud explosion resulting from the release of propane from storage tank piping (26,000 lb released in 15 minutes).  The release is expected to be isolated by the operators within 15 minutes (active mitigation).  The maximum distance to the 1-psi endpoint for this event is 0.16 mi.  This event was selected as being a reasonable and practical scenario for use in emergency planning and response.  Figure 1 graphically presents hazard assessment results for both the worst-case scenario and the alternative-release scenario.\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\n\tThe following is a summary of the accident prevention program at the plant.  Because processes at the plant that are regulated by the Environmental Protection Agency under the risk management program regulation are also subject to the Occupational Safety and Health Administration process safety management standard, this summary addresses each of the process safety management elements and describes the management system in place to implement the accident prevention program.\n\nEmployee Participation\n\n\tAt the Chapel Hill Plant, all employees are encouraged to participate in all facets of process safety management and accident prevention.  Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a process hazard analysis team.  Employees have access to all information created as part of the plant accident prevention program.  Specific ways that employees are involved in the accident prevention program are documented in the employee participation plan maintained at the plant.  This plan also addresses each accident prevention program element.  In addition, the plant has continuing initiatives to address process safety and employee safety issues.  These initiatives inc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 10554,
      "SummaryText": "lude regular safety meetings and the formation of teams to promote both process and personnel safety.  These teams and meetings include participation by all plant employees.\n\nProcess Safety Information\n\n\tThe Chapel Hill Plant keeps a variety of technical documents that are used to help maintain safe process operations.  These documents include information on process technology, process equipment, and hazards associated with chemicals used and produced in the process.  Plant personnel maintain up-to-date process safety information.  All of this process safety information is readily available to plant employees as detailed in the written employee participation plan.\n\n\tChemical-specific information, including exposure hazards and emergency response/exposure treatment requirements, is provided in material safety data sheets.  This information is supplemented by documents that specifically address known materials/corrosion concerns and any known hazards associated with the mixing of chemicals.  For the gas plant, process safety information documents safety related limits for key process parameters (e.g. temperature, level, pressure).  The process is maintained within these limits by using process controls and monitoring systems, highly trained personnel, and other protective control systems (e.g. automated shutdown systems).\n\n\tThe plant also maintains a library of technical documents that provide information about the design and construction of process equipment.  This information includes data on materials of construction, design pressures and temperatures, and electrical ratings of equipment.  This information, along with written procedures and trained personnel, provides a basis for inspection and maintenance activities.  These data also provide a basis for evaluating proposed process and facility changes to ensure that safety is not compromised.\n\nProcess Hazards Analysis (PHA)\n\n\tThe Chapel Hill Plant has a comprehensive program to help ensure that hazards associated"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 10554,
      "SummaryText": "with plant processes are identified and controlled.  Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\n\tThe hazard and operability (HAZOP) analysis technique is the primary method used to perform hazards evaluations.  The HAZOP analysis is recognized as one of the most systematic and thorough hazard evaluation techniques.  These analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise.  This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures.  The team also makes suggestions for additional prevention and/or mitigation measures when they believe such measures are necessary.\n\n\tPHA team findings are implemented by both local and corporate employees.  Potential accident scenarios with the highest risk receive immediate attention.  All approved mitigation options in response to PHA findings are tracked until they are completed.  The final resolution of each finding is documented and retained.\n\n\tTo help ensure that process operations/controls do not eventually deviate from the safety limits defined by original design and subsequent HAZOP analyses, plant employees periodically update and revalidate hazard analysis results.  These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating.  The results from these updates are documented and retained.  Team findings from these updates are also forwarded to management for consideration, and final resolution of the findings is documented and retained.\n\nOperating Procedures\n\n\tWritten procedures are maintained at the plant to address various modes of operation such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process.  These proc"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 10554,
      "SummaryText": "edures are used as a reference by experienced operators and provide a basis for consistent training of new operators.  These procedures are periodically reviewed and annually certified as current and accurate.  The management of change process is also used to ensure that these procedures are kept current and accurate as plant changes are made.\n\nTraining\n\n\tTo complement written procedures for process operations, a training program is used at the plant for all employees involved in operating a process.  New employees receive basic training in gas plant operations if they are not already familiar with such operations.  After successfully completing this training, a new operator is paired with an experienced operator to learn process-specific duties and tasks.  After operators show through skills demonstration that they can perform these duties and tasks in a safe manner on their own, they can work independently.  In addition, all operators periodically receive refresher training on operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  This refresher training is conducted at least every 3 years.  Training is documented for each operator, including the means used to verify that the operator understood the training. \n\nContractors\n\n\tContractors are used at the plant to supplement its workforce during periods of increased maintenance and construction activities.  Because some contractors work on or near process equipment, procedures are in place to ensure that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site safety rules, and (6) inform gas plant personnel of any hazards that they find during their work.  This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) em"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 10554,
      "SummaryText": "ergency response plan requirements, and (4) safe work practices prior to their beginning work.  In addition, contractor safety programs and performance are evaluated during the selection of a contractor.  Gas plant personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\n\nPre-startup Safety Reviews (PSSRs)\n\n\tPSSRs are conducted for any new facility or facility modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready.  The PSSR review team uses checklists to verify all aspects of readiness.  A PSSR involves verification of the construction and serves a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\n\nMechanical Integrity\n\n\tAt the plant, we have well-established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in safe operating condition.  The basic aspects of this program include:  (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, (5) applying quality assurance measures, and (6) performing scheduled maintenance.  In combination, these activities form a system that maintains the mechanical integrity of the process.\n\n\tMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their jobs"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 10554,
      "SummaryText": "in a safe manner.  Written procedures help ensure that work is performed in a consistent manner and provide a basis for training.  Inspections and tests are performed to help ensure that equipment functions as intended and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels).  If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or a management of change team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.\n\n\tAnother integral part of the mechanical integrity program is quality assurance.  Quality assurance measures are incorporated into equipment purchases and repairs.  This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\n\nSafe Work Practices\n\n\tSafe work practices are in place to help ensure worker and process safety.  Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) procedures for safe removal of hazardous substances before process piping or equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work), and (5) a procedure to ensure that adequate precautions are in place before entry into a confined space.  These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\n\nManagement of Change\n\n\tA comprehensive system is in place to manage changes to all covered processes.  This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 10554,
      "SummaryText": "being implemented.  Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided any necessary training on the change.\n\nIncident Investigation\n\n\tAll incidents are investigated that resulted in, or reasonably could have resulted in, a fire/explosion, gas release, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident.  The investigation team documents its findings, and develops recommendations to prevent a recurrence.  Corrective actions taken in response to the investigation team's findings and recommendations are tracked until they are complete.  The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings.  Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHAs and PHA revalidations.\n\nCompliance Audits\n\n\tTo help ensure that the accident prevention program is functioning properly, audits are periodically conducted to determine whether the procedures and practices required by the accident prevention program are being implemented.  Compliance audits are conducted at least every 3 years.  Both hourly and staff personnel participate as audit team members.  The audit team develops findings for resolution.  Corrective actions taken in response to the audit team's findings are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit r"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 10554,
      "SummaryText": "eports are retained.\n\n\n\nCHEMICAL-SPECIFIC PREVENTION STEPS\n\n\tThe processes at the plant have hazards that must be managed to ensure continued safe operation.  The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\n\nUniversal Prevention Activities\n\n\tThe accident prevention program summarized previously is applied to all RMP-covered processes at the plant.  Collectively, these prevention program activities help prevent potential accidents that could be caused by equipment failure and human errors.\n\nSpecialized Safety Features\n\n\tSafety features are on many units at the plant to help contain and control a release.  The following types of safety features are used in the covered processes:\n\n\t1.\tProcess relief valves that discharge to a flare to capture and incinerate episodic releases\n\n\t2.\tValves to permit isolation of the process (manual or automated)\n\n\t3.\tAutomated shutdown systems for specific process parameters (e.g., high temperature)\n\n\t4.\tCurbing or diking to contain liquid releases\n\t5.\tRedundant equipment and instrumentation (e.g., uninterruptible power supply for process control system)\n\n\t6.\tAtmospheric relief devices\n\n\t7.\tPersonnel trained to respond according to an emergency response program\n\n\t8.\tFire extinguishing systems\n\n\t9.\tExcess flow valves\n\nFive-Year Accident History\n\n\tThe Chapel Hill Gas Processing Plant has an excellent record of accident prevention.  Over the past five years, there have been no accidents involving RMP regulated substances that have resulted in either onsite or off-site deaths, injuries, or significant property damage.  No accidents have resulted in off-site evacuations, sheltering in place, or environmental damage.  All incidents or near-incidents at the plant are carefully investigated to prevent similar events from occurring in the future.\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\n\tA written emergency response program is maintained at the pla"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 10554,
      "SummaryText": "nt.  This program is designed to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response, including means for first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident cleanup requirements.  In addition, procedures are in place that address maintenance, inspection, and testing of emergency  response equipment, as well as instructions that address the use of emergency response equipment.  Employees receive training in these procedures as necessary to perform their emergency response duties.  The emergency response program is updated when changes are made in the plant that require a program update.  Emergency response program changes are administered through the management-of-change process, which includes personnel training requirements.\n\n\tThe overall emergency response program for the Chapel Hill Gas Processing Plant is coordinated with the Smith County Local Emergency Planning Committee (LEPC).  This coordination includes periodic meetings of the committee, which includes local emergency response officials, local government officials, and industry representatives.  The plant has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g. fire department).  This provides a means of notifying the public of an incident, as well as facilitating quick response to an incident."
    }
  ]
}