{
  "FacilityID": 10590,
  "FacilityName": "Tenneco Packaging Specialty and Consumer Products",
  "FacilityStr1": "1105 Industrial Lane",
  "FacilityStr2": null,
  "FacilityCity": "Malvern",
  "FacilityState": "AR",
  "FacilityZipCode": "72104",
  "Facility4DigitZipExt": "0668",
  "FacilityCountyFIPS": "05059",
  "LEPC": "Hot Spring County",
  "FacilityLatDecDegs": "34.3775",
  "FacilityLongDecDegs": "-92.82",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 38883484,
  "ParentCompanyName": "Tenneco Packaging, Inc.",
  "Company2Name": "Tenneco, Inc.",
  "CompanyDUNS": 5211768,
  "Company2DUNS": 181442526,
  "OperatorName": "Tenneco Packaging Specialty and Con",
  "OperatorStr1": "1105 Industrial Lane",
  "OperatorStr2": null,
  "OperatorCity": "Malvern",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72104",
  "OperatorZipCodeExt": "0668",
  "FTE": 200,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000057341",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-17 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 34.37683,
  "FRS_Long": -92.81763,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 13463,
      "AltID": "Blowing Agent System",
      "FacilityID": 10590,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 15896,
          "ProcessID": 13463,
          "ChemicalID": 118,
          "Quantity": 87000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 13791,
          "ProcessID": 13463,
          "NAICSCode": "32614",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 6458,
              "Process_NAICS_ID": 13791,
              "SafetyReviewDate": "1999-01-13 00:00:00",
              "PHA_Date": "1999-01-13 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-03-31 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-08 00:00:00",
              "TrainingReviewDate": "1999-03-08 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-08 00:00:00",
              "EquipmentInspectionDate": "1999-03-25 00:00:00",
              "EquipmentTested": "Pumps, valves, piping, instruments, control/process equipment",
              "ChangeMgmtDate": "1997-03-25 00:00:00",
              "ChangeMgmtReviewDate": "1999-01-13 00:00:00",
              "PreStartupReviewDate": "1999-04-06 00:00:00",
              "ComplianceAuditDate": "1999-01-13 00:00:00",
              "AuditCompletionDate": "2000-01-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-01-29 00:00:00",
              "HotWorkPermitReviewDate": "1999-01-29 00:00:00",
              "ContractorSafetyReviewDate": "1999-01-29 00:00:00",
              "ContractorSafetyEvalDate": "1999-01-29 00:00:00",
              "CBI_Flag": 0,
              "Description": "Blowing Agent System",
              "_chemicals": [
                {
                  "PrimaryKey": 8295,
                  "PreventionProgram3ID": 6458,
                  "ProcessChemicalID": 15896
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 10590,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Hot Spring County",
    "CoordinatingAgencyPhone": "5013322261",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 10590,
      "SummaryText": "Executive Summary\n\n1.    Accidental Release Prevention and Emergency Response Policies\nWe at Tenneco Packaging Specialty and Consumer Products, Inc. are strongly committed to employee, public and environmental safety.  This commitment is inherent in a comprehensive accidental release prevention program that covers areas such as design, installation, operation, and maintenance, of the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances and to train employees regarding the safe operation of  processes involving regulated substances.  Although such an event is unlikely, employees are trained to react to unplanned releases of regulated substances.  In addition, the plant has coordinated with local and other emergency response organizations which provide highly trained emergency response personnel to help control and lessen the effects of any unplanned release.\n\n\n2.    The Stationary Source and the Regulated Substances Handled\nThe primary manufacturing activity at this plant involves the production of plastic consumer products such as polystyrene foam trays.  We have one substance present at our facility which are regulated by United States Environmental Protection Agency (USEPA) under the Risk Management Program.  This substance is butane; and is referenced in this document by the term \"regulated substance\".  The regulated substance at our facility is used as a foaming agent in the production of the polystyrene foam.  These products are also often called \"blowing agents\" or \"expansion agents\" .\n\nThe maximum inventory of butane at our facility is approximately 87,000 pounds.\n \n3.    Worst Case Release Scenario(s) and Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\nUnder RMP, USEPA requires facilities to determine the effects of catastrophic releases of regulated substances.  In facilities which use flammable r"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10590,
      "SummaryText": "egulated substances, USEPA defines worst case scenario for a catastrophic release to be 1 pound per square inch (psi) over-pressure as a result of an instantaneous release of the largest tank volume utilizing no active measures to control the release of the regulated substance under worst-case weather conditions.  USEPA defines alternative release scenarios as 1 psi over-pressure as a result of a timed release of a portion of the largest tank volume utilizing active measures to control the release of the regulated substance under neutral weather conditions.  \n\n To evaluate the worst case scenario for the particular regulated substance and conditions at this facility, we used equations from Appendix D of the USEPA RMP Offsite Consequence Analysis Guidance and RMP Compute, a simplified EPA model based on the EPA's Offsite Consequence Analysis Guidance.  For analysis of alternative release scenarios, we also employed the equations provided by the USEPA in the RMP Offsite Consequence Analysis Guidance and RMP Compute.  The following paragraphs provide details of the chosen scenarios.\n\nThe activities at the plant can be categorized by program 3 of the RMP guidance.  The projected worst case release scenario would involve a catastrophic release from the butane storage tank.  The scenario involves the release of 87,000 pounds of butane.  Passive mitigation systems such as dikes were not considered when evaluating this scenario.  The worst case release scenario assumes that the entire quantity of the butane storage tank is released as a vapor,  an ignition source is present and 10 percent of the released quantity participates in a vapor cloud explosion.  Under worst case weather conditions (what is worst case weather conditions?), the maximum distance of 0.36 miles corresponds to an endpoint of 1 psi overpressure.  \n\nThe alternative release scenario involves a release from the butane storage tank assumed to result in a vapor cloud explosion.  The scenario involves the relea"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 10590,
      "SummaryText": "se of 26,100 pounds of butane. The release is controlled by active mitigation measures that include a deluge system and an automatic shut off valve.  Under neutral weather conditions, the maximum distance to the flammable endpoint of 1 psi overpressure is 0.16 miles.\n\n4.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under EPA's 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition.  A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119.  We also have an air operating permit ID the Clean Air Act. The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nTenneco Packaging Specialty and Consumer Products, Inc.  maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is a HazOp/Modified What If process.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of approximately every 5 years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Tenneco Packaging Specialty and Consumer Products, Inc.  maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency s"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 10590,
      "SummaryText": "hutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nTenneco Packaging Specialty and Consumer Products, Inc. utilized a comprehensive training program to ensure that employees who are operating processes using regulated substances are competent in the handling, operation, and maintenance procedures associated with these processes.  Refresher training is provided at least every two years and more frequently as needed.\n\nMechanical Integrity\nTenneco Packaging Specialty and Consumer Products, Inc.  carries out routine, periodic maintenance inspections and preventive maintenance on process equipment to ensure proper operations.  Process equipment examined during these inspections include but are not limited to pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with training in maintenance practices.  These personnel are provided specialized training as needed.  Any equipment deficiencies identified by the maintenance inspections  are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures at Tenneco Packaging Specialty and Consumer Products, Inc. manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of changes and provided training, as needed, to deal with the modifications.\n\nPre-startup Safety Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Tenneco Packaging Specialty and Consumer Products, Inc.  These reviews are conducted to confirm that equipment and procedures are complete and suitable for safe startup"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 10590,
      "SummaryText": " prior to placing equipment into operation.\n\nCompliance Audits\nTenneco Packaging Specialty and Consumer Products, Inc.  conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nTenneco Packaging Specialty and Consumer Products, Inc. promptly investigates any incident that results in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent a potential release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nTenneco Packaging Specialty and Consumer Products, Inc. truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  Many employees participate in safety initiatives within the plant.  In addition, our employees have access to all information created as part of the facilitys implementation of the RMP rule, including information resulting from process hazard analyses, in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Tenneco Packaging Specialty and Consumer Products, Inc.  has a strict policy of informing the contractors of known potential hazards related the contractors work and the processes.  Contractors are also informed of the procedures for emergency response should an accidental release of a regulated substance occur.\n\nHot Work \nThe facility maintains a hot work p"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 10590,
      "SummaryText": "rogram and issues a hot work permit for hot work conducted on or near the covered process.  Hot work is performed by qualified personnel who complete each permit and fulfill its requirements prior to the start of a hot work operation.  These permits are kept on file until the conclusion of of the hot work operation.                                                                                                                                                                                                                                                                                                                                                                                   \n5.    Five-year Accident History\nTenneco Packaging Specialty and Consumer Products, Inc. has an excellent record of preventing accidental releases over the last 5 years.  There has been no accidental release during this period.\n\n6.    Emergency Response Plan\nTenneco Packaging Specialty and Consumer Products, Inc. has developed a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident follow-up for affected areas.  The plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response. In addition, emergency response equipment is regularly inspected and serviced. \n\n7.    Planned Changes to Improve Safety\nOur facility has exemplary occupational safety and health programs which encompass employee involvement, recognition for safe work, partnership with OSHA and continuous hazard identification activities.  To enhance our continuous improvement in occupational safety and health, the Malvern Facility is working toward certification with the OSHA Voluntary Protection Program (VPP).  This program"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 10590,
      "SummaryText": " covers many of the elements ranging from management commitment to emergency response to employee participation.\n\n8. Certification Statement\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\nName:        Ronnie Hobbs\n\nSignature:     On file and on cover letter.\n\nTitle:        Plant Manager\n\nDate signed:    6/14/99"
    }
  ]
}