{
  "FacilityID": 10823,
  "FacilityName": "Seymour of Sycamore, Inc.",
  "FacilityStr1": "917 Crosby Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Sycamore",
  "FacilityState": "IL",
  "FacilityZipCode": "60178",
  "Facility4DigitZipExt": "1394",
  "FacilityCountyFIPS": "17037",
  "LEPC": "Dekalb County",
  "FacilityLatDecDegs": "41.9925",
  "FacilityLongDecDegs": "-88.6975",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "FC",
  "FacilityURL": "www.seymourpaint.com",
  "FacilityEmailAddress": "seymour_syc@earthlink.com",
  "FacilityDUNS": 5100789,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Nancy Seymour Heatley",
  "OperatorStr1": "917 Crosby Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Sycamore",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60178",
  "OperatorZipCodeExt": "1394",
  "FTE": 130,
  "OtherEPAFacilityID": "60178SYMRF917CR",
  "EPAFacilityID": "100000068767",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "037055AAG",
  "SafetyInspectionDate": "1999-03-02 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 41.99349,
  "FRS_Long": -88.69819,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 13880,
      "AltID": "Propellant",
      "FacilityID": 10823,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 16738,
          "ProcessID": 13880,
          "ChemicalID": 155,
          "Quantity": 620000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 7144,
              "ProcessChemicalID": 16738,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 7145,
              "ProcessChemicalID": 16738,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14214,
          "ProcessID": 13880,
          "NAICSCode": "32551",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 6805,
              "Process_NAICS_ID": 14214,
              "SafetyReviewDate": "1999-06-03 00:00:00",
              "PHA_Date": "1999-06-21 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-21 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-18 00:00:00",
              "TrainingReviewDate": "1999-06-18 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-18 00:00:00",
              "EquipmentInspectionDate": "1999-06-18 00:00:00",
              "EquipmentTested": "Propellant System",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-05-12 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-05-12 00:00:00",
              "AuditCompletionDate": "1999-05-12 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-18 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-03 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 9029,
                  "PreventionProgram3ID": 6805,
                  "ProcessChemicalID": 16738
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 10823,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-18 00:00:00",
    "ERTrainingDate": "1999-04-26 00:00:00",
    "CoordinatingAgencyName": "Sycamore Fire Department",
    "CoordinatingAgencyPhone": "8158954514",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 10823,
      "SummaryText": "SEYMOUR OF SYCAMORE, INC.\nSYCAMORE, ILLINOIS\nRISK MANAGEMENT PROGRAM\nExecutive Summary and Data Elements\n\n\nThis document and the accompanying data elements contain all required information in order to meet 40 Code of Federal Regulations (CFR) Part 68 \"Risk Management Program\" including an Executive Summary and RMP data elements (68.155 through 68.185).\n\nEXECUTIVE SUMMARY\n\n1.0\tAccidental Release Prevention and Emergency Response Policies:\n\nAt the Seymour of Sycamore, Inc. (Seymour) facility in Sycamore, Illinois, aerosol propellant is stored and injected into spray paint canisters.  The propellant mixture consists of 65 percent propane and 35 percent n-butane.  The properties that make the propellant valuable in the manufacturing process also make it necessary to observe certain safety precautions in handling to prevent unnecessary human exposure and to reduce the threat to employees, contractors, and nearby members of the community health and safety.  It is our policy to adhere to all applicable Federal and state rules and regulations.  Safety depends upon:\n\n7 the manner in which propellant is handled;\n7 the safety devices inherent in the design of our propane system;\n7 the safe handling procedures we use; and\n7 the training of our personnel.\n\nEmergency response procedures include notification of the local fire authority and notification of any potentially affected neighbors.  In addition, access to the site is restricted to authorized facility employees, management personnel, and contractors.  The propellant system is enclosed within a chain-linked fence to help keep it secure.\n\nSeymour has an excellent record in preventing and minimizing releases of aerosol propellant (A80, B80 or NP80).  This facility has a thorough emergency training program for on-site emergency responders.  Seymour uses real time databases to track training, maintenance, and inspection dates and issue reminders to responsible groups.\n\nThe emergency response policies at this facility ensure tha"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10823,
      "SummaryText": "t there is emergency response coverage 24 hours per day, 7 days per week by employees with Emergency Response Training.  There are also adequate provisions for coordination with outside agencies, such as with the City of Sycamore Fire Department and the DeKalb County Emergency Services and Disaster Agency in the event of an emergency.\n\n2.0\tThe Stationary Source and Regulated Substances Handled:\n\nAt this location Seymour manufactures aerosol spray paint canisters.  The North American Industry Classification System (NAICS) code for the primary process at this facility is 32551 (SIC code 2851). This facility is capable of producing and packaging aerosol spray paint canisters. \n\nSeymour has two regulated substances as specified in 40 CFR Part 68, propane and n-butane, at this location.  The propane and the n-butane exist as a propellant mixture known as A80, B80 or NP80.  This mixture is used as a propellant in the aerosol spray paint canisters.\n\nThe threshold for triggering applicability to 40 CFR Part 68 for propane and n-butane is 10,000 pounds each. The entire quantity of the propellant mixture stored on site is approximately 620,000 pounds.  The propellant mixture consists of 65 percent propane and 35 percent n-butane.  The corresponding quantities of these substances are approximately 403,000 pounds of propane and 217,000 pounds of n-butane.  \n\n3.0\tWorst-case and Alternative Release Scenarios\nThe propellant system has associated hazards that can potentially effect on-site employees and the general public off-site if there is a release from the system. Although the alternative release scenario is more probable, the United States Environmental Protection Agency (U.S. EPA) requires that one worst-case and one alternative release scenario be reported for each regulated chemical. Because each regulated chemical is part of the propellant mixture, the mixture will be evaluated as one substance for the worst-case and alternative release scenario for this facility.  Descri"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 10823,
      "SummaryText": "bed below are the associated hazards and the worst-case and alternative release scenarios for the propellant mixture used at Seymour.\n\nPropellant (A80, B80, or NP80)\n\nThe propellant is a flammable regulated substance that is capable of causing off-site consequences in a release.  The propellants primary hazard is that it can cause a fire or explosion.  Various types of release scenarios are possible including vapor cloud fires (flash fires), a pool fire with radiant heat effects, boiling liquid expanding vapor explosion (BLEVE) leading to a fireball producing intense heat, a vapor cloud explosion, and a jet fire from a hole in a tank.  The worst possible release scenario and a more likely alternative release scenario are described below.\n\n \tWorst-case release scenario: In the worst-case release scenario, it is assumed that the entire contents of the aboveground storage tank are released as a vapor that finds an ignition source.  Ten percent of the released quantity will participate in a resulting explosion.  Company policy limits filling of the 30,000-gallon propellant tank to 80.0% of the capacity.  Thus, the total released quantity of the propellant mixture is 107,000 pounds.  \n\n \tThe release and resulting explosion could potentially result in structural damage and human injury out to 1 pound per square inch (psi) pressure over that extends to 0.40 miles or 2,112 feet from the explosion center.  The Automated Resource for Chemical Hazard Incident Evaluation (ARCHIE) computer program was used to determine the distance to 1 psi pressure over.\n\n \tAlternative Release Scenario:  The alternative release scenario chosen involves the pressure relief valve being left open or being forced open. This scenario was selected because this release is more likely to occur. The scenario assumes that the two-inch pressure relief valve pipe would allow propellant to be emitted to the atmosphere for a duration of ten minutes, driven by the vapor pressure of the propellant. The release"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 10823,
      "SummaryText": "rate of propellant through the two-inch opening was calculated to be 400 pounds per minute.\n\n \tThe distance to 1 psi over pressure was determined using the ARCHIE computer program.  This distance was computed to be approximately 660 feet or 0.13 miles. \n\n4.0\tGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nFor this propellant mixture, Occupational Safety and Health Association (OSHA) Process Safety Management (PSM) compliance is required.  The OSHA PSM program is the basis for the RMP prevention program.  Seymour has developed an OSHA PSM program for their propellant system which falls under the RMP Program Level 3 prevention program.  Seymour's PSM program has been reviewed and determined to be complete for the RMP document.\n\nThere are several aspects of the prevention program that are key:\n\n1. Seymour holds monthly safety meetings to ensure that all employees review new safety policies and that every employee receives safety training.\n \n2. The facility has an employee suggestion program that allows employees to provide input concerning the effectiveness of safety procedures.\n \n3. Seymour maintains good training, certifications and employee awareness programs.\n \n4. The facility has a \"Management of Change\" policy that requires that any change that is not a \"replacement-in-kind\" must be reviewed for potential hazards it might introduce.\n \n5. The mechanical integrity program is in-place to ensure that process equipment is designed, constructed, installed, operated, and maintained properly to minimize the risk of release of hazardous chemicals.\n \n6. Pre-startup safety reviews of all new process equipment and modified equipment are conducted.\n\n7. Compliance audit are performed to ensure compliance to identify areas of safety improvement.\n\n5.0\tFive-year Accident History\n\nThe review of this facility's accident history includes the following range of dates: June 22, 1994 through June 21, 1999.  To date, there have been no accidental s"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 10823,
      "SummaryText": "pills or releases of propellant at the facility.\n\n6.0\tEmergency Response Program\n\nAs mentioned earlier, this facility has developed a Chemical Safety and Contingency Plan in which plant employees and contractors are trained on the plan and how it affects them.  The contingency plan was developed as a cooperative effort between the Environmental and Process Engineer and the local fire department.  There are four in-plant contacts for an emergency that can be found in the contingency plan.  The contingency plan includes specific information concerning proper response procedures to potential facility emergencies.  There are also specific procedures to follow in the event of a fire or explosion emergency.  \n\nAt the discretion of the Environmental and Process Engineer, either the City of Sycamore Fire Department and/or the State Emergency Services & Disaster Agency (ESDA) will be called to provide back-up emergency responders and equipment.  The City of Sycamore Fire Department will be called for all fire related emergencies.  In all cases where the fire department is called, an ambulance will also be called to the scene.\n\n7.0\tPlanned Changes to Improve Safety\n\nBased on the Process Hazard Analysis (PHA) review of the propellant system a list of situations was developed and evaluated to insure controls are in place to prevent a release of propellant. From this review, recommendations for improvement were identified.  These include:\n\n\n1. \"What If\" the driver hooks up to the wrong pipe?\nUpdate the existing PHA by defining Contributing Causes as None and Consequences as None.  Defend these statements under Existing Safeguards by indicating that it is physically impossible to hook up to the wrong pipe due to the difference in pipe connection sizes. \n\n2. \"What If\" the fill hose breaks during the unloading process?\nUpdate the existing PHA by defining Contributing Causes as Material Failure and Consequences as the high flow valve on the truck being triggered and the tank check v"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 10823,
      "SummaryText": "alve being activated.  Indicate that Existing Safeguards include 2 individuals (the truck driver and a Seymour employee) monitoring the unloading operation and that when a fill hose breaks, valves are shut off automatically shut-off on the truck and on the tank.\n\n3. \"What If\" the wrong material is delivered?\nUpdate the existing PHA by defining Contributing Causes as human error and not following existing safeguards and protocols.  Indicate the Consequences as re-training and possible disciplinary actions.  Re-emphasize Existing Safeguards and SOPs in the PHA.\n\n4. \"What If\" the valve on the storage tank is not open during unloading?\nUpdate the existing PHA by defining Contributing Causes as human error or mechanical failure and Consequences as the PRV on the truck being activated due to the high flow.  Re-emphasize the Existing Safeguards in the PHA.\n\n5. \"What If\" the storage tank valve is not closed after filling the tank?\nUpdate the existing PHA by defining Contributing Causes as human error or mechanical failure and Consequences as None.  Re-emphasize in the Existing Safeguards that the storage tank is equipped with a check ball in bottom and that the filling pipelines are equipped with one-way flow control valves.\n\n6. \"What If\" the storage tank ruptures during filling?\nUpdate the existing PHA by defining Contributing Causes as mechanical failure and Consequences as the catastrophic release of propellant and the potential for fire and explosion.  Re-emphasize the Existing Safeguards for notification of emergency services and the activation of the deluge system in the PHA.\n\n7. \"What If\" the storage tank is overfilled?\nUpdate the existing PHA by defining Contributing Causes as human error, gauge malfunction or mechanical failure and Consequences as the release of propellant and the potential for fire and explosion.  Re-emphasize the Existing Safeguards of the PRV being activated, notification of emergency services and the activation of the safety deluge system in th"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 10823,
      "SummaryText": "e PHA.\n\n\n8. \"What If\" a joint a pipe leaks?\nUpdate the existing PHA by defining Contributing Causes as mechanical failure and deterioration and Consequences as the release of propellant and the potential for fire and explosion.  Emphasize the Existing Safeguards that the protocol of visual inspection via soap bubbles, and that large pressure drops are monitored in the gas mixing houses.\n\n9. \"What If\" the pump that supplies production fails?\nUpdate the existing PHA by defining Contributing Causes as mechanical failure and Consequences will consist of low-pressure drop being detected by the gas mixing house manifold pressure sensors and the system will be shutdown.  Re-emphasize the Existing Safeguards that the reserve pump will be manually activated.\n\n10. \"What If\" the gauge fails on the storage tank?\nUpdate the existing PHA by defining Contributing Causes as mechanical failure and Consequences as the release of propellant and the potential for fire and explosion will be small.  Emphasize that Existing Safeguards will consist of off-loading of propellant to empty tanker trucks and possible increase in production of paint.  Also indicate that the gauges are checked daily.\n\n11. \"What If\" power supply is lost?\nUpdate the existing PHA by defining Contributing Causes as loss of electricity beyond the plant's control and Consequences as None.  Re-emphasize the Existing Safeguards such as the automatic shutting of control valves and the protocol for manual start-up and opening of these valves.\n\n12. \"What If\" an emergency happens in the plant?\nUpdate the existing PHA by defining Contributing Causes as loss of electricity beyond the plant's control, a fire, natural disaster, etc. and Consequences as None unless a catastrophic breach in the propellant system occurs, then refer to Item 6.  Re-emphasize the Existing Safeguards such as the automatic shutting of control valves and the protocol for manual start-up and opening of these valves."
    }
  ]
}