{
  "FacilityID": 1090,
  "FacilityName": "Smith Lake Water Treatment Facility",
  "FacilityStr1": "360 Doc Stone Road",
  "FacilityStr2": null,
  "FacilityCity": "Stafford",
  "FacilityState": "VA",
  "FacilityZipCode": "22554",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51179",
  "LEPC": "Stafford County LEPC",
  "FacilityLatDecDegs": "38.485278",
  "FacilityLongDecDegs": "-77.400833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "IP",
  "FacilityURL": null,
  "FacilityEmailAddress": "hcritzer@mindspring.com",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Stafford Co. Board of Supervisors",
  "OperatorStr1": "P. O. Box 339",
  "OperatorStr2": "1300 Courthouse Road",
  "OperatorCity": "Stafford",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "22555",
  "OperatorZipCodeExt": "0339",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000013424",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-01-28 00:00:00",
  "SafetyInspectionBy": "Virginia Municipal League rep.",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-05-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-05-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-05-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-02-24 00:00:00",
  "DeRegistrationEffectiveDate": "2004-01-26 00:00:00",
  "AnniversaryDate": "2004-05-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0.5e",
  "FRS_Lat": 38.48447,
  "FRS_Long": -77.39868,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1186,
      "AltID": "Disinfection of water",
      "FacilityID": 1090,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1275,
          "ProcessID": 1186,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1205,
          "ProcessID": 1186,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 226,
              "Process_NAICS_ID": 1205,
              "SafetyReviewDate": "1997-06-26 00:00:00",
              "PHA_Date": "1997-06-26 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Investigating change in disinfection chemical",
              "OpProceduresReviewDate": "1999-04-26 00:00:00",
              "TrainingReviewDate": "1999-04-26 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-23 00:00:00",
              "EquipmentInspectionDate": "1999-04-14 00:00:00",
              "EquipmentTested": "chlorine gas detectors",
              "ChangeMgmtDate": "1999-01-21 00:00:00",
              "ChangeMgmtReviewDate": "1999-01-28 00:00:00",
              "PreStartupReviewDate": "1999-04-20 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-01-28 00:00:00",
              "HotWorkPermitReviewDate": "1999-04-21 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-04-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 269,
                  "PreventionProgram3ID": 226,
                  "ProcessChemicalID": 1275
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1090,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Office of the Fire Marshal",
    "CoordinatingAgencyPhone": "5406588648",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1090,
      "SummaryText": "The Smith Lake Water Treatment Facility has incorporated accidental release prevention and emergency response as integral parts of the facility's standard operating policies and procedures.  The goal of these policies is to meet the domestic, commercial, and fire-fighting needs of our community without jeopardizing the safety of our empolyees, visitors to the facility, or the community at large.  The Stafford County government is committed to safety and has supported efforts to maintain and improve upon the excellent safety record of this facility.\n\nThe Smith Lake Water Treatment Facility produces drinking water primarily for the northern half of Stafford County.  The facility can produce up to 7.5 million gallons per day.  Treatment consists of chemical addition to facilitate the removal of color, organics, iron, manganese, and similar substances.  The water is then filtered and disinfected.  Currently, gaseous chlorine is used as the disinfecting agent.  The chlorine is shipped to us in one-ton containers.  Normally, no more than eight (8) containers, or 16,000 pounds, are present at any one time.  The chlorine containers are kept in the Chlorine Storage Room, and the chlorine feed equipment is kept in the Chlorinator Room.  Each chlorine container rests in its own cradle to prevent rolling or other unwanted movement.  Chlorine is supplied from the containers through a vacuum regulator to the chlorinators in the Chlorinator Room.  Valves are located on each container and on the piping manifold to isolate individual containers or piping should that be necessary.  In addition, chlorine leak detectors are located in the Chlorine Storage Room and in the Chlorinator Room.  Should a leak occur, an audible alarm sounds outside of the Process Building and at the main instrument control panel in the Administration Building.\n\nFor purposes of this plan, two offsite consequence scenarios were identified: a worst case release and an alternative scenario.  The worst case sc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1090,
      "SummaryText": "enario is defined by the Environmental Protection Agency (EPA).  It requires the assumption that the maximum quantity of chlorine contained in the largest vessel is released as a gas over a ten (10) minute time period.  The alternative scenario is defined as a chlorine release that is more likely to occur than is the worst case scenario.  Computer modeling was performed using EPA's RMPComp program to determine the distance traveled by a chlorine release before the chlorine concentration decreases to the toxic endpoint which EPA identifies as 3 parts per million (ppm) or 0.0087 milligrams per liter (mg/L).  The toxic endpoint is based upon the ERPG-2 concentrations developed by the American Industrial Hygiene Association (AIHA) and is defined as the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to 1 hour without experiencing  or developing irreversible or other serious health effects or symptoms that could impair an individual's ability to take protective action.  In addition to identifying the toxic endpoint distance, population data was used to estimate the number of people within a circle with a radius corresponding to the toxic endpoint distance which could potentially be affected by a chlorine release.\n\nThe worst case scenario for the Smith Lake Water Treatment Facility involves failure of a one-ton chlorine container with subsequent loss of 2,000 pounds of chlorine into the Chlorine Storage Room within 10 minutes.  Because the chlorine container is contained within the storage room, the model assumes that 1,100 pounds of chlorine escape from the storage room and dissipate into the air.  Factors such as wind speed (1.5 meters per second or 3.4 miles per hour), atmospheric stability class (F), and air temperature (77 degrees F or 25 degrees C) are set by the model.  Using these assumptions, the worst case scenario model results in a distance to toxic endpoint of 2.2 miles.\n\nThe alternative rele"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1090,
      "SummaryText": "ase scenario involves a pipe leak with subsequent loss of 25 pounds of chlorine into the atmosphere from the Chlorine Storage Room within 10 minutes.  Wind speed is assumed to be 3.0 meters per second (6.8 miles per hour) and an atmospheric stability class of D is used.  With these assumptions, the alternative release scenario results in a distance to toxic endpoint of 0.1 miles.\n\nThe Smith Lake Water Treatment Facility accidental release prevention program incorporates training, process hazard analysis, recognition of human factors that may contribute to an accidental release; and specific procedures for receiving and changing chlorine containers.  All employees are trained in the hazards associated with chlorine, the use of personal protective equipment including a self-contained breathing apparatus, and the proper response to various chlorine release scenarios.  Detailed procedures are in place for receiving chlorine container deliveries and for the changeover of chlorine containers when those in use are emptied.  In addition, guidance is provided on notification procedures should a large chlorine release occur.  Chlorine leak detectors are provided in both the Chlorine Storage Room and the Chlorinator Room.  These sound alarms should a chlorine leak occur.\n\nNo accidental releases of chlorine have occurred at this facility in the past five years.\n\nThe Smith Lake Water Treatment Facility is included in the hazard-specific annex to the County's Emergency Operations Plan entitled Hazardous Materials Emergency Response Plan.  A chlorine container emergency repair kit is kept at the Smith Lake facility for use by emergency responders.  In all but the most minimal chlorine leak, the facility staff is directed to dial 911 and report an emergency chlorine release situation.  \n\nBecause of the increased growth around the Smith Lake Water Treatment Facility as well as the proximity of \nI-95, the use of alternative disinfectants including calcium hypochlorite and sodium hy"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1090,
      "SummaryText": "pochlorite has been examined.  In conjunction with Stafford County's desire to provide a safe environment both for its employees and for the public, the decision has been made to proceed with a changeover from chlorine gas to liquid sodium hypochlorite as soon as possible.  Given the need for design engineering assistance, submittal of plans and specifications to the Department of Health for approval; procurement of the necessary storage tanks, pumps, and related equipment; and installation of this equipment, the changeover is not expected to be completed until the end of 1999."
    }
  ]
}