{
  "FacilityID": 10922,
  "FacilityName": "Pebbly Beach Generating Station",
  "FacilityStr1": "1 Pebbly Beach Road",
  "FacilityStr2": null,
  "FacilityCity": "Avalon",
  "FacilityState": "CA",
  "FacilityZipCode": "90704",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": null,
  "FacilityLatDecDegs": "32.750028",
  "FacilityLongDecDegs": "-118.951722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "AB",
  "FacilityURL": "http://www.edison.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 120241211,
  "ParentCompanyName": "Southern California Edison Company",
  "Company2Name": null,
  "CompanyDUNS": 6908818,
  "Company2DUNS": 0,
  "OperatorName": "Southern California Edison Company",
  "OperatorStr1": "1 Pebbly Beach Road",
  "OperatorStr2": null,
  "OperatorCity": "Avalon",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90704",
  "OperatorZipCodeExt": null,
  "RMPContact": "Rudy Haro",
  "RMPTitle": "Manager",
  "FTE": 26,
  "OtherEPAFacilityID": "CAD981689912",
  "EPAFacilityID": "100000077178",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "4477",
  "SafetyInspectionDate": "1997-06-01 00:00:00",
  "SafetyInspectionBy": "Los Angeles County Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-06-25 00:00:00",
  "DeRegistrationEffectiveDate": "2004-06-15 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 33.33495,
  "FRS_Long": -118.31166,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Propane Retail Store Exemption",
  "_processes": [
    {
      "ProcessID": 14098,
      "AltID": null,
      "FacilityID": 10922,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 14435,
          "ProcessID": 14098,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 17104,
          "ProcessID": 14098,
          "ChemicalID": 155,
          "Quantity": 549712.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 7962,
              "ProcessChemicalID": 17104,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 7963,
              "ProcessChemicalID": 17104,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 7964,
              "ProcessChemicalID": 17104,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 7965,
              "ProcessChemicalID": 17104,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 517104,
          "ProcessID": 14098,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 10922,
      "SummaryText": "1.0 EXECUTIVE SUMMARY\n\n\n\nThe following provides a brief summary of the key components of the Risk Management Program for the liquefied petroleum gas (LPG) storage and handling system at Pebbly Beach Generating Station.\n\n\n1.1 Introduction\n\nPursuant to the requirements contained in Chapter 6.95, Article 2 of the California Health & Safety Code x 25531 through 25543.3, and the Clean Air Act 112r and Title 40 of the Code of Federal Regulations Part 68, this Risk Management Plan (RMP) is submitted on behalf of Pebbly Beach  Generating Station.  This program is implemented in California as the California Accidental Release Prevention (CalARP) Program.\n\nThe scope of this RMP is based on discussions with the Administering Agency (AA), the Los Angeles County Fire Department, to ensure that all issues are resolved and to incorporate state requirements.  With input from the AA, the liquefied petroleum gas (LPG) storage and handling facility was identified as the only process that triggers the CalARP requirements.  This process was determined to be covered by Program 2 requirements.  The process hazard review technique consisting of a Hazard Operability Study (HAZOP) was then presented to and approved by the AA and the level of detail for this RMP submission agreed upon.\n\n\n1.2 General Description of the Stationary Source and Regulated Substance\n\nPebbly Beach Generating Station, located in Avalon, Santa Catalina Island, California, is a combination electric generating station and liquefied petroleum gas (LPG) distribution facility.  Pebbly Beach Generating Station provides both electricity and gas for the entire island.  The electric generating station is comprised of 6 internal combustion engines combusting distillate fuel with a total generating capacity of 9.33 MW.  The LPG system is comprised of four 30000 gal storage tanks, one 16000 gal storage tank, truck unloading bulkhead, LPG dispenser, LPG compressor, LPG sensors, LPG vaporizers (3), LPG mixers, deluge system, Unit 15"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10922,
      "SummaryText": " feed, and piping system.  Several components of LPGre subject to the requirements of the Federal Risk Management Program and the California Accidental Release Prevention (CalARP) Program.  These include propane (CAS Number 74-98-6), butane (CAS Number 106-97-8), ethane (CAS Number 74-84-0), and methane (CAS Number 74-82-8).\n\n\n\n1.3 Offsite Consequence Analysis Results\n\nThe Offsite Consequence Analysis prepared in support of this RMP utilized the methodologies recommended by EPA as incorporated in RMP*Comp, version 1.06.  The following release scenarios were hypothesized:\n\nRelease Scenario I - Worst-Case \n\nThe entire contents of the largest LPG storage tank (30,000 gal capacity) is released, a vapor cloud forms, and detonates in a vapor cloud explosion.  The worst-case estimated distance to 1 psi overpressure is 0.4 miles beyond which the pressure wave resulting from detonation is sufficiently dispersed to no longer pose a hazard to the public.\n\nRelease Scenario II - Alternative \n\nThe entire contents of the delivery trucks hose carrying LPG between the truck shut-off valve and tank hook-up is released by a failed delivery hose due to a pull-away without unhooking, vaporizes, and detonates in a vapor cloud explosion.  Active mitigation are assumed to work as designed, limiting the release to the contents of the hose.  The estimated distance to 1 psi over pressure is <0.1 miles beyond which the pressure wave resulting from detonation is sufficiently dispersed to no longer pose a hazard to the public.\n\nRelease Scenario III - Alternative\n\nThe entire contents of the all LPG piping onsite is released by a pipe failure resulting in vaporization and detonation.  The estimated distance to 1 psi over pressure is 0.22 miles beyond which the pressure wave resulting from detonation is sufficiently dispersed to no longer pose a hazard to the public.\n\n\n1.4 Summary of the Five-Year Accident History\n\nThere have been no accidental releases from the LPG storage and  handling system at"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 10922,
      "SummaryText": " Pebbly Beach Generating Station in the past five years that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  (Statute:  40 CFR 68.42)\n\n 1.5 Summary of Prevention Program 2\n\nThe LPG system at Pebbly Beach Generating Station is covered by an accidental release prevention program which includes the following:\n\n7 Periodic hazard reviews and updates.\n7 Periodic audits of the system and its operation.\n7 Emergency Response Plan that is coordinated with local emergency response agencies.\n\nThe LPG system prevention program includes the following steps:\n\n7 Gas Operations and Maintenance Procedures Manual covering all components of the LPG system both in standard practice and emergency practice including,\n7 operation\n7 maintenance\n7 inspection\n7 testing\n\n\n1.6 Summary of the Emergency Response Program\n\nPebbly Beach Generating Station has recently revised its Emergency Response Plan for Water, Gas, and Electric Operations.  A key component of this overall program is the Gas System Emergency Plan elements which include:\n\n7 specific actions to be taken in response to,\n7 gas leak emergencies\n7 severe damage resulting from natural causes, accidents, or sabotage\n7 interruption of service or over-pressure/under-pressure\n7 fire or explosions\n7 procedures to notify local and public agencies including the Avalon Fire Department, the Office of Emergency Services and the National Response Center as necessary\n7 a list of resources for emergency health care\n7 information regarding the training of employees \n\n\n1.7 Planned Changes to Improve Safety\n\nBelow are listed recommendations developed by the HAZOP team during the PHA study at Pebbly Beach Generating Station. These recommendations are not required to be implemented, only that a response on the part of management towards them needs to be developed. Either the recommendation can be accepted and have an "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 10922,
      "SummaryText": "action item designed, or the recommendation can be rejected. If the recommendation is rejected, reasoning and documentation for the rejection should be developed and retained at the facility. \n\nRecommendations were also qualitatively prioritized at the end of the PHA session. The ranking method is shown below.\n\nRisk Rank Criteria\nA Very Serious Concern: Potential for catastrophic consequences (fatality, etc.). Need to address situations immediately. Emergency work order.\nB Serious Concern: Potential for severe consequences (serious injury, etc.). Need to address the situation soon. Work order done within one month.\nC Concern: Potential for moderate consequences (lost time accident, etc.). Need to address situation.\nD Minor Concern: Potential for minor consequences (first aid, etc.). Eventually address situation.\n\nAll but five recommendations were of the lowest ranking. The remaining five recommendations were ranked a C level, indicating that there are some issues of concern, but no serious issues outstanding.  The recommendations are shown below.\n\n\nPHA Recommendations\n\nRecommendation Rank Addressed Before Responsible Party\nR.1 Institute emergency drills with the fire department.     C    December 1, 1999    Site Safety\nR.2 Check for sufficient water pressure if deluge system is activated.     C    December 1, 1999    Site Safety\nR.3 Investigate locations of fire fighting equipment in the gas plant area.     D    June 1, 2000    Site Safety\nR.4 Investigate blast & fire resistance of door/wall between control room and gas plant area.     C    December 1, 1999    Site Safety\nR.5 Investigate code requirements for electrical classifications in gas plant area and institute as needed.     C    December 1, 1999    Site Safety\nR.6 Consider an e-stop in an area that is away from the gas plant and storage areas.     D    June 1, 2000    Site Safety\nR.7 Upgrade preventative maintenance for relief valves as per manufacturers specifications.     D    June 1, 2000    Site Safety\nR.8 Route small relief valves located on liquid lines near ventu"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 10922,
      "SummaryText": "ris to an elevated location.     D    June 1, 2000    Site Safety\nR.9 Investigate design basis for small relief valves located near venturis and remove if not needed.     D    June 1, 2000    Site Safety\nR.10 Investigate lighting arrangements to ensure it is appropriate for the tank and gas plant areas.     D    June 1, 2000    Site Safety\nR.11 Consider putting outside lighting on critical load generator.     D    June 1, 2000    Site Safety\nR.12 Install vehicle protection to area at Unit 15 where piping comes to the ground.     D    June 1, 2000    Site Safety\nR.13 Ensure tank farm leak detectors are given PM as per manufacturers requirements.     D    June 1, 2000    Site Safety\nR.14 Install hydrocarbon leak detectors in the gas plant area.     C    December 1, 1999    Site Safety\nR.15 Verify that preventative maintenance system includes all critical equipment and that manufacturers recommended maintenance is performed.     D    June 1, 2000    Site Safety\nR.16 Label all piping, valves (with valve number system) in a consistent manner.     D    June 1, 2000    Site Safety\nR.17 Complete transfer of annunciator alarms to new panel and clean up old panel.     D    June 1, 2000    Site Safety\nR.18 Update employee training on emergency response plans.     D    June 1, 2000    Site Safety\nR.19 Conduct internal emergency response drills on a periodic basis.    D    June 1, 2000    Site Safety\nR.20 Enhance written Lockout/tagout procedure to include valves and mechanical equipment.    D    June 1, 2000    Site Safety\nR.21 Ensure all equipment is grounded.     D    June 1, 2000    Site Safety\nR.22 Blind flange line to unit 8 util piping and equipment are removed and taken out of service.     D    June 1, 2000    Site Safety\nR.23 Ensure loading compressor maximum discharge cannot overpressure tanks.     D    June 1, 2000    Site Safety\nR.24 Check sales pump manufacturers recommended maintenance and add to preventative maintenance system.     D    June 1, 2000    Site Safety\nR.25 Ensure loading hose manufacturers recommendations for hose replacement.     D    June 1, 2000    Site Safety\nR.26 Add sales pump bypass valve to preventativ"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 10922,
      "SummaryText": "e maintenance system.     D    June 1, 2000    Site Safety\nR.27 Ensure sales pump discharge pressure cannot overpressure sales hose (350 psi).    D    June 1, 2000    Site Safety"
    }
  ]
}