{
  "FacilityID": 10935,
  "FacilityName": "Forrest Paint Co.",
  "FacilityStr1": "1011 McKinley Street",
  "FacilityStr2": null,
  "FacilityCity": "Eugene",
  "FacilityState": "OR",
  "FacilityZipCode": "97402",
  "Facility4DigitZipExt": "2791",
  "FacilityCountyFIPS": "41039",
  "LEPC": "Oregon LEPC",
  "FacilityLatDecDegs": "44.048889",
  "FacilityLongDecDegs": "-123.128333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": "http://www.forrestpaint.com",
  "FacilityEmailAddress": "forrest@forrestpaint.com",
  "FacilityDUNS": 63427306,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Richard S. Forrest",
  "OperatorStr1": "P.O. Box 22110",
  "OperatorStr2": null,
  "OperatorCity": "Eugene",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97402",
  "OperatorZipCodeExt": "0470",
  "RMPContact": "Steve Morgan",
  "RMPTitle": "Environmental Manager",
  "FTE": 107,
  "OtherEPAFacilityID": "97402FRRST1011M",
  "EPAFacilityID": "100000075027",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "202805",
  "SafetyInspectionDate": "1999-05-18 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 44.04909,
  "FRS_Long": -123.12875,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 14125,
      "AltID": "Aerosol Propellant",
      "FacilityID": 10935,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 14462,
          "ProcessID": 14125,
          "NAICSCode": "32551",
          "_desc": {
            "NAICS_CODE": "32551",
            "NAICS_DESCRIPTION": "Paint and Coating Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 17136,
          "ProcessID": 14125,
          "ChemicalID": 98,
          "Quantity": 21000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 17137,
          "ProcessID": 14125,
          "ChemicalID": 118,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 517136,
          "ProcessID": 14125,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 517137,
          "ProcessID": 14125,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 10935,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\nCompany Statement\n\nAt Forrest Paint Co. we have always been very concerned about the impact our plant might have on our workers and our neighbors.  In recent years, we have worked to make our facility safer and to minimize its effect on the environment.  This hasn't been done in a vacuum.  Forrest Paint Co. is one of the most highly regulated businesses in Eugene.\n\nWe work closely with regulatory agencies of the Federal, State, and local governments.  In the past year, our facility has been inspected by the Department of Environmental Quality, Federal Aviation Authority, OSHA, Lane Regional Air Pollution Authority, Eugene Fire Department and the hazardous materials expert from the Eugene Fire Department.  Most of these visits were at our request seeking expert advise on how to make our plant safer or our processes cleaner.  We participate in the National Paint and Coatings Association's \"Coatings Care\" program approved by the American Chemical Society as equivalent to \"Chem Care.\"\n\nDuring the past 2 years, as part of Forrest Paint's Process Safety Management Plan, we examined the covered process in our plant to determine the worst conceivable accidents.  As a result of this study, in 1998 we updated and/or replaced most of our flammable raw material storage tanks.  The Eugene Fire Department inspected and approved the new facilities.  We have invited OSHA for meetings where they review our progress and our plans for the future.  Consultations with OSHA will continue until this is finished.\n\nForrest Paint Co. is concerned about any effect our facility and our products might have on the community.  We will continue to work toward making our plant and our products safer for our employees, our neighbors, our customers, and your environment.\n\nProcess Safety Management/RMP Information\n\nForrest Paint Co. produces a large number of paints, coatings, aerosols and related specialty products . These products are largely used by manufacturers of original equ"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10935,
      "SummaryText": "ipment (OEM) and other industrial applications.\n \nThe covered process is the gassing of aerosol cans with a propellant consisting of a mixture of propane and butane.  This gas is a odorless, compressed, very flammable, liquefied petroleum gas (LPG).  The scope of this process is the aerosol propellant tanks, piping, and gassing equipment.\n\nThe buildings and equipment used in this process were designed specifically for the manufacturing of aerosol cans. All equipment in the gassing areas is explosion proof and/or air operated.  The aerosol propellant tank farm conforms to National Fire Protection Association's NFPA 58 LP-Gas Code 1995 edition.  Terco is the manufacturer of most of our gassing equipment.\n\nTank wagons deliver the aerosol propellant to eight special LPG storage tanks with a combined capacity of 8,096 gallons (88% maximum fill). The propellant is a mixture of 57% propane and 42% n-butane.  The propellant is handled under pressure of more than 100 psi and exists as a liquid. The propellant is pumped with a special pump through heavy duty pipe to the two aerosol gassing stations. The major gassing station is in a 6 ft. x  6 ft. cinder block building constructed with a blow out roof. This gassing station is equipped with a twin head circular gassing table and operates automatically. The other gassing station is hand operated, used for small orders, and is located in the aerosol can filling area.\n\nOur worst-case release scenario is failure of one 1,012 gallon storage tank of propellant when filled to the greatest amount allowed (88% at 60F), resulting in a vapor cloud explosion.  Since our facility is located in an industrial area, the explosion from the vapor cloud would reach off-site endpoints and nearby public receptors.  This is very unlikely since we had the propellant storage system completely re-done with new tanks, safety release valves, emergency shut-off valves, gauges, and piping.  \n\nOur alternative release scenario, we selected a hose rupture ca"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 10935,
      "SummaryText": "used by a pull-away as the most likely event to occur.  A pull-away can occur if the driver fails to remove the hoses between the storage tank and the tanker truck before moving the vehicle.  Excess flow valves on both the stationary tanks and the tanker truck will prevent the release of only the amount of LPG in the hose and associated piping.\n\nOur prevention program consists of 13 elements.  The first element is process safety information which includes chemical hazards, physical data, reactivity information, a process flow diagram, maximum intended inventory, safe upper and lower limits, evaluation of the consequences of deviations, equipment in the process, piping and instrumentation diagrams, and design codes and standards employed.  The second element of our program is the process hazard analysis which is an audit of the process to find any potential problems which then requires a correction.  Other highlights of our prevention program include safe operating procedures, employee training, mechanical integrity of equipment, and compliance safety audits.\n\nWe have never had an accident involving regulated substances at Forrest Paint Co.\n\nOur emergency response program consists of an integrated contingency plan, coordination with emergency responders (City of Eugene Fire Department has conducted on-site training for their personnel), regular fire drills, and employee training."
    }
  ]
}