{
  "FacilityID": 10962,
  "FacilityName": "Epsilon Products Company",
  "FacilityStr1": "One Epsilon Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Garyville",
  "FacilityState": "LA",
  "FacilityZipCode": "70051",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22095",
  "LEPC": "St. John The Baptist Parish",
  "FacilityLatDecDegs": "30.070278",
  "FacilityLongDecDegs": "90.607778",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.epsilonproducts.com",
  "FacilityEmailAddress": "N/A",
  "FacilityDUNS": 612501460,
  "ParentCompanyName": "BAR-L Inc.",
  "Company2Name": "CMB Inc.",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Epsilon Products Company",
  "OperatorStr1": "P.O. Drawer E",
  "OperatorStr2": "One Epsilon Avenue",
  "OperatorCity": "Garyville",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70051",
  "OperatorZipCodeExt": null,
  "FTE": 104,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000078202",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-03 00:00:00",
  "SafetyInspectionBy": "State Fire Marshall",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 30.0677,
  "FRS_Long": -90.60779,
  "FRS_Description": null,
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 14216,
      "AltID": "Epsilon Products Company",
      "FacilityID": 10962,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 17259,
          "ProcessID": 14216,
          "ChemicalID": 129,
          "Quantity": 7100000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14557,
          "ProcessID": 14216,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 7060,
              "Process_NAICS_ID": 14557,
              "SafetyReviewDate": "1999-05-24 00:00:00",
              "PHA_Date": "1998-03-27 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Automatic Shutdown Systems",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Gas Detectors and Fire Detectors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-02 00:00:00",
              "TrainingReviewDate": "1999-01-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-16 00:00:00",
              "EquipmentInspectionDate": "1998-12-01 00:00:00",
              "EquipmentTested": "Reactor C-4001",
              "ChangeMgmtDate": "1999-06-14 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-31 00:00:00",
              "PreStartupReviewDate": "1999-06-04 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-17 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-31 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-16 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 9374,
                  "PreventionProgram3ID": 7060,
                  "ProcessChemicalID": 17259
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 10962,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-30 00:00:00",
    "ERTrainingDate": "1999-06-18 00:00:00",
    "CoordinatingAgencyName": "St. John the Baptist LEPC",
    "CoordinatingAgencyPhone": "5046522222",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 10962,
      "SummaryText": "psilon does not expect a worst-case release scenario to ever occur.  An alternative release scenario represents a release that might occur during the lifetime of a facility like Epsilon.  Alternative release scenarios can be used to help the LEPC improve the community emergency response plan.  \n\nThe main objective of performing the offsite consequence analysis is to determine the distance at which certain effects might occur to the public because of an accidental release (called the endpoint distance).  The following effects could occur at the endpoint distance:\n\n7 When considering explosion of a flammable substance, people at the endpoint distance are likely to be knocked down by the blast.  Windows could shatter, and the potential for structural damage to buildings exists, although a building collapse is unlikely.  People could be seriously injured by being knocked down by the force of the blast, by flying glass, or by falling objects.\n\nAt distances less than the endpoint distance, the effects would be greater; at distances greater than the endpoint distance, the effects would be less.\n\nWorst-Case Release Scenario\n\nThe worst-case scenario associated with a release of flammable substance (propylene) in the RMP-covered process at the facility is a vapor cloud explosion (VCE) involving the full inventory of the largest storage tank containing propylene.  The full tank inventory of approximately 7,000,000 lbs. is assumed to release, completely vaporize, and ignite, resulting in a VCE.  The maximum distance to the 1-psi endpoint for this scenario is 1.54 miles. Although Epsilon has numerous controls to prevent such releases and to manage their consequences, no credit for mitigation measures was taken into account in evaluating this worst-case scenario.  \n\nAlternative Release Scenario\n\nThe alternative release scenario for the flammable substance (propylene) at the facility is a VCE caused by a pump seal leak resulting in the release of 40,000 lbs of propylene in a 20-mi"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 10962,
      "SummaryText": "LDEQ Facility ID 30922\n\nExecutive Summary\n\nThe Epsilon Products Company (Epsilon) Garyville Facility is committed to operating in a manner that is safe for Epsilon workers, the public, and the environment.  It is Epsilon's policy that in the conduct of its activities it will strive to protect and promote the health and safety of its employees, customers, and others who may be affected by these activities, and to limit adverse effects on the physical environment in which its activities are carried out.  As part of this policy, Epsilon has established systems to help ensure safe operation of the processes at this facility.  One part of these systems is a risk management program (RMP) that helps manage the risks at Epsilon and complies with the requirements of the Environmental Protection Agency's (EPA's) rule 40 CFR part 68, Accidental Release Prevention Requirements:  Risk Management Programs (the RMP rule), and the Louisiana Department of Environmental Quality regulation (LAC 33:III.Chapter.59).  One of the requirements of the RMP rule is to submit a risk management plan (RMPlan) describing the risk management program at Epsilon.  This document is intended to satisfy the RMP Plan executive summary requirement of the RMP rule and to provide the public with a description of the risk management program at Epsilon.\n\n1.1 Accidental Release Prevention and Emergency Response Policies\n\nEpsilon is committed to the safety of the general public and Epsilon employees and to the preservation of the environment.  One primary portion of this commitment is the prevention of accidental releases of hazardous substances in and around the facility.  Epsilon utilizes engineering controls, inspection programs, and detailed procedures as a means to prevent accidental releases.  In the event of a release, the facility has an emergency response team trained to contain, mitigate, monitor, and stop the release.  Additionally, the emergency response team is fully staffed and trained for fire f"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10962,
      "SummaryText": "ighting, medical emergencies, and other emergency situations such as natural disasters and bomb threats.  In addition to handling the emergency, the facility has also established a wide variety of communication systems to alert the community in the event of a significant release.  In conjunction with the local emergency planning committee (LEPC), the facility has ability to notify the local community through cable override systems, radio broadcasts, and/or through an automated telephone notification system (FirstCall). \n\nThe Epsilon Plant Manager has overall responsibility for the development and implementation of the risk management program.  However, the specific responsibilities for certain aspects of that program have been delegated to other personnel who report to the Plant Manager either directly or through other management personnel.  Those relationships are depicted on the plant organization chart.  Specific responsibility for the implementation of the process safety management (PSM) and accident prevention program has been delegated to the Safety & Health Manager.  The plant's emergency response program, including compliance with the RMP aspects of that effort, is also the responsibility of the Safety & Health Manager.\n\n1.2 Epsilon Regulated Substances\n\nEpsilon is a manufacturer of polypropylene and is located in Garyville, Louisiana.  The Epsilon process contains propylene, which is a flammable substance that EPA has specifically listed in the RMP rule and is present in the process above the EPA threshold quantity of 10,000 pounds.  Toxic substances used or stored at Epsilon do not meet or exceed the listed threshold quantities. \n\n1.3 Offsite Consequence Analysis\n\nEpsilon performed an offsite consequence analysis to estimate the potential for an accidental release of a regulated substance that could affect the public or the environment.  The offsite consequence analysis consisted of evaluating both worst-case scenarios and alternative release scenarios.  E"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 10962,
      "SummaryText": "The hazards of the process;\nb) The identification of any previous incident which had a likely potential for  catastrophic consequences in the workplace;\nc) Engineering and administrative controls applicable to the hazards and their interrelationships; such as appropriate application of detection methodologies to provide early warning of releases.  Acceptable detection methods might include process monitoring and control instrumentation with alarms and detection hardware such as hydrocarbon sensors;\nd) Consequences of failure of Engineering and administrative controls;\ne) Facility siting;\nf) Human factors, and\ng) A qualitative evaluation of a range of the possible safety and health effects of failure of controls on employees in the workplace.\n\nEpsilon has established a system to promptly address the teams' findings and recommendations; assure that the recommendations are resolved in a timely manner and that the resolution is documented; document what actions are to be taken; complete actions as soon as possible; develop a written schedule of when these actions are to be completed; and communicate the actions to operating maintenance and other entities whose work assignments are in the process and who may be affected by the recommendations or actions.  Epsilon retains Process Hazards Analyses and updates or revalidations, as well as the documented resolution of recommendations for the life of the process.\n\nAt least every five (5) years after the completion of the initial Process Hazard Analysis, the Process Hazard Analysis will be updated and revalidated by a team to assure that it is consistent with the current process.\n\nOperating Procedures\n\nEpsilon maintains written Standard Operating Procedures (SOPs) that provide clear instructions for safely conducting activities involved in the process operations, such as (1) initial startup; (2) normal operations; (3) temporary operations; (4) emergency shutdown;  (5) emergency operations; (6) normal shutdown; and (7) startup"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 10962,
      "SummaryText": "nute period.  The release is expected to be isolated by the operators within 20 minutes (active mitigation). The maximum distance to the 1-psi endpoint for this event is 0.18 mile.  This event was selected as being a practical scenario for use in emergency planning and response.\n\n1.4 Accidental Release Prevention Program\n\nThe following is a summary of the general accident prevention program in place at Epsilon.  Because the process at the facility regulated by the EPA RMP regulation is also subject to the Occupational Safety and Health Administration (OSHA) process safety management (PSM) standard, and because the OSHA PSM requirements are very similar to the EPA RMP requirements, this summary addresses each of the OSHA PSM elements.  The PSM program at this facility has been extended by Epsilon, where necessary, to satisfy EPA's Program Level 3 accident prevention program requirements.\n\nEmployee Participation\n\nEpsilon encourages employees to participate in all facets of process safety management and accident prevention. Epsilon consults with employees on the conduct and development of Process Hazard Analyses (PHAs) and the development of the elements of OSHA's Process Safety Management (PSM) standard.  Employees have access to all information created as part of Epsilon's PSM and accident prevention programs. \n Process Safety Information\n\nEpsilon completes a compilation of written Process Safety Information before conducting any Process Hazard Analysis required by the OSHA PSM standard.  The compilation of written process safety information is to enable Epsilon and the employees involved in operating the process to identify and understand the hazards posed by those processes involving highly hazardous chemicals.  This Process Safety Information includes information pertaining to the hazards of the highly hazardous chemicals used or produced by the process, to the technology of the process, and to the equipment in the process.\n\nInformation pertaining to the hazards o"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 10962,
      "SummaryText": "f the highly hazardous chemicals in the process consists of the following:\na) Toxicity information;\nb) Permissible exposure limits;\nc) Physical data;\nd) Reactivity data;\ne) Corrosivity data;\nf) Thermal and chemical stability data; and\ng) Hazardous effects of inadvertent mixing of different materials that could foreseeably occur.\n\nThe above chemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is normally provided in material safety data sheets (MSDSs).\n\nInformation pertaining to the technology of the process includes the following:\n\na) Process chemistry;\nb) Maximum intended inventory\nc) Safety upper and lower limits for such items as temperatures, pressures, flows or compositions; and;\nd) An evaluation of the consequences of deviations, including those\naffecting the safety and health of employees.\n\nInformation pertaining to the equipment in the process includes:\n\na) Material of Construction;\nb) Piping and Instrument Diagrams (P&ID's);\nc) Electrical Classification;\nd) Relief System design and design basis;\ne) Ventilation System design;\nf) Design Codes and Standards employed\ng) Material and Energy Balances; and\nh) Safety systems (e.g. interlocks, detection or suppression system).\n\nProcess Hazard Analysis\n\nEpsilon has a comprehensive Process Hazard Analysis (PHA) program to help ensure that hazards associated with the process are identified and controlled.  Within this program, the process is systematically examined to identify, evaluate and control the hazards involved.\n\nEpsilon uses one or more of the appropriate analysis techniques to perform the PHA evaluations.  The PHA evaluations are performed by a team with expertise in engineering and process operations, and the team includes at least one employee who has experience and knowledge specific to the process being evaluated.  Also, one member of the team must be knowledgeable in the specific PHA methodology being used. The PHA evaluations address:  \n\na)"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 10962,
      "SummaryText": "(v) Authorization requirements for the proposed change.\n\nEmployees involved in operating and maintaining a process and contractors whose job tasks will be affected by a change in the process are informed of, and trained in, the change prior to startup of the process or affected part of the process.\n\nIf a change covered by this paragraph results in a change in the Process Safety Information, such information is updated accordingly.  If a change results in a change in the SOPs or practices, such procedures or practices are updated accordingly.\n\nPre-startup Safety Reviews\n\nEpsilon performs a Pre-Startup Safety Review for new facilities and modified facilities when the modification is significant enough to require a change in the Process Safety Information.  The Pre-Startup Safety Review shall confirm that prior to the introduction of highly hazardous chemicals to a process:\n7 Construction and equipment is in accordance with design specifications;\n7 Safety, operating, maintenance, and emergency procedures are in place and are adequate;\n7 For new facilities, a Process Hazard Analysis has been performed and recommendations have been resolved or implemented before startup, and modified facilities meet the requirements contained in management of change; and\n7 Training of each employee involved in operating a process has been completed.\n\nIncident Investigation\n\nEpsilon investigates each incident, which resulted in, or could reasonably have resulted in a catastrophic release of highly hazardous chemical in the workplace.  An Incident Investigation team shall be established and consist of at least one person knowledgeable in the process involved, including a contractor if the incident involved work of the contractor, and other persons with appropriate knowledge and experience to thoroughly investigate and analyze the incident.  Findings of the incident are documented in a report.  Epsilon promptly addresses and resolves the incident report findings and recommendations.  Resolu"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 10962,
      "SummaryText": "following a scheduled shutdown or after an emergency shutdown.  The SOPs address operating limits, safety and health considerations, and safety systems and their functions.  \n\nSOPs are readily accessible to employees who work in or maintain a process.\n\nThe SOPs are reviewed as often as necessary to assure that they reflect current operating practice, including changes that result from changes in process chemicals, technology and equipment, and changes to facilities.  Epsilon certifies annually that these SOPs are current and accurate.\n\nAdditionally, Epsilon has developed safe work practices to provide for the control of hazards during operations such as lockout-tagout, confined space entry, opening process equipment or piping, and control over entrance into a facility by maintenance, contractor, laboratory, or other support personnel.  These safe work practices apply to employees and contractors.\n\nTraining\n\nBefore operating a new or presently assigned process, each employee is trained in an overview of the process and in the SOPs as discussed earlier.   The training includes emphasis on the specific safety and health hazards, emergency operations including shutdown, and safe work practices applicable to the employee job tasks. \n \nRefresher training is provided at least every three years to each employee involved in operating a process to assure that the employee understands and adheres to the current SOPs of the process.  Epsilon, in consultation with the employees involved in operating the process,  determines the appropriate frequency of refresher training.\n\nEpsilon ascertains that each employee involved in operating a process has received and understood the required training.   Epsilon maintains records that contain the identity of the employee, the date of training, and the means used to verify that the employee understood the training.\n\nMechanical Integrity\n\nEpsilon has written procedures to maintain the on-going integrity of process equipment, including: \n\n7 P"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 10962,
      "SummaryText": "ressure vessels and storage tanks;\n7 Piping systems (including piping components such as valves);\n7 Relief and Vent System and devices;\n7 Emergency Shutdown Systems;\n7 Controls including monitoring devices and sensors, alarms, and interlocks; and \n7 Pumps and Compressors.\n\nEpsilon trains each employee involved in maintaining the on-going integrity of process equipment in an overview of that process and its hazards.  To assure that the employee can perform the job tasks in a safe manner Epsilon further trains employees in the procedures applicable to the employee's job tasks.  Inspections and tests are performed on process equipment.  Inspection and testing procedures follow recognized and generally accepted good engineering practices.  The frequency of inspections and tests of process equipment is consistent with applicable manufactures' recommendations and good engineering practices.  Inspections and tests are conducted more frequently if determined to be necessary by prior operating experience.  Epsilon documents each inspection and test that has been performed on process equipment and corrects deficiencies that are outside acceptable limits.\n\nIn the construction of new plants and equipment, Epsilon assures that equipment as it is fabricated is suitable for the process application for which they are used.  Appropriate checks and inspections are performed to assure that equipment is installed properly and consistent with design specifications and manufacturer's instructions.\n\nManagement of Change\n\nEpsilon has written procedures to manage changes (except for replacements in kind) to process chemicals, technology, equipment, procedures, and changes to facilities that affect a covered process.  The procedures are designed to assure that the following considerations are addressed prior to any change: \n(i) The technical basis for the proposed change; \n(ii) Impact of change on safety and health;\n(iii) Modifications to SOPs;\n(iv) Necessary time period for the change; and"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 10962,
      "SummaryText": "ct employer shall assure that each contract employee is instructed in the known potential fire, explosion, or toxic release hazards related to his/her job and the process and the applicable provisions of the emergency action plan.  The contract employer shall assure that each contract employee follows the safety rules of the facility.  The contract employer shall advise Epsilon of any unique hazards presented by the contract employer's work or of any hazards found by the contract employer's work.\n\nCompliance Audits\n\nTo help ensure that the accident prevention program is functioning properly, Epsilon will periodically conduct audits to confirm the procedures and practices required by the accident prevention program are being implemented. Compliance audits will be conducted at least every 3 years.  The compliance audit will be conducted by at least one person knowledgeable in the process, and a report of the findings of the audit will be developed.  Epsilon will promptly determine and document an appropriate response to each of the findings of the compliance audit, and document that deficiencies have been corrected.  Epsilon will retain the two (2) most recent compliance audit reports.\n\n1.5 Chemical-specific Prevention Steps\n\nThe processes at Epsilon have hazards that must be managed to ensure continued safe operation. The accident prevention program summarized previously is applied to all EPA RMP-covered processes at Epsilon.  Collectively, these prevention program activities help prevent potential accident scenarios of flammable substances caused by equipment failures or human errors.\n\nIn addition to the accident prevention program activities, Epsilon has safety features on many units to help (1) contain/control a release; (2) quickly detect a release; and (3) reduce the consequences of a release.  The following types of safety features are used in various processes:\n\nRelease Detection\n\n7 Hydrocarbon detectors with alarms\n\nRelease Containment/Control\n\n7 Automatic Em"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 10962,
      "SummaryText": "ergency Feed Shutdowns;\n7 Automatic and manual sprinkler systems;\n7 Centralized alarm system;\n7 Fully trained emergency response team;\n7 Communications systems (e.g., radio, emergency phones, PA system, emergency call procedures);\n7 Fire water system (e.g., hydrants, monitors, hose stations, backup firewater system); and\n7 Diking and burn pits for pyrophoric liquids.\n\n1.6 Five-year Accident History\n\nEpsilon's Garyville Plant is a new facility.  No releases of regulated substances have occurred in the last five years that have resulted in deaths, injuries, or significant property damage on site, or known deaths, injuries, evacuations, sheltering-in-place, property damage, or environmental damage off site.\n \n1.7 Emergency Response Program Information\n\nEpsilon maintains a written Emergency Response Plan (ERP), which aims to protect employees, public health, and the environment.  The purpose of the ERP is to minimize the impact on the facility and surrounding areas in the event of an emergency situation.  The plan consists of procedures for responding to emergencies such as fires or flammable vapor releases, medical emergencies,  hurricanes, tornadoes, power outages, radiological emergencies and bomb threats. The plan addresses all aspects of emergency response including responsibilities of the Emergency Response Team, coordination of clean-up activities with mutual aid organizations (fire department, sheriff's office, hospital), timely notification of authorities, maintenance of proper documentation, and guidelines for compliance with applicable government regulations.  Furthermore, Epsilon has procedures that address proper use, maintenance, inspection, and testing of emergency response equipment.  All employees receive annual safety training to instruct them in proper emergency response procedures.  The Emergency Response Team participates in additional training sessions so that they can safely handle potential emergency situations.  The ERP for Epsilon was submitted"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 10962,
      "SummaryText": "tions and corrective actions are documented.  The report is reviewed with all affected personnel whose job tasks are relevant to the incident findings including contract employees where applicable.  Incident Investigation reports are retained for five years.\n\nHot Work Permits\n\nEpsilon uses a Hot Work Permit System for hot work operations conducted on or near a covered process.  The permit is designed to document that the fire prevention and protection requirements in 29 CFR 1910.252 (a) have been implemented prior to beginning the hot work operations.  The permit is kept on file for one year.\n\nContractors\n\nEpsilon uses contractors to supplement its work force during periods of increased maintenance or construction activities.  Epsilon has procedures in place to ensure that contractors (1) perform their work in a safe manner; (2) have the appropriate knowledge and skills; (3) are aware of the hazards in their workplace; (4) understand what they should do in the event of an emergency; (5) understand and follow site safety rules; and (6) inform Epsilon personnel of any hazards that they find during their work.\n \nWhen selecting a contractor, Epsilon obtains and evaluates information regarding the contract employer's safety performance and programs. Epsilon informs contract employers of the known potential fire, explosion, or toxic release hazards related to the contractor's work and the process and explains to contract employers the applicable provisions of the emergency action plan.  Epsilon has developed safe work to control the entrance, presence and exit of contract employers and contract employees in covered process areas.\n\nEpsilon periodically evaluates the performance of contract employers and maintains a contract employee injury and illness log related to the contractors work in process area.\n\nIt is Epsilon's policy that the contract employer assures that each eontract employee is trained in the work practices necessary to safely perform his/her job.  The contra"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 10962,
      "SummaryText": "to the St. John the Baptist Parish Local Emergency Planning Committee (LEPC). \n\nIn order to keep the plan up to date, the emergency response procedures are reviewed annually.  A Review Committee consisting of the Safety & Health Manager, Operations Manager, Maintenance Manager, Human Resources Manager, Engineering Manager, Environmental Engineer, the appointed Fire Chief and Assistant Fire Chief will review all proposed modifications.  Any changes implemented are updated in the ERP.  Affected personnel are trained with regards to the changes in the ERP.\n\n1.8 Planned Changes to Improve Safety\n\n7 Establish emergency response plan for hazards posed by neighboring refinery;\n7 Evaluate lightning protection for plant site;\n7 Consider providing fire safe design for Ethylene supply valve and H2 ESD valve;\n7 Consider locating one or more gas detectors to cover the location of the propylene transfer pumps;\n7 Consider installation of additional instrumentation to monitor/protect the propylene transfer pump; \n7 Consider installation of local alarm at the propylene storage tank area to indicate any emergency plant wide.\n7 Epsilon maintains a safety suggestion program to continue to improve safety; and\n7 Epsilon is preparing to enter OSHA's Voluntary Protection Program with a voluntary commitment to the highest safety standards."
    }
  ]
}