{
  "FacilityID": 11010,
  "FacilityName": "Gilmore Gas Plant",
  "FacilityStr1": "24 Miles NW of Edinburg on FM681",
  "FacilityStr2": null,
  "FacilityCity": "McCook",
  "FacilityState": "TX",
  "FacilityZipCode": "78539",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48215",
  "LEPC": "Hidalgo County LEPC",
  "FacilityLatDecDegs": "26.420278",
  "FacilityLongDecDegs": "-98.341389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "pawelekm@pge-texas.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "PG&E Hydrocarbons, L.P.",
  "Company2Name": "PG&E Gas Transmission, Texas Corporation",
  "CompanyDUNS": 836434290,
  "Company2DUNS": 7924798,
  "OperatorName": "PG&E Hydrocarbons, L.P.",
  "OperatorStr1": "1020 Northeast Loop 410",
  "OperatorStr2": "Suite 700",
  "OperatorCity": "San Antonio",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78209",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000078729",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-00876",
  "SafetyInspectionDate": "1999-04-06 00:00:00",
  "SafetyInspectionBy": "Texas Railroad Commission",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-12-13 00:00:00",
  "DeRegistrationEffectiveDate": "2021-12-09 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 26.42028,
  "FRS_Long": -98.34139,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 14326,
      "AltID": null,
      "FacilityID": 11010,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 17415,
          "ProcessID": 14326,
          "ChemicalID": 155,
          "Quantity": 210000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 8571,
              "ProcessChemicalID": 17415,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 8572,
              "ProcessChemicalID": 17415,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 8573,
              "ProcessChemicalID": 17415,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 8574,
              "ProcessChemicalID": 17415,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14678,
          "ProcessID": 14326,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 7129,
              "Process_NAICS_ID": 14678,
              "SafetyReviewDate": "1997-01-20 00:00:00",
              "PHA_Date": "1997-01-20 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1997-05-01 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 1,
              "MH_OtherType": "High Vibration, control malfunction, flame failure, low flow",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "gas detection, vibration monitors, low flow shutdown, flame failure, high temperature shutdown, overspeed shutdown, low and high pressure shutdown, ESD system",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "gas detection system",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-01-15 00:00:00",
              "TrainingReviewDate": "1998-12-12 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-16 00:00:00",
              "EquipmentInspectionDate": "1999-04-23 00:00:00",
              "EquipmentTested": "safety system alarms and shutdowns",
              "ChangeMgmtDate": "1999-01-20 00:00:00",
              "ChangeMgmtReviewDate": "1998-11-01 00:00:00",
              "PreStartupReviewDate": "1998-10-08 00:00:00",
              "ComplianceAuditDate": "1998-05-07 00:00:00",
              "AuditCompletionDate": "1998-10-05 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-11-01 00:00:00",
              "HotWorkPermitReviewDate": "1998-02-18 00:00:00",
              "ContractorSafetyReviewDate": "1998-03-15 00:00:00",
              "ContractorSafetyEvalDate": "1998-10-12 00:00:00",
              "CBI_Flag": 0,
              "Description": "The PSM program is discussed in the Executive Summary.",
              "_chemicals": [
                {
                  "PrimaryKey": 9477,
                  "PreventionProgram3ID": 7129,
                  "ProcessChemicalID": 17415
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11010,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-01-26 00:00:00",
    "ERTrainingDate": "1999-01-26 00:00:00",
    "CoordinatingAgencyName": "Hidalgo County LEPC",
    "CoordinatingAgencyPhone": "9569692514",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11010,
      "SummaryText": "                                                                     Risk Management Plan\n                                                                       Executive Summary\n                                                                            Gilmore Plant\n                                                              PG&E Hydrocarbons, L.P.(\"PG&E\") \n                                                                                  \n The Gilmore Gas Plant has a long-standing commitment to employee and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes.  PG&E's  policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur trained gas plant personnel and emergency personnel (when appropriate), will respond to control and contain the release to ensure the safety of the public and our employees.\n \n The Gilmore Gas Plant, located 24 miles northwest of Edinburg in Hidalgo County Texas, operates processes to extract liquid petroleum products from the natural gas stream. This liquid product consists of ethane, propane, butane, and natural gasoline, which are regulated flammable substances. In order to establish as safe an environment as possible for our employees and the public, PG&E has elected to maintain minimum inventories (below the threshold quantity) of toxic substances. \n \n The Worst Case Scenario (WCS) associated with a release of flammable substances in Program 3 processes at the gas plant is a Vapor Cloud Explosion (VCE) involving the full inventory of the surge tank containing 130,000 lbs. of C2+ with ethane being the largest constituent.  The maximum distance to the 1-psi over pressure endpoint for this WCS is 0.41 miles or 2145 feet. Although PG&E has numerous controls to prevent such releases and to manage their"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11010,
      "SummaryText": " consequences, no credit for passive and/or active mitigation measures was taken into account in evaluating this WCS.\n \n The surge tank was built and installed to ASME Pressure Vessel Code Section VIII Standards.  It is equipped with a Pressure Safety Valve (PSV). The PSV and all other safety devices are function tested once per calendar year not to exceed 15-month intervals. These tests are conducted as a part of the mechanical integrity element of PG&E's PSM program, which the plant has had in place for the past several years.  Ultrasonic testing is also performed on non-insulated piping and vessels in the plant to determine that the wall thickness of the piping and vessels meets service requirements.\n \n An Alternate Release Scenario (ARS) for flammable substances at the gas plant is a VCE resulting from a 245 lbs. one-minute release of C2+, with ethane being the main constituent, which could result from a seal failure at the product pumps.  Such a release is expected to be isolated by an automatic shutdown valve within one minute (active mitigation).  This valve would receive a signal to close from a gas detection system with monitors located in the pump area. The maximum distance to the 1-psi overpressure endpoint for this event is 0.05 mile or 270 feet.  This event was selected as being a practical scenario for use in emergency planning and response.  \n \n The gas detection system, the automatic shutdown valve and other safety devices are function tested once per calendar year not to exceed 15-month intervals. These tests are a part of the mechanical integrity of our PSM program, which has been in place for several years. \n \n The following is a summary of the accident prevention program in place at the plant. Because processes at the plant are regulated by Occupational Safety and Health Administration's (OSHA's) Process Safety Management (PSM) standard, they are also subject to the Environmental Protection Agency's (EPA's) Risk Management Program (RMP) regulatio"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11010,
      "SummaryText": "n. This summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.\n \n Employee Participation\n \n PG&E gas plant employees participate in all facets of PSM and accident prevention.  Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a process hazard analysis (PHA) team.  Employees have access to all information created as part of the gas plant accident prevention program.  Specific ways that employees are involved in the accident prevention program and how the 14 elements of the PSM standard are being addressed is included in the PSM Policy and Implementation Plan which is maintained at the plant.  In addition, the gas plant has initiatives under way that address process safety and employee safety issue.  These initiatives include individual safety awards presented for safety excellence during the previous year.\n \n Process Safety Information\n \n The Gilmore Gas Plant has a variety of technical documents that are used to help maintain safe operation of the processes.  These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information.  Plant management is responsible for maintaining up-to-date process safety information. This information is always readily available to the employees. \n \n Chemical-specific information, including exposure hazards and emergency response/ exposure treatment considerations, is provided in Material Safety Data Sheets (MSDS).  This information is supplemented by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals.  For specific process areas, the gas plant has documented safety-related limits for specific process parameters (e.g., temperature, level, pressure) in a Cause"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11010,
      "SummaryText": " & Effect Diagram. The gas plant ensures that the process is maintained within these limits using process controls, monitoring instruments, trained personnel, and protective instrument systems (e.g., automated shutdown systems).\n \n The gas plant also maintains plant job books, Piping and Instrument Drawings (P&ID's) and electrical classification drawings, that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment. This information, in combination with written procedures and training, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n \n Process Hazard Analysis (PHA)\n \n The Gilmore Gas Plant has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled.  Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n \n The gas plant primarily uses the Hazard and Operability (HAZOP) analysis technique to perform these evaluations. HAZOP analysis is recognized as one of the most systematic and thorough hazard evaluation techniques. The analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise. This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures. The team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures may be necessary. \n \n The PHA team findings are forwarded to local and corporate management for resolution. All approved mitigation options in response to PHA team findings are tracked until they are completed.  The final resolution of eac"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 11010,
      "SummaryText": "h finding is documented and retained.\n \n To help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the plant periodically updates and revalidates the hazard analysis results.  These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating.  The results and findings from these updates are documented and retained.  Once again, the team findings are forwarded to management for consideration, and the final resolution of the findings is documented and retained.\n \n Operating Procedures\n \n The Gilmore Gas Plant maintains written procedures that address various modes of process operations, such as: (1) initial startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) start-up following a turnaround or emergency shut down.  These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.  These procedures are periodically reviewed and annually certified as current and accurate.  The procedures are kept current and accurate by revising them as necessary to reflect changes made through the management of change process.  \n \n In addition, the gas plant maintains a Cause and Effect Diagram that provides information on how each of the process equipment will react to upper or lower limit exceedances for specific process or equipment parameters.  This information, along with written operating procedures, is readily available to operators in the process unit and for other personnel to use as necessary to safely perform their job tasks.\n \n Training\n \n To complement the written procedures for process operations, the gas plant has implemented a comprehensive training program for all employees involved in operating processes.  New employees receive initial training in gas plant operations if they are not alr"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 11010,
      "SummaryText": "eady familiar with such operations.  Upon successfully completing this training, a new operator works with a senior operator to learn process-specific duties and tasks.  After operators demonstrate (e.g., through written tests, and skills demonstration) having adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently. In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  This refresher training is conducted at least every 3 years.  All of this training is documented for each operator, including the means used to verify that the operator understood the training.\n \n Contractors\n \n The Gilmore Gas Plant uses contractors to supplement its workforce during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipment, the gas plant has procedures in place to ensure that contractors: (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site safety rules, and (6) inform gas plant personnel of any hazards that they find during their work.  This is accomplished prior to their beginning work by providing contractors with: (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices.  In addition, the plant evaluates contractor safety programs and performance during the selection of a contractor.  Gas plant personnel periodically monitor contractor performance by use of the contractor evaluation form to ensure that contractors are fulfilling their safety obligations.\n \n Pre-startup Safety Reviews (PSSR)\n \n The Gilmore Gas Plant conducts a PSSR for any new facility or facility modification that r"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 11010,
      "SummaryText": "equires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides one additional check to ensure construction was done in accordance with the design specifications and that all-supporting systems are operationally ready.  The PSSR review team uses checklists (Form 736) to verify all aspects of readiness.  A PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\n \n Mechanical Integrity\n \n The Gilmore Gas Plant has well-established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition.  The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures.  In combination, these activities form a system that maintains the mechanical integrity of the process.\n \n Maintenance personnel receive training in: (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their jobs in a safe manner.  Written procedures help ensure that work is performed in a consistent manner and provide a basis for training.  Inspections and tests are performed to help ensure that equipment functions as intended and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels).  If a deficiency is identified, employees will take appropriate actions as to ensure safe operation of the equipment.  \n \n A"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 11010,
      "SummaryText": "nother integral part of the mechanical integrity program is quality assurance.  The plant incorporates quality assurance measures into equipment purchases and repairs. This helps ensure that new equipment is suitable for its intended use and that proper material and spare parts are used when repairs are made. \n \n Safe Work Practices\n \n The Gilmore Gas Pplant has long-standing safe work practices in place to help ensure worker and process safety. Examples of these include: (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for the safe removal of hazardous substances before process piping or equipment is opened, (4) a permit and safety procedure to control spark-producing activities (i.e., hot work), and (5) a permit and safety procedure to ensure that adequate precautions are in place before entry into a confined space.  These procedures and others, along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\n \n Management of Change (MOC)\n \n The Gilmore Gas Plant has a comprehensive system to manage changes to all covered processes.  This system requires that changes to items such as process equipment, chemicals, technology (including process-operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to: (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change.  All operators and/or affected employees must review, understand and sign the MOC (Form 703) prior to starting his/her shift. Affected chemical hazard information, process operating limits, and equipment information, as well as procedures are updated to incorporate these changes.  In addition, operating and maintenance personne"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 11010,
      "SummaryText": "l are provided any necessary training on the change.\n \n Incident Investigation\n \n Incidents that resulted in, or reasonably could have resulted in, a fire/explosion, gas release, major property damage, environmental damage, or personal injuries are promptly investigated. The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident. The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to gas plant management for resolution. Corrective actions taken in response to the investigation team's findings and recommendations are tracked until they are complete.  The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings.  This information is communicated to other company employees in other plants by way of the PSM News Brief.  Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHAs and PHA revalidations. \n \n Compliance Audits\n \n To help ensure that the accident prevention program is functioning properly, the Gilmore Gas Plant personnel periodically conduct an audit to determine whether the procedures and practices required by the accident prevention program are being implemented. Compliance audits are conducted at least every 3 years.  Both hourly and staff personnel participate as audit team members.  The audit team develops findings that are forwarded to gas plant management for resolution.  Corrective actions taken in response to the audit team's findings are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained.  \n \n CHEMICAL SPECIFIC PREVENTION STEPS\n \n The processes at the Gilmore Gas Plant must be managed to ensure continued safe opera"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 11010,
      "SummaryText": "tion. The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility:\n \n Universal Prevention Activities\n \n The accident prevention program (Process Safety Management) summarized previously is applied to all RMP-covered processes at the Gilmore Gas Plant. Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n \n Specialized Safety Features\n \n The Gilmore Gas Plant has safety features on many units to help: (1) quickly detect a release, (2) contain/control a release, and (3) reduce the consequences of (mitigate) a release.  The following types of safety features are used in the covered processes:\n \n Release Detection\n \n1.  Hydrocarbon detectors with alarms.\n\n2.  Low pressure alarms and shutdowns.\n\nRelease Containment Control\n \n 1. Process relief valves that discharge to a flare to capture and incinerate episodic releases.\n \n 2.  Valves to permit isolation of the process (manual or automated).\n \n 3.  Automated shutdown systems for specific process parameters (e.g., high  temperature, high pressure).\n \n 4.  Curbing or diking to contain liquid releases.\n \n 5. Redundant equipment and instrumentation (e.g., uninterruptable power supply for process control system).\n \n 6.  Atmospheric relief devices to protect pressure vessels.\n \n Release Mitigation\n \n 1. Fire suppression and extinguishing systems. \n \n 2. Trained employees to effectively respond to an emergency.\n \n FIVE-YEAR ACCIDENT HISTORY\n \n The Gilmore Gas Plant has an excellent record of accident prevention over the past 5 years. There has been a decreasing trend in the frequency of accidental releases. None of the accidental releases that have occurred in the past 5 years resulted in offsite effects. The accidental releases, which occurred at the plant, did not result in an explosion or fire due to active mitigation devices in place.   We "
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 11010,
      "SummaryText": "also investigate every incident carefully to determine ways to prevent similar incidents from recurring. No RMP reportable incidents have occurred during the past 5 years.\n  \n EMERGENCY RESPONSE PROGRAM INFORMATION\n \n The Gilmore Gas Plant maintains a written emergency response program, which is in place to protect worker and public safety, as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public, and a post incident review.  In addition, the plant has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is updated when necessary based on modifications made to gas plant processes or other plant facilities.  The emergency response program changes are administered through the (MOC) process, which includes informing and/or training affected personnel in the changes.\n \n The overall emergency response program for the Gilmore Gas Plant is coordinated with the Hidalgo County, Texas Local Emergency Planning Committee (LEPC).  This coordination includes local emergency response officials, local government officials, and industry representatives.  The plant has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department). This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 11010,
      "SummaryText": " to an incident.  In addition to periodic LEPC meetings, the plant conducts periodic emergency drills that involve the LEPC and emergency response organizations. The plant provides annual refresher training to local emergency responders regarding the hazards of regulated substances in the plant.\n \n  PLANNED CHANGES TO IMPROVE SAFETY\n \n The Gilmore Gas Plant resolves all findings from PHAs, some of which result in modifications to the process.  The following types of changes are planned over the next few years in response to PHA, safety audit, and incident investigation findings:\n \n7 Revisions to personnel training programs.\n7 Continue the ongoing project of installing tandem seals on product pumps.\n7 Continue to foster the open communication employees have with management."
    }
  ]
}