{
  "FacilityID": 11017,
  "FacilityName": "Third Creek Compressor Station",
  "FacilityStr1": "24100 East 104 th Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Denver",
  "FacilityState": "CO",
  "FacilityZipCode": "80249",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08031",
  "LEPC": "Denver LEPC",
  "FacilityLatDecDegs": "39.883889",
  "FacilityLongDecDegs": "-104.700833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": "jreale@mtpower.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "North American Resources Company",
  "Company2Name": "Montana Power Company",
  "CompanyDUNS": 940917230,
  "Company2DUNS": 102367307,
  "OperatorName": "North American Resources Company",
  "OperatorStr1": "16157 Weld County Road 22",
  "OperatorStr2": null,
  "OperatorCity": "Ft. Lupton",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80621",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000080191",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-12-09 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2001-12-24 00:00:00",
  "DeRegistrationEffectiveDate": "2001-09-06 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.88497,
  "FRS_Long": -104.64021,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 14341,
      "AltID": "Natural Gas Liquid Storag",
      "FacilityID": 11017,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 17439,
          "ProcessID": 14341,
          "ChemicalID": 155,
          "Quantity": 150000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 8593,
              "ProcessChemicalID": 17439,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 8594,
              "ProcessChemicalID": 17439,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 8595,
              "ProcessChemicalID": 17439,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 8596,
              "ProcessChemicalID": 17439,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14693,
          "ProcessID": 14341,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11017,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-09 00:00:00",
    "ERTrainingDate": "1999-04-02 00:00:00",
    "CoordinatingAgencyName": "Denver Fire Department",
    "CoordinatingAgencyPhone": "3036405522",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11017,
      "SummaryText": "This executive summary is a brief overview of the Risk Management Program and the associated policies at the North American Resources Company (NARCO) Third Creek Compressor Station Facility.\n\nLocation and Status\nThe Third Creek Compressor Station is located on approximately 10 acres of NARCO land in the northwest quadrant  of Denver International Airport (DIA).  It is approximately 7,000 feet inside the western DIA property line and approximately 1 mile west of the north part of runway 16L which is currently being used.  It is about 3,000 feet west of runway 16C which is under construction as part of the Phase 1 expansion of the airport.  At this time this part of DIA is not being used, but the DIA long range plans (Draft) show DIA will need this land for their future expansions.  NARCO management is currently having meetings with DIA Planning and Development personnel concerning the movement of the Compressor Station from the DIA area.  Montana Power Company Engineers are finalizing a study to determine the best alternative for the move.  It may be the best alternative is to distribute some of the compressors presently at Third Creek Compressor Station to other compressor stations on the NARCO system, and not have a Third Creek Compressor Station, on or off of DIA. On June 2, 1999 NARCO  informed the Denver Fire Department that the closure of the present operations at the Third Creek Compressor Station should begin in the next sixty days and will be finished in six months.\n\nHistory and Ownership\nThe Third Creek Compressor Station was originally owned by Koch Hydrocarbons, who operated it as a gas (fractionation) processing plant.  Koch sold their plant to Vessals who later sold it to North American Resources Company (NARCO) on 22 April 1997.  Since the time Koch operated the plant the gas processing part of the plant has been decommissioned and much of the equipment removed.  NARCO does no gas processing at Third Creek and only uses the facility as a compressor sta"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11017,
      "SummaryText": "tion.\n\nProgram Level\nNARCO has determined that Program Level 1 applies to the Third Creek Compressor Station since it has a documented safety program which has been coordinated with the Denver Fire Department and has had no accidental release of the regulated substance (NGL) that directly or indirectly caused a death, injury,or response or restoration activity for an \"environmental receptor\" in the previous five years.  The only significant accident occurred May 3, 1995 when Koch Hydrocarbons owned the facility.  In this incident NGL was not involved.  There were no known offsite deaths, injuries, property damage, environmental damage, or evacuations, or sheltering in place.  Also, the facility's distance to a \"public receptor\" is greater than the distance to  the calculated endpoint for the worst-case scenario of 0.40 miles. \n\nPrevention and Response Policies\nThe accidental release prevention and emergency response policies are represented in the Emergency Response Plan manual (rev. 1, dated April 9 1999) and the Emergency Planning and Response Sections of the Third Creek PSM/RMP manual for the natural gas compression and the storage of natural gas liquids and condensate. The Emergency Response Plan manual has been coordinated with the Denver Fire Department.   NARCO takes an active role in preventing accidental releases at all of its facilities by ensuring that its employees are properly trained in the safe operation of covered processes and the safe handling of regulated chemicals.  As for emergency response, NARCO has established and maintained procedures for emergency notification and response.  These are reviewed with employees on a periodic basis and revised to accommodate changes in staffing when they occur.\n\nNARCO management understands its duty to provide a safe working environment and to take measures to prevent accidents that may have an effect on the surrounding community.  This understanding is reflected in procedures described and referenced in the PS"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11017,
      "SummaryText": "M/RMP manual.  \n\nStationary Source and Regulated Substances\nThe Third Creek Compressor Station is a natural gas compression (and NGL storage) facility that uses six compressors (three in the low pressure compressor building and three in the high pressure compressor building) to increase the pressure of approximately 12 MMSCFD (million standard cubic feet per day) of natural gas to an average of 490 PSIA at between 60 degs. F and 100 degs. F, depending on ambient conditions. The Third Creek Compressor Station is designed to process a maximum of 25 MMSCFD of natural gas.  The purpose of the Third Creek Compressor Station is to increase the pressure of the gas being transported in the pipelines and to reduce the dew point of the gas to a level that is acceptable for pipeline transmission.  Control of the dew point is critical since the incoming gas contains moisture (water and heavy hydrocarbons).  The amount of moisture in the gas varies from day to day depending on a great number of variables at the various wells.  The dew point increases as the concentration of moisture (water and heavy hydrocarbons) in the inlet gas increases.  As gas flows through the pipeline, its temperature will decrease to about the same temperature as the surrounding environment.  If this temperature is below the dew point of the gas, the water and heavy hydrocarbons will tend to condense.  The resulting buildup of hydrates can begin to restrict gas flow, particularly at orifices and bends in the pipe.  In extreme cold, the hydrates may even form a potentially dangerous ice plug.\n\nThe increasing of the pressure of the gas by the compressors causes some of the naturally occurring hydrocarbons, ( in the vapor phase of the inlet gas stream) to condense out of the gas stream.  In order to further reduce the dew point of the gas (minimize the formation of hydrates), the inlet gas is put through a Liquid Slug Catcher, and/or scrubbers and dehydration towers to remove moisture.  All of this allows t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11017,
      "SummaryText": "he heavy hydrocarbons and water to condense out of the gas and lower the dew point of the gas.  These raw natural gas liquids (NGL) are stored in three 30,000 gallons pressurized bullet-type storage tanks until there is a sufficient volume to be pumped into a tank truck for transportation to the NARCO Ft. Lupton Plant for processing into marketable products.  On a typical day, an average of 20,000 gallons of raw NGL are stored at the Third Creek Compressor Station.  NARCO sends a tank truck to transport the NGL to the Ft. Lupton Plant before the volume reaches half of the storage capacity.  The Tank truck is sent to the Third Creek Station two or three times each week. \n\nThe flammability and volume of the raw NGL stored at the Third Creek Compressor Station triggered coverage under the OSHA PSM Standard and the EPA RMP Rule.\n\nThe PSM/RMP-regulated substance handled at this facility is raw NGL.  Following is a breakdown of the locations of these materials at the Third Creek Compressor Station:\n\n3 NGL Storage Tanks:            Maximum total Volume =72,000 gallons       Maximum Weight = 364,320 lbs.\n                                              \nThe storage  system for raw NGL is the only covered process at this time at the Third Creek Compressor Station.  The balance of the Station is regulated under DOT Pipeline Safety regulations Parts 190-199.\n\nFilling of the tanks is administratively limited to 80% of the tank capacity by NFPA 58 requirements, as corrected for facility elevation.\n\nRelease Scenarios\nWorst-case release scenario has been determined after careful review of the regulation and consideration of the storage vessel configuration at the facility.  For worst-case release scenario, the regulation is clear.  The assumption is that the single largest container of a regulated substance (the raw NGL storage tank or 120,000 pounds of NGL) is released over a ten-minute period.  No active mitigation may be considered.  Worst-case meteorological conditions are also a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 11017,
      "SummaryText": "ssumed to be present.  Reference Table 9 of the RMP Offsite Consequence Analysis (OCA) Guidance (dated May 24, 1996) was used to determine the distance to overpressure of 1.0 psi for a vapor cloud explosion of hydrocarbon product.  A distance of 0.4 miles to the flammable endpoint was determined for a release of 120,000 pounds in ten minutes.  The RMP*Comp model also predicted the same distance to the flammable endpoint.\n\nPrevention Steps for raw NGL\nThe prevention program and chemical-specific prevention steps are described in detail in the Third Creek Compressor Station PSM/RMP manual.  The prevention program includes:\n7 Employee participation, which includes provisions for active participation by NARCO (and appropriate KN Energy)  employees in the development and implementation of the facility PSM/RMP program, as well as ready access to program information.  \n7 Process safety information, which has been collected in the pipeline office and is summarized in the PSM/RMP manual.\n7 Process hazard analyses (PHAs) - The initial PHA for the Third Creek Compressor Station was conducted 03/19/95 when the facility was owned by Koch Hydrocarbons Inc.  All recommendations from the PHA have been, addressed.\n7 Operating procedures for the facility operations. \n7 Training for all personnel involved in the operation and maintenance of the plant operations.\n7 Contractor management policy.\n7 Pre-startup safety review procedure for implementation for significant system changes to ensure that the construction and equipment installation is according to design specifications, appropriate procedures are in place and accurate, a PHA has been done and the recommendations resolved, and employees are trained .\n7 Mechanical integrity program to ensure that the system equipment is maintained in good and safe working condition.  Facility personnel conduct daily visual inspections of the system. \n7 Hot work procedures to require controls as specified in the Gas Standards Manual before hot work"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 11017,
      "SummaryText": "is performed on the NGL system.\n7 Management of change program to ensure that proposed system changes are comprehensively evaluated before implementing the change.\n7 Incident investigation procedures for the investigation of any catastrophic (or potentially catastrophic) incident associated with the NGL system.\n7 Compliance audits to be conducted at least once every three years to ensure the continued compliance of the Third Creek PSM/RMP program.  \n\nAccident History\nDuring the last five years there have been no accidents that meet the criterion for inclusion in this submittal.\n\nEmergency Response Program\nThis facility has established and maintains an emergency response program that is coordinated with local response agencies.  The program is described in detail in the Emergency Reponse Plan manual and the  Emergency Planning and Response section of the PSM/RMP compliance manual and meets the requirement of 40 CFR 68.95.  The goals of the program are to protect onsite employees (including KN Energy contract personnel) from the hazardous effects of chemical releases and to minimize the effects of releases on the general public.  The program is routinely reviewed and updated to reflect personnel and regulatory changes.\n\nPlanned Changes for Improved Safety\nIdeas for changes to improve safety are actively sought from employees (including contract personnel).  Employee safety meetings that focus on chemical safety issues are held regularly at this facility.  Employees are encouraged and trained to recognize hazards and present ideas to eliminate them or to minimize the potential consequences of those hazards."
    }
  ]
}