{
  "FacilityID": 11082,
  "FacilityName": "Missouri River Wastewater Treatment Plant",
  "FacilityStr1": "5600 South 10th Street",
  "FacilityStr2": null,
  "FacilityCity": "Omaha",
  "FacilityState": "NE",
  "FacilityZipCode": "68107",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31055",
  "LEPC": "Douglas County LEPC",
  "FacilityLatDecDegs": "41.208333",
  "FacilityLongDecDegs": "-95.928889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Omaha Public Works Department",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Omaha Public Works Dept.",
  "OperatorStr1": "5600 South 10th Street",
  "OperatorStr2": null,
  "OperatorCity": "Omaha",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68107",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jim Swan",
  "RMPTitle": "Facilities/Plant Manager",
  "FTE": 104,
  "OtherEPAFacilityID": "NE0036358",
  "EPAFacilityID": "100000086131",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0118MA",
  "SafetyInspectionDate": "1995-06-29 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-08-29 00:00:00",
  "DeRegistrationEffectiveDate": "2007-08-20 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.20219,
  "FRS_Long": -95.92999,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 14509,
      "AltID": "Chlorine Storage Building",
      "FacilityID": 11082,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 14866,
          "ProcessID": 14509,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 17689,
          "ProcessID": 14509,
          "ChemicalID": 62,
          "Quantity": 44000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 517689,
          "ProcessID": 14509,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 14510,
      "AltID": "Chlorine Disininfection",
      "FacilityID": 11082,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 14867,
          "ProcessID": 14510,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 17690,
          "ProcessID": 14510,
          "ChemicalID": 62,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 517690,
          "ProcessID": 14510,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 14511,
      "AltID": "Digester Gas Storage",
      "FacilityID": 11082,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 14868,
          "ProcessID": 14511,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 17691,
          "ProcessID": 14511,
          "ChemicalID": 93,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 93,
            "ChemicalName": "Methane",
            "CASNumber": "74-82-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 517691,
          "ProcessID": 14511,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11082,
      "SummaryText": "The City of Omaha Public Works Department operates the Missouri River Wastewater Treatment Plant for the treatment of domestic and industrial wastewaters in the Omaha, Nebraska metropolitan area.  As part of the wastewater treatment process, two 112(r) regulated chemicals are stored and/or used on-site:  chlorine and digester gas (methane).  Chemical and flammable hazards are taken seriously by city officials and plant operations staff.  These hazards are communicated on a yearly basis to employees during training sessions.\nChlorine is used in two separate processes, storage building and chemical feed process (disinfection).  These processes were separated because the storage building is physically separated from the feed area and is not a completely enclosed building.  The chemical feed process is a completely enclosed building.  Chlorine is used as a disinfectant for wastewater effluent prior to discharge.  Disinfection of the wastewater is required by the NPDES permit between April 15 and September 30 of each calendar year.  It controls bacteria levels when wastewater effluent enters rivers during public recreation periods.  Chlorine is brought into the facility in one-ton steel cylinders.  The cylinders are connected to a manifold where chlorine gas is drawn off to the chlorinators.  From the chlorinators, chlorine saturated water is mixed with the plant's wastewater in the chlorine contact basin.\nDigester gas is generated as a by-product during the anaerobic digestion process of wastewater treatment.  It is comprised of approximately 70% methane and 30% carbon dioxide.  Due to the flammability of digester gas, it is used as a natural gas substitute for fuel in engine generators across the treatment plant.\nSince both chemicals are used above their regulated quantities, worst-case release scenarios were considered.  The worst-case release analysis for both chlorine regulated processes indicated that each release has off-site impacts.  For the chlorine storage bui"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11082,
      "SummaryText": "lding, the worst-case release involved a one-ton cylinder, the largest single vessel.  For the chlorine feed process, the worst-case release also involved a one-ton cylinder, but a building enclosure encompassing the feed process reducing the release rate by 55%.  The worst-case analysis for these processes are unlikely since they assume a complete failure of the storage cylinder and the entire contents are released in a period of ten minutes.  This would approximately correspond to a 3 inch hole, which is not probable.  The alternative-case releases were also analyzed for both chlorine processes.  It was determeined that both processes have off-site impacts.  Due to the mechanical nature of chlorine cylinders, one of the more probable failure points is the gas valve.  As with the worst-case, the feed process alternatve-case analysis was completed using a building enclosure that reduces the release rate by 55%.  The storage building, which is not considered enclosed did not use this release mitigation factor.\nThe digester gas worst-case release scenario indicated that off-site impacts were present.  Three separate storage vessels are used for gas storage:  low pressure cylinder, high pressure sphere and low pressure bladder (currently proposed in an existing digester).  The largest of these vessels was used in the worst-case analysis.  Since the total gas quantity is a function of storage pressure, the high pressure sphere is the largest vessl with 9,400 pounds.  An alternative-case release scenario was also completed for digester gas.  This scenario, a vapor cloud fire, did not have off-site impacts, the impact area was limited to on-site receptors.\nFor both the chlorine and digester gas processes, a Prevention Program was developed in accordance with 112(r).  Prior to the 112(r) rule implementation, plant operators maintained operation and maintenance procedures, and conducted yearly training sessions discussing chemical hazards and proper process operations.  Thi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11082,
      "SummaryText": "s information was compiled into a formal document for plant operation use.  Preventing accidental releases is begins at how the process is operated and maintained.  Following recommended operations and maintenance checks, most potential releases will be avoided.  Operating procedures, training programs and maintenance will be reviewed on a regular basis in order to continually improve prevention practices.  No accidental releases of chlorine or digester gas that qualify in a five-year accident history have occurred.  This again is proof that preventative measures, when used correctly, will prevent most releases.\nPlant operators will not respond directly to accidental releases, therefore, the Omaha Fire Department (OFD) will respond.  Chlorine releases and digester gas fires/explosions will be handled by OFD and their hazardous materials team.  For chlorine, detection systems are installed to sense the presence of chlorine gas.  During chlorine alarm activation, the OFD will be notified to allow them to mobilize on-site in the case of a major release.  Digester gas notifications are not as complicated as chlorine.  If a fire or potential explosive gas cloud occurs in or around the gas storage vessels, the OFD will be contacted.  Coordination with the OFD has taken place and will continue in the future for response expectation discussions, develop familiarity of the site and conduct response training drills.\nNo significant changes to the chlorine or digester gas processes, or prevention practices are expected at this time.  Both regulated chemicals are common in municipal wastewater treatment.  Chlorine is necessary for disinfecting wastewater.  If this activity does not take place, a significant rise in diseases, infections and illnesses would probably occur to those who use the Missouri River for recreational activities and as a source of drinking water downstream of the Missouri River treatment plant.  Digester gas cannot be avoided since it is a result of organic "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11082,
      "SummaryText": "decomposition in wastewater.  This gas is used as an energy source at various plant locations."
    }
  ]
}