{
  "FacilityID": 11242,
  "FacilityName": "Pacific Enterprises SW Lake Boeuf Facility",
  "FacilityStr1": "Babin Rd. 2 miles from Hwy. 308",
  "FacilityStr2": null,
  "FacilityCity": "Theriot",
  "FacilityState": "LA",
  "FacilityZipCode": "70394",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22057",
  "LEPC": "Lafourche Parish LEPC",
  "FacilityLatDecDegs": "29.759889",
  "FacilityLongDecDegs": "-90.643722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "The Meridian Resource & Exploration Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "The Meridian Resource & Exp Co",
  "OperatorStr1": "15995 N. Barkers Landing, Suite 300",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77079",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000101702",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-09-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 29.75989,
  "FRS_Long": -90.64372,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 14979,
      "AltID": null,
      "FacilityID": 11242,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 18672,
          "ProcessID": 14979,
          "ChemicalID": 155,
          "Quantity": 99000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 11256,
              "ProcessChemicalID": 18672,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 11257,
              "ProcessChemicalID": 18672,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 11258,
              "ProcessChemicalID": 18672,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 11259,
              "ProcessChemicalID": 18672,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 11260,
              "ProcessChemicalID": 18672,
              "ChemicalID": 98
            }
          ]
        },
        {
          "ProcessChemicalID": 18673,
          "ProcessID": 14979,
          "ChemicalID": 98,
          "Quantity": 2700.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 15348,
          "ProcessID": 14979,
          "NAICSCode": "21111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 15349,
          "ProcessID": 14979,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11242,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Lafourche Parish Emergency Planning",
    "CoordinatingAgencyPhone": "5044468427",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11242,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies - The facility has a Spill Prevention Control and Countermeasure (SPCC) Plan effective March 1999.  The Plan describes facility operations, spill response and prevention procedures, and notification requirements.  Spill response and prevention includes daily inspection of equipment and test procedures for equipment safety devices.  The notification requirements include a list of agencies and emergency response crews to contact should an emergency occurr.   The SPCC plan has been carefully thought-out and prepared in accordance with good engineering practices and has full approval of authoritative company personnel.\n\nFacility and Regulated Substances Handled - The facility is an oil and gas production facility that includes a gas processing plant.  This facility is subject to a Risk Management Program because it has (2) 12,000 gallon interconnected tanks (99,000 lbs. estimated at 88% fill capacity) of a flammable mixture of liquid petroleum gas (LPG) and (1) 1,000 gallon tank (2,700 lbs. estimated at 65% fill capacity) of commercial propane.  The facility is considered to have a single Program 1 process.  \n\nThe following details describe the facility's flow process:  The facility has 2 oil and gas wells and 2 salt water disposal wells.  At this time only one oil and gas well is in production.  Total fluids (oil, gas, water) flow from the well to a free water knock-out tank.  Water from the free water knock-out tank flows to the salt water disposal well.  The oil and gas flow from the free water knock out tank to a high pressure separator.  The high pressure gas from the high pressure separator flows to a gas plant. Total fluids flow to the low pressure separator.  From the low pressure separator, the oil flows to (3) 2,000 barrel oil storage tanks, water flows to the salt water disposal well, and the low pressure gas flows to a compressor.  It is then commingled with the gas from the high pressure separato"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11242,
      "SummaryText": "r and they flow to the gas plant where ethylene glycol is used to dehydrate the gas. The high pressure gas flows to the gas plant.  This high pressure gas goes to a gas sales pipeline offsite, and the low pressure gas goes to a compressor.  The water from the gas plant is sent to the salt water disposal well. The compressor cools the low pressure gas which then flows to the (2) 12,000 gallon interconnected tanks (99,000 lbs. estimated at 88% fill capacity) LPG tanks. The gas in the 12,000 gallon tanks is in the form of liquid petroleum gas (LPG), a flammable mixture composed of butane, ethane, isobutane, methane, propane, and normal gasoline.  The compressor is operated with commercial propane.  The commercial propane is stored in a 1,000 gallon (2,700 lbs estimated at 65 % fill capacity) tank.  \n\nWorst-Case Release Scenario and Alternative Release Scenario - The Environmental Protection Agencies' (EPA) Risk Management Program software (RMP) Comp and an offsite receptor radius search was used to determine the worst-case release and the offsite consequence analysis.  The largest vessel in the process is a 12,000 gallon (50,000 lbs.) LPG tank.  The tank was selected for the worst-case release.  RMP Comp determined the distance to endpoint of the release to be .3 miles.  The offsite receptor search did not determine any public receptors within .3 of a mile of the facility.  However, the Lake Bouef Wildlife Management Area is a wildlife preserve and is located within the distance to endpoint of the worst-case release.  The Lake Boeuf Wildlife Management Area is an environmental receptor and was establised on December 10, 1998.  An alternative release scenario was not completed because the facility qualified for a Program 1 process.\n\nGeneral Accidental Release Prevention Program and Chemical -Specific Prevention Steps - The facility complies with 29 CFR 1910.119 Process Safety Management (PSM); 40 CFR, Chapter 110 Discharge of Oil; 40 CFR, Chapter 112 Oil Pollution Preve"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11242,
      "SummaryText": "ntion; LAC 33 Part IX, Chapter 7 Effluent Standards; LAC 33 Part IX, Chapter 9 Spill Prevention and Control; LAC 33 Part I, Chapter 39 State Notification Regulations, and LAC 33 Part V, Chapter 101 Department of Public Safety.  The facility has an onsite Spill Prevention Control and Countermeasure Plan (SPCC) dated March 1999.  The SPCC plan is a guidance document to assist in the prevention and response to spills.\n\nFive Year Accident History - The facility has never had an onsite death, injuries, or significant property damage.  No known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place has occurred in the last five years.\n\nEmergency Response Program - The facility has submitted a SARA Title III, Tier Two Chemical Inventory to the Lafourche Parish Local Emergency Planning Committe (LEPC) and the Raceland Fire Department for the 1998 calender year.  The facility also has a list of agencies and phone numbers to contact in a case of an emergency.\n\nPlanned Changes to Improve Safety - No changes to improve safety are planned at this time."
    }
  ]
}