{
  "FacilityID": 11261,
  "FacilityName": "CONAIR Corporation",
  "FacilityStr1": "205 Shelhouse Drive",
  "FacilityStr2": null,
  "FacilityCity": "Rantoul",
  "FacilityState": "IL",
  "FacilityZipCode": "61866",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17019",
  "LEPC": "Champaign County LEPC",
  "FacilityLatDecDegs": "40.311667",
  "FacilityLongDecDegs": "-88.200556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": "http://www.conair.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1661222,
  "ParentCompanyName": "CONAIR Corporation",
  "Company2Name": null,
  "CompanyDUNS": 1661222,
  "Company2DUNS": 0,
  "OperatorName": "Rusty Ernst, Plant Manager",
  "OperatorStr1": "205 Shelhouse Drive",
  "OperatorStr2": null,
  "OperatorCity": "Rantoul",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "61866",
  "OperatorZipCodeExt": "9774",
  "RMPContact": "Mike McCormick",
  "RMPTitle": "Safety Coordinator",
  "FTE": 235,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000100151",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-04-03 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Liquid Packaging Division",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.31307,
  "FRS_Long": -88.20065,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15050,
      "AltID": "Aerosol Propellant",
      "FacilityID": 11261,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 15425,
          "ProcessID": 15050,
          "NAICSCode": "325611",
          "_desc": {
            "NAICS_CODE": "325611",
            "NAICS_DESCRIPTION": "Soap and Other Detergent Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 18769,
          "ProcessID": 15050,
          "ChemicalID": 98,
          "Quantity": 270250.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 518769,
          "ProcessID": 15050,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11261,
      "SummaryText": "1.  Accidental release prevention and emergency response policies:\n\nAt this production facility, we handle propane and butane, which is considered hazardous by EPA.  It is our policy to adhere to all applicable Federal and state rules and regulations.  Safety depends upon the manner in which we handle liquified petroleum gases combined with the safety devices inherent in the design of this facility combined with the safety devices inherent in the design of this facility combined with the safe handling procedures that we use and the training of our personnel.\n\nOur emergency response program covers scenarios involving LP-Gas, and includes procedures for notification of the Rantoul Fire Department and notification of any potentially affected neighbors.\n\n2.  The stationary source and regulated substances handled.\n\nThe primary purpose of this facility is the manufacture of personal care products, with aerosol products accounting for approximately 20% of our business.  LP-gases are received by truck (transports) and stored in three 12,000 gallon stationary storage tanks on the North side of our facility.  The gas is used as a propellant in the filling of aerosol cans.  Acess to the site is restricted to authorized facility employees, authorized management personnel and authorized contractors.\n\nThe regulated substance handled at this production facility is propane and butane.\n\nThe maximum amount of propane that can be stored at this plant in stationary tanks is 141,000 pounds.  At different times, we might also have up to three 11,000 gallon truck tankers (transports) containing special blends of propane, butane and ether for use in the same process, pushing the maximum amount of storage at any one time to 270,250 pounds.   \n\n3.  The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\nWORST-CASE SCENARIO  -  Failure of one of the stationary stor"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11261,
      "SummaryText": "age tanks, when filled to the greatest amount allowed, would release 47,000 pounds of propane.  Company policy limits the maximum filling capacityof this tank to 88% at 60 F.  It is assumed that the entire contents are released as vapor which finds an ignition source, 10% of the released quantity is assumed to participate in the resulting explosion.\n\nThe distance to the endpoint of 1 psi fo the worst-case scenario is 0.3 miles, and could potentially impact the industrial park businesses, as well as one private residence (3 people).\n\nALTERNATIVE SCENARIO  -  A vapor cloud explosion from a process piping break.  In this situation, it is estimated we would release 5,125 pounds of propane, with the resulting vapors reaching an ignition source.  This release would affect an area 0.1 miles in diameter, and have a slight possibility of extending beyond the facility boundary.\n\n4.  The general accidental release prevention program and the specific prevention steps.\n\nThis manufacturing facility complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  This facility was designed and constructed in accordance with NFPA-58.  All production employees receive training in how to work safely with aerosol products, while maintenance employees are trained in the hazards of propane, and how to work safely with the equipment.  \n\n5.  Five-year accident history.\n\nConair Corporation has not had any accident or incident involving propane or any other LP-gas.\n\n6. The emergency response program.\n\nConair Corporation has developed a comprehensive emergency response program, and have discussed this plan with the Rantoul Fire Department.  The fire department toured the facility on February 24, 1999. \n\n7.  Planned changes to improve safety.\n\nThis facility was constructed in 1990 with two tanks.  A third was added in 1992.  In 2000, we plan to perform general maintenance and upgrade the facility to NFPA-58, 1998 Edition."
    }
  ]
}