{
  "FacilityID": 11341,
  "FacilityName": "City of Atlantic Beach WWT #1",
  "FacilityStr1": "1100 Sandpiper Lane",
  "FacilityStr2": null,
  "FacilityCity": "Atlantic Beach",
  "FacilityState": "FL",
  "FacilityZipCode": "32233",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12031",
  "LEPC": "Regional Planning Council/Regi",
  "FacilityLatDecDegs": "30.335556",
  "FacilityLongDecDegs": "-81.408889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "PC",
  "FacilityURL": "www.atlanticbeachfl.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Atlantic Beach Florida",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Atlantic Beach",
  "OperatorStr1": "1200 Sandpiper Lane",
  "OperatorStr2": null,
  "OperatorCity": "Atlantic Beach",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32233",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000121361",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-10-06 00:00:00",
  "SafetyInspectionBy": "Florida Dept of Labor",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 30.335556,
  "FRS_Long": -81.408889,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15243,
      "AltID": "Chlorine",
      "FacilityID": 11341,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 19034,
          "ProcessID": 15243,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 15620,
          "ProcessID": 15243,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 7818,
              "Process_NAICS_ID": 15620,
              "SafetyReviewDate": "1999-01-15 00:00:00",
              "PHA_Date": "1999-04-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-01-07 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Upgrade of Procedures & Policies",
              "OpProceduresReviewDate": "1999-04-07 00:00:00",
              "TrainingReviewDate": "1999-01-11 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-15 00:00:00",
              "EquipmentInspectionDate": "1999-05-20 00:00:00",
              "EquipmentTested": "CL2 & SO2 monitors, etc.",
              "ChangeMgmtDate": "1999-04-15 00:00:00",
              "ChangeMgmtReviewDate": "1999-02-08 00:00:00",
              "PreStartupReviewDate": "1999-01-07 00:00:00",
              "ComplianceAuditDate": "1999-01-07 00:00:00",
              "AuditCompletionDate": "1999-03-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-01-27 00:00:00",
              "HotWorkPermitReviewDate": "1999-02-08 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-05 00:00:00",
              "ContractorSafetyEvalDate": "1999-02-08 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 10813,
                  "PreventionProgram3ID": 7818,
                  "ProcessChemicalID": 19034
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 15244,
      "AltID": "Sulfur",
      "FacilityID": 11341,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 19035,
          "ProcessID": 15244,
          "ChemicalID": 49,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 15621,
          "ProcessID": 15244,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 15622,
          "ProcessID": 15244,
          "NAICSCode": "562211",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11341,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-03-18 00:00:00",
    "ERTrainingDate": "1999-02-18 00:00:00",
    "CoordinatingAgencyName": "Jacksonville Fire Dept. for AtlantB",
    "CoordinatingAgencyPhone": "9046300522",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11341,
      "SummaryText": "1. EXECUTIVE SUMMARY  68.155\nThe City of Atlantic Beach Public Works Department operates the City of Atlantic Beach Wastewater Treatment Plant # 1 located at 1100 Sandpiper Lane, Atlantic Beach, Duval County, Florida.  This plant is one of six water and wastewater plants operated by the City.  Wastewater plant # 1 and four other plants have quantities of regulated hazardous chemicals above the EPA threshold.  The City has a unified Risk Management Program which applies to each plant.  Only Wastewater Treatment Plant # 1 operations and policies are presented in this Plan.\n1.1. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES     (a)\nThe City of Atlantic Beach, Florida Wastewater Treatment Plant # 1 accidental release prevention policy involves a unified approach that integrates technologies, procedures and management practices.  Our prevention program complies with all applicable procedures of the U.S. Environmental Protection Agency (EPA) Risk Management Program (RMP) 40 CFR-68,  Prevention Program.\n1.1.1. MANAGEMENT SYSTEM  (a)(1)\n The City of Atlantic Beach has a management system in place which is lead by the City Manager, which oversees the implementation and on-going use of the RMP elements.  This program, along with other City wide and plant specific policies, eliminates and /or reduces the likelihood of a hazardous chemical release at the plant.\n1.1.2. PREVENTION PROGRAM LEVEL 3  (a)(2)\n The City of Atlantic Beach maintains policies, procedures and systems as part of their prevention program.  These are applied to each treatment plant and specifically Wastewater Treatment Plant # 1.  The program addresses each of  the EPA Program Level 3-listed 12 elements, plus  RMP elements needed to implement the program, and the like elements in the plant\u0012s  OSHA PSM program.  These are maintained in The City of Atlantic Beach\u0012s Document Management System (DMS).\n1.2. THE CITY OF ATLANTIC BEACH STATIONARY SOURCE AND REGULATED SUBSTANCE HANDLED AT THE ATLANTIC"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11341,
      "SummaryText": "BEACH, FLORIDA SITE  (b)\nThe City of Atlantic Beach Wastewater Treatment Plant # 1employs five full-time employees engaged in wastewater treatment plant and field operations.  Chlorine and sulfur dioxide are used as part of the treatment process.\n \n1.2.1. SITE DESCRIPTION  (b)(1)\n The site is owned and operated by The City of Atlantic Beach.  The site is located at 1100 Sandpiper Lane, Atlantic Beach, Duval County, Florida.  The site is boarded by Sandpiper Lane on the east, Jordan Road on the north, Jordan Street on the west and Levy Road on the south.\n The Plant includes a chlorine and sulfur dioxide storage and distribution system contained in a specially designed storage and process building. The boundaries of the chlorine and sulfur dioxide system subject to the RMP regulation include the Bulk Chlorine and sulfur dioxide Storage and Feed Control rooms and the associated vent make up and exhaust systems.  These are detailed in the Process and Instrument Drawings (P&ID) which are part of the plant Process Safety Information (PSI).\n1.2.2. REGULATED SUBSTANCE  (b)(2)\n Chlorine is one of two regulated substance on site which exceeds the EPA 40 CFR-68 rule threshold quantity.  The City of Atlantic Beach chlorine process was installed as part of the process of purifying water for public consumption.  It operates under permit from the State of Florida Department of Environmental Protection (FDEP).  The chlorine is received, stored and distributed to two process control systems. \n Chlorine is an EPA and OSHA-listed toxic chemical.  It is an irritant and it is corrosive.  Chlorine is a halogen with the formula Cl2.  It is a chlorinating or oxidizing agent that is not flammable.  It has a 1 ppm OSHA ceiling Permissible Exposure Limit (PEL) and a NFPA health rating of 4, severe; with immediate and delayed health hazards.  Chlorine is not a carcinogen.\n1.3. WORST AND ALTERNATIVE CASE RELEASE SCENARIOS  (c)\nTwo offsite consequence analyses were conducted which include two ch"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 11341,
      "SummaryText": "2\n7 Vacuum pressure vapor S02\n7 Sulfonated water liquid system.\nBoth the high pressure liquid and vapor systems are designed to three times the normal high pressure of the DOT shipment container.  Materials are primarily of steel construction or like materials, which are compatible with (corrosive resistant to) anhydrous chlorine and sulfur dioxide.\nThe vacuum system is designed to operate at 13 to 60 inches of water vacuum pressure (less than atmospheric pressure).  The piping and fittings are made of chemical resistant PVC, glass or like materials.  The system is designated to 150 psig pressure or complete vacuum.\nBoth water systems are made of steel and PVC pipe, and like compatible materials.  The system is designed for chlorinated or sulfonated water at 150 psig containing low ppm levels of either chemical.\nAll the vessels, valves, pipe, fitting, instruments, etc are specifically designed for either chlorine or sulfur dioxide service.\nThere is a dual sensor chlorine monitor in both the chlorine scale feed room and evaporator control room.  These detect the pressure of chlorine plus alarm locally and in the separate plant operation control room with a light and audible alarm.\nThere is a dual sensor sulfur dioxide monitor in both the sulfur dioxide scale feed room and evaporator control room.  These detect the pressure of sulfur dioxide plus alarm locally and in the separate plant operation control room with a light and audible alarm.\n1.5. FIVE-YEAR ACCIDENT HISTORY  (e)\nThe City of Atlantic Beach Wastewater Plant #1 had no accidental releases of chlorine and sulfur dioxide in the past five years per EPA 40 CFR 67.42 (a). \n1.6. EMERGENCY RESPONSE PROGRAM  (f)\nEmergency response procedures are contained in the City of Atlantic Beach Contingency Plan (Emergency Response Plan).  The plan includes an emergency response decision tree and a notification plan.  The Plant also has site specific emergency actions defined in the plants operating procedures.  Emergency re"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11341,
      "SummaryText": "lorine and sulfur dioxide release scenarios.  The first is a worst case release.  The second is a more probable alternative release scenario.  The first scenario is defined by EPA, which states that the < shall assume that the < maximum quantity in the largest vessel < is released as a gas over 10 minutes  due to an unspecified failure.  The alternative scenario is defined as more likely to occur than the worst-case scenario.\nAtmospheric dispersion modeling was performed to determine the distance traveled by the chlorine released before its concentration decreases to the toxic endpoint.  The EPA  selected endpoint for chlorine is 0.0087 mg/l which equals 3 ppm. The  3 ppm endpoint is the Emergency Response Planning Guideline Level 2 (ERPG-2).  This is defined by the American Industrial Hygiene Association (AIHA) as the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual\u0012s ability to take protective action.  The residential population within a circle with a radius corresponding to the toxic endpoint distance was defined, to estimate the population potentially affected.\n1.3.1. WORST CASE   (c)(1)\n Atmospheric dispersion modeling for the worst case scenario was performed using the EPA assumptions.  Results demonstrate a distance of 1.30 miles to the toxic endpoint.  The residential population that could potentially be affected by the release is estimated at 14,418 people.\n1.3.2. ALTERNATIVE CASE   (c)(2)\n The alternative release scenario involves the failure of the yoke assembly regulator of the pressure system connected to one of the one ton-containers. This failure is equal to creating a 1/16 inch diameter hole in either the yoke assembly, the drip tube, a pipe, or even the container.  Modeling using the EPA  wastewater guidance demonstrated the rate of chlorine"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11341,
      "SummaryText": "and sulfur dioxide release is 20.0lb./min.  The toxic endpoint distances determined is 0.20 miles.  The residential population potentially that would be impacted by this release is 487.\n1.4. ACCIDENTAL RELEASE PREVENTION PROGRAM  (d)\nThe City of Atlantic Beach accidental release prevention program is based on OSHA\u0012s PSM program and EPA\u0012s RMP Level 3 prevention program.  The PSM program has been in place and effectively used.  It is part of the plants operating culture.  There are two parts to the program.  The first is the general overall City wide and Wastewater Treatment Plant # 1 site program.  The second is the chlorine-specific actions within the site program.  This is coordinated with the City of Jacksonville Fire Department.\n1.4.1. GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM   (d)(1)\n Plant-wide, many elements of the prevention program are used for all operations. The overviews of these programs are listed below:\n7 The City of Atlantic Beach has detailed process safety information on each of its operations. \n7 The DMS, document maintenance system, is integral to the management of change for all operations on site control.  \n7 Training is the backbone of employee knowledge, job operations and is ongoing in each area.  Employee training in operations and maintenance emphasizes awareness of the hazardous and toxic properties of all chemicals used. \n7 Maintenance and preventive maintenance are used for all operations, making mechanical integrity a part of each piece of equipment. \n7 Incident investigations of accidents and near-miss incidents ensure we learn from each event as well as correct the causes of the incident. \n7 Employees participate in all aspects of the plant as listed below under emergency response. \n7 Safe work practices are used throughout the facility including:  1) Hot Work Permits, 2) Lock Out Tag Out Permits, 3) Vessel Entry Permits, 4) Site Security, and 5) Breaking Into Chemical lines. \n7 Contractors must meet The City of Atlantic Beach\u0012s"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 11341,
      "SummaryText": "high safety and technical standards as part of selection and ongoing evaluations.  Plus, the City of Atlantic Beach demands training of contractors to our standards. \n1.4.2. CHLORINE-SPECIFIC RESPONSE PROGRAM  (d)(2)\n1.4.2.1. Chlorine-and Sulfur Dioxide Specific Policies and Procedures\nChemical-specific prevention features of the plant include: the policies and procedures listed above and those of the chlorine and sulfur dioxide specific program.  These include:\n7 Specific procedures for the operation of the chlorine and sulfur dioxide processes. \n7 Completion of a Pre-startup Safety Review prior to start up of the modified chlorine and/or sulfur dioxide system.  The latest one was conducted in January 1999.\n7 Specific emergency response procedures for chlorine and sulfur dioxide releases as outlined below under both operating procedures and in the emergency response procedures. \n7 Specific training in the properties, hazards, handling requirements, and leak repair for chlorine. \n7 Finally, the details of both facility and equipment design are key to the safe operations of the chlorine and sulfur dioxide system.\n1.4.2.2. Facility Design\nThe plant and support equipment of the chlorine and sulfur dioxide storage and control building meet and exceed design codes standards and good engineering practices.  The building is equipped with ambient ventilation storage area and a fan ventilated control room.  In the event of a chlorine and sulfur dioxide leak the vent system automatically comes on.  All the vent air and any fumes are diluted and then removed from the room by a vent system.\n1.4.2.3. Equipment Design\nThe chlorination systems and like sulfur dioxide system design has four distinct zones or types of pipe design or specification for chlorine is:\n7 High pressure liquid chlorine\n7 High pressure vapor chlorine\n7 Vacuum pressure vapor chlorine\n7 Chlorinated water liquid system.\nThe pipe design for sulfur dioxide is: \n7 High pressure liquid S02\n7 High pressure vapor S0"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 11341,
      "SummaryText": "sponse drills and drill evaluations are conducted annually by the operating department.  Emergency operation and response procedures are also reviewed at that time.\nThe emergency response program (contingency plan) is coordinated (reviewed by) with the Jacksonville Fire Department, which coordinates with Local Duval County Emergency Response Planning Committee (LEPC) and Jacksonville Fire Department HazMat Team and with the Mayport Naval Station HazMat Team, all located in Duval County, Florida.  Copies of the program are given to key local agencies including: fire, medical, rescue,  management, and police departments in Atlantic Beach.  Besides the specific emergency response program, key elements of the prevention programs are incorporated in the operating culture of the City of Atlantic Beach Wastewater Plant # 1.\nThe Contingency Plan procedures detail the actions and responses to either a chlorine or sulfur dioxide spills (releases).  The plan includes training of all chlorination/dechlorination-area operators,  The primary response team include the Danville fire rescue, and HazMat Team.  All of these respond to severe chlorine of sulfur dioxide leak situations.  Actions include catastrophic, severe, and moderate leaks.  Both a Chlorine and sulfur dioxide B Kit is maintained on site to aid in stopping leaks.  Public notification is facilitated through the City police and County Sheriff Departments.\n1.6.1. PERSONNEL  (f)(1)\n Personnel are the key resource of City of Atlantic Beach\u0012s prevention program. Our employees make up the operators and emergency first response teams.  The City of Atlantic Beach fosters a high level of involvement in every aspect of the chlorine and sulfur dioxide system operations including participation in :\n7 PSM/RMP safety teams, \n7 Development of the operation procedures, \n7 Hazard evaluations, and \n7 On-going training of the operators and other involved staff.\n1.7. CHANGES TO IMPROVE SAFETY  (g)\nChanges to improve safety (recommended"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 11341,
      "SummaryText": "actions) were identified in the January, 1999, internal safety HazOp, tour, and audit of the PSM program to meet requirements of the Risk Management Prevention Program.  These recommended actions have now been evaluated and implemented as required.  An Audit was conducted to review the PSM program.  The key safety action items were completed.  See the Update Section 6 of this report.\nThe City of Atlantic Beach continually reviews implemented and potential safety improvements for all of its operations.  Currently, the City of Atlantic Beach management team and process safety team are reviewing potential upgrades to the existing design of the chlorine and sulfur dioxide operations to make the system even safer to prevent a release and minimize consequences in the event of a release of chlorine."
    }
  ]
}