{
  "FacilityID": 11416,
  "FacilityName": "MICHAEL ANGELO'S GOURMET FOODS, INC",
  "FacilityStr1": "200 MICHAEL ANGELO WAY",
  "FacilityStr2": null,
  "FacilityCity": "AUSTIN",
  "FacilityState": "TX",
  "FacilityZipCode": "78728",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48491",
  "LEPC": "Williamson County LEPC",
  "FacilityLatDecDegs": "31.561222",
  "FacilityLongDecDegs": "-101.754417",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "SE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 197887268,
  "ParentCompanyName": "MICHAEL ANGELO'S GOURMET FOODS, INC.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "MICHAEL ANGELO RENNA",
  "OperatorStr1": "200 MICHAEL ANGELO WAY",
  "OperatorStr2": null,
  "OperatorCity": "AUSTIN",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78728",
  "OperatorZipCodeExt": null,
  "RMPContact": "MIKE KNUTH",
  "RMPTitle": "PLANT MANAGER",
  "FTE": 346,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000120978",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-03-04 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 31.56122,
  "FRS_Long": -101.75442,
  "FRS_Description": "SE CORNER OF LAND PARCEL",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15327,
      "AltID": "NH3",
      "FacilityID": 11416,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 15706,
          "ProcessID": 15327,
          "NAICSCode": "311412",
          "_desc": {
            "NAICS_CODE": "311412",
            "NAICS_DESCRIPTION": "Frozen Specialty Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 19131,
          "ProcessID": 15327,
          "ChemicalID": 56,
          "Quantity": 44234.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 519131,
          "ProcessID": 15327,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11416,
      "SummaryText": "Michael Angelo's Gourmet Foods                                         Page:    1       of       4\n200 Michael Angelo Way                                                                Rev. :          Doc. #:                             Austin, Texas 78728                                                                        Issued by         Date:     /     /\n                                                                                                         Checked by:             Date:     /    / \n\n\nExecutive Summary\n\nThis is to inform all interested persons, including employees, that Michael Angelo's Gourmet Foods located at 200 Michael Angelo Way, Austin, Texas, 78728 is complying with OSHA's Process Safety Management  of Highly Hazardous Chemicals Standard (called Process Safety Management or PSM) and EPA's Risk Management Program regulations (call Risk Management Program or RM Program) to deal with the risks involved in the storage, handling, and processing of highly hazardous materials such as ammonia. In this way we promote overall plant and worker safety.\n\nOur PSM/RM programs enable our facility to prevent the occurrence, and minimize the consequences, of significant releases of highly hazardous materials as well as fires, explosions, and other types of catastrophic accidents. Overall, the PSM/RM Programs prevent accidental fatalities, injuries, and illnesses and avoid physical property damage.\n\nOur PSM/RM programs prevent accidents because they focus on the rules, procedures, and practices which govern individual processes, activities, or pieces of equipment. These rules are improved as necessary. They are also communicated to and accepted by all employees at the facility.\n\nOur ammonia refrigeration system consists basically of a cycle where liquid ammonia is evaporated while removing heat from the air or liquid surrounding it. The ammonia is always contained inside tubes, pipes or vessels. The vapor is then compressed and condensed so that liquid ammonia "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11416,
      "SummaryText": " returns back to the coolers to initiate the cycle again.\n \nWorst Case Release Scenario:\nFailure of the high pressure receiver containing 11,700 lbs of ammonia resulting in a ten minute release. Under worst case scenario conditions, ammonia could travel 0.9 miles before dispersing enough to no longer pose a hazard to the public. This scenario is unlikely to occur for the following reasons:\nworst case scenario conditions are uncommon; compliance with industry standards for the manufacture and quality control of pressure vessels; ammonia is not corrosive, pressure safety valves limit operating pressure in this vessel; the accident prevention program in place at the facility including the mechanical integrity program for regular maintenance, inspection and testing, and replacement of equipment, if necessary. Also installed ammonia sensors in the system to warn of leaks; alarms will sound.  The system is monitored over a 24-hour period seven days a week.  Finally we have a emergency response plan and equipment in place at the facility.\n \nAlternative Case Release Scenario:\nCorrosion of the pipe connection to the intercooler vessel results in a release of 151 lbs/min for 5 minutes. Under common weather conditions, ammonia could travel 0.1 miles before dispersing enough to no longer pose a hazard to the public. This scenario is unlikely for the following reasons:  the preventative maintenance in place regularly maintains and inspects piping; there are pressure relief valves and pressure regulators that prevent sudden pressure increases.  We regularly have personnel present around this \n\n\n Michael Angelo's Gourmet Foods                                         Page:    2       of      4          \n200 Michael Angelo Way                                                                Rev. :     0      Doc. #:                              Austin, Texas 78728                                                                        Issued by:             Date:     /     /\n                "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11416,
      "SummaryText": "                                                                                         Checked by:             Date:     /    /     equipment, moreover the ammonia sensors in the system to warn of leaks. Finally we have a emergency response plan and equipment in place at the facility.\n\nOur general accidental release prevention program complies with OSHA PSM Standard 29 CFR 1910.119, EPA RM Program regulations in 40 CFR Part 68, ANSI/IIAR 2-1992 Standard for Equipment, Design and Installation of Ammonia Mechanical Refrigerating Systems as follows:\n\nEmployee Participation:\nTo involve the employees in establishing the PSM program. Employees have complete access to the PSM program.\n\nProcess Safety Information:\nTo enable the employees to identify and understand the potential hazards in the system. It includes the ammonia MSDS and a description of the ammonia refrigeration system design.\n\nProcess Hazard Analysis (PHA):\nTo review and study  the Process to identify potentially hazardous events or possible problems in operations. Analyses potential deviations from design conditions.\n\nOperating Procedures:\nDetailed description of the steps to be followed to operate safely  the ammonia refrigeration system .\n\nTraining:\nTo train the employees on all aspects of operation of the system and their respective duties to ensure the safety of the ammonia refrigeration system operation.\n\nContractors:\nTo screen and evaluate the contractors before they perform work on or near the ammonia refrigeration system. Periodic evaluation should be done to ensure that they follow safe work practices.\n\nPre-Start Up Review:\nTo complete a pre start up safety review for all new or modified ammonia projects to verify that all safety programs are in place, before the project is put into use.\n\nMechanical Integrity:\nTo ensure that the ammonia refrigeration system is well maintained, minimizing unexpected breakdown or failures.\n\nHot Work Permit:\nTo ensure that a signed permit is obtained prior to any cutt"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11416,
      "SummaryText": "ing, welding or burning on the plant premises.\n\n\n\n\n\n Michael Angelo's Gourmet Foods                                         Page:    3       of       4         \n200 Michael Angelo Way                                                                Rev. :     0      Doc. #:                              Austin, Texas 78728                                                                        Issued by:             Date:     /     /\n                                                                                                         Checked by:             Date:     /    / \n\nManagement of Change (MOC):\nTo ensure  that all changes made to the ammonia refrigeration system are properly reviewed and documented.\n\nIncident Investigation:\nTo ensure that any incident is investigated, reviewed and documented using an investigation team.\n\nEmergency Planning and Response:\nTo describe how our facility will respond to ammonia spills and other emergencies, including evacuation procedures.\n\nCompliance Audits:\nTo conduct regular audits to the program to ensure that the program is in place and working properly.\n\nTrade Secrets:\nTo ensure that employees are provided with information while still protecting the company secrets.\n\nHazard Assessment:\nTo conduct, document, and update  the hazard assessment of the plant's  ammonia refrigeration system for the public and the environment.\n\nFive-Year Accident History:\nTo determine, identify and document ammonia accidents in the last five year accident history of the company.\n\nRisk Management Plan:\nTo prepare, submit and update  the Risk Management Plan document.  It includes the most useful information for the public and local agencies in case of a ammonia accidental release.\n\n\nOur Five Year Accident History does not include any accidental releases.  Michael Angelo's has had no employee injuries and no employee evacuation, off Site injuries or environmental consequences due to any releases.\n\nThis facility's emergency response program is based upon th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 11416,
      "SummaryText": "e OSHA requirements for Emergency Action Plans (29 CFR 1910.38 and 1910.119) and HAZWOPER ( 29 CFR 1910.120). We are currently training employees for emergency response this training is scheduled for completion on August 31, 1999.  This plan is being coordinated in conjunction with the Local Emergency Planning Committee (LEPC) and the local fire department. We will be conducting annual drills to ensure implementation of the emergency response plan at the facility with the participation of the LEPC and the fire department. \n\n \nMichael Angelo's Gourmet Foods                                         Page:    4       of        4        \n200 Michael Angelo Way                                                                Rev. :     0      Doc. #:                              Austin, Texas 78728                                                                        Issued by:             Date:     /     /\n                                                                                                         Checked by:             Date:     /    / \n\n\nWe are committed to the safety of our employees, the public and the environment. We plan to continue  improving our operation safety through training, quality of our equipment, and employee participation.\n\n\n\nPresident"
    }
  ]
}