{
  "FacilityID": 11424,
  "FacilityName": "Hinckley Water Treatment Plant",
  "FacilityStr1": "Hinckley Water Treatment Plant",
  "FacilityStr2": "Old Quarry Road",
  "FacilityCity": "Prospect",
  "FacilityState": "NY",
  "FacilityZipCode": "13435",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36065",
  "LEPC": "Oneida County LEPC",
  "FacilityLatDecDegs": "43.299444",
  "FacilityLongDecDegs": "-75.131111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Upper Mohawk Valley Regional Water Board",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Upper Mohawk Valley Reg. Wtr Board",
  "OperatorStr1": "One Kennedy Plaza",
  "OperatorStr2": "PO Box 345",
  "OperatorCity": "Utica",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13503",
  "OperatorZipCodeExt": "0345",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000121432",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2022-11-30 00:00:00",
  "DeRegistrationEffectiveDate": "2022-09-09 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 43.294722,
  "FRS_Long": -75.149167,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15336,
      "AltID": "Hinckley Chlorination",
      "FacilityID": 11424,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 19140,
          "ProcessID": 15336,
          "ChemicalID": 62,
          "Quantity": 18000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 15715,
          "ProcessID": 15336,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 7870,
              "Process_NAICS_ID": 15715,
              "SafetyReviewDate": "1999-06-09 00:00:00",
              "PHA_Date": "1999-06-21 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-05-06 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "ventilation intake modifications",
              "OpProceduresReviewDate": "1999-06-09 00:00:00",
              "TrainingReviewDate": "1999-06-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-21 00:00:00",
              "EquipmentInspectionDate": "1999-06-21 00:00:00",
              "EquipmentTested": "chlorinators, regulators, monitors",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-09 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-06-21 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-09 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-09 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-06-09 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 10868,
                  "PreventionProgram3ID": 7870,
                  "ProcessChemicalID": 19140
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11424,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-09 00:00:00",
    "ERTrainingDate": "1999-06-05 00:00:00",
    "CoordinatingAgencyName": "Oneida County HAZMAT",
    "CoordinatingAgencyPhone": "3158654565",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 11424,
      "SummaryText": "gency response coordination such as drills with local emergency responders, public education, and through written policy statements such as this RMP.  \n\nA management system is in place to ensure that employees from all levels are a part of the RMP Program.\n\nA number of safety measures are in place to prevent an accidental release of chlorine gas.  In addition to the vacuum delivery system which stops the flow of chlorine gas in the event of a piping or equipment failure, the chlorine containers are kept in a separate, totally enclosed storage room which is continuous monitored for any possible chlorine leaks.  If a leak should occur, the operator is notified immediately through an alarm system.  \n\nAll major chlorination components are backed-up with on-line redundant equipment.  \n\nAll water treatment plant operators are trained in the handling and administering of chlorine.  This training includes the use of chlorination and safety equipment, identification of potential hazards, and response to accidental releases of chlorine gas.  \n\nThe plant has a detailed Emergency Response Plan which outlines the response measures to be taken by plant personnel in the event of a chlorine leak.  Plant personnel have been trained in the use of equipment to correct small-scale leaks.  This training also includes the recognition of when additional assistance from local emergency responders such as the Oneida County HAZMAT squad is needed to correct the problem and notify the immediate public if necessary.\n\nBoard personnel including management, operators, and maintenance have conducted a process hazard analysis (PHA), a brainstorming session to identify possible chlorine release situations, causes, consequences, and identify (or recommend) safeguards and corrective actions to prevent the release from occuring.  This analysis involved situations ranging from the container rupture during delivery, to chlorine equipment failure, to acts of nature.  Any deficiencies in the response to a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11424,
      "SummaryText": "release situation were identified and a plan of action was formed to resolve the deficiency.\n\nUnder EPA's Risk Management Program, the Board applied EPA's computer program RMP*Comp to determine the off-site impacts of a release of chlorine.  Two scenarios were modeled.  The first scenario modeled a worst-case release condition, with model parameters and criteria set by EPA.  \n\nUnder the worst-case scenario of the release of 200 pounds of chlorine per minute for ten minutes, an impact area of 1.3 miles around the treatment plant was identified.  This radius represents the distance the chlorine vapor cloud will travel before dissipating to a point that serious injury from short term exposure will no longer occur.  Public receptors in this area include an estimated residential population of 376 people as well as churches, recreational areas, and municipal and emergency responder facilities.  \n\nNo environmental receptors meeting EPA criteria (ie. national or state parks, forests, monuments, and officially designated federal wildlife santuaries, preserves, refuges, or areas that can be identified on local U.S. Geological Survey maps) were identified within the worst-case impact area.  \n\nAlthough the EPA model identified a 1.3 mile impact radius in all directions around the chlorine storage room, it is a reasonable assumption that the actual area of influence will be smaller due to the topography around the water treatment plant.  As chlorine is a dense gas, heavier than air, a release of chlorine will likely travel downhill from the plant (aided by the prevaillng westerly wind) toward the quarry where it would be contained and dissipated before reaching the 1.3 mile distance. \n\nA release of chlorine under the worst-case scenario is very unlikely.  The Board has a number of preventive measures in place to minimize the likelihood of such a large release including standard operating procedures and continuing training of employees on the use of container unloading equipmen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11424,
      "SummaryText": "t (the time at which a worst case scenario is most likely to occur). \n\nTo reflect a more likely release situation, the Board also modeled an alternative release.  Under the alternative release scenario an impact area of less than a 0.1 mile radius was identified.  The alternative situation involved the release of chlorine within the storage room due to a failure in the chlorine gas piping.  The impact radius of the alternative release scenario was reduced from that of the worst-case scenario  due to the smaller release rate (11 pounds per minute versus 200 pounds per minute) and the passive mitigation offered with the release within the enclosed chlorine storage room.  \n\nNo public or environmental receptors were identified in the alternative release impact area, which was confined generally to the limits of the water treatment plant property.\n\nThe Board is pleased to report that the water treatment plant has not had an accidental release of chlorine gas meeting EPA RMP criteria in the past five years.  This can be directly attributed to plant personnel's high level of effort toward safe chlorine handling and use.\n\nAs noted, the Emergency Response Plan for the plant includes provisions for emergency medical treatment and  procedures for the summoning of outside assistance for a large chlorine leak.  Outside assistance is provided by the Village of Prospect Fire Department and the Oneida County HAZMAT Team.  Outside responders are familiar with the plant chlorination system and have recently completed an on-site training and drill program in conjunction with plant personnel.  The emergency responders will be responsible for public notification in the event of a chlorine release."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 11424,
      "SummaryText": "Upper Mohawk Valley Regional Water Board\n                                                       Hinckley Water Treatment Plant\n                                                          Risk Management Program\n\nThe Upper Mohawk Valley Regional Water Board's Hinckley Water Treatment Plant is located on Old Quarry Road in Prospect, New York.  The treatment facility was placed into service in 1992 and currently provides water to approximately 121,000 people in the Utica area. The water plant utilizes settling, clarification, filtration, and chemical feed processes to treat approximately 20 million gallons of water per day, the source of which is the Hinckley Reservoir.\n\nOne of the chemicals which is used by the plant is chlorine.  Chlorine is used to disinfect the water at various locations in the treatment process including dosing of the finished water as it leaves the treatment plant. Chlorine is used as a gas but stored under pressure as a liquid in 2000 pound containers.  The plant has up to 18,000 pounds (9 containers) of chlorine on-site. The chlorine, drawn from the containers under vacuum for safety, is added at a prescribed dosage rate into the water by means of a rotometer on the chlorinator, which the operator can adjust to respond to changes in water quality.\n\nAs the Hinckley Treatment Plant has more than 2500 pounds of chlorine on-site, it must comply with the provisions of EPA's Risk Management Program (RMP).  Also, as New York State is an OSHA Plan State, the plant is subject to Prevention Program 3 requirements.  Additionally, the plant is subject to OSHA's Process Safety Management Program (chlorine limit of 1500 pounds).\n\nThe Board is committed to reducing the risk to its employees and the public of injury from the accidental release of chemicals, including chlorine gas.  This commitment is exhibited through an extensive employee training and safety program, continuing maintenance on process equipment, emer"
    }
  ]
}