{
  "FacilityID": 11426,
  "FacilityName": "BIC Corporation",
  "FacilityStr1": "5900 Long Creek Park Drive",
  "FacilityStr2": null,
  "FacilityCity": "Charlotte",
  "FacilityState": "NC",
  "FacilityZipCode": "28269",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37119",
  "LEPC": "Mecklenburg County LEPC",
  "FacilityLatDecDegs": "35.326944",
  "FacilityLongDecDegs": "-80.841389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PP",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "BIC Corporation",
  "Company2Name": null,
  "CompanyDUNS": 1166586,
  "Company2DUNS": null,
  "OperatorName": "BIC Corporation",
  "OperatorStr1": "5900 Long Creek Park Drive",
  "OperatorStr2": null,
  "OperatorCity": "Charlotte",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28269",
  "OperatorZipCodeExt": null,
  "FTE": 222,
  "OtherEPAFacilityID": "NCR000010124",
  "EPAFacilityID": "100000121593",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-03-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.326944,
  "FRS_Long": -80.841389,
  "FRS_Description": "PLANT ENTRANCE (PERSONNEL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15338,
      "AltID": "Warehousing of lighters",
      "FacilityID": 11426,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 19143,
          "ProcessID": 15338,
          "ChemicalID": 107,
          "Quantity": 420000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 15717,
          "ProcessID": 15338,
          "NAICSCode": "339999",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11426,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Charlotte/Mecklenburg Cty Emer. Mgt",
    "CoordinatingAgencyPhone": "7043362461",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11426,
      "SummaryText": "BIC Corporation\n5900 Long Creek Park Drive, Charlotte, North Carolina\n\nRisk Management Plan\nExecutive Summary\n\n\nSource and Process Description\n\nBIC Corporation (BIC), located at 5900 Long Creek Park Drive, in Charlotte, North Carolina, is a warehouse, packaging, and distribution facility for BIC products.  BIC's Charlotte facility consists of office, warehouse, and packaging operations located in a single building.  At this facility, BIC handles several types of lighters, all of which contain isobutane, a substance regulated under EPA Accidental Release Prevention provisions. Pallets of packaged lighters are received at the facility by truck/trailer, and are unloaded via forklift. The number of lighters in each case (box) depends on the size and type of lighter. The pallets are placed in either rack or row storage throughout the facility.  As orders for lighters are received, the pallets of lighters are transferred to the shipping area of the facility via forklift. From this location, individual cases of lighters are placed (by hand) onto a conveyor system, which collates the products required to fill each order. At the end of the conveyor, the individual cases of products are combined together on pallets, and loaded onto trucks via forklift. Other BIC products are handled in the same manner.\n\nSummary of Major Hazards\n\nThe ability to produce a clean burning, stable flame is one of the properties that makes isobutane an ideal fuel for lighters.  Although its flammability can be a useful property, isobutane can pose a safety hazard in the unlikely event of an uncontrolled accidental release during storage or processing.  If an ignition source is present in the area of a release, a fire or explosion could result.  However, since a single lighter is the largest container of isobutane handled at this facility, the off-site hazard posed by this worst case release is very small.\n\nConsequences of Failure to Control the Hazards\n\nIn accordance with EPA Risk Management Progr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11426,
      "SummaryText": "am requirements, BIC has evaluated the potential consequences of the failure to control the hazard described above.  This evaluation required the analysis of a prescribed Worst Case Scenario.  The distance to endpoint and the area affected by the scenario were determined using a model provided in EPA's RMP Guidance For Warehouses.  The purpose of this analysis was to assess the off-site impact of this hypothetical event.\n\nAs prescribed by EPA, the Worst Case Scenario considers an unmitigated release of the entire contents of the largest single container of isobutane at the facility.  This scenario is represented by the release of 0.01 pounds of isobutane from a single lighter. It is assumed that the entire content of the lighter is released as vapor and then 10% of the released gas participates in a subsequent vapor cloud explosion. The distance to the endpoint (1 psi overpressure) for this Worst Case Scenario is 0.0017 miles (approximately 9 feet).  However, for purposes of this Risk Management Plan submittal, the RMP Submit User's Manual requires that releases of less than 1 pound are to be rounded up to a 1 pound release (the equivalent of about 100 lighters).  In this unlikely scenario, the distance to the endpoint (1 psi overpressure) for a 1 pound release of isobutane is 0.008 miles (approximately 42 feet).  There are no residences, schools, hospitals, recreational areas or environmentally-sensitive areas within the affected area.\n\nExplanation of How Releases are Prevented and Steps Taken to Address Hazards\n\nSince BIC began operations at this facility in February 1996, there have been no accidental releases of isobutane with off-site consequences.  This, along with a record of safe operation at every BIC facility, reflects a corporate commitment to the safety and well-being of BIC employees and the community.\n\nPrevention of accidental releases at the facility is accomplished not only through compliance with EPA's Accidental Release Prevention provisions and ot"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11426,
      "SummaryText": "her Federal and State regulations, but through application of long-standing corporate philosophies and initiatives which help support safe operations.  For example, BIC's extensive in-line quality testing of every lighter not only guarantees safe and reliable operation of the product by the consumer, but also provides an additional measure of safety for warehousing operations.\n\nBIC's corporate commitment to safety and sound environmental management is translated into action by a full-time staff of several highly trained Environmental, Health and Safety (EH&S) professionals who service all BIC facilities.  BIC's EH&S staff, along with warehousing staff, administer several programs which contribute to release prevention including safe work practices, employee training, preventative maintenance and administrative controls designed to ensure that any safety concerns are identified and addressed.\n\n\nResponse Action in the Event of a Release\n\nBIC has implemented a written Emergency Action and Contingency Plan, which has been prepared in accordance with the requirements of 29 CFR 1910.38. This plan establishes detailed facility evacuation, response, and reporting procedures for potential emergencies including fires, explosions, accidental releases, power failures, natural disasters, bomb threats, civil disturbances, and medical emergencies. The plan designates a Facility Emergency Coordinator who is responsible for implementing the plan during an emergency.  The plan also provides for job-specific emergency training of all facility personnel.  The procedures in this plan have been coordinated with local emergency response agencies, including the Charlotte Mecklenburg County Emergency Management Division and the local Fire Department, through submittal of the plan and/or through facility site visits by agency representatives.\n\nEmergency response steps that may be implemented in the event of a release of isobutane may include the use of portable fire extinguishers, evacuation"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11426,
      "SummaryText": "of the facility and/or response by the local Fire Department.  Fire protection of the facility is provided by an automatic sprinkler system incorporating Early Suppression - Fast Response (ESFR) heads.  Packaged lighters are classified as a plastic commodity since the quantity of plastic and packaging used results in combustion characteristics similar to plastic materials.  Therefore, standard fire protection and response measures should provide adequate emergency response."
    }
  ]
}