{
  "FacilityID": 11495,
  "FacilityName": "City of Waxahachie Water Treatment Plant",
  "FacilityStr1": "1900 Howard Road",
  "FacilityStr2": null,
  "FacilityCity": "Waxahachie",
  "FacilityState": "TX",
  "FacilityZipCode": "75165",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48139",
  "LEPC": "Ellis County LEPC",
  "FacilityLatDecDegs": "32.369444",
  "FacilityLongDecDegs": "-96.845833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.waxahachie.com",
  "FacilityEmailAddress": "dbailey@waxahachie.com",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Ellis County WCID #1",
  "OperatorStr1": "401 S. Rogers",
  "OperatorStr2": "P.O. Box 757",
  "OperatorCity": "Waxahachie",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75168",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000120709",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.36925,
  "FRS_Long": -96.84563,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15420,
      "AltID": "Water Treatment",
      "FacilityID": 11495,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 19236,
          "ProcessID": 15420,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 15801,
          "ProcessID": 15420,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 6636,
              "Process_NAICS_ID": 15801,
              "SafetyReviewDate": "1999-05-01 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "Chlorine Institute",
              "FR_Comments": null,
              "HazardReviewDate": "1998-11-24 00:00:00",
              "ChangeCompletionDate": "2000-01-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Vacuum regulators, Automatic switchover between manifolds",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Operations and maintenance procedures have been updated",
              "OpProceduresReviewDate": "1999-05-01 00:00:00",
              "TrainingReviewDate": "1999-05-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-01 00:00:00",
              "EquipmentInspectionDate": "1999-03-16 00:00:00",
              "EquipmentTested": "Chlorine header valves, chlorine flex lines, injectors, chlorine gas feed lines",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 6923,
                  "PreventionProgram2ID": 6636,
                  "ProcessChemicalID": 19236
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11495,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Waxahachie Fire Department",
    "CoordinatingAgencyPhone": "9729371200",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "EPCRA"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 11495,
      "SummaryText": "he prevention program will be audited at least once every three years to evaluate compliance with the risk management rules.  The results of the audit will be documented, and deficiencies corrected.\n\n7 Incident Investigation: Should an incident involving a release, or near release, of chlorine occur, it will be investigated promptly.  The findings of any such incident investigation will be used to improve the safety of the process.\n\nEmergency Response Program\nThe City of Waxahachie has determined that the water treatment plant will assume a non-responder status with respect to accidental releases of chlorine.  The Fire Department for the City will instead be the appropriate local emergency response agency in such cases.  The Waxahachie Fire Department has the necessary training to respond to chlorine leaks.  The Waxahachie Utilities Department has coordinated with the Fire Department to ensure that the facility is included in the community emergency response plan regarding response to a potential release.\n\nEven as a non-responding facility, the facility's employees have a significant role in the event of a release of chlorine.  Should a release occur or be suspected, employees responsible for working with chlorine will follow procedures for assessing the situation and attempting to safely stop the release using normal shutdown procedures.  Facility personnel will receive ongoing training in identification of potential releases, and in how to determine when emergency response personnel should be involved.\n\nThe Utilities Department will continue to work closely with the Fire Department to ensure that emergency response, should it become necessary, is efficiently and safely carried out.  Coordination may include:\n\n7 periodic meetings between operators and Fire Department emergency responders to discuss emergency response measures\n\n7 periodic inspections of the facility by Fire Department emergency responders to ensure their familiarity with routes to the facility, ingr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11495,
      "SummaryText": "ess and egress routes at the facility, and layout of the chlorine process area\n\n7 periodic practice drills utilizing both Utilities and Fire Department personnel.\n\nEmployees responsible for working with chlorine will receive periodic training, as detailed in the Procedures Manual of the RMProgram.\n\nImproving Safety\nThe Ellis County WCID No. 1 and the City of Waxahachie will continue to improve their risk management program for the water treatment plant by responding to the recommended changes outlined in the Hazard Review, by ongoing training of personnel, and by continued coordination with emergency response officials.  As the water treatment plant grows to meet the growing demands of the City, future plant expansions will consider further improvements in the treatment process to manage risks associated with regulated substances."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 11495,
      "SummaryText": "Facility Description\nThe Waxahachie Water Treatment Plant is located in Waxahachie, Texas at 1900 Howard Road.  The facility is owned by the Ellis County Water Control and Improvement District No. 1 and operated by the City of Waxahachie.  This facility is a conventional water treatment plant and uses chlorine in the treatment process.  Currently, a maximum of 8,000 pounds of chlorine is maintained on the site.  Anhydrous ammonia is also stored and utilized at the facility, but in a quantity beneath the threshold for the 40 CFR 68 rules.  No other toxic or flammable substance, as defined by the 40 CFR 68 rules, is stored or utilized at the water treatment plant.  \n\nSafety Policies\nThe City of Waxahachie is fully committed to safety at the water treatment plant.  The Waxahachie Utilities Department has long emphasized the importance of safety in storing and using regulated toxic substances and has used the 40 CFR 68 requirements as an opportunity to further refine its safety program.  The City has also used this opportunity to strengthen its emergency response procedures between the water treatment plant and the City Fire Department.  The Fire Department is capable of responding to accidental releases of chlorine, should a release occur.  Finally, the City is committed to continuing to improve its risk management program for chlorine at the water treatment plant.\n\nFive Year Accident History\nThe City's commitment to managing risks associated with chlorine is demonstrated by its excellent track record.  The water treatment plant has not experienced an accident related to chlorine within the past five years or at any time.\n\nOffsite Consequence Analysis\nAir dispersion modeling was used to determine the worst-case impact radius.  Public receptors do exist within this radius, including residences, educational facilities, parks, major commercial/office buildings, and one prison facility.  As required by the risk management regulations, alternative-release scenarios were dev"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11495,
      "SummaryText": "eloped for chlorine.  Realistic potential alternatives were modeled, with consideration toward actual conditions at the site.  The resulting radii of impact are therefore useful tools for emergency response teams in planning for and responding to emergency situations.\n\nPrevention Program Description\nThe City's prevention program represents the core of the day-to-day means by which accidental releases of regulated substances into the air will be minimized.  This component will be used primarily by plant personnel responsible for the operation and maintenance of regulated processes at the facility.  The prevention program will also become a useful tool in ongoing training of plant personnel. \n\nThe Program 2 Prevention Program includes seven primary components:\n\n7 Safety Information: Up-to-date safety information has been compiled relating to regulated substances, processes, and equipment. Safety information will also be updated any time a major change occurs that would make the safety information inaccurate.\n\n7 Hazard Review: Regulated processes at the facility have been reviewed to identify potential hazards.  The results have been documented in a hazard review report.  Problems identified by the hazard review are being resolved in a timely manner.  \n\n7 Operating Procedures: Written operating procedures have been prepared providing instructions for safely conducting activities associated with regulated processes.  These procedures will also be updated should a major change in the handling or storage of regulated substances occur.\n\n7 Training:  Plant personnel responsible for operating regulated processes receive training in the processes.  Periodic refresher training is required.\n\n7 Maintenance:  Procedures have been implemented to ensure that the mechanical integrity of the process equipment is maintained.  Ongoing training of personnel responsible for maintenance is also required. Process equipment is inspected and tested on a regular basis.\n\n7 Compliance Audits: T"
    }
  ]
}