{
  "FacilityID": 11539,
  "FacilityName": "Peco Farms, Inc.",
  "FacilityStr1": "1039 West Fulton Street",
  "FacilityStr2": null,
  "FacilityCity": "Canton",
  "FacilityState": "MS",
  "FacilityZipCode": "39046",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28089",
  "LEPC": null,
  "FacilityLatDecDegs": "32.609722",
  "FacilityLongDecDegs": "-90.055",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Peco Farms, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 293627391,
  "Company2DUNS": 0,
  "OperatorName": "Peco Farms, Inc.",
  "OperatorStr1": "2nd Avenue",
  "OperatorStr2": "P. O. Drawer E",
  "OperatorCity": "Gordo",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35466",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bruce Johnson",
  "RMPTitle": "Personnel Manager",
  "FTE": 350,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000122048",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Canton, MS",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.60944,
  "FRS_Long": -90.05278,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15472,
      "AltID": null,
      "FacilityID": 11539,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 15854,
          "ProcessID": 15472,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 19301,
          "ProcessID": 15472,
          "ChemicalID": 56,
          "Quantity": 12500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 519301,
          "ProcessID": 15472,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11539,
      "SummaryText": "PECO FARMS, INC.\nCanton, Mississippi\n\nRISK MANAGMENT PLAN \nExecutive Summary\n\n\n1.  ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES.\n\nAt this Peco Farms facility, we utilize anhydrous ammonia which is considered hazardous by the Environmental Protection Agency (EPA).  The properties which make ammonia valuable as a refrigerant also necessitate certain safety precautions.  Peco strives to protect all its valuable resources and assets - both personnel and property.  We live and have families in this community.  We want to prevent exposure to all our personnel as well as nearby members of our community, existing natural resources, and the surrounding environment.  It is our policy to comply with all Federal, State, and Local regulations.  Through continual, accurate training and various safety devices and procedures, we work to minimize potential releases.\n\nOur emergency response program has specific procedures for accidental releases of anhydrous ammonia as well as other emergencies.  We work in conjunction with the Canton Fire Department to prepare for necessary notification of all affected neighbors.\n\n\n2.  THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED.\n\nThe primary purpose of our facility is the temporary storage of refrigerated and frozen foods.  We utilize anhydrous ammonia as the primary means for refrigeration and freezing.  An outside company is used to fill our main receiver tanks.  Piping then carries the ammonia to the needed refrigeration or freezing units.  Access to the site is restricted to facility employees, authorized management personnel and authorized contractors.\n\nThe regulated substance used at our facility is anhydrous ammonia.  The maximum amount of ammonia stored at this facility is 12,500 pounds.  We have the capacity for 25,000 pounds but do not run above 50% of total capacity.\n\n\n\n3.  THE WORST CASE RELEASE SCENARIO(S) AND THE ALTERNATIVE RELEASE SCENARIO(S), INCLUDING ADMINISTRATIVE CONTROLS AND MITIGATION MEASURES TO L"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11539,
      "SummaryText": "IMIT THE DISTANCES FOR EACH REPORTED SCENARIO.\n\nWorst Case Scenario\nThe worst case scenario would be failure of our largest receiver.  Peco policy restricts the maximum capacity of this 13,281 pound tank to 80% of capacity.  The greatest amount stored in this tank is 10,657 pounds.  It is assumed that the entire contents are released as a two phase flow (gas and aerosol-ALOHA).\nDistance to endpoint: 1.1 miles\n\nAlternative Scenario\nThe alternative scenario would be the release of ammonia due to the failure of a pressure release valve.  The emergency valves shut-down release would engage and stop the flow and sounds an alarm.  In the event the emergency shut-down failed, the monitoring system would also alert personnel to manually shut the valve.  The maximum time of the release would be 60 minutes and maximum quantity released would be approximately 1,823 pounds of ammonia.  \nDistance to endpoint:  0.07 miles (129 yards)\n\n\n4.  FIVE-YEAR ACCIDENT HISTORY.\n\nTo date, this Peco facility has had no releases.\n\n\n5.  THE RMP MANAGEMENT PROGRAM.\n\nThe management of the RMP program will be handled by Bruce Johnson.  Mr. Johnson will administrate in conjunction with the Peco management and personnel.  Other entities or organizations that will be coordinated with include the Canton Fire Department and HAZMAT team.\n\n\n6.  THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE SPECIFIC PREVENTION STEPS.\n\nThe Peco facility complies with all applicable Federal, State and Local regulations including the EPAs Accidental Release Prevention Rule.  Our personnel are trained about this during our Hazard Communications Training and through access to our Written Programs.  Our Refrigeration Maintenance operators receive On-The-Job training (OJT).  They are given oral tests and are observed by senior maintenance in order to demonstrate proper job skills and knowledge.  Also, the ammonia system is operated, tested and maintained to the standard of International Institute of Ammonia Refriger"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11539,
      "SummaryText": "ation, the most stringent standards of the industry.\n\n\n7.  THE EMERGENCY RESPONSE PROGRAM.\n\nWe work very closely with the Canton Fire Department and HAZMAT team on emergency preparedness.  We meet periodically with representatives of each to address any changes in the facility or any new concerns.\n\nAlso, we have onsite Hazardous Materials trained personnel to immediately respond to adverse conditions.  This helps minimize the potential of an offsite release.\n\n\n8.  PLANNED CHANGES TO IMPROVE SAFETY.\n\nCurrently, Peco trains and tests all refrigeration technicians.  Our preventative maintenance program is above standard and our ammonia Process Safety Program is reviewed and updated annually.  Our program is improved continuously through annual updates of our written program and annual training of our technicians.  We also take advantage of new technologies when safer and more economical alternatives are available."
    }
  ]
}