{
  "FacilityID": 11579,
  "FacilityName": "Town of Tonawanda Water Treatment Plant",
  "FacilityStr1": "218 Aqua Lane",
  "FacilityStr2": null,
  "FacilityCity": "Tonawanda",
  "FacilityState": "NY",
  "FacilityZipCode": "14150",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36029",
  "LEPC": "Erie County LEPC",
  "FacilityLatDecDegs": "42.965",
  "FacilityLongDecDegs": "-78.923",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Town of Tonawanda",
  "OperatorStr1": "218 Aqua Lane",
  "OperatorStr2": null,
  "OperatorCity": "Tonawanda",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14150",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mr. Sheldon Macon",
  "RMPTitle": "Chief Operator",
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000122379",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Chlorination System",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.96489,
  "FRS_Long": -78.92181,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15517,
      "AltID": "chlorination",
      "FacilityID": 11579,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 15899,
          "ProcessID": 15517,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 19347,
          "ProcessID": 15517,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 519347,
          "ProcessID": 15517,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11579,
      "SummaryText": "This RMP submission applies to the Town of Tonawanda Water Treatment Facility located at 218 Aqua Lane  in the Town of Tonawanda, New York (foot of Sheridan Drive).  The facility supplies potable water to the Town of Tonawanda, and the Village of Kenmore.  In order to disinfect the drinking water, gaseous chlorine is utilized.  This type of system is commonly used at most water treatment plants.  The facility has a maximum capacity of 16 one-ton chlorine cylinders (32,000 pounds) although, at most 8,000 pounds of chlorine are connected to the process (four one-ton cylinders).   Following are the required seven elements for the Water Treatment Plant:\n\nAccidental release prevention and emergency response policies- \nThe Water Treatment Plant complies with all Federal, state, and local requirements for chlorine processes.   The facility was designed and constructed in acordance with applicable industry standards and codes.  In an emergency the facility will call 911 and the local volunteer fire department will respond.  The facility has a written set of emergency response procedures that describes who to call under what conditions.\n\nStationary source and regulated substances handled -\nThe facility is a potable water treatment plant.  The facility has 32,000  pounds of chlorine on-hand at any one time.\n\n Worst case release scenario and alternative release scenario including administrative controls and mitigation measures to limit the distance for each reported scenario-\nThe worst case release scenario is a rupture of a one-ton cylinder which is the largest vessel in the system.  A release from the cylinder would include 2,000 pounds of chlorine.  The release would be a liquid spilled onto the floor in the chlorine cylinder room.   The cylinder  room doors and windows are kept closed which will help mitigate the release.   The liquid will vaporize and form a vapor cloud.  The cloud will be released from the building either via leakage, or by exhausting from the building, "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11579,
      "SummaryText": "over a period of time, by the ventilation system in the cylinder room.   The alternate scenario would consist of a release from a broken cylinder pigtail that connects the chlorine cylinder to the process.  The relief would be into the cylinder storage room.  For both the worst case and alternate release scenarios, chlorine detectors are in place that will detect the release and notify the treatment plant operator, which is on-duty 24 hours per day, seven days per week.  The operator  will in turn follow written procedures for notification of emergency personnel.\n\nGeneral accidental release prevention program and chemical specific prevention steps.\nThe facility complies with EPA's Risk Management Program requirements and all applicable state and local codes and standards in effect at the time the facility was constructed.\n\nFive year accident history-\nThere have not been any releases from this facility in the past 5 years.\n\nEmergency response program-\nIn the event of an emergency the facility will call 911 and request that the local fire department/hazmat team respond to the emergency.   Several members of the Tonawanda Water Plant have appropriate training on the use of personal protective equipment and may assist the fire department with rescue, isolation, and shut-off of the release .  Written emergency response procedures are provided in the facility's Emergency Response Plan.  The local  fire department has trained at the facility and will in the future attend annual drills at the facility.\n\nPlanned changes to improve safety-\nSeveral recommendations were made during the facility's recent process hazard  analysis.  These recommendations are scheduled to be implemented by December 2000."
    }
  ]
}