{
  "FacilityID": 11612,
  "FacilityName": "Guadalupe Cooling",
  "FacilityStr1": "2040 Guadalupe Road",
  "FacilityStr2": null,
  "FacilityCity": "Guadalupe",
  "FacilityState": "CA",
  "FacilityZipCode": "93434",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06079",
  "LEPC": null,
  "FacilityLatDecDegs": "34.989167",
  "FacilityLongDecDegs": "-120.572222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 57652117,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Guadalupe Cooling Co",
  "OperatorStr1": "PO Box 129",
  "OperatorStr2": null,
  "OperatorCity": "Guadalupe",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93434",
  "OperatorZipCodeExt": null,
  "RMPContact": "Danny Vincent",
  "RMPTitle": "Plant Manager",
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000122011",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-01 00:00:00",
  "SafetyInspectionBy": "County Env Health",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.00298,
  "FRS_Long": -120.57038,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15554,
      "AltID": "Refrigeration System",
      "FacilityID": 11612,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 15936,
          "ProcessID": 15554,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 19386,
          "ProcessID": 15554,
          "ChemicalID": 56,
          "Quantity": 23000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 519386,
          "ProcessID": 15554,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11612,
      "SummaryText": "Guadalupe Cooling Company (GCC) is a facility located 1.1 miles north of Guadalupe, CA.  The facility was built in  the early 1980's.  The facility provides refrigeration effect for the removal of field heat from freshly harvested vegetables.  The refrigerant in use is anhydrous ammonia (NH3).  The product that comes to the facility for pre-cooling and short term storage is on site generally less than four days from harvesting.  The facility is a seasonally operated plant with product harvest periods picking up in the month of April and finishing in November.  The remaining months see little fresh product, however the refrigeration equipment is still operative.  Annual maintenance is performed on the equipment during January and February.  GCC has a refrigeration plant manager who is responsible for daily operating and planned maintenance.\n\nGCC has four individuals on staff who have been trained for CFR1910.120(q) emergency response - Technician capability.  Annual refresher training is conducted to maintain the qualifications of these individuals.\n\nGCC is supported by an affiliate company, Western Precooling Systems (WPS), for maintenance and service of the refrigeration equipment.  WPS has staff on site at GCC's location.  WPS employs mechanical staff that have been trained for CFR1910.120(q) emergency response, as well as technical training for the tasks they perform as it relates to the refrigeration equipment.  One of the avenues for training that WPS uses is through the Refrigerating Engineers and Technicians Association (RETA).  WPS sponsors its technicians in that trade association and has personnel who have challenged and successfully passed the RETA Plant Operators Certification Examination.  Other training is through offsite seminars and on-the-job skill development.  Safety tailgate meetings help keep the message of safe operating and safe work behaviors in the foreground of the employee's thinking.\n\nGCC's plant operator performs plant inspections as an "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11612,
      "SummaryText": "ongoing process at the facility.  As equipment maintenance needs are determined the need is expressed at the weekly work load meeting conducted by GCC's plant manager.  The specific repair task or upgrade for the expressed need is decided at the workload meeting and assigned with a due date.  Minutes are maintained of the workload meetings.  Through this regular routine of inspect, discuss, assign and confirmation of completion GCC and WPS have reduced the equipment operational problems and also reduced the release potential.\n\nIn 1995 modifications were made to the piping system that gave more support to the piping.  At that same time GCC added suction trap accumulators to reduce the release from relief valves associated with liquid passing through the screw compressors.  The second most common unwanted release situation involved the process of oil removal from the low temperature portion of the system.  In 1997 special self-closing valves were installed as a permissive for oil drain flow.  If a release were to develop during the oil draining task the mechanic simply releases the handle of the self-closing valve and flow is terminated.  GCC has installed  these types of valves at oil drain points.\n\nOther release prevention steps taken at SWC:\n-  GCC has enclosed the facility with fencing and gates to limit access to the facility to increase the security of the facility from potential 'wrong-do-er's\".\n-  All employees are trained for hazard communication (discovery and communicating) for releases, fires, vandals, etc.  Training is documented through the \"Personal Qualifications Standard\" booklet which is in each employees training record file.\n-  A strong relationship exists with the California Forestry Department (CDF)  Fire Department.  There have been demonstrations and tours of the system with the first responding engine companies to familiarize the crews with the facility layout and where hazardous areas are located.\n-  The engine room is computer controlled wit"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11612,
      "SummaryText": "h telephone access for monitoring and parameter changes.  The equipment may be shut down from off site via phone if it were not possible to directly access the control area.\n-  There is an automatic dialing machine that is connected to the computer control.  When there is an equipment failure, or when the pressures are rising and approaching the shut down setting, or if there is a power failure, this autodialer begins calling out to eight successive phone numbers to summon technicians to solve the problem.\n-  GCC proactively trains its personnel in the benefits of good housekeeping.  There is a staff to maintain the general appearance of the facility on a day to day basis.\n\nThe policy at GCC is to not have emergencies.  This is accomplished by due diligence with the thoughts of \"prevention, preparation, mitigation, response & recovery.  There have been no reportable releases at GCC in the past five years.  However, there is a need to be prepared to respond to and mitigate a release situation.  The GCC staff is trained to communicate to WPS and the CDF Fire Department and to evacuate (shelter in place or evacuate off site) when there is a release situation or fire.  GCC employees and managers are trained to shepherd visitors (truck drivers receiving product or delivering product) when there is an emergency.  By effectively determining all persons are safe, the intergrated emergency response with CDF Fire can more swiftly manage the tactical part of the response.\n\nGCC has trained individuals (CFR1910.120(q) First Responder - Technician) who are trained to respond to, size up and mitigate a release situation.  WPS personnel have served as industry liason at incident command during response situations and as entry team participants at other facilities in Ventura County over the years (again, the problem was not at GCC)."
    }
  ]
}