{
  "FacilityID": 11637,
  "FacilityName": "Queen City Terminals, Inc.",
  "FacilityStr1": "3806 Kellogg Avenue",
  "FacilityStr2": "Carrell St.",
  "FacilityCity": "Cincinnati",
  "FacilityState": "OH",
  "FacilityZipCode": "45226",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39061",
  "LEPC": "Hamilton County LEPC",
  "FacilityLatDecDegs": "39.106389",
  "FacilityLongDecDegs": "-84.435278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 71270656,
  "ParentCompanyName": "Delta Termianl Services, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Queen City Terminal",
  "OperatorStr1": "3806 Kellogg Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Cincinnati",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45226",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gary Sampson",
  "RMPTitle": "Vice President",
  "FTE": 12,
  "OtherEPAFacilityID": "OH0000626176",
  "EPAFacilityID": "100000123706",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-26 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2008-02-22 00:00:00",
  "DeRegistrationEffectiveDate": "2008-02-05 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.11016,
  "FRS_Long": -84.43727,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Vinyl acetate monomer was removed from this facility",
  "_processes": [
    {
      "ProcessID": 15581,
      "AltID": "Vinyl Acetate Monomer",
      "FacilityID": 11637,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 15964,
          "ProcessID": 15581,
          "NAICSCode": "49311",
          "_desc": {
            "NAICS_CODE": "49311",
            "NAICS_DESCRIPTION": "General Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 19413,
          "ProcessID": 15581,
          "ChemicalID": 29,
          "Quantity": 5800000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 519413,
          "ProcessID": 15581,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11637,
      "SummaryText": "The accidental release prevention and emergency response policies at your facility:  This facility uses OPA 90 - Oil Pollution Act (33 CFR 154) and SPCC (40 CFR 112) rules to manage the release prevention and emergency response activities.  It is our policy to adhere to all applicable federal, state, and local laws.  If an emergency were to occur, it is our policy to follow the emergency procedures outlined in our 1999 Federal Oil Pollution Act Oil Spill Contingency and Response Plan of: Queen City Terminal, Inc. Chemical Liquid and Bulk Transfer and Storage Plant.  The procedures in our Contingency and Response Plan include shutting down as promptly as possible the operation and notifying the Terminal Manager and the United States Coast Guard.\n\nA description of your facility and the regulated substances handled:  This facility manages liquid and bulk transfer of chemicals.  We receive and ship material by water, rail and truck.  The facility manages the regulated substance, vinyl acetate monomer.\n\nThe worst-case and alternative release scenarios:  Our worst-case scenario is failure of one 860,627-gallon storage tank when 90% filled.  The tanks is limited to 90% by an internal floating roof.  The resulting distance to the endpoint extends offsite.  The tank is located within a dike that mitigates the spill and the endpoint distance is 9.8 miles.  Our alternative release scenario is an operator failure that allows 400-gallons of material to be released during loading operations.  The spill is located outside the large diked area but inside a smaller containment area.  The resulting alternative case distance is .2 miles.\n\nThe general accidental release prevention program and chemical-specific prevention steps:  This facility complies with EPA's accident prevention rule and all applicable state and local codes and regulations.  The vinyl acetate system is maintained in accordance with good engineering practice and as mentioned above.\n\nFive-year accident history:  Queen"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11637,
      "SummaryText": " City Terminal, Inc. has not had an accident involving vinyl acetate that caused injuries, property or environmental damage, evacuations, or shelterings in place in the past five years.\n\nThe emergency response program:  In the event of an emergency involving our vinyl acetate process, it is our policy to follow the guidelines outlined in our 1999 Federal Oil Pollution Act Oil Spill Contingency and Response Plan of: Queen City Terminal, Inc. Chemical Liquid and Bulk Transfer and Storage Plant and our SPCC plan.  Our Contingency and Response manual was recently updated and is intended for the protection of the employees of Queen City Terminal, Inc. and our neighbors surrounding our plant.  The plan ensures that the most efficient methods of response by certified individuals can take place during a possible incident.\n\nAmong other things, our plans cover emergency response actions, notification procedures, facility spill mitigation procedures, facility response activities, disposal plan, training, drills, and plan update procedures.  The plan is also intended as a reference source to familiarize the United States Coast Guard (USCG), local emergency response agencies, and fire and police departments on operations at Queen City's facility.\n\nIn the event of a chemical emergency at the Queen City facility, the general manager, the USCG, and the police and fire departments are notified immediately. There are two secondary contacts in the event that the general manager is not immediately available.  The emergency commanders have complete authority to commit all resources of the company to carry out the Emergency Response Contingency Plan in the event of an emergency.  The contingency plan contains a contact list that includes the USCG, the police department, the Ohio EPA, the fire department and, emergency response contractors.\n\nPlanned changes to improve safety:  None."
    }
  ]
}