{
  "FacilityID": 11715,
  "FacilityName": "Consumers Pennsylvania Water Co.-Shenango Valley",
  "FacilityStr1": "644 north Water Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Sharon",
  "FacilityState": "PA",
  "FacilityZipCode": "16146",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42085",
  "LEPC": "Mercer County LEPC",
  "FacilityLatDecDegs": "41.2425",
  "FacilityLongDecDegs": "-80.512778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5281113,
  "ParentCompanyName": "Philadelphia Suburban Corporation",
  "Company2Name": null,
  "CompanyDUNS": 48341648,
  "Company2DUNS": 0,
  "OperatorName": "Consumers Pennsylvania Water Co.",
  "OperatorStr1": "665 South Dock St.",
  "OperatorStr2": null,
  "OperatorCity": "Sharon",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "16146",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000124803",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1992-11-18 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.24134,
  "FRS_Long": -80.51317,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15671,
      "AltID": null,
      "FacilityID": 11715,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 19527,
          "ProcessID": 15671,
          "ChemicalID": 62,
          "Quantity": 36000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 16062,
          "ProcessID": 15671,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8065,
              "Process_NAICS_ID": 16062,
              "SafetyReviewDate": "1999-05-12 00:00:00",
              "PHA_Date": "1999-06-04 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-12 00:00:00",
              "TrainingReviewDate": "1999-05-12 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-20 00:00:00",
              "EquipmentInspectionDate": "1999-04-12 00:00:00",
              "EquipmentTested": " Chlorine leak detectors and evaporator",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-10 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-09 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-10 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Our chlorine system includes several pieces of equipment that together comprise a single process unit. Further description is not required.",
              "_chemicals": [
                {
                  "PrimaryKey": 11098,
                  "PreventionProgram3ID": 8065,
                  "ProcessChemicalID": 19527
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11715,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Mercer County EMA",
    "CoordinatingAgencyPhone": "7246622603",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11715,
      "SummaryText": "                                         Consumers Pennsylvania Water Company\n                                                     Risk Management Plan\n                                                       Executive Summary\n                                                           June 1999\n\n\nGeneral statement:   Consumers Pennsylvania Water Company recognizes the importance of safety in the workplace and its responsibility to have an established comprehensive safety program in place. Top management supports our efforts through the guidance of a risk management assessment team that oversees how we conduct our business and identifies through safety audits where we need to focus our efforts to reduce the potential risks to the Company's infrastructure, its employees, customers, and our community. We have a safety officer that oversees middle management's  compliance to all aspects of the Company's safety policies as well as State and Federal government regulations.\n      Safety meetings are conducted, training sessions and equipment are provided to employees so work can be conducted in a safe work place. Accident reports and follow up investigations are conducted, and deficiencies are corrected to reduce the chance of future occurrences. Employees and management have a joint \"statement of commitment\" that strives to provide a safe work environment.\n\nThe facility and regulated substances:  Consumers Pennsylvania Water Company owns and operates a water treatment plant on the Shenango River approximately .75 of a mile north of the center of the town of Sharon, Pennsylvania. It is located is an industrial district which borders a residential neighborhood. There are multiple structures onsite that include brick buildings for processing and purification, open water storage basins for retention, steel water storage tank, as well as an underground reservoir for holding the final product.\n        We pump water out of the Shenango River and process it into drinking water that"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11715,
      "SummaryText": " meets all current State and Federal government regulations. The plant produces about 10 million gallons\nof water a day to serve a population of approximately 75,000 people in several area communities.\n           In the process we use chlorine gas as a disinfecting agent. The product is delivered in standard one ton cylinders and is stored inside a building designed to accommodate it. Special equipment and monitors as well as trained employees all contribute to the safe handling, storage, and delivery of the chemical. Normal supply on hand is usually around 15 to 20 tons of chlorine.\n\nWorst case and alternative releases:   The Company hired an outside consultant to conduct this important portion of our RMP. CH2MHILL did the analysis using USEPA-approved Dense Gas Release Model to project the impact. The study used other USEPA-approved methods in its analysis.\n            The worst case scenario assumes the entire release of a full one ton cylinder over a period of ten minutes. This unlikely occurrence would have an impact radius of 1.4 miles from the plant and would affect a population of about 600 people and approximately 7 businesses. A mitigation factor of .55 assumes the building doors are closed and the leaking cylinder is inside the building.  The Company realizes the gravity of this scenario and therefore train our staff to minimize it chances of occurring. Ton cylinders are only moved in accordance with recommended procedures - safety covers and warning tags are in place, hoist and lift equipment get inspected, and employee training focuses on leak prevention and consequences. Two man teams double check each other's procedures.\n\n            The alternative scenario assumes a pinhole leak in the gas piping system. The impact radius of such an occurrence is .7 miles and would affect approximately 300 people and 3  businesses.  The same passive mitigation factor of .55 is assumed but it is the active mitigation factor that also makes this leak scenario unlikely"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11715,
      "SummaryText": ". Our entire gas piping system was replaced in \nand in the process updated safety features were added. Therefore a pinhole leak due to corrosion should not occur. Sensitive leak detector sensors alert the operator allowing him to react swiftly while the leak is in its earliest stages, reducing a more serious situation. Training for all the staff keeps them knowledgeable in first, what to do to prevent a leak, and second, what to do if such a leak does occur.\n\nGeneral accidental release prevention program:  Because of the nature of our business we fall under the Federal OSHA regulations in particular the process safety management ones. In addition we use the guidelines provided by our supplier and the Chlorine Institute regarding safe handling, storage, operation, and leak detection. Again we emphasize the importance of well trained employees as our strongest accident prevention measure.  Hands on demonstration from our supplier, use of training videos, and review at safety meetings all contribute to minimizing the chance of chlorine leaks. HAZCOM training also aids in the proper handling and respect for the chlorine gas.\n\nFive year accident history:  There were no reportable accidents in the five years prior to this report.\n\nEmergency response program:  The Company has a updated \"Contingency Plan\" that addresses numerous problems related to operations at the water company. Company policies regarding chain of command, communications, first action levels, and evacuation plans are a part of this plan. We have a good relationship with the local fire department and the Mercer County Emergency Planning Agency as well as our regional PA.DEP office.\n\nPlanned safety upgrades:   Construction is currently underway to build a completely new water treatment plant.  In the design stage we made improvements to the new system to further reduce the chances of an accidental release of chlorine by switching to a vacuum delivery system, made provisions for a future scrubber, better sec"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11715,
      "SummaryText": "urity, and isolation and containment of the physical storage room. Automatic switchover from empty to full cylinders will reduce unnecessary operations and human exposure.  Training will continue to be a top priority in support of this document. \n\nSummary:    Consumers Pennsylvania Water Company is proud of our outstanding safety record that goes back many years of an accident free work environment. We are committed to employee safety and their welfare and to the local communities that support us."
    }
  ]
}