{
  "FacilityID": 11725,
  "FacilityName": "M'Kean Maffitt Wastewater Treatment Plant",
  "FacilityStr1": "3436 River Road",
  "FacilityStr2": null,
  "FacilityCity": "Wilmington",
  "FacilityState": "NC",
  "FacilityZipCode": "28412",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37129",
  "LEPC": "New Hanover County LEPC",
  "FacilityLatDecDegs": "34.164444",
  "FacilityLongDecDegs": "-77.943333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ci.wilmington.nc.us/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Wilmington, NC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Wilmington",
  "OperatorStr1": "P.O. Box 1810",
  "OperatorStr2": null,
  "OperatorCity": "Wilmington",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28402",
  "OperatorZipCodeExt": "8811",
  "RMPContact": "Kenneth L. Vogt, Jr.",
  "RMPTitle": "Sup't of Wastewater Treatment",
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000016332",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-10-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-06-24 00:00:00",
  "DeRegistrationEffectiveDate": "2020-06-05 00:00:00",
  "AnniversaryDate": "2004-05-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.17453,
  "FRS_Long": -77.94838,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15685,
      "AltID": "Wastewater Treatment",
      "FacilityID": 11725,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16076,
          "ProcessID": 15685,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 19544,
          "ProcessID": 15685,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 519544,
          "ProcessID": 15685,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11725,
      "SummaryText": "City of Wilmington\nWilmington, NC\n\nExecutive Summary\n\nThe City of Wilmington has implemented a comprehensive program to safely manage chlorine at its two wastewater treatment plants located in the City of Wilmington. There have been no chlorine incidents in the most recent Five-Year history period.\n\nIn 1996, a Process Safety Management (PSM) program was initiated at the Plants with the assistance of Operations Excellence Consulting, Inc., a safety consulting firm. A PSM Implementation Manual was edited to be site specific and issued to the Wastewater Treatment Plants. With this step, approximately 50% of PSM requirements were met. \n\nKey items included in the manual were:\n\n- Written site-specific procedures for Employee Involvement, Management of Change, Incident Investigation, Pre-Startup Reviews and Self-Audits.\n\n- Chlorine safety information as required by the regulations\n\nNext, these additional steps were implemented to bring the PSM program to full compliance:\n\n -Training on PSM and its key components including Management of Change, Mechanical Integrity and Incident Investigation.\n\n-Conducting  Process Hazards Analyses for the two chlorine processes\n\n-Developing Standard Operating Procedures for safe Chlorine Management\n\n-Developing a Maintenance Program for the chlorine systems at each plant\n\n-Developing an initial Emergency Response Plan\n\n-Training in support of the certification of operators\n          \nThe supervisor, chief operator and several plant operators meet several times per year to review and update procedures and to maintain compliance with all aspects of the PSM regulation.\n\nIn addition to PSM compliance, the plants have implemented a number of programs to improve the safe handling of chlorine.\n\n- The chlorine delivery systems at the plants have been upgraded to vacuum processes over the past 10 years. This process has proven to greatly reduce leaks by reducing the amount of equipment that is exposed to pressurized chlorine.\n\n- Chlorine leak detect"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11725,
      "SummaryText": "ion alarm systems have been upgraded at both plants. These systems will allow an early detection and response to any chlorine leak.\n\nFuture projects will evaluate alternatives to chlorine for disinfection.\n\nThe site's Emergency Response Plans have been significantly upgraded. In 1997, the ERP was revised to include offsite response and communication.  Chlorine Response Drills have been routinely conducted since 1998. \n\nTo further understand chlorine risks, Operations Excellence Consulting, Inc., a safety consulting firm was contracted to conduct \"Offsite Consequence\" Modeling Analysis, as required by EPA's Risk Management Program. Both \"Worst Case\" and \"Alternative Case\" chlorine release scenarios were studied for each site.\n\nThe results showed that the risk of chlorine exposure varies depending on the plant's location:\n\n- The James A. Loughlin Wastewater Treatment Plant is located on the north side of the City of Wilmington at 2311 North 23rd Street. The plant is located on the banks of Smith Creek and the plant's elevation is slightly lower than the surrounding land. This elevation difference is not pronounced, only five to ten feet. Given the heavier-than-air property of chlorine, with wind from the north or with little or no wind, a chlorine release will flow to the creek and dissipate.  However, a wind form the south, southeast or southwest can carry a chlorine release into surrounding neighborhoods including the airport. \n\n- The M'Kean Maffitt Wastewater Treatment Plant is located in the southwest side of Wilmington at 3436 River Road. The plant is located on the banks of the Cape Fear River. With little to no wind, any chlorine release will fall to the river where it will be contained and dissipated. A strong wind from the south, southeast or southwest can carry a chlorine release into surrounding land areas. Much of this land is forested which will help dissipate the release. \n\nIn addition to Process Safety Management, the organization has an active safety p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11725,
      "SummaryText": "rogram. The City of Wilmington has had an active Safety Committee. The committee meets monthly with representatives from each function and each site.  The committee's duties include reviewing new safety procedures, accident investigations, safety surveys and safety communications. \n\nWithin the Utilities Department, there are monthly safety meetings conducted by each Division. Within the Wastewater Treatment Division (WWTD), there is a review on an OSHA subject or a discussion on a specific wastewater safety issue. \n\nThe WWTD safety program involves the following activities:\n\n- Conducting accident reviews for prevention/minimization;\n- Conducting safety inspections for all WWTD facilities;\n- Disseminating City and Public Utilities Department safety policies to WWTD staff;\n- Preparing and conducting the WWTD's safety training program including such topics as hazard communication, personal protective equipment, confined space and lockout/tagout;\n- Verifying performance of section level training programs;\n- Addressing safety issue referrals;\n- Soliciting WWTD staff safety program input;\n- Identifying mandatory regulatory agency-required safety training needs; \n- Recognizing exemplary safety performance\n\nAs a result of our programs, the plants have had a strong safety record with no loss time accident over the past three years. We plan to continue our emphasis on safety to maintain and improve our safety performance.\n\nReport by:\n                                                               \nKenneth L Vogt,  Jr.\n\nSuperintendent of Wastewater Treatment\nCity of Wilmington, North Carolina"
    }
  ]
}