{
  "FacilityID": 11754,
  "FacilityName": "Monsanto Co. Crop Protection - Fayetteville, NC.",
  "FacilityStr1": "Hwy 53E & 210S, Cedar Creek Rd",
  "FacilityStr2": null,
  "FacilityCity": "Fayetteville",
  "FacilityState": "NC",
  "FacilityZipCode": "28301",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37051",
  "LEPC": "Cumberland County LEPC",
  "FacilityLatDecDegs": "34.985389",
  "FacilityLongDecDegs": "78.781639",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "G3",
  "LatLongDescription": "PG",
  "FacilityURL": "WWW.Monsanto.com",
  "FacilityEmailAddress": "WWW.monsanto.com",
  "FacilityDUNS": 42625988,
  "ParentCompanyName": "Monsanto Co.",
  "Company2Name": null,
  "CompanyDUNS": 42625988,
  "Company2DUNS": 0,
  "OperatorName": "Monsanto Co.",
  "OperatorStr1": "800 N Lindberg Blvd",
  "OperatorStr2": null,
  "OperatorCity": "St. Louis",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "63167",
  "OperatorZipCodeExt": null,
  "RMPContact": "P. Jason Quevedo",
  "RMPTitle": "Safety Specialist",
  "FTE": 131,
  "OtherEPAFacilityID": "NCDO88563242",
  "EPAFacilityID": "100000124448",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "04319R14",
  "SafetyInspectionDate": "1998-09-25 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2002-03-13 00:00:00",
  "DeRegistrationEffectiveDate": "2001-12-31 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.97778,
  "FRS_Long": -78.78222,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15731,
      "AltID": "Amination",
      "FacilityID": 11754,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16122,
          "ProcessID": 15731,
          "NAICSCode": "32532",
          "_desc": {
            "NAICS_CODE": "32532",
            "NAICS_DESCRIPTION": "Pesticide and Other Agricultural Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 19594,
          "ProcessID": 15731,
          "ChemicalID": 109,
          "Quantity": 162000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 109,
            "ChemicalName": "Isopropylamine [2-Propanamine]",
            "CASNumber": "75-31-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 519594,
          "ProcessID": 15731,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 15732,
      "AltID": "Ammonium Glyphosate",
      "FacilityID": 11754,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16123,
          "ProcessID": 15732,
          "NAICSCode": "32532",
          "_desc": {
            "NAICS_CODE": "32532",
            "NAICS_DESCRIPTION": "Pesticide and Other Agricultural Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 19595,
          "ProcessID": 15732,
          "ChemicalID": 57,
          "Quantity": 100080.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 519595,
          "ProcessID": 15732,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11754,
      "SummaryText": "RMP Executive Summary\nMonsanto - Fayetteville, NC\n\nMonsanto is a life science company committed to finding solutions to the growing global needs for food and health by sharing common forms of science and technology among agriculture, nutrition and health.  The companys 30,000 employees worldwide make and market high-value agricultural products, pharmaceuticals and food ingredients.  We are committed to pursuing these goals in sustainable ways that meet peoples needs without compromising future generations ability to meet their needs.\n\nOne of the locations contributing to this vision is Monsanto's Fayetteville facility, located at Hwy. 53E & 210S, Cedar Creek Road, Fayetteville, North Carolina.  We are manufacturing facility that employees 130 people. The facility has been located in the community since May 1967, initially built by Rohm and Haas Corporation, until acquired by Monsanto in January of 1978.  \n\nAs part of our operations, we handle quantities of both Isopropylamine and Aqua Ammonia (concentration >20%) in sufficient quantities to require compliance with the EPAs RMP regulation.  The major elements of the RMP rule are very similar to OSHAs PSM regulation.  In other words, managing risk on a daily basis is nothing new at Monsantos Fayetteville facility .  \n\nNorth Carolinas, state OSHA program, conducted an audit of our facility under their Voluntary Protection Program (VPP) and, in 1994, we were awarded their highest rating - STAR.  We were the first manufacturing facility in North Carolina to receive this accreditation.  In 1997, NC-OSHA re-certified the facility as a STAR site.  Receipt of this award demonstrates our commitment to the safety and health of employees and the surrounding community as well as protection of the environment.\n\nOur location has a documented Emergency Response plan which includes defined responsibilities and actions to be implemented for a number of events, including inclement weather, fire and toxic chemical releases.  The"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11754,
      "SummaryText": "re are personnel responsible for implementation of this procedure on site at all times.  In general, the plan describes actions which result in a safe response for company employees as well as prompt notification of community organizations.  The plan has been integrated with the Cumberland County Local Emergency Planning Committee (LEPC) and the Vander Volunteer Fire Department.  Should an incident occur which could jeopardize the safety and health of personnel in the area surrounding Monsantos Fayetteville facility, the following events would occur:\n\n    -Monsanto's emergency response team would respond to the incident,\n    -the Vander Volunteer Fire Department and Cumberland County LEPC would be notified, and\n-the facilitys notification system would be utilized to notify community members of a plant upset.\n\nDuring the past 5 years, ZERO RMP events have occurred. \n\nOur location handles two chemicals regulated by the RMP, Isopropylamine and Aqua Ammonia (concentration >20%).  The consequences of two release scenarios for each chemical has been calculated using methods provided by the EPA.  The worst case scenario for each chemical requires that the entire contents of the storage vessel be discharged to the atmosphere in a 10 minute period. The \"worst case scenario\" is a very unlikely event, and in some cases could not occur as assumed, for example complete release to air in 10 minutes,  according to the laws of physics.  \n\nOur toxic worst case scenario is failure of an aqueous ammonia storage tank containing 100,080 pounds of 30 weight percent of aqueous ammonia.  The aqueous ammonia is into a 2020 square foot dike which mitigates the release.   A toxic cloud is formed by the evaporating ammonia which would reach off-site endpoints.\n\nOur flammable worst case scenario is failure of an Isopropylamine storage tank containing 162,000 pounds at  99.5 percent pure.  The event is a vapor cloud explosion of Isopropylamine which would reach off-site endpoints.\n\nThe regulation al"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11754,
      "SummaryText": "so requires an analysis of alternate release scenarios.  For both Isopropylamine and Aqua Ammonia (concentration >20%) scenarios, Monsanto has selected failure of a unloading hose during the unload process of these chemicals.  We estimated that these incidents would be controlled in 5 minutes.  The details for each of these four incidents have been shared with the Cumberland County LEPC for integration into the community emergency response plan.\n\n We employ a comprehensive collection of safety systems to maintain the equipment and work practices utilized in our operation.  Some examples include:\n\n7 A Process Hazard Analysis (PHA) is conducted every 5 years or more frequently.  This involves a team of experts who review the hazards posed by the chemical, best industry practices for handling the material and a defined system to identify hazards.  Recommendations for improvement are made and priority placed on implementing them in an prompt manner.\n7 Our mechanical integrity system requires regular inspection of the equipment, relief devices and other systems utilized in handling the material.\n7 Procedures have been developed to provide detailed actions for employees operating the equipment.  They are reviewed annually with active involvement from operating personnel.\n7 A management of change system is utilized for modifications to equipment and operating parameters.  Each change is appropriately reviewed by a team of personnel to determine if there is any impact to system safety.\n7 The site utilizes a number of contract personnel for a variety of services.  Our Contractor/Guest program requires that contractors be selected using their actual safety performance as a criteria and open communication must exist between Monsanto and contract employees to identify and control hazards.\n\nIn addition, we utilize a number of systems for specific chemicals.  Examples include:\n\n7 Isopropylamine and Ammonia area monitors to quickly detect leaks,\n7 Water sprinkler and deluge system"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11754,
      "SummaryText": "s to extinguish fires, and\n7 Excess flow indicators which will stop flow under undesired conditions.\n\nBoth the general and chemical specific systems work together to minimize the frequency and consequences of chemical releases.\n\nMaintaining and improving the safety of our operations is a core value at Monsanto and this location.  In the immediate future:\n7 OSHA will reassess our status as a VPP Star location in 2000, a rating we are committed to maintaining,\n7 We look forward to working with the LEPC in updating the community emergency response plan over the next 1-2 years.  This effort will review the existing plan and make appropriate changes based on the RMP information.\n\nThis brief summary provides some insight into the extensive system Monsanto utilizes to maintain safe operations.  If you would like additional information about Monsanto, please visit our Internet home page at www.monsanto.com.  If you have questions about this RMP, please contact us at (910) 323-3300."
    }
  ]
}