{
  "FacilityID": 11803,
  "FacilityName": "Advanced Cooling Co",
  "FacilityStr1": "10241 So. Ave 4E",
  "FacilityStr2": null,
  "FacilityCity": "Yuma",
  "FacilityState": "AZ",
  "FacilityZipCode": "85365",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04027",
  "LEPC": null,
  "FacilityLatDecDegs": "32.7125",
  "FacilityLongDecDegs": "-114.384444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 148858426,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Advanced Cooling Co",
  "OperatorStr1": "10241 So. Ave 4E",
  "OperatorStr2": null,
  "OperatorCity": "Yuma",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85365",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dan Day",
  "RMPTitle": "Manager",
  "FTE": 21,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000124509",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.7125,
  "FRS_Long": -114.38444,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15788,
      "AltID": "Refrigeration System",
      "FacilityID": 11803,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16182,
          "ProcessID": 15788,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 19656,
          "ProcessID": 15788,
          "ChemicalID": 56,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 519656,
          "ProcessID": 15788,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11803,
      "SummaryText": "Advanced Cooling Co is a facility located in Yuma, AZ in a commercial/ industrial area outside of the city.  The facility was built in the late 1980's.  The facility provides refrigeration effect for the removal of field heat from freshly harvested vegetables.  The refrigerant in use is anhydrous ammonia (NH3 ).  The product that comes to the facility for pre-cooling and short term storage is on site generally for four days from harvesting.  The facility is a seasonally operated plant with product harvest periods picking up in the month of October and finishing in April.  In June the facility operates for 5 weeks cooling fresh melons.\n\nAdvanced Cooling Co has maintenance personnel and is also supported by an affiliate company, Western Precooling Systems (WPS ), for maintenance and service of the refrigeration equipment.  WPS has offices and staff in Yuma adjacent to the facility.  WPS employs mechanical staff that has been trained for CFR 1910.120(q) emergency response, as well as technical training for the tasks they perform as it relates to the refrigeration equipment.  One of the avenues for training that WPS uses is through the Refrigerating Engineers and Technicians Association (RETA).  WPS sponsors its technicians in that trade association and has personnel who have challenged and successfully passed the RETA Plant Operators Certification Examination.  Other training is through offsite seminars and on-the-job skill development.  Bi-weekly safety tailgate meetings help keep the message of safe operating and safe work behaviors in the foreground of the employee's thinking.\n\nWPS performs plant inspections at the facility.  As equipment maintenance needs are determined the need is expressed at the weekly work load meeting conducted by WPS's area manager.  The specific repair task or upgrade for the expressed need is decided at the workload meeting and assigned with a due date.  Minutes are maintained of the workload meetings.  Through this regular routine of inspe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11803,
      "SummaryText": "ct, discuss, assign and confirmation of completion Advanced Cooling and WPS have reduced the equipment operational problems and also reduced the release potential.\n\nIt has become apparent in the industry that mishaps while draining oil from the system is one of the most common incidents to occur.  Special self-closing valves were installed as a permissive for oil drain flow.  If a release were to develop during the oil-draining task the mechanic simply releases the handle of the self-closing valve and flow is terminated.  WPS has installed these types of valves at oil drain points.\n\nOther release prevention steps taken at Yuma American Cooling:\n7 Advanced Cooling  is enclosed with fencing and gates to limit access to the facility to increase the security of the facility from potential \"wrong-do-er's\".\n7 All employees are trained for hazard communication ( discovery and communicating ) for releases, fires, vandal's etc.  Training is documented through the \"Personal Qualifications Standard\" booklet which is in each employees training record file (WPS).\n7 Advanced Cooling proactively trains its personnel in the benefits of good housekeeping.  There is a staff to maintain the general appearance of the facility on a day to day basis.\n\nThe policy at Advanced Cooling is to not have emergencies.  This is accomplished by due diligence with the thoughts of \"prevention, preparation, mitigation, response & recovery\".  There have been no reportable releases at Advanced Cooling in the past five years.  However, there is a need to be prepared to respond to and mitigate a release situation.  The Advanced Cooling Co staff is trained to communicate to WPS and the Fire Department and to evacuate ( shelter in place or evacuate off site ) when there is a release situation or fire.  Advanced Cooling Co employees and managers are trained to shepherd visitors ( truck drivers receiving product or delivering product ) when there is an emergency.  By effectively determining all persons are sa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11803,
      "SummaryText": "fe, the integrated emergency response with the Rural Metro Fire Department can more swiftly manage the tactical part of the response.\n\nWPS has trained individuals ( CFR 1910.120(q) First Responder Technician ) who are trained to respond to, size up and mitigate a release situation.  In 1994 WPS personnel served as observers in an integrated response simulation with the Yuma County Local Emergency Planning Committee.  WPS personnel have served as industry liaison at the incident command during response situations and as entry team participants at other facilities in Oxnard and Ventura County over the years (again, the problem was not at Yuma American Cooling)."
    }
  ]
}