{
  "FacilityID": 11806,
  "FacilityName": "Rocky Hill Water Pollution Control Facility",
  "FacilityStr1": "80 Goff Brook Lane",
  "FacilityStr2": null,
  "FacilityCity": "Rocky Hill",
  "FacilityState": "CT",
  "FacilityZipCode": "06067",
  "Facility4DigitZipExt": "1603",
  "FacilityCountyFIPS": "09003",
  "LEPC": "Rocky Hill LEPC",
  "FacilityLatDecDegs": "41.683333",
  "FacilityLongDecDegs": "-72.645833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.themdc.com",
  "FacilityEmailAddress": "mmunoz@themdc.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "The Metropolitan District (MDC)",
  "Company2Name": null,
  "CompanyDUNS": 49182751,
  "Company2DUNS": null,
  "OperatorName": "The Metropolitan District (MDC)",
  "OperatorStr1": "555 Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Hartford",
  "OperatorStateFIPS": "CT",
  "OperatorZipCode": "06142",
  "OperatorZipCodeExt": "0800",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000124643",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-09-29 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2012-06-06 00:00:00",
  "DeRegistrationEffectiveDate": "2012-02-22 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.683333,
  "FRS_Long": -72.645833,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15791,
      "AltID": "Chlorination System",
      "FacilityID": 11806,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 19659,
          "ProcessID": 15791,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 16185,
          "ProcessID": 15791,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8170,
              "Process_NAICS_ID": 16185,
              "SafetyReviewDate": "1999-04-20 00:00:00",
              "PHA_Date": "1998-12-28 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-03-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-11-11 00:00:00",
              "TrainingReviewDate": "1999-04-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": "Practice changeovers with chlorine container with trainer",
              "MaintenanceReviewDate": "1998-11-17 00:00:00",
              "EquipmentInspectionDate": "1999-06-17 00:00:00",
              "EquipmentTested": "Chlorine leak detectors tested.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1997-09-16 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1997-09-16 00:00:00",
              "HotWorkPermitReviewDate": "1997-09-16 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1997-09-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 11221,
                  "PreventionProgram3ID": 8170,
                  "ProcessChemicalID": 19659
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11806,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-03-04 00:00:00",
    "ERTrainingDate": "1999-04-20 00:00:00",
    "CoordinatingAgencyName": "Rocky Hill LEPC",
    "CoordinatingAgencyPhone": "8602587640",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11806,
      "SummaryText": "Introduction\n\nThe Metropolitan District's (MDC) Rocky Hill Water Pollution Control Facility (RHWPCF), operating since 1957, is located at 80 Goff Brook Lane in Rocky Hill, CT.  Wastewater from Rocky Hill and several surrounding communities is treated at the RHWPCF, and final effluent is discharged into the Connecticut River.  The wastewater treatment process includes preliminary screening, primary settling and treatment, secondary treatment and clarification, sludge processing, and chlorination of the final effluent before discharge.  The RHWPCF handles wastewater flows averaging 6.1 million gallons per day.\n\nChemicals are widely used in industry, in the home and in the environment.  They are transported on roads, water and railways.  The natural world contains more than 1,500 chlorine-containing compounds.  Human cells generate hypochlorite, a form of chlorine, to fight infection.  Chlorine purifies our drinking water, disinfects our swimming pools and is truly life saving.  The RHWPCF uses chemicals, too.  For example, they use chlorine to disinfect treated wastewater prior to discharge to the environment.\n\nStoring and using chemicals can be hazardous if not done properly.  The RHWPCF takes safety obligations in handling chemicals seriously.  MDC has used chlorine at the RHWPCF for over 30 years without an accidental release.  MDC employees receive extensive on-going chlorine safety training.\n\nThis document summarizes MDC's existing safety systems, policies, procedures, and on-going actions that are designed to prevent or minimize impacts of accidental releases of chlorine to the environment.\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe RHWPCF Risk Management Plan (RMP) complies with the U.S. Environmental Protection Agency's (EPA's) Risk Management Program, under Section 112 (r) of the Clean Air Act (CAA) Amendments of 1990, 40 Code of Federal Regulations (CFR) Part 68.  The Risk Management Program requires facilities that use certain subs"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11806,
      "SummaryText": "tances to develop a plan to reduce the likelihood of an accidental release of the substances to the atmosphere and reduce the likelihood of serious harm to the public and the environment.\n\nThe RHWPCF has a chlorination system that uses chlorine gas fed from chlorine one-ton containers.  Chlorine is stored in a quantity above the regulatory threshold (2,500 lbs.) at which a RMP is required.  The RHWPCF has prepared a detailed and comprehensive Emergency Action Plan to handle any potential releases.  The Emergency Action Plan, along with the RMP program, describes what actions to take in the event of a release and how to prevent any releases from occurring.\n\nMDC is committed to protecting its employees, the public, and the environment from any releases of hazardous materials used at its facilities.  Throughout its history, MDC has had an excellent record in accident prevention.\n\n\nChlorine\n\nChlorine is used to disinfect the treated wastewater prior to discharging it to the Conneticut River during the months of May through September.  The objective of chlorinating the wastewater is to destroy pathogenic microorganisms contained in the wastewater.  Wastewater disinfection prevents the spread of diseases and protects surface waters used for recreation and as a habitat for aquatic life.\n\nChlorine is non-explosive and non-flammable, but, like other chemicals, it is capable of combustion under certain circumstances.  It is also a respiratory irritant.  Exposure through inhalation or eye or skin contact can cause severe health problems.  The RHWPCF has several safety systems that are a part of the chlorine system.  These safety systems, along with the Prevention Program described below, greatly reduce the possibility of a leak occurring.\n\nA chemical distributor delivers chlorine containers to the plant.  Chlorine is withdrawn directly from the one-ton containers and delivered to the chlorination process.  Chlorine leak detectors continuously monitor for leaks.  Leak alarms ac"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11806,
      "SummaryText": "tivate an audible alarm throughout the plant and an alarm light in the monitoring room on the control panel.  Other examples of safety systems include high and low gas vacuum alarms.  Chlorine gas is delivered under vacuum.  If a leak were to occur in this piping, outside air would be drawn into the piping rather than chlorine gas leaking out of the piping.\n\nThe chlorine containers are located inside the locked chlorine building.  MDC owns and keeps the following equipment on-site: self-contained breathing apparatuses (SCBA), response suits and a ton container repair kit.  All six employees are trained in proper operation of the chlorine system.  They also receive extensive initial and annual safety training.  Drills are held annually, with the operators wearing SCBA and response suits.  The training for chlorine emergency response is in compliance with 29 CFR 1910.120(q).\n\nThe RHWPCF's effluent discharge permit, administered by Connecticut Department of Environmental Protection, requires the plant to chlorinate the wastewater effluent from May 1st through September 30th.  Other than the few weeks prior to, during and the few weeks after chlorine season, no chlorine is on-site.  A complete preventative maintenance program is administered on all chlorine piping and equipment.\n\n\nRMP Requirements\n\nThe RMP consists of three major parts.  The first part is the Hazard Assessment.  The Hazard Assessment is performed to determine the effects that a release of a regulated substance could have on the public.  The second part is a Prevention Program that consists of 12 elements designed to improve the system safety and decrease the likelihood of a release.  The third part is the Emergency Response Program, which develops a plan for dealing with a release in the unlikely event that one would occur.  Because the regulations are very similar, the Prevention Program and the Emergency Response Program also serve as the OSHA Process Safety Management (PSM) plan.  This document is th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11806,
      "SummaryText": "erefore referred to as the RMP/PSM plan.\n\n\nHazard Assessment\n\nA Hazard Assessment was performed to determine the effects a release could have on the public.  For chlorine, the distance a set endpoint concentration of the gas could travel was determined.  In addition, an estimate of the population that could be affected by the release of chlorine was determined, and sensitive receptors such as hospitals, parks, and schools were identified.  The Hazard Assessment considers two release scenarios - a worst case and an alternative case.\n\n\nWorst Case Scenario\n\nThe regulations require the development of a worst-case scenario based on conservative assumptions.  For example, it is required to assume that the entire contents of the largest single container of chlorine will be released over ten minutes.  This is unlikely to occur since the properties of chlorine would cause a freeze and thaw cycle to occur at the leak, which would slow the release.  In addition, only passive mitigation methods such as buildings or dikes for aqueous substances can be considered when determining the distance a release could travel.  Passive mitigation, as defined, includes no mechanical, electrical, or human input.  However, in many scenarios mitigating the release by isolating the process could significantly reduce the amount released.  In addition, the worst-case scenario requires that conservative atmospheric conditions be assumed which results in a large area of impact.  These conservative assumptions were set by EPA to ensure public notification and local emergency response planning takes into account the greatest possible impacted area surrounding the release point.  \n\nThe worst-case scenario used for chlorine at the RHWPCF is the rupture of a one-ton container, resulting in a release of 2,000 pounds of chemical over a ten-minute duration.  The container rupture resulting in a chlorine release could be caused by catastrophic events, such as a tornado.  This type of a catastrophic rel"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 11806,
      "SummaryText": "ease is unlikely to occur.  The released liquid is assumed to quickly volatilize and to disperse as a vapor cloud.  The hazard assessment requires a determination of the toxic endpoint, or distance from the point of release to a location at which the chemical concentration equals a certain concentration.  The distance to the toxic endpoint was estimated using the EPA-approved DEGADIS BREEZEHAZ+ model.\n\nThe RMP regulations define the toxic endpoint of a release of chlorine as the farthest distance at which a receptor would experience a chlorine concentration of 3 parts per million (ppm).  The concentration at the circle surrounding the plant defines the boundary of the area that would be impacted by a release, and the concentration at the circle is 3 ppm.  If a leak were actually to occur, the vapor cloud would only travel in the direction of the prevailing wind, not in all directions around the facility.  The 3 ppm endpoint concentration is the Emergency Response Planning Guideline Level 2 (ERPG-2) concentration defined as the maximum concentration at which most individuals could be exposed for up to one hour without experiencing irreversible or serious health effects.  Because the cloud from a leak of chlorine would disperse relatively quickly, an individual located at the toxic endpoint would be exposed to a chlorine concentration for much less than one hour.  It has been demonstrated, through EPA-approved DEGADIS BREEZEHAZ+ dispersion modeling, that an individual located at the toxic endpoint would be exposed to a chlorine concentration of approximately 3 ppm for only three to ten minutes compared to the ERPG-2 allowable exposure time of one hour.\n\n\nAlternative Scenario\n\nThe RMP rule also requires that at least one alternative release scenario be evaluated for chlorine.  The alternative scenarios reflect a type of release that is more likely to occur compared to the worst-case scenario.  Unlike the worst-case scenario, the alternative release scenario may consi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 11806,
      "SummaryText": "der active mitigation such as shutoff valves and a more realistic release quantity and release rate.  Active mitigation is defined as requiring mechanical, electrical or human input.  It assumes local, typical meteorology, which is more realistic than the conservative meteorological conditions that must be assumed for the worst-case scenario.  The alternative release scenario for chlorine modeled, using the EPA-approved ALOHATM model, a release through a 5/16-inch diameter vapor valve in the top of a horizontal tank and considered passive mitigation of an enclosure or building.  Under this scenario, the amount of chlorine released was calculated to be 175 pounds.  For the second alternative release scenario, the same modeling approach was used as for the worst-case release scenario, except meteorological conditions were adjusted to represent more realistic conditions.  The results of the dispersion modeling analysis for both alternative release scenarios indicate that these scenarios have a small offsite impact.\n\nHowever, no chlorine releases that could have caused a safety or health hazard (no deaths, injuries, property or environmental damage, evacuations, or sheltering in place) have occurred at the RHWPCF during the last 30 years.  Chlorination began at the RHWPCF on June 16, 1969.  MDC operators undergo extensive initial and annual chlorine safety training.\n\n\nPrevention Program\n\nThe Prevention Program together with the Emergency Response Program make up the RMP/PSM.  The Prevention Program consists of 12 elements designed to improve system safety and decrease the likelihood of a release.  The elements are as follows.\n\nEmployee Participation\n\nThe participation of the RHWPCF staff in preparing the RMP/PSM program was critical to the program's successful implementation.  Employee participation is valuable because it increases the safety awareness of the staff and it allows the staff's experience in operating and maintaining the processes to be incorporated into"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 11806,
      "SummaryText": "the plan.\nRHWPCF staff participated in the development of the Prevention Program through a series of meetings and workshops as well as the Process Hazard Analysis described below.  RHWPCF staff received RMP/PSM awareness training that instructed staff on how the RMP/PSM requirements may impact their jobs.  Staff who operate and maintain the RMP/PSM were trained in how to safely maintain and operate the processes.\n\nProcess Safety Information\n\nThe RMP regulations require that information concerning process chemicals, technology and equipment be compiled as part of a RMP program.  Emergency response planners can use such information to develop training programs and procedures, or as a general resource.  The information will be supplied to contractors who will work in the chlorine process areas as part of the requirements outlined in the Contractor Safety element.  All the required process safety information was compiled as required by the RMP regulations.  The information meets or exceeds the minimum required by the regulations.\n\nProcess Hazard Analysis\n\nA Process Hazard Analysis (PHA) was conducted systematically to evaluate potential causes and consequences of accidental releases.  This information was used by RHWPCF staff to improve safety and reduce the consequences of accidental releases.  Equipment, instrumentation, utilities, human actions, and external factors that might affect the process were the focus of the PHA that was preformed for the chlorine process\n\nThe chlorine PHA was conducted by an interdisciplinary team of RHWPCF staff familiar with the process, operation and maintenance and plant management.  The PHA was done using the What-If and Checklist methods.  Based on the results of the PHA, several minor changes in the operating, maintenance and other process safety management procedures that would improve the overall safety of the RHWPCF were identified.\n\nOperating Procedures\n\nWritten operating procedures for the chlorination process have been deve"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 11806,
      "SummaryText": "loped as part of the RPM/PSM.  Written operating procedures assure continuous, efficient and safe operation of the facility.  The goal of the operating procedures is to provide clear instructions to safely operate the process.  Operating procedures are also used to train new employees and to provide refresher training for existing staff.\n\nThe detailed operating procedures include startup, shutdown and emergency operating procedures.  The procedures describe how the system should be operated in order to minimize the chances of an accidental release.  The procedures emphasize safety considerations during operation and address hazardous situations that can occur and how to correct them.\n\nTraining\n\nAn effective RMP/PSM training program can significantly reduce the number and severity of accidental release incidences.  Employees involved in operating or maintaining the chlorination process must receive training that includes applicable operating and maintenance procedures and an overview of the process.  Training must emphasize safety and health hazards and safe work practices.  RHWPCF staff have received initial training on the operations and maintenance of the regulated process, an overview of each of the RMP/PSM plan elements, and the procedures that must be followed to comply with the requirements of the RMP/PSM plan.  In addition to RMP/PSM plan training, select RHWPCF staff have been trained to respond to an accidental release.  Refresher process operation training will be provided at least every three years.  Refresher training for emergency response is conducted annually.\n\nContractors\n\nThe RHWPCF must make contractors aware of the known hazards of the chlorine process related to the contractors' work.  In addition, the RHWPCF must make contractors aware of the applicable elements of its emergency response plan.  The RHWPCF screens contractors for those who can perform work on or adjacent to the chlorine process without compromising the safety and health of employ"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 11806,
      "SummaryText": "ees at the facility.\n\nBefore allowing a contractor to work on or adjacent to the chlorine process, the RHWPCF must obtain and evaluate information regarding the contractor's safety performance and programs.  When a contract involving work on or adjacent to the chlorine process is to be bid, the bidding procedures must ensure that contractor safety management requirements are met.  If a contractor is to work in or adjacent to the covered process, before work begins, an on-site contractor orientation on safe work practices, chlorine hazards, and the Emergency Action Plan is held, to make the contractor aware of the RHWPCF's RMP/PSM plan requirements.  Prior to commencement of work, the contractor will be presented with the Emergency Action Plan, Loss Control Procedures Manual, Line breaking procedure, and description of the chlorination process.  Prior to commencement of work, the contractor must certify in writing, and maintain records, that the contractor's employees working on or around the RHWPCF chlorination facilities have successfully completed contractor training.  Periodic evaluation of contractor safety performance is conducted using the Contractor Evaluation Form.  Any violation by a contractor of the RHWPCF safe work practices in or around the chlorine area will be immediately reported and followed by an investigation of the violation.  Corrective action on the part of the contractor will follow to ensure safe work practices are followed in the future and follow-up evaluations are performed by RHWPCF staff to verify the effectiveness of the corrective actions.\n\nPre-startup Review\n\nA pre-startup safety review must be conducted for any new covered process or for significant modifications to the existing chlorine process that necessitate a change in the process safety information.  No new of significantly modified process will start up and no acutely hazardous chemicals will be introduced into such a process prior to the pre-startup safety review.  The purpos"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 11806,
      "SummaryText": "e of the pre-startup safety review is to ensure that the facility is ready to operate new and modified regulated processes safely.\n\nTo initiate the pre-startup safety review, all updated elements of the Process Safety Management Plan are assembled for review.  This includes all process safety information, process hazard analysis, operating procedures, employee training and mechanical integrity.  The pre-startup safety review team consists of the Project Engineer and Plant Supervisor or Shift Supervisor at the RHWPCF.  The pre-startup safety review team will compete and sign a Pre-startup Safety Review Form.  This form documents the process and helps ensure that the review has been properly performed.  The Pre-startup Safety Review Form must be authorized by the Plant Supervisor, and all necessary corrective actions completed and thoroughly documented before startup.\n\nMechanical Integrity\n\nAn effective mechanical integrity program is one of the primary preventive measures against a release.  The mechanical integrity program also addresses equipment testing and inspection, preventative maintenance schedules, and personnel training.  The intent is to ensure that equipment used to process, store or handle chlorine is maintained and installed to minimize the risk of releases.\n\nThe RHWPCF maintenance staff uses a Critical Equipment List and Maintenance, Inspection and Testing schedule to store equipment information, generate and prioritize work orders, schedule preventative maintenance (PM), provide safety procedures for work orders, and maintain an inventory of parts and materials.  The Plant Supervisor maintains records of all critical equipment maintenance activities and maintenance schedules, including inspection and testing.  The RHWPCF Maintenance, Inspection and Testing schedule generates work orders for preventative maintenance.  In addition to preventative maintenance, the RHWPCF staff performs corrective maintenance in the event of equipment malfunction or break"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 11806,
      "SummaryText": "down.  The RHWPCF mechanical integrity program indicates that safety precautions must be followed, including whether lockout/tagout or confined space entry provisions, when applicable.  The staff that carry out maintenance are all trained as part of the RMP/PSM.\n\nHot Works Permits\n\nRMP/PSM regulations require employees and contractors to employ safe work practices when performing  hot work in, on, or around the chlorine process.  To ensure that hot work is done safely, a Hot Work Permit Program has been developed that requires a permit to be issued before hot work is performed.  Hot work is defined as the use of oxyacetylene torches, welding equipment, grinders, cutting, brazing, or similar flame- or spark-producing operations.\n\nThe process of completing the Hot Work Permit makes it necessary to identify the hazard, recognize what safeguards are appropriate, and then initiate the safeguards necessary to ensure a fire-safe workplace.  Following the standards that are outlined in this section aids in complying with the OSHA Hot Works Regulations (1910.252(a)).\n\nManagement of Change\n\nA system for the proper management of changes and modifications to equipment, procedures, chemicals and processing conditions is required under the RMP/PSM.  Modifications to the chlorine system will be reviewed before they are implemented to determine if the modification would compromise system safety.  An effective change management system will help minimize the chance for an accidental release.\n\nIf a modification covered under RMP/PSM is made, its effects must be addressed, employees must be informed, and the written procedures must be updated.  The intent is to require that all modifications to equipment, procedures, and processing conditions other than replacement in kind be managed by identifying and reviewing them before implementation.  All chlorine operators and maintenance personnel are responsible for understanding what a change is, and will not make a change without impleme"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 11806,
      "SummaryText": "nting a Management of Change procedure and completing Management of Change forms.  The Maintenance Supervisor or Plant Supervisor will evaluate any modifications that are covered under the RMP/PSM.  The Management of Change Form must be completed and submitted in order for the Maintenance Supervisor or Plant Supervisor to review and authorize prior to initiation of a covered change.\n\nIncident Investigation\n\nEach incident that resulted in or could reasonably have resulted in a release of chlorine must be investigated.  A process to identify the underlying causes of incidents and to implement procedures for preventing similar events has been developed.  To investigate an incident, an investigation team will be established.  As part of the investigation, an incident report will be prepared to recommend system changes.\n\nThe investigation team should ask questions such as what equipment failed, which behavior failed, and which material leaked, reacted, or exploded.  As part of the incident review, staff actions that may have contributed to the incident will also be reviewed.  A determination will be made as to whether it is necessary to institute additional training for the employees to prevent the incident from occurring in the future.  On the incident report form, the Plant Supervisor (or, in his/her absence, the Senior Crew Leader) identifies which of the recommended system changes are approved for implementation.  The incident investigation report, compiled by the Risk Services Analyst or designee, and any changes resulting from the report will be reviewed with all staff members who operate and maintain the applicable system during a monthly safety meeting.\n\nCompliance Audit\n\nThe RHWPCF is required to complete a compliance audit for the RMP/PSM program.  The primary goals of conducting an internal compliance audit are to gather sufficient data to verify compliance with RMP/PSM requirements and good process safety practices, identify process safety deficiencies, and d"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 11806,
      "SummaryText": "evelop corrective actions, and increase safety awareness among plant staff.\n\nThe compliance audit methodology is modeled after OSHA's guidelines for conducting regulatory PSM compliance audits: Compliance Guidelines and Enforcement Procedures, OSHA Instruction CPL 2-2.45A (September 18, 1995).  An internal compliance audit must be conducted at the plant at least once every three years for the chlorine process.  A team that has a minimum of three members including: (1) the Plant Supervisor, (2) Crew Leader or other person knowledgeable in the covered processes, and (3) the Risk Services Analyst or designee to serve as the audit leader knowledgeable in RMP/PSM requirements and audit techniques.  The audit team will promptly determine an appropriate corrective action for each deficiency identified during the audit.  The audit team will prepare an audit report documenting all findings and the corrective actions and the dates by which they must be taken.\n\n\nEmergency Response Program\n\nThe OSHA PSM Process Safety Management regulation, 29 CFR 1910.119(n), and the EPA RMP regulation, 40 CFR 68 Subpart E, require that an accidental release Emergency Response Plan be prepared.  The plan must be prepared in accordance with the provisions of another overlapping OSHA regulation - Employee Emergency Plans (29 CFR 1910-38(a)).  In addition, provisions of the OSHA hazardous waste and emergency response standard, 29 CFR 1910.120(q) must be considered.  MDC's Emergency Action Plan described in this section complies with the requirements of 29 CFR 1910.119(n), 40 CFR 68.95, 29 CFR 1910.38(a), and 29 CFR 1910.120(q).\n\nThe Emergency Action Plan provides specific emergency response procedures for accidental releases of chlorine at the RHWPCF.  The emergency response procedures cover a release from the initial alarm stage through either leak stoppage or HAZMAT assistance.  As part of the emergency response procedures, there are plans for victim rescue, leak investigation, and communicatio"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 11806,
      "SummaryText": "n with additional support agencies.  In addition, critical plant operations are identified to insure that, if possible, these critical functions are kept operational.  The Emergency Action Plan also indicates the level of training needed to carry out the emergency response procedures.  Only personnel trained at the Responder Level can attempt to stop a leak.  The emergency response procedures refer to The Metropolitan District Emergency Action Plan for Water Pollution Control Facilities in cases where plant evacuation is necessary."
    }
  ]
}