{
  "FacilityID": 11868,
  "FacilityName": "Central Storage and Warehouse Company, Inc.",
  "FacilityStr1": "4309 Cottage Grove Road",
  "FacilityStr2": null,
  "FacilityCity": "Madison",
  "FacilityState": "WI",
  "FacilityZipCode": "53716",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55025",
  "LEPC": "Dane County LEPC",
  "FacilityLatDecDegs": "43.0825",
  "FacilityLongDecDegs": "-89.308889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3966561,
  "ParentCompanyName": "Central Storage and Warehouse Compaany, Inc.",
  "Company2Name": "N/A",
  "CompanyDUNS": 3966561,
  "Company2DUNS": null,
  "OperatorName": "Kenneth R Williams",
  "OperatorStr1": "39658 North 104th Street",
  "OperatorStr2": null,
  "OperatorCity": "Scottsdale",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85262",
  "OperatorZipCodeExt": null,
  "FTE": 17,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000125116",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-12 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 43.082778,
  "FRS_Long": -89.308889,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15858,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 11868,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 19744,
          "ProcessID": 15858,
          "ChemicalID": 56,
          "Quantity": 20000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 16254,
          "ProcessID": 15858,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8227,
              "Process_NAICS_ID": 16254,
              "SafetyReviewDate": "1999-03-01 00:00:00",
              "PHA_Date": "1996-01-25 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1996-01-25 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Human Factor",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fire Hoses",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "ADT Ref. Failure/Fire Monitor",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1996-01-25 00:00:00",
              "TrainingReviewDate": "1999-03-29 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Seminars, RETA Meetings",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1996-02-25 00:00:00",
              "EquipmentInspectionDate": "1998-01-06 00:00:00",
              "EquipmentTested": "Booster Compressor 150 HP",
              "ChangeMgmtDate": "1999-01-13 00:00:00",
              "ChangeMgmtReviewDate": "1999-04-22 00:00:00",
              "PreStartupReviewDate": "1999-02-11 00:00:00",
              "ComplianceAuditDate": "1999-03-31 00:00:00",
              "AuditCompletionDate": "1999-03-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-03-31 00:00:00",
              "HotWorkPermitReviewDate": "1999-01-13 00:00:00",
              "ContractorSafetyReviewDate": "1996-04-03 00:00:00",
              "ContractorSafetyEvalDate": "1999-04-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 11278,
                  "PreventionProgram3ID": 8227,
                  "ProcessChemicalID": 19744
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11868,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-06-04 00:00:00",
    "ERTrainingDate": "1998-09-25 00:00:00",
    "CoordinatingAgencyName": "Madison Fire Department",
    "CoordinatingAgencyPhone": "6082664420",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "29CFR 1910.119 OSHA PROCESS SAFETY MGT."
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11868,
      "SummaryText": "PARTt  I       General Information\n\nCentral Storage & Warehouse Co., Inc. (CSW) is complying  with OSHA's  Process Safety Management Standard  (PSM), Title 29 Code of Federal Regulations (CFR) 1910.119 and EPA's Risk Management Program  (RMP), Title 40 CFR 68  to control and eliminate the risks involved with the storage, handling, and processing of hazardous chemicals,  specifically anhydrous ammonia.  CSW intends  to communicate this information to all interested  individuals (including it's employees) and/or organizations that request or by law require knowledge on the company's efforts in dealing with the risks involved with its storage, handling and processing of anhydrous ammonia.  Through these means the company  will promote overall plant, worker and public safety.\n\nThe  policies, procedures and programs listed as references enable CSW to prevent incidents from happening and/or minimize the consequences of a large release of ammonia, as well as a fire/explosion, violent weather and other catastrophic accidents or occurrences.  The common  goal of these programs is to prevent injuries, illnesses, fataliities and to protect the facility from damage.\n\nCSW's safety programs cover a broad range of activity in the facility.  The maintenance personnel are trained in the  use and handling of aammonia, and all the equipment  (compressors, vessels,  piping, etc.) that are used in the cooling/freezing needs of the plant.  They have received and continually receive training in hazardous chemical handling, emergency response to leaks/spills, in the proper use of the refrigeration equipment and to various safety programs that deal with the dangers of handling ammonia.  The Plant Engineer is, in addition to the before mentioned, a Class A certified technician through the Refrigeraiton  Engineers and Technicians Association  (RETA) and has attended the IIAR refrigeration school.\n\nThe remainder of the warehouse staff has been trained in a claaassroom type setting through the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11868,
      "SummaryText": "use of lecture, quiestion and answer sessions, film, written tests, and then on the job training.  Much of this training deals with the various components of the OSHA Hazard Communication Standard  1910:1200, as it pertains  tto  chemicals on premises, the explanation of each chemical through use of Material Safety Data Sheets (MSDS), the location of this information, to whom requests for addditional information can be obtained, and the hazards of each chemiical.  The majority of this training is concentrated on ammonia and is repeated annuallly.  Addiitional staff training in material handling equipment, first aid, LockOut/TagOut and evacuation procedures, (although not ammonia speciifiic), make references to locations and what procedures are to be used to avoid  locations where contact is possible.\n\nTruck drivers, customers and other individuals that visit the plant are made aware of the hazardous chemicals presence by signs or verbal communication and of any safety hazards they may encounter prior to their entry.\n\nContractors are shown the areas in which they will work, hazards that they may encounter, preventative measures they must make prior to work and are requested to supply thier safety records.\n\nThese safety programs prevent accidents since they focus on rules, procedures and practices that must be adhered to in the handling of ammonia, the equipment that contains it and the activities of those that work with it.  These programs are communicated to all employees.\n\n\nPrograms used to identify  control, contain, maintain and report on hazardous chemicals on site:\n\n1.   29CFR   1910.119 Process Safety Management, all it's elements\n2.   29CFR   1910.151, Medical Services & First Aid\n3.   29CFR   1910.1030  Bloodborne Pathogens\n4.   29CFR   1910.138 Employee Emergency Plans and Fire Prevention Plans\n5.   29 CFR   1910.120 Emergency Response\n6.   29CFR   1910.146 Permit Requiired Confined spaces\n7.   29 CFR  1910.1200 Hazard Communication Standard\n8.   29CFR   19"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11868,
      "SummaryText": "10.147  The Control of Hazardous Energy, LockOut/TagOut\n9.   29CFR    Parts of 1910,  1915,   1917   & 1918  Powered Industrial Truck Operator Training\n10.  1988 Drug Free Workplace Act\n11.  29CFR  1910.132, 133, 134, 135, 136,  137 , 138 Personal  Protection Equipment\n12.  Wisconsin  Statute 166.20  & Section  312 of SARA Title III\n13.  CERCLA & SARA Title III Right to Know Laws\n14.  ASHRAE and ANSI Guidelines for good engineering practicies\n\nPart II   Equiipment\nCSW's refrigeration system is charged with   18,900#s of ammonia and is comprised of (7)  compressors, (1) high pressure ammonia receiver, (1) control pressure receiver, (2)  intermediate pressure accumulators, (2) low pressure accumulators and piping that carries the ammonia too (39)  evaporators located in (8) different storage areas that total 141,435 square feet or 3,021,065cubic feet.  One storage area has (4) blast cells.\n\n(6) of the (7) compressors are located in a centrally located engine room.  There are (2) high stage machines rated at 450HP & 400HP.  There are (3) booster/low stage machines of which (1) is 150HP, and (2) are 100HP.  One 325HP compressor is held in reserve.  The (7)th compressor, a 150HP high stage is located  in a different room approximately 20' west of the main engine room.  Under normal circumstances either a 450HP or 400HP high stage copressor and a 150HP booster are running and if needed a 100HP low stage compressor is automatically turned on.   On approximately October 1st of each year CSW receives upwards of 15,000,000#s of  ambient temperature cranberries.  At this time all equipment is used, except for the reserve unit, for a period of (60) days  until the load returns to normal.  The (4)  blast cells require additional  equipment be turned on, however, in varying degrees dependent on how much product is received at one time, the frequency of deliveries, the  type of product and the  hours required to reach the temperature objectiive.\n\nThe 450HP and 400HP HIgh Stage mac"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11868,
      "SummaryText": "hines plus the 150HP booster are liiquiid injection compressors with  300  PSIG dual safety relief valves.  The 150HP High Stage and (1) of  the 100HP units are liquid injection units with dual 250PSIG safety relief valves.  The remaiing compressors are water cooled.\n\nThe high pressure receiver, both intermediate pressure accumulators, and (1) of the low pressure accumulators have dual 250PSIG safety relief vaalves.  The remainder of the system valves are  150PSIG.\n\nThe refrigeration system has an audible alarm for ammonia leaks when they reach 200PPM during business hours.  During off hours this alarm plus a system shut down is monitored by ADT.  There are (4) people on a call list, one of which is notified of the  problem and is responsible  to take corrective action.  Two sotrage areas are computer monitored.\n\nThe product stored in the refrigerated areas is primariy food related.  In the freezers,  generally held at 0 degrees F. or below,  the majority of the product  consists of cranberries, fruit concentrates, certain cheeses,  bulk or print butter, boxed  meat products, boxed vegetables, food service goods, chicken and bread products.  The SuperChill, temeprature  +28 degrees F.  to +31degrees F. is used for dairy and meat products that must be held under +32degrees F. but  above their freeze point.  Temperature controlled space, temperature +/-5 degrees F., is held at +55 degrees F., and at a 50% humidity.  Area is used to temper butter and to store candies that require low humidity and storage under +75 degrees F.   Cooler space,  +35 degrees F.  to 42 degrees  F., is used to store tempered butter, tempered concentrates, cheese, food coloring pastes and is a  staging area for in and outbound loads.\n\nPart III   Worst Case Scenario\n\nThe worst case scenario is a 1 leak on the bottom of the #2  Low Temp Accumulator.  Under maximum operating  conditions this vessel is 75% full or stores  9,170#s of anhydrous ammonia.  The vessel would empty within  (10) minutes"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 11868,
      "SummaryText": "at an average of 917#s  per minute.  Using EPA's Table 4-2  Worst Case Scenario  Predicted Distances to Toxic  Endpoint for Anhydrous Ammonia an Atmospheric Stability Class F with Windspeed 1.5 m/s is 1.21 miles.\n\nThe worst case scenario is unlikely for the following reasons:\n\n1.  Worst case weather conditions are uncommon.\n2.  The vessel is located in the engine room away from all truck and forklift activity.\n3.  Buiilt to industry standards for the manufacture and quality control of pressure vessels.\n4.  Ammoniia  is not corrosive in this process.\n5.  There are dual 250PSIG pressure safety valves which limit the operating pressure of the vessel.\n6.  An in-house accident prevention procedure.\n7.  A mechanical integrity/check program for reguar maintenance, inspection and testing.\n8.  An emergency response program in  place.\n9.  A  RETA  and  IIAR  trained engineer.\n10.  PSM  Program  current.\n\n\nPart IV   Alternate Scenario\n\nThe allternate release  scenario is most likely to occur on the west dock of the facility if a forklift mast would rupture or break a ceiling mounted ammonia pipe 1 1/2 in diiameter that feeds two freezer compartments.  This would result in a vapor release of 3,849#s of ammonia  over a period of 6.08 minutes.  Using the RMP reference table 4-3, an incident of this type would pose a very  minimal health hazard to the general public since the majority would be contained within the bulding while the rest will dissipate within 0.21 miles of the building.\n\nThis scenario is unlikely since the majority of the  piping is located out of the main  travel patterns on the dock and is at ceiling height level,  equipment  operators have been trained to keep the tall masted equipment out of these areas, the employees have been trained in  the Hazaard Communication Standard  29CFR   1910.200 of the PSM  program, the mechanical integrity program for regular maintenance,  inspection, testing and the replacement of equipment when necessary.  If necessary the emer"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 11868,
      "SummaryText": "gency response plan and  equipment are in place.\n\nPART V ACCIDENT RELEASE PROGRAM\nThe programs CSW uses to prevent an accidental release of anhydrous ammonia are OSHA PSM 29 CFR 1910.119, the EPA RM Program 40CFR Part 68 and ANSI/IIAR Standard for equipment, design, and installation of ammonia refrigeration systems.  Written operating procedures and a maintenance check list of all equipment requiring inspections and their frequency are used for preventive maintenance and/or replacement.  In addition, the Plant Engineer, who is a RETA Certified Class A Technician, continues to attend RETA meetings, receives his (8) hours HAZWOPPER Refresher course annually and attends various other refrigeration related seminars.\n\nThe non-maintenance staff is schooled annually on OSHA 1910.147 LockOut/TagOut, 29 CFR 1910.1200 Hazard Communication Standard, 29 CFR 1910, 1915, 1917, & 1918 Fork Lift Training and Evacuation procedures.  The training focuses on ammonia and the refrigeration equipment insuring the company that all are aware of the serious consequences an ammonia incident can have.\n\nPART VI  INCIDENT HISTORY\nDuring the last five years there have been no qualifying accidents, in fact there have been no quailifying incidents related to equipment failure or breakdown in this period.\n\nPART VII FACILITY RESPONSE PROGRAM\nCSW's Emergecy Response Program is based on OSHA's Emergency Action Plans 29 CFR 1910.38 and 1910.119 plus HAZWOPPER 1910.120.  The Plant Engineer is fully trained to respond to emergencies.  Other selected employees are assigned specific tasks related to the incident and only if the area in which they will work is unaffected from all incident consequences.\n\nThe Company has a written emergency plan that deals with ammonia spills, fire and severe weather.  The Madison Fire Department's closest station is located within 1,000 feet of the facility and has resident HAZ-MAT personnel on site.  The station personnel visit our plant and the fire department conducts a m"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 11868,
      "SummaryText": "inimum of two complete annual safety inspections.\n\nThe Dane County Department of Emergency Management (LEPC) produces a OFF-SITE PLAN specifically for CSW.  This plan was developed with the company's imput and is reviewed frequently by both parties.\n\nLists of names and telephone numbers of the Madison Fire Department, the Madison Police Department and in case of a chemical spill or potential of same the Dane County Emergency Government, The Wisconsin Emergency Response Commission and the EPA Hotline are posted throughout the facility.  The Plants' Safety Co-ordinator will then contact the appropriate management personnel.\n\nPART VIII PLANNED CHANGES\nImmediate plans include the OSHA updates on forklift operations & Personal Protective Equipment (PPE) use.  We are currently developing an extended plan to increase our computer control of the refrigeration system and remote control of same.  An item specific maintenance list of all equipment is being compiled and will be used for preventative maintenance and equipment analysis.  Inspection frequencies , regulations governing the specific equipment and corrective action are components of the list."
    }
  ]
}