{
  "FacilityID": 11977,
  "FacilityName": "Gordon Food Service Springfield Distribution Cente",
  "FacilityStr1": "4980 Gateway Blvd",
  "FacilityStr2": null,
  "FacilityCity": "Springfield",
  "FacilityState": "OH",
  "FacilityZipCode": "45505",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39023",
  "LEPC": "Clark County LEPC",
  "FacilityLatDecDegs": "39.9125",
  "FacilityLongDecDegs": "-83.733333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6409908,
  "ParentCompanyName": "Gordon Food Service",
  "Company2Name": null,
  "CompanyDUNS": 6409908,
  "Company2DUNS": 0,
  "OperatorName": "Gordon Food Service",
  "OperatorStr1": "333 Fiftieth Street",
  "OperatorStr2": null,
  "OperatorCity": "Grand Rapids",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49548",
  "OperatorZipCodeExt": null,
  "FTE": 180,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000126419",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.91177,
  "FRS_Long": -83.71412,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15982,
      "AltID": "Refrigerated Warehousing",
      "FacilityID": 11977,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 19887,
          "ProcessID": 15982,
          "ChemicalID": 56,
          "Quantity": 31780.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 16381,
          "ProcessID": 15982,
          "NAICSCode": "49311",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8298,
              "Process_NAICS_ID": 16381,
              "SafetyReviewDate": "1997-09-01 00:00:00",
              "PHA_Date": "1997-12-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-03-08 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "weather including freezing temperatures and thunderstorms",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Weekly exterior piping check & Bi-weekly exterior valve station & piping inspection and pipe guarding",
              "OpProceduresReviewDate": "1997-09-01 00:00:00",
              "TrainingReviewDate": "1999-03-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1997-09-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-21 00:00:00",
              "EquipmentTested": "Frick compressors, Vilter Compressors, Glycol Pump, Condenser Water Treatment Control Panel, Ammonia Pumps, Air Compressors, System Guages, Main Control Panel.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-08-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-03-01 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-09-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-10-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "When the ammonia system becomes overpressurized (200 psi) an alarm will sound.  Once the pressure reaches 225 psi or greater, a relief valve activates to relieve the pressure in the ammonia system.  Once shutdown, the system will equilibrate the ammonia throughout the system.  Additionally, the compressors will alarm and shut down once the pressure drops below 10 inches of mercury to minimize losses of ammonia from system failures.",
              "_chemicals": [
                {
                  "PrimaryKey": 11363,
                  "PreventionProgram3ID": 8298,
                  "ProcessChemicalID": 19887
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11977,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-02-01 00:00:00",
    "ERTrainingDate": "1999-12-01 00:00:00",
    "CoordinatingAgencyName": "Springfield Fire Department",
    "CoordinatingAgencyPhone": "9119119119",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11977,
      "SummaryText": "EXECUTIVE SUMMARY\n\nIn accordance with section 112(r) of the Clean Air Act and 40 CFR part 68, this report \nfulfills the requirements of the Risk Management Plan (RMP) program for Gordon Food \nService.  Envirologic Technologies, Inc. (Envirologic) completed this RMP, on behalf of \nGordon Food Service's facility located in Springfield, Ohio.  A brief summary of the \nRMP developed for GFS is presented below and in the attached computer file. \n\nAccidental Release Prevention and Emergency Response Policies at GFS\n\nGFS has established policies and developed emergency response teams to protect the \nsafety of their workers and the public.  Their Environmental Policy Statement describes \nGFS's commitment to release prevention in the following phrases:  \n\"Gordon Food Service is committed to excellence and leadership in protecting the \nenvironment.  We strive to minimize adverse impact on the air, water, and land through \npollution prevention and energy conservation.  Gordon Food Service seeks to \ndemonstrate its responsible corporate citizenship by striving to adhere to all \nenvironmental regulations.  We promote cooperation and coordination between industry, \ngovernment, and the public toward the shared goal of preventing pollution at its source.\"\n\nAdditionally, GFS's Corporate Safety Policy defines GFS's commitment to the safety of \nits workers and surrounding community in the following phrases:\nThe protection of human life is one of our most important objectives in the course of \nconducting business.  The safety of all those associated with GFS, including the general \npublic, cannot be compromised.  It is our goal to operate in both a safe and productive \nmanner.  The preservation of people, equipment, and merchandise will enable us to be \na quality supplier.  These unwanted events can be prevented through \"know-how\" and \na willingness to do our jobs in a safe manner.  These responsibilities rest with every one \nof us, and will be a part of our performance objectives.\n\n"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11977,
      "SummaryText": "GFS demonstrates their commitment to preventing releases to the environment by being \nactively involved with the Clark County Local Emergency Planning Commission \n(LEPC).  GFS has developed in conjunction with the Clark County LEPC a Chemical \nEmergency Response Plan & Standard Operating Procedures (Emergency Response \nPlan) for GFS's Springfield Distribution Center.  The stated purpose of this Emergency \nResponse Plan is:\n- To ensure the safety of Emergency Response Team Personnel during a hazardous \nmaterials emergency.\n- To provide adequate safety precautions in protecting Gordon Food Service \nemployees and the public from harm caused by a chemical release.\n- To provide the Emergency Response Team with management direction during all \noperations directly related to a hazardous material emergency.\n\nGFS has established a strong relationship with the Springfield Fire Department to assist \nGFS personnel in implementing GFS's established policies and the procedures \nestablished in this Emergency Response Plan.  \n\nSite Description and Substances Handled\n\nGordon Food Service (GFS) distributes general grocery items to restaurants, cafeterias, \nand Marketplace stores throughout the Midwest.  GFS utilizes refrigerated warehouses \n(Distribution Centers) to receive product from venders, which is then distributed to \nMarketplace stores and clients within a 250-mile radius.  The Springfield Distribution \nCenter for GFS is located in an industrial park south of the City of Springfield, Ohio. \n\nThe structure of the Springfield Distribution Center consists of a warehouse building \nsubdivided to house building maintenance; administration; dry, refrigerated, and frozen \nproduct inventory; and unloading and loading dock areas.  Refrigerated and frozen \ninventory cooling at the Springfield Distribution Center is provided by an anhydrous \nammonia refrigeration system located within the Distribution Center.  The storage and \nuse of the anhydrous ammonia is the only regulated substance "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11977,
      "SummaryText": "used by GFS that is subject \nto the Risk Management Plan (RMP) requirements.  \n\nAmmonia System Design \n\nThe refrigeration system at the Distribution Center contains approximately 31,000 \npounds of anhydrous ammonia.  The refrigeration system consists of the following basic \nelements:\n- compressor,\n- controlled pressure receiver,\n- liquid pump,\n- evaporator,\n- condenser, and \n- associated piping and valves.\n\nThis refrigeration system is a closed loop system.  Refer to the attached process flow \ndiagram for further design of the refrigeration system at the Springfield Distribution \nCenter.\n\nThe major components of the refrigeration system including the controlled-pressure \nreceiver at the Springfield Distribution Center are enclosed in a concrete block room \n(compressor room) within the warehouse facility itself.  The only exterior components of \nthe refrigeration system is the condenser and associated piping and valves.  The \ncompressor room has only two access points.  One access point is a door that opens into \nthe warehouse itself and the second access point is a door that leads directly to the outside \nof the facility that remains continuously locked from the inside.  The evaporators are \nsuspended from the ceiling of the warehouse throughout the refrigerated and frozen food \nproduct areas.\n\nWorst-Case Release Scenario\n\nThe Environmental Protection Agency (EPA) has defined a worst-case release as \"the \nrelease of the largest quantity of a regulated substance from a vessel or process line \nfailure that results in the greatest distance to a specified endpoint.\"  Basically, a worst-\ncase release is a catastrophic event that destroys the process and/or storage vessels and \ncauses and immediate release of all stored materials.  In order to determine the radius of \nimpact to off-site receptors, an offsite consequence analysis was conducted.  \nRMP*Comp, developed by the National Oceanic and Atmospheric Administration \n(NOAA) and the Environmental Protection Agency (EPA"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11977,
      "SummaryText": "), was the model utilized to \nperform the calculations for the offsite consequence analysis. The following site-specific \nparameters and required default parameters were utilized to conduct the offsite \nconsequence analysis for the Springfield Distribution Center:\n- Quantity of ammonia liquefied under pressure: 31,780 pounds (present in the largest \nsingle vessel - controlled-pressure receiver (site-specific value)\n- Height of Release:  ground level (default value)\n- Release Duration: 10 minutes (default value)\n- Mitigation Measures:  Release in enclosed space in direct contact with outside air due \nto the presence of two doors one of which leads outside (default value)\n- Topography: Urban Surroundings (site-specific value)\n- Wind Speed: 1.5 meters/second (default value)\n- Stability Class: F (default value)\n- Air Temperature: 77 degrees Fahrenheit (default value)\n- Compressor Room volume:  59,616 ft3 (site-specific value)\n\nSince the controlled pressure receiver is located within the warehouse, a calculation was \nperformed to assess if the building would fail as a result of the release.  The following \nequation was utilized to determine the building strength as recommended by the EPA:\n\nCompressor Room Volume/Quantity of ammonia \n59,616 ft3/31,780 pounds = 1.88 ft3/pounds\n\nSince the answer is greater than 0.1ft3/pound, the building will be able to sustain and \ncontain an ammonia release.  Therefore, the default values for a Mitigated Release will be \nable to be utilized for calculating the estimated distance to the Toxic Endpoint.  Next, site \nspecific values and default values were input into the RMP*Comp model to calculate \nthe Toxic Endpoint and Estimated Distance to the Toxic Endpoint.  The calculated results \nare 0.14 mg/l and 1.5 miles, respectively.  \n\nIn order for a release of this magnitude to occur, all automated and engineered fail-safe \nmechanisms would have to have been destroyed.  Basically, a catastrophic event like a \ntornado, earthquake, or explosion"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 11977,
      "SummaryText": " would have to destroy the Controlled Pressure Receiver \nlocated inside the warehouse instantaneously to meet the assumptions required by a worst \ncase scenario.  Since the Controlled Pressure Receiver is located in the Compressor \nRoom that has limited access and has no vehicle traffic it is highly unlikely that a \ncatastrophe of this magnitude would occur damaging this vessel.  \n\nAdditionally, the compressor room has only one door that leads to the outside of the \nfacility and it is locked from the inside.  This door is only used for emergency purposes.  \nTherefore, there are no direct outlets present for a release of anhydrous ammonia to \nimpact outdoor air.  \n\nAlternate Release Scenario\n\nGFS has reviewed their ammonia refrigeration system to determine a more likely release \nscenario.  The Process Hazard Analysis conducted in accordance with OSHA's Process \nSafety Management Standard 29 CFR 1910.119 indicated that a release caused by a hole \nin piping caused by corrosion or a leaking valve along the piping run located on the roof \nof the warehouse is a more plausible release scenario.  Under normal operating \nconditions, the roof-top piping runs are under pressures that fluctuates between 100 to \n130 psig.  The fluctuations in the piping run pressure are due to the change in ambient air \ntemperature.  The absolute maximum pressure possible for this system is 150 psi.  The \nalternate release scenario was calculated assuming the rooftop piping run was damaged \ncreating a 2-inch hole (diameter of the pipe) and the system reaches a maximum possible \npressure of 150 psi.  The release rate was calculated utilizing the Bernoulli Equation:\n\nQR = HA x (203)(Pg)1/2\nWhere:    QR = Release rate (pounds/minute)\n    HA = Hole area (square inches)\n    Pg = Gauge pressure (psig)\n\nUsing this equation, the release rate was calculated to be 4972 pounds of anhydrous \nammonia per minute.  Inputting the calculated release rate of 4,972 pounds/minute and \nthe default release duration of 60 minu"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 11977,
      "SummaryText": "tes into the RMP*Comp model, an estimated \ndistance to the Toxic Endpoint was calculated to be 0.5 miles.  This radius of impact is \nsignificantly smaller than the worst case scenario however; it could still impact the \nsurrounding public.  \n\nThe alternate release scenario model assumes that all of the engineered fail safe measures \npresent in the ammonia refrigeration system at GFS fail.  The fail safe measures that \nwould have to fail include automatic and manual alarms and shutoff mechanisms \nincluding manual shut down of the system following GFS's standard operating \nprocedures by refrigeration personnel.  Therefore, the odds of the alternate release \nscenario described above occurring are still very low.  GFS does feel that this scenario \nhas a greater chance of occurring than the worst case scenario previously described.\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps\nTo prevent the accident release scenarios described above and others outlined in GFS's \nProcess Hazard Analysis at the Springfield Distribution Center, GFS has implemented an \naggressive prevention program since the refrigeration system went on line in 1998.  GFS \nhas made a commitment to understand the environmental aspects and safety aspects of \nthe refrigeration system operations.  In response to this increased knowledge and \nawareness, GFS has devoted much time and effort to insuring the refrigeration system at \nthe Distribution Center is working efficiently, effectively, and safely for not only on-site \nemployees but also the residents and public areas surrounding the Distribution Center.  \n\nGFS is subject to the OSHA Process Safety management (PSM) requirements.  \nTherefore, the PSM program GFS has instituted is in compliance with these standards, at \nminimum.  GFS's prevention program includes the following:\n- Daily manual and automated pressure checks of temperature and pressures in engine \nroom.\n- Weekly inspection of exterior insulation, valve stations, and"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 11977,
      "SummaryText": " piping runs.\n- Bi-weekly leak checks of all valves and valve stations.\n- Preventative maintenance program based on recommended engineering practices and \nobservations from inspections.\n- Inspections of Preventative Maintenance Work Orders and daily/weekly inspections \nto ensure they are completed properly and in a timely fashion.\n- Utilization of a software system (Maximo) to assist GFS in monitoring the \npreventative maintenance program for both Distribution Centers.\n- Systematically upgrading refrigeration system equipment and components.\n- Installation of Industrial Refrigeration thermal Insulation as a vapor barrier system to \nall refrigeration vessels, valves, piping, and fittings including hot gas lines to the \nsystem and defrost/condensing temperature.\n- Equipping each refrigeration system with alarms, and automated activation of relief \nvalves and automated shutdown once the system reaches dangerously high levels of \npressure.\n- Development of a HAZMAT team and an Emergency Action Plan to effectively \nrespond to any potential accidents and leaks specifically relating to the refrigeration \nsystem in accordance with OSHA Standard 29 CFR 1910.120 and 29 CFR \n1910.38(a), respectively.  \n- Emergency response training for all HAZMAT team members.\n- All necessary communication equipment and personal protective equipment to \nrespond to an anhydrous ammonia release are provided and maintained by GFS.\n\nIn addition to these measures, GFS has implemented an Employee Training Program for \nRefrigeration Technicians.  The Training Program includes both on-site and off-site \ntraining seminars through the University of Wisconsin, the Manufacturer (Vilter and \nFrick) and training modules and competency tests developed and supplied by the \nInternational Institute of Ammonia Refrigeration (IIAR).  Training is completed by each \nRefrigeration Technician on an annual basis.  \n\nFive-Year Accident History\n\nAn accidental release of anhydrous ammonia has never occurred at the Spring"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 11977,
      "SummaryText": "field \nDistribution Center. \n\nEmergency Response Program\n\nGFS has developed an extensive Emergency Response Program to respond to a chemical \nrelease from the anhydrous ammonia refrigeration systems at the Springfield Distribution \nCenter.  GFS has developed in conjunction with the Springfield Fire Department an \nEmergency Response Plan for the Springfield Distribution Center.  The Emergency \nResponse Plan details:\n- pre-emergency planning procedures, \n- GFS's Emergency Response Team organizational structure, \n- training requirements, \n- emergency recognition and prevention procedures, \n- emergency alerting procedures, \n- evacuation procedures, \n- emergency medical services, \n- emergency response procedures, \n- medical surveillance procedures, and\n- post emergency response critique procedures. \n\nGFS has provided not only employee training but also all necessary resources needed to \nadequately, quickly, and safely respond to a release of anhydrous ammonia.  GFS \npersonnel are trained to contact the Springfield Fire Department to respond to and \nmitigate a release of anhydrous ammonia at GFS's Springfield Distribution Center when a \nresulting release approaches 100 pounds or a spill over 35 ppm of ammonia which can \nnot be operationally isolated.\n\nGFS has coordinated with the Springfield Fire Department whose master plan includes \ncoordinating with area hospitals and local emergency response companies to ensure all \nparties are aware of their roles and responsibilities in the event a release does occur.  Off-\nsite notification comes from the Springfield Fire Department according to their direction.  \nUpon their contact they assume the leadership role for emergency response and make all \noff-site evacuation and sheltering communications to the community.\n\nGFS employees required to do work in and around the anhydrous ammonia refrigeration \nsystem, are trained and annually updated in identifying and initially responding to a \nrelease in accordance with the OSHA Standards"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 11977,
      "SummaryText": ".  \n\nTo ensure response procedures and employee training is complete and up to date, GFS in \nconjunction with the Springfield Fire Department conducts period emergency response \ninspections.  After completing each period emergency response inspection the Springfield \nFire Department and GFS refrigeration personnel review the methods and procedures \nfollowed to coordinate the response effort and mitigate a release to assess their \neffectiveness and to determine if changes to response procedures are necessary.  \n\nIn any event, GFS and the Springfield Fire Department are fully prepared to respond to \nan accidental release of anhydrous ammonia and more importantly protect GFS \nemployees, and people living and working around the Springfield Distribution Center.  \n\nPlanned Changes to Improve Safety\n\nThe Springfield Distribution Center is a new Distribution Center brought on line in April \nof 1998.  GFS has been able to introduce many engineering fail-safe mechanisms into the \nnew refrigeration system that improve the odds of a release of anhydrous ammonia from \noccurring.  These engineered fail-safe mechanisms have increased the safety for all on-\nsite employees and significantly reduced the risk of a release of anhydrous ammonia from \nnot only occurring but also from migrating off-site and impacting the surrounding \nresidences and businesses.  GFS is committed to continually improve the operations of \nthe refrigeration system to continue to reduce the threat of a release occurring.  As part of \nGFS's continual improvement commitment, several administrative improvements are \nproposed for the immediate future.  These administrative improvements include but are \nnot limited to:\n\n- Developing a Hot Work Program for refrigeration contractors,\n- Further enhancing the Compliance Audits Program by developing an Internal \nAuditing Program and peer review from personnel at other Distribution Centers,\n- Continually enhancing the Employee Training Program to allow GFS to obtain the "
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 11977,
      "SummaryText": "\nbest available information and technology for improving refrigeration system \nefficiency and safety,\n- Developing procedures for selecting and assessing contractors to ensure, at minimum, \nthey meet OSHA's safety requirements, and\n- Expanding the management system developed to address anhydrous ammonia as \nrequired by the OSHA Process Safety Management Standard and the RMP to include \nall chemicals that pose a risk by developing an Integrated Contingency Plan.\n\nGFS is considering adopting the principles and management characteristics of an ISO \n14000 Environmental Management System to manage environmental, health and safety \ncompliance issues consistently throughout GFS's diversified organization.  An \nEnvironmental Management System is a proactive voluntary initiative that a company \ncommits itself to going beyond compliance.  This system will allow Gordon Food Service \nto seek improvements in their effort to manage, control and potentially eliminate the risks \nassociated with GFS's daily operational tasks.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPw/auditing/grdfs/80131sfex"
    }
  ]
}