{
  "FacilityID": 11993,
  "FacilityName": "Borden Milk Products, LLC",
  "FacilityStr1": "900 East Semands Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Conroe",
  "FacilityState": "TX",
  "FacilityZipCode": "77305",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48339",
  "LEPC": "Montgomery County LEPC",
  "FacilityLatDecDegs": "30.331389",
  "FacilityLongDecDegs": "-95.438056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A6",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Borden Milk Products, LLC",
  "OperatorStr1": "900 East Semands Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Conroe",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77305",
  "OperatorZipCodeExt": null,
  "RMPContact": "David Wendt",
  "RMPTitle": "Plant Engineer",
  "FTE": 130,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000127472",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-03-12 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 30.32934,
  "FRS_Long": -95.44311,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16001,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 11993,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16400,
          "ProcessID": 16001,
          "NAICSCode": "311511",
          "_desc": {
            "NAICS_CODE": "311511",
            "NAICS_DESCRIPTION": "Fluid Milk Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 19907,
          "ProcessID": 16001,
          "ChemicalID": 56,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 519907,
          "ProcessID": 16001,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11993,
      "SummaryText": "Borden Milk Products, LLC is a dairy product processing and packaging facility (SIC 2026) located at 900 East Semands Ave., Conroe, Texas, 77305.  The facility operates an ammonia refrigeration system as part of the process.  Anhydrous ammonia is the RMP chemical of concern.  The current capacity of the system is approximately 18,000 pounds.  The facility has never experienced a significant incident.\n\nThe refrigeration system is designed and installed and operated in accordance with the applicable guidelines and standards of the American Society of Mechanical Engineers (ASME), the American National Standards Institute (ANSI), the International Institute of Ammonia Refrigeration (IIAR), the American Society of Heating, Refrigerating, and Air-conditioning Engineers, Inc. (ASHRAE), and the Occupational Safety and Health Administration (OSHA).  Qualified outside contractors are used for construction and major repairs or modifications to the system.  The system is continuously monitored and inspected by technicians that are trained, qualified, and experienced in ammonia refrigeration.\n\nThe system is inspected periodically for proper operation 24 hours per day.  Walking inspections are conducted on intervals not longer than 4 hours.  System parameters are logged in a permanent record, as are routine maintenance activities.\n\nThe system is equipped with a series of redundant failsafe devices, sensors, and overrides.  In the event a malfunction occurs that could result in an ammonia release, these protective devices shut the system down.  The system can't be restarted until the cause of the shutdown is identified and corrected.  The system is equipped with a shutdown system that is triggered by the presence of ammonia in the engine room.  The system shutdown can be manually operated using a kill switch located outside the engine room.\n\nThe facility has made arrangements with the local fire department and outside contractors to respond to emergencies involving ammonia.  The f"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11993,
      "SummaryText": "acility conducts periodic incident response drills.\n\nThe facility has implemented a Process Safety Management Program in accordance with applicable OSHA regulations (29 CFR 1910.119).  This plan is reviewed annually and updated as necessary.  All significant changes to the system are reviewed in accordance with the PSM / RMP management of change provisions in the facility's plan.\n\nThe EPA requires the facility to model the potential offsite impact from a worst-case release of ammonia and an alternate release scenario.  The worst-case release is based on a release from the controlled-pressure liquid receiver located in the Engine Room.  This could potentially release approximately 9,500 pounds of ammonia.  Anhydrous ammonia is a gas at normal temperature and pressure.  It may be liquefied by pressure in parts of the system.  The liquid will quickly vaporize back to a gas when exposed to the atmosphere.  This gas is lighter than air and rises quickly into the atmosphere with little environmental impact.  Ammonia has an irritating effect on inhalation at high concentrations.  Ammonia is highly water soluble.  A gas cloud can be mitigated effectively with water spray.  Borden can provide water spray.  Additional support can be provided by the City of Conroe Fire Department.\n\nThe alternate release scenario involves a release from a damaged liquid ammonia pipe.  This type of incident could create a gas release at a rate of approximately 100 pounds per minute (the rate recommended in the EPA's RMP Guidance for Ammonia Refrigeration document).  A release from most safety release valves at the facility will result in a release of less than 100 pounds per minute.\n \nBorden Milk Products, LLC has complied with the requirements of section 302 and 303 of the Emergency Planning and Community Right to Know Act (EPCRA) by notifying the State Emergency Response Commission (SERC), the Local Emergency Planning Committee (LEPC), and the Fire Department of the presence of ammonia at the "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11993,
      "SummaryText": "site.  Borden files a Tier 2 Chemical Inventory each year with the SERC, LEPC and the Fire Department, as required by sections 311 and 312 of EPCRA.  The facility's emergency response plan includes procedures for notifying the proper agencies in the event of a reportable release of ammonia.  A release of 100 pounds or more must be reported to the National Response Center, the SERC, and LEPC, in accordance with section 304 of EPCRA.  The Fire Department has been provided with a copy of the facility's emergency response plan."
    }
  ]
}