{
  "FacilityID": 11991,
  "FacilityName": "Gordon Food Service Brighton Distribution Center",
  "FacilityStr1": "7770 Kennsington Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Brighton",
  "FacilityState": "MI",
  "FacilityZipCode": "48116",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26093",
  "LEPC": "Livingston County LEPC",
  "FacilityLatDecDegs": "42.501389",
  "FacilityLongDecDegs": "-83.6925",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6409908,
  "ParentCompanyName": "Gordon Food Service",
  "Company2Name": null,
  "CompanyDUNS": 6409908,
  "Company2DUNS": 0,
  "OperatorName": "Gordon Food Service",
  "OperatorStr1": "333 50th Street SW",
  "OperatorStr2": null,
  "OperatorCity": "Grand Rapids",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49548",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bob Cato",
  "RMPTitle": "Risk Manager",
  "FTE": 237,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000127301",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.50098,
  "FRS_Long": -83.68926,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15999,
      "AltID": "Refrigerated Warehousing",
      "FacilityID": 11991,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16398,
          "ProcessID": 15999,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 19905,
          "ProcessID": 15999,
          "ChemicalID": 56,
          "Quantity": 23000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 519905,
          "ProcessID": 15999,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11991,
      "SummaryText": "EXECUTIVE SUMMARY\n\nIn accordance with section 112(r) of the Clean Air Act and 40 CFR part 68, this report \nfulfills the requirements of the Risk Management Plan (RMP) program for Gordon Food \nService, Grand Rapids, Michigan.  Envirologic Technologies, Inc. (Envirologic) \ncompleted this RMP, on behalf of Gordon Food Service's facility located in Brighton, \nMichigan.  A brief summary of the RMP developed for GFS is presented below and in \nthe attached computer file. \n\nAccidental Release Prevention and Emergency Response Policies at GFS\n\nGFS has established policies and developed emergency response teams to protect the \nsafety of their workers and the public.  Their Environmental Policy Statement describes \nGFS's commitment to release prevention in the following phrases:  \n\"Gordon Food Service is committed to excellence and leadership in protecting the \nenvironment.  We strive to minimize adverse impact on the air, water, and land through \npollution prevention and energy conservation.  Gordon Food Service seeks to \ndemonstrate its responsible corporate citizenship by striving to adhere to all \nenvironmental regulations.  We promote cooperation and coordination between industry, \ngovernment, and the public toward the shared goal of preventing pollution at its source.\"\n\nAdditionally, GFS's Corporate Safety Policy defines GFS's commitment to the safety of \nits workers and surrounding community in the following phrases.\nThe protection of human life is one of our most important objectives in the course of \nconducting business.  The safety of all those associated with GFS, including the general \npublic, cannot be compromised.  It is our goal to operate in both a safe and productive \nmanner. The preservation of people, equipment, and merchandise will enable us to be a \nquality supplier.  These unwanted events can be prevented through \"know-how\" and a \nwillingness to do our jobs in a safe manner.  These responsibilities rest with every one of \nus, and will be a part of our "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11991,
      "SummaryText": "performance objectives.\n\nGFS demonstrates their commitment to preventing releases to the environment by being \nactively involved with the Livingston County Local Emergency Planning Commission \n(LEPC).  GFS has developed in conjunction with the Livingston County LEPC a \nChemical Emergency Response Plan & Standard Operating Procedures (Emergency \nResponse Plan) for GFS's Brighton Distribution Center.  The stated purpose of this \nEmergency Response Plan is:\n- To ensure the safety of Emergency Response Team Personnel during a hazardous \nmaterials emergency.\n- To provide adequate safety precautions in protecting Gordon Food Service \nemployees and the public from harm caused by a chemical release.\n- To provide the Emergency Response Team with management direction during all \noperations directly related to a hazardous material emergency.\n\nGFS has developed and trained a HAZMAT team, in accordance with applicable OSHA \nregulations; to implement their established policies and the procedures established in this \nEmergency Response Plan.  The HAZMAT team is supported and sufficient resources \nhave been provided to this HAZMAT team by GFS's upper management.\n\nSite Description and Substances Handled\n\nGordon Food Service (GFS) distributes general grocery items to restaurants, cafeterias, \nand Marketplace stores throughout the Midwest.  GFS utilizes refrigerated warehouses \n(Distribution Centers) to receive product from venders, which is then distributed to \nMarketplace stores and clients within a 250-mile radius.  The Brighton Distribution \nCenter for GFS is located in an industrial park east of the City of Brighton, Michigan. \n\nThe structure of the Brighton Distribution Center consists of a warehouse building \nsubdivided to house building maintenance; administration; dry, refrigerated, and frozen \nproduct inventory; and unloading and loading dock areas.  Refrigerated and frozen \ninventory cooling at the Brighton Distribution Center is provided by an anhydrous \nammonia refrigerat"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11991,
      "SummaryText": "ion system located within the Distribution Center.  The storage and \nuse of the anhydrous ammonia is the only substance used by GFS that is subject to the \nRisk Management Plan (RMP) requirements.  The refrigeration system at the Distribution \nCenter contains approximately 23,000 pounds of anhydrous ammonia.  The refrigeration \nsystem consist of the following basic elements:\n- compressor,\n- high pressure receiver,\n- liquid pump,\n- evaporator,\n- condenser, and \n- associated piping and valves.\n\nRefer to the attached process flow diagram for further design of the refrigeration system \nat the Brighton Distribution Center.  This refrigeration system is a closed loop system \nthat requires minimal amounts of additional anhydrous ammonia on a yearly basis.  \n\nAmmonia System Design \n\nThe major components of the refrigeration system including the high-pressure receiver at \nthe Brighton Distribution Center are within the warehouse facility itself in an enclosed \nconcrete block room (compressor room).  The chillers are suspended from the ceiling of \nthe warehouse throughout the refrigerated and frozen food product areas.  The only \nexterior components (outside of the Distribution Center building itself) of the \nrefrigeration system is the condenser and associated piping and valves.  The compressor \nroom has only two access points.  The compressor room has only two access points that \nopen into the warehouse itself.\n\nWorst-Case Release Scenario \n\nThe Environmental Protection Agency (EPA) has defined a worst-case release as \"the \nrelease of the largest quantity of a regulated substance from a vessel or process line \nfailure that results in the greatest distance to a specified endpoint.\"  Basically, a worst-\ncase release is a catastrophic event that destroys the process and/or storage vessels and \ncauses and immediate release of all stored materials.  In order to determine the impact of \na worst case accidental release of ammonia to off-site receptors (public), an off-site \nconseq"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11991,
      "SummaryText": "uence analysis was conducted.  RMP*Comp, developed by the National \nOceanic and Atmospheric Administration (NOAA) and the Environmental Protection \nAgency (EPA), was the model utilized to perform the calculations for the offsite \nconsequence analysis. The following site-specific parameters and required default \nparameters were utilized to conduct the offsite consequence analysis for the Brighton \nDistribution Center:\n- Quantity of ammonia liquefied under pressure:  12,114 pounds (present in the largest \nsingle vessel - high-pressure receiver (site-specific value)\n- Height of Release:  ground level (default value)\n- Release Duration:  10 minutes (default value)\n- Mitigation Measures:  Release in enclosed space in direct contact with outside air due \nto the presence of two doors one of which leads outside (default value)\n- Topography:  Urban Surroundings (site-specific value)\n- Wind Speed:  1.5 meters/second (default value)\n- Stability Class:  F (default value)\n- Air Temperature:  77 degrees Fahrenheit (default value)\n- Compressor Room volume:  59,616 ft3 (site-specific value)\n\nSince the High Pressure Receiver is located within the warehouse, a calculation was \nperformed to assess if the building would fail as a result of the release.  The following \nequation was utilized to determine the building strength as recommended by the EPA:\nCompressor Room Volume/Quantity of ammonia \n59,616 ft3/12,114 pounds = 4.92 ft3/pounds\n\nSince the answer is greater than 0.1ft3/pound, then the building will be able to sustain and \ncontain an ammonia release.  Therefore, the default values for a Mitigated Release will be \nable to be utilized for calculating the estimated distance to the Toxic Endpoint.  Next, site \nspecific values and default values were input into the RMP*Comp model to calculate \nthe estimated distance to the Toxic Endpoint.  The calculated result is 1.0 miles.  \n\nIn order for a release of this magnitude to occur, all automated and engineered fail-safe \nmechanisms woul"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 11991,
      "SummaryText": "d have to have been destroyed.  Basically, a catastrophic event like a \ntornado, earthquake, or explosion would have to destroy the High Pressure Receiver \nlocated inside the warehouse instantaneously to meet the assumptions required by a worst \ncase scenario.  Since the High Pressure Receiver is located in the Compressor Room that \nhas limited access and has no vehicle traffic it is highly unlikely that a catastrophe of this \nmagnitude would occur damaging this vessel.  \n\nAdditionally, the compressor room has only one door that leads to the outside of the \nfacility and it is locked from the inside.  This door is only used for emergency purposes.  \nTherefore, there are no direct outlets present for a release of anhydrous ammonia to \nimpact outdoor air.  \n\nAlternate Release Scenario\n\nGFS has reviewed their ammonia refrigeration system to determine a more likely release \nscenario.  The Process Hazard Analysis conducted in accordance with OSHA's Process \nSafety Management Standard 29 CFR 1910.119 indicated that a release caused by a hole \nin piping caused by corrosion or a leaking valve along the piping run located on the roof \nof the warehouse is a more plausible release scenario.  Under normal operating \nconditions, the rooftop piping and associated valves are operating under 175 psig.  The \nalternate release scenario was calculated assuming a valve was damaged creating a 1.5 \ninch hole (diameter of the valve).  The release rate was calculated utilizing the Bernoulli \nEquation:\nQR = HA x (203)(Pg)1/2\nWhere:    QR = Release rate (pounds/minute)\n    HA = Hole area (square inches)\n    Pg = Gauge pressure (psig)\n\nUsing this equation, the release rate was calculated to be 4,972 pounds of anhydrous \nammonia per minute could be released if the valve was damaged.  Inputting the \ncalculated release rate of 4,972 pounds/minute and the default release duration of 60 \nminutes into the RMP*Comp model, an estimated distance to the Toxic Endpoint was \ncalculated to be 0.5 miles.  This radi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 11991,
      "SummaryText": "us of impact is significantly smaller than the worst \ncase scenario however, it does meet the requirement for off-site impact.  \n\nThe alternate release scenario model assumes that all of the engineered fail safe measures \npresent in the ammonia refrigeration system at GFS fail.  The fail safe measures that \nwould have to fail include automatic and manual alarms and shutoff mechanisms \nincluding manual shut down of the system following GFS's standard operating \nprocedures by HAZMAT responders.  Therefore, the odds of the alternate release \nscenario described above occurring are still very low.  Additionally, that ammonia vapor \ncloud that would form when a release occurred would dissipate in the direction of the \nwind predominantly west-southwest.  This would significantly reduce the ammonia \nradius of impact by only affecting the public located immediately downwind of the \nrelease.  \n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nTo prevent the accident release scenarios described above and others outlined in GFS's \nProcess Hazard Analysis at the Brighton Distribution Center, GFS has implemented an \naggressive prevention program within the last four years.  GFS has made a commitment \nto understand the environmental aspects and safety aspects of the refrigeration system \noperations.  In response to this increased knowledge and awareness, GFS has devoted \nmuch time and effort to insuring the refrigeration system at the Distribution Center is \nworking efficiently, effectively, and safely for not only on-site employees but also the \nresidents and public areas surrounding the Distribution Center.  \n\nGFS is subject to the OSHA Process Safety management (PSM) requirements.  \nTherefore, the PSM GFS has instituted is in compliance with these standards, at \nminimum.  GFS's prevention program includes the following:\n- Daily manual and automated pressure checks of temperature and pressures in engine \nroom.\n- Weekly inspection of exterior insulati"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 11991,
      "SummaryText": "on, valve stations, and piping runs.\n- Bi-weekly leak checks of all valves and valve stations.\n- Preventative maintenance program based on recommended engineering practices and \nobservations from inspections.\n- Inspections of Preventative Maintenance Work Orders and daily/weekly inspections \nto ensure they are completed properly and in a timely fashion.\n- Utilization of a software system (Maximo) to assist GFS in monitoring the \npreventative maintenance program for both Distribution Centers.\n- Systematically upgrading refrigeration system equipment and components.\n- Installation of Industrial Refrigeration Thermal Insulation as a vapor barrier system to \nall refrigeration vessels, valves, piping, and fittings including hot gas lines to the \nsystem and defrost/condensing temperature.\n- Equipping each refrigeration system with alarms, and automated activation of relief \nvalves and automated shutdown once the system reaches dangerously high levels of \npressure.\n- Development of a HAZMAT team and an Emergency Action Plan to effectively \nrespond to any potential accidents and leaks specifically relating to the refrigeration \nsystem in accordance with OSHA Standard 29 CFR 1910.120 and 29 CFR \n1910.38(a), respectively.  \n- Emergency response training for all HAZMAT team members.\n- All necessary communication equipment and personal protective equipment to \nrespond to an anhydrous ammonia release are provided and maintained by GFS.\n\nIn addition to these measures, GFS has implemented an Employee Training Program for \nRefrigeration Technicians.  The Training Program includes both on-site and off-site \ntraining seminars through the University of Wisconsin, the Manufacturer (Vilter and \nFrick) and training modules and competency tests developed and supplied by the \nInternational Institute of Ammonia Refrigeration (IIAR).  Training is completed by each \nRefrigeration Technician on an annual basis.  \n\nFive-Year Accident History\n\nAn accidental release of anhydrous ammonia has never"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 11991,
      "SummaryText": " occurred at the Brighton \nDistribution Center and this system has been in operation for over 10 years. \n\nEmergency Response Program\n\nGFS has developed an extensive Emergency Response Program to respond to a chemical \nrelease from the anhydrous ammonia refrigeration systems at the Brighton Distribution \nCenter.  GFS has developed in conjunction with the Livingston County LEPC an \nEmergency Response Plan for the Brighton Distribution Center.  The Emergency \nResponse Plan details:\n- pre-emergency planning procedures, \n- GFS's Emergency Response Team organizational structure, \n- training requirements, \n- emergency recognition and prevention procedures, \n- emergency alerting procedures, \n- evacuation procedures, \n- emergency medical services, \n- emergency response procedures, \n- medical surveillance procedures, and\n- post emergency response critique procedures. \nEmergency response personnel are available to respond to a release 24 hours per day \nseven days per week.  GFS has provided not only employee training but all necessary \nresources needed to adequately, quickly, and safely respond to and mitigate a release of \nanhydrous ammonia.  An Emergency Response Trailer has been created and equipped \nwith personal protective equipment, first aid equipment, and two-way radios.  The \nEquipment in this trailer is maintained in \"ready\" condition at all times. \n\nAdditionally, GFS has coordinated with the Green Oak Fire Department, the Green Oak \nTownship Police Department, area hospitals and local emergency response companies to \nensure all parties are aware of their roles and responsibilities in the event a release does \noccur.  GFS has established protocol to bring in the local authorities and inform the \nsurrounding public when an accidental release of anhydrous ammonia exceeds 100 \npounds.  By the direction of the Livingston County LEPC, off-site notification comes \nfrom the Local Fire Department.  Upon their contact they assume the leadership role for \nemergency response an"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 11991,
      "SummaryText": "d make all off-site evacuation and sheltering communications to \nthe community.\n\nGFS employees required to do work in and around the anhydrous ammonia refrigeration \nsystem, are trained and annually updated in accordance with the MIOSHA Hazardous \nWaste Operations and Emergency Response Standard, Michigan Administrative Code \nR325.52101et seq.  These training programs include:\n- First Responders at the Awareness Levels,\n- Hazardous Materials Technicians, \n- On Scene Incident Commander,\n- First Aid Training, and\n- Cardiac Pulmonary Recitation (CPR) Training.\n\nTo ensure response procedures and employee training is complete and up to date, GFS \nconducts mock emergency response scenarios on a quarterly basis.  After completing \neach mock emergency response scenario the HAZMAT Team reviews the methods and \nprocedures followed to coordinate the response effort and mitigate a release to assess \ntheir effectiveness and to determine if changes to response procedures are necessary.  \n\nIn any event, GFS is fully prepared to respond to an accidental release of anhydrous \nammonia and more importantly protect GFS employees, and people living and working \naround the Brighton Distribution Center.  \n\nPlanned Changes to Improve Safety\n\nIn the last four years, GFS has made many improvements in employee training, \noperations and procedures that involve the refrigeration system at the Brighton \nDistribution Center.  These changes have increased the safety for all on-site employees \nand significantly reduced the risk of a release of anhydrous ammonia from not only \noccurring but also from migrating off-site and impacting the surrounding residences and \nbusinesses.  GFS is committed to continually improve the operations of the refrigeration \nsystem to continue to reduce the threat of a release occurring.  As part of GFS's continual \nimprovement commitment, several changes are proposed for the immediate future.  These \nchanges include but are not limited to:\n- Developing a Hot Work Program"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 11991,
      "SummaryText": " for refrigeration contractors,\n- Further enhancing the Compliance Audits Program by developing an Internal \nAuditing Program and peer review from personnel at other Distribution Centers,\n- Continually enhancing the Employee Training Program to allow GFS to obtain the \nbest available information and technology for improving refrigeration system \nefficiency and safety,\n- Developing procedures for selecting and assessing contractors to ensure, at minimum, \nthey meet OSHA's safety requirements, and\n- Expanding the management system developed to address anhydrous ammonia as \nrequired by the OSHA Process Safety Management Standard and the RMP to include \nall chemicals that pose a risk by developing an Integrated Contingency Plan.\n\nGFS is considering adopting the principles and management characteristics of an ISO \n14000 Environmental Management System to manage environmental, health and safety \ncompliance issues consistently throughout GFS's diversified organization.  An \nEnvironmental Management System is a proactive voluntary initiative that a company \ncommits itself to going beyond compliance.  This system will allow Gordon Food Service \nto seek improvements in their effort to manage, control and potentially eliminate the risks \nassociated with GFS's daily operational tasks.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPw/auditing/grdfs/80131btex"
    }
  ]
}