{
  "FacilityID": 12027,
  "FacilityName": "Acres Homes Plant",
  "FacilityStr1": "1810 Dolly Wright",
  "FacilityStr2": null,
  "FacilityCity": "Houston",
  "FacilityState": "TX",
  "FacilityZipCode": "77088",
  "Facility4DigitZipExt": "7717",
  "FacilityCountyFIPS": "48201",
  "LEPC": "Houston LEPC",
  "FacilityLatDecDegs": "29.867194",
  "FacilityLongDecDegs": "-95.442389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A6",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ci.houston.tx.us/",
  "FacilityEmailAddress": "rhulbert@pwe.ci.houston.tx.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Houston",
  "OperatorStr1": "P.O. Box 1562",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77251",
  "OperatorZipCodeExt": "1562",
  "RMPContact": "Roger Hulbert",
  "RMPTitle": "Senior Assistant Director",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000126204",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-06 00:00:00",
  "SafetyInspectionBy": "Texas Natural Resource Conservation Commission",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 29.86713,
  "FRS_Long": -95.43816,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16062,
      "AltID": "Chlorination",
      "FacilityID": 12027,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16464,
          "ProcessID": 16062,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 20062,
          "ProcessID": 16062,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 520062,
          "ProcessID": 16062,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12027,
      "SummaryText": "Executive Summary for the City of Houston Acres Homes Plant\n\n1.    Accidental Release Prevention and Emergency Response Policies\nAcres Homes Plant is strongly committed to employee, public and environmental safety.  This commitment is demonstrated by a comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at its facility.  It is policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n2.    The Stationary Source and the Regulated Substances Handled\nThe facility's primary activities encompass treating ground water.  Acres Homes Plant has one regulated substance present at its facility.  This substance is chlorine, which is used for disinfection. The maximum inventory of chlorine at the facility is 12,000 pounds.\n\n3.    The Worst Case Release Scenario and the Alternative Release Scenario, including Administrative Controls and Mitigation Measures to Limit the Distances for Each Reported Scenario\nTo perform the required offsite consequence analysis for its facility, Acres Homes Plant has used EPA's RMP*Comp(TM).  The following paragraphs provide details of the chosen scenarios.\n\nThe worst-case release scenario submitted for Program 2 toxic substances as a class involves a catastrophic release from the chlorine room.  This scenario involves the release of 2,000 pounds of chlorine in a gaseous form over a 10-minute period. Passive mitigation systems, such as an enclosure, are also taken into account to calculate the scenario.  This mitigation system has the effect of reducing the affected area by 45%.  At Class F atmospheric stability and 1.5 m/s windspeed, the maximum distance of 0.9 miles is obtained, corresponding to a toxic endpoint of 0.0087 mg/L.\n\nThe alternative release scenario involves a release from the chlorine room of 600 pounds of chlorine in a gaseous form. The release lasts for a period of 60 minu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12027,
      "SummaryText": "tes.  Passive mitigation controls, such as an enclosure, are taken into account to calculate the scenario, having the effect of reducing the affected area by 45%.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.0087 mg/L of chlorine is 0.1 miles.\n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nAcres Homes Plant has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  The following sections briefly describe the elements of the release prevention program that is in place at the stationary source.\n\n\n\nProcess Safety Information\nAcres Homes Plant maintains a detailed record of safety information that describes the chemical hazards, operating parameters, and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nAcres Homes Plant conducts comprehensive studies to ensure that hazards associated with its processes are identified and controlled efficiently.  The methodology used to carry out these analyses is inspection of the plant to identify deficiencies throughout the system.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated routinely.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within the facility's covered processes, Acres Homes Plant maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, and normal shutdown.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nAcres Homes Plant has a comprehensive training program in place to ensure that employees who are responsible for processes are competent in"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12027,
      "SummaryText": " the operating procedures associated with these processes.  Refresher training is provided as needed.\n\nMechanical Integrity\nAcres Homes Plant carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Acres Homes Plant to manage changes in process chemicals, technology, equipment and procedures.  The most recent review/revision of maintenance procedures was performed on May 28, 1999.  Process operators, maintenance personnel, or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-startup safety reviews related to new processes and to modifications in established processes are conducted at Acres Homes Plant. These reviews are conducted to confirm that construction, equipment, operating, and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nAcres Homes Plant conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out at least every three years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nAcres Homes Plant promptly investigates any incident that has resulted in, or could reasonably result in, a catastrophic release of a regula"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12027,
      "SummaryText": "ted substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of five years.\n\nEmployee Participation\nAcres Homes Plant truly believes that process safety management and accident prevention is a team effort.  Employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, Acres Homes Plant hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Acres Homes Plant has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n5.    Five-year Accident History\nAcres Homes Plant has had an excellent record of preventing accidental releases over the last five years.  Due to its stringent release prevention policies, there have been no accidental releases during this period.\n\n\n6.    Emergency Response Plan\nAcres Homes Plant carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, and notification of local emergency response agencies and the public.\n\nTo ensure proper functioning, the facility's emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within Ac"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12027,
      "SummaryText": "res Homes Plant's processes that would require a modified emergency response.\n\n"
    }
  ]
}