{
  "FacilityID": 12037,
  "FacilityName": "GE Appliances - Louisville",
  "FacilityStr1": "Appliance Park",
  "FacilityStr2": null,
  "FacilityCity": "Louisville",
  "FacilityState": "KY",
  "FacilityZipCode": "40225",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21111",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "38.166667",
  "FacilityLongDecDegs": "-85.65",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ge.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 826219974,
  "ParentCompanyName": "General Electric Company",
  "Company2Name": null,
  "CompanyDUNS": 1367960,
  "Company2DUNS": 0,
  "OperatorName": "GE Appliances",
  "OperatorStr1": "Appliance Park",
  "OperatorStr2": null,
  "OperatorCity": "Louisville",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "40225",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tim Hooker",
  "RMPTitle": "Program Manager",
  "FTE": 8000,
  "OtherEPAFacilityID": "40225GPPLNAPPLI",
  "EPAFacilityID": "100000126801",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "Applied for",
  "SafetyInspectionDate": "1999-04-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2003-05-29 00:00:00",
  "DeRegistrationEffectiveDate": "2003-04-15 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.16833,
  "FRS_Long": -85.65167,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16078,
      "AltID": "Polyurethane Foaming",
      "FacilityID": 12037,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16480,
          "ProcessID": 16078,
          "NAICSCode": "33522",
          "_desc": {
            "NAICS_CODE": "33522",
            "NAICS_DESCRIPTION": "Major Household Appliance Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 20088,
          "ProcessID": 16078,
          "ChemicalID": 77,
          "Quantity": 463000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 77,
            "ChemicalName": "Toluene diisocyanate (unspecified isomer)  [Benzene, 1,3-diisocyanatomethyl-]",
            "CASNumber": "26471-62-5",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 520088,
          "ProcessID": 16078,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 16079,
      "AltID": "TDI Railcar",
      "FacilityID": 12037,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16481,
          "ProcessID": 16079,
          "NAICSCode": "33522",
          "_desc": {
            "NAICS_CODE": "33522",
            "NAICS_DESCRIPTION": "Major Household Appliance Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 20089,
          "ProcessID": 16079,
          "ChemicalID": 77,
          "Quantity": 1840000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 77,
            "ChemicalName": "Toluene diisocyanate (unspecified isomer)  [Benzene, 1,3-diisocyanatomethyl-]",
            "CASNumber": "26471-62-5",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 520089,
          "ProcessID": 16079,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12037,
      "SummaryText": " EXECUTIVE SUMMARY\n 0.1    INTRODUCTION\n This Risk Management Plan is part of GE Appliances continuing commitment to minimize the potential for any negative impact from our facility on our workers, our community neighbors, or the environment.  It is the stated policy of GE Appliances to safely manage our site operations. We believe it is important for all interested parties to have access to information that can help them better understand our business and our facility.  If you have any questions about this document, or any other aspect of our company or our plans, please contact our community relations representative at (502) 452-4647.  \n 0.2    ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n Our company is committed to operating safe and environmentally sound production facilities everywhere we do business. Protection of our neighbors and workers is the highest priority.  This ongoing commitment to worker and public safety is demonstrated through resources invested for safe design, operation, and maintenance of our facilities.  \n In order to provide top quality products for our customers, the Appliance Park facility uses in its manufacturing process a raw material that is classified as toxic by the US Environmental Protection Agency (EPA).  We are committed to comply with governing laws, regulations, and engineering standards as well as systematic assessments to manage and maintain a safe operation.   Our operating practices and procedures ensure that numerous controls are implemented to prevent an accidental release of a chemical.  However, if a major release does occur, our on-site emergency response plan will be activated. \n 0.3    DESCRIPTION OF THE FACILITY AND REGULATED SUBSTANCES\n Appliance Park facility is located in an industrial area on the south-east side of Louisville, KY.  Here we manufacture a wide variety of home appliances including washers, dryers, ranges, dishwashers, and top mount refrigerators.  The facility has been in existence since th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12037,
      "SummaryText": "e early 1950s and employs over 8000 workers from the surrounding community. \n In order to ensure quality products, quality service and quality of life, GE has invested millions of dollars in the site for expansion, capital improvement, safety and environmental protection.  \n The Appliance Park site uses one chemical that is regulated under the EPA's Risk Management Program (RMP) rule.  This is Toluene Diisocyanate (TDI), a regulated toxic substance.  TDI is a raw material used to manufacture the polyurethane insulating foam in our refrigerator doors and cases. \n 0.4    HAZARD ASSESSMENT RESULTS\n As part of our risk management planning, we have specifically identified the type of event as required by the U. S. Environmental Protection Agency (EPA) that, should it ever occur, no matter how unlikely, would have the most negative impacts on our workers and our neighbors.  This is known as the Worst-Case Scenario (WCS).  In order for this event to occur, we are required to assume that the numerous engineering and administrative safety controls we have in place to prevent or mitigate such accidents have all failed at once. \n This worst-case scenario would involve the catastrophic failure of a railcar tanker containing TDI liquid while it is positioned at our plant site.  A catastrophic failure means a type of event that essentially results in the instantaneous release of the entire vessel contents, which is up to 184,000 pounds of TDI in this case. The TDI liquid would slowly evaporate and the vapors would disperse in the direction of the prevailing wind.  \n According to EPA guidelines, exposure to TDI at levels above 0.98 parts per million  (0.007 mg per liter) for approximately one hour can result in serious health effects. We have estimated that this level of TDI could reach no farther than approximately 540 feet from the location of the spill.  This is less than the distance to our nearest neighbor. \n 0.5    GENERAL ACCIDENTAL RELEASE PREVENTION / CHEMICAL-SPECIFIC PREVENTI"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12037,
      "SummaryText": "ON STEPS\n GE Appliances has in place specific safety devices and procedures designed to prevent accidental releases of hazardous chemicals.  These are an integral part of working safely at GE Appliances.  These programs ensure that proper safety information is in place; operating procedures are followed; chemical hazards are identified; employees are trained; and critical equipment is inspected and maintained.\n Some of the many environmental health and safety controls or practices to prevent a chemical accident include:\n7 Secondary containment dikes provided at TDI chemical unloading areas. \n7 Dikes around bulk TDI storage tanks to contain a spill and minimize emissions to the atmosphere. \n7 Bulk TDI storage tanks are located inside, and are isolated from the manufacturing operation.\n7 Main bulk tanks are equipped with level indicators to prevent overfill.\n7 Computerized TDI vapor monitoring system to warn of a release.  \n7 Environmental health and safety information about the processes and the chemicals available to employees.\n7 Written spill reporting procedures and emergency response actions.\n7 Maintenance programs to ensure ongoing equipment reliability.\n7 Compliance auditing to ensure standards are being followed.\nGE is engaged in an aggressive and comprehensive effort to identify and address Year 2000 issues.  We are in the process of inventorying our equipment at the site, interviewing suppliers, putting into place corrective actions where necessary, and developing a contingency plan.  We are on track to complete this process prior to the critical roll-over date and believe we have addressed the systems and equipment necessary for safe site operation.\n0.6    FIVE YEAR ACCIDENT HISTORY\nAppliance Park has a good record of accident prevention that demonstrates its commitment to public and worker safety.  Even minor incidents are investigated to identify what went wrong and to learn how to prevent future occurrences.  \nEPA requires that all incidents involving regul"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12037,
      "SummaryText": "ated chemicals that resulted in any off-site impact or significant on-site impacts are reported in this document.  During the previous five-year period, no such incidents have occurred at the plant site. \n0.7    EMERGENCY RESPONSE PROGRAM\nAppliance Park maintains a written emergency response program designed to protect workers, the public, and the environment in the event of a major accident or fire at the site.  Employees are trained to properly response to an incident.  In the event of any significant release of TDI we will contact the federal, state, and local authorities as required by our Spill Prevention Control and Countermeasure Plan and the specific situation.\nOngoing emergency response coordination is important to GE's emergency response organization and helps better prepare our partners in the community for emergency response necessary in the unlikely event of a major industrial incident. \nGE personnel have helped develop emergency preparedness plans for local communities.  In addition, they are members of local emergency planning and emergency preparedness groups and are active members of local industry groups involved with risk management planning.  \n0.8    PLANNED CHANGES TO IMPROVE SAFETY\nGE Appliances is committed to continuously improving the overall safety and environmental performance record at the Appliance Park facility.   \nGE continuously strives to find new and innovative ways to improve its manufacturing processes thereby reducing waste, improving environmental performance, and minimizing risk.  Currently, GE Appliances is working diligently to identify a new insulating foam formulation that would increase the energy efficiency of our refrigerators, while at the same time reduce or eliminate the use of TDI."
    }
  ]
}