{
  "FacilityID": 12044,
  "FacilityName": "PAMPA WASTE WATER TREATMENT PLANT",
  "FacilityStr1": "HWY LOOP 171 EAST OF CITY",
  "FacilityStr2": null,
  "FacilityCity": "PAMPA",
  "FacilityState": "TX",
  "FacilityZipCode": "79065",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48179",
  "LEPC": "Gray County LEPC",
  "FacilityLatDecDegs": "35.5725",
  "FacilityLongDecDegs": "-100.928333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "pubworks@pan-tex.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "CITY OF PAMPA",
  "OperatorStr1": "P.O. Box 2499",
  "OperatorStr2": null,
  "OperatorCity": "PAMPA",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79066",
  "OperatorZipCodeExt": "2499",
  "RMPContact": "RICHARD MORRIS, P.E.",
  "RMPTitle": "DIRECTOR OF PUBLIC WORKS",
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000127249",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-10 00:00:00",
  "SafetyInspectionBy": "OMI Contract Operator",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-11-20 00:00:00",
  "DeRegistrationEffectiveDate": "2018-10-30 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.6075,
  "FRS_Long": -101.92333,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16086,
      "AltID": null,
      "FacilityID": 12044,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16488,
          "ProcessID": 16086,
          "NAICSCode": "325181",
          "_desc": {
            "NAICS_CODE": "325181",
            "NAICS_DESCRIPTION": "Alkalies and Chlorine Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 20096,
          "ProcessID": 16086,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 520096,
          "ProcessID": 16086,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12044,
      "SummaryText": "EXECUTIVE SUMMARY\nCITY of PAMPA WASTEWATER TREATMENT PLANT\n\nGeneral Facility Information\n\nThe Pampa Wastewater Treatment Plant located off of Highway Loop 171, east of the City in Gray County.  The facility is owned by the City of Pampa and operated by Operations Management International, Inc (OMI).  Capacity of the facility is 3.0 million gallons per day (MGD).  Presently on average, the wastewater treatment plant processes 2.2 MGD of wastewater.  The plant utilizes an activated sludge oxidation ditch process that operates 24 hours per day year round.  The plant is staffed 9 hours per day Monday through Friday and on week ends 4 hours per day.  A maximum of 3 tons of chlorine gas in one ton containers are stored onsite with 2 containers being connected and online at any one time.  \n\nOngoing safety training programs cover all phases of plant operation from maintenance and operations safety to safe handling of chlorine.  OMI also conducts formal training as well as onsite training during normal daily operations.  OMI also using outside vendors to conduct safety training relating to plant safety and chemical safety.  Due to this safety training, this plant has not had any significant chlorine release or accidents in the last five years.\n\n\nHazard Assessment Information\n\n40 CFR Part 68, Subpart B - Hazard Assessment, outlines a specific set of criteria required to be used in the modeling of worst case and most probable case release scenarios.  Worst case and most probable case scenario modeling was completed using Areal Locations of Hazardous Atmospheres (ALOHA) software.\n\nTo complete most probable case and worse case scenario plume models, the default level of concern for chlorine was set at levels established in accordance with EPA and American Industrial Hygiene Association standards.  The resulting plume indicates a level where individuals would be able to take protective actions without suffering any serious health effects from a chemical exposure during a one hour"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12044,
      "SummaryText": " or less time period.  Most probable case and worse case scenario plume analysis results are conservative estimates based on the ALOHA software, using RMP release and meteorological requirements.\n\n\nPrevention Program Information\n\nThe Pampa Wastewater Treatment Plant processes 2.2 MGD of domestic sewage.  OMI has an on-going training plan that involves both classroom and on-the-job training.  All new employees who will be required to handle chlorine are trained in chlorine safety and undergo Right-to-Know training.  \nAny small controlled leak will be handled by plant personnel and all other leaks will be handled by the Pampa Fire Department.\n\n\nEmergency Response Information \n\nA controlled release of the chlorine product located at the wastewater treatment plant, will be defined as the escape of gas to the atmosphere in small, non-reportable quantities, resulting from standard operating procedures of connecting or disconnecting chlorine containers and standard maintenance procedures on the plant's chlorine equipment.\n\nAn uncontrolled release of chlorine gas which will require the implementation of the emergency response procedures is defined as any release other than those examples defined as similar to controlled releases.  Emergency responses to the treatment plant will be made by the Pampa Fire Department, in accordance with the facility emergency plan and the Gray County Emergency Response Plan.  If uncontrolled release conditions warrant such actions, shelter-in-place, evacuation, and public warning will be implemented by the Pampa/Gray County Office of Emergency Management.  Any uncontrolled release of chlorine gas shall be subject to an after action incident investigation by the City of Pampa, OMI, and exclusive State and Federal regulatory agencies for review and oversight."
    }
  ]
}