{
  "FacilityID": 12124,
  "FacilityName": "Indeck - Corinth Energy Center",
  "FacilityStr1": "24 White Street",
  "FacilityStr2": null,
  "FacilityCity": "Corinth",
  "FacilityState": "NY",
  "FacilityZipCode": "12822",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36091",
  "LEPC": "Saratoga County LEPC",
  "FacilityLatDecDegs": "43.25",
  "FacilityLongDecDegs": "-73.8125",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "AS",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 931395115,
  "ParentCompanyName": "Indeck Energy Services",
  "Company2Name": null,
  "CompanyDUNS": 131203945,
  "Company2DUNS": null,
  "OperatorName": "Indeck-Corinth Limited Partnership",
  "OperatorStr1": "24 White Street",
  "OperatorStr2": null,
  "OperatorCity": "Corinth",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "12822",
  "OperatorZipCodeExt": null,
  "FTE": 14,
  "OtherEPAFacilityID": "000007372532",
  "EPAFacilityID": "100000128676",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "5-4126-00028",
  "SafetyInspectionDate": "1996-03-14 00:00:00",
  "SafetyInspectionBy": "New York State Department of Labor",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2000-12-12 00:00:00",
  "DeRegistrationEffectiveDate": "2000-06-17 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 43.249249,
  "FRS_Long": -73.809586,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16183,
      "AltID": "Catalytic Reduction (SCR)",
      "FacilityID": 12124,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 20201,
          "ProcessID": 16183,
          "ChemicalID": 57,
          "Quantity": 27000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 16589,
          "ProcessID": 16183,
          "NAICSCode": "22111",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 6874,
              "Process_NAICS_ID": 16589,
              "SafetyReviewDate": "1999-06-16 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "API Standards",
              "FR_Comments": null,
              "HazardReviewDate": "1996-03-14 00:00:00",
              "ChangeCompletionDate": "1996-10-23 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "2 water canons with fogger nozzles",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-19 00:00:00",
              "TrainingReviewDate": "1999-06-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-10 00:00:00",
              "EquipmentInspectionDate": "1999-06-04 00:00:00",
              "EquipmentTested": "Process area detector - GASTECH multiport gas alarm system",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-06-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 7170,
                  "PreventionProgram2ID": 6874,
                  "ProcessChemicalID": 20201
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12124,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Village of Corinth Fire Department",
    "CoordinatingAgencyPhone": "5186549015",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12124,
      "SummaryText": "Polices:\n\nCorporate policy places the personnel safety of the company's employees and members of the public as the highest priority.  Regulatory compliance is likewise given the highest priority.  The CEO has issued corporate Safety and Environmental policies, which detail the responsibilities of management and supervisory personnel at the facility in these regards.  Management is responsible for maintaining safe and healthful working conditions as well as environmental compliance.  Supervision is responsible for the safety of employees working under their supervision and conducting operations in a safe and environmentally sound manner.\n\nEfforts continue to reduce the on-site hazardous chemical inventory.  This has been accomplished through substitution of alternative products which pose a reduced impact on the environment and personal safety, and by administrative controls which minimize the maximum quantity of regulated  hazardous chemicals on-site at any given time.\n\nFacility and its regulated substances:\n\nThe Indeck-Corinth Energy Center is constructed on approximately 3.56 acres of land located in the Town and Village of Corinth, Saratoga County, New York.  The property is owned by International Paper and leased to Indeck.  The facility's primary SIC Code is 4911, Steam Electric Services.\n\nThe station consists of an 84 MW General Electric frame 7001EA combustion gas turbine generator (CGTG), heat recovery steam generator (HRSG), 47 MW General Electric condensing steam turbine generator, an electrical distribution system, water treatment system and distributed control system (DCS).\n\nWaste heat from the CGTG exhausts into a 369,970 pph, two pressure HRSG.  Supplemental firing is provided by a duct burner to generate 1450 psig, 9800F and 165 psig, 4100F superheated steam.  High-pressure steam from the HRSG is routed to the steam turbine generator.  Low-pressure steam is used by International Paper for their process.  Condenser circulating water is cooled by a four"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12124,
      "SummaryText": "-cell cooling tower and recirculated from the concrete cooling tower basin back to the condenser.\n\nThe primary fuel source for the facility is natural gas.  Kerosene is available as a back up fuel to the combustion turbine in the event the natural gas supply is interrupted.\n\nSelective Catalytic Reduction (SCR) is used to reduce nitrogen oxide (NOx) emissions created during the combustion process in accordance with the facility's air permit requirements.  Aqueous ammonia is used as a reacting agent within a catalyst to convert the NOx into inert nitrogen and water vapor.  The aqueous ammonia (30% ammonia and 70% water) used in the process is a regulated hazardous substance covered by 40 CFR 68 Chemical Accident Prevention Provisions. \n\nThe aqueous ammonia is stored in a 20,000 gallon carbon steel tank which has been administratively controlled to a maximum level of 12,000 gallons.  The tank is constructed of carbon steel and is insulated.  The tank is within an impervious reinforced concrete containment dike. The dike has been sized to contain at a minimum the entire contents of the tank (20,000 gallons) plus a ten-percent safety margin.  Also within the dike are the ammonia transfer pumps, the ammonia tank overflow and a neutralization tank.  The neutralization tank is a 25,000 gallon tank used to neutralize regenerate waste from the water treatment process.  The ammonia tank is equipped with an ITT-Barton level gauge, which reads locally, at the unloading station and in the control room.  High level alarms are sounded in the control room and at the unloading station. \n\nDeliveries of aqueous ammonia are unloaded at a transfer station located adjacent to the ammonia dike.  The transfer station consists of a concrete pad that drains into a concrete containment trench.  The containment trench has been sized to contain at least the volume of a delivery truck plus a ten-percent safety margin.  Transfer operations are performed in accordance with the facility's Chemical U"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12124,
      "SummaryText": "nloading Operating Procedure.\n\nThere is a process area detector located in the area of the aqueous ammonia tank.  The detector senses the ammonia content of the air near the tank and sounds an alarms in the control room if there is an ammonia leak.\n\nRelease scenarios:\n\nThe model used to determine the distance to toxic endpoints was RMP*Comp which was provided by the EPA. \n\nWorst-case toxic release scenario: The worst-case toxic release scenario is based on a failure of the aqueous ammonia storage tank.  The aqueous ammonia storage tank has a capacity of 20,000 gallons.  Administrative controls have lowered the maximum allowable capacity (working capacity) to 12,000.  To ensure the 12,000 gallon limit is not exceeded, written operating procedures have been updated to reflect the changes and the level transmitter has been re-spanned such that 12,000 gallons equates with an indication of 100 percent.  High level alarm is set at 95 percent or 11,400 gallons.  Initiating a purchase order for a delivery of aqueous ammonia is based on the tank level reaching a maximum ordering level.  This is the level that corresponds with the highest current tank level in which a full delivery truck of product can be safety transferred into the tank without overflowing the tank.  The maximum ordering level has been lowered to correspond with administratively lowering the tank level to 12,000 gallons.  This has been done to ensure the offloading of a truck will not exceed the high-level alarm point.\n\nQuantity released for the scenario is based on a total release of the vessel containing 12,000 gallons (27,000 pounds):\n\n12,000gal  x  8.33lb/gal  x  0.896  x  .3  =  26,869  ~  27,000lbs\n\nThe specific gravity of the aqueous ammonia is 0.896 and the concentration of ammonia in the solution is 30 percent.\n\nUrban topography was chosen for the scenario.  Urban topography for the model is based on there being many obstacles in the immediate area; obstacles include buildings or trees.  The facil"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12124,
      "SummaryText": "ity is located within the Adirondack mountains, adjacent to the Hudson river, an area with many trees and hilly terrain.\n\nThe maximum ambient temperature over the past three years is based on information obtained from the U.S. Government Weather Service.\n\nDue to the short distance (0.1 mile or 528 feet) to the toxic end point, there are only two residential houses, which are located right at the limit of the 528-foot radius of the aqueous ammonia tank.  The residential population of the two houses is six people.  \n\nThere are no public receptors located within 0.1 mile of the aqueous ammonia tank.\n\nThe facility is located within New York's Adirondack State Park, which an environmental receptor.  Environmental receptors were determined with the assistance of U.S.G.S. topographical map TNY0212.\n\nFor the worst-case scenario passive mitigation includes the dike that provides containment for the release.  The liquid aqueous ammonia is assumed to spread out within the area of the containment to a level of one inch and then evaporates off.\n\nAlternative toxic release scenario: The alternative release under consideration is a transfer hose failure during the offloading of an ammonia transport truck.  The largest shipment to date was 6,127 gallons delivered Aug 28, 1996.  \n\nQuantity released is based on a total release of a delivery truck containing 6,250 gallons:\n\n\t6,250gal  x  8.33lb/gal  x  0.896  x  .3  =  13,994  ~  14,000lbs\n\nAs with the worst-case analysis the specific gravity is 0.896 and the solution contains 30-percent ammonia. Urban topography for the model is based on there being many obstacles in the immediate area; obstacles include buildings or trees.  The facility is located within the Adirondack Mountains, adjacent to the Hudson River, an area with many trees and hilly terrain.\n\nThe model calculated a distance of <0.1 mile to the toxic end point.  It is recommended that in cases where a toxic endpoint is less than 0.1 mile that 0.1 mile is used for the analysi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12124,
      "SummaryText": "s.  \n\nDue to the short distance (0.1 mile or 528 feet) to the toxic end point, there are only two residential houses, which are located right at the limit of the 528-foot radius of the aqueous ammonia tank.  The residential population of the two houses is six people.\n\nThere are no public receptors located within a 0.1 mile radius to the aqueous ammonia tank.\n\nThe facility is located within New York's Adirondack State Park, which is an environmental receptor.  Environmental receptors were determined with the assistance of U.S.G.S. topographical map TNY0212.\n\nFor the alternative scenario active and passive mitigation can be considered.  The area of the transfer station dike is taken into account,  with the same consideration as the worst-case for pooling of the product in the dike. There is active mitigation provided through the use of two water canons that can be used to fog the ammonia plume.\n\nPrevention:\n\nThe facility is located in New York State and is therefore subject to New York State Department of Environmental Conservation's Chemical Bulk Storage regulations as described in 6 NYCRR Parts 595 - 599.  Under these regulations the ammonia tank is required to meet specific design criteria and is subject to an inspection regiment that requires the tank to be inspected at least once every five years according to recommended inspection techniques.  American Petroleum Institute (API) standards have been selected to meet the inspection requirements which project an estimated life expectancy of the tank.\n\nDue to the low concentration of ammonia in the aqueous ammonia solution, 30 percent, the facility is not required to meet the requirements of OSHA's Process Safety Management standard.\n\nFive-year accident history:\n\nThere have been no accidental releases at the facility over the past five years.\n\nEmergency response program:\n\nThe Village of Corinth, New York has a written Emergency Management Response Plan in which lines of authority and responsibility are established as"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 12124,
      "SummaryText": "well as actions to be taken in the event of an emergency within the village.  A release involving the aqueous ammonia system at the facility is addressed in the Plan under the Plan's Identification of Potential Hazards.  In the event of such a release the fire department is responsible for evacuation and isolation of the site.  The Saratoga County's HAZ MAT team would respond to handle initial response to the hazardous material.  Cleanup operations would be addressed by a designated hazardous spill response team contracted by the facility.\n\nThe facility's Emergency Plan has been written to meet the requirements of 29 CFR 1910.38.  Accordingly the plan is designed as an Emergency Action Plan, which addresses emergency evacuation procedures and routes; procedures to be followed by employees who remain to operate critical plant operations prior to evacuation; methods for accounting for employees after evacuation; how to report emergencies; and persons who can be contacted in the event of an emergency. \n\nPlanned changes:\n\nWe have recently upgraded our safety, training, and maintenance programs to meet the requirements of 40 CFR 68 Chemical Accident Prevention Provisions.  Through the implementation of these programs we expect to continue our established record of operating in a safe manner.   A further evaluation of our on-site chemical storage requirements is planned."
    }
  ]
}