{
  "FacilityID": 12265,
  "FacilityName": "Nekoosa Papers, Inc. Waste Treatment Plant",
  "FacilityStr1": "100 Wisconsin River Drive",
  "FacilityStr2": null,
  "FacilityCity": "Port Edwards",
  "FacilityState": "WI",
  "FacilityZipCode": "54469",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55141",
  "LEPC": "Wood County LEPC",
  "FacilityLatDecDegs": "44.328333",
  "FacilityLongDecDegs": "-89.88",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "DKREINKE@GAPAC.COM",
  "FacilityDUNS": null,
  "ParentCompanyName": "Georgia-Pacific Corporation",
  "Company2Name": null,
  "CompanyDUNS": 6137251,
  "Company2DUNS": null,
  "OperatorName": "Daniel R. Trettin",
  "OperatorStr1": "100 Wisconsin River Drive",
  "OperatorStr2": null,
  "OperatorCity": "Port Edwards",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54469",
  "OperatorZipCodeExt": null,
  "FTE": 20,
  "OtherEPAFacilityID": "WID98063319",
  "EPAFacilityID": "100000132625",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-11 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2019-06-13 00:00:00",
  "DeRegistrationEffectiveDate": "2019-01-10 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 44.332222,
  "FRS_Long": -89.880833,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16408,
      "AltID": "Anhydrous Ammonia System",
      "FacilityID": 12265,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 20468,
          "ProcessID": 16408,
          "ChemicalID": 56,
          "Quantity": 85850.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 16819,
          "ProcessID": 16408,
          "NAICSCode": "322121",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8573,
              "Process_NAICS_ID": 16819,
              "SafetyReviewDate": "1999-02-01 00:00:00",
              "PHA_Date": "1999-07-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-04-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-08-31 00:00:00",
              "TrainingReviewDate": "1998-11-03 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-12-31 00:00:00",
              "EquipmentInspectionDate": "1999-04-28 00:00:00",
              "EquipmentTested": "Ammonia Storage Tank",
              "ChangeMgmtDate": "1999-06-09 00:00:00",
              "ChangeMgmtReviewDate": "1999-03-15 00:00:00",
              "PreStartupReviewDate": "1999-06-09 00:00:00",
              "ComplianceAuditDate": "1999-03-15 00:00:00",
              "AuditCompletionDate": "1999-07-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-08-15 00:00:00",
              "HotWorkPermitReviewDate": "1998-11-15 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-28 00:00:00",
              "ContractorSafetyEvalDate": "1999-04-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 11769,
                  "PreventionProgram3ID": 8573,
                  "ProcessChemicalID": 20468
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12265,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-01 00:00:00",
    "ERTrainingDate": "1999-05-20 00:00:00",
    "CoordinatingAgencyName": "Wood County LEPC",
    "CoordinatingAgencyPhone": "7154218500",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12265,
      "SummaryText": "Georgia-Pacific Nekoosa Operations\nRisk Management Plan\nAnhydrous Ammonia Wastewater Treatment System\n\n\n1.\tExecutive Summary\n\nGeorgia-Pacific Nekoosa Operations (GP/Nekoosa) is committed to operating in a manner that is safe for GP/Nekoosa workers, the public, and the environment. As part of this commitment, the Company has established a system to help ensure safe operation of the hazardous chemical processes at this facility. One component of this system is a Risk Management Program (RMP) that helps manage the risks at the facility and addresses compliance with the requirements of the Environmental Protection Agency's (EPA) Regulation 40 CFR 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP Rule). One of the requirements of the RMP Rule is to submit a Risk Management Plan (RMPlan) describing the Risk Management Program at Georgia-Pacific in Nekoosa. This document is intended to satisfy the RM Plan requirements of the RMP Rule and to provide the public with a description of the Risk Management Program at the facility.\n\nThe Risk Management Program at the facility consists of four elements:\n\n1. a hazard assessment to help understand (a) the potential off site consequences of hypothetical accidental releases and (b) accidents that may have occurred during the last five years associated with the use of the substances regulated by the RMP rule (Anhydrous ammonia) - see topic 1.3\n\n2. a prevention program to help maintain and safely operate the processes containing more than the threshold quantity of the regulated substances (covered processes) - see topic 1.4\n\n3. an emergency response program to help respond to accidental releases of the regulated substances from the covered processes - see topic 1.6\n\n4. a management system that delineates responsibility for implementing and maintaining the Risk Management Plan.\n\nInformation further describing these elements is provided in this RM Plan.\n\nAlthough the Risk Management Program at the facility"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12265,
      "SummaryText": "helps provide assurance that the facility is maintained and operated in a safe manner, it is only one component of the safety program at GP/Nekoosa. In fact, the facility has a comprehensive safety program in place establishing many levels of safeguards that are designed to minimize the potential for the release of any hazardous substance and injuries and damage resulting from the release of a hazardous substance.\n\nGP/Nekoosa minimizes the potential releases of the hazardous substances used at the facility. When hazardous substances are used at the facility, the equipment is carefully designed, built, and operated to reduce the likelihood of an accidental release. Industry and government standards are closely adhered to in design, construction, and operation of the equipment.\n\n\n\nGP/Nekoosa limits damage from a release, if such a release occurs. The facility trains workers to respond to upset conditions, reducing the consequences of a release if it occurs. In addition, the facility will be working with the Local Emergency Planning Commission (LEPC) to help ensure that injuries and/or environmental damage will not occur in the event that a release does occur.\n\nThe safety programs at GP/Nekoosa consist of a number of elements, only, some of which are required by the RMP Rule. This RMPlan is primarily intended to describe those parts of the safety program at the facility that are required by the RMP Rule.\n\n\n1.1\tAccidental Release Prevention and Emergency Response Policies\n\nGP/Nekoosa is committed to the safety of workers and the public, as well as the preservation of the environment through the prevention of accidental releases of hazardous substances. The facility implements reasonable controls to prevent foreseeable releases of the hazardous substances. These controls include training programs for personnel; programs to help ensure safety in the design, installation, operation, and maintenance of the processes; and programs to evaluate the hazards at the facility.\n\nIn"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12265,
      "SummaryText": "the event of an accidental release, the facility will control and contain the release in a manner that will be safe for workers and will help prevent injury to the public and/or the environment. GP/Nekoosa provides response training for upset conditions to facility personnel, designates an emergency response coordinator to oversee response activities, and coordinates response efforts with the local emergency response organizations.\n\nIn order to effectively implement these policies, the facility has established a management system directed by the Vice President/Wisconsin Operations.\n\n\n1.2\tGeorgia-Pacific Nekoosa Operations and Our Regulated Substance\n\nThe Georgia-Pacific Nekoosa Mill owns and operates a wastewater treatment facility jointly with the nearby G-P Port Edwards Mill.  The facility treats effluent from both mills.  Anhydrous ammonia is used as a nutrient in the wastewater treatment at the treatment facility.  The anhydrous ammonia is stored under pressure (215 pounds per square inch, gage), as a liquid, in a 17,170 gallon capacity tank (water capacity), with administrative controls in the process safety information and operating procedures limiting storage to 85% of capacity.  Maximum storage is 85,850 pounds at the density of 5 #/gal.  The nutrient is fed to the aeration basin via submerged transfer lines.  The covered process, as defined by the OSHA PSM process boundary, includes the storage tank and 1 inch diameter transfer line.\n\n1.3\tOff Site Consequence Analysis\n\nGP/Nekoosa performed an off site consequence analysis to estimate the potential for an accidental release of the regulated substance to affect the public or the environment. The off site consequence analysis consists of evaluating both a worst-case release scenario and an alternative release case scenario. The facility does not expect a worst-case release scenario to ever occur. An alternative release scenario represents a release that (1) might occur at a facility like the GP/Nekoosa treatm"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12265,
      "SummaryText": "ent plant and (2) would result in an off site consequence if the release occurred. \n\nThe alternative release scenarios will  help the Local Emergency Planning Committee improve the community emergency response plan.\n\nThe main objective of performing the off site consequence analysis is to determine the distance at which certain effects might occur to the public because of an accidental release (called the endpoint distance). The following effects could occur at the endpoint distance. At distances less than the end point distance, the effects would be greater; at distances greater than the endpoint distance, the effects would be less.\n\nWhen considering the release of a toxic substance, such as anhydrous ammonia, most people at the endpoint distance would be able to walk away from the exposure without any long-term health consequences, although some short-term consequences (e.g., strong eye or throat irritation) are likely.\n\nThe RMP Rule includes specific requirements for the worst-case and alternative release scenarios that must be reported by Georgia-Pacific Nekoosa Operations. These requirements include:\n\n* one worst-case release scenario for a toxic substance in a Program Level 3 \tprocess (one scenario representing anhydrous ammonia)\n* one alternative release scenario for each toxic substance in a Program Level 3 \tprocess (one scenario representing anhydrous ammonia)\n\nThe following information summarizes the off-site consequence analysis performed by Georgia-Pacific Nekoosa Operations.\n\n\n1.3.1 Program Level 3 Process - Anhydrous Ammonia Wastewater Treatment System\n\nThe worst-case release scenario for the Anhydrous Ammonia Wastewater \nTreatment System is the failure of the storage tank, releasing 85,850 pounds of the toxic material as a gas over a 10-minute period. The predicted impact distance where concentrations are greater than the toxic endpoint, extends beyond G-P Nekoosa facility property.  The RMP*Comp Model predicts an impact to a distance of 5.4 miles. Th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12265,
      "SummaryText": "e estimated population within a circle of this radius is 15,980.  Several public receptors are also located within this distance (e.g., several industrial facilities, several public and private elementary schools and high schools, several nursing homes, several churches, several recreational parks, and numerous subdivisions). There are also several environmental receptors.\n\nThe alternative release scenario for anhydrous ammonia is a break in the one-inch diameter transfer line from the bottom of the storage tank, releasing gaseous ammonia for a period of 15 minutes before workers detect and shut down the process.  Considering the tank is under pressure (215 pounds per square inch, gage), and there are no pumps used, the choked flow formula (equation D-11 in the OCA Guide) is used to calculate the release rate from the tank.  According to Table 4-4, this rate is 2,231 pounds per minute, resulting in the release of  33,458 pounds of anhydrous ammonia, which, due to its buoyancy in air and low boiling point, is assumed to vaporize quickly and form a gaseous jet release at ground level. The maximum distance to the toxic endpoint for anhydrous ammonia for the alternative release scenario is 0.80 mile using the RMP*Comp Model. \n\nThe estimated population within a circle of this radius is 539.  Several public receptors are also located within this distance eg., (another industrial facility, a recreational park, and  subdivisions). There are also several environmental receptors.\n\n\n1.4 Accidental Release Prevention Program\n\nGeorgia-Pacific Nekoosa Operations has always used a prevention program to help prevent accidental releases of hazardous substances. Beginning in 1992, the facility formalized this prevention program for the Anhydrous Ammonia Wastewater Treatment System to comply with the 14 elements of the Occupational Safety Administration and Health Administration's (OSHA's) Process Safety Management (PSM) Prevention Program. In 1996, the EPA RMP Rule established that a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 12265,
      "SummaryText": "Program Level 3 Prevention Program would become a requirement for this process as well. The facility's Program Level 3 Prevention Program under the RMP Rule is essentially the same as the OSHA PSM Program, except that the program also focuses on protecting the public and the environment.\n\n\n1.4.   The following sections briefly describe the elements of the Georgia-Pacific Nekoosa Operations Program Level 3 Prevention Program that addresses the EPA RMP Rule prevention program requirements for the Anhydrous Ammonia Wastewater Treatment System.\n\n1. Employee Participation. The facility has developed a written employee participation program for the covered process to help ensure that the safety concerns of GP/Nekoosa employees are addressed. The facility encourages active participation from personnel in the development and maintenance of the prevention program activities of all processes at the facility. Employees are consulted on, and informed about, all aspects of the RMP Rule prevention program, including the development of Process Hazard Analysis and Operating Procedures.\n\n2. Process Safety Information.  The facility maintains a variety of technical documents that are used to help ensure the safe operation of the process. The documents address (1) the hazards of the chemicals used in the process, (2) the technical data of the process, and (3) the design basis and configurations of the equipment used in the processes. The facility ensures that this process safety information is maintained, accurate, and available to all GP/Nekoosa employees, and the Local Emergency Planning Committee (LEPC). All of the information and documentation for the RMP Prevention Program is maintained in the PSM/RMP Center at the facility.\n\nMaterial safety data sheets (MSDS's) document the physical and chemical properties of the hazardous substances handled at the facility, including non-regulated substances in the covered process. MSDS's for hazardous substances handled in each process are av"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 12265,
      "SummaryText": "ailable in the control rooms so the operators have ready reference to this information. In addition, MSDS's are provided to the LEPC and/or Plant Emergency Response teams for use in helping formulate emergency response plans\n\nMany of the operating parameters are included in the technical information to help with the safe operation of the process. These documents are also used (1) to train employees, (2) to perform process hazard analysis, and (3) to help maintain the equipment to the design specification.\n\n3. Process Hazard Analysis.  GP/Nekoosa performs and periodically updates process hazard analyses (PHAs) of the covered processes to help identify process hazards and generate recommendations that might improve the safe operation of the process. A team composed of personnel with engineering and process operating experience and a team leader with experience in performing process hazard analyses is assembled to analyze the process. The facility primarily uses the What If/Checklist' technique,  to perform this analysis. The PHA team prepares a written report describing the results of the analysis, including recommendations. Responsibility for resolving the recommendations is assigned to personnel and, when appropriate, changes to enhance the safety of the process are implemented.\n\n4. Operating Procedures. GP/Nekoosa operators, supervisors, and engineers work together to develop and maintain accurate operating procedures to define how tasks related to process operations should be safely performed. The operating procedures (1) are used to train employees and (2) serve as reference guides for appropriate actions to take during both normal operations and upset operating conditions. The operating procedures include:\n\n-\tsteps for safely conducting activities\n\n-\tapplicable process safety information, such as safe operating limits and                consequences of process deviations\n\n-\tsafety and health considerations, such as chemical hazards, personal protective equipme"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 12265,
      "SummaryText": "he facility. The facility reviewed OSHA's fire prevention and protection requirements in 29 CFR 1910.252(a) and created a Hot Work Permit form to comply with these requirements. Personnel who are to perform hot work are required to fill out the Hot Work Permit form. The supervisor reviews the completed form before work can be initiated.\n\n\n\n10. Management of Change.  The GP/Nekoosa management of change program evaluates and approves all proposed changes to chemicals, equipment, and procedures for a covered process to help ensure that the change does not negatively affect safe operations. Process changes that are determined to be a replacement in kind are allowed without completing a management of change form. All other changes must be confirmed through the full management of change program to help ensure that inadvertent consequences of the process changes are prevented, safety consequences of the changes are addressed, affected process safety information and operating procedures are updated, and affected employees are notified of the changes.\n\n11. Incident Investigations.  GP/Nekoosa investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented. The facility trains employees to identify and report any incident requiring investigation. An incident investigation team is assembled, and the investigation is initiated within 48 hours of the incident. The results of the investigations are documented, recommendations are resolved, and appropriate process enhancements are implemented.\n\n12. Compliance Audits.  GP/Nekoosa audits the covered processes to be certain that the facility's prevention program is effectively addressing the safety issues of the operations. The facility assembles an audit team that includes personnel knowledgeable in the RMP Rule and in the process, and this team evaluates whether the prevention program satisfies the requirements of the RM"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 12265,
      "SummaryText": "nt requirements, and actions to take if exposure to a hazardous substance occurs\n\nThe facility personnel develop and maintain operating procedures that cover all phases of the operations, including initial start-up, normal operations, normal shutdown, emergency shutdown, start up following a standby condition or emergency shutdown, and temporary operations. The facility reviews and certifies the operating procedures annually.\n\n5. Training. GP/Nekoosa trains employees to safely and effectively perform their assigned tasks. The facility training program for process operators includes both the initial training and refresher training that covers (1) a general overview of the process, (2) the properties and hazards of the substance in the process, and (3) a detailed review of the process operating procedures and safe work practices. Written tests and oral reviews are used to verify that the employee understands the training materials before the employee can operate the process.\n\nThe operators are consulted annually about the frequency of the training and the materials to be used for the training. Recommendations from the operators are reviewed and changes to the training are implemented as appropriate.\n\n6. Contractors.  GP/Nekoosa has established a program to help ensure that contractor activities at the facility are performed in a safe manner. The program reviews the safety record of all contractors to help ensure that the facility only hires contractors who can safely perform the desired job tasks. GP/Nekoosa explains to the contract supervisors and contract employees, the hazards of the process on which they and their employees will work, the facility safe work practices, and the emergency response procedures for the facility. \n\n\nThe facility requires that the contractor supervisors train each of their employees who will work on or near a covered process before that employee begins work at the site. The facility periodically reviews contractors' training documents and"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 12265,
      "SummaryText": "work performance to ensure that safe practices are followed.\n\n7. Pre-startup Safety Reviews.  GP/Nekoosa performs a safety review of new or modified equipment in the covered process before the process is placed into service to help ensure that the process has been prepared to operate safely. This review confirms that:\n\n-\tconstruction and equipment are in accordance with design specifications\n\n-\tadequate safety, operating, maintenance and emergency procedures are in place\n\n-\temployee training has been completed\n\n-\tfor a covered process, a PHA has been performed if the process is new or management of change requirements have been completed if an existing process has been modified.\n\nA pre-startup safety review checklist is completed to document the review and to ensure that the appropriate issues have been addressed.\n\n8. Mechanical Integrity.  GP/Nekoosa maintains the mechanical integrity of the covered process equipment to help prevent equipment failures that could endanger workers, the public, or the environment. The facility mechanical integrity program includes (1) an inspection and testing program to help identify equipment deterioration and damage before the equipment fails and (2) a quality assurance program to help ensure that new and replacement equipment meet the design standards required for service in GP/Nekoosa covered processes. The facility mechanical integrity program also includes:\n\n-\tspecifications for inspection and testing of process equipment\n\n-\tspecifications for replacement parts and equipment\n\n-\tstandard maintenance procedures for inspecting, testing, and maintaining \tprocess equipment\n\n-\tprocedures for safe work practices such as lockout/tag out, hot work and \tconfined space entry\n\n-\ttraining of maintenance personnel\n\n-\tdocumentation of maintenance activity\n\n9. Hot Work Permit.  GP/Nekoosa has established a hot work permit program to control spark or flame- producing activities that could result in fires or explosions in covered processes at t"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 12265,
      "SummaryText": "P Rule and, also whether the prevention program is sufficient to help ensure safe operations of the process. The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n\n1.5\tFive - Year Accident History-\n\nThere have been no accidental releases of anhydrous ammonia in the past five years that resulted in deaths, injuries or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.  The secondary treatment system was started up in 1976 using anhydrous ammonia as a nutrient for the organisms that cleanse the process water.  Since startup, there have been no releases that caused injury, damage or off site consequences for this 23 year period.\n\n\n1.6\tEmergency Response Programs\n\nGeorgia Pacific Nekoosa Operations has established a written Emergency Response Program to help safely respond to accidental releases of hazardous substances. The Emergency Response Plan includes procedures for:\n\n- informing the local response organizations and the public about accidental releases that could reasonably result in off-site consequences\n\n- providing proper first aid and emergency medical treatment to treat accidental human exposure to hazardous substances at the facility\n\n- controlling and containing accidental releases of hazardous substances, including the use of emergency response equipment\n\n- inspecting and maintaining emergency response equipment\n\n- reviewing and updating the Emergency Response Plan\n\nThe facility maintains an Emergency Response Team (HAZMAT Team) trained in these emergency response procedures. All the facility personnel are trained in evacuation procedures. The facility periodically conducts emergency response drills, including an annual drill coordinated with the local fire department.\n\nThe written Emergency Response Plan complies with other federal contingency plan regulations and will be c"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 12265,
      "SummaryText": "ommunicated to local emergency response officials through the Local Emergency Planning Committee. The facility maintains a regular dialogue with the local emergency response organizations and provides appropriate information to them."
    }
  ]
}