{
  "FacilityID": 12334,
  "FacilityName": "San Juan Water District",
  "FacilityStr1": "9935 Auburn-Folsom Road",
  "FacilityStr2": null,
  "FacilityCity": "Granite Bay",
  "FacilityState": "CA",
  "FacilityZipCode": "95746",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06061",
  "LEPC": null,
  "FacilityLatDecDegs": "38.721139",
  "FacilityLongDecDegs": "-121.174222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "San Juan Water District",
  "OperatorStr1": "9935 Auburn-Folsom Road",
  "OperatorStr2": null,
  "OperatorCity": "Granite Bay",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95746",
  "OperatorZipCodeExt": null,
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000129504",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.7231,
  "FRS_Long": -121.17518,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16504,
      "AltID": "Water Chlorination",
      "FacilityID": 12334,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 20579,
          "ProcessID": 16504,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 16916,
          "ProcessID": 16504,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8628,
              "Process_NAICS_ID": 16916,
              "SafetyReviewDate": "1998-11-01 00:00:00",
              "PHA_Date": "1998-11-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-04-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-11-01 00:00:00",
              "TrainingReviewDate": "1998-11-01 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-11-01 00:00:00",
              "EquipmentInspectionDate": "1999-04-01 00:00:00",
              "EquipmentTested": "Chlorination Equipment",
              "ChangeMgmtDate": "1998-11-01 00:00:00",
              "ChangeMgmtReviewDate": "1998-11-01 00:00:00",
              "PreStartupReviewDate": "1998-11-01 00:00:00",
              "ComplianceAuditDate": "1998-11-01 00:00:00",
              "AuditCompletionDate": "1999-04-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-11-01 00:00:00",
              "HotWorkPermitReviewDate": "1998-11-01 00:00:00",
              "ContractorSafetyReviewDate": "1998-11-01 00:00:00",
              "ContractorSafetyEvalDate": "1998-11-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Program 3 Prevention Program\n\nThe San Juan Water District accidential release policy involves a unified aproach that integrates technologies, procedures, and management practices, and is in compliance with all applicable EPA Prevention Program requirements.\n\nChemical specific prevention steps include availability of self-contained breathing apparatus (SCBA), awareness of the hazardous and toxic propertiess of chlorine, and presence of chlorine leak detectors.\n\n1.  Safety Information\n\nThe San Juan Water District has developed and maintains written safety information about the chlorination process comprising of:\na.  Hazards posed by the chlorination process,\nb.  The technology of the chlorination process,\nc.  The equipment used in the chlorination process.\nThe chlorination process is designed in compliance with recognized and generally accepted good engineering practices.  The operation of the facility adheres to the guidelines of the Chlorine Institute.\nThe Water District will update this safety information if a major change occurs that makes the information inaccurate.\n\n2.  Process Hazard Analysis\n\nThe Water District conducted a process hazard analysis (PHA) appropriate to the complexity of the chlorination process, for the purpose of identifying, evaluating, and controlling hazards involved in the process using the What-If/Checklist methodology.  The following required items were identified:\na.  The hazards associated with chlorine and the chlorination process.\nb.  Possibility of equipment malfundctions or human errors that could cause an accidental relaese.\nc.  The safeguards used or needed to control the hazards or prevent equipment malfunction or human error.\nd.  Steps used to detect or monitor releases.\n\nAll equipment was inspected during the PHA; it was determined that the chlorination facility was designed, built, and operated in accordance with applicable codes and industrial guidelines.\nThe results of the PHA were documented.\nThe PHA will be updated at least once every five years.  The Water District will also conduct reviews whenever a major change in the process ocurs;  all issues identified in the review will be resolved before startup of the changed process occurs.\n\n3.  Operating Procedures\n\nThe Water District has prepared written procedures that provide clear instructions or steps for safely conducting activities associated with the chlorination process.  They are consistent with the applicable safety information.\n\nThe following procedures are included in the Water District Operation Manual for Chlorination.\n1.  Steps for each operating phase: initial startup;  normal operations; temporary operations;  emergency shutdown and operations;  startup following a normal or emergency shutdown or a major change that requires a PHA; emergency operations; and normal shutdown.\n2.  Operating limits showing consequences of deviation and steps required to correct or avoid deviation.\n3.  Safety and health considerations that address properties of chlorine; precautions to prevent exposure; and controls to be taken if exposure occurs.\n4.  Safety systems and their functions were also reviewed during the PHA.\n\n4.  Training\n\nThe Water District ensures the each employee presently operating the chlorination process, and each employee newly assigned to this process has been trained or tested competent in the operating procedures linted above that pertain to their duties.  Training documentation files include a written certification for each employee assigned to operate the chlorination process that the employee has the required knowledge, skills, and abilities to safely carry out the duties and responsibilities as provided in the operating procedures.\n\nRefresher training is provided yearly to each employee operating the chlorination process to ensure that the employee understands and adheres to the current operating procedures of the process.  The Water District ensures that operators are trained in any updated or new procedures prior to startup of a process after a major change.\n\n5.  Mechanical Integrity\n\nThe Water District has a preventive maintenance program to ensure the mechanical integrity of the chlorination system components, including the functions of inspection and testing, deficiency correction, and quality assurance.  The Water District performs these functions on the following equipment connected with the chlorination process:  chlorine pressure vessels; piping system; relief and vent systems; emergency shutdown systems; controls; pumps; and leak detection systems.\n\n6.  Management of Change\n\nSan Juan Water District has implemented written procedures to manage changes (except for replacement-in-kind) to process chemicals technology, equipment, and procedures; and, changes to stationary sources that affect the chlorination process.  Necessary forms and procedures assure that the following considerations are addressed prior to any change:  the technical basis for the proposed change; impact of change on safety and health; modifications to operating procedures; necessary time period for the change, and authorization requirements for the proposed change.\n\nEmployees affected by a change in the process are informed of and  trained in the change prior to start-up of the process or affected part of the process.  Safety information and operating procedures are updated accordingly.\n\n7.  Pre- Startup Review\n\nWritten procedures have been developed to allow for operators to perform a pre-startup safety review for new or modified chlorination equipment, or where modification to the process is significant enough to require a change in the process safety information.  The pre-startup review confirms: construction and equipment is in accordance with design specifications; safety, operating, maintenance, and emergency procedures are in place and are adequate; a PHA is performed for new chlorination facilities; and, employees involved in the process are trained.\n\n8.  Compliance Audits\n\nCompliance audits will be conducted every 3 years to verify that the procedures and practices followed are adequate and are being followed.  At least one person knowledgeable in the process will conduct the audit; a report will be developed; appropriate response will be documented; deficiency correction will be documented; and, the two most recent audit reports will be retained.\n\n9.  Incident Investigation\n\nThe San Juan Water District will investigate each incident which resulted in, or could reasonabley have resulted in a catastrophic release.  The investigation will be initiated as soon as possible, but not later than 48 hours following the incident.  A incident investigation form has been developed that addresses all key factors of the incident and asks for recommendations resulting from the investigation.  Recommendations will be promptly addressed, resolutions and corrective actions will be documented.  Findings will be reviewed with all affected personnel.  Investigation summaries will be retained for 5 years.\n\n10.  Employee Participation\n\nManagers and operators of the San Juan Water District chlorination facilities participated in the process hazard analysis.  The PHA has been made availble to affected employees.\n\n11.  Hot Work Permit\n\nA hot work permit process has been developed and implemented for hot work operations conducted on or near the chlorination process.  The permit documents the fire and accident  prevention requirements and is implemented prior to beginning any hot work operations.  The permit is kept on file until completion of the hot work.\n\n12.  Contractors\n\nContractors working on or near the chlorination station are required to comply with the regulatory provisions of process safety management.  A form has been developed to address the following:  contractor's safety program; informing contractor about hazards at the site; reviewing the emergency evacuation plans; recording contractor meetings about the hazards; requiring contractors to train their employees in the hazards of the process.\n\n13.  Emergency Response Program\n\nSan Juan Water District has developed and implemented a emergency response program that coordinates response with local emergency responders.",
              "_chemicals": [
                {
                  "PrimaryKey": 11837,
                  "PreventionProgram3ID": 8628,
                  "ProcessChemicalID": 20579
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12334,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-04-01 00:00:00",
    "ERTrainingDate": "1999-04-01 00:00:00",
    "CoordinatingAgencyName": "South Placer Fire Department",
    "CoordinatingAgencyPhone": "9167917059",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12334,
      "SummaryText": "RMP Executive Summary\n\n1.  Accidental Release Prevention and Emergency Response Policy\n\nThe San Juan Water District accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices.  All applicable procedures of the U.S.  Environmental Protection Agency (EPA) Prevention Program are adhearde to.  The San Juan Water District emergency response policy involves the preparation of response plans which are tailored to it's facility and to the emergency response services available in the community, and is in compliance with the EPA Emergency Response Program Requirements.\n\n2.  Stationary Source and Regulated Substances\n\nThe San Juan Chlorination Station has been installed to disinfect treated water for potable purposes.   The station includes treatment plant offices, a chlorination room, a chemical storage area, instrument rooms, and additional miscellaneous offices.  The amount of chlorine connected to the manifold system are four one-ton cylinders.  There are a maximum of 8 one-ton cylinders in the area with a maximum of four connected to the manifold.\n\n3.  Worst Case Release and the Alternative Release Scenarios\n\nThe offsite consequence analysis includes consideration of two chlorine release scenarios, identified as \"worst cas release\" and alternative scenario\".  The first scenario is defined by EPA, which states that \"the owner or operator shall assume the the  ... maximum quantity in the largest vessel ... is released as a gas over 10 munutes,\" due to an inspecified failure.  The alternative scenario is defined as \"more likely to occur than the worst-case release scenario\".\n\nAtmospheric dispersion modeling has to be performed to determine the distance traveled by the chlorine released before its concentration decreases to the \"toxic enpoint\" selected by EPA of 3 ppm, which is the Emergency Response Planning Guideline Level 2 (ERPG -2).  This is defined by the American Industrial Hygiene Asociation (AIH"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12334,
      "SummaryText": "A) as the \"maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious helth effects or symptoms which could impair an individual's ability to take protective action.\"  The residential population with a circle with a raduis corresponding to the toxic endpoint distance has to be defined, \"to estimate the population potentially affected\".\n\nThe worst-case release scenario at the San Juan Chlorination Station involves a failure of a one ton-container which is connected concurrently (a total of 8,000 lb of chlorine).  The offsite consequence analysis for this scenario was performed for the following conditions.  The conditions are pre-defined by EPA, namely release of the entire amount as a gas in 10 minutes, use of the one-hour average ERPG-2 as the toxic endpoint, and consideration of the population residing within a full circle with radius corresponding to the toxic endpoint distance.  EPA set these conditions to facilitate the performance of the offsite consequence analysis.\n\nEPA-mandated meteorological conditions, namely Stability F, wind speed of 1.5 m/sec, temperature (25 degrees C), and average humidity (65%) were used.  When atmospheric dispersion modeling for the worst case scenario was performed using the EPA assumptions, a distance to toxic endpoint of 2.7 miles and an estimate of residential population potentially affected of 10,000 was obtained. \n\nThe alternative release scenario involves the rupture of the flexible connections (pigtails) connected to two ton-containers, possible dur to an earthquake.  The amount of chlorine released is 900 lb, at an average rate over one hour (the duration of the release) of 15.0 lb/min.  The typical meteorological conditions used were Stability D, wind speed 3.0 m/s, average air temperature of 62 degrees F, and 63% average humidity.  The estimated distances traveled to the toxic endpoint is .1 mil"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12334,
      "SummaryText": "e.\n\nActuation of the chlorine leak detection system is an active mitigation measure used at this facility.  As the facility is staffed 24 hours per day, this will alert on-site staff who can activate the emergency response plan.\n\n4.  General Accidental Release Prevention Program\n\nThe San Juan Water District chlorine station accidental release prevention program is in compliance with the OSHA PSM rule and this rule.  It is based on the following key elements:\n*  High level of training of the operators\n*  Preventive maintenance program\n*  Use of state-of the-art process and safety equipment\n*  Use of accurate and effective operating procedures, written with the participation of the operators\n*  Performance of a hazard review of equipment and procedures\n*  Implementation of an auditing and inspection program.\n\nChemical-specific prevention steps include availability of self-contained breathing apparatus (SCBA), awareness of the hazardous and toxic properties of chlorine, and presence of chlorine detectors.\n\n5.  Five Year Accident History\n\nNo accidental releases of chlorine have occurred at this facility in the past five years.\n\n6.  Emergency Response Program\n\nThe facility has an emergency response program, which has been coordinated with local emergency response agencies.  Joint training drills are planned to be conducted with the local fire department on an annual basis.  Emergency operation and response procedures are also reviewed at that time.\n\n7.  Planned Changes to Improve Safety\n\nThere are no plans to improve safety of the facility at this time."
    }
  ]
}