{
  "FacilityID": 1236,
  "FacilityName": "The Dune Company of Imperial Valley - Imperial",
  "FacilityStr1": "506 East 2nd Street",
  "FacilityStr2": null,
  "FacilityCity": "Imperial",
  "FacilityState": "CA",
  "FacilityZipCode": "92251",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06025",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "32.842222",
  "FacilityLongDecDegs": "-115.572778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A4",
  "LatLongDescription": "AB",
  "FacilityURL": "www.gowanco.com",
  "FacilityEmailAddress": "bembree@gowanco.com",
  "FacilityDUNS": 613269786,
  "ParentCompanyName": "Gowan Company",
  "Company2Name": null,
  "CompanyDUNS": 79014221,
  "Company2DUNS": null,
  "OperatorName": "Alan Quick",
  "OperatorStr1": "P.O. Box 967",
  "OperatorStr2": null,
  "OperatorCity": "Imperial",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92251",
  "OperatorZipCodeExt": null,
  "FTE": 21,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000014771",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-08 00:00:00",
  "SafetyInspectionBy": "Gowan Environmental Services, Inc.",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-05-27 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-05-25 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-10-04 00:00:00",
  "DeRegistrationEffectiveDate": "2004-09-21 00:00:00",
  "AnniversaryDate": "2004-05-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.4",
  "FRS_Lat": 32.84126,
  "FRS_Long": -115.564947,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1339,
      "AltID": "Anhydrous ammonia storage",
      "FacilityID": 1236,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1431,
          "ProcessID": 1339,
          "ChemicalID": 56,
          "Quantity": 394000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1359,
          "ProcessID": 1339,
          "NAICSCode": "42291",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1010,
              "Process_NAICS_ID": 1359,
              "SafetyReviewDate": "1999-04-27 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "Yes",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-04-27 00:00:00",
              "ChangeCompletionDate": "1999-04-27 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Daily visits by fertilizer yardsmen.",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-27 00:00:00",
              "TrainingReviewDate": "1999-04-27 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-27 00:00:00",
              "EquipmentInspectionDate": "1999-04-27 00:00:00",
              "EquipmentTested": "All process equipment including tanks, pipes, pumps, etc.",
              "ComplianceAuditDate": "1999-04-27 00:00:00",
              "AuditCompletionDate": "1999-04-27 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-04-27 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1019,
                  "PreventionProgram2ID": 1010,
                  "ProcessChemicalID": 1431
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1236,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "City of Imperial Fire Department",
    "CoordinatingAgencyPhone": "7603551191",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1236,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe Dune Company of Imperial, California accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices.  All applicable procedures of the EPA Prevention Program and California Accidental Release Program are adhered to.  The Dune Company emergency response policy involves the preparation of response plans which are tailored to the facility and to the emergency response services available in the community, and is in compliance with the EPA Emergency Response Program requirements.\n\nThe Dune Company of Imperial, California is a retailer of anhydrous ammonia for agricultural purposes.  This facility serves the local area farmers with ammonia for purposes of facilitating crop growth.  The facility contains anhydrous ammonia in several storage tanks.  The storage vessels, piping, pumps, and various other equipment are interconnected within the storage area.  The storage vessels capacities at the facility include a 18,000-gallon tank, a 22,000-gallon tank, and a 31,690-gallon tank.  All these tanks are interconnected.  The station is usually unmanned unless utilized.  Yardsmen visit the station daily and respond to any problems and alarms as they may occur. \n\nThe offsite consequence analysis includes consideration of two ammonia release scenarios, identified as worst case release and alternative release scenario.  The first scenario is defined by the EPA, which states that the owner or operator shall assume that the ... maximum quantity in the largest vessel ... is released as a gas over 10 minutes, due to an unspecified failure.  The alternative release scenario is one that is more likely to occur than the worst case release scenario.\n\nAtmospheric dispersion modeling has to be performed to determine the distance traveled by the ammonia released before its concentration decreases to the toxic endpoint selected by the EPA of 0.14 mg/L, which is the Emergency Response Planning G"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1236,
      "SummaryText": "ntially affected of 20,000 was obtained, as a result of the entire city of Imperial and surrounding area were encompassed.\n\nThe alternative release scenario involved the rupture of a tank possibly due to vehicular damage or vandalism.  The amount of ammonia released was predicted to be 540 lbs/min and toxic endpoint distances from ERPG-2 were obtained.  The latter is defined by AIHA as the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing life-threatening health effects.  The typical meteorological conditions used were a Stability Class D, wind speed 3.0 m/s, average air temperature, and average humidity.  The estimated distances traveled to the toxic endpoints was 0.4 miles for the ERPG-2.\n\nThe general DWP accidental release prevention program is based on the following key elements:\n\u0015\tHigh level of training of the operators.\n\u0015\tPreventative maintenance program.\n\u0015\tUse of state-of-the-art process and safety equipment.\n\u0015\tUse of accurate and effective operating procedures, written with the participation of the operators.\n\u0015\tPerformance of a hazard review of equipment and procedures.\n\u0015\tImplementation of an auditing and inspection program.\n\nChemical specific prevention steps include availability of self-contained breathing apparatus (SCBA), worn by the operators during connection/disconnection of ammonia supply, and awareness of the hazardous and toxic properties of ammonia.\n\nNo accidental releases of anhydrous ammonia have occurred at this facility in the past five years.\n\nThe facility is subject to the Program 2 requirements for federal regulations and the California Accidental Release Prevention standard as assessed from the Process Hazard Evaluation and the following reasons:\n\n\u0015\tThe distance to a toxic substance endpoint for a worst case release is greater than the distance to a public receptor.\n\n\u0015\tThe facility Standard Industrial Code (SIC) Classification is 51"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1236,
      "SummaryText": "91 - Wholesale Trade: Farm Supplies.\n\n\u0015\tThe facility North American Industrial Classification System (NAICS) number is 42291 - Farm Supplies Wholesale.\n\n\u0015\tProcesses are not subject to the OSHA PSM requirements.\n\n\u0015\tThe facility does possess in excess of the threshold quantities established for anhydrous ammonia.\n\nThe facility has an emergency response program, which has been coordinated (reviewed) by the City of Imperial Fire Department, which is a member of the Local Emergency Response Planning Committee (LEPC).  This program includes an emergency response decision tree and a notification plan.  Emergency response drills and drill evaluations are conducted once every year; emergency operations and response procedures are also reviewed at that time."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1236,
      "SummaryText": "uideline Level 2 (ERPG-2).  This is defined by the American Industrial Hygiene Association (AIHA) as the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without which could impair an individual's ability to take protective action.  The residential population within a radius corresponding to the toxic endpoint distance has to be defined, to estimate the population potentially affected.\n\nThe worst case release scenario at The Dune Company of Imperial, California involves a failure of the lines and all mitigation systems within the station between any of the tanks.  Because all the tanks, pipes, pumps, and equipment are interconnected, the total amount of ammonia that potentially could be released would amass to approximately 394,000 lbs.  The offsite consequence analysis for this scenario was performed for two sets of conditions.  The first set followed conditions pre-defined by the EPA, namely release of the entire amount as a gas in 10 minutes, use of the one hour average ERPG-2 as the toxic endpoint, and consideration of the population residing within a full circle with radius corresponding to the toxic endpoint distance.  EPA set these conditions to facilitate the performance of the offsite consequence analysis; however, the assumptions used may be unrealistic because:\n\n\u0015\tOnly the population within an elliptical plume extending downwind of a release point is potentially affected.  This plume, or footprint, is approximately 6% (one-twentieth) of the area of the full circle.\n\n\u0015\tIt is not appropriate to compare a 10-minute release to a one hour average standard.  The one hour ERPG value can be modified using available time of exposure/concentration relationships to match the ten minute release time.\n\nWhen atmospheric dispersion modeling for the worst case scenario was performed using the EPA assumptions, a distance to toxic endpoint of 11 miles and an estimate of residential population pote"
    }
  ]
}