{
  "FacilityID": 12436,
  "FacilityName": "DuPont  -  Parlin",
  "FacilityStr1": "Cheesequake Rd",
  "FacilityStr2": null,
  "FacilityCity": "Parlin",
  "FacilityState": "NJ",
  "FacilityZipCode": "08859",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34023",
  "LEPC": "Sayreville LEPC",
  "FacilityLatDecDegs": "40.458333",
  "FacilityLongDecDegs": "-74.316667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "P5",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 869330050,
  "ParentCompanyName": "E.I.DuPont de Nemours & Co., Inc.",
  "Company2Name": null,
  "CompanyDUNS": 869330050,
  "Company2DUNS": 0,
  "OperatorName": "E.I. DuPont de Nemours & Co., Inc.",
  "OperatorStr1": "1007 Market Street",
  "OperatorStr2": null,
  "OperatorCity": "Wilmington",
  "OperatorStateFIPS": "DE",
  "OperatorZipCode": "19898",
  "OperatorZipCodeExt": null,
  "RMPContact": "Edwin L. Walters",
  "RMPTitle": "EHS Responsible Manager",
  "FTE": 300,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000131163",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-12 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.45814,
  "FRS_Long": -74.32881,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "PUBLIC LAND SURVEY - FOOTING",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16633,
      "AltID": "WA Adhesive",
      "FacilityID": 12436,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 17047,
          "ProcessID": 16633,
          "NAICSCode": "32552",
          "_desc": {
            "NAICS_CODE": "32552",
            "NAICS_DESCRIPTION": "Adhesive Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 20727,
          "ProcessID": 16633,
          "ChemicalID": 25,
          "Quantity": 50400.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 25,
            "ChemicalName": "Acrylonitrile  [2-Propenenitrile]",
            "CASNumber": "107-13-1",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 520727,
          "ProcessID": 16633,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12436,
      "SummaryText": "\n                                                         EXECUTIVE SUMMARY    -    RMP\n                                                         ----------------------------------------\n\n                                                                           PARLIN\n                                                                           ---------\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n----------------------------------------------------------------------------------------------\n\n      The DuPont Parlin Plant is commited to operating and maintaining all its processes in a safe and responsible manner.  We adhere to the DuPont Corporate philosophy that:\n\n>  All Safety incidents, Enironmental incidents, and Occupational injuries and illnesses are preventable;   \n>  All employees and contractors are responsible for their safety;  and\n>  The \"Goal is Zero\" - Zero Incidents Period, \"ZIP\".\n\nThis means that we continuously strive for zero process safety incidents, zero environmental incidents, and zero injuries.  We have programs, procedures and management practices in place to support this goal of zero.  We constantly measure our progress towards this goal of zero and take corrective actions when deemed necessary.\n\n     The Corporate policies are embodied in the numerous Safety, Health, and Environmental (SHE) and Engineering Standards, which apply globally.  At the Parlin plant, the policies are implemented through the \"Safety How\" manual which is available and reviewed by all our employees.  In addition, the Parlin Plant's Emergency Manual details the complete emergency program for the site.\n\n     Our primary focus is on prevention of any accidental release.  However, we have strong emergency response capabilities to back up our prevention activities.  We use this combination of prevention programs and emergency response capability to help ensure the safety of our employees and the public as well as the protection of the environment.\n\nFACILITY"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12436,
      "SummaryText": " DESCRIPTION\n\n     The DuPont Parlin plant, located in Sayreville, has been in operation since the early 1900's.  During this period, the plant has manufactured a variety of products including:  paints, thinners, pigments, adhesives, x-ray films, and graphic arts films.  We currently manufacture flexographic printing plates used in the printing industry, Teflon non-stick coatings for cookware, and electronic resins for the computer industry.  Acrylonitrile, an TCPA/EPA-regulated substance, is used as a raw material to manufacture one of the products described above.\n\n     The plant occupies approximately 350 acres of land of which 140 acres is set aside as a wildlife habitat area.  The plant is surrounded by a seven-foot high chain link fence including three angled strands of barbed wire on top.  All gates are kept locked except when under direct surveillance by plant guards or other plant personnel.  Ingress and egress for plant employees are via a card access system.  Visitors, contractors, and vehicular traffic follow an established procedure to enter and exit the plant.\n\nWORST CASE TOXIC RELEASE SCENARIO\n\n     The EPA defines a worst case scenario as a hypothetical release of the largest quantity of the regulated chemical.  The scenario assumes the entire content of the container is released in 10 minutes, even if it is impossible to do so.\n\n     Using the methods provided by the EPA, the worst case toxic release scenario of the Acrylonitrile would be the release of the entire contents in the storage tank through a catastrophic failure of the tank.  Under this scenario, none of the prevention and mitigation equipments, practices, and procedures that have been put in place to prevent or respond to releases such as this are taken into consideration.  This release would have an off-site impact as determined by the use of the Offsite Consequence Analysis(OCA) Guidance and the \"Landview\" program census data.  However, a release like this is highly unlikely due to the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12436,
      "SummaryText": " high-integrity design and construction of the tank.\n\nALTERNATIVE TOXIC RELEASE SCENARIO\n\n     The alternative toxic release scenario for DuPont Parlin is a break in the  Acrylonitrile transfer pipeline from the storage tank to the manufacturing area.  This scenario assumes average weather conditions and also assumes that all our safety measures work and that our emergency response team is able to respond.  Under this scenario, the release would have an off-site impact as determined by the use of the Offsite Consequence Analysis(OCA) Guidance and the \"Landview\" program census data.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\n     The DuPont Parlin plant applies rigorous process safety management practices to all our processes and not just to those covered by laws and regulations.  These practices which are designed to prevent accidental releases include:\n\no  A thorough understanding of our process technology ;including the safe limits of our processes and the proper design, construction, and installation of our equipment;\no  Systematic process hazard review studies to identify and manage process hazards;\no  Meeting or exceeding applicable codes and standards;\no  Written operating and maintenance procedures;\no  Extensive training for all our operators and maintenance personnel;\no  A contractor management system to ensure that work performed by contractors is done safely and meets DuPont's quality standards;\no  Mechanical integrity testing and preventive maintenance to detect and avoid potential equipment problems;\no  Conducting pre-startup safety reviews prior to starting up any new or modified equipment;\no  A work permit system to control hazards;\no  Routine safety audits;\no  Corporate and governmental audits and reviews;\no  Extensive accident prevention and mitigation systems are strategically located throughout the site;\no  Investigations of all incidents with corrective actions taken to prevent recurrence;\n\nIn addition to the above-mentioned practices, we have design"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12436,
      "SummaryText": "ed our processes to include multiple layers of safeguards such as:  low concentration chemical detectors that signal alarms to operators and our emergency control center;  interlocks to automatically shut down processes when certain deviation are detected and process alarms to warn operataors of process deviations;  high level alarm on the storage tank;  and a concrete dike around the storage tank to contain spills and releases.\n\nEMERGENCY RESPONSE PROGRAM\n\n     DuPont Parlin is committed to maintaining strong emergency response capabilities to back up our release prevention acitivities.  The plant has an up-to-date written Emergency Response Plan and we routinely conduct drills to test the plan.  Critiques are held on drills and acutal events and the Emergency Plan is updated to incorporate key learnings from the critique.\n\n     The plant has an emergency response team available 24 hours a day.  The team is thoroughly trained and properly equipped to respond to releases of any chemical stored or used on our plant.  The plant is a member of the Sayreville Local Emergency Planning Committee and we coordinate our drills with the Sayreville Office of Emergency Management.\n\nIf a release occurs:\n\no  The emergency alarm is sounded;\no  The plant emergency control center is activated;\no  Govermental agencies (federal, state, and local) are notified as appropriate;\no  The emergency response team responds:\no  On-site and fence line monitoring are conducted;\no  After mitigation, the \"All Clear\" alarm is sounded;  and\no  Critique of the incident is conducted.\n\nFIVE-YEAR ACCIDENT HISTORY\n\n     There has been no death, injury, property damage, environmental damage, evacuation, or sheltering in place due to the accidental release of the regulated substance, Acrylonitrile, from the DuPont Parlin plant in the past five years.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n     As part of our process hazards review procedures, all of our processes are thoroughly studied on a periodic basis to i"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12436,
      "SummaryText": "dentify risk reduction opportunities.  As a result of the most current review, we have       implemented the following:\n\no  Annual internal inspection of the storage tank;\no  Installatioin of lightning and surge protection for the storage tank and improved grounding grid for the  tank farm;\no  Upgrading relief valves and other safety devices on the storage tank and process equipment;\no  Installation of high temperature interlock on the reactor;\no  Installation of low and high pressure switches on the storage tank;\no  Installation of limiters in production equipment to insure control of reactor temperature; and\no  Conducting process safety audits to identify any deficiencies in our management systems."
    }
  ]
}