{
  "FacilityID": 12451,
  "FacilityName": "Port Hudson Operations",
  "FacilityStr1": "West Mount Pleasant Road",
  "FacilityStr2": null,
  "FacilityCity": "Zachary",
  "FacilityState": "LA",
  "FacilityZipCode": "70791",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22033",
  "LEPC": "East Baton Rouge LEPC",
  "FacilityLatDecDegs": "30.65",
  "FacilityLongDecDegs": "-91.274444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PP",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 39102421,
  "ParentCompanyName": "Georgia-Pacific Corp.",
  "Company2Name": null,
  "CompanyDUNS": 9020777,
  "Company2DUNS": null,
  "OperatorName": "Georgia-Pacific Corp.",
  "OperatorStr1": "PO Box 430",
  "OperatorStr2": null,
  "OperatorCity": "Zachary",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70791",
  "OperatorZipCodeExt": null,
  "FTE": 860,
  "OtherEPAFacilityID": "70791GRC-PZACHA",
  "EPAFacilityID": "100000130761",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "0840-00010-01",
  "SafetyInspectionDate": "1997-07-15 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": "1999-07-15 00:00:00",
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": "2019-03-14 00:00:00",
  "DeRegistrationEffectiveDate": "2019-03-01 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 30.650644,
  "FRS_Long": -91.281167,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16653,
      "AltID": "Pulp and Paper Mill",
      "FacilityID": 12451,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 20748,
          "ProcessID": 16653,
          "ChemicalID": 71,
          "Quantity": 60278.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 17067,
          "ProcessID": 16653,
          "NAICSCode": "32212",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8721,
              "Process_NAICS_ID": 17067,
              "SafetyReviewDate": "1999-01-25 00:00:00",
              "PHA_Date": "1999-01-25 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-01-31 00:00:00",
              "TrainingReviewDate": "1999-02-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-21 00:00:00",
              "EquipmentInspectionDate": "1997-02-12 00:00:00",
              "EquipmentTested": "ClO2 Storage Tanks",
              "ChangeMgmtDate": "1999-02-24 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-13 00:00:00",
              "PreStartupReviewDate": "1999-02-28 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-26 00:00:00",
              "HotWorkPermitReviewDate": "1998-11-15 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-12 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 11941,
                  "PreventionProgram3ID": 8721,
                  "ProcessChemicalID": 20748
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12451,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-01-26 00:00:00",
    "ERTrainingDate": "1999-02-18 00:00:00",
    "CoordinatingAgencyName": "Zachary Fire Department",
    "CoordinatingAgencyPhone": "2256540026",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 9,
      "FacilityID": 12451,
      "SummaryText": "ined to be replacements in kind are allowed without completing a management of change form. All other changes must be confirmed through the full management of change program to help ensure that inadvertent consequences of the process changes are prevented, safety consequences of the changes are addressed, affected process safety information and operating procedures are updated, and affected employees are notified of the changes.\n \n 11. Incident Investigations.  GP/Port Hudson investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented. The facility trains employees to identify and report any incident requiring investigation. An incident investigation team is assembled and the investigation is initiated within 48 hours of the incident. The results of the investigations are documented, recommendations are resolved, and appropriate process enhancements are implemented.\n \n 12. Compliance Audits.  GP/Port Hudson audits the covered processes to be certain that the facility's prevention program is effectively addressing the safety issues of the operations. The facility assembles an audit team that includes personnel knowledgeable in the RMP Rule and in the process, and this team evaluates whether the prevention program satisfies the requirements of the RMP Rule and also whether the prevention program is sufficient to help ensure safe operations of the process. The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n \n \n \n \n  1.4.3\tChemical-specific Prevention Steps\n \n In addition to the required prevention program elements, GP/Port Hudson has implemented safety features specific to the Chlorine Dioxide Solution System. Chlorine Dioxide is produced at the facility and stored as a diluted aqueous solution to avoid the necessity of transporting large quantities of the solution."
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 12451,
      "SummaryText": "existing process has been modified.\n \n A pre-startup safety review checklist is completed to document the review and to ensure that the appropriate issues have been addressed.\n \n 8. Mechanical Integrity.  GP/Port Hudson maintains the mechanical integrity of the covered process equipment to help prevent equipment failures that could endanger workers, the public, or the environment. The facility mechanical integrity program includes, (1) an inspection and testing program to help identify equipment deterioration and damage before the equipment fails and (2) a quality assurance program to help ensure that new and replacement equipment meets the design standards required for service in GP/Port Hudson covered processes. The facility mechanical integrity program also includes:\n \n -\tSpecifications for inspection and testing of process equipment\n \n -\tSpecifications for replacement parts and equipment\n \n -\tStandard maintenance procedures for inspecting, testing, and maintaining process equipment\n \n -\tProcedures for safe work practices, such as lockout/tag out, hot work, confined space entry\n \n -\tTraining of maintenance personnel\n \n -\tDocumentation of maintenance activity\n \n 9. Hot Work Permit.  GP/Port Hudson has established a hot work permit program to control spark or flame- producing activities that could result in fires or explosions in covered processes at the facility. The facility reviewed OSHA's fire prevention and protection requirements in 29 CFR 1910.252(a) and created a Hot Work Permit form to comply with these requirements. Personnel who are to perform hot work are required to fill out the Hot Work Permit form. The supervisor reviews the completed form before work can begin.\n \n 10. Management of Change.  The GP/Port Hudson management of change program evaluates and approves all proposed changes to chemicals, equipment, and procedures for a covered process to help ensure that the change does not negatively affect safe operations. Process changes that are determ"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 12451,
      "SummaryText": "Chlorine dioxide is produced in the chlorine dioxide generator and piped to an absorber column, where as high as 14.0-gram-per-liter (1.14 wt.%) strength in solution is absorbed.\n \n 1.5\tFive-Year Accident History\n \n Chlorine Dioxide\n \n There has been no accidental releases of chlorine dioxide that have had an off-site impact, nor an accidental release that resulted in an injury to personnel or damage to equipment at the facility.\n \n \n 1.6\tEmergency Response Programs\n \n Georgia-Pacific Port Hudson Operations has established a written emergency response program to help safely respond to accidental releases of hazardous substances. The emergency response plan includes procedures for:\n \n -Informing the local response organizations and the public about accidental releases that could reasonably result in off-site consequences\n \n -Providing proper first aid and emergency medical treatment to treat accidental human exposure to hazardous substances at the facility\n \n -Controlling and containing accidental releases of hazardous substances, including the use of emergency response equipment\n \n -Inspecting and maintaining emergency response equipment\n \n -Reviewing and updating the emergency response plan\n \n The facility maintains an emergency response team trained in the emergency response procedures. All the facility personnel are trained in evacuation procedures. The facility periodically conducts emergency response drills, and will include an annual drill coordinated with the local fire department.\n \n The written emergency response plan complies with other federal contingency plan regulations and will be communicated to local emergency response officials through the Local Emergency Planning Committee. The facility maintains a regular dialogue with the local emergency response organizations and provides appropriate information to them."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12451,
      "SummaryText": "or the environment. GP/Port Hudson provides response training for upset conditions to facility personnel, designates an emergency response coordinator to oversee response activities, and coordinates response efforts with the local emergency response organizations.\n\nIn order to effectively implement the policies, the facility has established a management system directed by the Vice President, Port Hudson Operations.\n\n\n1.2\tGeorgia-Pacific Port Hudson Operations and Our Regulated Substances\n\nGeorgia-Pacific Port Hudson Operations is a pulp and paper facility primarily involved in the manufacture of bleached paper products. As part of this manufacturing process, the facility produces and stores chlorine dioxide (C102) for use in the bleaching process. The Chlorine Dioxide Solution System, which includes the generation, storage and distribution of chlorine dioxide, is considered an RMP covered process in Program Level 3. \n\n\n1.3\tOff-Site Consequence Analysis\n\nGP/Port Hudson performed an off-site consequence analysis to estimate the potential for an accidental release of the regulated substance to affect the public or the environment. The off-site consequence analysis consists of evaluating both the worst-case release scenario and an alternative release case scenario. The facility does not expect a worst-case release scenario to ever occur. An alternative release scenario represents a release that (1) might occur at a facility like GP/Port Hudson and (2) would result in an off-site consequence if the release occurred. The alternative release scenario will help the Local Emergency Planning Committee improve the community emergency response plan.\n\nThe main objective of performing the off-site consequence analysis is to determine the distance at which certain effects might occur to the public because of an accidental release (called the end-point distance). The following effects could occur at the endpoint distance. At distances less than the endpoint distance, the effects co"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12451,
      "SummaryText": "uld be greater; at distances greater than the endpoint distance, the effects could be less.\n\nWhen considering the release of a toxic substance such as chlorine dioxide, most people at the endpoint distance would be able to walk away from the exposure without any long-term health consequences, although some short-term consequences (e.g., strong eye or throat irritation) are likely.\n\nThe RMP Rule includes specific requirements for the worst-case and alternative release scenarios that must be reported by Georgia-Pacific Port Hudson Operations. These requirements include:\n\nn one worst-case release scenario for a toxic substance in Program Level 3 (one scenario representing chlorine dioxide)\nn one alternative release scenario for each toxic substance in Program Level 3 processes (one scenario representing chlorine dioxide)\n \n The following information summarizes the off-site consequence analysis performed by Georgia-Pacific Port Hudson Operations.\n \n \n 1.3.1 Program Level 3 Process- Chlorine Dioxide (C102) Solution System\n \n The worst-case release scenario for the chlorine dioxide solution system is the rupture of a single storage vessel that has a 317,000-gallon capacity. The RMP Rule mandates that for the worst-case scenario, the analysis assumes loss of the contents of the largest storage vessel in ten minutes. The released chlorine dioxide would evaporate to form a vapor cloud. The maximum distance to the toxic endpoint concentration, based on the EPA Lookup Table approach, is greater than 25 miles. The United States Census (Landview III) indicates that approximately 360,000 people live within this distance from the vessel. Several public receptors (e.g. public and private schools, colleges, industrial parks, hospitals, recreational parks, etc are also located within this distance). There are also several environmental receptors.\n \n The alternative release scenario for chlorine dioxide is the rupture of a chlorine dioxide solution line located at the discharge side o"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12451,
      "SummaryText": "f the C1O2 transfer pumps' header. During normal operations, two pumps are in operation. The pumps could pump approximately 1,700 gallons per minute for five minutes before the release might be recognized and isolated. The released chlorine dioxide solution will form a pool of minimum depth (1 centimeter) and evaporate to form a vapor cloud. The maximum distance to the toxic endpoint concentration, based on the EPA Lookup Table approach, is 3.8 miles. The United States Census (Landview III) indicates that approximately 2,400 people live within this distance. Several public receptors (e.g. Port Hudson Head Start School, Port Hudson National Cemetery, Mount Zion Church, etc.) are also located within this distance.  There are also several environmental receptors located within this distance.\n \n \n 1.4 Accidental Release Prevention Program\n \n Georgia-Pacific Port Hudson Operations has always used a prevention program to help prevent accidental releases of hazardous substances. Beginning in 1992, the facility formalized this prevention program for the Chlorine Dioxide Solution System to comply with the 14 elements of the Occupational Safety and Health Administration's (OSHA's) Process Safety Management (PSM) prevention program. In 1996, the EPA RMP Rule established that a Program Level 3 Prevention Program would become a requirement for these processes as well. The facility's Program Level 3 Prevention Program under the RMP Rule is essentially the same as the OSHA PSM Program, except that the program also focuses on protecting the public and the environment.\n \n \n 1.4.1 The following sections briefly describe the elements of the Georgia-Pacific Port Hudson Operations Program Level 3 Prevention Program that address the EPA RMP Rule prevention program requirements for the Chlorine Dioxide Solution System.\n \n 1. Employee Participation The facility has developed a written employee participation program for the covered processes to help ensure that the safety concerns of GP/Por"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 12451,
      "SummaryText": "t Hudson employees are addressed. The facility encourages active participation from personnel in the development and maintenance of the prevention program activities for all processes at the facility. Employees are consulted on, and informed about, all aspects of the RMP Rule prevention program, including the development of Process Hazard Analysis and Operating Procedures.\n \n 2. Process Safety Information The facility maintains a variety of technical documents that are used to help ensure the safe operation of the process. The documents address, (1) the hazards of the chemicals used in the process, (2) the technology of the process, and (3) the design basis and configuration of the equipment used in the process. The facility ensures that this process safety information is maintained, accurate, and available to all GP/Port Hudson employees and the Local Emergency Planning Committee (LEPC). All of the information and documentation for the RMP Prevention Program is maintained at the facility.\n \n Material safety data sheets (MSDS) document the physical and chemical properties of the hazardous substances handled at the facility, including non-regulated substances in the covered process. MSDS's for hazardous substances handled in each process are available in the control rooms so the operators have ready reference to this information. In addition, MSDS's are provided to the LEPC and/or Plant Emergency Response Teams for use in helping formulate emergency response plans\n \n Many of the operating parameters are included in the process technology information to help with the safe operation of the process. These documents are also used, (1) to train employees, (2) to perform process hazard analysis, and (3) to help maintain the equipment to the design specification.\n \n 3. Process Hazard Analysis.  GP/Port Hudson performs and periodically updates process hazard analyses (PHAs) of the covered processes to help identify process hazards and generate recommendations that might impr"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 12451,
      "SummaryText": "ove the safe operation of the process. A team composed of personnel with engineering and process operating experience and a team leader with experience in performing process hazard analyses is assembled to analyze the process. The facility primarily uses the Hazard and Operability (HAZOP) and/or What If' technique, supplemented with a checklist, to perform this analysis. The PHA team prepares a written report describing the results of the analysis, including recommendations. Responsibility for resolving the recommendations is assigned to personnel and, when appropriate, changes to enhance the safety of the process are implemented.\n \n 4. Operating Procedures. GP/Port Hudson operators, supervisors, and engineers work together to develop and maintain accurate operating procedures to define how tasks related to process operations should be safely performed. The operating procedures are, (1) used to train employees and (2) serve as reference guides for appropriate actions to take during both normal operations and upset operating conditions. The operating procedures include:\n \n -\tSteps for safely conducting activities\n \n -\tApplicable process safety information, such as safe operating limits and consequences of process deviations\n \n -\tSafety and health considerations, such as chemical hazards, personal protective equipment requirements, and actions to take if exposure to a hazardous substance occurs\n \n The facility personnel develop and maintain operating procedures that cover all phases of the operations, including initial start-up, normal operations, normal shutdown, emergency shutdown, start-up following a standby condition or emergency shutdown, and temporary operations. The facility reviews and certifies the operating procedures annually.\n \n 5. Training. GP/Port Hudson trains employees to safely and effectively perform their assigned tasks. The facility training program for process operators includes both the initial training and refresher training that covers, (1"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 12451,
      "SummaryText": ") a general overview of the process, (2) the properties and hazards of the substance in the process, and (3) a detailed review of the process operating procedures and safe work practices. Written tests and oral reviews are used to verify that the employee understands the training materials before the employee can operate the process.\n \n The operators are consulted annually about the frequency of the training and the materials to be used for the training. Recommendations from the operators are reviewed and changes to the training are implemented as appropriate.\n \n 6. Contractors.  GP/Port Hudson has established a program to help ensure that contractor activities at the facility are performed in a safe manner. The program reviews the safety record of all contractors to help ensure that the facility only hires contractors who can safely perform the designated job tasks. GP/Port Hudson explains to the contract supervisors the hazards of the process on which they and their employees will work, the facility safe work practices, and the emergency response procedures for the facility. The facility requires that the contract supervisors train each of their employees who will work on or near a covered process before that employee begins work at the site. The facility periodically reviews contractors' training documents and work performance to ensure that safe practices are followed.\n \n 7. Pre-startup Safety Reviews.  GP/Port Hudson performs a safety review of new or modified equipment in the covered process before the process is placed into service to help ensure that the process has been prepared to operate safely. This review confirms that:\n \n -\tConstruction and equipment are in accordance with design specifications\n \n -\tAdequate safety, operating, maintenance, and emergency procedures are in place\n \n -\tEmployee training has been completed\n \n -\tFor a covered process, a PHA has been performed if the process is new or management of change requirements has been completed if an"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 12451,
      "SummaryText": "2617 LDEQ Facility ID Number\nGeorgia-Pacific Port Hudson Operations (GP/Port Hudson) is committed to operating in a manner that is safe for GP/Port Hudson workers, the public, and the environment. As part of this commitment, the Company has established a system to help ensure safe operation of the hazardous chemical processes at this facility. One component of this system is a Risk Management Program (RMP) that helps manage the risks at the facility and addresses compliance with the requirements of the Environmental Protection Agency's (EPA's) Regulation 40 CFR 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP Rule). One of the requirements of the RMP Rule is to submit a Risk Management Plan (RMPlan) describing the Risk Management Program at Georgia-Pacific in Port Hudson. This document is intended to satisfy the RMPlan requirements of the RMP Rule and to provide the public with a description of the Risk Management Program at the facility.\n\nThe Risk Management Program at the facility consists of three elements:\n\n1. a hazard assessment to help understand (a) the potential off-site consequences of hypothetical accidental releases and (b) accidents that may have occurred during the last five years associated with the use of the substances regulated by the RMP Rule (chlorine dioxide) - see topic 1.3\n \n2. a prevention program to help maintain and safely operate the processes containing more than the threshold quantity of the regulated substances (covered processes) - see topic 1.4\n \n3. an emergency response program to help respond to accidental releases of the regulated substances from the covered processes - see topic 1.6\n\nInformation further describing these elements is provided in this RMPlan.\n\nAlthough the Risk Management Program at the facility helps provide assurance that the facility is maintained and operated in a safe manner, it is only one component of the safety program at GP/Port Hudson. In fact, the facility has a comprehensiv"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12451,
      "SummaryText": "e safety program in place establishing many levels of safeguards that are designed to minimize the potential for the release of any hazardous substance and injuries and damage resulting from the release of a hazardous substance.\n\nGP/Port Hudson minimizes the potential releases of the hazardous substances used at the facility. When hazardous substances are used at the facility, the equipment is carefully designed, built, and operated to reduce the likelihood of an accidental release. Industry and government standards are closely adhered to in design, construction, and operation of the equipment.\n\nGP/Port Hudson limits damage from a release, if such a release occurs. The facility trains workers to respond to upset conditions, reducing the consequences of a release if it occurs. In addition, the facility will be working with the Local Emergency Planning Commission (LEPC) to help ensure that injuries and/or environmental damage will not occur in the event that a release does occur.\n\nThe safety program at GP/Port Hudson consists of a number of elements, only some of which are required by the RMP Rule. This RMPlan is primarily intended to describe those parts of the safety program at the facility that are required by the RMP Rule.\n\n\n1.1\tAccidental Release Prevention and Emergency Response Policies\n\nGP/Port Hudson is committed to the safety of workers and the public, as well as the preservation of the environment through the prevention of accidental releases of hazardous substances. The facility implements reasonable controls to prevent foreseeable releases of the hazardous substances. These controls include training programs for personnel; programs to help ensure safety in the design, installation, operation, and maintenance of the processes; and programs to evaluate the hazards at the facility.\n\nIn the event of an accidental release, the facility will control and contain the release in a manner that will be safe for workers and will help prevent injury to the public and/"
    }
  ]
}