{
  "FacilityID": 12512,
  "FacilityName": "Little Cedar Bayou Wastewater Plant No. 1",
  "FacilityStr1": "1301 S. 4th Street",
  "FacilityStr2": null,
  "FacilityCity": "La Porte",
  "FacilityState": "TX",
  "FacilityZipCode": "77572",
  "Facility4DigitZipExt": "1115",
  "FacilityCountyFIPS": "48201",
  "LEPC": null,
  "FacilityLatDecDegs": "29.648861",
  "FacilityLongDecDegs": "-95.022889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of La Porte, Texas",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of La Porte, Texas",
  "OperatorStr1": "P.O. Box 1115",
  "OperatorStr2": null,
  "OperatorCity": "La Porte",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77572",
  "OperatorZipCodeExt": "1115",
  "RMPContact": "Curtis Herrod",
  "RMPTitle": "Utility Superintendent",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000136319",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 29.64886,
  "FRS_Long": -95.02289,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16732,
      "AltID": null,
      "FacilityID": 12512,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 17150,
          "ProcessID": 16732,
          "NAICSCode": "56221",
          "_desc": {
            "NAICS_CODE": "56221",
            "NAICS_DESCRIPTION": "Waste Treatment and Disposal"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 20854,
          "ProcessID": 16732,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 520854,
          "ProcessID": 16732,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12512,
      "SummaryText": "LITTLE CEDAR BAYOU WASTEWATER TREATMENT PLANT NO. 1\nRISK MANAGEMENT PLAN\nEXECUTIVE SUMMARY\n\n\nThe City of La Porte operates the Little Cedar Bayou Wastewater Treatment Plant No. 1 located at 1301 S. 4th Street in La Porte.  In the processes of this plant, only one (1)-regulated substance is utilized in quantities above the threshold amount.  This substance, chlorine liquefied under pressure, is used as a disinfectant to treat the treatment plant effluent prior to discharge to Little Cedar Bayou and thence to Galveston Bay.  This process assures the safety and water quality of the receiving stream and the general public.  Chlorine is contained in one ton cylinders of which two (2) are fed in tandem through a chlorinator mechanism and into the plant effluent.  Two cylinders are always on line to actively feed and four (4) cylinders are in inventory to ensure constant availability of chlorine as required by State and Federal regulations.  The total maximum amount of chlorine on hand is 12,000 pounds.\n\nFor purposes of this plan, a Worst Case Scenario was examined where the total content of one cylinder of chlorine was released into the atmosphere by catastrophic failure of the cylinder.  This release was over duration of 10 minutes with a total chemical release of 2,000 pounds.  This type of release would affect an area of 1.3 miles radius of the plant site with approximately 2,600 citizens being affected.\n\nA more realistic scenario was examined where a line leak occurred where a release of 630 pounds of chemical was released over a 60-minute duration.  This type of leak would affect an area of approximately 0.1 miles radius of the plant.  There are no permanent residents within this area.  No citizens would be affected by this size release.\n\nWithin the past five (5) years there has been no release of chlorine gas beyond the immediate vicinity of the chlorine building.  No chlorine gas has escaped the perimeters of the plant site.\n\nAll plant personnel are trained, both c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12512,
      "SummaryText": "lassroom and on-the-job, in the proper methods of handling chlorine both as a gas and as a liquid.  The equipment is regularly checked for operation within the required tolerances and is routinely changed as it nears the minimum operating levels.  There are written operations and maintenance manuals describing the step-by-step procedures on maintenance and replacement of chlorine cylinders.  A hazard review has been performed attempting to determine the consequences of both man-made and natural conditions that could cause a release of chlorine into the atmosphere and determining the proper response for each condition.\n\nPlant personnel have written guidelines and procedures of required actions should a leak occur.  These include notification of the La Porte Fire Department's Emergency Response Team along with requesting assistance of our local chlorine vendor.  The public would be notified, if required, through the activation of the City of La Porte's Whelan System of audible alarms and/or the FirstCall system which can be programmed to call all telephones within the affected area of the release.  In addition, there is an AM 830 radio station which broadcasts information to the public in emergency situations and a paging system to notify all City employees and all School District employees of the emergency.  Plant and response personnel perform annual drills through the La Porte Emergency Operations Center which test the adequacy and the knowledge of response procedures.  Any deficiencies found to exist from these drills are addressed and necessary changes made.\n\nThis facility has been located at this site for over thirty years without any major releases of chlorine occurring.  The City of La Porte is dedicated to the continued safe and proper operation of the plant to ensure the safety of the entire general public.  \n\n\n"
    }
  ]
}