{
  "FacilityID": 12570,
  "FacilityName": "Andpak Inc.",
  "FacilityStr1": "400 Jarvis Dr",
  "FacilityStr2": null,
  "FacilityCity": "Morgan Hill",
  "FacilityState": "CA",
  "FacilityZipCode": "95037",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06085",
  "LEPC": null,
  "FacilityLatDecDegs": "37.147389",
  "FacilityLongDecDegs": "-121.656222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 88769401,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Richard Varien",
  "OperatorStr1": "400 Jarvis Dr",
  "OperatorStr2": null,
  "OperatorCity": "Morgan Hill",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95037",
  "OperatorZipCodeExt": null,
  "RMPContact": "Layne Stangeland",
  "RMPTitle": "Environmental Health and Sfty Coord",
  "FTE": 65,
  "OtherEPAFacilityID": "CAR 000 050 989",
  "EPAFacilityID": "100000132233",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-06-29 00:00:00",
  "DeRegistrationEffectiveDate": "2005-06-20 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 37.14687,
  "FRS_Long": -121.65801,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Never actually used the regulated substances, as anticipated.",
  "_processes": [
    {
      "ProcessID": 16797,
      "AltID": null,
      "FacilityID": 12570,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 17215,
          "ProcessID": 16797,
          "NAICSCode": "99999",
          "_desc": {
            "NAICS_CODE": "99999",
            "NAICS_DESCRIPTION": "Unclassified Establishment"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 20945,
          "ProcessID": 16797,
          "ChemicalID": 111,
          "Quantity": 25000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 111,
            "ChemicalName": "Difluoroethane  [Ethane, 1,1-difluoro-]",
            "CASNumber": "75-37-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 20946,
          "ProcessID": 16797,
          "ChemicalID": 130,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 130,
            "ChemicalName": "Methyl ether  [Methane, oxybis-]",
            "CASNumber": "115-10-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 520945,
          "ProcessID": 16797,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 520946,
          "ProcessID": 16797,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12570,
      "SummaryText": "Andpak Inc.\n400 Jarvis Drive\nMorgan Hill, CA 95037\n\nExecutive Summary\n\nThe accidental release prevention and emergency response policies at Andpak Inc.\n\nAndpak Inc. shall take all reasonable precautions in the workplace to protect the safety and health of all employees and members of the public, and shall comply with all applicable safety and health and environmental regulation and requirement. \n\nThe environmental and safety policy of Andpak Inc. is to take every reasonable precaution in the performance of our work to protect the health and safety of all employees and the public, the environment and also to prevent property damage with respect to the handling and using of hazardous material.\n\nThis protection is provided by limiting exposure of people, releases to the environment, and contamination of property to the level that are as low as reasonably achievable.\n\nReasonably achievable takes into consideration programmatic requirements and economic limitations, and extends beyond simple compliance with basic regulation. Our policy is achievable by integrating management involvement, education and training of employees, facility design, sound safety procedures, consistent work place monitoring, environmental monitoring, emergency preparedness, and program evaluation.\n\nBefore responding to any emergency situation steps should be taken to search out and review all existing emergency plans.  The main reason for reviewing these plans are:\n\n7 To minimize work efforts by building upon or modifying existing emergency planning and response information\n \n7 To ensure proper coordination\n\nWhen reviewing the existing plans, all team members should have a copy of the Emergency Response Plan.  The emergency response guidelines should be followed by the Emergency Coordinator and the Emergency Response Team members at all times in the following order of priority:\n\n1. Ensure human health and safety\n \n2. Protect wildlife, and livestock\n \n3. Protect public and private property\n \n4. P"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12570,
      "SummaryText": "reserve and protect company property\n\nAndpak Inc. Facility and the regulated substances handled \nAndpak Inc. is located at 400 Jarvis Dr. Morgan Hill, CA 95037. This facility is a new construction located in a light industrial park.\n\nFacility Size:63,768 square feet\n\n7 Office Area:\n7 Area A: Aerosol  Storage\n7 Area  B: Flammable Liquids\n7 Area C: Hazardous Material Storage (H-3)/( H-7)\n7 Area D/E: Aerosol Production/Chemical Packaging Blending Area\n7 Area F: Production Room\n7 AreaG: Corrosives\n7 Area K-1:\n7 Area K-2: Tank Storage\n7 Area K-3: Tank Storage\n7 Area K-4: Cyllinder Storage\n7 Area K-6: Emergency Generator\n7 Area L-1: Production\n7 Area L-2: Research and Development\n7 Area L-3: Production\n7 Area L-4: Machine Shop\n7 Area L-5: Warehouse Storage\n7 Hazardous Material Loading and Unloading Area\n\nAndpak Inc. is a chemical repackaging company. Our process is simple and includes two regulated substances, Difluorethane and Methyl Ether. Difluorethane is at a maximum of  25,000 pounds and Methyl Ether is at a maximum of 28,000 pounds. These chemicals are stored in separate but proximate tanks and each is routed through pipes to be repackaged into small aerosol containers.\n\n*Note: The quantities listed above are predictive. At this time both Difluoroethane and Methyl Ether are kept below threshold at 9,500 pounds.\n\nThe worst-case release scenario(s) and the alternative release scenario(s)\n\nOur worst case release scenario would be a vapor cloud explosion. Our maximum quantity released would be 28,000 pounds of flammable gas reaching an estimated endpoint to 1 psi overpressure of  0.2 miles. The offsite impact would include surrounding industrial businesses as well as a shopping center.\n\nThis information was determined using RMP COMP.\n\nThough the tanks are 30,000 pound capacity, administrative controls  including written operating procedures are used to keep the levels at the above stated limits.\n\nOur alternative release scenarion is a vapor cloud fire causing a release "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12570,
      "SummaryText": "of 191 lbs. per minute. The endpoint would be less than .1 miles. It is highly unlikely with our mitigation systems and procedure practice that any release would reach an off-site endpoint.\n\nThe general accidental release prevention program and chemical-specific prevention steps\nAndpak Inc. complies with OSHA PSM rule, OSHA Hazard Communication Program, Accident and Illness Prevention Plan, SARA 313, Emergency Response Plan, Storm Water Prevention Plan.\n\nWe practice regular training and inspection schedules as well as equipment testing and written operating procedures to prevent the occurrence of accidental relaeases. \n\nHazardous Material And Waste Handling Procedures\n\nSpecific plans have been developed for the safe and efficient handling of hazardous materials and/or waste. These plans include the spill emergency practices and the responsibility and procedures. In addition, the manufacturing areas in the plant have plans relating to specific situations. These plans identify all hazardous materials used and/or hazardous waste generated in each respective area, and the proper method of disposal and/or containment in case of a spill. The effective implementation of these above mentioned procedures should avoid a large scale emergency situation.\n\nHazardous Waste Storage Area\n\nAll hazardous wastes are stored in 55 gallon drums, in a properly designated hazardous waste storage area, located in the southeast corner of the building, until permanent disposal is arranged.\n\nMaterial Separation\n   \nAll hazardous materials within the building are segregated in accordance to federal state, and local regulation guidelines.\n\nAll hazardous wastes are segregated properly and employees which are trained to work with hazardous waste work in this area.\nInspection and Monitoring Program\n\nGood manufacturing practices are employed to protect the company from the loss of valuable raw material and the risk of generating unnecessary waste. The areas with the highest potential for spill are t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12570,
      "SummaryText": "hose where people are actively working and would observe a problem immediately.\n\nThe Environmental and Safety Coordinator conducts visual inspections daily to check for leaks in drums, pipes, valves, manufacturing equipment, etc. In addition, all managers check that all materials are stored and handled in an appropriate manner.\n\nAlso the Environmental And Safety Coordinator conducts a thorough inspection every week. Included in the inspection is a check for unsafe conditions, unsafe handling techniques, storage problems, etc. All items noted during this inspection are documented on the inspection log.\n\nHousekeeping\n\nThe importance of housekeeping as a safety measure is very important. At least monthly inspection is performed by the safety committee members. Feedback to the appropriate employees is used to involve all employees with the importance of good housekeeping practices.\n\nNeat and orderly storage of chemicals, regular garbage pickup and disposal, maintenance of clean dry floors, proper spacing for pathways between containers, and stimulation of employee interest are a few examples of routine housekeeping practices.\n\nSecurity And Alarm System\n\nEntrance to the plant is restricted to employees and authorized personnel only. All others must be accompanied by an employee while in the plant.\n\nAfter hours all doors and entrances are locked.\n\nIn the plant in the H occupancy area the overall alarm system is tied into all pull boxes. The system alarms at the central monitoring station. The facility fire alarm sends an automatic signal to the central monitoring station and the central station will notify the fire department and the facility emergency coordinators.\n\nThere are local emergency evacuation alarms which are designed to notify employees in certain designated areas if evacuation is required at the time of a chemical spill. These alarms are activated manually and are located at each storage room.\n\nThe five-year accident history\nWe have not had any accidental rel"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12570,
      "SummaryText": "eases in the last five years.\n\nThe emergency response program\nFollowing are some elements of our Emergency Response Program which may be applicable.\n\nFire And Explosion Procedures\nAll employees should be familiar with the proper handling, storing, and disposing procedures of the chemicals they are working with.  They should also know the compatibility, fire hazard (including use of fire extinguisher), and equipment used to handle these materials.\n\nexplosion\nExplosion may occur either with gases and vapors or with dusts when handling hazardous materials, either of these two conditions could be expected.  Most spill prevention and control procedures are designed around the fact that keeping the material above or below the flammable range would be sufficient to preclude fire or explosion.\n\nfire\nFires are also classified by the type of material in which they occur.  The following are the four classes of fires.  A Fires occur in ordinary combustible materials.  B Fires occur in flammable liquids, vapors, or gases.  C Fires occur either as an underlying 'A' or 'B' fire with the exception that it is in, or possibly could be in, energized equipment.  D Fires are those which occur in the combustible metals such as magnesium, sodium potassium, and aluminum.\n\ngases\nAll compressed gases are kept in controlled areas. In short, the primary hazards associated with handling compressed gases during spill incidents are very high.  As soon as a spill is detected,  immediate evacuation of all employees is required.  The flammable mixing and dipping room is equipped with ventilation system sufficient to reduce flammable vapor evaporated from the worst-case to less than 20% of the LEL. The following safeguards are also in place; Flammable Vapor Detection, Interlock Control, Automatic Shut Down, Rated Electrical System, and Full Emergency Back-Up Power.\n\nIn Case Of Fire Or Explosion Or Gas Leak:\n\n1. The Emergency Coordinator should check for injured people. If there is an injured "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 12570,
      "SummaryText": "person, remove victim from any immediate danger and call 911 for assistance, giving them the name, address, and directions to the facility.  Be sure to tell them that there is, or potentially is, the hazard of chemical fire.  If the phone is not working, send personnel to neighboring building to call for help.\n \n2. Institute the evacuation plans by following the evacuation procedure.\n \n3. Post someone at entrances to the facility to direct emergency vehicles.\n\n4. Notify the neighboring companies immediately if necessary.\n \n5. Institute shut down procedures for chemical processes, the gas and water main, and the electricity, as necessary.\n \n6. Follow the general emergency guidelines and reporting requirements.  Also, the Emergency Coordinator will direct employees to wait to be given an \"all clear\" signal before reentering the building after evacuation.\nEvacuation Plan:\n\na.  The following alarm signal(s) will be used to begin evacuation of the facility (check all which apply):\n\n1 Bells;  1 Horns/Sirens;  1 Verbal (i.e. shouting);  0 Other (specify)      \n\nb. 1 Evacuation map is prominently displayed throughout the facility.\n\nEmergency Contacts:\n    \nFire/Police/Ambulance  . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Phone No. 911\n\nState Office of Emergency Services     . .  . . . . . . . . . . . . . . . . . . . . . . . .Phone No. (800) 852-7550\n\nPost-Incident Contacts*:\n    \nFire Department Hazardous Materials Program     . . . . . . . . . . . Phone No.: (408) 378-4010\n\nSanta Clara County Hazardous Materials Compliance Division. . . . .    Phone No. (408) 299-6930\n\nCalifornia EPA Department of Toxic Substances Control . . . . . . .    Phone No. (510) 540-3739\n\nCal-OSHA Division of Occupational Safety and Health . . . . . . .    Phone No. (415) 557-1677\n\nBay Area Air Quality Management District. . . . . . . . . . . . . .     Phone No. (415) 771-6000\n\nRegional Water Quality Control Board, Central Coast Region. . . . . . . . . . . . . . . .. . .     Ph"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 12570,
      "SummaryText": "one No. (805510) 549-3147286-1255\n  \nEmergency Resources:\nPoison Control Center . . . . . . . . . . . . . . . . . . . . . .  . . . . . . . . . . . . .Phone No. (800) 876-4766\n\nNearest Hospital:    Name:  Saint Louise Hospital Phone No.: (408) 779-1500\nAddress:  18500 St. Louise Drive City: Morgan Hill\n\nContacting Spill Response Contractor\n\nShould the spill be beyond the Emergency Response Team's capability, the following company should be contacted:\n\nEcology Control Industries\n2055 Junction Ave. \nSan Jose, CA 95131\nPhone: 408-894-1200  Fax:  408-894-0701\n\n\nEmergency Procedures:\n\nEmergency Coordinator Responsibilities:\n\na.Whenever there is an imminent or actual emergency situation such as a explosion, fire, or release, the emergency coordinator (or his/her designee when the emergency coordinator is on call) shall:\n\ni.Identify the character, exact source, amount, and areal extent of any released hazardous materials.\n\nii.Assess possible hazards to human health or the environment that may result from the explosion, fire, or release.  This assessment must consider both direct and indirect effects (e.g. the effects of any toxic, irritating, or asphyxiating gases that are generated, the effects of any hazardous surface water run-off from water or chemical agents used to control fire, etc.).\n\niii.Activate internal facility alarms or communications systems, where applicable, to notify all facility personnel.\n\niv.Notify appropriate local authorities (i.e. call 911).\n\nv.Notify the State Office of Emergency Services at 1-800-852-7550.\n\nvi.Monitor for leaks, pressure build-up, gas generation, or ruptures in valves, pipes, or other equipment shut down in response to the incident.\n\nvii.Take all reasonable measures necessary to ensure that fires, explosions, and releases do not occur, recur, or spread to other hazardous materials at the facility.\n\nb.Before facility operations are resumed in areas of the facility affected by the incident, the emergency coordinator shall:\n\ni.Provide for"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 12570,
      "SummaryText": " proper storage and disposal of recovered waste, contaminated soil or surface water, or any other material that results from a explosion, fire, or release at the facility.\n\nii.Ensure that no material that is incompatible with the released material is transferred, stored, or disposed of in areas of the facility affected by the incident until cleanup procedures are completed.\n\niii.Ensure that all emergency equipment is cleaned, fit for its intended use, and available for use.\n\niv.Notify the California Environmental Protection Agencys Department of Toxic Substances Control,  the County of Santa Claras Hazardous Materials Compliance Division, and the local fire departments hazardous materials program that the facility is in compliance with requirements b-i and b-ii, above.\n\nPost-Incident Reporting/Recording:\n\nThe time, date, and details of any hazardous materials incident that requires implementation of this plan shall be noted in the facilitys operating record.\n\nWithin 15 days of any hazardous materials emergency incident or threatened hazardous materials emergency incident which triggers implementation of this plan, a written Emergency Incident Report, including, but not limited to a description of the incident and the facilitys response to the incident, must be submitted to the California Environmental Protection Agencys Department of Toxic Substances Control,  the County of Santa Claras Hazardous Materials Compliance Division, and the local fire departments hazardous materials program.  The report shall include:\n \n1. Name, address, and telephone number of the facilitys owner/operator;\n2. Name, address, and telephone number of the facility;\n3. Date, time, and type of incident (e.g. fire, explosion, etc.);\n4. Name and quantity of material(s) involved;\n5. The extent of injuries, if any;\n6. An assessment of actual or potential hazards to human health or the environment, where this is applicable;\n7. Estimated quantity and disposition of recovered material that r"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 12570,
      "SummaryText": "esulted from the incident;\n8. Cause(es) of the incident;\n9. Actions taken in response to the incident; \n10. Administrative or engineering controls designed to prevent such incidents in the future.\n\nEmployee Training Plan \n\nPersonnel are trained in the following procedures:\nInternal alarm/notification *\nEvacuation/re-entry procedures & assembly point locations*\nEmergency incident reporting\nExternal emergency response organization notification\nLocation(s) and contents of Emergency Response/Contingency Plan\nFacility evacuation drills, which are conducted at least Annually.  \n\n\nChemical Handlers are additionally trained in the following:\n\nSafe methods for handling and storage of hazardous materials\nLocation(s) and proper use of fire and spill control equipment\nSpill procedures/emergency procedures\nProper use of personal protective equipment \nSpecific hazard(s) of each chemical to which they may be exposed, including routes of exposure (i.e. inhalation, ingestion, absorption) \nHazardous Waste Handlers/Managers are trained in all aspects of hazardous waste management specific to their job duties (e.g. container accumulation time requirements, labeling requirements, storage area inspection requirements, manifesting requirements, etc.) \n\n\n3.  Emergency Response Team Members are capable of and engaged in the following:\n\nPersonnel rescue procedures\nShutdown of operations\nLiaison with responding agencies\nUse, maintenance, and replacement of emergency response equipment\nRefresher training, which is provided at least annually\nEmergency response drills, which are conducted at least Annually. \n\nPlanned changes to improve safety\nWe are now in the process of moving into a new building. As part of this process we are inspecting and testing all equipment. In the construction of this building we took great consideration of hazardous material storage and segregation.\n\nWe will be doing our Hazardous Material Management Training in July, Process Safety Training in August, and Emergency Re"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 12570,
      "SummaryText": "sponse Training in SeptemberWe will also run an initial building evacuation drill after training\n\nThe facility and all the process areas are built to the current building and fire code and were inspected and approved by the City Planning Department and also by the Fire Department."
    }
  ]
}