{
  "FacilityID": 12585,
  "FacilityName": "Bear Mountain Limited",
  "FacilityStr1": "7001 Camino Grande Drive",
  "FacilityStr2": null,
  "FacilityCity": "Bakersfield",
  "FacilityState": "CA",
  "FacilityZipCode": "93306",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.419167",
  "FacilityLongDecDegs": "-118.926333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 804405074,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Bear Mountain Limited",
  "OperatorStr1": "34759 Lencioni Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93308",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": "CAL000141376",
  "EPAFacilityID": "100000133786",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "S-2049-1-1",
  "SafetyInspectionDate": "1996-09-23 00:00:00",
  "SafetyInspectionBy": "Ammonia Vendor (Unocal)",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2003-06-26 00:00:00",
  "DeRegistrationEffectiveDate": "2003-04-21 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.41975,
  "FRS_Long": -118.92569,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16825,
      "AltID": "Ammonia Process",
      "FacilityID": 12585,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 20982,
          "ProcessID": 16825,
          "ChemicalID": 56,
          "Quantity": 14000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 17248,
          "ProcessID": 16825,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8830,
              "Process_NAICS_ID": 17248,
              "SafetyReviewDate": "1998-05-31 00:00:00",
              "PHA_Date": "1998-04-27 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-04-27 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Sparge system, dump system, and secondary containment",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-05-31 00:00:00",
              "TrainingReviewDate": "1998-05-31 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-05-31 00:00:00",
              "EquipmentInspectionDate": "1999-03-03 00:00:00",
              "EquipmentTested": "Ammonia storage tank, piping, and transfer lines",
              "ChangeMgmtDate": "1997-08-21 00:00:00",
              "ChangeMgmtReviewDate": "1998-05-31 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1998-06-26 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1995-04-04 00:00:00",
              "InvestigationChangeDate": "1995-10-04 00:00:00",
              "ParticipationPlansReviewDate": "1998-05-31 00:00:00",
              "HotWorkPermitReviewDate": "1998-05-31 00:00:00",
              "ContractorSafetyReviewDate": "1999-01-19 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-31 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 12096,
                  "PreventionProgram3ID": 8830,
                  "ProcessChemicalID": 20982
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12585,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-06-16 00:00:00",
    "ERTrainingDate": "1999-04-27 00:00:00",
    "CoordinatingAgencyName": "City of Bakersfield Fire Department",
    "CoordinatingAgencyPhone": "6613263979",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12585,
      "SummaryText": "1.0 Introduction\n\nA Risk Management Program (RMP) has been implemented at Bear Mountain Limited to reduce accidental releases of hazardous materials. The Risk Management Plan summarizes the management, administrative, procedural, and technological controls that work together to minimize the risk to the community of hazardous chemical releases. The Risk Management Plan is organized to correspond with specific U.S. Environmental Protection Agency (U.S. EPA) RMP definitions and requirements, including:\n\n-Introduction;\n-Policies to protect health, environment, and safety;\n-Facility identification and regulated substances covered processes;\n-Hazard assessment;\n-Prevention program;\n-Five-year accident history;\n-Emergency response plan; and\n-Planned changes to improve safety.\n\n2.0 Bear Mountain Limited Policies to Protect Health, Environment, and Safety\n\nRisk management and safety are important concerns at Bear Mountain Limited; this Risk Management Plan formalizes and documents activities to address these concerns. Bear Mountain Limited is committed to conducting its operations in a safe and responsible manner and to reducing risks to human health and to the environment. \n\nThis commitment to health, the environment, and safety starts with upper management. Upper management demonstrates this commitment by investing resources in accident prevention efforts, such as ensuring that safety systems are incorporated into the design, installation, operation, and maintenance of the facility. Upper management implements both administrative and engineering controls to reasonably minimize the risk of an uncontrolled release of a hazardous substance. Bear Mountain's commitment to safety is demonstrated in the training programs for all employees. The training programs provide information on preventing accidents through knowledge of hazards and safe work practices.\n\n3.0 Facility Identification\n\nBear Mountain Limited is located at 7001 Camino Grande Drive, Bakersfield, California. Bear Mo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12585,
      "SummaryText": "untain is a limited partnership of separate private investors but is operated by Dynegy Operating Company. The facility produces electricity and steam utilizing a natural gas burning turbine. The facility uses anhydrous ammonia to minimize air pollution of nitrogen oxides. The anhydrous ammonia reacts with the nitrogen oxides in the exhaust gas stream to form nitrogen and water, which are then released to the atmosphere. Use of anhydrous ammonia results in greater than 90% reduction of nitrogen oxide emissions. Anhydrous ammonia is regulated under 40 Code of Federal Regulations (CFR) Part 68, the U.S. EPA RMP rule. The maximum amount of ammonia present at the facility is approximately 2,500 gallons, or 14,225 pounds, which is above the RMP threshold quantity of 10,000 pounds.\n\n4.0 Hazard Assessment - Worst Case Scenario \n\nThe worst-case accidental release scenario is a catastrophic failure of the anhydrous ammonia tank. The ammonia is maintained as a liquid via pressurization, and the quantity is limited by an administrative control, resulting in a maximum of 14,225 pounds of ammonia.\n\nHazard assessment modeling shows that, under the worst-case weather conditions and a 10-minute release period, the worst-case release could travel downwind until the toxic endpoint of 200 parts per million (ppm) is reached; this would affect public receptors. It should be noted that the worst-case scenario is an extremely unlikely event. Also, qualified individuals operate the process and the ammonia equipment is inspected and maintained according to established preventive maintenance schedules, which further reduce the likelihood of this occurrence.\n\n5.0 Hazard Assessment - Alternative Release Scenario\n\nAn alternative release scenario, which is more credible than the worst-case scenario, was also modeled for ammonia in the hazard assessment. In the alternative release scenario, a break in the ammonia piping is assumed to occur. The pipe break would normally create a high flow of ammo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12585,
      "SummaryText": "nia out of the tank, which would cause the excess flow valve, set at 15 gallons per minute (gpm), to close. In this case, the amount of ammonia released would be minimal. However, the alternative release scenario selected assumes that the pipe break would be small enough to maintain the flow rate less than 15 gpm and the excess flow valve would not close. The release is assumed to last for 5 minutes before operators in the control room can close the remotely operated valve to shut off the ammonia supply. The dispersion modeling shows that the release would travel off site before the toxic endpoint of 200 ppm is reached. The release will not impact public receptors in this scenario.\n\n6.0 General Accidental Release Prevention Program\n\nA prevention program is in place to minimize the risk of hazardous chemical releases in accordance with the California Occupational Safety and Health Administration (CalOSHA) Process Safety Management (PSM) standard (Section 5189 of Title 8, CCR) and the U.S. EPA RMP. This prevention program covers the process that handles anhydrous ammonia above the threshold quantity of either PSM or RMP rules.\n\nThe prevention program provides a structured approach to preventing accidents. Specific activities in the prevention program include the following:\n\n- Process safety information is provided to all employees upon hire and is accessible at all times.\n\n- In-depth process hazard analyses are completed by qualified personnel using techniques approved \n  under the PSM standard. \n\n- Written operating procedures (kept up to date) are used for training and guiding the work of operators.\n\n- Training is provided to all employees upon hire, and refresher training is given annually or upon request.\n\n- Operators, mechanics, and contractor personnel are qualified, trained in the general hazards in the\n   facility, and informed of any temporary situations affecting safety.\n\n- Pre-startup safety reviews are conducted to insure that conditions for safe operation"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12585,
      "SummaryText": "have been \n  satisfied prior to starting new or modified equipment.\n\n- A program is in place to maintain the mechanical integrity of the process, which includes written \n  procedures, training requirements, equipment deficiency requests for employees, work orders, \n  scheduled maintenance, and computerized documentation.\n\n- A hot work permit system assures that welding, grinding, or other spark-generating work is done safely \n  and properly.\n\n- A management of change system is in place to ensure that changes are managed safely.\n\n- Incidents are investigated and actions are taken as part of a continuous improvement effort.\n\n- Routine audits are conducted to assure that safe practices are being followed.\n\n- Although no changes were recommended as a result of the last process hazard analysis, the chemical \n   inventory of anhydrous ammonia was reduced from 10,200 gallons to 2,500 gallons.\n\nThis systematic approach to process safety involves employees and strives for continuing improvements in overall safety. The training, qualifications, and safety awareness of our operations, maintenance, and management personnel are a key element in reducing and mitigating accidents.\n\n7.0 Five-Year Accident History\n\nFrom January 1994 to the present, no accidents or releases of regulated substances from the covered process have occurred that meet U.S. EPA criteria for the five-year accident history. Such \"RMP accidents\" would involve serious accidents with either on-site deaths, injuries, or significant damage or known, off-site deaths, injuries, property damage, or environmental damage. Bear Mountain Limited realizes that the community may also be interested in smaller releases of regulated chemicals that do not meet such criteria. Bear Mountain Limited has been diligent in reporting releases of hazardous materials and in investigating and correcting the causes of such releases.\n\n8.0 Emergency Response Plan\n\nAn emergency response plan has been implemented at Bear Mountain Limited. P"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12585,
      "SummaryText": "lant personnel are trained to the First Responder Awareness and First Responder Operational levels; therefore, Bear Mountain Limited personnel are considered defensive emergency responders. The Federal RMP and CalARP regulations grant exemptions for the emergency response plan to facilities that only conduct defensive emergency response. The exemption is valid provided that the facility is included in the community emergency response plan and that there is an appropriate mechanism in place to notify emergency responders when there is a need for a response. \n\nThe emergency response plan provides procedures for responding to an emergency, including the potential release of anhydrous ammonia. The procedures include instruction for response, communication, first aid, evacuation, accounting for personnel, company and agency notification procedures, and post incident cleanup and decontamination. This emergency response plan has been submitted to the City of Bakersfield Fire Department. Bear Mountain Limited's emergency response plan protects employees, ensures public safety, and protects the environment.\n\n9.0 Planned Changes to Improve Safety\n\nChemical safety is an important part of Bear Mountain Limited operations. Appropriate training as well as implementing regulatory requirements have minimized chemical exposure risks to employees and the public through ongoing internal risk reduction efforts. For example, an ammonia \"dump\" tank was installed to quickly empty the ammonia into another tank filled with water for dilution in the event of an emergency. Also emergency shutoff valves were installed on the ammonia transfer lines to quickly shutdown the system in the event of an emergency during loading.\n\nOther improvements will be made when identified and approved by management."
    }
  ]
}