{
  "FacilityID": 12606,
  "FacilityName": "LaVergne Water Treatment Plant",
  "FacilityStr1": "700  Bon Aqua Drive",
  "FacilityStr2": null,
  "FacilityCity": "LaVergne",
  "FacilityState": "TN",
  "FacilityZipCode": "37086",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47149",
  "LEPC": "Rutherford County LEPC",
  "FacilityLatDecDegs": "36.054444",
  "FacilityLongDecDegs": "-86.540556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": "WWW.LaVergne.ORG",
  "FacilityEmailAddress": "City@LaVergne.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "The City of LaVergne, TN",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of LaVergne",
  "OperatorStr1": "5093 Murfreesboro Rd.",
  "OperatorStr2": null,
  "OperatorCity": "LaVergne",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37086",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ronnie Weaver",
  "RMPTitle": "Chief Operator",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000135604",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-09-28 00:00:00",
  "SafetyInspectionBy": "Arthur J. Gallagher & Co.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2002-12-16 00:00:00",
  "DeRegistrationEffectiveDate": "2002-06-25 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 36.05249,
  "FRS_Long": -86.54446,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16862,
      "AltID": "1",
      "FacilityID": 12606,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 17287,
          "ProcessID": 16862,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 21022,
          "ProcessID": 16862,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 521022,
          "ProcessID": 16862,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12606,
      "SummaryText": "  Risk Management Plan for LaVergne Water Treatment Plant\n\nExectuive Summary\n\n1.0    General\n\nThe LaVergne Water Treatment Plant is located at 700 Bon Aqua Drive in LaVergne, Tennessee 37086.  The plant stores and uses chlorine.  The chlorine presents a potential for a catastrphic event.  The amount of chlorine exceeds the EPA threshold quantity of 2,500 pounds.\n\n2.0    Accidental Release Prevention and Emergency Response Policies\n\nThe operators at the Water Treatment Plant are trained in the proper storage and use of chlorine.  The operators receive refresher training on a scheduled basis.  Certain equipment items are replaced on a scheduled basis in effort to prevent equipment failure.  A repair kit is maintained on site at all times.  Three chlorine detectors and alarms are located in the plant to detect any release.  The alarms will soon be connected directly to the Police Department.  Meetings and emergency plans have been coordinated with the Rutherford County Emergency Management Agency, the LaVergne Police Department, the LaVergne Fire Department, and the LaVergne Rescue Squad.  A training exercise has been scheduled.\n\n3.0    The Regulated Substance\n\nThe only regulated substance stored at the LaVergne Water Treatment Plant is chlorine.  The chlorine is used to disinfect the potable water used by the residents of LaVergne.  The plant has the capacity to store four one-ton cylinders for a total of 8,000 pounds.\n\n4.0    Release Scenarios\n\na. Worst Case Scenario - It has been determined that the worst case scenario at this plant is the release from the two one-ton cylinders that are commonly connected to the chlorine feeders.  By EPA regulations, the entire contents of both cylinders is assumed to be released in 10 minutes.  If this occurs, the limit of concern is 1.3 miles from the plant. See enclosed map.   This scenario is unlikely to occur.  \nb. Alternative Scenario - It has been determined, that a more likely scenario would be a release that would result if the pigtail"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12606,
      "SummaryText": " (tube) connecting the supply cylinder to the feeder was to break.  The limit of concern would be up to 0.1 miles from the plant.  See enclosed map.\n\nc. Several factors are in effect to either prevent any release of chlorine or to minimize the effect of any release.  The operators receive initial training and refresher training, repair kits are kept on site, the chlorine is stored in a closed room, and chlorine detectors are located near the storage room.\n \n5.0    Prevention Program\n\nLaVergne has developed this Risk Management Plan and a Process Safety Management Plan.  These plans bring LaVergne into compliance with the OSHA and EPA requirements for facilities that store and use chlorine.\n\n6.0    Five Year Accident History\n\nThere have been no reportable releases of chlorine at the LaVergne Water Treatment Plant in the past five years.  There are occasional very minor releases of  very short durations while connecting new cylinders to the feeders.\n\n7.0    Emergency Response Program\n\nThe Emergency Response Plan at the LaVergne Water Treatment Plant has been coordinated with the overall LaVergne Emergency Plan.  Coordination meetings have been held with the Rutherford County Emergency Management Agency, the LaVergne Police Department, the LaVergne Fire Department, and the LaVergne Rescue Squad.  Joint training is scheduled and a training exercise has been scheduled.\n\n8.0    Planned Changes to Improve Safety\n\nThe following changes are planned to improve safety:\n\n7 Several items in the chlorine feed system will be replaced.\n7 An automatic emergency shut-off valve will be installed on the storage cylinders.\n7 An additional fire extinguisher will be installed.\n7 Police Department personnel, Fire Department personnel, and Rescue Squad personnel will receive chlorine training and SCBA training.\n7 The chlorine detector alarms will be connected to the LaVergne Police Department.\n7 A table top and an on site release/response exercise will be scheduled.\n7 Two additional SCBA units will be "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12606,
      "SummaryText": "replaced outside the plant near the front gate.\n7 The chlorine stroge room ventilation fan will be placed with a quieter fan to facilitate verbal communication while in the storage room.  The fan will be connected to the emergency shut off valve to shut off the fan upon activation of the emergency shut off system."
    }
  ]
}