{
  "FacilityID": 12604,
  "FacilityName": "HCI Chemtech Distribution, Inc. (Kansas City)",
  "FacilityStr1": "5200 Stillwell Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Kansas City",
  "FacilityState": "MO",
  "FacilityZipCode": "64120",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29095",
  "LEPC": "Mid-America LEPC",
  "FacilityLatDecDegs": "39.1425",
  "FacilityLongDecDegs": "-94.52",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PF",
  "FacilityURL": "www.hollandchemical.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 790643126,
  "ParentCompanyName": "HCI USA Distribution Companies, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 926348517,
  "Company2DUNS": 0,
  "OperatorName": "HCI Chemtech Distribution, Inc.",
  "OperatorStr1": "424 South Woods Mill Rd.",
  "OperatorStr2": "Suite 325",
  "OperatorCity": "Chesterfield",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "63017",
  "OperatorZipCodeExt": "3428",
  "FTE": 21,
  "OtherEPAFacilityID": "MOD980688881",
  "EPAFacilityID": "100000135463",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "2240-68",
  "SafetyInspectionDate": "1998-04-30 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": "1999-07-15 00:00:00",
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.14218,
  "FRS_Long": -94.52022,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16854,
      "AltID": "Storage-Bleach Production",
      "FacilityID": 12604,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 21013,
          "ProcessID": 16854,
          "ChemicalID": 62,
          "Quantity": 230000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 17278,
          "ProcessID": 16854,
          "NAICSCode": "42269",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 17279,
          "ProcessID": 16854,
          "NAICSCode": "325188",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8845,
              "Process_NAICS_ID": 17279,
              "SafetyReviewDate": "1999-04-29 00:00:00",
              "PHA_Date": "1999-04-29 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-10-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "Emergency Stops",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-18 00:00:00",
              "TrainingReviewDate": "1999-04-29 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-10 00:00:00",
              "EquipmentInspectionDate": "1999-06-17 00:00:00",
              "EquipmentTested": "Chlorine Gas Detectors",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-04-29 00:00:00",
              "PreStartupReviewDate": "1998-04-04 00:00:00",
              "ComplianceAuditDate": "1999-04-29 00:00:00",
              "AuditCompletionDate": "1999-07-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-29 00:00:00",
              "HotWorkPermitReviewDate": "1999-04-29 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-29 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 12112,
                  "PreventionProgram3ID": 8845,
                  "ProcessChemicalID": 21013
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12604,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "LEPC",
    "CoordinatingAgencyPhone": "8164744240",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12604,
      "SummaryText": "\nThe hci Chemtech Distribution, Inc. facility is a chemical distribution plant located in Kansas City, Missouri.  The facility is a part of the Chemical Distribution Business Unit of hci USA Distribution Companies, Inc. headquartered in St. Louis, Missouri.  hci USA Distribution Companies is an advanced distribution company serving customers worldwide products, chemicals and advanced materials.  The company ranks among the top 10 chemical distribution firms in North America.  hci USA Distribution Companies has approximately 1,000 employees at more than 50 facilities in 21 states and Mexico.  hci USA Distribution Companies may be found at its Web Page: www.hollandchemical.com.  \n\nIt is a worldwide policy of hci USA Distribution Companies to design, blend and distribute its products and to handle materials throughout their life cycle in a manner that protects the environment and safeguards employees, customers and the public from unacceptable risk.  It is also company policy to adhere to all applicable Federal, State and Local regulations. The facility is a member of the National Association of Chemical Distributors (NACD) and participates in the NACD's Responsible Distribution Process.  The Community Outreach and Emergency Response Plan of Responsible Distribution brings chemical distribution plants and local communities together through communications and cooperative emergency planning.  The facility assists with emergency planning by maintaining active membership on the Mid-American Local Emergency Planning Committee, and for 15 years, the company has been a member of the Chlorine Institute, which fosters the continuous evaluation of improvements to safety and the protection of human health and the environment.\n\nThe hci Safety Program is designed to prevent fires, explosions and accidental chemical releases.  The program requires safety audits and inspection and maintenance programs as well as safety training for employees and contract workers. The emergency progra"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12604,
      "SummaryText": "ms in place at the facility include an Emergency Action Plan, a Fire Prevention Plan, a Transportation Emergency Plan and a Spill Prevention Control & Countermeasure Plan.  Facilities are encouraged to listen to the concerns of the community and to consider these concerns when designing and implementing process safety systems.  \n\nThe hci Chemtech facility located at 5200 Stilwell Road in Kansas City, Missouri employs 21 people from the Kansas City community.  The primary purpose of this facility is to repackage and distribute industrial chemicals.  The facility handles chlorine, which is considered hazardous by the Environmental Protection Agency (EPA).  hci USA Distribution has 50 years of experience handling chlorine at various facilities.  Chlorine is widely used in the purification of drinking water, wastewater treatment and in household cleaning products.  It is also commonly used to sanitize swimming pools.  The same properties that make chlorine valuable as a commodity also make it necessary to observe certain safety precautions during handling and storage to reduce the threat to nearby members of our community as well as to that of the people in our company. \n\nThe EPA was mandated by law to define the Worst Case Scenario (WCS), as an unlikely event: the largest single storage vessel losing all of its contents in 10 minutes. The WCS also assumes that the liquid Chlorine immediately vaporizes to gas, the safety controls do not work and there is no strong wind or moderate breeze to quickly dilute the vapors.  If the largest vessel on site lost its entire contents in 10 minutes, the resulting release would result in off-site consequences.  \n\nThe EPA calls a more likely incident, many of which will have limited off-site consequences, an Alternate Release Scenario (ARS).  An ARS could be a hose or small vessel leak.  For this facility the ARS will also have off-site consequences to adjacent businesses.      \n\nAt hci Chemtech several layers of defense are implement"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12604,
      "SummaryText": "ed in order to prevent off-site impacts.  The Kansas City facility is equipped with Chlorine detectors around the perimeter of the railcar as well as a detector in the bleach manufacturing building.  If any one of these detectors detects Chlorine, block valves are automatically closed stopping the release.  Manual emergency stops are also located throughout the facility to manually close the block valves in the event that the other safety systems fail.  Other examples of release prevention include using transfer hoses approved by the Chlorine institute, investigating all unusual operations and small leaks or spills to prevent recurrence and conducting routine audits of the process.  Also, operators are trained and tested to ensure that safe operating procedures are followed at all times. \n\nhci Chemtech maintains Health, Safety and Environmental manuals, which contain company policies for Risk Management, Training, Product Stewardship, Community Outreach and Hazard Communication among others.  The manuals also include Emergency Action Plans, Emergency Response Plans and Transportation Emergency Plans.  The facility is also in compliance with the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard which requires careful reviews of the associated hazards and the necessary safeguards that must be implemented to prevent releases of regulated chemicals. \n\nThere have been no accidental releases of chlorine from the facility in the past 5 years.  No one on-site or off-site has ever been injured from a chlorine release at the facility.  Evacuation measures have never been taken due to a release.  \n\nThe facility has emergency plans, which have been coordinated with local fire departments and the Mid-American Local Emergency Planning Committee.  All safety equipment is Y2K compatible.  If there was a Chlorine emergency at the facility, the emergency alarm would activate and the Emergency Action Plan (EAP) would be initiated.  All emplo"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12604,
      "SummaryText": "yees are trained annually on the EAP and several employees have received 40-hr Hazardous Waste Operations and Emergency Response training.  \n\nhci Chemtech continues to improve its safety record by conducting incident investigations, safety compliance audits, continuous training of emergency procedures and continuous community outreach actions which include: educating and training neighbors, customers, fire departments and emergency response teams.  hci Chemtech practices continuous training of emergency procedures through regular safety meetings and thorough investigations and reviews of all incidents by the Facility Safety Committee.  hci Chemtech will also be taking steps to improve emergency preparedness by adding a system to activate emergency response procedures for leaks that occur from storage containers while the facility is not occupied.  hci Chemtech will continue to work to reduce the risks, protect the environment and safeguard employees, customers and the public."
    }
  ]
}