{
  "FacilityID": 12622,
  "FacilityName": "A.E. Staley Manufacturing  - Decatur",
  "FacilityStr1": "2200 East Eldorado Street",
  "FacilityStr2": null,
  "FacilityCity": "Decatur",
  "FacilityState": "IL",
  "FacilityZipCode": "62521",
  "Facility4DigitZipExt": "1578",
  "FacilityCountyFIPS": "17115",
  "LEPC": "Macon County LEPC",
  "FacilityLatDecDegs": "39.843611",
  "FacilityLongDecDegs": "-88.910278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.aestaley.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 122320559,
  "ParentCompanyName": "A.E. Staley Manufacturing Company",
  "Company2Name": null,
  "CompanyDUNS": 122320559,
  "Company2DUNS": 0,
  "OperatorName": "A.E. Staley Manufacturing Company",
  "OperatorStr1": "2200 East Eldorado Street",
  "OperatorStr2": null,
  "OperatorCity": "Decatur",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62521",
  "OperatorZipCodeExt": "1578",
  "FTE": 350,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000132858",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-08-31 00:00:00",
  "SafetyInspectionBy": "Decatur Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-08-31 00:00:00",
  "DeRegistrationEffectiveDate": "2012-08-01 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.8466,
  "FRS_Long": -88.92582,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16893,
      "AltID": "Ethylene Oxide-Bulk Tank",
      "FacilityID": 12622,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 21063,
          "ProcessID": 16893,
          "ChemicalID": 9,
          "Quantity": 220000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 17318,
          "ProcessID": 16893,
          "NAICSCode": "311221",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8880,
              "Process_NAICS_ID": 17318,
              "SafetyReviewDate": "1996-04-15 00:00:00",
              "PHA_Date": "1996-04-15 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1997-01-23 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Nitrogen Blanketing",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 1,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-04-20 00:00:00",
              "TrainingReviewDate": "1998-04-16 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-03 00:00:00",
              "EquipmentInspectionDate": "1998-04-29 00:00:00",
              "EquipmentTested": "EO Tank Thickness Test",
              "ChangeMgmtDate": "1999-05-24 00:00:00",
              "ChangeMgmtReviewDate": "1997-06-21 00:00:00",
              "PreStartupReviewDate": "1996-12-01 00:00:00",
              "ComplianceAuditDate": "1998-07-14 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1999-01-29 00:00:00",
              "InvestigationChangeDate": "1999-01-29 00:00:00",
              "ParticipationPlansReviewDate": "1997-05-20 00:00:00",
              "HotWorkPermitReviewDate": "1997-06-21 00:00:00",
              "ContractorSafetyReviewDate": "1998-09-14 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Ethylene Oxide",
              "_chemicals": [
                {
                  "PrimaryKey": 12154,
                  "PreventionProgram3ID": 8880,
                  "ProcessChemicalID": 21063
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 16894,
      "AltID": "Ethylene Oxide Rail Car",
      "FacilityID": 12622,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 21064,
          "ProcessID": 16894,
          "ChemicalID": 9,
          "Quantity": 170000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 17319,
          "ProcessID": 16894,
          "NAICSCode": "311221",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12622,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1997-04-30 00:00:00",
    "ERTrainingDate": "1998-10-15 00:00:00",
    "CoordinatingAgencyName": "Macon County LEPC",
    "CoordinatingAgencyPhone": "2174241329",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12622,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nWe at A.E. Staley Manufacturing Company-Decatur are strongly committed to employee, public, and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\nTHE STATIONARY SOURCE AND THE REGULATED SUBSTANCES HANDLED\nOur facility's primary activities encompass the manufacture corn syrup, dry dextrose, industrial starch, and baking starches.  We have one regulated substance at our facility.  This substance is Ethylene Oxide.  Ethylene Oxide (anhydrous) is used in Starch Modification.  There are two covered processes at the Decatur site and both contain Ethylene Oxide.  One is the Ethylene Oxide 220,000 lb bulk tank; the second is the 170,000 lb rail car at the east end of the Decatur site.\n\nThe maximum inventory of Ethylene Oxide is 390,000 lb.\n\nTHE WORST CASE RELEASE SCENARIO AND THE ALTERNATE RELEASE SCENARIOS \nTo evaluate the worst case scenario and the alternate release scenarios we have used EPA's RMP Guidance for Off Site Consequence Analysis and EPA's RMPComp*. The following paragraphs provide details of the chosen scenarios.\n\nThe WORST CASE RELEASE SCENARIO submitted involves a catastrophic release from the Ethylene Oxide tank.  In this scenario 220,000 lb. of Ethylene Oxide is released.  The toxic gas liquified under pressure is assumed to evaporate entirely over 10 minutes. At class F atmospheric stability, 1.5 m/s windspeed, and urban topography a distance of 10 miles is obtained corresponding to a toxic endpoint of 0.09mg/L.\n\nTHE ETHYLENE OXIDE ALTERNATE RELEASE SCENARIO involves PUNCTURING a rail car of Ethylene Oxide while moving the car from the holding area at the east end of the Decat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12622,
      "SummaryText": "ur facility.  The release cannot be mitigated and the entire 170,000 lbs contents of the rail car is released.   Under neutral weather conditions of class D atmospheric stability and 3 m/s wind speed and assuming urban topography, a distance of 1.7 miles is obtained corresponding to a toxic endpoint.\n\nA SECOND ETHYLENE OXIDE ALTERNATE RELEASE SCENARIO was included which involves malfunction of the Ethylene Oxide bulk tank pressure relief valve.  The malfunction is repaired in 10 minutes after a release of 830 lb.  Under neutral weather conditions of class D atmospheric stability and 3 m/s wind speed and assuming urban topography, a distance of 0.3 miles is obtained corresponding to a toxic endpoint. \n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE CHEMICAL-SPECIFIC PREVENTION STEPS\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-30 Standard, NFPA-36 Standard, applicable ANSI and ASME standards, and considering chemical supplier recommendations.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nPROCESS SAFETY INFORMATION-A.E. Staley Manufacturing Company-Decatur maintains a record of safety information that describes the chemical hazards, operating parameters, and equipment design associated with all processes.  \n\nPROCESS HAZARD ANALYSIS-Our facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is the What If Scenarios.  The studies are undertaken by a team of qualified personnel with expertise in engineering, maintenance, and process operations and are revalidated at regular intervals.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recen"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12622,
      "SummaryText": "t PHA review for the Ethylene Oxide system was performed April 15, 1996.\n\nOPERATING PROCEDURES-For the purposes of safely conducting activities within our covered processed, A.E. Staley Manufacturing Company-Decatur maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operation, temporary operations, emergency shutdown, emergency operations, normal shutdown, and startup after a maintenance shutdown.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTRAINING-A.E. Staley Manufacturing-Decatur has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided as needed.\n\nMECHANICAL INTEGRITY-A.E. Staley Manufacturing Company-Decatur carries out documented maintenance checks on process equipment to insure proper operations.  Process equipment examined by these checks includes: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Qualified personnel carry out maintenance operations with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nMANAGEMENT OF CHANGE-Written procedures are in place at A.E. Staley Manufacturing-Decatur to manage changes in process chemicals, technology, equipment, and procedures.  The most recent review/revision of maintenance procedures was performed March 3, 1999.  Process operators, maintenance personnel, or any other employee whose job task are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPRE-START UP REVIEW-Pre-start up safety reviews related to new processe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12622,
      "SummaryText": "s and to modifications in established processes are conducted as a regular practice at A.E. Staley Manufacturing Company-Decatur.    These reviews are conducted to confirm that construction, equipment, operating, and maintenance procedures are suitable for safe startup prior to placing equipment in operation.\n\nCOMPLIANCE AUDITS-A.E. Staley Manufacturing Company-Decatur receives corporate audits on a regular basis to determine whether the provisions set out under the PSM standard and RMP rule are being implemented.  The most recent compliance audit was conducted July 14, 1998.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nINCIDENT INVESTIGATION-A.E. Staley Manufacturing Company-Decatur promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEMPLOYEE PARTICIPATION-A.E. Staley Manufacturing Company-Decatur truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In additions, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analysis.\n\nCONTRACTORS-Our company hires contractors to conduct specialized and routine maintenance and construction activities.  Long term relationships have been established with the contractors that work on a routine basis. All contract personnel are required to have site specific training.  This contractor training must be documented before a contractor worker is allow"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12622,
      "SummaryText": "ed on the job site.   The contractor safety representative meets with an A.E. Staley Manufacturing Company-Decatur representative regularly.  The contractor notifies A. E. Staley Manufacturing-Decatur about any incident involving a near miss, accident, or injury of contract personnel.  A.E. Staley Manufacturing-Decatur keeps copies of all the meeting notes and incident investigation reports to document past safety performance.  A.E. Staley Manufacturing Company-Decatur has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\nFIVE YEAR ACCIDENT HISTORY\nA.E. Staley Manufacturing Company-Decatur has had no accidental releases that have adversely affected employees,  public receptors, environmental receptors or plant property.\n\nEMERGENCY RESPONSE PLAN\nA.E. Staley Manufacturing Company- Decatur carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan in promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nThe Macon County Local Emergency Planning Committee is the Local Emergency Planning Committee with which our emergency plan has been coordinated and verified."
    }
  ]
}