{
  "FacilityID": 12676,
  "FacilityName": "Bar-S Foods Co. - Lawton Plant",
  "FacilityStr1": "802 SW Goodyear Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Lawton",
  "FacilityState": "OK",
  "FacilityZipCode": "73505",
  "Facility4DigitZipExt": "9797",
  "FacilityCountyFIPS": "40031",
  "LEPC": "Comanche County LEPC",
  "FacilityLatDecDegs": "34.6035",
  "FacilityLongDecDegs": "-98.509333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "FC",
  "FacilityURL": "www.bar-s.com",
  "FacilityEmailAddress": "bstringer@lawtonok.net",
  "FacilityDUNS": 48804504,
  "ParentCompanyName": "Bar-S Foods Co.",
  "Company2Name": null,
  "CompanyDUNS": 48804504,
  "Company2DUNS": 0,
  "OperatorName": "Bar-S Foods Co.",
  "OperatorStr1": "4041 N. Central Avenue, Suite 1300",
  "OperatorStr2": "P.O. Box 29049",
  "OperatorCity": "Phoenix",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85038",
  "OperatorZipCodeExt": "9049",
  "RMPContact": "Don Bohnsack",
  "RMPTitle": "Vice-President, Lawton Div.",
  "FTE": 275,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000134115",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-26 00:00:00",
  "SafetyInspectionBy": "Risk Management Consultant",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.59833,
  "FRS_Long": -98.51006,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16955,
      "AltID": "Ammonia",
      "FacilityID": 12676,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 17380,
          "ProcessID": 16955,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 21129,
          "ProcessID": 16955,
          "ChemicalID": 56,
          "Quantity": 25000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 521129,
          "ProcessID": 16955,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12676,
      "SummaryText": "1.0 RMP EXECUTIVE SUMMARY\n\nAccidental release prevention and emergency response policies at BAR-S FOODS CO. prevents accidental releases through classroom and on the job training of refrigeration personnel and ongoing inspection and maintenance of the refrigeration system.  Refrigeration system components are located on the roof or in overhead areas that are not as likely to become damaged ( i.e. tanks and pipe runs are placed away and protected from forklift and truck traffic).\n\n1.2 Source and regulated substances handled (&68.155(b)).\n\nApproximately 25,000 lbs. of anhydrous ammonia is contained within the refrigeration system on site at 802 SW Goodyear Blvd., Lawton, OK. 73505. The EPA requires a Risk Management Plan be developed and maintained when the total amount of anhydrous ammonia exceeds the threshold quantity of 10,000 lbs. No other substances, in quantities subject to EPA RMP certification requirements, are located at the Bar-S Foods Co. plant.\n\n1.3 Worst Case and Alternate Case Release Scenarios (&68.155(c)).\n\n1.3.1 Bar-S Foods Co. topography is described as \"Rural\", and is entered into the dispersion models as the surface roughness parameter.\n\n1.3.2 Worst Case Scenario (WCS)\n\nThe ammonia storage receiver, located inside the Machine Room, contains the largest quantity of anhydrous ammonia, on site, on a predictable worst case basis.  This tank holds approximately 10,000 lbs. Of anhydrous ammonia when 85% full, under an internal pressure and temperature of approximately 181 psig and 950F, and is used to recharge the system.  This tank is filled approximately every six months.  The Worst Case Scenario as required by EPA, assumes that the tank's contents are fully released as a liquid over a 10-minute period.\n\nThe dispersion model, EPA's RMP*Comp(TM) predicted with a wind speed of  3.4 miles/hour and atmospheric stability class F, the anhydrous ammonia release may travel 1.8 miles from the point of release. There is a residential population estimated at 30 "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12676,
      "SummaryText": "people in the surrounding community that resides within the radius to the toxic endpoint (level of concern=200-ppm, anhydrous ammonia).\n\n1.3.3 Alternate Case Scenario (ACS)\n\nThe Alternate Case, more likely, Release Scenario for Bar-S Foods Co. was selected to involve a relief valve release on the high pressure receiver.  The relief valve discharges outside on the roof. Anhydrous ammonia (at approximately 250 psi and 1800F) was estimated to have a flow rate from the relief valve (inner orifice diameter: 1.0 inches) of approximately 186 lbs/min., determined from an ammonia gas release table.  It is estimated that the relief valve could be isolated, or the overpressure condition corrected, in approximately 30 minutes by trained operators onsite, with a corresponding anhydrous ammonia gas quantity released of approximately 5580 lbs.\n\nThe EPA's RMP*Comp(TM) air dispersion model predicted, with a wind speed of 6.7 miles/hour and atmospheric stability class D, that the anhydrous ammonia release may travel approximately 0.3 miles. Landview in the release radius (level of concern =200 ppm, anhydrous ammonia) of the facility reveals that there are no residences located within 0.3 miles of the facility.  There are public receptors, major commercial or industrial areas, within the radius to the toxic endpoint.\n\n1.4 Accidental release prevention program (&68.155(d)).\n\nBar-S Foods Co. standard policy requires daily monitoring and inspection of the anhydrous ammonia refrigeration system by trained employees, or contracted services personnel, in accordance with OSI1A and 11AR guidelines.  Accidental release prevention practices at Bar-S Foods Co. include:\n\n7  Annual operator refresher training\n7  Routine preventative maintenance and inspections\n7  Refrigeration system repairs made in a prompt, safe manner\n7  Labeling of ammonia system pipes and components\n7  Safe work practices followed\n\n1.5 5 year accidental history (&68.155(e)).\n\nNo releases or accidents, involving anhydrous ammo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12676,
      "SummaryText": "nia, that are reportable in accordance with 40 CFR Part 68 (RMP Rule), have occurred at this facility. No releases or accidents, involving anhydrous ammonia, have resulted in injury or environmental damage.\n\n1.6 Emergency response program (&68.155(f)).\n\n1.6.1 During normal workday operation, the facility emergency response plan consists of employee notification ( public address system/ alarm system) and evacuation, followed by notification of the Fire Department Station. Burns security monitoring company with personnel onsite also receives an alarm whenever an emergency plant shutdown occurs.\n\n1.6.2 Red Cross shelter resources in the area consist of pre-arranged service agreements with local schools and some local churches.  Schools and churches that would serve as a Red Cross shelter would have food, cots, and first aid supplies on site and reserve supplies would be shipped in.  The Fire Department or Police Chief would activate the Red Cross if they are needed and would arrive within two hours with the Emergency Response Vehicles. They are able to provide first aid, refreshments, and clean clothing for the emergency response workers.  The Fire or Police Chief would decide if sheltering in place or evacuation and sheltering is required in a given emergency.  If evacuation is needed, the Red Cross would then activate the shelter(s) determined to be located at a safe distance from the hot area.  Those in need of medical attention would be taken to a nearby hospital.\n\n1.7 Planned changes to improve safety (&68.155(g)).\n\nFuture plans to improve anhydrous ammonia refrigeration system safety at Bar-S Foods consist of:\n7  Coordinating a written emergency response plan with the Fire Department and a nearby HAZMAT emergency response contractor.\n7  Annual HAZMAT technician, and Incident Commander training.\n7  Improving PSM program elements on an on going basis."
    }
  ]
}