{
  "FacilityID": 12742,
  "FacilityName": "AgrEvo USA Company - Muskegon, MI facility",
  "FacilityStr1": "1740 Whitehall Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Muskegon",
  "FacilityState": "MI",
  "FacilityZipCode": "49445",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26121",
  "LEPC": "Muskegon County LEPC",
  "FacilityLatDecDegs": "43.286806",
  "FacilityLongDecDegs": "-86.261111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G3",
  "LatLongDescription": "PG",
  "FacilityURL": "www.agrevo.com",
  "FacilityEmailAddress": "muskegon.mi@agrevo.com",
  "FacilityDUNS": 878627298,
  "ParentCompanyName": "NOR-AM Chemical Company",
  "Company2Name": "Hoechst AG",
  "CompanyDUNS": 51014058,
  "Company2DUNS": null,
  "OperatorName": "AgrEvo USA Company",
  "OperatorStr1": "Little Falls Centre 1",
  "OperatorStr2": "2711 Centerville Rd.",
  "OperatorCity": "Wilmington",
  "OperatorStateFIPS": "DE",
  "OperatorZipCode": "19808",
  "OperatorZipCodeExt": null,
  "FTE": 80,
  "OtherEPAFacilityID": "49445NRMCH1740W",
  "EPAFacilityID": "100000133679",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-27 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-06-16 00:00:00",
  "DeRegistrationEffectiveDate": "2004-05-24 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 43.28518,
  "FRS_Long": -86.256312,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17063,
      "AltID": "Liberty process",
      "FacilityID": 12742,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 21302,
          "ProcessID": 17063,
          "ChemicalID": 56,
          "Quantity": 155000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 17488,
          "ProcessID": 17063,
          "NAICSCode": "32532",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8977,
              "Process_NAICS_ID": 17488,
              "SafetyReviewDate": "1999-04-15 00:00:00",
              "PHA_Date": "1999-06-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-09-28 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Computer control/monitoring/alarms/interlocks",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-20 00:00:00",
              "TrainingReviewDate": "1999-05-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-01 00:00:00",
              "EquipmentInspectionDate": "1999-03-01 00:00:00",
              "EquipmentTested": "High level switch on Ammonia Storage tank LSH-10334",
              "ChangeMgmtDate": "1999-06-03 00:00:00",
              "ChangeMgmtReviewDate": "1998-09-01 00:00:00",
              "PreStartupReviewDate": "1999-04-01 00:00:00",
              "ComplianceAuditDate": "1998-06-10 00:00:00",
              "AuditCompletionDate": "1999-08-31 00:00:00",
              "IncidentInvestigationDate": "1998-11-24 00:00:00",
              "InvestigationChangeDate": "1999-01-12 00:00:00",
              "ParticipationPlansReviewDate": "1998-06-10 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-12 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-05 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 12323,
                  "PreventionProgram3ID": 8977,
                  "ProcessChemicalID": 21302
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12742,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-12 00:00:00",
    "ERTrainingDate": "1999-05-25 00:00:00",
    "CoordinatingAgencyName": "Muskegon Township Fire Department",
    "CoordinatingAgencyPhone": "6167734316",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12742,
      "SummaryText": "AgrEvo is a global company operating in more than 70 countries and employing approximately 8100 people.  The Muskegon, MI facility produces Liberty herbicide for America's corn and soybean growers, as well as for canola growers in Canada.  Liberty is considered an environmentally friendly herbicide because the active ingredient in Liberty breaks down in the soil into harmless compounds within a matter of days.\n\nThe Environmental Protection Agency (EPA) has developed the Risk Management Planning (RMP) rule requiring certain companies that use or store certain  (threshold) quantities of toxic or flammable chemicals to develop and share information about the chemicals used, the potential risks those chemicals pose to the community, the many ways the risks are managed, and, in the unlikely event of a release, what preparations have been made to respond to that situation.  \n\nThe Muskegon facility is covered by the RMP regulation due to the use of Anhydrous Ammonia in the production of Liberty.  Ammonia is a very common, thoroughly studied chemical.  Years of research by government and industry have resulted in numerous standards and guidelines on the safe use and handling of Ammonia from groups such as OSHA, ANSI, CGA, AIChE, etc.  AgrEvo was able to incorporate all those standards and years of knowledge into the design and building of the state of the art Liberty facility in 1997/1998.  \n\nAnhydrous Ammonia is delivered to the site by railcar where it is briefly held until being off-loaded into two storage tanks.  For the worst case release scenario, the EPA requires the assumption that the ammonia railcar loses its entire contents in 10 minutes, with weather conditions of high temperatures at night with little wind.  Another required assumption is that there are no preventative measures in place and no emergency response.  AgrEvo used the EPA RMP*Comp software to model this scenario and determined that there is the potential for off-site impact.  However, this scena"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12742,
      "SummaryText": "rio is extremely unlikely for the following reasons:  1) There has never been a case where an ammonia railcar has lost its entire contents in 10 minutes; it would have to literally split open from end to end for this to occur.   And, 2)  even if the railcar did breach, a portion of the spilled ammonia in the dike would form an evaporating pool rather than be dispersed directly into the air.  That is, heat required for vaporization would cause rapid cooling of the flashing, liquefied gas.  This would result in a release time significantly longer than 10 minutes, which in turn reduces the concentration of ammonia released into the air.\n\nIt's important to note that while the EPA does not allow consideration of safety systems in the scenario above, there are many in place.  Those are as follows: railcar construction meets all DOT requirements, railcar is inspected regularly per DOT regulations, the DOT sets maximum fill amounts to allow for expansion, the railcar is equipped with safety relief valves and excess flow valves.   A  railcar of ammonia sits only briefly before being off-loaded into two storage tanks.   Emergency Response measures include a water curtain system to knock down vapors and dissolve ammonia, on-site emergency responders and assistance from the Muskegon Township Fire Department and/or Muskegon County Hazardous Materials (HazMat) team who have trained at AgrEvo via ammonia release drills.  The Muskegon Township Fire Department can answer questions regarding Muskegon Township emergency plans or AgrEvo's working relationship with the Fire Department.\n\nThe RMP Rule also requires that alternative scenarios be developed.  These are more realistic, although still unlikely events.  In these scenarios, average weather conditions are assumed and containment and mitigation abilities are accounted for.  These are the types of failures that AgrEvo plans for internally and externally with the Muskegon Township Fire Department.  Modeling of these alternative"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12742,
      "SummaryText": "scenarios was completed by a specialized third party engineering firm.  The HGSYSTEM modeling program listed in EPA's RMP Off-Site Consequence Analysis guidance was used.  Five scenarios were developed; the case that resulted in the largest potential release is a partial rupture in a 2 liquid line exiting the ammonia storage tank. \n\nThere is an excess flow valve connected to the tank on this exit line which will limit flow to 75 gal/min.  This represents the greatest release rate that can occur before the valve actuates and cuts off the flow. Such a release could be associated with a partial break in the line due to mechanical failure or corrosion. The modeling results show that there is the potential for very limited off-site exposure.   Because AgrEvo is situated on a large property of about 400 wooded acres, a leak of this sort would only just leave our lot line slightly if the wind is blowing from the east; this only occurs 6% of the time.  Note that the EPA specifies the toxic end point for Anhydrous Ammonia at 200 ppm.  This represents a level at which an individual would be protected from permanent injury or escape impairing effects of inhalation for exposures of several minutes to an hour. This means that in the unlikely event of a release when the wind is blowing equally unlikely from the east, a number of residents may be affected but no permanent injury should result.\n\nAgrEvo has never experienced a release that impacted either our own employees, the community or the environment.  AgrEvo strives to prevent releases from  occurring by adhering to the highest engineering and operating standards.  The Liberty process has many safeguards including remote, computer and operator monitored systems with alarms and interlocks, inherently safe equipment and design, and the latest in fireproof building construction and fire detection/sprinkler systems.  In addition, AgrEvo has had comprehensive accident prevention programs in place for many years.  These programs"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12742,
      "SummaryText": "were developed in accordance with the OSHA Process Safety Management (PSM) Program.  The PSM program governs nearly all aspects of managing production.  The system is briefly described below to illustrate the level of effort with regard to safety that occurs when process changes are requested.\n\n1) A Management of Change form is completed for any proposed changes. A risk assessment is completed and reviewed by appropriate managers.  All managers must approve the change based on their area of expertise.\n2) Depending on the complexity of the change, a more in depth process hazards analysis may be required.  This is completed by a diverse group of knowledgeable employees; the goal is to use the process safety information to discover any potential hazards that may result from the change.  These hazards, if any, are then dealt with by the engineering group.\n3) After all the safety issues are resolved, the project manager determines whether contractors or AgrEvo maintenance will complete the work.  If contractors are used, they must be qualified before coming on site.  This means that their safety and workmanship records are reviewed to ensure that they can complete the job safely.\n4) After the project is completed, a Pre-startup Safety Review (PSSR) is conducted. The size of the team for this study depends on the complexity of the change.  The goal is to ensure all issues from the Process Hazards Analysis were addressed, the project was installed according to design,  new hazards were not introduced (such as inaccessible valving, trip/bump hazards, etc.) during construction, and that procedures and training are in place.\n5) After any issues from the PSSR are resolved, startup can occur.\n\nThere are also a number of other elements in the accident prevention program such as Process Safety Information, Mechanical Integrity, Incident Investigation, Compliance Audits, Permit to Work for contractors and AgrEvo employees, and Emergency Response and Planning.  In addition, AgrE"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12742,
      "SummaryText": "vo conducts periodic internal audits using experts from other AgrEvo facilities to monitor compliance with government and company standards.\n\nAgrEvo has also been reaching out to address community concerns through the development of the AgrEvo Community Advisory Panel.   AgrEvo meets with the members to provide instruction on the processes, tour the facilities, and address their concerns regarding safety, the environment, and emergency response.  It is the hope of AgrEvo that by addressing the concerns of a diverse group of neighbors, the concerns of the community at large will also be addressed.  \n\nIn summary, AgrEvo has had an exemplary safety record with the community throughout its 20+ years and continues to develop and implement measures to protect the safety of its employees, the community and the environment.  Any questions regarding this plan or operations at the AgrEvo Muskegon site can be answered by calling (616)719-3000 or send e-mail to muskegon.mi@agrevo.com."
    }
  ]
}