{
  "FacilityID": 12740,
  "FacilityName": "City of South Bend Wastewater Treatment Plant",
  "FacilityStr1": "3113 Riverside Drive",
  "FacilityStr2": null,
  "FacilityCity": "South Bend",
  "FacilityState": "IN",
  "FacilityZipCode": "46628",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18141",
  "LEPC": "St. Joseph County LEPC",
  "FacilityLatDecDegs": "41.721444",
  "FacilityLongDecDegs": "-86.26825",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": "ci.south-bend.in.us",
  "FacilityEmailAddress": "kmudzin@ci.south-bend.in.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of South Bend, Department of Public Works",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of South Bend",
  "OperatorStr1": "1316 County-City Building",
  "OperatorStr2": "227 W. Jefferson Blvd.",
  "OperatorCity": "South Bend",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46601",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ken Zmudzinski",
  "RMPTitle": "Bureau Manager",
  "FTE": 70,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000133562",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "T141-7434-00160",
  "SafetyInspectionDate": "1998-10-13 00:00:00",
  "SafetyInspectionBy": "Insurance Carrier",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.71802,
  "FRS_Long": -86.27029,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17055,
      "AltID": "Chlorination System",
      "FacilityID": 12740,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 17480,
          "ProcessID": 17055,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 21294,
          "ProcessID": 17055,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 521294,
          "ProcessID": 17055,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 17056,
      "AltID": "Dechlorination",
      "FacilityID": 12740,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 17481,
          "ProcessID": 17056,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 21295,
          "ProcessID": 17056,
          "ChemicalID": 49,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 521295,
          "ProcessID": 17056,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12740,
      "SummaryText": "The City of South Bend Wastewater Treatment Facility (WWTP) facility staff are committed to safety and are continually evaluating ways to improve safety programs.  Facility staff work closely with other city and county agencies to coordinate safety and emergency response planning activities.\n\nThe WWTP uses chlorine, a regulated substance, in 1-ton cylinders to disinfect treated wastewater and uses sulfur dioxide, a regulated substance, in 1-ton cylinders to dechlorinate wastewater effluent prior to discharge to the St. Joseph River.  Cylinders are stored outdoors on a concrete slab.  Two cylinders of each substance are used indoors.  Chlorine and sulfur dioxide sensors continuously monitor the air in the rooms where chlorine and sulfur dioxide are used.  If chlorine or sulfur dioxide is detected, alarms are activated alerting facility personnel of a possible leak.  Both chlorine and sulfur dioxide systems consist of vacuum controlled process equipment.  A loss of vacuum in the process lines automatically closes the valve at the respective supply cylinder preventing a release of toxic gas.\n\nThe worst-case release scenario for each substance was modeled according to EPA guidelines and involved the catastrophic failure of one, full 1-ton cylinder.  No mitigation measures were considered for this scenario.  It is not likely that such an event would occur.\n\nEPA also requires that five alternative release scenarios be considered and one more likely to occur than the worst-case scenario should be used in an off-site consequence analysis.  The facility has no history of chlorine or sulfur dioxide releases under EPA's alternative release scenarios.  Chlorine is introduced into the process  through a vacuum controlled regulating valve on the cylinder in service.  If the vacuum is lost for any reason, the valve will automatically close preventing a release of chlorine.  For purposes of this Risk Management Plan (RMP), it is assumed that the gasket between the vacuum controlled"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12740,
      "SummaryText": " regulating valve and the chlorine cylinder fails, causing a release of liquid chlorine.  An average release rate over a 60-minute period is reported.  As liquid chlorine leaks from the cylinder, the cylinder pressure will drop causing a proportional decrease in the release rate.  No mitigation measures were considered for this scenario.  It is not likely that this alternative release scenario would occur.\n\nSulfur dioxide is introduced into the process through a vacuum controlled regulating valve on the cylinder in service.  If the vacuum is lost for any reason, the valve will automatically close preventing a release of sulfur dioxide.  For purposes of this RMP, it is assumed that the gasket between the vacuum controlled regulating valve and the sulfur dioxide cylinder fails, causing a release of liquid sulfur dioxide.  An average release rate over a 60-minute period is reported.  As liquid sulfur dioxide leaks from the cylinder, the cylinder pressure will drop causing a proportional decrease in the release rate.  No mitigation measures were considered for this scenario.  It is not likely that this alternative release scenario would occur.  \n\nThe residential populations for the worst-case release scenarios were estimated using the Landview III Environmental Mapping Software developed by the U.S. Department of Commerce.  The residential populations for the alternative scenarios were estimated by actual visual observation of the potentially affected areas.\n\nThe WWTP has safely operated the present chlorine and sulfur dioxide process equipment since they were installed.  The processes are not operated during the winter months.  Every spring before restarting the two systems, all operators receive review training and all equipment is thoroughly inspected, tested and, if necessary, serviced or replaced prior to start up.  The equipment for both systems is included in the facility's computerized preventative maintenance program and is regularly inspected, tested and, if n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12740,
      "SummaryText": "ecessary, serviced or replaced during the operating seasons.  \n\nThe number of full-time employees at the site  includes 50 workers at the Division of Environmental Services including the WWTP and 40 solid waste, garage and sewer workers.  The latter group spends most of their time off-site.  For purposes of the RMP, it was assumed that the latter group spends at most half of their time on-site and were treated as 40 half-time employees or 20 full-time employees.  Therefore, the total number of full-time employees is reported as 70.\n\nThe facility is included in the St. Joseph County Local Emergency Planning Committee's community emergency  response plan and has procedures for notifying local emergency responders in the event of an accidental release."
    }
  ]
}