{
  "FacilityID": 12834,
  "FacilityName": "OSRAM SYLVANIA Products, INC.",
  "FacilityStr1": "1128 Rooosevelt Avenue",
  "FacilityStr2": null,
  "FacilityCity": "York",
  "FacilityState": "PA",
  "FacilityZipCode": "17404",
  "Facility4DigitZipExt": "2348",
  "FacilityCountyFIPS": "42133",
  "LEPC": "York County LEPC",
  "FacilityLatDecDegs": "39.975",
  "FacilityLongDecDegs": "-76.758333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "C1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 31746456,
  "ParentCompanyName": "OSRAM SYLVANIA, INC.",
  "Company2Name": null,
  "CompanyDUNS": 1495928,
  "Company2DUNS": null,
  "OperatorName": "OSRAM SYLVANIA, INC.",
  "OperatorStr1": "1128 Rooosevelt Avenue",
  "OperatorStr2": null,
  "OperatorCity": "York",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "17404",
  "OperatorZipCodeExt": "2348",
  "FTE": 350,
  "OtherEPAFacilityID": "17404GTPRD1128R",
  "EPAFacilityID": "100000136541",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "Not assigned",
  "SafetyInspectionDate": "1993-01-15 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2006-11-22 00:00:00",
  "DeRegistrationEffectiveDate": "2006-11-15 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.97498,
  "FRS_Long": -76.75486,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "bulk tank was totally drained of all anhydrous ammonia liquid & vapors",
  "_processes": [
    {
      "ProcessID": 17240,
      "AltID": "NH3 storage/dissociators",
      "FacilityID": 12834,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 21578,
          "ProcessID": 17240,
          "ChemicalID": 56,
          "Quantity": 44000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 17665,
          "ProcessID": 17240,
          "NAICSCode": "332116",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 17666,
          "ProcessID": 17240,
          "NAICSCode": "335122",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 9065,
              "Process_NAICS_ID": 17666,
              "SafetyReviewDate": "1997-05-04 00:00:00",
              "PHA_Date": "1997-01-24 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "Yes",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1997-05-28 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": "falling objects, lightning, sabotage",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Partial enclosure (roof over storage tank)",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Installation of ballards (storage tank), and remote shutoffs and exposion proof ventilation fan (dissociator room); operator policy improvements, upgrade of dissociator room piping,",
              "OpProceduresReviewDate": "1997-04-29 00:00:00",
              "TrainingReviewDate": "1997-05-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Staged release and response coordinated with LEPC",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-30 00:00:00",
              "EquipmentInspectionDate": "1999-04-30 00:00:00",
              "EquipmentTested": "Storage tank, dissociator vessels, ammonia piping systems, pressure relief valves, manual and other (e.g. solenoid) valves, temperatur and pressure indicators, switches, sensors, fixed structures.",
              "ChangeMgmtDate": "1997-03-31 00:00:00",
              "ChangeMgmtReviewDate": "1997-05-04 00:00:00",
              "PreStartupReviewDate": "1997-05-04 00:00:00",
              "ComplianceAuditDate": "1997-04-03 00:00:00",
              "AuditCompletionDate": "1997-05-21 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1997-04-29 00:00:00",
              "HotWorkPermitReviewDate": "1999-02-15 00:00:00",
              "ContractorSafetyReviewDate": "1998-07-29 00:00:00",
              "ContractorSafetyEvalDate": "1997-04-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 12484,
                  "PreventionProgram3ID": 9065,
                  "ProcessChemicalID": 21578
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12834,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-05-11 00:00:00",
    "ERTrainingDate": "1997-05-01 00:00:00",
    "CoordinatingAgencyName": "York County Emergency Mgmt. Agency",
    "CoordinatingAgencyPhone": "7178407494",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12834,
      "SummaryText": "EXECUTIVE SUMMARY\n\nAccidental Release Prevention and Emergency Response Policies\nOSRAM SYLVANIA'S Risk Management Plan provides a unified approach to prevent accidental releases of chemicals through the integration of engineering controls, administrative controls and administrative procedures.  All applicable procedures from the U.S. Environmental Protection Agency (EPA) Prevention Program are adhered to.  The OSRAM Sylvania emergency response program involves the preparation of response plans designed specifically for the OSRAM Sylvania facility located in York, PA and to the emergency response services available in the community as detailed in the OSRAM Sylvania Off-Site plan submitted and approved by the York County Local Emergency Planning Commission (LEPC).  The plan is also in compliance with the EPA Emergency Response Program requirements.\n\nStationary Source and Regulated Substances Handled\nThe OSRAM Sylvania facility, located at 1128 Roosevelt Avenue manufactures light bulb bases, audio cable connector system, components for the CRT industry and precision metal stampings.  Anhydrous ammonia is dissociated and is used as a furnace atmosphere in one of the processes.  The anhydrous ammonia system includes a bulk tank, process piping, various safety & monitoring systems and two electric fired dissociators.  This system is typically unmanned, but is monitored daily by plant security personnel.  The system undergoes a rigorous inspection on a monthly basis.  Maintenance employees are on staff to respond to any alarms and to maintain the system.\n\nThe offsite consequence analysis includes consideration of two release scenarios for this chemical, the worst case scenario and an alternate case scenario.  The worst case scenario is defined by EPA and states that the owner or operator shall assume that the \u0005 maximum quantity in the largest vessel \u0005 is released as a gas over 10 minutes, due to an unspecified failure.  The alternate case scenario is defined as more"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12834,
      "SummaryText": "ning.  Professional responders from both West Manchester Township and York City Fire Department were invited and attended the three day training.   The training culminated with a drill involving live release of anhydrous ammonia.  The drill was observed by OSRAM Sylvania management, officials from both West Manchester Township and York City Fire Departments and officials from EPA.\n^ Installation of explosion proof ventilation fan in the dissociator room to provide quick evacuation of internal releases (allowing quicker emergency response actions) and also for temperature control within the room.\n^ Installation of remote shutoff valves to allow shutdown of dissociator room equipment from a safe location.\n\nPlanned Changes\nIn addition to the completed changes listed above, one additional change is planned.  To meet production needs in the event that the bulk tank was temporarily removed from service, the facility had evaluated (during the Process Hazard Analysis) and planned provisions for a connection to a road trailer to supply the system with Anhydrous Ammonia.  Administrative plans would allow the vendor to drop the trailer during this short period of time.  However, in the interest of public and employee safety, administrative plans will be changed.  The vendor will not be allowed to drop the trailer, and the tractor must remain coupled with the trailer for the duration of this temporary fill procedure."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12834,
      "SummaryText": "likely to occur than the worst case release scenario.\n\nWorst and Alternate Case Scenarios\nAnhydrous Ammonia\n  Atmospheric dispersion modeling has been performed to determine the potential distance traveled by the anhydrous ammonia before its concentration decreases to the toxic endpoint specified in 40 CFR Part 68 Appendix A, which is 0.14 mg/L of air (200 ppm).  The residential population within a circle with a radius corresponding to the toxic endpoint distance has to be defined, to estimate the population potentially affected.\n\nThe worst case scenario involves a failure of the bulk ammonia tank, containing 44,410 lbs. of ammonia, released as a gas over a 10-minute period.  EPA mandated meteorological conditions, namely Stability F, wind speed of 1.5 meters per second, highest daily temperature of 98oF (as supplied from 1995-1997 PADEP York COPAM Station data), and average humidity of 68% (three year average of 1996-1998 as supplied by the PADEP COPAM Station) were used for the worst case scenario.   The facility is located in a densly populated area, therefore the worst case scenario would encompass population receptors.\n\nThe alternate case scenario involves a breech (20% rupture) in the one-inch liquid ammonia line at a connection during a tanker transfer.  A conservative duration time factor of 15 minutes was used to account for the time it may take the operator of the tanker to become aware of the release and to pull the emergency stop lever.  Meteorological conditions used for the alternate case scenario were ambient wind speed of 3 m/s, temperature of 98oF, atmospheric stability class D and relative humidity of 68%.  The alternate case scenario would also affect offsite population and environmental receptors.\n\nGeneral Accidental Release Prevention Program and Prevention Steps \nThe general accidental release program for anhydrous ammonia is as follows:\n7 Safety training for employees who maintain and inspect the system.\n7 Effective, detailed procedures"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12834,
      "SummaryText": "for maintenance, operation and troubleshooting of the systems.\n7 Preventative maintenance programs to maintain a good mechanical integrity of the system.\n7 The Management of Change program identifies potential concerns before system changes are implemented.\n7 Detailed inspection program to identify potential concerns before they become a problem.  The inspection program includes low level leak detection activities.\n7 A compliance audit program that meets the criteria of OSHA's PSM standard (29 CFR 1910.119).\n7 For anhydrous ammonia, a chemical sensing system set to very low levels will provide early warning in the event of a release\n7 Chemical specific prevention steps for anhydrous ammonia include Level A, Level B and Level C personal protection equipment to be used for emergency response and certain other activities; training of emergency responders and maintenance employees on the toxic and physical properties of ammonia; the chemical sensing system and other safety systems; and the training of (Security) daily monitoring employees to the OSHA First Responder (8-hour) level.\n\nFive Year Accident History\nThere have been no accidental releases of anhydrous ammonia within the past five years.\n\nEmergency Response Program\nOSRAM Sylvania has a comprehensive emergency response plan, including an Off-Site plan that has been approved by the York County Local Emergency Planning Commission (LEPC).  OSRAM Sylvania has emergency responders trained at the 24-hour technician level (OSHA HAZWOPER standard).  These responders are trained to handle releases of anhydrous ammonia.  Response plans for handling on-site releases of anhydrous ammonia exist.  The emergency response team is well equipped with chemical sensing equipment; personal protective equipment; offensive and defensive strategy tools & equipment; radio communication; pre-determined response checklists for Incident Command, Safety/Science Officer and Decon Officer; emergency decon and medical supplies; and decon suppli"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12834,
      "SummaryText": "es.  All OSRAM Sylvania emergency response teams (fire, chemical and other emergency situations) use the Incident Command System.  This system includes provisions for interaction and support with off-site professional emergency responders.\n\nA Process Hazard Analysis (PHA) meeting the criteria of OSHA's PSM standard 29 CFR 1910.119 was conducted for the anhydrous ammonia system.\n\nThe FMECA (Failure Mode & Effects Criticality Analysis) method was used to analyze the anhydrous ammonia system.  A team consisting of safety and environmental professionals, an area supervisor, process engineers, an hourly employee and an electrician analyzed the ammonia system.  In regards to the mechanical integrity portion of PSM, the standard ANSI K-61.1 was used to evaluate the safety and integrity of the system.  Numerous procedures were created and many engineering improvements were made to improve the safety and reliability of the system.  A brief list of some of the changes made are listed below.\n^ Replacement of an older dissociator with a modern unit.\n^ Replacement and upgrade of all process piping within the dissociator room to comply with ANSI K-61.\n^ Purchase of additional emergency response equipment to allow quicker, more effective responses to releases.\n^ Installation of a chemical sensing system at both the bulk tank and the dissociator room to provide an early detection means.\n^ Installation of a catwalk on the bulk tank to provide easy access to relief valves and process piping on top of the tank for maintenance and emergency response activities.\n^ Installation of additional bollards to prevent vehicular traffic from striking the tank.\n^ Use of a third party, independent consultant to conduct a PSM compliance audit.\n^ Improvements to numerous policies and procedures, such as Hazard Communication, Hot Work Permits and Line Breaking Permits.\n^ Specific emergency response training for ammonia response, conducted by the Ammonia Vendor and the Ammonia Institute of Safety Trai"
    }
  ]
}