{
  "FacilityID": 12952,
  "FacilityName": "Oberly Pumping Station",
  "FacilityStr1": "6198 66th Street North",
  "FacilityStr2": "N/A",
  "FacilityCity": "St. Petersburg",
  "FacilityState": "FL",
  "FacilityZipCode": "33709",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12103",
  "LEPC": "District 8 LEPC",
  "FacilityLatDecDegs": "27.827222",
  "FacilityLongDecDegs": "-82.729861",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.stpete.org",
  "FacilityEmailAddress": "DEHENDER@stpete.org",
  "FacilityDUNS": 73194920,
  "ParentCompanyName": "City of St. Petersburg",
  "Company2Name": "N/A",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of St. Petersburg",
  "OperatorStr1": "1635 Third Avenue North",
  "OperatorStr2": "N/A",
  "OperatorCity": "St. Petersburg",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33713",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000043393",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-08-27 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-06-24 00:00:00",
  "DeRegistrationEffectiveDate": "2019-06-17 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 27.8285,
  "FRS_Long": -82.72832,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17408,
      "AltID": null,
      "FacilityID": 12952,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 21782,
          "ProcessID": 17408,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 17838,
          "ProcessID": 17408,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 9169,
              "Process_NAICS_ID": 17838,
              "SafetyReviewDate": "1998-12-01 00:00:00",
              "PHA_Date": "1999-05-21 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "leak detector, exhaust fan",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-07-10 00:00:00",
              "TrainingReviewDate": "1999-12-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1997-01-14 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "chlorine leak detectors",
              "ChangeMgmtDate": "1998-07-24 00:00:00",
              "ChangeMgmtReviewDate": "1999-12-01 00:00:00",
              "PreStartupReviewDate": "1998-07-10 00:00:00",
              "ComplianceAuditDate": "1999-05-24 00:00:00",
              "AuditCompletionDate": "1999-06-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-12-01 00:00:00",
              "HotWorkPermitReviewDate": "1998-12-01 00:00:00",
              "ContractorSafetyReviewDate": "1998-12-01 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 12621,
                  "PreventionProgram3ID": 9169,
                  "ProcessChemicalID": 21782
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12952,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-06-03 00:00:00",
    "ERTrainingDate": "1998-06-11 00:00:00",
    "CoordinatingAgencyName": "Pinellas County Fire Department",
    "CoordinatingAgencyPhone": "7278937641",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12952,
      "SummaryText": "EXECUTIVE SUMMARY\nCity of St. Petersburg Water Treatment Facilities\n\nIntroduction and Background\n\nThe USEPA's Clean Air Act Amendments of 1990 included provisions that require facilities that use certain substances to develop a plan to reduce the likelihood of an accidental release of the substances to the atmosphere and reduce the likelihood of serious harm to the public and the environment. The plan must also include mitigation measures to reduce the potential impact on the public in the unlikely event of a release. The requirements of this plan, commonly referred to as a Risk Management Plan (RMP), are detailed and codified in 40 CFR Part 68.\n\nThe City of St. Petersburg Public Utilities Department, Division of Water Supply consists of three water treatment facilities: the Cosme Water Treatment Plant (WTP), the Oberly Pump Station and the Washington Terrace Pump Station.  These three facilities store chlorine in quantities above the regulatory thresholds at which a RMP/PSM is required. Chlorine is used to disinfect the water prior to distribution.\n\nThe RMP/PSM consists of three compliance programs, each with progressively stricter compliance standards. The chlorination process at the water treatment facilities are subject to Program 3, the most stringent of the three programs, because the facilities are subject to the OSHA Process Safety Management (PSM) Standards and a worst-case release of chlorine could affect the public.\n\nThe RMP/PSM consists of three major parts. The first part is the Hazard Assessment. The Hazard Assessment is done to determine the effects that a release of a regulated substance could have on the public. The second part is a Prevention Program that consists of 12 elements designed to improve the system safety and decrease the likelihood of a release. The third part is the Emergency Response Program, which develops a plan for dealing with a release in the unlikely event that one would occur. Because the regulations are very similar, the Preve"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12952,
      "SummaryText": "ntion Program and the Emergency Response Program also serve as the OSHA PSM plan, and this document is therefore referred to as the RMP/PSM plan.\n\nAs part of the RMP, a submittal to the USEPA is required which is referred to as RMP/PSM Submit.\n\nHazard Assessment\n\nA Hazard Assessment was performed to determine the effects a release would have on the public. For chlorine, the distance a set endpoint concentration of the gas would travel must be determined. In addition, an estimate of the population that could be affected by a release of chlorine was determined and sensitive receptors such as hospitals, schools, and nursing homes were identified. The Hazard Assessment considers two release scenarios-a \"worst case\" and an \"alternative case.\" \n\nWorst-Case Scenario\n\nThe regulations require the development of a worst-case release scenario based on conservative assumptions. For example, it is required to assume that the entire contents of the largest single container of chlorine will be released over 10 minutes. For the St. Petersburg facilities, it is assumed that an entire one-ton cylinder of chlorine is released over 10 minutes.  This is unlikely to occur since the properties of chlorine would cause a freeze and thaw cycle to occur at the leak, which would slow the release. In addition, only \"passive\" mitigation methods such as buildings or dikes can be considered when determining the distance the release could travel. Passive mitigation, as defined, requires no mechanical, electrical, or human input. However, in many scenarios mitigating the release by isolating the process could reduce the amount released. In addition, the worst-case scenario requires that conservative atmospheric conditions be assumed which results in a large area of impact. \n\nThe hazard assessment requires that the \"toxic endpoint\" or distance from the point of release to a location at which the chemical concentration equals or exceeds a certain concentration be determined. That concentration is defi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12952,
      "SummaryText": "ned as the maximum airborne concentration below which individuals could be exposed for up to 1 hour without experiencing or developing irreversible or other serious health effects, or symptoms that could impair an individual's ability to take protective action. Because the cloud from a chlorine leak would disperse relatively quickly, an individual at a toxic endpoint would be exposed to the exposure limit concentration for much less than the 1 hour assumed by the limit. In addition, the exposure limit concentrations result in relatively minor health effects. Therefore, an individual at the toxic endpoint would be affected less than the results of the worst-case scenario may imply.\n\nThe model used for the worst-case scenario determined the distance at which the chemical's concentration was 3 ppm or greater (the toxic endpoint for chlorine).  Based upon the model results, the worst-case scenario distance was determined to be 1.09 miles for the Cosme WTP, 1.02 miles for the Oberly Pump Station and 1.01 miles for the Washington Terrace Pump Station.\n\nAlternative Scenario\n\nThe RMP rule also requires that at least one alternative release scenario be evaluated for chlorine. The alternative scenarios reflect a type of release that is more likely to occur compared to the worst-case scenario. Unlike the worst-case scenario, the alternative release scenario may consider \"active\" mitigation such as shutoff valves and a more realistic release quantity and release rate. Active mitigation is defined as requiring mechanical, electrical, or human input. Lastly, it assumes local, typical meteorology, which is more realistic than the conservative meteorological conditions that must be assumed for the worst-case scenario. \n\nTwo alternative release scenarios were investigated for chlorine at each of the St. Petersburg facilities.  In the case of the pump stations, the alternative release scenarios for chlorine were a release through a vacuum regulator pressure release valve and a one-to"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12952,
      "SummaryText": "n cylinder fusible metal plug rupture.  In the case of the treatment plant, the alternative release scenarios occurred through a flexible connector break and through a corrosion leak in the chlorine gas piping or piping joint.  The alternative release scenario is considered to be more representative of the effects likely in the event of a release.  The results of the alternative release scenarios are presented in Table 1 below.\n\n\nTable 1 City of St. Petersburg Results of Alternative Release Scenarios\n\nFacility/Scenario               Toxic Endpoint (miles)\n\nCOSME WTP\nFlexible Connector Failure         0.20\nCorrosion Leak                          0.22\n\nOBERLY PS\nVacuum Regulator Release     0.20\nFusible Plug Rupture                0.38\n\nWASHINGTON TERRACE PS\nVacuum Regulator Release     0.20\nFusible Plug Rupture                0.39\n\n\nPrevention Program\n\nThe Prevention Program, together with the Emergency Response Program and Hazard Assessment, make up the RMP/PSM. The Prevention Program consists of 12 elements designed to improve the system safety and decrease the likelihood of a release.\n\nEmployee Participation\n\nThe participation of the City of St. Petersburg water treatment facility staff in preparing the RMP/PSM program was critical to the program's successful implementation. Employee participation is valuable because it increases the safety awareness of the staff and it allows the staff's experience in operating and maintaining the processes to be incorporated into the plan.\n\nWater treatment facility staff participated in the development of the Prevention Program through a series of meetings and workshops, as well as the Process Hazard Analysis described below. All facility staff received awareness training that instructed staff on how the RMP/PSM requirements may impact their jobs, an overview of each of the RMP/PSM plan elements and the procedures that must be followed to comply with the requirements of the RMP/PSM plan.\n\nProcess Safety Information\n\nThe RMP regu"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12952,
      "SummaryText": "lations require that information concerning process chemicals, technology, and equipment be compiled as part of an RMP program. Emergency response planners can use such information to develop training programs and procedures, or as a general resource. The information will be supplied to contractors who will work in the chlorine process area as part of the requirements outlined in the Contractors element. All the required process safety information was compiled as required by the RMP regulations. The information meets and in many cases exceeds the minimum required by the regulations.\n\nProcess Hazard Analysis\n\nA process hazard analysis (PHA) was systematically conducted to evaluate potential causes and consequences of accidental releases. This information was used by water treatment facility staff to improve safety and reduce the consequences of accidental releases. Equipment, instrumentation, utilities, human actions, and external factors that might affect the process were the focus of the PHA.\n\nA Process Hazard Analysis team was assembled within the Division of Water Supply. The chlorine PHA was conducted by a team of water treatment facility staff familiar with the process operation and maintenance and facility management. The PHA team has expertise in engineering, chlorine process and operation and chlorine process hazard analysis methodology. \n\nThe PHA was done using a combination of \"What-If\" and \"Checklist\" methods. Based on the results of the PHA, changes in operating, maintenance, and other process safety management procedures that would improve the overall safety of the water treatment facilities were identified. The changes that most affect the severity and likelihood of a release have been adopted by the facilities and incorporated as part of the overall Process Safety Management Program. Other improvements and process modifications to reduce or eliminate potential hazards are scheduled to be implemented or incorporated.\n\nOperating Procedures\n\nOperating pr"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 12952,
      "SummaryText": "ocedures for the chlorination process have been developed as part of the RMP/PSM. Written operating procedures assure continuous, efficient, and safe operation of the facility. The goal of the operating procedures is to provide clear instructions to safely operate the process. Operating procedures are also used to train new employees and to provide refresher training for existing staff.\n\nThe detailed operating procedures include startup, shutdown and emergency operating procedures. The procedures describe how the system should be operated in order to minimize the chances of an accidental release. The procedures also emphasize safety considerations during operation and address hazardous situations that can occur and how to correct them.\n\nTraining\n\nAn effective RMP/PSM training program can significantly reduce the number and severity of accidental releases. Employees involved in operating or maintaining the chlorination process must receive training that includes applicable operating and maintenance procedures and an overview of the process. Training must emphasize safety and health hazards and safe work practices.\n\nCity of St. Petersburg water treatment facility staff have received initial training on the operations and maintenance of the regulated processes through on-the-job training. Staff who operate and maintain the RMP/PSM processes were trained how to safely maintain and operate the processes.  The Division of Water Supply certifies each of the Water Plant Operators and Maintenance personnel on the safe handling of chlorine and emergency response annually through the Chlorine Responder Certification Program.  The Public Utilities Department, Office of Training and Safety gives annual training on equipment lock-out/tag-out procedures, confined space entry procedures and hot work permit procedures.  \n\nContractors\n\nThe City's water treatment facilities must make contractors aware of the known hazards of the chlorine process related to the contractors' work. In ad"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 12952,
      "SummaryText": "dition, the water treatment facilities must make contractors aware of the applicable elements of its emergency response plan. The City should screen for contractors that can perform work on or adjacent to the chlorine process without compromising the safety and health of employees at the facility. \n\nThe City must obtain and evaluate information regarding the contractor's safety performance and programs before allowing a contractor to work on or adjacent to the chlorine process. When a contract involving work on or adjacent to the chlorine process is to be bid, the bidding procedures must ensure that contractor safety management requirements are met.  To make the contractor aware of the water treatment facilities RMP/PSM plan requirements, a safety briefing must be conducted before work begins in or adjacent to any covered process. Upon arriving at the facility for the first time to perform work, the contractor will be presented a Contractor Safety Management Briefing Form that must be read and signed. \n\nPre-startup Review\n\nA pre-startup safety review must be conducted for any new covered process or for significant modifications to the existing chlorine process that necessitate a change in the process safety information. No new or significantly modified process will start up and no acutely hazardous chemicals will be introduced into such a process prior to the pre-startup safety review. The purpose of the pre-startup safety review is to ensure that the facility is ready to operate new and modified regulated processes safely. \n\nTo initiate the pre-startup safety review, all updated elements of the Process Safety Management Plan are assembled for review. This includes all process safety information, process hazard analysis, operating procedures, employee training and mechanical integrity records. The pre-startup safety review team should complete and sign a Pre-startup Safety Review Form. This form documents the process, and helps ensure that the review has been proper"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 12952,
      "SummaryText": "ly performed. The Pre-startup Safety Review Form must be authorized before startup.\n\nMechanical Integrity\n\nAn effective mechanical integrity program is one of the primary lines of defense against a release. The mechanical integrity program addresses equipment testing and inspection, preventive maintenance schedules, and personnel training. The intent is to ensure that equipment used to process, store, or handle chlorine is maintained and installed to minimize the risk of releases.\n\nThe City's water treatment facility maintenance staff has a mechanical integrity program that includes equipment and instrumentation identification, maintenance, testing and inspection schedules, personnel training and maintenance documentation. Preventive maintenance is scheduled based on equipment manufacturers' recommendations published in their operation and maintenance (O&M) manuals.  In addition to preventive maintenance, water treatment facility staff performs corrective maintenance in the event of equipment malfunction or breakdown. Work orders indicate what safety precautions must be followed including whether lockout/tagout or confined space entry provisions are applicable. \n\nHot Work Permits\n\nRMP/PSM regulations require employees and contractors to employ safe work practices when performing \"hot work\" in, on, or around the chlorine process. To ensure that hot work is done safely, a Hot Work Permit Program has been developed that requires a permit to be issued before hot work is performed. Examples of such work include but are not limited to: welding, cutting, grinding, brazing and operating flame- or spark-producing operations.\n\nThe hot work permit requires the identification of hazards and appropriate safeguards, as well as the implementation of the safeguards to ensure a fire-safe workplace. \n\nManagement of Change\n\nA system for the proper management of changes and modifications to equipment, procedures, chemicals, and processing conditions is required under the RMP/PSM. Modif"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 12952,
      "SummaryText": "ications to the chlorine system will be reviewed before they are implemented to determine if the modification would compromise system safety. An effective change management system will help minimize the chance for an accidental release.\n\nIf a modification covered under RMP/PSM is made, its effects must be addressed, employees must be informed, and the written procedures must be updated. The intent is to require that all modifications to equipment, procedures, and processing conditions other than \"replacement in kind\" be managed by identifying and reviewing them before implementation. A Management of Change Evaluation Form will be completed and evaluated for any modifications that are covered under the RMP/PSM. The Management of Change Form will be evaluated by the Chief Water Plant Operator who will authorize the change prior to its initiation.  A Notification of Process Change Checklist is also completed prior to system modification.\n\nIncident Investigation\n\nEach incident that resulted in or could reasonably have resulted in a catastrophic release (i.e. a release that results in death or permanent injury) of chlorine must be investigated. A process to identify the underlying causes of incidents and to implement procedures for preventing similar events has been developed. To investigate an incident, an Incident Investigation Review Committee will be established. As part of the investigation, an Incident Report Form will be prepared to recommend system changes.\n\nThe investigation team should ask questions such as what equipment failed, which behavior failed, and which material leaked, reacted, or exploded? As part of the incident review, staff actions that may have contributed to the incident will also be reviewed. A determination will be made as to whether it is necessary to institute additional training for the employees to prevent the incident from occurring in the future. On the Incident Report Form, the Chief Water Plant Operator identifies which of the recommen"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 12952,
      "SummaryText": "ded system changes are approved for implementation. The incident investigation report and any changes resulting from the report will be reviewed with all staff members who operate and maintain the applicable system. \n\nCompliance Audit\n\nThe City of St. Petersburg's water treatment facilities are required to complete a compliance audit for the RMP/PSM program. The primary goals of conducting an internal compliance audit are to gather sufficient data to verify compliance with RMP/PSM requirements and good process safety practices, identify process safety deficiencies and develop corrective actions, and increase safety awareness among facility staff.\n\nThe compliance audit methodology is modeled after OSHA's guidelines for conducting regulatory PSM compliance audits: Compliance Guidelines and Enforcement Procedures, OSHA Instruction CPL 2-2.45A (September 28, 1995). An internal compliance audit must be conducted at the facility at least once every 3 years for the chlorine process. A team that includes at least one person knowledgeable in the covered processes and an audit leader knowledgeable in RMP/PSM requirements and audit techniques will conduct the audits. The Chief Water Plant Operator and the audit team will promptly determine an appropriate corrective action for each deficiency identified during the audit and document the corrective actions and the dates by which they must be taken.\n\nEmergency Response Program\n\nThe Emergency Response Program develops a plan for dealing with a chlorine release. OSHA Process Safety Management regulation 29 CFR 1910.119(n) and EPA RMP regulation 40 CFR 68 Subpart E require that an Accidental Release Emergency Response Plan be prepared. The plan must be prepared in accordance with the provisions of another overlapping OSHA regulation-Employee Emergency Plans (29 CFR 1910.38(a)). In addition, provisions of the OSHA hazardous waste and emergency response standard, 29 CFR 1910.120 (q), must also be considered. The Emergency Planning and"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 12952,
      "SummaryText": " Response Plan described in this section complies with the requirements of 40 CFR 68.95, 29 CFR 1910.38(a), and 29 CFR 1910.120(q). \n\nAn Emergency Planning and Response Plan must be developed that provides employees with guidance on how to protect public health and the environment in case of a chemical discharge emergency.  The emergency response procedures cover a release from the initial alarm stage through either leak stoppage or hazmat assistance. As part of the emergency response procedures there are plans for victim rescue, leak investigation, and communication with additional support agencies. In addition, critical facility operations are identified to insure that, if possible, the critical water treatment facility functions are kept operational. The Emergency Planning and Response Plan also indicates the level of training needed to complete the emergency response procedures. \n\nInformation regarding self-contained breathing apparatus is also provided in the plan. It also addresses facility site communication, emergency response equipment, first aid and medical treatment, medical surveillance and consultation, and emergency response drills.\n\nThe City has developed a comprehensive Emergency Response Program that fully satisfies RMP/PSM requirements. The procedures are outlined in the Public Utilities Department Safety Rule 2.06, Chlorine Handling Procedures (Emergency Notification and Evacuation).  According to the ERP, all water treatment facility personnel are HAZMAT trained in order to function as first responders in the event of a chlorine release. Pinellas and Hillsborough County HAZMAT teams will also be called upon to assist. However, at the Oberly Pumping Station, personnel (normally operated with one employee) will only respond to accidental releases of 10 pounds of chlorine or less. In the event of a larger release, personnel will assemble at a designated location for evacuation of the facility after notifying the proper authorities. The same procedur"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 12952,
      "SummaryText": "es are pertinent to the Washington Terrace Pumping Station, although normally this facility is unmanned. Evacuation of areas surrounding each facility, if necessary, is a responsibility of local police and fire departments.  \n\nSummary\n\nThe USEPA's Clean Air Act Amendments of 1990 included provisions that require facilities that use certain substances to develop a plan to reduce the likelihood of an accidental release of the substances to the atmosphere and reduce the likelihood of serious harm to the public and the environment.  \n\nCity of St. Petersburg WTP staff participated in the development of the Prevention Program through a series of meetings and workshops.  All the required process safety information was compiled as required by the RMP regulations. PHA information was used by WTP staff to improve safety and reduce the consequences of an accidental release. Operating procedures for the chlorination process have been developed. Staff have received initial training on the operations and maintenance of the regulated processes.   \n\nAdditional RMP/PSM plan elements that have been completed include the development of a Contractor Safety Management Briefing Form, Hot Work Permit Program, Management of Change Evaluation Form, Incident Report Form, completion of a compliance audit and the performance of preventive and corrective maintenance.  The City has also developed a comprehensive Emergency Response Program that fully satisfies RMP/PSM requirements. \n\nThere were no reportable accidents at the Cosme WTP, Oberly Pump Station and Washington Terrace Pump Station between June 21, 1994, and the present date."
    }
  ]
}