{
  "FacilityID": 13010,
  "FacilityName": "City of Ukiah Wastewater Treatment Plant",
  "FacilityStr1": "300 Plant Rd.",
  "FacilityStr2": "300 Seminary Ave.",
  "FacilityCity": "Ukiah",
  "FacilityState": "CA",
  "FacilityZipCode": "95482",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06045",
  "LEPC": null,
  "FacilityLatDecDegs": "39.118611",
  "FacilityLongDecDegs": "-123.191111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "P2",
  "LatLongDescription": "SW",
  "FacilityURL": null,
  "FacilityEmailAddress": "ukiahstp@jps.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Ukiah",
  "Company2Name": "NA",
  "CompanyDUNS": 74642893,
  "Company2DUNS": 0,
  "OperatorName": "City of Ukiah",
  "OperatorStr1": "300 Plant Rd.",
  "OperatorStr2": "300 Seminary Ave.",
  "OperatorCity": "Ukiah",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95482",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jerry Gall",
  "RMPTitle": "Lead Senior Operator",
  "FTE": 8,
  "OtherEPAFacilityID": "1B230105011",
  "EPAFacilityID": "100000071511",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-28 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-03-09 00:00:00",
  "DeRegistrationEffectiveDate": "2003-03-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.11278,
  "FRS_Long": -123.19028,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17499,
      "AltID": "22132",
      "FacilityID": 13010,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 17932,
          "ProcessID": 17499,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 21894,
          "ProcessID": 17499,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 521894,
          "ProcessID": 17499,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13010,
      "SummaryText": "City of Ukiah WWTP Executive summmary.\n1. Accidental release prevention and emergency response policies\nThe City of Ukiah Wastewater Treatment Plant uses chlorine for treatment and disinfection of wastewater effluent The same properties that make chlorine useful as a disinfectant also make it necessary to observe safety precautions in handling and dispensing chlorine, in order to prevent exposure to plant personnel and the community. It is our policy to adhere to all applicable Federal, State, and local regulations.   Safety is dependant upon the manner in which we handle chlorine, the safety devices inherent in the design of this facility and the training of our personnel. Our emergency response program is based upon continuous monitoring for chlorine leaks on site, training of staff, and coordination with the City of Ukiah Fire Department and other public safety agencies.                                                                      \n2. Sationary sourse and regulated substances handled.\nThe purpose of this facility is to treat sewage from the City of Ukiah and the Ukiah Valley Sanitation District. Access to the site is restricted to plant personnel and other authorized city employees, authorized contractors, and authorized visitors.\n   The regulated substance handled at this facility is chlorine, C.A.S.# 7782-50-5. Up to twelve one ton cylinders and ten 150 pound cylinders may be stored in the chlorine room. Chlorine is also dispensed in this room. All stored cylinders are chained securely to individual support structures in case of earthquake. The chlorine gas feed system is designed to stress safety. It is an all vacuum system consisting of a cylinder mounted vacuum regulator, manual and automatic gas flow controls, and a remote ejector/check valve assembly. This system also has an emergency vent which discharges to a chlorine gas scrubber. The chlorine room is continuously monitored for chlorine leaks. The leak detector is tied to the plant alarm system "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13010,
      "SummaryText": "and the chlorine scrubber. In the event of a leak the scrubber and alarm systems are automatically activated. The plant alarm is relayed to an on call plant operator, who will respond along with the City of Ukiah Fire Department.\n3. The worst case scenario and the alternate release scenario, including administrative controls and mitigation measures to limit the distance for each reported scenario.\n    Worst case scenario: Failure of a one ton chlorine cylinder would release 2,000 pounds of chlorine. It is assumed that the entire contents of the cylinder are released as a vapor, which is heavier than air. The distance to the toxic endpoint of 0.0087 milligrams per liter is estimated to be 1.3 miles from the leak. \n    Alternative release scenario: A one ton chlorine cylinder's valve stem packing fails, releasing chlorine gas into the chlorine room. At a chlorine concentration of 2.0 milligrams per liter within the room the chlorine gas detector activates a plant alarm and the standby operator is notified. At 2.5 milligrams per liter the chlorine gas scrubber is automatically activated which begins nutralization of chlorine gas within the room. The chlorine gas scrubber has the capacity to nutralize two tons of chlorine. There is no potential for chlorine to extend past the room. \n4. The genaral accidental release prevention program and the specific prevention steps.\n    This facility complies with the E.P.A.'s accidental release prevention rule and with all applicable State codes and regulations. This facility is operated in accordance with recommendations from the Chlorine Institute. There are eight full time certified wastewater plant  operators, all of whom are trained in the safe use and handling of chlorine. All operators are trained in the use of self contained breathing apparatus, and S.C.B.A. outfits are available on site. Repair kits \"A\" and \"B\" for chlorine cylinders are also on site. A preventitive maintenance program is in place for all equipment. Routine"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13010,
      "SummaryText": " daily inspection of all chlorination equipment is done. \n5. Five year accident history.\n    In the last five years no accidental chlorine leaks have occured. Nor have any injuries, envioronmental damage, or property damage occurred from chlorine. \n6. The emergency response program.\n    A chlorine leak detector is operational and continuously monitors the chlorine room. A fire alarm and intrusion alarm are also operational. Any alarm is relayed to an on call operator who will respond and assess the situation. Additional plant operators, the fire department and emergency services will be dispatched as needed. \n7. Planned changes to improve safety. \n    We plan to install an additional alarm to be activated if the chlorine gas scrubber is not ready to start automatically."
    }
  ]
}