{
  "FacilityID": 13107,
  "FacilityName": "Borden Chemical, Inc. - Vicksburg",
  "FacilityStr1": "Rifle Range Road",
  "FacilityStr2": null,
  "FacilityCity": "Vicksburg",
  "FacilityState": "MS",
  "FacilityZipCode": "39181",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28149",
  "LEPC": "Warren County LEPC",
  "FacilityLatDecDegs": "32.273611",
  "FacilityLongDecDegs": "-90.906389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 942200932,
  "ParentCompanyName": "Borden, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1338797,
  "Company2DUNS": 0,
  "OperatorName": "Borden Chemical, Inc.",
  "OperatorStr1": "P.O. Box 869",
  "OperatorStr2": null,
  "OperatorCity": "Vicksburg",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39181",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000138291",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-08-28 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2002-02-27 00:00:00",
  "DeRegistrationEffectiveDate": "2002-01-15 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.29542,
  "FRS_Long": -90.90611,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17652,
      "AltID": "Formaldehyde Manufacture",
      "FacilityID": 13107,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 22167,
          "ProcessID": 17652,
          "ChemicalID": 1,
          "Quantity": 615000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 18099,
          "ProcessID": 17652,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 9341,
              "Process_NAICS_ID": 18099,
              "SafetyReviewDate": "1999-06-10 00:00:00",
              "PHA_Date": "1999-06-17 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "hand held monitors",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Operator interface upgrade",
              "OpProceduresReviewDate": "1999-04-01 00:00:00",
              "TrainingReviewDate": "1999-04-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-10 00:00:00",
              "EquipmentTested": "Process Startup heater",
              "ChangeMgmtDate": "1999-05-21 00:00:00",
              "ChangeMgmtReviewDate": "1996-03-01 00:00:00",
              "PreStartupReviewDate": "1999-06-10 00:00:00",
              "ComplianceAuditDate": "1998-11-04 00:00:00",
              "AuditCompletionDate": "1999-12-31 00:00:00",
              "IncidentInvestigationDate": "1998-08-01 00:00:00",
              "InvestigationChangeDate": "1999-05-31 00:00:00",
              "ParticipationPlansReviewDate": "1996-03-16 00:00:00",
              "HotWorkPermitReviewDate": "1999-02-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-01-01 00:00:00",
              "ContractorSafetyEvalDate": "1999-01-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "These prevention program elements pertain to the manufacture and storage of formaldehyde and formaldehyde solutions.\n- The dates of the process hazard analyses, which were:  \nformaldehyde manufacture (checklist):  05/31/1995,\nformaldehyde storage and handling (checklist):06/17/1999.",
              "_chemicals": [
                {
                  "PrimaryKey": 12884,
                  "PreventionProgram3ID": 9341,
                  "ProcessChemicalID": 22167
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 13107,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-06-18 00:00:00",
    "ERTrainingDate": "1999-06-20 00:00:00",
    "CoordinatingAgencyName": "Warren County E.P.C",
    "CoordinatingAgencyPhone": "6016361544",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13107,
      "SummaryText": "1. Accidental release prevention and emergency response polices\n\nAs stated in our Worldwide Health, Safety, and Environmental Policy and Principles, Borden Chemical, Inc. is committed to health, safety, and environmental excellence.  To accomplish this we integrate health, safety, and environmental planning into all business activities.  This includes complying with applicable laws, responsibly managing risks, and working collaboratively with others in addressing health safety, and environmental issues.\n\nIn the Borden Chemical, Inc. Safety Manual, the Safety Policy Statement clearly states that safety will not be compromised to achieve any other operational or business objective.  This manual defines requirements and guidelines developed to prevent injuries and accidental releases.  Included in the Safety Manual is Emergency Response Polices that states that safety is the top priority in all emergency response situations.  This policy refers to the plant's Emergency Response Plan for specific procedures for handling releases of hazardous materials. \n\n2. Stationary source and regulated substances handled\n\nThis plant manufactures formaldehyde solutions.  The facility has the capability of producing products ranging from 30 to 50 percent formaldehyde; the balance of the solution is water and methanol. \n\nThe regulated substance used in the plant and the maximum quantities stored are:\n\n Formaldehyde solutions  615,000 lbs. (1,230,000 as 50 % solution)\n\n3.  Worst-Case release scenarios and alternative release scenarios\n\nWorst Case Release Scenario (Toxic)\n\nDue to a rupture in a formaldehyde storage tank, 50,000 gallons of 50% formaldehyde solution spilled into the formaldehyde storage and loading area.  The distance to the EPA toxic endpoint of 0.012 mg/l is 0.42  miles.  \n\nThe area around the tank farm is diked and sloped in a manner that first directs spills and tank overflows to a sump and then into a recovery storage tank.  Although passive mitigation was not consider"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13107,
      "SummaryText": "ed in the worst case scenario, in the event of a real emergency this equipment would direct the spilled material in to a storage tank.  This would allow responders to load the spilled material onto trucks for recovery or offsite disposal with minimal equipment or setup time. \n\nAlternative Release Scenario - Formaldehyde\n\nAs a result of a unloading valve failure, 5,000 gallons of formaldehyde spills from a truck, which is waiting to be shipped.  Due to a common containment area the resulting formaldehyde pool would be very similar to the worst case scenario listed above.  The distance to the toxic endpoint of 0.12 mg/l is 0.18 miles. Due to the low odor threshold of formaldehyde, the spill would be quickly discovered.  The drains and sump pump listed above would also minimize the quantity released as well as the duration of the spill.\n\nAccidental release prevention program and chemical specific prevention steps\n\nThis plant has a comprehensive process safety management program that is in compliance with the EPA Accidental Release Prevention Rule, the OSHA Process Safety Management Standard, and all applicable state codes and regulations.  A safety management system is in place to assure on-going compliance.  This management system includes the Safety Manual, a list of site safety responsibilities, a file system to maintain records of compliance, and a monthly Safety Committee meeting, where a management control checksheet is used to verify that tasks were completed on schedule.  The Plant Superintendent has overall responsibility for this program. \n\nThe plant superintendents duties include keeping operation procedures up-to-date, training operators so they can safely carry out theses procedures, assuring that the plant is run safely on a daily basis and investigating incidents in their unit when necessary.  All employees participate in the safety program through team-based activities to improve safety and plant operation.\n\nAn Operating Guide that includes process safe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13107,
      "SummaryText": "ty information, operating procedures, and a training certification program. Operators use this Operating Guide as a training tool and for reference. By applying the information it contains, their actions will prevent accidental releases.\n\nProcess hazard analyses are conducted on an on-going basis to identify hazards and recommend safeguards that will prevent an accidental release. As a result of initial process hazard reviews, significant investments were made in process control system. An automatic shutdown system is installed that will shut down the plant before a release occurs if safe operating conditions cannot be maintained.\n\n For equipment and procedure changes, a Change Worksheet initiates a safety review. This review may include process hazard analysis.  Training is performed as needed to assure that those affected by the change understand its impact.  Pre-Start-up Safety Reviews are performed to assure that the plant can be started up safely after a significant change is made.\n\nA preventive maintenance program maintains the mechanical integrity of the process equipment. Each month scheduled equipment inspections, tests, or preventive maintenance are performed. The schedule is based on plant experience to reduce the likelihood of an accidental release caused by equipment failure.  An electronic database is used to document these inspections as well as provide useful information for continuous improvement of equipment reliability and performance. \n\nThe requirements in the Safety Manual include safe work practices which prevent accidental releases. One important section describes safety measures for welding or other \"hot\" work, which includes a permit system to reduce the risk of fire. The Safety Manual also includes requirements for locking out equipment for maintenance. These procedures reduce the likelihood that a valving error will lead to a release.\n\nContractors, who periodically perform work in the plant, are given safety orientations to brief them on p"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13107,
      "SummaryText": "lant hazards and safety practices. Contractor safety programs and performance are evaluated prior to their selection for jobs that impact process safety.\n\nIncidents that cause or could have caused a release are investigated and recommendations are made to prevent recurrence. These recommendations may lead to improvements in equipment, procedures, operating conditions, or training.\n\nPeriodically a safety professional from another Borden Chemical location conducts a\ncomprehensive audit of the safety program. Addressing recommendations from this audit keeps the safety program effective.\n\n4. Five-year accident history\n\nThere have been no accidents or releases which meet the minimum reporting critera for the Risk Management Rule.\n\n6.  Emergency response program\n\nThe plant operating staff are trained in Hazard Communication, First Aid, fire prevention procedures and emergency response as a part of Borden's Safety Program.  An on-site response team is available from the neighboring chemical complex.   In addition, Borden has a contractual agreement with out-side contractor to provide a well-trained and equipped Emergency Response Team on a 24 hr., seven day a week bases. In addition to this agreement, this Borden facility has a working relationship with the Warren County Local Emergency Planning Commission. This L.E.P.C. has a well-equipped emergency response team.\n\n7.  Planned changes to improve safety\n\nNo significant changes are planned at this time."
    }
  ]
}