{
  "FacilityID": 13150,
  "FacilityName": "Winter Springs East Wastewater Plant",
  "FacilityStr1": "1560 Winter Springs Blvd",
  "FacilityStr2": null,
  "FacilityCity": "Winter Springs",
  "FacilityState": "FL",
  "FacilityZipCode": "32708",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12117",
  "LEPC": null,
  "FacilityLatDecDegs": "28.674444",
  "FacilityLongDecDegs": "-81.248056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Winter Springs",
  "Company2Name": null,
  "CompanyDUNS": 7977270,
  "Company2DUNS": null,
  "OperatorName": "City of Winter Springs",
  "OperatorStr1": "110 N. Flamingo Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Winter Springs",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32708",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": "N/A",
  "EPAFacilityID": "100000138772",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2006-08-15 00:00:00",
  "DeRegistrationEffectiveDate": "2006-01-03 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 28.6766,
  "FRS_Long": -81.24141,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Converted to sodium hypochlorite and removed the gas chlorine cylinders",
  "_processes": [
    {
      "ProcessID": 17700,
      "AltID": "Chlorination System",
      "FacilityID": 13150,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 22226,
          "ProcessID": 17700,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 18147,
          "ProcessID": 17700,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 9369,
              "Process_NAICS_ID": 18147,
              "SafetyReviewDate": "1998-12-01 00:00:00",
              "PHA_Date": "1999-06-21 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-01-27 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-12-01 00:00:00",
              "TrainingReviewDate": "1998-12-01 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-01-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "Chlorination system",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1998-12-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-06-01 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-12-01 00:00:00",
              "HotWorkPermitReviewDate": "1998-12-01 00:00:00",
              "ContractorSafetyReviewDate": "1998-12-01 00:00:00",
              "ContractorSafetyEvalDate": "1998-12-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 12922,
                  "PreventionProgram3ID": 9369,
                  "ProcessChemicalID": 22226
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 13150,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Seminole County HAZMAT Team",
    "CoordinatingAgencyPhone": "4073232500",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 13150,
      "SummaryText": "rformed utilizing the parameters provided in 40 CFR 68.22. The worst-case release scenario selected for the East WRF's off-site consequence analysis is the release of the contents of an entire one-ton chlorine cylinder from the chlorination process in a period of 10 minutes. This yields a release rate of 200 lbs/min. The radius of influence in this worst-case scenario was determined by the RMP*Comp( model to be 1.3 miles. \n\nIn accordance with 40 CFR 68.22, the population within the area of influence was determined, and other public and environmental receptors were identified. The population was based on census track data obtained using the Landview III program, which is available on the Internet at www.rtk.net. The information regarding public receptors was gathered using a combination of street maps and USGS maps. There are two public receptors (parks) in addition to the local residents. The population within the area of influence is 5,200.\n\nAlternate-Case Release Scenario\n\nAnalysis of the alternate-case release scenario of chlorine was performed in accordance with 40 CFR 68.22 as well, but the scenario is modeled in a more realistic setting. This model assumed a release rate of 10.5 lbs/min for a duration of 60 minutes. The distance to the chlorine toxic end point was determined by the RMP*Comp( model to be less than 0.1 mile. Within this area of influence, there are 43 residents and no other receptors, according to the census track data in the Landview III program. \n\nAccident History\n\nThe East WRF has had no releases of chlorine reported in the last five years that have resulted in on-site or off-site death, injury, evacuation, sheltering-in-place, property damage, or environmental damage. \n\nPrevention Program 3\n\nThe City of Winter Springs stresses the importance of safety to all their employees. Programs have been developed for standard operating procedures, process safety training, and process technology for employees at all levels. The programs are in accordan"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13150,
      "SummaryText": "County HazMat Team and the local Fire and Police Departments will coordinate to contain the release and handle any first aid and evacuation/sheltering-in-place as necessary.\n\nIn the event of a minor leak, the operators will wear a self-contained breathing apparatus (SCBA) and attempt to seal the leak. Standard procedure is for one operator to fix the leak while a second operator observes from a distance to provide back-up. If the leak cannot be sealed, the major chlorine release procedures will be followed. Such standard procedure is included in the City of Winter Springs Emergency Action and Management Plan Document.  The document is kept nearby for reference. \n\nThe City of Winter Springs strictly adheres to the OSHA and EPA standards, relating to the Emergency Planning and Response. Each facility employee will be trained in an overview of the emergency action and response plan to assure that he/she knows what action to take in an emergency and can perform the tasks safely and in accordance with the outlined plans. \n\nCity of Winter Springs - East Water Reclamation Facility Executive Summary\t\t6\n\n3"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 13150,
      "SummaryText": "EXECUTIVE SUMMARY\nCITY OF WINTER SPRINGS\nEAST WATER RECLAMATION FACILITY\n\nIntroduction\n\nThe intent of the Executive Summary of the U.S. Environmental Protection Agency (EPA) Risk Management Program (RMP) is to provide complete and accurate information concerning the City of Winter Springs East Water Reclamation Facility (WRF) to the community. This document will be available to the public and shall include information pertaining to the following:\n\n* Wastewater Treatment Facilities\n* Hazard Assessment \n* Prevention Program \n* Emergency Response/Action Plan \n\nWastewater Treatment Facilities\n\nThe East WRF utilizes chlorine gas to provide disinfection of the wastewater effluent being discharged from the Facility. The chlorine gas is stored in one ton-cylinders of chlorine, which are fabricated to FDOT standards (106A500X). The average container has a capacity of one short ton (2000 pounds), an outer diameter of 30 inches and an overall length of 82 inches. The heads on each end of the cylinders are convex inward and forge welded to the barrel of the cylinder. The sides are crimped inward at each end to provide a grip point for lifting beams. \n\nAll one ton-cylinders are equipped with six fusible metal plugs, three on each end. The fusible plugs serve as overpressure relief devices. The fusible metal is designed to melt between 158 (F and 165 (F to relieve pressure and prevent rupture of the container in case of fire or overheating. The ton-container is designed around a maximum hydrostatic pressure of 500 psig. \n\nThe cylinders are stored outdoors in a three-sided building that provides ventilation and keeps the cylinders above the natural grade of the site.  Two chlorine ton-cylinders are stored on a ton-cylinder scale and are operational, in the chlorination process, via an automatic switchover system. The remaining back-up cylinders are supported and spaced using trunnions. This would allow the cylinders to correctly position the outlet valves. Also, in case of a leak,"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13150,
      "SummaryText": "the ton-cylinder can be rotated so that the chlorine escapes as a gas rather than a liquid.\n\nThe Chlorination system at the WRF converts liquid chlorine to chlorine gas and injects the gas into a water solution that is used for disinfection purposes.  Chlorine is fed from the ton-cylinders through a device called a chlorinator. The chlorinator system includes a vacuum regulator check unit that mounts directly to the upper gas valve of the ton-cylinder by means of a lead gasketed positive yoke assembly, and an ejector. The feed system from the container to chlorination and the ejector is operated under a vacuum, so any small leaks pull in air instead of releasing chlorine. The chlorinators are 500 lb/day units that meter chlorine gas flow. \n\nThe chlorinator is equipped with a small 25 watt heating element. Therefore, as chlorine is drawn into the chlorinator from the ton-cylinder, it is deflected down into a drip-leg where any liquid chlorine is vaporized, permitting only gas to enter the regulating portion of the chlorinator. A vent/relief valve is provided with the chlorination unit to vent chlorine gas to the atmosphere at a remote location.\n\nHazard Assessment\n\nThe Hazard Assessment was performed in compliance with the requirements of the EPA standards. The Off-Site Consequence Analysis (OCA) of worst-case and alternate-case releases of chlorine was estimated, and a five year accident history was evaluated. The OCA assessment includes dispersion models, identification of the area that is above the toxic end point criteria, and the estimated affected population or environmental receptors. \n\nThe Off-Site Consequence Analysis (OCA) was performed using the RMP*Comp( model.  The RMP*Comp( model was supplied by the EPA and developed by NOAA, and it takes into account variances in wind speed, temperature, humidity, surface roughness (urban or rural setting), and release rate. \n\nWorst-Case Release Scenario\n\nAnalysis of the worst-case release scenario of chlorine was pe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13150,
      "SummaryText": "ce with both OSHA PSM and EPA RMP Prevention Program 3.\n\nThe City of Winter Springs developed and implemented a training program that complies with 29 CFR 1910.119. Within the first week, all new employees, who work with or are exposed to chlorine are given orientation safety training. The Lead Operator will review with each employee, upon initial assignment, parts of the Emergency Action Plan (EAP) that he or she must know to protect him/herself in an emergency. Contractors and visitors will be briefed on the EAP and actions they must take in an emergency as well. \n\nIn addition to the EAP orientation, each employee is trained in the standard operating procedures for the smooth operation of the Facilities. This program is developed to train the employee in basic operation procedures such as initial startup, normal operation, temporary operations, emergency shutdown, emergency operations, and normal shutdowns. It is also intended to prepare employees for minor troubleshooting.\n\nAs a policy, employees are tested to ensure they have retained the training and process safety information. Refresher courses are periodically required to maintain the smooth operation at the East WRF.\n\nA copy of the Process Safety Management Program is located at the WRF for easy access and quick reference by all employees.\n\nEmergency Response Plan\n\nThe City of Winter Springs is committed to the safety of their employees as well as the surrounding community. The Utility coordinates with the local emergency responders such as the Seminole County HazMat Team and the Fire and Police Departments to implement an Emergency Response Program. The Program is set up in accordance with the provisions of 29 CFR 1910.38(a) and includes procedures for handling small releases. \n\nThe WRF is included in the community emergency response plan. In the event of a major chlorine release, the facility operating procedure is to evacuate the site upwind of the release and call 911 to report the incident. The Seminole"
    }
  ]
}