{
  "FacilityID": 13186,
  "FacilityName": "Engelhard Corporation--Attapulgus Operations",
  "FacilityStr1": "Engelhard Road",
  "FacilityStr2": null,
  "FacilityCity": "Attapulgus",
  "FacilityState": "GA",
  "FacilityZipCode": "31715",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13087",
  "LEPC": "Georgia Dept of Nat Resources",
  "FacilityLatDecDegs": "30.745556",
  "FacilityLongDecDegs": "-84.491389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": "www.engelhard.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 53194023,
  "ParentCompanyName": "Engelhard Corporation",
  "Company2Name": null,
  "CompanyDUNS": 99290629,
  "Company2DUNS": null,
  "OperatorName": "Engelhard Corporation",
  "OperatorStr1": "P.O. Box 220",
  "OperatorStr2": null,
  "OperatorCity": "Attapulgus",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31715",
  "OperatorZipCodeExt": null,
  "FTE": 275,
  "OtherEPAFacilityID": "31715NGLHRDEPOT",
  "EPAFacilityID": "100000138807",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-16 00:00:00",
  "SafetyInspectionBy": "Georgia State Fire Marshall's Office",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 30.738055,
  "FRS_Long": -84.49394,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17764,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 13186,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 22327,
          "ProcessID": 17764,
          "ChemicalID": 56,
          "Quantity": 60000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 18213,
          "ProcessID": 17764,
          "NAICSCode": "325311",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 9414,
              "Process_NAICS_ID": 18213,
              "SafetyReviewDate": "1999-02-15 00:00:00",
              "PHA_Date": "1999-02-17 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-08-27 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Miscellaneous upgrades in progress",
              "OpProceduresReviewDate": "1999-06-17 00:00:00",
              "TrainingReviewDate": "1999-06-17 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-11 00:00:00",
              "EquipmentInspectionDate": "1999-03-16 00:00:00",
              "EquipmentTested": "The entire ammonia system was inspected",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-18 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-17 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-11 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-06-11 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 13004,
                  "PreventionProgram3ID": 9414,
                  "ProcessChemicalID": 22327
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 13186,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Decatur County Fire Department",
    "CoordinatingAgencyPhone": "9122483011",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13186,
      "SummaryText": "1 RISK MANAGEMENT PLAN\n1.1 EXECUTIVE SUMMARY\n\nChemical Accident Prevention and Emergency Response Policy\n\nIt is the policy of the Engelhard Corporation Attapulgus Operations (Engelhard) facility management to implement the requirements of this Risk Management Plan (RMP) in accordance with the EPA regulations under 40 CFR Part 68.  Engelhard's objective is to minimize the risk of a release of anhydrous ammonia (ammonia) and, if a release occurs, to minimize the potential impact to Engelhard's employees, the public, and the environment. This objective will be accomplished by utilizing general good operating practices, providing appropriate training to all employees, complying with pertinent codes and regulations, and proactively planning and coordinating emergency response activities with Engelhard's local emergency response providers.\n\nEngelhard's management is committed to providing the resources necessary to implement this policy.\n\nFacility Description\n\nEngelhard manufactures petroleum catalysts, including fluid cracking and moving bed catalysts, for sale to oil refineries.  As part of this process, Engelhard manufactures two co-products, a nitrogen fertilizer solution and a sodium silicate solution, respectively.  The nitrogen fertilizer process requires ammonia for pH control in sufficient quantities to be subject to the requirements of 40 CFR Part 68, Chemical Accident Prevention Provisions.  \n\nEngelhard has one 12,000-gal (60,000-lb) ammonia storage tank.  This document presents the RMP for Engelhard's ammonia system.  Figure 1-1 shows Engelhard's location relative to its surroundings.\n\nWorst-Case and Alternative Release Scenarios\n\nWorst-Case Release Scenario\n\nThe EPA has defined a worst-case release as the release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to a specified endpoint.  The possible causes or probability of such a release occurring are not considered.  The release"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13186,
      "SummaryText": "is simply assumed to take place. \n \nFigure 1-1\nSite Location Map\n\nThe endpoint is intended to represent an exposure level below which most members of the public will not suffer any serious health effects.  The distance to the worst-case endpoint should not be considered a zone in which the public would likely be in danger.  Rather, it is intended to provide an estimate of the maximum possible area that might be affected in the unlikely event of catastrophic conditions.\n\nEngelhard's worst-case release scenario for ammonia included an assumed release of the entire contents of its 12,000-gal (60,000-lb) ammonia storage tank over a 10-min period. The risk analysis was conducted using the EPA's RMP Offsite Consequence Analysis Guidance.  Results indicated that the endpoint could occur at a distance of 4.4 miles from the release point.  Figure 1-2 shows Engelhard's worst-case release scenario.\n \nFigure 1-2\nWorst-Case Release Scenario (radius = 4.4 mi)\n\nAlternative Release Scenario\n\nThe EPA has characterized an alternative release as one that is more likely to occur than the worst-case release and that reaches an endpoint offsite, unless no such scenario exists.  Although alternative scenarios are intended to be more likely than worst-case scenarios, the analysis of alternative scenarios should not be expected to provide realistic estimates of areas in which the public might be endangered in case of a release.  The same conservative, protective endpoints are used for alternative release analyses as for worst-case analyses. \n\nEngelhard's alternative release scenario for ammonia included an assumed failure in a 1.25-in. diameter transfer hose during storage tank filling resulting in a release 35,000-lb of ammonia over a 274-min period.  The ammonia tanker truck driver was assumed present (per DOT regulation) at the time of release and thus able to isolate his truck from the storage tank.  The risk analysis was conducted using the EPA's RMP Offsite Consequence Analysis Gui"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13186,
      "SummaryText": "in an ammonia system action plan complete with action items, accountabilities, and completion dates.  Procedures are in place to maintain this PHA consistent with the current ammonia process and to update and revalidate it at least every five years.\n\nProcedures and Training\n\nIt is Engelhard's policy to ensure that its employees are provided clear instructions for safely conducting all work-related activities.  Accordingly, the ammonia system has a set of related standard operating procedures (SOPs) and safe work practices.  Employees operating the ammonia system receive various forms of training in these SOPs and safe work practices to ensure that they have the knowledge, skills, and abilities to safely carry out their duties.\n\nIt is also Engelhard's policy to inspect, test, and maintain its process equipment in a manner consistent with applicable manufacturer's recommendations and recognized good engineering practices.  Accordingly, Engelhard has a set of ammonia-related maintenance procedures addressing preventative maintenance and repairs, hot work permits, etc, and designed to prevent accidental ammonia releases.  Maintenance technicians and mechanics receive training in these procedures to ensure that they have the knowledge, skills, and abilities to safely carry out their duties.  In addition, Engelhard works with its maintenance contractors to ensure that they are familiar with and meet or exceed all site safety standards and practices.\n                                                                                                                                                               Ongoing Review\n\nEngelhard management recognizes that processes and equipment are ever-changing.  To ensure that these changes are managed and implemented safely, Engelhard has Pre-startup Review and Management of Change processes in place that ensure that safety and health considerations and procedural and training requirements are addressed prior to any change being imp"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13186,
      "SummaryText": "lemented.\n\nShould an ammonia (or other chemical) release occur, Engelhard has an Incident Investigation process designed to quickly identify root causes and appropriate actions to prevent future releases.  These investigations are reviewed regularly for trends, etc, as a means of further managing the safety of Engelhard's manufacturing processes.\n\nLastly, Engelhard conducts routine audits of its ammonia accident prevention program to ensure the program's effectiveness and continuous improvement.\n\nFive Year Accident History\n\nEngelhard has had no releases of ammonia that have affected onsite personnel, the public, or the environment in the past five years.\n\nEmergency Response Program\n\nEngelhard does not have onsite emergency response capability to respond to an ammonia emergency. Therefore, it is Engelhard's policy to contact offsite emergency responders for assistance in the event of an ammonia-related emergency. \n\nIn the event of a non-emergency ammonia release, Engelhard employees trained in the safe operation of the ammonia system will close manual shutoff valves to terminate the flow of ammonia if these valves can be safely approached.  \n\nFor all other scenarios, Engelhard's employees will evacuate the area and allow offsite responders to respond to the ammonia emergency.  To this end, Engelhard has contacted three emergency response organizations in the North Florida area (one public and two private) to establish mechanisms for emergency response system activation.  In addition, Engelhard has met with its local Fire Departments (Attapulgus Volunteer Fire Department and Decatur County Fire Department) to review the ammonia system and to establish emergency response coordination and communication procedures. \n \nPlanned Changes to Improve Safety\n\nEngelhard is making changes to improve the safety of its ammonia system, including:\n\n7 Improving warning signs in the vicinity of the ammonia storage tank\n7 Demolishing obsolete/inactive sections of the ammonia pipeline sy"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 13186,
      "SummaryText": "stem\n7 Upgrading the ammonia pipeline color coding/labelling system\n7 Replacing flexible hoses with hard pipes as appropriate\n7 Improving roadside barriers for storage tank protection\n7 Improving existing alarms systems to optimize process control\n7 Conducting vendor audits to ensure that Engelhard's ammonia shippers have the knowledge and skills to safely conduct ammonia unloading operations \n\nThese changes will be in place by August 1999."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13186,
      "SummaryText": "dance.  Results indicated that the endpoint could occur at a distance of 0.2 miles from the release point.  Figure 1-3 shows Engelhard's alternative release scenario.\n \nFigure 1-3\nAlternative Release Scenario (radius = 0.2 mi)\n\nGeneral Chemical Accident Prevention Program and Ammonia-Specific Prevention Steps\n\nEngelhard is governed by a set of MSHA and EPA (and corresponding Georgia) regulations that require a number of activities intended to prevent a release of hazardous materials, or if a release inadvertently occurs, to minimize the consequences of a release to the facility's employees, the public, and the environment. Some of these MSHA and EPA regulations include:\n\n7 30 CFR Part 56, Safety and Health Standards-Surface Metal and Nonmetal Mines \n7 40 CFR Part 68, Chemical Accident Prevention Provisions\n7 40 CFR Part 110, Discharge of Oil\n7 40 CFR Part 112, Oil Pollution Prevention\n7 40 CFR Part 117, Determination of Reportable Quantities for Hazardous Substances\n7 40 CFR Part 122, EPA-Administered Permit Programs: The National Pollutant Discharge Elimination System \n7 40 CFR Part 262,  Standards Applicable to Generators of Hazardous Waste\n7 40 CFR Part 302, Designation, Notification, and Reportable Quantities\n7 40 CFR Part 355, Emergency Planning and Notification\n\nIn addition, Engelhard has instituted an ammonia-specific accident prevention program.  Key concepts of this program include employee participation in all facets, proactive process safety analyses, appropriate procedures and training for all employees and contractors, and ongoing periodic review of the ammonia accident prevention program to ensure its effectiveness and continuous improvement.\n\nProcess Hazard Analyses\n\nA multi-departmental team of Engelhard employees conducted an ammonia system Process Hazard Analysis (PHA) in February 1999.  The PHA was designed to proactively identify and address any system weaknesses in order to prevent accidental ammonia releases.  Items identified were documented"
    }
  ]
}