{
  "FacilityID": 13187,
  "FacilityName": "Mountaintop Area Joint Sanitary Authority",
  "FacilityStr1": "290 Morio Drive",
  "FacilityStr2": null,
  "FacilityCity": "Mountaintop",
  "FacilityState": "PA",
  "FacilityZipCode": "18707",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42079",
  "LEPC": "Luzerne County Emer. Mgmt. Ag.",
  "FacilityLatDecDegs": "41.115556",
  "FacilityLongDecDegs": "-75.960556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Mountaintop Area Joint Sanitary Aut",
  "OperatorStr1": "290 Morio Drive",
  "OperatorStr2": null,
  "OperatorCity": "Mountaintop",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "18707",
  "OperatorZipCodeExt": null,
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000040332",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-07-06 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2007-11-26 00:00:00",
  "DeRegistrationEffectiveDate": "2007-08-01 00:00:00",
  "AnniversaryDate": "2004-06-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.115431,
  "FRS_Long": -75.959752,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17765,
      "AltID": "Wastewater Treatment",
      "FacilityID": 13187,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 22328,
          "ProcessID": 17765,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 22329,
          "ProcessID": 17765,
          "ChemicalID": 49,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 18214,
          "ProcessID": 17765,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 7336,
              "Process_NAICS_ID": 18214,
              "SafetyReviewDate": "1999-03-04 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "The Chlorine Institute",
              "FR_Comments": null,
              "HazardReviewDate": "1999-03-04 00:00:00",
              "ChangeCompletionDate": "1999-04-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Inhibitor system on evaporators.",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Wind sock installed.  Sulfur dioxide detection monitor installed.",
              "OpProceduresReviewDate": "1999-05-12 00:00:00",
              "TrainingReviewDate": "1999-04-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-04 00:00:00",
              "EquipmentInspectionDate": "1999-02-25 00:00:00",
              "EquipmentTested": "Fischer-Porter Evaporators, Chlorinators and Sulfonators",
              "ComplianceAuditDate": "1999-06-14 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 7653,
                  "PreventionProgram2ID": 7336,
                  "ProcessChemicalID": 22328
                },
                {
                  "PrimaryKey": 7654,
                  "PreventionProgram2ID": 7336,
                  "ProcessChemicalID": 22329
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 13187,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-02-10 00:00:00",
    "ERTrainingDate": "1999-04-28 00:00:00",
    "CoordinatingAgencyName": "Luzrene County Emeg. Mgmt. Agency",
    "CoordinatingAgencyPhone": "5708204400",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 13187,
      "SummaryText": "haracteristic, penetrating odor of chlorine gas usually gives warning of its presence in the air.  At high concentrations, it is visible as a greenish yellow gas.  Liquid chlorine in contact with the skin or eyes will cause chemical burns and/or frostbite.\n\nIn moist environments, sulfur dioxide converts to sulfurous acid, which may cause skin irritation.  Inhalation of sulfur dioxide may result in dryness and irritation of the nose and throat, choking, coughing, and bronchospasm.  Severe overexposure may cause death.  In contact with the eyes, sulfur dioxide can penetrate the intact cornea and cause iritis.  \n\nChlorine and sulfur dioxide containers are thoroughly inspected for mechanical integrity and leaking valves prior to leaving the supplier's premises.  The containers are off-loaded from the delivery truck at the treatment plant by an overhead crane with a lifting beam that is specially designed for ton-containers.  The off-loaded containers are also inspected by MAJSA personnel.\n \nThe chlorine leaves the ton-container as a liquid and is piped under pressure to the evaporator.  The evaporator heats converts the liquified chlorine to a gas.  The chlorine gas leaving the evaporator is piped under pressure to the chlorinator.  The chlorinator precisely controls the flow of chlorine to the injector.  Water flowing through the injector creates a vacuum from the chlorinator to the injector and this draws the chlorine gas from the chlorinator into a water stream to create a chlorine solution.  A vacuum regulator in the chlorinator shuts off the flow of chlorine gas if the vacuum is lost or interrupted.  There are two evaporators and two chlorinators; however, the second evaporator and chlorinator are used only as back-up if the primary units require maintenance. \n\nSulfur dioxide leaves the ton-container as a liquid and goes through exactly the same process as that described for chlorine, except that sulfur dioxide gas goes to the sulfonator rather than the chlorinator"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13187,
      "SummaryText": ".\n\n4.\tAccidental Release Prevention\n\nAccidental releases of chlorine and sulfur dioxide are prevented by routine training and adhering to the written operating procedures that cover the chlorine and sulfur dioxide systems from the ton-container unloading through the mixing of the chlorine and sulfur dioxide gases with the treated wastewater.  These procedures cover both normal operations and emergency operations during which personnel may have to respond to an accidental release of chlorine or sulfur dioxide.  \n\nThe chlorine and sulfur dioxide systems are inspected at least once per day, and leak testing is performed on the valves and fittings when the ton-containers are changed-out, and at other times if a leak is suspected.  Employees who are responsible for disconnecting empty containers and connecting filled containers to the chlorine and sulfur dioxide systems have been trained on the operating procedures; inspection of valves, fittings, and the connected piping; and leak testing with an aqueous ammonia solution.  Aqueous ammonia reacts with chlorine and sulfur dioxide gas to form a very visible white cloud.  An outside contractor inspects the chlorine and sulfur dioxide systems and performs preventive maintenance on these systems at least once per month.  This additional inspection ensures that worn or damaged parts are replaced and routine maintenance is performed on the evaporators, chlorinators, sulphanators, and the chlorine and sulfur dioxide monitors.  These preventive measures have resulted in the absence of any accidental release of chlorine or sulfur dioxide that resulted in personal injury or property damage in the past five years.\n\nThe treatment plant maintains two sets of Self-Contained Breathing Apparatus (SCBA) and The Chlorine Institute's Emergency Kit B for ton-containers.  This equipment is stored in a building that is next to the rooms that house the chlorine and sulfur dioxide ton-containers.  MAJSA personnel receive annual training on the"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 13187,
      "SummaryText": "EXECUTIVE SUMMARY\n\n              MOUNTAINTOP AREA JOINT SANITARY AUTHORITY\n                       RISK MANAGEMENT PROGRAM\n\n1. Purpose\n\nChlorine is used as a disinfectant in wastewater treatment.  Wastewater contains microorganisms that are harmful to human health.  Several treatment processes are utilized at the plant to treat the raw wastewater and a chlorination system provides disinfection of the wastewater prior to discharge. Sulfur dioxide is used to reduce the chlorine concentration in the treated wastewater to acceptable levels prior to discharge. \n\n2. Storage\n\nThe maximum inventory of chlorine and sulfur dioxide is eight one-ton containers of each.  A maximum of four one-ton containers of liquid chlorine is stored in the chlorine storage room, and a maximum of four one-ton containers of sulfur dioxide is stored in the sulfur dioxide storage room.  Four additional one-ton containers of chlorine and sulfur dioxide are stored outside in a protected area.\n\n3.\tOverview of the Wastewater Treatment Plant\n\nThe Mountaintop Area Joint Sanitary Authority (MAJSA) treats approximately 2.85 million gallons per day (MGD) of raw domestic wastewater at its treatment plant. The chlorine used for disinfection is supplied from one-ton containers.  Additional chlorine is added to the wastewater to reduce ammonia concentrations to acceptable levels prior to discharge.  This additional chlorine also raises the concentration of chlorine in the treated water, and this must be reduced to acceptable levels prior to discharge.  Sulfur dioxide is injected into the wastewater to reduce the chlorine concentration in the treated wastewater to acceptable levels prior to discharge.\n\nChlorine gas is a respiratory irritant.  In sufficient concentrations, the gas irritates the mucous membranes, the respiratory tract, and the eyes.  In extreme cases, difficulty in breathing may increase to the point where death can occur from respiratory collapse or lung failure.  The c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13187,
      "SummaryText": "use of the breathing apparatus and the emergency kit.  The kit contains the necessary tools and other equipment to contain valve leaks and to repair small holes in a ton-container, and capping devices for the fusible plugs in the ton-containers.  Ton-containers are equipped with fusible metal pressure relief devices.  Most ton-containers have six fusible metal plugs, three in each end.  The fusible metal is designed to melt between 1580F and 1650F to relieve pressure and prevent rupture of the container in case of fire or other exposure to high temperature.  \n\nChlorine and sulfur dioxide gases are heavier than air and will settle to the lowest elevation when released.  The chlorine and sulfur dioxide storage areas are equipped with an exhaust fan that is mounted near the floor on an outside wall so that any leaks will be exhausted outside the building.  There are also air intake vents located in the ceiling of each storage room.  The fan can be activated by a switch located outside the building and also by a switch inside the building.  Two exit doors are provided in the chlorine and sulfur dioxide storage rooms.  \n\n5.\tEmergency Response Plan\n\nThe MAJSA has coordinated emergency response with the Luzerne County Emergency Management Agency (LCEMA).  The LCEMA has contracted with two local consulting firms to respond to emergencies at the treatment plant if MAJSA personnel cannot handle the emergency.  This plan was developed in accordance with the provisions set forth in Title III of the Superfund Amendments and Reauthorization Act (SARA) of 1986.  The plan is updated as necessary, including the list of emergency telephone numbers. \n\nIf a chlorine or sulfur dioxide leak develops in a ton-container or in the connected piping, valves, or other equipment, the chlorine or sulfur dioxide monitor will activate an audible alarm in the Operations Building and in the tunnel that connects the Operations Building to the Microstrainer Building.  Audible as well as visual alarms"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13187,
      "SummaryText": "are displayed on the control panel in the control room.  The treatment plant is manned five days per week (Monday through Friday) from 6:00 a.m. to 5:30 p.m.  After hours, any system malfunction, including any chlorine or sulfur dioxide system leaks that are detected by the monitors and displayed on the control panel, automatically initiates a dial-up to an alarm center.  The alarm center then contacts the treatment plant personnel.  The treatment plant emergency operating procedures will be followed to determine the severity of a chlorine or sulfur dioxide release and whether or not the gas may migrate off site.  If the release may travel off site, then the Off-site Response Plan will be activated.  If the chlorine release does not pose a threat to the general public, MAJSA personnel will repair the leak.  The MAJSA have installed a windsock near the Microstrainer Building so that the area that is likely to be affected by a chlorine or sulfur dioxide release can be determined. \n\n6.\tWorst-Case and Alternate-Case Accidental Release Scenarios\n\nWorst-Case Release Scenario for Chlorine and Sulfur Dioxide\nThe worst-case release scenario as postulated in the regulation (40 CFR 68.25) is the release of the greatest quantity (of chlorine or sulfur dioxide) in a single vessel.  The entire contents of this vessel are assumed to be released as a gas over a 10-minute period.  The largest single vessel at the treatment plant is a one-ton container; therefore, in a worst-case scenario, 2,000 pounds of liquid chlorine or sulfur dioxide would be released as a gas over a 10-minute period.  A release of this magnitude would only be possible if the shell of the container failed and the liquid formed a pool and vaporized over a 10-minute period.  The likelihood of this type of catastrophic release is very minimal.  The off-site consequence of this type of release was determined by using U. S. EPA's RMP*Comp software.  The toxic endpoint for chlorine is 3 parts per million (ppm).  The"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 13187,
      "SummaryText": "RMP*Comp results indicate that the chlorine concentration may exceed 3 ppm out to a radial distance of 1.3 miles from the chlorine storage room.  This is the distance to the toxic endpoint.  Beyond 1.3 miles, the chlorine concentration will be less than 3 ppm.  Short-term exposure to chlorine concentrations less than 3 ppm is not considered to be a health hazard. The RMP*Comp results for sulfur dioxide were the same as those obtained for chlorine.  The toxic endpoint for sulfur dioxide is also 3 ppm.    \n\nBased on the guidance provided in the regulation and U. S. EPA's Risk Management Program Guidance for Wastewater Treatment Plants, the area surrounding the treatment plant was classified as urban due to the presence of nearby buildings and other structures, trees, and hilly terrain.  The meteorological conditions associated with the worst-case release scenario, as prescribed in the regulation, is a wind speed of 1.5 meters per second (3.36 miles per hour) and very stable atmospheric conditions.  These stable atmospheric conditions will limit the mixing of the chlorine or sulfur dioxide gas with the ambient air as the gas travels downwind from the point of release.  The cloud formed by the chlorine or sulfur dioxide release will grow in size and decrease in concentration as it travels downwind. \n\nAlternate-Release Scenario for Chlorine\nThe alternate release scenario is one that is more likely to occur than the worst-case release scenario.  For this scenario, it was assumed that the 3/8-inch-diameter, Type K copper tubing (pigtail) is sheared off and that mitigation occurs in one hour.  This tubing transfers liquid chlorine from the ton-container to the manifold.  This assumption is based on the alternate release scenarios listed in Edition 3 of The Chlorine Institute Pamphlet No. 74 - Estimating the Area Affected by a Chlorine Release, April 1998.  The release rate for this scenario is 91 pounds per minute of liquid chlorine that will vaporize and be vented to the o"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 13187,
      "SummaryText": "utside as a gas.  For this scenario, the meteorological conditions prescribed in the regulation are neutral atmospheric stability conditions and a wind speed of 3 meters per second (6.7 miles per hour).  RMP*Comp was also used to determine the radial distance at which the chlorine concentration drops to less than 3 ppm.  This distance to the toxic endpoint, as determined by RMP*Comp, is 0.20 miles (1,056 feet).   There are no schools or hospitals within this radial distance.  There are four residences and an estimated population of 17 within this radial distance. \n\nAlternate-Release Scenario for Sulfur Dioxide\nThe alternate release scenario for sulfur dioxide also addresses the shearing off of the 3/8-inch diameter transfer hose.  This results in a release rate of 21 pounds per minute of sulfur dioxide.  The distance to the toxic endpoint, as determined by RMP*Comp, is 0.10 miles (528 feet).  Within this radial distance, there is one household and a population of 4.\n\nThe worst-case and alternate release scenarios are summarized in Tables 1 and 2, along with some additional information regarding population estimates, schools, hospitals, and other buildings or recreation areas within the radial distance to the toxic endpoint.  Census data and the location of schools, hospitals, etc., were obtained from the LandView III mapping system that includes database extracts from U. S. EPA, the Bureau of Census, the U. S. Geological Survey, the Nuclear Regulatory Commission, the Department of Transportation, and the Federal Emergency Management Agency.\n\n7.  Planned Changes to Increase Safety\n\n* Increase the frequency of practice drills to respond to an accidental release of chlorine to three times per year.\n\n* Encourage the local volunteer fire companies to become more familiar with the chlorine and sulfur dioxide systems at the treatment plant.\n\n\n\n\n\n\n\n\n\n                                    Table 1\n\n     SUMMARY OF THE WORST-CASE AND ALTERNATE RELEASE SCENARIOS FOR CHLORINE"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 13187,
      "SummaryText": "Worst-Case Release\t        Alternate Release\nType of Accidental Release\tRupture of ton-container\tShearing of 3/8-inch                   \n                                                             Copper tubing\n\nQuantity of Chlorine Released\t       2,000 pounds\t          2,000 pounds\n\nDuration of Chlorine Release\t         10 minutes\t           60 minutes\n\nRate of Release of Chlorine Gas\t200 lbs/minute\t          91 lbs/minute\n\nWind Speed\t                      1.5 m/sec(3.4 mph)\t       3.0 m/sec(6.7 mph)\n\nAtmospheric Stability Class\t      F (very stable)\t           D (neutral)\n\nMethod used to determine\t         RMP*Comp\t                   RMP*Comp\ntoxic endpoint\n\t\t\nChlorine concentration\t                3 ppm\t                     3 ppm\nat the endpoint\n\t\nRadial distance to the\t                1.3 miles\t              0.2 miles\n toxic endpoint\n\nEstimated population\t                  1,046\t                        17\nwithin radial distance\t\n\nNumber of residences\t                   356\t                         4\n\nNumber of hospitals\t                     0\t                         0\n\nNumber of schools\t                           0\t                         0\n\nOther Sensitive Areas              Interstate Hwy 81           Interstate Hwy 81\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                     Table 2\n\n  SUMMARY OF THE WORST-CASE AND ALTERNATE RELEASE SCENARIOS FOR SULFUR DIOXIDE\n\n\t                            Worst-Case Release\t        Alternate Release\nType of Accidental Release\tRupture of ton-container\tShearing of 3/8-inch \n                                                             Copper tubing\n\nQuantity of Sulfur Dioxide \t      2,000 pounds\t           2,000 pounds\nReleased\n\t\nDuration of Sulfur Dioxide\t       10 minutes\t                  60 minutes\nRelease\t\n\nRate of Release of Chlorine Gas\t200 lbs/minute\t           21 lbs/minute\n\nWind Speed\t                     1.5 m/sec (3.36 mph)\t       3.0 m/sec (6.7 mph)\n\nAtmospheric Stability Class\t      F ("
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 13187,
      "SummaryText": "very stable)\t           D (neutral)\n\nMethod used to determine \t         RMP*Comp\t                   RMP*Comp\ntoxic endpoint\n\t\t\nChlorine concentration at \t           3 ppm\t                     3 ppm\nthe endpoint\n\t\nRadial distance to the\t          1.3 miles (6,900 ft)\t  0.1 miles (528 ft)\ntoxic endpoint\t\n\nEstimated population \t                 1,046\t                       4\nwithin radial distance\t\n\nNumber of residences\t                  356\t                       1\n\nNumber of hospitals\t                   0\t                       0\n\nNumber of schools\t                         0\t                       0\n\nOther Sensitive Areas              Interstate Hwy 81           Interstate Hwy 81"
    }
  ]
}