{
  "FacilityID": 13204,
  "FacilityName": "Fowler Packing Company Plant #1",
  "FacilityStr1": "8570 S. Cedar Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Fresno",
  "FacilityState": "CA",
  "FacilityZipCode": "93725",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": "County of Fresno",
  "FacilityLatDecDegs": "36.610056",
  "FacilityLongDecDegs": "-119.752861",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G2",
  "LatLongDescription": "AB",
  "FacilityURL": "www.fowlerpacking.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 28168615,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Philip Parnagian",
  "OperatorStr1": "8570 S. Cedar Ave",
  "OperatorStr2": null,
  "OperatorCity": "Fresno",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93725",
  "OperatorZipCodeExt": null,
  "FTE": 132,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000138193",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Fowler Plant #1",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP Pro 98",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 36.61315,
  "FRS_Long": -119.75485,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17789,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 13204,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 22355,
          "ProcessID": 17789,
          "ChemicalID": 56,
          "Quantity": 20047.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 18240,
          "ProcessID": 17789,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 9435,
              "Process_NAICS_ID": 18240,
              "SafetyReviewDate": "1998-05-28 00:00:00",
              "PHA_Date": "1999-06-05 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-05-28 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-19 00:00:00",
              "TrainingReviewDate": "1999-01-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-14 00:00:00",
              "EquipmentInspectionDate": "1999-04-01 00:00:00",
              "EquipmentTested": "All refrigeration safety and operational components inspected to complete IIAR MI review and RMP Off Site Consequence.",
              "ChangeMgmtDate": "1999-05-14 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-14 00:00:00",
              "PreStartupReviewDate": "1999-05-14 00:00:00",
              "ComplianceAuditDate": "1999-05-14 00:00:00",
              "AuditCompletionDate": "1999-09-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-14 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-14 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-14 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 13026,
                  "PreventionProgram3ID": 9435,
                  "ProcessChemicalID": 22355
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 13204,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-06-18 00:00:00",
    "ERTrainingDate": "1999-01-06 00:00:00",
    "CoordinatingAgencyName": "Fresno County Fire Department",
    "CoordinatingAgencyPhone": "5592686488",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13204,
      "SummaryText": "General Executive Summary for Fowler Plant #1\n\nIntroduction\nThis report and Risk Management Plan was developed to comply with US EPA and Cal ARP \nrequirements. Resources used in the process was International Institute of Ammonia \nRefrigeration Guidelines, RMP Pro 98 Software by Dyadem\nand Cold Storage Technologies.\n\nReport organization includes; Certification statement, Summary, Detailed Elements and Map of  \nPotential Impact. \n\n\n1.\tAccidental Release Prevention and Emergency Response Policies\nWe at Fowler Packing Company Plant #1 are strongly committed to employee, public and \nenvironmental safety.  This commitment is demonstrated by our comprehensive accidental \nrelease prevention program that covers areas such as design, installation, operating procedures, \nmaintenance, and employee training associated with the processes at our facility.  It is our policy \nto implement appropriate controls to prevent possible releases of regulated substances.\n\n\n2.\tThe Stationary Source and the Regulated Substances Handled\nOur facility\u0012s primary activities encompass Packing and storage of grape and non-citrus tree \nfruit.  We have 2 regulated substances  present at our facility above threshold quantities.  These \nsubstances include Ammonia (anhydrous) and Chlorine.  Chlorine quantity on site is below \nFederal toxic thresholds and above California thresholds. Ammonia (anhydrous) is used for \nRefrigeration and Chlorine for water treatment in a hydro-cooler. Chlorine is kept in 2-150 lb. \ncylinders adjacent to the Hydro-cooler. Typical operating quantity of Ammonia (anhydrous) in \nthe High Pressure Receivers, Condensers and piping that could release at one time is \napproximately 50% of the total quantity or 10,000 lb.. This is typical of a flooded Ammonia \nsystem that does not operate seasonally and pump down the system.  Since the system has \nsufficeint capacity to store the total Ammonia charge on the High Pressure side  no active \nmitigation is being considered.\n\n3.\tThe Worst Cas"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13204,
      "SummaryText": "e Release Scenario(s) and the Alternative Release \nScenario(s), including administrative controls and mitigation measures to \nlimit the distances for each reported scenario\nTo perform the required offsite consequence analysis for our facility, we have used the EPA's \nRMP Guidance for Ammonia Refrigeration  Reference Tables or Equations.  The following \nparagraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for Program 2 and 3 toxic substances as a class \ninvolves a catastrophic release from Ammonia Refrigeration.  In this scenario 20047 lb. of \nAmmonia (anhydrous) is released.  The toxic liquid released is assumed to form a 1 cm deep \npool from which evaporation takes place.  The entire pool is estimated to evaporate over 10 \nminutes.  The released quantity is assumed to be the total system charge since it can be stored in \nthe High Pressure Receivers, Condensers and HPL Piping. At Class F atmospheric stability and \n1.5 m/s windspeed, the maximum distance of 2.84 miles is obtained corresponding to a toxic \nendpoint of 0.14 mg/L.\n\nThe alternative release scenario for Ammonia (anhydrous) involves a Safety Relief Valve failure \nand release from the High Pressure Receiver.  This scenario based on the recent PHA would be a \nmore likely worst case scenario. It involves an SRV release rate based on HPR vessel size of \n42 lb./min for 60 minutes.  Toxic gas is assumed to be released to the atmosphere directly.  \nPassive mitigation controls of reducing the total release by manually switching to the standby \nSRV are taken into account to calculate the scenario.  Under neutral weather conditions, the \nmaximum distance to the toxic endpoint of 0.14 mg/L of Ammonia (anhydrous) is 0.19 miles or \n1000 ft.. The most common release based on operating experience is a compressor shaft seal \nfailure. Since these are mitigated by the mechanical room enclosure, off-site impacts are not \ncommon and therefore not allowed as an alternate scenario.\n\n4."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13204,
      "SummaryText": "The General Accidental Release Prevention Program and the Chemical-\nSpecific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention \nrequirements set out under 40 CFR part 68 of the EPA.  This facility was designed and \nconstructed in accordance with applicable mechanical codes.    The following sections briefly \ndescribe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nFowler Packing Company Plant #1 maintains a detailed record of safety information that \ndescribes the chemical hazards, operating parameters and equipment designs associated with all \nprocesses.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes \nare identified and controlled efficiently.  The methodology used to carry out these analyses is \nWhat If/Checklist (combined).  The studies are undertaken by a team of qualified personnel with \nexpertise in engineering and process operations and are revalidated at a regular interval of 5 \nyears.  Any findings related to the hazard analysis are addressed in a timely manner.  The most \nrecent PHA/update was performed on 06/05/1999.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Fowler Packing \nCompany Plant #1 maintains written operating procedures.  These procedures address various \nmodes of operation such as initial startup, normal operations, temporary operations, emergency \nshutdown, emergency operations, normal shutdown and startup after a turnaround.  The \ninformation is regularly reviewed and is readily accessible to operators involved in the processes. \nOur system is remotely monitored and maintained by a qualified Ammonia Refrigeration \nContractor. The system also includes a redundant control system.\n\nTraining\nFowler Packing Company Plant #1 has a comprehensive training program in place to ensure that \ne"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13204,
      "SummaryText": "mployees who are operating processes are competent in the operating procedures associated \nwith these processes.  Refresher training is provided at least every 3 years and more frequently as \nneeded. \n\nMechanical Integrity\nFowler Packing Company Plant #1 carries out highly documented maintenance checks on \nprocess equipment to ensure proper operations.  Process equipment examined by these checks \nincludes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, \nemergency shutdown systems, controls and pumps.  Maintenance operations are carried out by \nqualified personnel with previous training in maintenance practices.  Furthermore, these \npersonnel are offered specialized training as needed.  Any equipment deficiencies identified by \nthe maintenance checks are corrected in a safe and timely manner. A complete Mechanical \nIntegrity check was recently completed as part of the implementation of IIAR guidelines.\n\nManagement of Change\nWritten procedures are in place at Fowler Packing Company Plant #1 to manage changes in \nprocess chemicals, technology, equipment and procedures.  The most recent review/revision of \nmaintenance procedures was performed on 05/14/1999.  Process operators, maintenance \npersonnel or any other employee whose job tasks are affected by a modification in process \nconditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes \nare conducted as a regular practice at Fowler Packing Company Plant #1.  The most recent \nreview was performed on 05/14/1999.  These reviews are conducted to confirm that construction, \nequipment, operating and maintenance procedures are suitable for safe startup prior to placing \nequipment into operation.\n\nCompliance Audits\nFowler Packing Company Plant #1 conducts audits on a regular basis to determine whether the \nprovisions set out under the RMP"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13204,
      "SummaryText": "rule are being implemented.  The most recent compliance audit \nwas conducted on 05/14/1999.  These audits are carried out at least every 3 years and any \ncorrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nFowler Packing Company Plant #1 promptly investigates any incident that has resulted in, or \ncould reasonably result in a catastrophic release of a regulated substance.  These investigations \nare undertaken to identify the situation leading to the incident as well as any corrective actions to \nprevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nFowler Packing Company Plant #1 truly believes that process safety management and accident \nprevention is a team effort.  Company employees are strongly encouraged to express their views \nconcerning accident prevention issues and to recommend improvements.  In addition, our \nemployees have access to all information created as part of the facility\u0012s implementation of the \nRMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction \nactivities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the \ncontractor is carried out.  Fowler Packing Company Plant #1 has a strict policy of informing the \ncontractors of known potential hazards related the contractor\u0012s work and the processes.  \nContractors are also informed of all the procedures for emergency response should an accidental \nrelease of a regulated substance occur.\n\n\n5.\tFive-year Accident History\nFowler Packing Company Plant #1 has had an excellent record of preventing accidental releases \nover the last 5 years.  Due to our stringent release prevention policies, there has been no \naccidental release during this period.\n\n6.\tEmergency Response Plan\nFowler Packing Company Plant #1 carr"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 13204,
      "SummaryText": "ies a written emergency response plan to deal with \naccidental releases of hazardous materials.  The plan includes all aspects of emergency response \nincluding adequate first aid and medical treatment, evacuations, notification of local emergency \nresponse agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and \nserviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place \nwithin our processes that would require a modified emergency response.\n\nCounty of Fresno is the Local Emergency Planning Committee (LEPC) with which our \nemergency plan has been coordinated and verified.\n\n7.\tPlanned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various \nelements of our accidental release prevention program. Implementation of IIAR Ammonia \nGuidelines for PSM and RMP are some of the major steps we want to take to improve safety at \nour facility.  The complete implementation of IIAR guidelines for Ammonia Refrigeration is \nexpected to be implemented by 9/15/99. Changes resulting from the recent PHA will be in place \nwithin 12 months."
    }
  ]
}