{
  "FacilityID": 13220,
  "FacilityName": "City Ice Company-Denver",
  "FacilityStr1": "2101 31st Street",
  "FacilityStr2": null,
  "FacilityCity": "Denver",
  "FacilityState": "CO",
  "FacilityZipCode": "80216",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08031",
  "LEPC": "Denver LEPC",
  "FacilityLatDecDegs": "39.770278",
  "FacilityLongDecDegs": "-104.989167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Reddy Ice/Packaged Ice, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 364514133,
  "Company2DUNS": null,
  "OperatorName": "Packaged Ice, Inc./Reddy Ice Corp",
  "OperatorStr1": "2101 31st Street",
  "OperatorStr2": null,
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80216",
  "OperatorZipCodeExt": null,
  "FTE": 47,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000140448",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-04-22 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2015-06-09 00:00:00",
  "DeRegistrationEffectiveDate": "2015-06-05 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.769977,
  "FRS_Long": -104.987637,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17841,
      "AltID": null,
      "FacilityID": 13220,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 22412,
          "ProcessID": 17841,
          "ChemicalID": 56,
          "Quantity": 13000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 18292,
          "ProcessID": 17841,
          "NAICSCode": "312113",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 9460,
              "Process_NAICS_ID": 18292,
              "SafetyReviewDate": "1999-06-18 00:00:00",
              "PHA_Date": "1999-06-21 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "PHA revised, What If/Checklist described to be used.",
              "PHACompletionDate": "1999-06-21 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "no major hazards identified",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "exhaust purge fans",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "monitored by facility engineers that are on-site 24 hours per day, 7 days per week",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "no changes",
              "OpProceduresReviewDate": "1999-06-21 00:00:00",
              "TrainingReviewDate": "1999-06-21 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "conference room, video tapes",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-21 00:00:00",
              "EquipmentInspectionDate": "1999-06-21 00:00:00",
              "EquipmentTested": "all equipment inspected daily",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-21 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-21 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-21 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-06-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 13055,
                  "PreventionProgram3ID": 9460,
                  "ProcessChemicalID": 22412
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 13220,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-21 00:00:00",
    "ERTrainingDate": "1999-06-21 00:00:00",
    "CoordinatingAgencyName": "Denver Office of Emer. Preparedness",
    "CoordinatingAgencyPhone": "3036402616",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13220,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe City Ice Company facility located in Denver, Colorado manufactures ice for wholesale/retail distribution.  The facility utilizes approximately 13,000 pounds of anhydrous ammonia as a refrigerant for ice manufacturing and storage.\n\nThe facility refrigeration system is a standard refrigeration design using anhydrous ammonia as its refrigerant.  There are three operating systems, one exclusively for the ice makers, and a two-stage system for other plant requirements.  The compressors have numerous protective controls (motor overload, high discharge temperature, high discharge pressure, low suction pressure, and low oil pressure) that will shut down the compressor if operating limits are violated.  Four of the twelve compressors have micro-processor operating controls, the remaining eight are manually operated by the facility engineers that are on site 24 hours per day, 7 days per week.\n\nThe low suction on the two-stage system, which runs at approximately a 2.5 pound suction, operates the three blast freezers, the cold storage warehousing freezers, and the ice storage freezers.  The low suction system also has three independent low-pressure receivers with three independent pumps to supply liquid ammonia to the cold storage freezers, which are recirculated evaporator coils or air units.  The ice storage freezers have low-pressure vessels that supply the gravity fed, low-pressure coils in those freezers.  The high suction of the two-stage system operates at approximately a 25 pound suction, which maintains our ice-tank and two freezers.  The ice makers are independent and run at approximately a 20 pound suction.\n\nAll of the refrigeration systems are supplied liquid ammonia by two receivers located in the engine room.  The ammonia travels throughout the plant, through various control devices such as hand-expansion valves, direct-expansion valves and thermostatic-expansion valves, and extracts heat from freezers or water, in the case of the ice makers"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13220,
      "SummaryText": ".  At that point the ammonia turns to a gas and is pulled back to the engine room via the compressors.  The gas is then compressed and discharged through an oil separator into three shell and tube type condensers, out to the fan evaporative condensers, and returned back to the receiver to initiate the process over again.\n\nAn outside supplier delivers anhydrous ammonia to replenish the ammonia in the system, as required.\n\nAmmonia, when properly used, has proven to be a safe and reliable refrigerant.  The sharp odor of ammonia provides its own warning agent.  Practically all accidents involving anhydrous ammonia are the result of a lack of knowledge, misunderstanding, carelessness or poorly maintained or unsuitable equipment.\n\nThe City Ice facility is committed to operating a safe and compliant facility for the protection of its employees, the general public, and the environment.  The facility has multiple safeguards pertinent to the ammonia process.  These include an exhaust purge fans, controls which shut down the compressors if operating limits are violated, and the capability of shutting the entire system down if required.  Administrative controls are in place which limit the utilization of vessels at approximately 75% of their intended capacities.\n\nThe company has developed an emergency response and action plan which includes notification of emergency authorities/agencies and the public, to evacuation and first responder duties.\n\nMANAGEMENT SYSTEM\n\nThe City Ice Company facility has developed a management system to oversee the implementation of the risk management program elements.  A single person has been identified that has overall responsibility for developing, implementing and integrating the risk management program requirements.\n\nThere may be different levels of responsibility assigned, depending on the size and complexity of the facility.  A Risk Management Coordinator may be responsible for developing and implementing the overall risk management program, w"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13220,
      "SummaryText": "hile other personnel may be responsible for developing and implementing the operating procedures element or developing a particular operating procedure.  The management system is, therefore, operating at each of these levels depending on the way these responsibilities are carried out.\n\nThe Risk Management Coordinator is responsible for all aspects of the development and update of the overall Risk Management Program.  The coordinator will determine the necessity of establishing additional responsibilities for facility personnel concerning various operations at the facility.  As other personnel are identified, they will be documented and lines of authority will be defined within the management system.\n\nBy defining the lines of authority and roles and responsibilities of staff that oversee the risk management program elements it will:\n\n\u0015Ensure effective communication about process changes;\n\u0015Clarify the roles and responsibilities related to process safety issues;\n\u0015Avoid problems or conflicts among the people responsible for implementing elements of the program; and\n\u0015Ensure that the program elements are integrated into an ongoing approach to identifying hazards and managing risks.\n\nManagement commitment to process safety is critical in the facility's risk management program.  For process safety to be a constant priority, the facility will remain committed to every element of the risk management program.\n\nTo maintain an integrated approach to managing risks, each RMP rule element will be implemented on an ongoing, daily basis and become a part of the way the facility operates.\n\nRisk Management Coordinator:Kevin Enders\nTitle:Plant Manager\n\nAdditional Responsible Personnel:None at this time.\n\nHAZARD ASSESSMENT\n\nAs per the requirements of the Risk Management Program regulations, the City Ice facility has conducted offsite consequence analyses relative to the potential accidental release of anhydrous ammonia.  The scenarios related to a worst case release scenario and an alte"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13220,
      "SummaryText": "rnative release scenario.  This involved calculating worst case and alternative scenarios utilizing the RMP*Comp modeling program.\n\nThe facility considered worst case release scenarios relating to the receiver within the enclosed ammonia system, as it would house the largest mass of a regulated substance at any given time. The release model considered the potential release of 4,400 pounds of liquid ammonia from the vessel, during a 10 minute release.  The scenario endpoint was 0.6 mile.  This scenario generated a toxic endpoint of 200 ppm, the maximum airborne concentration below which it is believed nearly all individuals can be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individuals ability to take protective action.\n\nAlternative scenarios, or potentially more likely scenario, for the facility system were considered and it was determined that there is a potential loss of ammonia due to the breaking of a 3/4 line.  The predicted distance to the 200 ppm endpoint is 0.2 mile."
    }
  ]
}