{
  "FacilityID": 13280,
  "FacilityName": "Deerfield Beach West Water Treatment Plant",
  "FacilityStr1": "290 Goolsby Blvd",
  "FacilityStr2": null,
  "FacilityCity": "Deerfield Beach",
  "FacilityState": "FL",
  "FacilityZipCode": "33442",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12011",
  "LEPC": null,
  "FacilityLatDecDegs": "26.314444",
  "FacilityLongDecDegs": "80.125278",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "A5",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Deerfield Beach",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Deerfield Beach",
  "OperatorStr1": "290 Goolsby Blvd",
  "OperatorStr2": null,
  "OperatorCity": "Deerfield Beach",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33442",
  "OperatorZipCodeExt": null,
  "FTE": 11,
  "OtherEPAFacilityID": "PWS #4060254",
  "EPAFacilityID": "100000139664",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-24 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 26.31462,
  "FRS_Long": -80.12596,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17924,
      "AltID": "Chlorination",
      "FacilityID": 13280,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 22514,
          "ProcessID": 17924,
          "ChemicalID": 62,
          "Quantity": 60000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 18377,
          "ProcessID": 17924,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 9504,
              "Process_NAICS_ID": 18377,
              "SafetyReviewDate": "1999-06-18 00:00:00",
              "PHA_Date": "1999-05-25 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-11-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "scrubber",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-18 00:00:00",
              "TrainingReviewDate": "1999-06-18 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-18 00:00:00",
              "EquipmentInspectionDate": "1999-06-18 00:00:00",
              "EquipmentTested": "Chlorine Analyzers",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-18 00:00:00",
              "PreStartupReviewDate": "1999-03-01 00:00:00",
              "ComplianceAuditDate": "1999-05-24 00:00:00",
              "AuditCompletionDate": "1999-06-18 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-18 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-18 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-18 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-18 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 13111,
                  "PreventionProgram3ID": 9504,
                  "ProcessChemicalID": 22514
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 13280,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-18 00:00:00",
    "ERTrainingDate": "1999-06-08 00:00:00",
    "CoordinatingAgencyName": "District XI LEPC",
    "CoordinatingAgencyPhone": "9549854416",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13280,
      "SummaryText": "Executive Summary\n\nThe City of Deerfield Beach (City) has developed a Process Safety / Risk Management Program for control of catastrophic releases of hazardous substances at its West Water Treatment Plant (WTP) in Deerfield Beach, Florida.  This program continues the City's commitment to the protection of its employees and the community and the control of the potential for such a release.  To date, no such release has ever occurred at the plant.\n\nRegulatory Applicability\n\nOSHA's Process Safety Management standard (29 CFR 1910.119, as cited by the Florida Department of Employment) and USEPA's Chemical Accident Prevention Rule (40 CFR 68) require a Risk Management Program.  The OSHA standard applies to any process that involves more than 1,500 pounds of chlorine.  USEPA's rule applies to any process that involves more than 2,500 pounds of chlorine.  This program applies to the use of chlorine for disinfection of water at this WTP because the plant has the capacity to store up to 30 one ton containers of chlorine onsite.   \n\nProgram Summary\n\nThe programs described in this Risk Management Plan supplement the procedures described in other City of Deerfield Beach  documents such as general administrative guidelines and safety and health manuals.  The Plan addresses Deerfield Beach 's program management procedures, process safety information, hazard review, operating procedures, employee training, safe work practices, and emergency response.  Each topic has its own section in this program document.\n\nProgram Management\n\nThe City has concluded that systematic management policies, procedures, and practices are fundamental to minimizing the possibility of chemical releases and their associated economic costs.  The program management procedures described in this Plan consist of the following elements:\n\n# Definition of Roles and Responsibilities\n# Employee Participation\n# Pre-Startup Safety Review\n# Management of Change Procedures\n# Incident Investigation\n# Inspection and Comp"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13280,
      "SummaryText": "liance Audits\n# Program Maintenance\n\nProcess Safety Information\nChlorine is currently used at the West WTP as a disinfection agent to meet Safe Drinking Water Act requirements.  Chlorine can be added to the treatment process in either the raw water, after the softening unit, after the air stripper, or in the high service pump suction.  Chlorine is stored onsite in up to 30 one-ton pressurized containers, and is conveyed under vacuum into high pressure service water by means of two vacuum ejectors.  The process safety information described in this Plan consists of the following:  \n\n# Chlorine Hazards and Physical Data\n# Process Description and Technology\n# Process Chemistry\n# Material and Energy Balance\n# Chemical Quality and Inventory\n# Safe Upper and Lower Operating Limits\n# Process Equipment Descriptions\n\nOffsite Consequence Analysis\n\nOffsite consequence analysis was conducted for both a worst case and an alternate release accident scenario.  The purpose of these analyses was to determine the extent to which outside receptors, such as local residents, public areas, and environmental receptors, could potentially be affected by the accidental release of chlorine.\n\nWorst Case Scenario\n\nThe worst case scenario was based on a release of the maximum amount of chlorine from a single container (2,000 lbs) in 10 minutes (USEPA standard).  The predicted wind speed was 1.5 meters per second (USEPA standard).  Passive mitigation was assumed for this scenario, consisting solely of the concrete building enclosure.  Based on these assumptions, a release of 2,000 pounds of chlorine occurring at the storage facility could result in an affected area with a radius of 0.9 miles.  Approximately 3,000 residents fall within this potential impact zone.  If such a release did occur, however, the impact zone would depend upon wind direction and speed, and would not be a circular zone around the source as indicated in this scenario.\n \nAlternate Case Scenario\n\nThe alternate case scenario was"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13280,
      "SummaryText": "based on a partial release of a toxic substance from a system or process.  This type of release may result from a ruptured container, ruptured seal, or broken valve.  This scenario was based on the release of 2,000 lbs (one container) of chlorine under the following conditions: 1-inch rupture in the container (diameter of valve opening); container is under 35 psi (Chlorine Institute, Inc. Standard); the container temperature is 80 deg F (average ambient temperature); release duration is 34 minutes (time to empty container); and wind speed is 3 meters per second (USEPA standard).  Both active and passive mitigation were assumed to be operating, with a fully enclosed concrete building and an active scrubber sized to contain the release of more than 2,000 lbs of chlorine. Under these conditions the distance to the toxic endpoint would be less than 0.1 miles, or less than 525 feet. \n  \nNo residents would fall within the alternative release impact zone, nor would any public or environmental receptors.\n\nTraining\n\nThe City has implemented a training program with guidelines for conducting regular, structured plant training for West WTP employees.  Training record forms document the required training.  The training records for all personnel associated with the covered processes appear in the training file kept at the plant.\n\nOperating Procedures\n\nThe City  has adopted standard operating procedures (SOPs) that provide system descriptions, specifications, and operating procedures for the chlorine systems.  The procedures, presented in Section 6, address startup, shutdown, inspections, temporary operation, emergency procedures, and troubleshooting.  Maintenance SOPs appear in Section 7, along with other safe work practices for handling chlorine and working in and around chlorine facilities.\n\nEmergency Response Procedure\n\nAn Emergency Response Procedure documents the measures the City will take to control process upsets and chlorine releases.  The City's policy is to immediatel"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13280,
      "SummaryText": "y call the fire department in the event of a major release.  The emergency response procedures therefore focus on keeping the WTP employees away from dangerous areas, while the mechanical equipment and City emergency services control the chemical release.  The Emergency Response Procedures consist of the following elements:\n\n# Recognition of a release\n# Notification of Authorities\n# Shutdown Procedures and Emergency Plant Operation\n# Release Control and Mitigation\n# Evacuation Plan\n# Medical Emergencies\n# Written Reports\n\nProcess Hazard Review\n\nThe City conducted a hazard review for the chlorine process.  The hazard review team consisted of plant management, process operation and maintenance experts, City risk management personnel, outside process design engineers, and consultants knowledgeable in the hazard review process itself.  The following recommendations for improving overall chlorine system safety were made during the hazard review:\n\n#The City's fire department is currently designated as first responders.  The City may want to examine its current policy of plant staff not responding to chlorine releases, which is established by its lack of proper safety clothing or proper certification as first responders, to determine if any updates of this policy are required.\n\n#The City should keep a set of truck chocks in the chlorine storage room, and operators should be made aware that chocks must be used for all chlorine deliveries.\n\n#Operators should periodically test the chlorine storage area hoist without a container loaded to ensure the switches are correctly latched and positioned.  \n\n#Operators should change ammonia solution in the plastic test bottle and the gas filters in the vacuum regulators quarterly.  Bottles should be dated after each change out.\n\n#Operators should exercise the scrubber for 10 minutes once a month (turn on and operate pumps and blower).\n\n#Chlorine delivery trucks should be required to call from the gate before entering the WTP site.\n\n#The"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13280,
      "SummaryText": "remote controller for the overhead hoist should be used whenever possible in order to keep operator a safe distance from the suspended tank.\n\n#Hot work permits should be used for all welding or similar work in or near the chlorination facility.\n\n#Operators should be reminded periodically that the storage of anything other than chlorine containers in the chlorine storage room is prohibited.\n\n#\tOperators should not enter the chlorine facilities area under any conditions without a second operator on the WTP grounds.\n\n#No work should be done on the chlorination equipment (i.e. manual switchover, container change-out, etc.) without a minimum of two operators in the immediate area.\n\n#A high water flood alarm should be added near the floor on the wall of the chlorinator room.  The alarm will activate in the event of a utility water or chlorine solution leak in the chlorinator room.\n\n#Access to the chlorine facilities should be prohibited any time the eyewash stations are out of commission.\n\n#Lock-out capability should be considered in locations where only tagout is currently possible.\n\n#The water treatment plant should be shut down during scheduled short term maintenance or repairs of the chlorination system which prohibit feeding chlorine to the treatment process.\n\n#The City should obtain a weather alert radio for use at the west water treatment plant, so that they can respond quickly in the event of a weather emergency.\n\n#The City should ensure that the maintenance supervisor inspects and approves all repairs to the chlorination system.\n\n#Only authorized visitors should enter chlorine areas, and only with a qualified individual.\n\n#Third-party contractors must be pre-qualified and authorized by WTP staff before performing work in sensitive areas."
    }
  ]
}