{
  "FacilityID": 13369,
  "FacilityName": "Cenex Petroleum, Perham Facility",
  "FacilityStr1": "County road 80 east",
  "FacilityStr2": null,
  "FacilityCity": "Perham",
  "FacilityState": "MN",
  "FacilityZipCode": "56573",
  "Facility4DigitZipExt": "0126",
  "FacilityCountyFIPS": "27111",
  "LEPC": "Ottertail County LEPC",
  "FacilityLatDecDegs": "46.583111",
  "FacilityLongDecDegs": "-95.554806",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Cenex Petroleum",
  "OperatorStr1": "P.O. Box 247",
  "OperatorStr2": "459 3rd Ave Southeast",
  "OperatorCity": "Perham",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56573",
  "OperatorZipCodeExt": "0247",
  "RMPContact": "Dana Loken",
  "RMPTitle": "Petroleum Manager",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000141241",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-01 00:00:00",
  "SafetyInspectionBy": "Farmer Union Insurance Company",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-08-12 00:00:00",
  "DeRegistrationEffectiveDate": "2010-01-01 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 46.58311,
  "FRS_Long": -95.55481,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18032,
      "AltID": "Propane Storage Facility",
      "FacilityID": 13369,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 18485,
          "ProcessID": 18032,
          "NAICSCode": "454312",
          "_desc": {
            "NAICS_CODE": "454312",
            "NAICS_DESCRIPTION": "Liquefied Petroleum Gas (Bottled Gas) Dealers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 22636,
          "ProcessID": 18032,
          "ChemicalID": 98,
          "Quantity": 107687.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 522636,
          "ProcessID": 18032,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13369,
      "SummaryText": "              Risk Management Plan (RMP) - Propane\n                       Executive Summary\n                Cenex Petroleum, Perham Facility\n                       Perham, Minnesota\n                                \n                                \n                                \n  1. Accidental Release Prevention and Emergency Response Policies\nWe at Cenex Petroleum in Perham are strongly committed to employee, public, and environmental\nsafety.  This commitment is an inherent part of our comprehensive accidental release prevention\nprogram that covers areas such as design, installation, operating procedures, maintenance, and\nemployee training associated with the processes at our facility.  It is our policy to implement\nappropriate controls to prevent possible releases of regulated substances.  If such a release does\noccur, our trained emergency response personnel are at hand to control and mitigate the effects of\nthe release.  We also coordinate our response efforts with the Perham Fire Department, which\nprovides additional emergency response expertise.\n\n  2. Stationary Source and Regulated Substances Handled\nOur facility's primary activities include propane distribution to domestic and commercial customers. \nWe have propane  stored in a 30,000-gallon tank located at our facility in Perham (Figure 1).  The\nmaximum amount stored is 25,500 gallons (107,686.5 pounds) at the maximum fill capacity of 85%.\n\n  3. Worst Case Release and Alternative Release Scenarios\nWe utilized RMP PRO for the worst case and alternate case scenarios of the required offsite\nconsequence analysis for our facility.  The following details these scenarios.\n\nThe worst case release scenario involves a catastrophic release of the entire contents of the propane\nstorage tank (108,686.5 pounds) in gaseous form over a 10-minute period.  At Class F atmospheric\nstability and 1.5 m/s wind speed, the maximum distance to an endpoint of 1 psi overpressure is 0.38\nmiles (Figure 2).  This amount of overpressure"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13369,
      "SummaryText": " can cause partial demolition of houses and can result\nin serious injury to people within this distance.  The estimated population within a 0.38-mile radius\nof this facility is 40.\n\nThe alternative release scenario involves a 30-minute release of propane from a product line that\ncontacts an ignition source and detonates, resulting in a vapor cloud explosion.  Under neutral\nweather conditions, the maximum distance to an endpoint of 1 psi overpressure is 0.12 mile (Figure\n3).  The estimated population within a 0.12-mile radius of this facility is 15.\n\n     4. General Accidental Release Prevention Program\nOur facility has taken all the necessary steps to comply with the EPA's accidental release prevention\nrequirements as set forth in 40 CFR part 68.  The following sections briefly describe the elements\nof the release prevention program that is in place at our stationary source.\n\n\nProcess Safety Information\nCenex Petroleum maintains a detailed record of safety information that describes the chemical\nhazards, operating parameters, and equipment designs associated with all processes (Appendix D).\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are\nidentified and controlled effectively.  Any findings from the hazard analysis are addressed in a\ntimely manner.\n\nOperating Procedures\nCenex Petroleum maintains written operating procedures to ensure that activities within our covered\nprocesses are conducted safely.  These procedures address various modes of operation; the\ninformation is regularly reviewed and is readily accessible to operators involved in the processes\n(Appendix B).\n\nTraining\nCenex Petroleum has a comprehensive training program in place to ensure that employees who are\noperating processes are competent in the operating procedures associated with these processes.\n\nMechanical Integrity\nCenex Petroleum conducts documented maintenance checks on process equipment to ensure proper\noperation.  Ma"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13369,
      "SummaryText": "intenance checks are performed by qualified personnel with previous training in\nmaintenance practices.  Examples of process equipment that would receive maintenance checks\ninclude:  pressure vessels, storage tanks, piping systems, relief and vent systems, emergency\nshutdown systems, controls, and pumps.  Any equipment deficiencies identified by the maintenance\nchecks are corrected in a safe and timely manner (Appendix C).\n\nManagement of Change\nWritten procedures are in place at Cenex Petroleum to manage changes in process chemicals,\ntechnology, equipment, and procedures.  Process operators, maintenance personnel or other\nemployees whose job tasks are affected by a modification in process conditions are promptly notified\nof the modification and offered training to deal with it.\n\nPre-startup Reviews\nCenex Petroleum routinely conducts pre-startup safety reviews related to new processes and\nmodifications in established processes.  These reviews are conducted to confirm that construction,\nequipment, and operating and maintenance procedures are suitable for safe startup prior to placing\nequipment into operation.\n\nCompliance Audits\nCenex Petroleum conducts compliance audits on a regular basis to determine whether the provisions\nof the plan, as set out under 40 CFR part 68, are being implemented.  Any non-compliance issue\ndiscovered during the audit is promptly corrected.\n\nEmployee Participation\nCenex Petroleum truly believes that process safety management and accident prevention is a team\neffort.  Company employees are strongly encouraged to express their views concerning accident\nprevention issues and to recommend improvements.  In addition, our employees have access to all\ninformation created as part of the facility's implementation of the RMP particularly information\nresulting from process hazard analyses.\n\n  5. Five-year Accident History\nCenex Petroleum has had an excellent record of preventing accidental releases over the last 5 years. \nDue to our stringent release pr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13369,
      "SummaryText": "evention policies, no accidental release has occurred during this\nperiod.\n\n  6. Emergency Response Plan\nCenex Petroleum maintains a written emergency response plan to deal with accidental releases of\nhazardous materials.  The plan addresses all aspects of emergency response including first aid and\nmedical treatment, evacuations, and notification of local emergency response agencies and the public\n(Appendix A).\n\n  \n"
    }
  ]
}