{
  "FacilityID": 13401,
  "FacilityName": "City of Burbank Public Service Department",
  "FacilityStr1": "164 W. Magnolia Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Burbank",
  "FacilityState": "CA",
  "FacilityZipCode": "91502",
  "Facility4DigitZipExt": "1720",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.177833",
  "FacilityLongDecDegs": "-118.31475",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.burbank-utilities.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 120351291,
  "ParentCompanyName": "City of Burbank",
  "Company2Name": null,
  "CompanyDUNS": 71906432,
  "Company2DUNS": 0,
  "OperatorName": "City of Burbank Public Service Dept",
  "OperatorStr1": "P.O. Box 631",
  "OperatorStr2": null,
  "OperatorCity": "Burbank",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91503",
  "OperatorZipCodeExt": "0631",
  "FTE": 312,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000140279",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "025638",
  "SafetyInspectionDate": "1998-02-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-08-11 00:00:00",
  "DeRegistrationEffectiveDate": "2000-05-31 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.17857,
  "FRS_Long": -118.31612,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18090,
      "AltID": "Olive Power Plant",
      "FacilityID": 13401,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 22715,
          "ProcessID": 18090,
          "ChemicalID": 62,
          "Quantity": 3000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 18543,
          "ProcessID": 18090,
          "NAICSCode": "221119",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 9605,
              "Process_NAICS_ID": 18543,
              "SafetyReviewDate": "1998-12-23 00:00:00",
              "PHA_Date": "1997-08-04 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "fuse plugs on one-ton containers",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "revision of operating and maintenance procedures",
              "OpProceduresReviewDate": "1998-12-23 00:00:00",
              "TrainingReviewDate": "1998-12-23 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-12-23 00:00:00",
              "EquipmentInspectionDate": "1999-06-02 00:00:00",
              "EquipmentTested": "chlorine injection equipment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1998-12-23 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-12-23 00:00:00",
              "HotWorkPermitReviewDate": "1998-12-23 00:00:00",
              "ContractorSafetyReviewDate": "1998-12-23 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 13239,
                  "PreventionProgram3ID": 9605,
                  "ProcessChemicalID": 22715
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 13401,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Burbank Fire Department",
    "CoordinatingAgencyPhone": "8182383473",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13401,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe City of Burbank Public Service Department (City of Burbank PSD) facility has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Action Plan Manual, which is maintained at the facility and updated as necessary.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nCity of Burbank PSD maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, chlorine health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes.\n\nCity of Burbank PSD has coordinated emergency response efforts with the local fire department.  In the case of a chlorine-related emergency, it is the policy of City of Burbank PSD to evacuate and to allow the fire department and/or the chemical supplier to respond to the emergency.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe City of Burbank PSD facility is located at 164 W. Magnolia Boulevard, Burbank, California 91502.  The system was constructed in accordance with all applicable federal, state, and local regulations.  The facility is surrounded by chain link fence with access through one gate only.  Visitors are permitted to enter the facility by checking in with the guard.\n\nThe Olive Power Plant chlorine system is operated under a vacuum.  One ton containers of chlorine are used to treat cooling tower water for the Olive Power Plant.  The chlorine gas leaving the container passes through a heate"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13401,
      "SummaryText": "r and a vacuum regulator to ensure the chlorine is a gas before it reaches the flow controller.  After the flow controller, the chlorine is injected (by the injector) into the water line to create a chlorine solution.  The chlorine controller and chlorine analyzer regulate the flow of water through an electrically operated ball valve.  The incoming water and the outgoing solution are non-potable.  In an emergency, a metal rod is connected to the valve stem on the chlorine tank.  The metal rod passes through a hole in the wall and allows an operator to isolate the chlorine tank (by closing the valve) from outside of the building.\n\nAnother chlorine system at the City of Burbank PSD facility, the Magnolia Power Plant, is currently not in service.  No chlorine is associated with the Magnolia Power Plant in any capacity, storage or otherwise.  The system is not currently used, nor is it planned to be used in the foreseeable future.  If the system is brought back on line, the required RMP filing will occur at that time.\n\nHAZARD ASSESSMENT SUMMARY\n\n*  Worst Case Release Result Summary\n\n      Scenario Description:  Release of the maximum quantity of chlorine that can be stored in a vessel (one-ton container) - 2,000 pounds in 10 minutes.  The most pessimistic meteorological conditions were used: 1.5 meters per second wind speed, and F stability.  No passive mitigation measures were taken into account as the release could occur outside.  The Risk Management Program Guidance for Waste Water Treatment Plants reference tables were used to determine the maximum distance to the toxic endpoint of 3 ppm in urban conditions.\n\n*  Alternative Release Result Summary\n\n     Scenario Description: A release of chlorine resulting from a material failure of a fusible plug (normally designed to melt between 158-165 F).  The release rate of chlorine based on chemical-specific considerations is 30 pounds per minute.  The meteorological conditions used were 1.5 meters per second wind speed, and "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13401,
      "SummaryText": "F stability (a more conservative approach than the allowed conditions:  3.0 m/s and D stability).  No passive mitigation measures were taken into account as the release could occur outside.  A dispersion model for dense gas releases, Degadis, was used to determine the maximum distance to the toxic endpoint of 3 ppm in urban conditions.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe City of Burbank PSD chlorine systems have many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the City of Burbank PSD facility operates in accordance with OSHA's Process Safety Management regulation and the California Accidental Release Prevention (CalARP) Program.\n\nThere are chlorine detectors that trigger audible and visual alarms for the chlorine system.  The chlorine system at the Burbank PSD main site are connected to the facility's SCADA (data acquisition) system, which pages operators in case of an emergency.\n\nIn addition, common industry standards, policies, and procedures are utilized to ensure safe practices are being performed.  This includes common practices recommended by the Chlorine Institute.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no chlorine accidents at the facility since June 1994.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe City of Burbank Public Service Department (City of Burbank PSD) facility has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Action Plan Manual, which is maintained at the facility and updated as necessary.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nCity of Burbank PSD maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and noti"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13401,
      "SummaryText": "fication procedures, evacuation routes, chlorine health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes due to the renovation of the facility.\n\nCity of Burbank PSD has coordinated emergency response efforts with the local fire department.  In the case of a chlorine-related emergency, it is the policy of City of Burbank PSD to evacuate and to allow the fire department and/or the chemical supplier to respond to the emergency.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazard Analysis (PHA) provided mitigation measures to improve safety at the City of Burbank PSD facility located at 164 W. Magnolia Boulevard, Burbank, California 91502.   The recommendations are scheduled to be complete by June 1, 1999.\n\nHAZOP Study\n\nR01    Calculate the amount of heat that could be created during a fire in the cooling tower.  If it can heat the tank to 157 F the fuse plug would open.  (The heat would be from radiant energy.)  A cooling tower fire may not create enough heat to raise the temperature of the chlorine substantially.\n\nR02    Verify that the solenoid in the chlorine line shuts if there is a power outage. \n\nR03    Evaluate and develop a method to connect the chlorine detectors to a back-up power supply.\n\nR04    Maintain an Emergency Kit B on-site and ensure that all necessary personnel are instructed in how to use it.  \n\nR05    If the Public Service Department plant does not want to be the responder to emergencies, this should be communicated to the Fire Department.  The Fire Department should come to the facility and perform drills with the PSD approximately once a year.\n\nR06    Ensure all employees, including the office employees, are made aware of all chemicals on-site.  A basic certificat"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13401,
      "SummaryText": "ion form should be implemented.\n\nR07    Implement a procedure which has all tank change employees sign a sheet that they are trained and understand the tank change procedures.  \n\nR08    Place orange caution cones around AHM delivery trucks to block and warn people that a chemical delivery is in progress.\n\nNote:   R09 through R20 addressed systems that are not subject to the RMP.\n\nProcedures Review\n\nR21    Formalize a form for the employees to sign which states that they have been trained in their required emergency response procedures and that they understand those procedures.\n\nWhat-If Walkthrough\n\nNote:   R22 addressed a system that is not subject to the RMP.\n\nR23    Install a plant-wide visual alarm system to notify all employees in case of an emergency AHM release (an audible alarm might not be noticed by operators working in noisy environments).\n\nSeismic Assessment\n\nNote:   S01 addressed a system that is not subject to the RMP.\n\nS02    Cylinders in use which contain AHM should be restrained top and bottom with snugly fitted, robust chains so that they are unable to slide from under the chains.  The chain restraints should be attached to either a structural wall or, horizontal bars that can be connected to structural columns and the cylinders, in turn, can be secured to the bars.\n\nS03    Secure the timber cradles used to support one-ton chlorine cylinders to the floor and to the cylinders themselves."
    }
  ]
}