{
  "FacilityID": 13431,
  "FacilityName": "Lyondell Chemical R&D Facility",
  "FacilityStr1": "3801 West Chester Pike",
  "FacilityStr2": null,
  "FacilityCity": "Newtown Square",
  "FacilityState": "PA",
  "FacilityZipCode": "19073",
  "Facility4DigitZipExt": "2387",
  "FacilityCountyFIPS": "42045",
  "LEPC": "Emergency Services, Delaware C",
  "FacilityLatDecDegs": "39.993333",
  "FacilityLongDecDegs": "75.409722",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 617421870,
  "ParentCompanyName": "Lyondell Chemical Company",
  "Company2Name": null,
  "CompanyDUNS": 181843095,
  "Company2DUNS": null,
  "OperatorName": "Charles W. Ruoff",
  "OperatorStr1": "3801 West Chester Pike",
  "OperatorStr2": null,
  "OperatorCity": "Newtown Square",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19073",
  "OperatorZipCodeExt": "2387",
  "FTE": 623,
  "OtherEPAFacilityID": "19073RCCHM3801W",
  "EPAFacilityID": "100000141456",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-16 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2000-10-04 00:00:00",
  "DeRegistrationEffectiveDate": "2000-09-29 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.988022,
  "FRS_Long": -75.414986,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18146,
      "AltID": "E1 Polyols Pilot Plant",
      "FacilityID": 13431,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 22797,
          "ProcessID": 18146,
          "ChemicalID": 12,
          "Quantity": 42900.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 18612,
          "ProcessID": 18146,
          "NAICSCode": "54171",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 13431,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-11-16 00:00:00",
    "ERTrainingDate": "1999-06-19 00:00:00",
    "CoordinatingAgencyName": "Emergency Services, County of Delaw",
    "CoordinatingAgencyPhone": "6105658700",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13431,
      "SummaryText": "Lyondell Chemical Company\nResearch & Development Facility\nNewtown Square, Pa.\n\n\nEPA RMPlan Executive Summary\n\n\nINTRODUCTION:\n \n\nSITE HISTORY\n\nLyondell is one of the world's largest chemical companies.  The Lyondell enterprise is \ncomprised of the former ARCO Chemical Company, acquired by Lyondell in 1998.  \nLyondell also has major ownership positions in Equistar Chemicals, Lyondell-Citgo Refining \nand Lyondell Methanol Company.    In total, Lyondell operates in 15 countries and has \napproximately 11,000 employees worldwide.   \n\nThe Newtown Square Research & Development (R&D) Facility was opened by Atlantic \nRichfield Company in 1980.  Since then, the Newtown Square facility has operated as a \nresearch and development center for ARCO Chemical Company (ACC).  Beginning in 1987, \nthe site also became ACC's world-wide corporate headquarters. In July of 1998, Lyondell Chemical Company purchased ARCO Chemical Company and is in the process of \nrelocating its corporate headquarters to Houston.  The site is and will continue to serve as the \nprimary R&D location for Lyondell Chemical Company. \n\n\n1.0 ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Lyondell Newtown Square R&D Facility is committed to operating and maintaining all \nof our laboratories and processes in a safe and responsible manner.  We have implemented a \ncombination of accidental release prevention programs and emergency response planning \nprograms to help ensure the safety of our employees and the public, as well as to protect the \nenvironment.  These programs are designed to meet or exceed governmental requirements \nsuch as the Environmental Protection Agency's (EPA) Risk Management Program (RMP) \nrule (40 CFR Part 68) and the Occupational Safety and Health Administration's (OSHA) \nProcess Safety Management (PSM) Standard (29 CFR Part 1910.119).  This document is \nintended to satisfy the RMP Plan requirements of the RMP rule and to provide the public \nwith a description of the risk managem"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13431,
      "SummaryText": "ent program at the facility.\n\n\n2.0 STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nOur facility is not a manufacturing site.  The Lyondell Chemical Company R&D Facility \noperates laboratory and pilot plant operations designed to support company manufacturing \nsites as well as develop new processes. Processes supported include propylene oxide and it's \nderivatives.  In our research and development processes, we use the following chemicals that \nthe EPA has identified as having the potential to cause significant off site consequences in \nthe event of a substantial accidental release:\n\nToxics\n\nThe Lyondell R&D facility stores and handles only one chemical in quantities exceeding the \nEPA defined threshold quantity:  propylene oxide.  The Polyols Pilot Plant uses propylene \noxide to prepare experimental samples of intermediate urethane chemicals.  Propylene oxide \nis used as a reaction component to make polyols which Lyondell's customers use to make \nfoam seating and mattresses, sneaker soles, coatings, adhesives, sealants, elastomers and \nother consumer products.\n\nFlammables\n\nThe Lyondell Chemical Company R&D Facility does not handle or store any listed \nflammables in excess of the threshold quantity.\n\n\nManagement systems are in place to ensure that the site optimizes the amount of chemicals \non site by:\n\n* ordering chemicals in minimum quantities \n* maintaining accurate inventory records and sharing chemicals between different users in \n  order to avoid duplicate inventories\n* designing projects to minimize sample sizes\n* working with vendors to provide \"just in time\" delivery.  \n\n\n3.0 KEY OFFSITE CONSEQUENCE ANALYSIS SCENARIOS\n\nRMP PROGRAM LEVEL\n\nThe Lyondell Chemical Company Newtown Square Research and Development Facility is \nclassified as a Program 1 Process under the EPA's Risk Management Program rule 40 CFR \n68.  Program 1 Process designation indicates that although the site handles and uses a listed \nchemical above the threshold quantity, the distance to endpoint f"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13431,
      "SummaryText": "or the worst case accidental \nrelease scenario is less than the distance to the nearest public receptor.  Additionally, the \nprocess has not had any accidental releases in the past five years resulting in an on-site death, \ninjury, or property damage; or an off-site death, injury, evacuation, shelter-in-place, \nproperty damage, or environmental damage as outlined in the risk management program rule \n(40 CFR 68.10 (b)(1)).\n\nLyondell Newtown Square performed off-site consequence analyses to estimate the potential \nfor an accidental release of a regulated substance that may affect the public or the \nenvironment. The USEPA - RMP Offsite Consequence Analysis Guidance Document (OCA \nGuidance), dated May 24 1996, was utilized.  EPA Off-Site Consequence Analysis (OCA) \nGuidance Tables were used for evaluating the worst case scenarios and alternative release \nscenarios for flammable and toxic materials. \n\nThe following is a brief summary of the worst case scenario for the only covered chemical at \nour site, propylene oxide.  Key administrative controls and mitigation measures implemented \nto limit the exposure distances are included with the scenario description.\n\nWorst-Case Release Scenario - Regulated Toxic Chemical : Propylene Oxide\n\nThe  propylene oxide worst case scenario assumes 'instantaneous' failure of a Polyol Pilot \nPlant propylene oxide tank.  When full, the tank holds 2600 pounds of propylene oxide. The \ntank contents would be contained within a concrete dike area with a vapor release resulting \nfrom the evaporation of the liquid pool within the dike. The release and corresponding \ndistance to endpoint (derived from EPA method) remains within the site fence line and does \nnot affect any public receptors.\n\nThe following 'Passive Mitigation' measure was used in this analysis:\n\n * Concrete Dike: the concrete, secondary containment dike contains the propylene oxide \n    release and minimizes propylene oxide evaporation to the atmosphere. \n\n\nActive Mitigation:\n\nBy de"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13431,
      "SummaryText": "finition, the worst case analysis does not allow credit to be taken for active mitigation \nsystems.  However, the Polyols Pilot Plant has in place many layers of protection designed to \nprevent and if necessary, detect and respond to any spills or leaks of propylene oxide.  These \nactive controls include but are not limited to the presence of OSHA PSM certified operators \nduring all operating hours, the design and use of multiple automatic shutdown systems (that \nhave been confirmed to be Y2K compliant) and the presence of automatic leak detection and \nfire suppression systems throughout the complex.\n \nIn addition to the active mitigation systems described above, we maintain:\n\n * emergency responders and emergency management organization members on 24 hr. call\n * integrated process control and alarm systems to alert operating personnel in the process area\n   and central security\n * highly-trained emergency management personnel\n * fire-safety officers that are trained as Emergency Medical Technicians\n * more than adequate supply of emergency and spill response equipment\n\n\nWorst-Case Release Scenario(s) - Regulated Flammable Chemicals\n\nThe Newtown Square R&D facility does not use or store any listed flammable chemicals in \nexcess of the threshold quantity.  Even though we do not use or store any listed flammable \nchemicals in excess of the threshold quantity, each process area in which listed chemicals are \nused and stored was evaluated. This information is used to help ensure that our emergency \nresponse plan and the community emergency response plan address all reasonable \ncontingency cases.\n\n\n4.0  ACCIDENTAL RELEASE PREVENTION PROGRAM \n\nThe Newtown Square R&D facility maintains programs to help prevent accidental releases \nand ensure safe operation. These individual elements of our prevention program collectively \nhelp prevent accidental chemical releases.  The accident prevention programs in place \ninclude, but are not limited to:\n\n * Written Safety Policies and P"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13431,
      "SummaryText": "rocedures\n * Employee Training and Qualification Programs\n * Safety Reviews that use hazard evaluation methodologies for all new projects\n * Operational changes to existing processes that are evaluated using risk assessment and \n   hazard evaluation methods.\n * Experiments and pilot process units that are designed and built with appropriate levels of \n   safety redundancy, reflecting the hazards present.  These include such things as \n   equipment interlocks and automatic emergency shutdown systems.\n * Incident / accident reporting and investigation procedures.\n * Employee 'near miss' event reporting / resolution system.\n * Regular housekeeping and safety inspections that are conducted for all operating areas.\n\n\n\n5.0 FIVE - YEAR ACCIDENT HISTORY\n\nThe site has not had any releases which resulted in an on-site death, injury, or serious \nproperty damage; or an off-site death, injury, evacuation, shelter-in-place, property damage, \nor environmental damage during the past five years.  In fact, since we opened this facility, in \n1980, we have not had any chemical releases with off site consequences.\n\n\n6.0 EMERGENCY RESPONSE PROGRAM\n\nWe maintain an integrated contingency plan, which consolidates all of the various federal, \nstate, and local regulatory requirements for emergency response planning.  Our program, \nreferred to as the 'Comprehensive Emergency Management Plan' or CEMP, provides the \nessential planning and training for effectively protecting the workers, the public, and the \nenvironment during emergency situations.  Lyondell Newtown Square management \ncoordinates our plan with the community emergency response plan through the Director of \nEmergency Services, County of Delaware, Pennsylvania.  Other community organizations \nwith whom we share and coordinate the emergency plan are:\n\n * Newtown Square Volunteer Fire Company\n * Newtown Township Manger\n * Newtown Township Supervisors\n\n\n7.0 PLANNED CHANGES TO IMPROVE SAFETY\n\nAs a member of the Chemical Manufacturers As"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 13431,
      "SummaryText": "sociation, Lyondell Chemical supports a \ncontinuing effort to improve the industry's responsible management of chemicals.  It is a \npolicy of Lyondell (and formerly of ACC) to strive for continuous improvement in \nperformance in the areas of environmental, health, and safety.  \n\nFor the Newtown Square site, the primary means for continuous improvement is a program \nof corporate Technical Center Standards, which consists of rigorous performance \nrequirements in the areas of Process safety, Occupational Safety and Health, Environmental \nCompliance and Incident and Emergency Management.  These standards reflect the \nrequirements of a R&D operating environment and help ensure superior performance and \ncontinuous improvement.\n\nA system of audits to measure performance against these standards with resulting \nrecommendations and follow up actions are in place to assure continuous improvement in \nsafely managing our operations, safety and health performance, environmental compliance \nand incident / emergency response capabilities.\n\n\n8.0 \tCERTIFICATIONS\n\n[Certification executed with cover letter accompanying this RMPlan submittal.]\n\nBased on the criteria in 40 CFR 68.10, the distance to the specified endpoint for the worst-\ncase accidental release scenario for the following process is less than the distance to the \nnearest public receptor:\n\n * Polyols Pilot Plant\n\nWithin the past five years, the process has had no accidental release that caused offsite \nimpacts provided in the risk management program rule (40 CFR 68.10(b)(1)).  No additional \nmeasures are necessary to prevent offsite impacts from accidental releases.  In the event of \nfire, explosion, or a release of a regulated substance from the process, entry within the \ndistance to the specified endpoints may pose a danger to public emergency responders.  \nTherefore, public emergency responders should not enter this area except as arranged with \nthe emergency contact indicated in the RMP.  The undersigned certifies that,"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 13431,
      "SummaryText": "to the best of \nmy knowledge, information, and belief, formed after reasonable inquiry, the information \nsubmitted is true, accurate and complete.\n\n\n\n_________________________  Charles W. Ruoff, Facility Manager   \n                                                    June 21, 1999\n\n\n9.0  RMP DATA ELEMENTS\n\nAdditional information about our risk management program that EPA's RMP rule has asked \nus to provide is included as requested in the attached data file."
    }
  ]
}