{
  "FacilityID": 13466,
  "FacilityName": "ARCHIMICA INC.",
  "FacilityStr1": "2550 VERNSDALE ROAD",
  "FacilityStr2": null,
  "FacilityCity": "ROCK HILL",
  "FacilityState": "SC",
  "FacilityZipCode": "29730",
  "Facility4DigitZipExt": "9142",
  "FacilityCountyFIPS": "45091",
  "LEPC": "YORK COUNTY LEPC",
  "FacilityLatDecDegs": "34.880556",
  "FacilityLongDecDegs": "-81.079444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "BTP, plc",
  "Company2Name": null,
  "CompanyDUNS": 805255064,
  "Company2DUNS": 0,
  "OperatorName": "ARCHIMICA INCORPORATED",
  "OperatorStr1": "2550 VERNSDALE ROAD",
  "OperatorStr2": null,
  "OperatorCity": "ROCK HILL",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29730",
  "OperatorZipCodeExt": "9142",
  "RMPContact": "LEONARD ULICNY",
  "RMPTitle": "OPERATIONS DIRECTOR",
  "FTE": 59,
  "OtherEPAFacilityID": "29731TRYBR2550V",
  "EPAFacilityID": "100000142302",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-10-15 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2003-10-14 00:00:00",
  "DeRegistrationEffectiveDate": "2003-06-20 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.88397,
  "FRS_Long": -81.07741,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18182,
      "AltID": "ALKYLATION",
      "FacilityID": 13466,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 18651,
          "ProcessID": 18182,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 22841,
          "ProcessID": 18182,
          "ChemicalID": 131,
          "Quantity": 75000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 131,
            "ChemicalName": "2-Methylpropene  [1-Propene, 2-methyl-]",
            "CASNumber": "115-11-7",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 522841,
          "ProcessID": 18182,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13466,
      "SummaryText": "\nRISK MANAGEMENT PLAN\nEXECUTIVE SUMMARY\n\nINTRODUCTION\n\nThis Risk Management Plan (RMP) applies to the Archimica Incorporated (Archimica) facility located in the southwestern part of the City of Rock Hill, South Carolina.  The plant site is located in a predominantly rural area, and occupies about 12 acres of a total land tract of about 245 acres under plant ownership.  The plant was initially built at this location in 1978 and has been under current ownership since 1993.  The facility engages in fine chemicals manufacturing, producing materials that are used by other manufacturers to produce products such as plastic food wrap, pharmaceuticals, and agricultural materials.  One of the plant processes, the alkylation process, makes a crude product that is ultimately purified on site to produce antioxidants.  The process uses 2-methylpropene, also called isobutylene, as a reactant.  This material stored as a liquified gas under pressure is a flammable substance subject to EPA regulation under 40CFR 68.  The site stores up to 75,000 lbs in one 30,000 gallon storage tank, which requires preparation of a Risk Management Plan.\n\nThe management of risk and risk reduction are important and on-going objectives for overall company management, beginning at the corporate level and extending to each production facility.  Corporate risk management standards are translated into programs that are implemented at each facility by site management.  The plant \"Health and Safety Policy Statement\" states: \"Archimica Inc. is committed to operating its facilities with the highest regard for the health and safety of its employees, for the safety of the community in which we work, and the protection of the environment.\"  The plant maintains numerous programs and procedures used by employees every day to conduct its operations safely.  Plant personnel review new and existing processes for major hazards in order to minimize risk, train employees on an on-going basis, and plan and train for emerge"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13466,
      "SummaryText": "ncies and emergency response.  The plant maintains a trained and equipped Emergency Response Team to respond to interior structural fires, hazardous materials releases, rescues, and medical emergencies.  Compliance with governmental requirements and industry standards is the starting point for plant operations with continuous improvement as the goal.\n\nRISK MANAGEMENT PLAN\nWORST CASE RELEASE SCENARIO\nThe worst case release scenario is defined in the RMP regulation to be the release of the largest quantity of flammable liquid in a vessel to air with subsequent vapor explosion.  For the alkylation process, this is rupture of the storage tank holding the maximum inventory of isobutylene (75,000 lbs), release of the entire contents, and vaporization and explosion of the resulting flammable vapor cloud.  While the total capacity of the two storage tanks is greater than 75,000 lbs, the plant has limited the isobutylene inventory administratively to 75,000 lbs and to storage in only one tank via written procedure as a means of risk reduction.  Using the EPA RMPComp program, the radius to the endpoint condition of 1 psi overpressure from the explosion, as required by the RMP regulation, has been determined to be 0.3 miles.  There is currently only one residential dwelling located off-site at the boundary of this distance that could be impacted (minimally) by the worst case release.  It must be pointed out that it is highly unlikely that storage tank rupture releasing the entire quantity of gas with instantaneous vaporization would occur since vaporization of the liquid results in supercooling of liquid that limits the vaporization rate.  In addition, the plant has a well-trained and equipped Emergency Response Team with capability to apply foam to the liquid surface, to use water fog/spray, and minimize ignition potential.\n\nALTERNATE RELEASE SCENARIO\nSeveral alternate release scenarios judged to be potentially serious enough to have off-site impact were evaluated.  These wer"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13466,
      "SummaryText": "e the following assuming a vapor cloud explosion of the leaking isobutylene and no functioning of installed active mitigation systems:\n* Puncture of the storage tank or flange/nozzle leak (physical damage);\n* Rupture of the feed line to the plant (physical damage from mowing, a truck or other machine striking the pipe bridge, or other cause);\n* Rupture of the tank trailer unloading line (damage or driveaway).\nAnalysis of these scenarios yielded an endpoint distance of 0.2 miles for each, a distance that is off-site but does not include any residences, other public receptors, or environmentally sensitive areas.\n\nIn fact, the alkylation process and the isobutylene storage tank system have been carefully designed to minimize the risk from significant events associated with failure of the reactor, tanks, lines, pumps, and other vessels.  The following active mitigation is installed for this process:\n* Excess flow valves on the isobutylene storage tank connections that are designed to close and stop high flow rates (for example, from a line rupture);\n* Remote emergency isobutylene flow shutdown that can be actuated at a number of locations in the plant;\n* Hydrant-mounted firewater nozzle for tank cooling and water fog;\n* Backflow check valve to prevent liquid flow out of the tank if a line is ruptured during tank filling from a tank truck;\n* A sprinkler system for protection of process vessels, the vaporizer, and the supporting steel structure;\n* A computer process control system with safety interlocks to prevent process safety upsets that were identified during the process design and process hazard analysis.\nProper functioning of these systems under emergency conditions reduces the radius of impact to 0.1 miles or less effectively eliminating any potential off-site impact.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\nThe alkylation process is subject to the OSHA standard for Process Safety Management of Highly Hazardous Chemicals which is equivalent to the Program 3 Prevent"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13466,
      "SummaryText": "ion Program required by the EPA Risk Management Plan rule, 40 CFR 68.  The plant program includes developing and maintaining process safety information and the most recent process hazard analysis for the process.  Detailed operating procedures (batch sheets and equipment operating instructions) have been developed, are reviewed and certified annually, and are used for training of plant operators initially and on a continuing basis.  Critical plant equipment and control systems are checked for reliability and integrity.  Changes to the process are reviewed for their impact on the safe operation of the process and associated equipment.  Plant safety procedures exist for reporting and investigation of incidents, for assuring the safety of people and equipment when maintenance or construction work is needed, including hot work (use of spark producing equipment), and for responding to emergencies.  Employee participation is an important element in all aspects of the plant process safety management program.  Finally, contractors used for construction or maintenance are selected based on evaluation of their safety program and performance, provided information and training regarding processes and hazards, and further evaluated during on-site work.\n\nACCIDENT HISTORY (FIVE-YEAR)\nThere have been no accidental releases of isobutylene from the alkylation process since its start-up in 1996.\n\nEMERGENCY RESPONSE PROGRAM\nThe plant has an organized Emergency Response Team (ERT) that is an integral part of the written Emergency Response Plan for the site.  The plan is in several parts summarized below:\nPART I:    Emergency Response Plan overview, organization of the plant ERT,                 responsibilities of plant personnel, and emergency numbers for plant             personnel, agencies, and response assistance.\nPART II:    Bulk chemical storage areas and quantities, emergency response                 equipment on site, plant site map, topography, and production area             equipment location maps.\nPART III:    Contingency p"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13466,
      "SummaryText": "lan, internal and external notification, incident identification,         assessment, control, follow-up, communications, and security, distribution             to community emergency response organizations, and actions for                 response to fire/explosion, hazardous material release, and medical             emergency.\nPART IV:    Evacuation plan, emergency signal, duties of personnel, evacuation             routes, and roll call.\nPART V:    Forms.\nEach operating shift has assigned ERT members; they and the shift supervisor are trained and equipped for interior fire fighting, hazardous material incident response (OSHA Technician Level), and confined space rescue.  The shift supervisor is trained for incident command duties also.  Training is carried out at the SC Fire Academy and on site.  York County Emergency Preparedness and the Rock Hill Fire Department are familiar with the plant and its Emergency Response Plan, and public notification in an emergency is coordinated through them.  In the last year the plant has expanded its fire protection systems by adding sprinkler protection to the alkylation process and two more fire hydrants to the firewater system.  Additional fire hose and fixed and portable monitor nozzles are on order to give flexibility to the ERT in responding to emergency situations.\n\nFUTURE PLANS FOR RISK MANAGEMENT\nArchimica has plans for upgrading the internal emergency alarm system in the plant that will result in a distinctive site-wide emergency alarm signal, additional fire alarm stations, smoke detectors, and better monitoring of fire protection systems status.  This installation is scheduled to be complete and operational by late summer 1999.  Evaluation of risk reduction measures is an on-going process in planning for plant improvements.\n"
    }
  ]
}