{
  "FacilityID": 13499,
  "FacilityName": "Tony Abatti Farms, LLC.",
  "FacilityStr1": "817 W. Hackleman Rd.",
  "FacilityStr2": null,
  "FacilityCity": "El Centro",
  "FacilityState": "CA",
  "FacilityZipCode": "92243",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06025",
  "LEPC": null,
  "FacilityLatDecDegs": "32.798611",
  "FacilityLongDecDegs": "-115.610556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Tony Abatti Farms, LLC.",
  "OperatorStr1": "1735 Austin",
  "OperatorStr2": null,
  "OperatorCity": "El Centro",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92243",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike Yslava",
  "RMPTitle": "Health & Safety Supervisor",
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000143775",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Cold Storage Facility",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-20 00:00:00",
  "ErrorReportDate": "1999-07-20 00:00:00",
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP Pro 98",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.81084,
  "FRS_Long": -115.62265,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18229,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 13499,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 18699,
          "ProcessID": 18229,
          "NAICSCode": "115114",
          "_desc": {
            "NAICS_CODE": "115114",
            "NAICS_DESCRIPTION": "Postharvest Crop Activities (except Cotton Ginning)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 22890,
          "ProcessID": 18229,
          "ChemicalID": 56,
          "Quantity": 19939.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 522890,
          "ProcessID": 18229,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13499,
      "SummaryText": "\nExecutive Summary for Abatti Farms Cold Storage\n\nIntroduction\nThis report and Risk Management Plan was developed to comply with US EPA and Cal ARP \nrequirements. Resources used in the process was International Institute of Ammonia \nRefrigeration Guidelines, RMP Pro 98 Software by Dyadem and Cold Storage Technologies.\n\nReport organization includes; Certification statement, Summary, Detailed Elements and Map of  \nPotential Impact.\n\n1.    Accidental Release Prevention and Emergency Response Policies\nWe at Tony Abatti Farms, LLC. are strongly committed to employee, public and environmental \nsafety.  This commitment is demonstrated by our comprehensive accidental release prevention \nprogram that covers areas such as design, installation, operating procedures, maintenance, and \nemployee training associated with the processes at our facility.  It is our policy to implement \nappropriate controls to prevent possible releases of regulated substances. Our new Cold Storage \nFacility is state-of-the art includeing the latest diffusion tank safety equipment providing \nneutralization of all Ammonia releases.\n\n\n2.    The Stationary Source and the Regulated Substances Handled\nOur facilitys primary activities encompass Packing and storage of fresh fruit..  We have 1 \nregulated substance present at our facility. Ammonia (anhydrous) is used for Refrigeration.\n\n\n3.    The Worst Case Release Scenario(s) and the Alternative Release \nScenario(s), including administrative controls and mitigation measures to \nlimit the distances for each reported scenario\nTo evaluate the worst case scenarios, we have used the EPA's RMP Guidance for Ammonia \nRefrigeration  Reference Tables or Equations.  For alternative release scenario analyses we have \nemployed the EPA's OCA Guidance Reference Tables or Equations.  The following paragraphs \nprovide details of the chosen scenarios.\n\nThe worst case release scenario submitted for Program 2 and 3 toxic substances as a class \ninvolves a catastrophic release from Ammon"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13499,
      "SummaryText": "ia Refrigeration.  In this scenario 19939 lb. of \nAmmonia (anhydrous) is released.  The toxic liquid released is assumed to form a 1 cm deep \npool from which evaporation takes place.  The entire pool is estimated to evaporate over 10 \nminutes. No mitigation or administrative controls were used.  At Class F atmospheric stability \nand 1.5 m/s windspeed, the maximum distance of 2.52 miles is obtained corresponding to a toxic \nendpoint of 0.14 mg/L. Circle population from census information is 4303 however the plume \nfootprint would be approximately 10% of this value. This scenario does not represent a relaistic \nscenario.\n\nThe alternative release scenario for Ammonia (anhydrous) involves a release from Ammonia \nRefrigeration.  The scenario involves the release of 300.00 lb. of vapor. The vapor is discharged \nfrom a failed compressor seal that can be isolated manually in 60 minutes.  Under neutral \nweather conditions, the maximum distance to the toxic endpoint of 0.14 mg/L of Ammonia \n(anhydrous) is 0.06 miles.\n\n4.    The General Accidental Release Prevention Program and the Chemical-\nSpecific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention \nrequirements set out under 40 CFR part 68 of the EPA.  This facility was designed and \nconstructed in accordance with NFPA-58 Standard, 1998 Edition.    The following sections \nbriefly describe the elements of the release prevention program that is in place at our stationary \nsource.\n\nProcess Safety Information\nTony Abatti Farms, LLC. maintains a detailed record of safety information that describes the \nchemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes \nare identified and controlled efficiently.  The methodology used to carry out these analyses is \nWhat If/Checklist (combined).  The studies are undertaken by a "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13499,
      "SummaryText": "team of qualified personnel with \nexpertise in engineering and process operations and are revalidated at a regular interval of5 \nyears.  Any findings related to the hazard analysis are addressed in a timely manner.  The most \nrecent PHA/update was performed on 05/26/1999.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Tony Abatti \nFarms, LLC. maintains written operating procedures.  These procedures address various modes \nof operation such as initial startup, normal operations, temporary operations, emergency \nshutdown, emergency operations, normal shutdown and startup after a turnaround.  The \ninformation is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nTony Abatti Farms, LLC. has a comprehensive training program in place to ensure that \nemployees who are operating processes are competent in the operating procedures associated \nwith these processes.  Refresher training is provided at least every 3 years and more frequently as \nneeded.\n\nMechanical Integrity\nTony Abatti Farms, LLC. carries out highly documented maintenance checks on process \nequipment to ensure proper operations.  Process equipment examined by these checks includes \namong others; pressure vessels, storage tanks, piping systems, relief and vent systems, \nemergency shutdown systems, controls and pumps.  Maintenance operations are carried out by \nqualified personnel with previous training in maintenance practices.  Furthermore, these \npersonnel are offered specialized training as needed.  Any equipment deficiencies identified by \nthe maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Tony Abatti Farms, LLC. to manage changes in process \nchemicals, technology, equipment and procedures.  The most recent review/revision of \nmaintenance procedures was performed on 06/18/1999.  Process operators, maintenance \npersonnel or any other employee"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13499,
      "SummaryText": " whose job tasks are affected by a modification in process \nconditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes \nare conducted as a regular practice at Tony Abatti Farms, LLC..  The most recent review was \nperformed on 06/02/1999.  These reviews are conducted to confirm that construction, equipment, \noperating and maintenance procedures are suitable for safe startup prior to placing equipment \ninto operation.\n\nCompliance Audits\nTony Abatti Farms, LLC. conducts audits on a regular basis to determine whether the provisions \nset out under the RMP rule are being implemented.  The most recent comliance audit was \nconducted on 06/18/1999.  These audits are carried out at least every 3 years and any corrective \nactions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nTony Abatti Farms, LLC. promptly investigates any incident that has resulted in, or could \nreasonably result in a catastrophic release of a regulated substance.  These investigations are \nundertaken to identify the situation leading to the incident as well as any corrective actions to \nprevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nTony Abatti Farms, LLC. truly believes that process safety management and accident prevention \nis a team effort.  Company employees are strongly encouraged to express their views concerning \naccident prevention issues and to recommend improvements.  In addition, our employees have \naccess to all information created as part of the facilitys implementation of the RMP rule, \nincluding information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction \nactivities.  Prior to selecting a contractor, a thoroug"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13499,
      "SummaryText": "h evaluation of safety performance of the \ncontractor is carried out.  Tony Abatti Farms, LLC. has a strict policy of informing the \ncontractors of known potential hazards related the contractors work and the processes.  \nContractors are also informed of all the procedures for emergency response should an accidental \nrelease of a regulated substance occur.\n\n\n5.    Five-year Accident History\nTony Abatti Farms, LLC. has had an excellent record of preventing accidental releases over the \nlast 5 years.  Due to our stringent release prevention policies, there has been no accidental release \nduring this period.\n\n6.    Emergency Response Plan\nTony Abatti Farms, LLC. carries a written emergency response plan to deal with accidental \nreleases of hazardous materials.  The plan includes all aspects of emergency response including \nadequate first aid and medical treatment, evacuations, notification of local emergency response \nagencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and \nserviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place \nwithin our processes that would require a modified emergency response.\n\n7.    Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various \nelements of our accidental release prevention program.  Implementation of IIAR RMP/PSM \nGuidelines, safety equipment and improved access to isolation are some of the major steps we \nwant to take to improve safety at our facility.  These changes are expected to be implemented by \nthe end of the year.\n"
    }
  ]
}