{
  "FacilityID": 13602,
  "FacilityName": "Otay Water Treatment Plant",
  "FacilityStr1": "1500 Wueste Road",
  "FacilityStr2": null,
  "FacilityCity": "Chula Vista",
  "FacilityState": "CA",
  "FacilityZipCode": "91915",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06073",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "32.607778",
  "FacilityLongDecDegs": "-116.928889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "elm@sdcity.sannet.gov",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of San Diego, Water Department",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Gary Stalker",
  "OperatorStr1": "5530 Kiowa Drive",
  "OperatorStr2": "MS 85",
  "OperatorCity": "La Mesa",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91942",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gary Stalker",
  "RMPTitle": "System Operations Program Manager",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000143891",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-05-04 00:00:00",
  "SafetyInspectionBy": "Contractor",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-20 00:00:00",
  "ErrorReportDate": "1999-07-20 00:00:00",
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2016-04-25 00:00:00",
  "DeRegistrationEffectiveDate": "2016-04-22 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.64146,
  "FRS_Long": -116.93337,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "CHLORINE GAS CAS#7782-50-5 REMOVED FROM FACILITY",
  "_processes": [
    {
      "ProcessID": 18372,
      "AltID": "Chlorine",
      "FacilityID": 13602,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 18852,
          "ProcessID": 18372,
          "NAICSCode": "325181",
          "_desc": {
            "NAICS_CODE": "325181",
            "NAICS_DESCRIPTION": "Alkalies and Chlorine Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 23056,
          "ProcessID": 18372,
          "ChemicalID": 62,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 523056,
          "ProcessID": 18372,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13602,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe Otay Water Treatment Plant was built in the early 1900's and treats water for the southern portion of the City of San Diego.  The Otay Water Treatment Plant has a maximum water treatment capacity of 40 million gallons per day, with a future capitol improvement project goal of expanding capacity.  The Otay Water Treatment Plant is located adjacent to the southern tip of the Lower Otay  Reservoir in an unincorporated area in the southern portion of San Diego County.  The surrounding terrain is relatively hilly and is sparsely developed, with exception of the Arco Olympic Training Center (about 1 km north of the Plant) and a correctional complex (about 2 km to the south).  There are no family residential areas within about 3 km of the Plant, although residential development is encroaching from the northwest.\n\nHistorically, the Otay Water Treatment Plant has used liquid chlorine to treat and disinfect water from the Lower Otay Reservoir and the California Aquaduct as the two main sources, making it suitable for use in the City of San Diego's drinking water distribution system.  The one-ton pressurized liquid cylinders are received at the loading dock of the Chlorine Room.\n          \nThe Otay Water Treatment Plant has a well trained and committed operations and maintenance staff with a record of over 30-years of using chlorine safely.  To support the efforts of continued safe handling and use of chlorine at the Otay Water Treatment Plant, senior management has committed to the development of a comprehensive Process Safety Management Program under the guidelines of State and Federal mandates which has involved complete engineering reviews of the chlorine feed system and design certification.\n\nAs with the use of any hazardous chemicals, the use of chlorine in this treatment process poses the potential for an accidental release that could have offsite consequences. It is for this reason that several years ago, under the provisions of the recently prom"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13602,
      "SummaryText": "ulgated Risk Management Program Rule  (40 CFR 68), the Otay Water Treatment Plant conducted an assessment of offsite consequences of accident scenarios involving the uncontrolled release of chlorine to the surrounding environment. Under the provisions of the rule, the treatment process used at the Otay Water Treatment Plant is considered a \"Program 3\" process, and as such we conducted an analysis (a) a \"worst-case\" release scenario and (b) one or more alternative release scenarios.  The analysis of offsite consequences produced information incorporated into the Risk Management Plan (RMP) which covers population and environmental receptors in the environs within the affected areas.\n\nSeveral technological upgrades were made to enhance our emergency response capabilities if a chlorine leak were to occur: 1) Chlorine leak detection sensors were added from the chlorine cylinder storage room throughout the feed system which activates an alarm in the plant when low-levels of chlorine are detected, 2) A computerized program called \"Wonderware\" allows the Duty Plant Operator to see immediately from the Operations Control Room what part of the chlorine feed system is alarming without leaving the control room, 3) An automatic chlorine shut-off system was installed to minimize a chlorine release by securing the chlorine at the cylinder, 4) Several safe-work-practices for the operations and maintenance sections have been developed in conjunction with other safety programs to insure employees work and respond safely.\n\nThe Otay Water Treatment Plant, in conjunction with the Water Department Emergency Management Coordinator, have developed and tested a Chlorine Emergency Response Plan.  The Emergency Response Plan was developed to support the Water Plant Operator in the event a chlorine release occurs and additional resources are needed to mitigate the situation.  The San Diego Fire Department, Hazardous Materials Incident Response Team is dedicated to respond to our water plants i"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13602,
      "SummaryText": "f we have an incident.  The Otay Water Treatment Plant has a Business Plan that identifies evacuation points on the site and provides additional emergency information about chlorine and additional contacts if needed.  The Otay Water Treatment Plant has had no significant accidental releases of chlorine within the last five years requiring offsite evacuation or producing offsite consequences.\n\nThe Otay Water Treatment Plant was upgraded in 1989 and one of the most significant future additions will be a new Chlorine Facility with complete containment and scrubbers.  Additionally, upgraded security systems will be added to all access points to allow the duty operator to monitor the complete facility with ease."
    }
  ]
}