{
  "FacilityID": 13619,
  "FacilityName": "Sorrento Lactalis, Inc",
  "FacilityStr1": "6375 Hwy N",
  "FacilityStr2": null,
  "FacilityCity": "Arpin",
  "FacilityState": "WI",
  "FacilityZipCode": "54410",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55141",
  "LEPC": "Wood County LEPC",
  "FacilityLatDecDegs": "44.540278",
  "FacilityLongDecDegs": "-90.038333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PP",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 608030706,
  "ParentCompanyName": "Lactalis American Greoup, Inc",
  "Company2Name": "Groupe Lactalis",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sorrento Lactalis, Inc.",
  "OperatorStr1": "6375 Hwy N",
  "OperatorStr2": null,
  "OperatorCity": "Arpin",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54410",
  "OperatorZipCodeExt": null,
  "FTE": 270,
  "OtherEPAFacilityID": "54410SMPLT6375",
  "EPAFacilityID": "100000141474",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "772033790-F01",
  "SafetyInspectionDate": "1999-02-16 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-05-26 00:00:00",
  "DeRegistrationEffectiveDate": "2002-12-31 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 44.55521,
  "FRS_Long": -90.06935,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18391,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 13619,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 23075,
          "ProcessID": 18391,
          "ChemicalID": 56,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 18871,
          "ProcessID": 18391,
          "NAICSCode": "311513",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 9782,
              "Process_NAICS_ID": 18871,
              "SafetyReviewDate": "1999-06-01 00:00:00",
              "PHA_Date": "1997-07-31 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-01-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Traffic Accident",
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Traffic Barriers Installed",
              "OpProceduresReviewDate": "1998-07-28 00:00:00",
              "TrainingReviewDate": "1999-04-28 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Emergency shut down and start up manuals and standard operation prodecures for maintenance mechanics.",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-28 00:00:00",
              "EquipmentInspectionDate": "1998-12-17 00:00:00",
              "EquipmentTested": "Inspect and test all liquid supply valves to cooling units.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1997-07-31 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1998-12-18 00:00:00",
              "InvestigationChangeDate": "1999-07-15 00:00:00",
              "ParticipationPlansReviewDate": "1997-07-31 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-17 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-17 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-17 00:00:00",
              "CBI_Flag": 0,
              "Description": "This facility's emergency response program is based on the OSHA requirements for Emergency Action Plans (29 CFR 1910.38 and 1910.119).  This facility is included in the written community emergency response plan.  Wood County Emergency Government is the LEPC that has this plan.  The Arpin Fire Department has toured the facility and would be available to help notify the community if there were a release.  They would be available to help with first aid if needed.  The Marshfield Fire Department has a level B HAZMAT Team and could be here in about 25 minutes.  There is a level A HAZMAT Team in Wausau.  The Wood County Emergency Government would be notified immediately if there were a release that could have offsite consequences.  They would help coordinate emergency services.  The facility has maintenance personnel that have attended the 24 hour training that is required to be a first responder for ammonia releases.  The facility is equiped to handle minor releases and has Level C equipment on site.  The facility has a Process Safety Management Plan in place and has evaluated the ammonia system completely to look for ways to improve safety.  The facility continues to make improvements to the system equipment and operation.  Maintenance employees have written procedures on how to safely shut down the refrigeration system and isolate an area of the system if a leak develops.  Training is on going to assure safe operation of the refrigeration system.",
              "_chemicals": [
                {
                  "PrimaryKey": 13687,
                  "PreventionProgram3ID": 9782,
                  "ProcessChemicalID": 23075
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 13619,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-06-18 00:00:00",
    "ERTrainingDate": "1999-04-16 00:00:00",
    "CoordinatingAgencyName": "Wood County Emergency Government",
    "CoordinatingAgencyPhone": "7154218500",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13619,
      "SummaryText": "Sorrento Lactalis, Inc.  Arpin Plant\nRisk Management Plan for \nAnhydrous Ammonia in the Refrigeration System\n\nExecutive Summary\n\n1. Commitment to Safety\n\nSorrento Lactalis, Inc recently purchased the cheese plant in Arpin that was formerly owned by Simplot Dairy Products, Inc and for many years operated as Arpin Dairy.  Sorrento Lactalis is committed to operating in a manner that protects the safety of both employees at work and our neighbors in Arpin.  As part of this commitment, we comply with OSHA's Process Safety Management (PSM) standards covered by Title 29 Code of Federal Regulations (CFR) 1910.119 and EPA's Risk Manangement Program (RMP) covered by Title 40 CFR Part 68.  This facility has had a Process Safety Manangement Plan in place for several years.  The PSM plan as outlined by OSHA has the protection of employees as the main focus.  When we looked at our system to assure it was installed and operated in a safe manner for our employees, we also made sure that our operation is safe for our neighbors.  The RMP Risk Manangement Plan is a process that formally documents programs that are in place to protect the public, our neighbors from accidental releases of hazardous substances that could cause harm.\n\nSorrento Lactalis is committed to the safe use of all chemials required to operate the cheese plant.  We safely use many chemicals in the cheese plant to do daily cleaning of equipment.  We have an active safety committee that meets a minimum of once every two weeks.  Rewards are given to people who identify equipment or processes that can be made safer.  We have a full time Safety Coordinator that is responsible for safety training, improvement of safety programs, implementation of safety programs and the safety of plant employees and the public.\n\n2.  Regulated substance and process at this facility\n\nThe Sorrento Lactalis cheese plant has a large refrigeration system that is required to keep the milk  cold, cool the cheese and other dairy products after the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13619,
      "SummaryText": "y are produced and to cool the warehouse where cheese is stored prior to shipment.  Ammonia is used as the refrigerant in our refrigeration system.  The entire system holds 20,000 pounds.  The refrigerant is piped to various cooling units throughout the plant.  The largest individual container holds 9,964 pounds of ammonia if it is completely full.\n\nAmmonia is usually a colorless gas.  In high concentration in moist air, ammonia can be a light yellow cloud.   It has a strong odor that you may be familiar with from the use of household cleaners containing ammonia.  At lower concentrations it can make your eyes water and be uncomfortable to breathe.  At higher concentrations, ammonia can prevent your from getting enough oxygen and it can be fatal.  In most cases the safest place to be is inside your home with all doors, windows and outside ventilation closed tightly.  Wet towels can be used to seal small cracks at doors or windows.  Ammonia can be removed from air with a fine water spray.  \n\n3.  Worst case release scenario\n\nSorrento Lactalis has utilized the EPA RMP Compute Program, Version 1.05 to estimate the potential area of impact if there was a worst case release of ammonia.  The worst case release as defined by EPA is the total release of the entire quantity of ammonia in the largest vessel over a period of 10 minutes.  The EPA model estimates that the impact of this release would extend 1.2 miles from the cheese plant.  It is estimated that up to 501 people live within 1.2 miles of the cheese plant.  The direction of the wind determines which way the ammonia would go if there were a release.  The worst case release model assumes there is a lower than average wind speed of 3.4 miles per hour and  atmospheric conditions hold the ammonia close to the ground.  Under more normal conditions the area of impact would be reduced.\n\n4.  Alternative release scenario\n\nFor the alternative release scenario we reviewed an EPA list of reported ammonia releses by other faciliti"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13619,
      "SummaryText": "es.  We then looked at our refrigeration system to determine if any of those situations could develop here.  The alternative release scenario selected was breaking a 3/4 inch diameter high pressure liquid ammonia line due to a vehicle accident or construction accident.  The EPA model estimates the release would have an area of impact of up to 0.3 miles from the cheese plant.  It is estimated that up to 302 people live within a 0.3 mile radius of the cheese plant.\n\n5.  Accidental release prevention programs and practices\n\nSorrento Lactalis uses only qualified professional refrigeration contractors to make repairs to the system, perform preventive maintenance or make improvements to the system.  Preventive maintenance is perfromed by our contractor on a scheduled basis.\n\nMaintenance personnel at the facility have written documentation and training on emergency shut down of the refrigeration sytem.  They also have written procedures on the safe start up of the refrigeration system, normal operating conditions and what to do if there is an abnormal condition.  These procedures have been practiced and found to work in real life situations.  Maintenance employees have a site map that shows where manual shut off valves are located in case we need to isolate part of the system that has developed a leak.\n\nAs part of Process Safety Management (PSM) we completed Process Hazard Analysis for the entire refrigeration system.  This involved reviewing every single piece of equipment that is directly part of the refrigeration system or could indirectly cause a problem with the refrigeration sytem.  Process Hazard Analysis utilized the expertise of our professional refrigeration contractor, corporate director of safety, local safety coordinator, hourly maintenance personnel, maintenance supervisors and the maintenance manager.   \n\n6.  Five year accident history\n\nIn the last five years there have been no releases that have caused off site consequences, caused harm to anyone at the pla"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13619,
      "SummaryText": "nt or caused major damage to equipment.\n\n7. Emergency response program\n\nThis facility's emergency response program is based on the OSHA requirements for Emergency Action Plans (29 CFR 1910.38 and 1910.119).  This facility is included in the written community emergency response plan.  The Arpin Volunteer Fire Department has toured the facility and would be available to help notify the community if there were a release.  They would be available to help with first aid if needed.  The Marshfield Fire Department has a Level B HAZMAT Team that would assist if needed.  The Marshfield Fire Department is about 25 minutes from the cheese plant.  There is a Level A HAZMAT Team  in Wausau.  The Wood County Emergency Government would be notified immediately if there were a release that could have offsite consequences.  They would also help coordinate emergency services.\n\nThe facility has maintenance personnel that have attended the 24 hour training that is required to be a first responder.  The facility is equiped to handle minor releases and has Level C response equipment on site.\n\n8.  Planned safety improvements\n\nThe facility currently has a king valve that is manually operated to isolate the ammonia in the receiver tank.  In addition to this valve, we plan to install an electrically activated solenoid  valve.  An emergency shut down button will be installed that closes this valve and also turns off four ammonia distribution pumps. This new emergency shut down system will allow us to isolate ammonia more quickly if there is a leak or other emergency, such as a fire."
    }
  ]
}