{
  "FacilityID": 13621,
  "FacilityName": "Keebler- Augusta, Georgia",
  "FacilityStr1": "1550 Marvin Griffin Road",
  "FacilityStr2": null,
  "FacilityCity": "Augusta",
  "FacilityState": "GA",
  "FacilityZipCode": "30906",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13245",
  "LEPC": null,
  "FacilityLatDecDegs": "33.442083",
  "FacilityLongDecDegs": "-81.987028",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "S1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 809374564,
  "ParentCompanyName": "Keebler Foods Company",
  "Company2Name": null,
  "CompanyDUNS": 1320403,
  "Company2DUNS": null,
  "OperatorName": "Keebler Foods Company",
  "OperatorStr1": "545 Lamont Road",
  "OperatorStr2": null,
  "OperatorCity": "Elmhurst",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60126",
  "OperatorZipCodeExt": null,
  "FTE": 600,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000141633",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-17 00:00:00",
  "SafetyInspectionBy": "Combustion Services, Inc.",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-24 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-06-28 11:26:46",
  "DeRegistrationEffectiveDate": "2004-01-01 00:00:00",
  "AnniversaryDate": "2004-06-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.39508,
  "FRS_Long": -81.9898,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18393,
      "AltID": "Stand-by Feul System",
      "FacilityID": 13621,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 23077,
          "ProcessID": 18393,
          "ChemicalID": 98,
          "Quantity": 403200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 18873,
          "ProcessID": 18393,
          "NAICSCode": "311821",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 7557,
              "Process_NAICS_ID": 18873,
              "SafetyReviewDate": "1999-04-17 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-04-17 00:00:00",
              "ChangeCompletionDate": "2000-06-10 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Extreme Hot Weather",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-09 00:00:00",
              "TrainingReviewDate": "1999-06-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-17 00:00:00",
              "EquipmentInspectionDate": "1999-04-17 00:00:00",
              "EquipmentTested": "propane stand-by system",
              "ComplianceAuditDate": "1999-06-09 00:00:00",
              "AuditCompletionDate": "1999-07-09 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-06-09 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 7885,
                  "PreventionProgram2ID": 7557,
                  "ProcessChemicalID": 23077
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 13621,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Richmond County Fire Depratment",
    "CoordinatingAgencyPhone": "7068212909",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13621,
      "SummaryText": "TABLE OF CONTENTS\n\n0\tINTRODUCTION\t0-1\n1\tRELEASE PREVENTION AND EMERGENCY RESPONSE   POLICIES\t1-1\n2\tPROCESS DESCRIPTION AND REGULATED \n\tSUBSTANCES\t 2-1\n3\tWORST-CASE AND ALTERNATIVE RELEASE \n\tSCENARIOS\t3-1\n3.1\tWORST-CASE SCENARIO\t3-1\n3.2\tALTERNATIVE RELEASE SCENARIO\t3-1\n4\tGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\t4-1\n5\tFIVE-YEAR ACCIDENT HISTORY\t5-1\n6\tEMERGENCY RESPONSE PROGRAM\t6-1\n7\tPLANNED CHANGES TO IMPROVE SAFETY\t7-1\n\n\n\n\n\n\n\n\n\n\n\n\n 0\tINTRODUCTION\n\nThis document contains all of the required information to meet 40 CFR 68 Risk Management Program regulations including the executive summary and registration data elements (68.155 through 68.185).  \n\nSection 1.0 describes the propane release prevention policies and emergency response policies at the plant.  Section 2.0 gives a brief description of the plant and of the propane system.  Section 3.0 defines the worst-case and alternative release scenarios for the plant.  The general accidental release prevention program and chemical-specific prevention steps are described in Section 4.0.  A summary of the plant's five-year accident history is presented in Section 5.0.  Section 6.0 discusses the plant's Propane Emergency Response Program.  Section 7.0 contains improvements made to the system to ensure a safe working environment.  The Registration Data Elements are located in Section 8.0.\n 1\tRELEASE PREVENTION AND EMERGENCY RESPONSE  POLICIES\n\nThe Keebler Foods Company senior management is committed to process safety and the implementation of safe operating procedures as evidenced by a Prevention Program meeting 40 CFR 68 requirements.\n\nThis plant adheres to all applicable Federal, state, and local rules and regulations to ensure a safe working environment and a safe environment for the community.  Access to the plant propane system is restricted to certified propane operators, authorized contractors, and the Richmond County Fire Department.\n\nThe emergency response plan for this faci"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13621,
      "SummaryText": "ge tanks and a new vaporizer in 1977.  Both installations were designed in accordance with NFPA-58 code.  The plant continually conducts inspections during operation of the propane system to ensure the system is intact and operating correctly. An outside propane system design firm is contracted to conduct an inspection of the propane system on an annual basis.  During these inspections the contractor notifies the plant of any deviations from the NFPA code and corrects these deviations prior to the next inspection. Keebler's inspections during propane system operation in conjunction with the contractor's annual inspections and upgrades ensure that the worst-case and alternative scenarios have a minimal chance of occurring.   \n\nThe plant has developed a prevention program for propane to meet the Program 2 requirements of the RMP rule.  The prevention program was written to be in compliance with 40 CFR 68, to ensure the safety of the employees, and to ensure the safety of the surrounding community. Keebler developed a training program for the propane system personnel.  The program discusses: (1) the potential hazards associated with propane, (2) the proper operating and maintenance procedures for the propane system, and (3) certification of employees for operation of the propane system.  The plant also uses vendors who are NFPA-58 compliant.\n\n 5\tFIVE-YEAR ACCIDENT HISTORY\n\nThe review of this facility's accident history includes the following range of dates: June 22, 1994 - June 21, 1999.  There have been no releases at this facility as defined in 40 CFR Part 68.42(a).\n 6\tEMERGENCY RESPONSE PROGRAM\n\nThe Augusta plant does not have an internal emergency response team to address a propane release.  The Richmond County Fire Department is notified in the event of an emergency by calling 911.\n\nThe Augusta plant has developed an emergency evacuation document.  The purpose of the document is to provide an orderly, effective plan of action for protecting employees in emergency"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13621,
      "SummaryText": "lity includes procedures for notification of the Richmond County Fire Department.  \n\n\n 2\tPROCESS DESCRIPTION AND REGULATED SUBSTANCES\n\nThe Keebler plant in Augusta, Georgia produces snack foods using industrial baking ovens. During normal operation the plant uses natural gas as the fuel source for the ovens. However, the plant uses propane if required to use an alternate fuel. The North American Industry Classification System (NAICS) Code for the primary process at this facility is 311821.  \n\nThe main components of the stand-by propane fuel system are: four 30,000 gallon water capacity storage tanks, two pumps, one vaporizer, and piping.  The piping located outside of the plant is buried to prevent contact with heavy machinery and condensation in the propane lines.  The piping to the ovens through the plant is anchored to the ceiling and labeled propane.  The propane storage tanks and pumps are surrounded by a locked chain link fence to prevent access by employees who are not trained on the use of the propane system. \n\nThe components of the propane system that are located outside of the plant building are monitored by security personnel to ensure that unauthorized personnel do not have access to the propane system.  A chain link fence encloses the plant property including the propane system.  The fence and security personnel prevent unauthorized access to plant property.  \n\nPropane is the only regulated substance under 40 CFR 68 for the Augusta, Georgia plant.  The propane threshold for triggering applicability is 10,000 pounds.  The plant administratively limits the amount of propane stored in the storage tanks to 80% of capacity.  The maximum quantity of propane stored in a storage tank is 100,800 pounds.  The maximum quantity of propane stored on-site is 403,200 pounds.  This exceeds the threshold limit, resulting in the Keebler Augusta plant being regulated under 40 CFR 68 as a Program 2 facility.\n\n 3\tWORST-CASE AND ALTERNATIVE RELEASE SCENARIOS\nPropane is a f"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13621,
      "SummaryText": "lammable regulated substance capable of causing off-site consequences in the event of an accidental release. Various types of release scenarios are possible including vapor cloud fires (flash fires), a pool fire with radiant heat effects, boiling liquid expanding vapor explosion (BLEVE) leading to a fireball producing intense heat, a vapor cloud explosion, and a jet fire from a hole in a tank.  The worst case release scenario and a more likely alternative release scenario are described below.\n\n3.1\tWORST-CASE SCENARIO \n\nThe EPA definition of the worst-case release is a failure of the largest storage tank, causing the release of the entire contents of the tank.  The contents of the tank find an ignition source resulting in a vapor cloud explosion. A ten percent yield factor is assumed from the TNT-equivalency formula.  Thus, ten percent of the released quantity will participate in a resulting explosion.  Company policy limits filling the 30,000 gallon propane tank to 80% of the capacity at 60oF. Since this facility is located on the outskirts of the city, the vapor cloud explosion would reach offsite endpoints and nearby receptors.\n\n3.2\tALTERNATIVE RELEASE SCENARIO \n\nThe alternative release scenario examined involves the release of propane during a pull away during tank loading operations.  The pull away consists of a failure of a 25 foot length of 4 inch diameter hose.  The excess flow valve stops the flow from the tank resulting in the release of the only hose contents.  The hose contents, 69 pounds of propane, results in a vapor cloud fire. Since this facility is located on the outskirts of the city the vapor cloud explosion would reach offsite endpoints.\n 4\tGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThis facility complies with EPA's Accidental Release Prevention Rule and with all Federal, state and local codes and regulations.  Two storage tanks and a vaporizer were installed in 1974.  The plant installed two more stora"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13621,
      "SummaryText": "situations when an evacuation is necessary.\n\n 7\tPLANNED CHANGES TO IMPROVE SAFETY\n\nBased on the what-if/checklist Hazard Review completed for propane, a list of action items was developed and is being monitored to determine if implementation was accomplished.  The following examples briefly describe current improved safety measures occurring at the Augusta plant in response to the Hazard Review.\n\n1.\tAs a safety precaution, the Augusta plant will use only NFPA-58 knowledgeable vendors to supply and fill the propane tank. (1/27/99)\n\n2.\tThe possibility of a propane release by untrained personnel operating the propane system is a concern at the Augusta plant.  To address this concern the plant has initiated a training program for all personnel responsible for the operation of the propane system.  Personnel who are not responsible for the operation of the system will not be allowed to perform any tasks related to the propane system. (1/27/99)\n\n3. The Augusta plant has installed fences surrounding the plant property to prevent the general public from access to the tank.  The plant buried the propane process lines to protect the propane system from punctures and or damages caused by heavy machinery.  (1977)"
    }
  ]
}