{
  "FacilityID": 13708,
  "FacilityName": "Praxair - Memphis, TN",
  "FacilityStr1": "5055 Old Millington Road",
  "FacilityStr2": null,
  "FacilityCity": "Memphis",
  "FacilityState": "TN",
  "FacilityZipCode": "38127",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47157",
  "LEPC": "Shelby County LEPC",
  "FacilityLatDecDegs": "35.265556",
  "FacilityLongDecDegs": "-89.975833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.praxair.com",
  "FacilityEmailAddress": "info@praxair.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Praxair, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 197154586,
  "Company2DUNS": 0,
  "OperatorName": "Praxair, Inc.",
  "OperatorStr1": "5055 Old Millington Road",
  "OperatorStr2": null,
  "OperatorCity": "Memphis",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "38127",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Sheehan",
  "RMPTitle": "Facility Manager",
  "FTE": 14,
  "OtherEPAFacilityID": "TN0000305219",
  "EPAFacilityID": "100000144514",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-20 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-03-11 00:00:00",
  "DeRegistrationEffectiveDate": "2004-03-01 00:00:00",
  "AnniversaryDate": "2004-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.26556,
  "FRS_Long": -89.97583,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18535,
      "AltID": "Hydrogen Storage",
      "FacilityID": 13708,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19018,
          "ProcessID": 18535,
          "NAICSCode": "32512",
          "_desc": {
            "NAICS_CODE": "32512",
            "NAICS_DESCRIPTION": "Industrial Gas Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 23319,
          "ProcessID": 18535,
          "ChemicalID": 149,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 149,
            "ChemicalName": "Hydrogen",
            "CASNumber": "1333-74-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 523319,
          "ProcessID": 18535,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13708,
      "SummaryText": "The Praxair facility at Memphis, Tennessee has a hydrogen storage process on-site. We deliver liquid hydrogen, primarily from our McIntosh, AL plant, into three cryogenic storage vessels.  The liquid hydrogen is vaporized, and the hydrogen gas is then transferred via pipeline to a nearby customer.  Although the hydrogen storage process is essentially self-contained and requires very little human interaction, it is monitored by operators of Praxair's air separation plant located on the same property.  Operators make checks of the hydrogen system periodically, drivers routinely deliver product, and routine and preventive maintenance is performed regularly by Praxair service technicians.  Hydrogen is listed as a regulated flammable substance in EPA's Risk Management Program rule, with a threshold quantity of 10,000 pounds.  The storage process at the Memphis facility contains about 18,000 pounds of hydrogen, and is therefore subject to the RMP rule.\n\nUnder the RMP rule, Praxair is required to report a Worst Case Scenario for the Memphis hydrogen process, which is defined by the EPA as the release of the entire contents of the largest hydrogen vessel in our process, with essentially none of the safety systems and devices that are in place to prevent such an occurrence functioning as designed.  The release is assumed to ignite, causing a vapor cloud explosion.  Given these conditions, we are then required to estimate the distance to an EPA-specified flammable endpoint, which is defined to be an overpressurization effect of 1 pound per square inch.  At the Memphis facility, the largest hydrogen vessel contains about 11,000 pounds.  Using the criteria listed above, the Worst Case Scenario would result in a maximum impact distance of about 0.25 miles to the EPA-specified endpoint.  To determine this distance, we used the Compressed Gas Association's \"Risk Management Plan Guidance Document for Bulk Liquid Hydrogen Systems.\"\n\nWe are also required to report an Alternative Rele"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13708,
      "SummaryText": "ase Scenario, or planning scenario, under the RMP rule.  While an Alternative Release may never occur at a facility, it is generally accepted to be more likely, or more credible, than the Worst Case Scenario, and can be used by the facility and local response organizations to plan community emergency response activities.  The RMP rule assumes more typical atmospheric and weather conditions for an Alternative Release Scenario, and allows a facility to take credit for safety devices and other mitigation systems that are in place to minimize the likelihood and effects of a release.  When selecting an Alternative Release Scenario, EPA suggests a facility consider scenarios such as transfer hose releases, valve and flange leaks, pump seal leaks, and shipping container mishaps, among others.  For the Memphis hydrogen storage process, a credible release would be the failure of a liquid hydrogen line on the tank, with the released hydrogen gas igniting and causing a small vapor cloud explosion.  At the Memphis facility, a release of this type would result in a maximum impact distance of about 0.09 miles, or 475 feet.  To determine this distance, we used the Compressed Gas Association's \"Risk Management Plan Guidance Document for Bulk Liquid Hydrogen Systems.\"\n\nIn accordance with OSHA's Process Safety Management standard and EPA's Risk Management Program rule, the Memphis facility has a comprehensive accident prevention program in place to ensure the safety of our employees, our neighbors and the community around us.  On a local level, this prevention program is built around process safety concepts such as:\n\n7 Documented process safety information to ensure the process design is understood and maintained throughout its life;\n7 Process hazard analysis to identify and control all of the hazards associated with handling hydrogen;\n7 Trained operators, using written operating procedures, to safely operate the process as intended; and\n7 Maintenance programs and procedures to ensur"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13708,
      "SummaryText": "e the on-going mechanical integrity of the process.\n\nThe prevention program is audited periodically, by our corporate assessment group, to ensure that the process safety concepts and practices are in place and working effectively.\n\nAs a result of our process safety and risk management practices, the Memphis facility has not had an accident involving hydrogen in the last five years.  In the event of an emergency, the facility has an emergency action plan in place, which contains procedures for employees to follow, including notification of local response agencies.  All facility employees are trained in their role in the emergency action plan, and Praxair policy requires that emergency drills be conducted at least annually.\n\nPraxair is committed to the continuous improvement of its safety, health and environmental programs. The company operates under an umbrella of global corporate policies with specific program elements defined on a regional basis. Recently, detailed process safety audits have been conducted at numerous facilities throughout the company. As we ensure the process safety integrity of our facilities, we are also fine tuning the incident and near miss reporting and investigation processes. Root Cause Analysis training is being targeted within the operations and safety organizations. On a broader scale, the effectiveness, and accessibility of training is being improved. A computerized compliance management system keeps track of plant progress meeting internal and external requirements.\n\nPraxair is a producer and distributor of industrial gases with almost 100 years of experience.  We are committed to being the best performing industrial gas company in all aspects of our business, including safety, health and environmental affairs.  Praxair is a member the Chemical Manufacturers Association's Responsible Care initiative, which is intended to ensure the safe operation of chemical facilities and enhance the relationships between the chemical industry and the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13708,
      "SummaryText": " communities in which we operate.  Praxair uses a combination of extensive engineering standards and design safety work processes, coupled with operational and personnel safety programs, to ensure the safe operation of all of our facilities.  Our company-wide goal of \"Zero/Zero\" (which means zero accidents and zero injuries or illnesses at every location) reflects the dedication and commitment to safety throughout the entire Praxair organization."
    }
  ]
}