{
  "FacilityID": 13742,
  "FacilityName": "Inland Paperboard & Packaging, Inc.",
  "FacilityStr1": "2877 Scepter Road",
  "FacilityStr2": null,
  "FacilityCity": "New Johnsonville",
  "FacilityState": "TN",
  "FacilityZipCode": "37134",
  "Facility4DigitZipExt": "9610",
  "FacilityCountyFIPS": "47085",
  "LEPC": "Humphreys County LEPC",
  "FacilityLatDecDegs": "36.084167",
  "FacilityLongDecDegs": "-87.938611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": "www.iccnet.com",
  "FacilityEmailAddress": "DReynol@iccnet.com",
  "FacilityDUNS": 50669126,
  "ParentCompanyName": "Temple Inland, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 103844346,
  "Company2DUNS": 0,
  "OperatorName": "Inland Paperboard & Packaging, Inc.",
  "OperatorStr1": "2877 Scepter Road",
  "OperatorStr2": "P. O. Box 299",
  "OperatorCity": "New Johnsonville",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37134",
  "OperatorZipCodeExt": "9610",
  "RMPContact": "Jerry Gallaway",
  "RMPTitle": "Mill Manager",
  "FTE": 191,
  "OtherEPAFacilityID": "TND050669126",
  "EPAFacilityID": "100000144435",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1979-10-23 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 36.085,
  "FRS_Long": -87.93833,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18621,
      "AltID": "Ammonia System",
      "FacilityID": 13742,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19110,
          "ProcessID": 18621,
          "NAICSCode": "322121",
          "_desc": {
            "NAICS_CODE": "322121",
            "NAICS_DESCRIPTION": "Paper (except Newsprint) Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 23447,
          "ProcessID": 18621,
          "ChemicalID": 56,
          "Quantity": 300000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 523447,
          "ProcessID": 18621,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13742,
      "SummaryText": "Inland New Johnsonville\nRisk Management Plan\n\n\n\n1. EXECUTIVE SUMMARY\n\nInland New Johnsonville (Inland) is committed to operating in a manner that is safe for Inland workers, the public, and the environment.  As part of this commitment, Inland has established a system to help ensure safe operation of the processes at this facility.  One component of this system is a risk management program (RMP) that helps manage the risks at Inland and that complies with the requirements of the Environmental Protection Agency's (EPA's) regulation 40 CFR part 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule).  One of the requirements of the RMP rule is to submit a risk management plan (RMPlan) describing the risk management program at Inland.  This document is intended to satisfy the RMPlan requirement of the RMP rule and to provide the public with a description of the RMP at Inland New Johnsonville.\n\n1.1  Accidental Release Prevention and Emergency Response Policies\n\n1.1.1  Accidental Release Prevention Policies\n\nInland is committed to the safety of workers and the public, and to the preservation of the environment, through the prevention of accidental releases of hazardous substances.  Inland implements reasonable controls to prevent foreseeable releases of hazardous substances.  These controls include training programs for personnel; programs to help ensure safety in the design, installation, operations, and maintenance of processes, and programs to evaluate the hazards at Inland.  The basic elements of this program are included in the Inland Process Safety Management (PSM) plan. \n\n1.1.2  Emergency Response Policies\n\nIn the event of a significant accidental release of a hazardous substance, Inland controls and contains the release in a manner that will be safe for workers and will minimize the effect on the public and the environment.  Inland provides response training to Inland personnel, utilizes a comprehensive facility emergency evacuation"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13742,
      "SummaryText": " procedure, and coordinates on-site efforts with the local fire department.  Response activities involving the off-site migration of hazardous substances have been addressed with the Humphreys County LEPC and a detailed emergency notification plan has been developed and implemented.  This plan incorporates the utilization of the NOAA emergency radio system for public notification of the potential hazard to the community in addition to notification of the LEPC, the Sheriff's department and local fire departments.  \n\n1.2  Inland New Johnsonville and Regulated Substances\n\nInland is an integrated pulp and paper mill involved in the manufacture of corrugating medium.  As part of this manufacturing process, Inland uses anhydrous ammonia in the production of wood pulp from hardwood chips.  This is the only toxic substance regulated by the RMP rule that is present at this site in quantities above the EPA threshold quantity. \n\n\nProcess                         Program Level               Regulated Substance               Process Quantity\nHardwood Pulping                  3                           Anhydrous Ammonia                   300,000 lbs.\n\n1.3  Offsite Consequence Analysis\n\nInland performed an offsite consequence analysis to estimate the potential for an accidental release of a regulated substance to affect the public or the environment.  The offsite consequence analysis consists of evaluating both a worst-case release scenario and alternative release scenario. The main objective of performing the offsite consequence analysis is to determine the distance at which the public might be affected in a certain way because of an accidental release (called the endpoint distance).  The following effects could occur at the endpoint distance.  As distances from the source are increased, the potential effect from the hazard is reduced.\n\nWhen considering the release of a toxic substance, most people at the endpoint distance would be able to walk away from the exposure without any "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13742,
      "SummaryText": "long-term health consequences, although some short-term consequences (e.g., strong eye or throat irritation) are likely.  Some people who are particularly  susceptible to the substance released could be incapacitated.\n\nThe RMP rule includes specific requirements for the worst-case and alternative release scenario that must be reported by Inland.  These requirements are:\n\n' one worst-case release scenario for a toxic substance in a Program 3 process (i.e., one scenario       representing anhydrous ammonia)\n\n' one alternative release scenario for a toxic substance in a Program 3 process (i.e., anhydrous ammonia.)\n\nThe following information summarizes the offsite consequence analysis performed by Inland.\n\n1.3.1  Program 3 Processes - Toxic Substances\n\nThe worst-case release for anhydrous ammonia is the rupture of a storage tank containing 150,000 pounds of anhydrous ammonia which evaporates and forms a vapor cloud. The total release of the tank contents would occur within a 10 minute time frame.  No administrative controls or passive mitigation were considered for this release scenario.  The maximum distance to the toxic endpoint concentration is computed to be 4.4 miles.  Numerous residences with a population of 2992 people live within this distance from the storage tanks according to U. S. Census data; several public receptors are also located within this distance (e.g.  two state historic areas,  one State Park,  several industrial facilities, several marinas and boat ramps on Kentucky Lake).  One environmental receptor is within this distance; the wildlife management area of Nathan Bedford State Park. \n\nThe alternative release scenario for anhydrous ammonia is a break in a pressurized process line that is not covered by the water deluge protection system.  This rupture of a 1\" process line @ 250 psi would result in the automatic closure of the excess flow valves on the ammonia tank, but would allow the release of the ammonia contained within the affected process pi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13742,
      "SummaryText": "ping.  The maximum distance to the toxic endpoint for this alternative scenario was computed to be 0.3 miles.  The U.S. Census indicates that 6 people live within this distance from the process piping location; no public receptors are located within this distance.  No environmental receptors are within this distance.\n\n1.4  Accidental Release Prevention Program and Chemical - Specific Prevention Steps\n\nSince its inception in 1970, Inland New Johnsonville has used a prevention program to help prevent accidental releases of hazardous substances.  Beginning in 1992, Inland formalized this prevention program for the anhydrous ammonia production processes and storage requirements in order to comply with the 12 elements of the OSHA process safety management (PSM) prevention program.  In 1996, the EPA RMP rule established additional prevention program requirements for potential offsite migration of hazardous chemicals included in the OSHA PSM program.  Inland is affected by EPA RMP rules as follows:\n\nProgram 3 - essentially the same as OSHA PSM, except that the program also focuses on protecting the public and the environment\n\nThe following sections briefly describe the elements of Inland's prevention programs that address the EPA RMP rule prevention program requirements.  These elements are an integral part of the OSHA PSM program which governs these on site prevention and emergency response elements.\n\n\n1.4.1  Program 3 Prevention Program\n\nThe Inland Program 3 prevention program applies to the mill processes and storage systems which involve anhydrous ammonia.  This program consists of the following 12 elements:\n\na.  Process Safety Information.  Inland maintains a variety of technical documents that are used to help ensure safe operations of the Inland processes.  These documents address (1) physical properties of hazardous substances handled at Inland (MSDS), (2) operating parameters of the equipment at Inland, and (3) design basis and configuration of the equipment at In"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13742,
      "SummaryText": "land.  Inland ensures that this process safety information is available to all Inland employees, the local emergency planning committee (LEPC), local fire departments, and other emergency responders.\n\nb.  Process Hazard Analysis.  Inland performs and periodically updates process hazard analyses (PHAs) of the covered processes to help identify process hazards and generate recommendations that might improve the safe operation of the process.  A team composed of personnel with engineering and process operating experience and a leader with process hazard analysis experience is assembled to analyze the hazards of the process.  Inland primarily uses the hazard and operability (HAZOP) technique, supplemented with checklists, to perform this analysis.  The PHA team prepares a written report describing the results of the analysis, including a list of recommendations.  Responsibility to resolve the recommendations is assigned to unit personnel and, when appropriate, changes to enhance the safety of the process are implemented.\n\nc.  Operating Procedures.  Inland production operators and supervisors work together to develop and maintain operating procedures to define how tasks related to process operations should be safely performed.  The operating procedures (1) are used to train employees and (2) serve as reference guides for appropriate actions to take during both normal operations and process upsets.  Operating procedures include:\n\n' steps for safely conducting activities\n\n' applicable process safety information, such as safe operating limits and consequences of process deviations\n\n' safety and health considerations, such as chemical hazards, personal protective equipment requirements, and actions to take if exposed to a hazardous substance \n\nInland personnel develop and maintain operating procedures that cover all phases of operations, including initial startup, normal operations, normal shutdown, emergency shutdown, startup following a turnaround or emergency shutdown, an"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 13742,
      "SummaryText": "d temporary operations.  The operating procedures are used both to help in operating the Inland processes and as a training guide.\n\nd.  Training.  Inland trains workers to safely and effectively perform their assigned tasks. Inland training programs include both initial and refresher training that covers (1) a general overview of the process, (2) the properties and hazards of the substances in the process, and (3) a detailed review of the process operating procedures and safe work practices.  Inland has trained a HAZMAT response team to respond to any hazardous release at the Inland site. \n\nTraining requirements are reviewed annually to evaluate the effectiveness and frequency of the training.  Recommendations from the mill operating departments/maintenance are reviewed, and changes to the training program are implemented as appropriate.  Documentation of training is incorporated into each employee's personnel file data base. \n\ne.  Mechanical Integrity.  Inland maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  The Inland mechanical integrity program includes (1) a comprehensive predictive/preventive maintenance program designed to minimize equipment deterioration and damage and to schedule replacement of equipment prior to failure;  (2) a quality assurance program to help ensure that new and replacement equipment meet the design standards required for service in the Inland process.  Specific safety requirements including lock-out procedures and PSM requirements are addressed by the maintenance Work Order system. This detail has been incorporated in the mill equipment data base which automatically generates this information with each work order involving affected equipment and procedures. \n\nf.  Management of Change.  The Inland management of change program evaluates and approves all proposed changes to chemicals, equipment, and procedures for a covered process to he"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 13742,
      "SummaryText": "lp ensure that the change does not negatively affect safe operations.  Process changes that are determined to be a replacement in kind (e.g., replacing a valve with an identical valve) are allowed without completing a full management of change program.  All other changes must be confirmed through the full management of change program to help ensure that inadvertent consequences of process changes are prevented, safety consequences of changes are addressed, affected process safety information and procedures are updated, and affected employees are notified of and trained in the changes.  A specific written procedure with designated approval authority is utilized for this process.\n\ng.  Pre-startup Review.  Inland performs a safety review of a new or modified process before the process is placed into service to help ensure that the process has been prepared to operate safely.  This review confirms that:\n\n' construction and equipment are in accordance with design specifications\n\n' adequate safety, operating, maintenance, and emergency procedures are in place\n\n' employee training has been completed\n\n' for a covered process, a PHA has been performed if the process is new or management of change requirements have been completed if an existing process has been modified\n\nA pre-startup review checklist is completed to document the review and to ensure that appropriate issues have been addressed.\n\nh.  Compliance Audit.  Inland audits covered processes to be certain that the prevention program is effectively addressing the safety issues of covered process operations.  Inland utilizes an audit team that includes personnel knowledgeable in the RMP rule, process operations, and maintenance procedures. The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n\ni.  Incident Investigation.  Inland investigates all incidents that could reasonably have resulted in a serious injury to personnel, the publ"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 13742,
      "SummaryText": "nd provides a Contractor's Safety Manual which explains to the contract supervisors the hazards of the process on which they and their employees will work, other site process hazards, Inland's safe work practices, and the Inland emergency response procedures.  Inland requires that the contractor provide documentation of training each of their employees who will work at Inland before that worker begins work at the Inland site.  Inland periodically reviews contractors' training documents and work performance to help ensure that safe practices are followed.\n\n1.4.2  Chemical-specific Prevention Steps\n\nIn addition to the required prevention programs elements, Inland has implemented safety features specific to the hazardous substances used at the site.  The following paragraphs describe some of these safety features.\n\nAnhydrous Ammonia:\n  \n' Anhydrous ammonia is delivered to the site by truck-tanker in accordance with DOT regulations.  The ammonia off load station is adjacent to the storage tanks minimizing the potential for delivery problems.  A locked cap is positioned on the delivery coupling requiring the tanker operator to notify Inland personnel prior to unloading.  A process system is in place using mill water for decontamination of the delivery hose system.\n\n' Ammonia monitors are located on all sides of the storage area and provide real time ammonia level readings to the control room operators.  The output from this system is provided to the control room operators in the form of a high or low level alarm.  The operators are trained in proper response techniques and notification protocol.\n\n' Portable TV cameras are located in the tank storage/unloading area to observe this activity.  The TV monitors are located in the operations control room which is manned on a 24 hours per day, 7 days per week basis.  \n\n' Excess flow prevention valves are located at the two tank discharge piping outlets.  These devices will automatically close in the event of a rupture downstrea"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 13742,
      "SummaryText": "ic, or the environment so that similar accidents can be prevented.  Root Cause investigation techniques are utilized in this process.   Inland trains employees to identify and report any incident requiring investigation.  An investigation team is assembled, and the investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\n\nj. Employee Participation.  Inland developed an employee participation program for covered processes to help ensure that the safety concerns of Inland employees are addressed.  Inland encourages active participation of personnel in the prevention program activities of all processes at the facility.  Employees are consulted on and informed about all aspects of the RMP rule prevention program, including PHAs and operating procedures.  All Inland employees have received HAZOP and PSM training.\n \nk.  Hot Work Permits.  Inland developed and implemented a hot work permit program to control spark- or flame- producing activities that could result in fires or explosions although there are no covered processes for these hazards at the Inland facility.  Inland created a Hot Work Permit Form to comply with these requirements.  Inland and contractor personnel who are to perform hot work are required to obtain a Hot Work Permit prior to initiation of work activity.  The Inland Technical Laboratory reviews proposed work, ensures that adequate safe guards are in place and issues the Hot Work Permit before work can begin.  Training in the use of the Hot Work Permit Form is included in the Inland safe work practices orientation.\n\nl.  Contractors.  Inland established a program to help ensure that the contractor activities at the Inland facility are performed in a safe manner.  The program reviews the safety record of all contractors to help ensure that Inland only hires contractors who can safely perform the desired job tasks.  Inla"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 13742,
      "SummaryText": "m of the valve preventing the release of the tank contents.\n\n' Pressure relief valves are located on each storage tank (2) to prevent overpressure to the storage tank system.\n\n' A water deluge system is installed over the storage tanks and truck-tanker off load station to suppress a release in the event of a system failure.  This system may be actuated at several different site locations including a remote position in the operator's control room.  The water deluge is the most effective means of suppressing an ammonia release.  \n\n' The ammonia process piping and valves have been completely replaced to ensure compliance with chemical specific standards.  Data regarding this process system is entered in the maintenance work order system to ensure compliance with these standards.\n\n 1.5  Five-Year Accident History\n\nThere have been no releases of ammonia at Inland in the last 5 years that have resulted in consequences of interest (i. e., death, injuries, or significant property damage on site; or known deaths, injuries, evacuations, sheltering-in-place, property damage or environmental damage offsite). \n\n1.6  Emergency Response Programs\n\nInland has established a written emergency response program to help safely respond to accidental releases of hazardous substances.  The emergency response plan includes procedures for:\n\n' controlling and containing accidental releases of hazardous substances, including the use of emergency response equipment\n\n' implementation of a site emergency response plan including shut down and evacuation procedures for all Inland and contractor personnel\n\n' providing proper first aid and emergency medical treatment to treat accidental human exposure to hazardous substances at the Inland site\n\n' informing the local fire department and local emergency aid personnel about accidental releases that could reasonably result in injury to Inland site personnel (PSM)\n\n' informing the LEPC and emergency responders regarding the potential for offsite migration "
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 13742,
      "SummaryText": "of a significant release of a hazardous substance  (RMP)\n\n' inspecting and maintaining emergency response equipment\n\n' reviewing and updating the emergency response plan\n\nInland maintains an emergency response team trained in these emergency response procedures.  All Inland personnel are trained in evacuation procedures.  Inland periodically conducts emergency response drills, tests of monitoring equipment, and mill information meetings to ensure the awareness of all Inland employees.  Inland participates in Humphreys County LEPC activity and is active in a local industry committee which addresses community awareness issues such as the RMP.  \n\nInland's written emergency response program has been communicated to all emergency responders including the LEPC.  This document is a part of the Risk Management Program's RMPlan. \n\n1.7  Planned Changes to Improve Safety\n\nInland constantly strives to improve process safety through both the incident investigation program and a program soliciting safety suggestions from the workers (STOP).  The following changes to improve process safety are planned or have recently been completed.\n\n' An audible ammonia alarm system with speakers located throughout the site has recently been installed, tested, and placed in operation.  Process control operators have received training for actuation of the alarm system and all Inland personnel have received awareness training.\n\n' Training on root cause failure analysis techniques has been initiated in the Inland maintenance department and will be expanded into operations to assist in the evaluation of the failure of process system components and the development of proper repair methods and/or modifications to operating procedures.\n\n' Reduction of chemical usage at Inland (including ammonia) is under review as a Continuous Improvement (CI) effort.  This could reduce the number of process systems involving this covered chemical at the Inland site thus reducing the potential for an accidental release"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 13742,
      "SummaryText": ".\n\n' All operating and maintenance procedures will be audited  periodically for compliance.  This activity will be under the direction of the Inland Site Safety Committee.\n\n' Temple-Inland has developed and implemented an internal environmental audit system that includes all Temple-Inland mills and box plants.  The audit team is composed of employees from throughout the corporation who possess the necessary environmental skills for this activity.  PSM and RMP compliance activities are included in this audit.\n\n' Inland is firmly committed to the Continuous Improvement (CI) principles and techniques for all aspects of Inland's business including safety and environmental activities.  The result of this commitment is an ongoing analysis of safety and environmental needs and the development of adequate programs and policies to ensure that these needs are fulfilled."
    }
  ]
}