{
  "FacilityID": 13805,
  "FacilityName": "Butterfield Water Treatment Plant",
  "FacilityStr1": "1306 W. \"B\" St",
  "FacilityStr2": null,
  "FacilityCity": "Pasco",
  "FacilityState": "WA",
  "FacilityZipCode": "99301",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53021",
  "LEPC": "Franklin County LEPC",
  "FacilityLatDecDegs": "46.220278",
  "FacilityLongDecDegs": "-119.1025",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Pasco",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Pasco",
  "OperatorStr1": "PO Box 293",
  "OperatorStr2": "525 N. 3rd Ave",
  "OperatorCity": "Pasco",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "99301",
  "OperatorZipCodeExt": null,
  "RMPContact": "Harold Posthuma",
  "RMPTitle": "Plant Division Manager",
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000145924",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-15 00:00:00",
  "SafetyInspectionBy": "State Dept of Health",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 46.22028,
  "FRS_Long": -119.1025,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18838,
      "AltID": "Chlorine for disinfection",
      "FacilityID": 13805,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19327,
          "ProcessID": 18838,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 23710,
          "ProcessID": 18838,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 523710,
          "ProcessID": 18838,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13805,
      "SummaryText": "This Risk Management Plan is for the planning of the response to a potential chlorine leak at the City of Pasco's Butterfield Water Treatment Plant. The City uses chlorine as the primary disinfectant in the water treatment process. We have not had an accidental release of chlorine in the past five years.\n\nPersonnel that work for the City of Pasco, treat chlorine gas with the utmost care and respect.  Written Standard Operating Procedures for handling chlorine and an Emergency Response Procedure were established in June 1994. Since that time, the City of Pasco has written a Process Safety Management Plan for the chlorine at the Water Treatment Plant that conforms to the Occupational Safety and Health Administration (OSHA) and the State Department of Labor and Industries requirements for Management of Highly Hazardous Chemicals.  This plan was developed to provide guidelines for response to threatened or actual chlorine release that will minimize the potential for employee and/or public exposure to these hazardous materials.\n\nThe Risk Management Plan takes the Process Safety Management Plan another step. The Environmental Protection Agency (EPA) and the National Oceanic and Atmospheric Administration  (NOAA) created standards and a computer modeling program intended to meet the requirements of the Risk Management Guidance for Offsite Consequence Analysis. The modeling required is for two scenarios. The first scenario being the \"worst case release.\"  This is to represent the very worst possible situation for a possible accident. The second scenario being the \"alternative release.\"  This is to represent the most probable situation for a possible accident. \n\nThe worst case scenario includes the assumption that all four of the Water Treatment Plant one ton chlorine cylinders that are on-line would be released into the atmosphere in ten minutes time. A release of this size would effect the operation of the Water Treatment Plant and a large portion of the population of the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13805,
      "SummaryText": "City of Pasco. The primary response is to contact the Pasco Fire Department so that they may contact the area Hazardous Materials Response Team. They would take control of the situation at that point in time. They have a more accurate computer modeling program they would use at that time to better determine the extent of the emergency. The chances of this size of accident actually occurring are minimal because of the type of controls and the nature of the gas.\n\nThe alternative release scenario includes the assumption that one of the one ton chlorine cylinders was ruptured while unloading the cylinder. A release of this size would effect an area around the Water Treatment Plant with a radius of 0.3 miles. That means about 690 residents may be effected. The primary response is to contact the Pasco Fire Department so that they may contact the area Hazardous Materials Response Team. They would take control of the situation at that point in time. They have a more accurate computer modeling program they would use at that time to better determine the extent of the emergency. The Franklin County Emergency Management team actually conducted a simulated drill for this scenario in the summer of 1998.\n\nPlans for changes to improve safety are developed as they are identified and evaluated."
    }
  ]
}