{
  "FacilityID": 13811,
  "FacilityName": "Callaway Chemical Company",
  "FacilityStr1": "134 Phelps Rd., S.E.",
  "FacilityStr2": null,
  "FacilityCity": "Dalton",
  "FacilityState": "GA",
  "FacilityZipCode": "30720",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13313",
  "LEPC": null,
  "FacilityLatDecDegs": "34.695833",
  "FacilityLongDecDegs": "84.986111",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3333945,
  "ParentCompanyName": "Vulcan Chemicals",
  "Company2Name": null,
  "CompanyDUNS": 178136065,
  "Company2DUNS": 0,
  "OperatorName": "Vulcan Chemicals",
  "OperatorStr1": "1200 Urban Center Drive",
  "OperatorStr2": null,
  "OperatorCity": "Birmingham",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35242",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dale Bauer",
  "RMPTitle": "Manager, EH&S",
  "FTE": 35,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000146273",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-10-30 00:00:00",
  "SafetyInspectionBy": "State EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Dalton Plant",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.69569,
  "FRS_Long": -84.98581,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18845,
      "AltID": "Anhydrous ammonia process",
      "FacilityID": 13811,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19334,
          "ProcessID": 18845,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 23717,
          "ProcessID": 18845,
          "ChemicalID": 56,
          "Quantity": 350000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 523717,
          "ProcessID": 18845,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 18846,
      "AltID": "Aqueous ammonia process",
      "FacilityID": 13811,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19335,
          "ProcessID": 18846,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 23718,
          "ProcessID": 18846,
          "ChemicalID": 57,
          "Quantity": 252000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 523718,
          "ProcessID": 18846,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13811,
      "SummaryText": "\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Callaway-Dalton plant has a long-standing commitment to worker and public safety and to the protection of the environment.  We are committed to operating and maintaining all of our processes in a safe and responsible manner, as demonstrated by the resources we invest to prevent accidents.  As a member of the Chemical Manufacturers Association, we adhere to the principles of Responsible Care..  In addition to ensuring that our employees have the best possible training in the operation of our processes, we demand that safety be the first priority in the design, installation, operation, and maintenance of our processes. \nWe have implemented maintenance and inspection programs that ensure site integrity.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  Examples of controls to prevent releases include (1) installation of pressure relief valves to prevent rupture of vessels due to overpressurization, (2) routine visual inspection and thickness checks to ensure vessels and piping are in good condition, (3) using materials of construction that are compatible with the process chemistry and (4) using water scrubbers to remove small amounts of emissions.\n However, if a release does occur, trained personnel will respond to control and contain the release.  Mitigation measures that have been included in our design include installation of isolation valves, isolated storage of flammable chemicals away from other chemicals and materials that could burn, fire fighting equipment in all process areas, a fully implemented emergency response plan, appropriate PPE and an alarm system for early notification of a release.  The local fire department is also familiar with our site.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe Callaway-Dalton plant is primarily involved in manufacturing sodium glucoheptonate and blending chemical formulations used by the carpet"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13811,
      "SummaryText": " industry.  As a part of this manufacturing process, we use two substances that are covered by the risk management program (RMP) rule (40 CFR 68).  However, we also use a combination of good design practices, an accidental release prevention program, and an emergency response program to ensure the safety of our employees, the public, and the environment.  We are committed to operating our facility in a safe and responsible manner.  Following is a brief description of the facility and a list of RMP-regulated processes at our facility.\nThe Callaway-Dalton plant is located on a 26.76 acre site.  The covered chemicals currently are anhydrous ammonia and aqua ammonia.  The maximum quantity of anhydrous ammonia stored on site is about 350,000 pounds and the maximum of aqua ammonia is 252,000 pounds.  Both processes are subject to Program Level 3.\n\n\nKEY OFFSITE CONSEQUENCE ANALYSIS SCENARIOS\n\nEPAs RMP rule (40 CFR 68) requires that we provide information about two types of offsite consequence analysis scenarios:  worst-case scenarios and alternative release scenarios.  There are strict requirements for choosing and modeling worst-case release scenarios; as a result, these scenarios are often exceedingly conservative.  The purpose of the alternative release scenarios is to provide emergency planners with more information about the chemicals we handle and about their relative hazards.  The alternative release scenarios are more realistic than worst-case release scenarios but are still unlikely to happen.\nFollowing are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures that limit exposure distances.\nWorst-case toxic release scenario\nThe worst-case release scenario representing the toxic substances handled by Callaway-Dalton is a catastrophic rupture of a storage tank containing anhydrous ammonia.  The entire quantity of ammonia, 175,000 lb, is released to the atmosphere over a 10-min period.  Although we ha"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13811,
      "SummaryText": "ve several mitigation features on this storage tank that would limit the release rate and/or quantity of the release, none of these measures are taken into account in evaluating this scenario.  The ammonia released to the atmosphere travels about 5 miles before dispersing below the toxic endpoint.  Approximately 50,000 people live within 5 miles of the storage tank.  The public and environmental receptors that are located within this distance include: I-75, churches, schools, Shopping Areas, railroads, housing developments, various industries, the Conasauga River, Crown and Treadmill Lakes and various creeks.\nAlternative toxic release scenarios\nThe alternative release scenario for ammonia solution is a break in the hose used for unloading aqueous ammonia into a tank truck from our process.  The liquid is pumped to the ground at a flow rate of 700 lb/min for 2 min, which is the length of time required for a Callaway employee to shut off the pump.  The ammonia evaporates from the liquid pool and travels about 0.1 miles before dispersing below the toxic endpoint. Less than 50 people live within this distance from the tank truck.  The public and environmental receptors that are located within this distance include:  a few houses and businesses and a Southern Railroad set of tracks.\nThe alternative release scenario for anhydrous ammonia is a break in the pipe used for unloading ammonia from a railcar to our process.  The flow rate from the railcar is limited to 30,000 lb/hr, because a greater flow rate will activate the excess flow valve and shut off the flow; however, the flow rate from the storage tank (12,000 lb/hr) is not restricted by a mitigation feature.  The release lasts for 5 min, which is a conservative estimate of the time required for a Callaway employee to stop the release. The ammonia cloud travels about 0.2 miles before dispersing below the toxic endpoint.  Approximately 50 people live within this distance from the railcar.  Some of the public and environ"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13811,
      "SummaryText": "mental receptors that are located within this distance are as follows: a number of houses and businesses and Highway 41.\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nWe take a systematic, proactive approach to preventing accidental releases of hazardous chemicals.  Our management system addresses each of the key features of a successful prevention program, as described below in Sections 4.1 through 4.12.\n\n\n\nPROCESS SAFETY INFORMATION\n\nThe Callaway-Dalton plant maintains a variety of technical documents that describe the chemicals and processes at our facility.  These documents are kept up to date and are available to all employees and address important process parameters such as (1) operating limits for the equipment, (2) design basis and configuration of the equipment, and (3) physical properties and hazards of the chemicals used in our processes.\nChemical information is usually documented within Material Safety Data Sheets (MSDSs). MSDSs contain information concerning both the physical properties and the hazards associated with each chemical.  This information typically includes (1) toxicity information, (2) physical data, (3) reactivity and corrosivity data, (4) thermal and chemical stability data, and (5) hazards of mixing substances together.  MSDSs are available to all employees, as well as the emergency responders in our community.  All chemicals on site have an MSDS.\nImportant process parameters are also documented and maintained.  Engineering design documents may include (1) operating limits, (2) block flow or simplified process flow diagrams, (3) process chemistry, (4) maximum intended inventories, (5) design basis and configuration, (6) piping and instrumentation diagrams, and (7) other information that is important for understanding the design intent, operating limits, and hazards of each process.\n\nPROCESS HAZARD ANALYSIS\n\nThe Callaway-Dalton plant has a comprehensive program for ensuring that the hazards associ"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13811,
      "SummaryText": "ated with our processes are identified and controlled.  Each process is examined in detail to ensure that all hazards are identified and that appropriate controls are in place to manage those hazards.\nA hazard and operability (HAZOP) analysis is typically used for our process hazard analyses.  A team comprising personnel with engineering, operations, environmental and maintenance experience systematically examines each hazard in each section of the process and identifies potential causes and a range of possible consequences.  The team then compares the hazard to the existing set of prevention and mitigation measures designed to contain that hazard, making further recommendations when deemed necessary.  These recommendations are resolved by management and are tracked until they are implemented.\n We update and revalidate each process hazard analysis every five years or whenever a significant change is made.   The results and findings from these revalidation studies are documented and retained, and recommendations are tracked until resolved by management.\n\nOPERATING PROCEDURES\n\nOur engineers, operators, and supervisors work together to develop and maintain operating procedures that ensure the safe operation of our facility.  These procedures cover all modes of operation, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new or improved process. Operating procedures are used as a reference by experienced employees and provide a consistent basis for training new employees.  In addition to describing the steps for safely conducting operations, the procedures also contain valuable information about safe upper and lower limits, consequences of deviations, and applicable safety and health information.  Operating procedures are annually certified as accurate to ensure that they are updated following process changes. \n\nThe Callaway-Dalton plant also operates using the Callaway ba"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 13811,
      "SummaryText": "tchsheet system.  Batchsheets are the detailed operating procedures for making a batch of product.  The batchsheets include process deviation codes describing the actions to take under various conditions (e.g., high temperature, high pressure, loss of cooling, etc) that may be encountered while manufacturing batches using highly hazardous chemicals.\n\nTRAINING\n\nThe Callaway-Dalton plant trains workers to safely and effectively perform their tasks.  Employees who are new to a process are given basic training that includes (1) a general overview of the process, (2) the properties of the substances used in the process and their associated hazards, and (3) a detailed review of the operating procedures for that process.  Once they have demonstrated their understanding of this initial training, they are paired with an experienced operator to learn their specific job functions and tasks.  After they demonstrate their competence in performing these tasks, they are allowed to work independently.\nThrough oral reviews, written tests, and on-the-job demonstration, we ensure that our employees understand the training given to them.  The frequency of refresher training is decided, in part, by our employees but is performed at least every three years.  All training given to an employee is documented, along with the means used to verify that the training is understood.\n\n\nMECHANICAL INTEGRITY\n\nThe Callaway-Dalton plant maintains the mechanical integrity of our equipment to prevent equipment failures that could endanger workers, the public, or the environment.  Our inspection and testing program helps identify equipment damage or deterioration before the equipment fails.  When a deficiency is found, maintenance personnel will correct the problem and try to identify the root causes of the deficiency so that future problems are avoided.  Our quality assurance system ensures that new or replacement equipment meets the strict design standards required for service in our facility.  The mec"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 13811,
      "SummaryText": "hanical integrity system includes (1) inspection and testing procedures, (2) replacement equipment specifications, (3) procedures for safe work practices, (4) maintenance personnel training, and (5) required documentation.\n\nMANAGEMENT OF CHANGE\n\nWe review any changes to our processes to determine if new hazards are introduced or existing prevention measures are threatened.  Except for replacements-in-kind (e.g., replacing a valve with an identical valve), all changes are subjected to a hazard analysis to ensure that (1) new hazards are not inadvertently introduced into the system, (2) safety consequences resulting from the change are addressed, (3) operators in the process are notified of the change and made aware of possible repercussions, and (4) all training material, process safety information, and operating procedures are updated.  The management of change system applies to changes in the chemicals used, process equipment, technology, procedures, and other facility changes.\n\n\nPRE-STARTUP REVIEW\n\nWhenever a change occurs that requires updating the process safety information, the Callaway-Dalton plant performs a pre-startup safety review.  This review ensures that safety features, procedures, personnel, and the equipment are prepared for service before the process is restarted. A pre-startup review will generally include field verification of new construction and also serves a quality assurance function by verifying that accident prevention measures are implemented correctly.  Generally, a pre-startup review will ensure that (1) construction and equipment are consistent with design standards, (2) adequate operating, safety, and maintenance procedures are in place, (3) training for all affected employees is complete, and (4) a process hazard analysis has been performed, if necessary.\n\nINCIDENT INVESTIGATION\n\nThe Callaway-Dalton plant trains its employees to promptly investigate each incident that resulted in, or could have resulted in, serious injury to employees,"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 13811,
      "SummaryText": "on plant provides training and procedures to ensure that contractor employees (1) perform their work in a safe manner, (2) are aware of the hazards associated with the area in which they will be working, (3) understand the emergency response procedures, and (4) report any hazards they find during their work.  Our personnel periodically monitor contractor activities to ensure they are performing their work in a safe manner.\n\nCOMPLIANCE AUDITS\n\nA compliance audit is performed periodically to help ensure that the prevention program activities at our facility are adequate and that safety issues are addressed effectively.  Audits are performed by a team that is knowledgeable in our processes, but is independent of our facility, to ensure a thorough and complete evaluation.  The audit team systematically evaluates each aspect of the prevention program, ensuring both compliance with the RMP rule and effective hazard prevention.  The results of audits are documented, and recommendations are tracked until they are resolved.  Compliance audits are conducted at least every three years.\n\nCHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe prevention program described previously ensures the safe operation of our facility by providing our employees with a system they can use to safely perform their job functions.  This management system helps prevent hazards associated with equipment failures and human error. In addition to the prevention program, the Callaway-Dalton plant has safety features built into the design of our facility that help to ensure safe process operation for our employees, the public, and the environment.  These features may contain or control a release, detect a release, or reduce the consequences of a release.  They may also prevent a release by providing strict design standards for process equipment.  The following types of safety features are used in various processes in our facility:\nRelease detection\n7    Automatic detection of vapors with alarms\n7    Procedures require tha"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 13811,
      "SummaryText": " the public, or the environment.  Incident investigations are designed to determine the facts, identify the root causes, and provide recommendations for ensuring that the incident does not recur.  Corrective actions resulting from an incident investigation are tracked until they are resolved.\nIncident investigations are conducted in accordance with Callaway Safety Standard 201 and utilize Non-Conformance Notices (NCN's) that are defined through our ISO Problem Elimination Procedure (AP-010).\n\n\nEMPLOYEE PARTICIPATION\n\nThe Callaway-Dalton plant encourages employees to be involved in every aspect of process safety management and accident prevention.  Employees are routinely asked to participate in process hazard analyses, incident investigations, management of change hazard analyses, and all other aspects of the prevention program.  Employees have access to all information developed as part of the prevention program, and are specifically informed of any changes that occur in their process areas.  The various ways employees are involved in the prevention program are documented in a written plan, DAL-AD02.\n\nSAFE WORK PRACTICES\n\nThe Callaway-Dalton plant has established safe work practices that ensure the safety of our employees.  Examples of these procedures include (1) a hot work permit that is designed to control spark- or flame-producing activities, (2) a permit and procedure to control confined space entry, and (3) a lockout/tagout procedure for isolating energy sources during maintenance.  These procedures and permits ensure that operations and maintenance activities are performed safely.\n\nCONTRACTORS\n\nThe Callaway-Dalton plant uses contractors for various activities, such as maintenance and construction. All contractors are evaluated to ensure that they are well trained and are able to perform their job function in a safe manner.  A contractors safety record and performance are reviewed during the selection process.\nOnce a contractor is selected, the Callaway-Dalt"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 13811,
      "SummaryText": "t a Callaway-Dalton plant employee be present during loading and unloading operations\nRelease containment and control\n7    Valves to permit isolation of the process\n7    Manual shutdown systems \n7    Diked areas designed to contain a release\n7    Pressure relief valves  that discharge safely to the atmosphere\nRelease mitigation\n7    Water spray equipment\n7    Trained emergency response personnel\n7    Personal protective equipment (e.g., protective clothing, self-contained breathing apparatus)\n7    Spill clean-up equipment\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nOur five-year accident history shows that the site has had only a few minor releases of RMP chemicals.  None of the incidents have resulted in any injuries or deaths to our own employees or the public.  In addition, no significant property damage occurred on site or off site.\nFor each of these incidents, we conducted an incident investigation to identify and correct the root causes of the events.  The following list describes some of the improvements made as a result of these investigations:\n-  Eliminated chlorine handling at the facility\n-  Changed anhydrous ammonia suppliers with improved rail car checking systems\n-  Installed ammonia vapor alarms\n-  Installed temperature and pressure sensors in processing equipment\n\n\nEMERGENCY RESPONSE PROGRAM\n\nThe Callaway-Dalton plant maintains a written emergency response plan that is designed to protect employees, the public, and the environment.  The procedures include all aspects of emergency response, including proper first-aid and other medical procedures, the use of emergency equipment, the use of personal protective equipment, evacuation plans, and community emergency response notification procedures.\nProcedures for maintaining emergency response equipment are also contained in the emergency response plan.  There are procedures that address maintaining, inspecting, testing, and using the critical equipment needed in an emergency.  Employees receive periodic training in the duties they are expecte"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 13811,
      "SummaryText": "d to perform during an emergency, and any change in the emergency response plan is administered through the management of change process so that affected employees are notified.\nThe emergency response plan is coordinated with local emergency responders (e.g., the fire department).  This includes periodic meetings among community responders facility representatives so that they are aware of the hazards of our processes.  Communication channels with local responders are kept open 24-hours per day.  This coordination and communication ensures that the public is quickly notified, if necessary, and that action is promptly taken to minimize the consequences of a release.  We periodically conduct emergency response drills so that all participants are familiar with their duties during an emergency.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Callaway-Dalton plant continuously strives to improve the safety of our processes.  Suggestions for improving safety are regularly addressed through process hazard analyses, management of change procedures, incident investigations, and employee suggestions.  The following changes are currently planned or have recently been completed:\n -  Developed improved procedures for anhydrous ammonia handling\n-  Installed temperature and pressure gauges where appropriate\n-  Installed check valves, pressure relief valves where appropriate\n-  Installed double locks on anhydrous ammonia unloading lines\n-  Installed level indicators and high level probes where appropriate\n-  Labeled all lines and equipment to minimize human errors\nCallaway Chemical has implemented a comprehensive Year 2000 program that addresses all aspects of computer, microprocessor and software use throughout the company's business and industrial operations.  At the plant, the Year 2000 program addresses computers, microprocessors and software controlling operations of the plant."
    }
  ]
}