{
  "FacilityID": 13823,
  "FacilityName": "J. F. Copeland Farm",
  "FacilityStr1": "19201 NWCR 235 A",
  "FacilityStr2": null,
  "FacilityCity": "Alachua",
  "FacilityState": "FL",
  "FacilityZipCode": "32616",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12001",
  "LEPC": "District 3 LEPC",
  "FacilityLatDecDegs": "29.835222",
  "FacilityLongDecDegs": "-82.53025",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "William S.Copeland",
  "OperatorStr1": "19201 NWCR 235 A",
  "OperatorStr2": null,
  "OperatorCity": "Alachua",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32616",
  "OperatorZipCodeExt": null,
  "RMPContact": "William S. Copeland",
  "RMPTitle": "Owner",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000145309",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-06-24 00:00:00",
  "DeRegistrationEffectiveDate": "2010-06-20 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 29.83522,
  "FRS_Long": -82.53025,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18861,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 13823,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19350,
          "ProcessID": 18861,
          "NAICSCode": "42291",
          "_desc": {
            "NAICS_CODE": "42291",
            "NAICS_DESCRIPTION": "Farm Supplies Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 23733,
          "ProcessID": 18861,
          "ChemicalID": 56,
          "Quantity": 80000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 523733,
          "ProcessID": 18861,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13823,
      "SummaryText": "J.F. Copeland Farm - Alachua, Florida\n\nEXECUTIVE SUMMARY\n\nThe J.F. Copeland Farm is a facility whose primary activities are the storage, sales and distribution of seed, feed and fertilizers to the local farming community. J. F. Copeland Farm stores and distributes one regulated substance, anhydrous ammonia (CAS 7664-41-7) as a land applied fertilizer for crop production. The owner, management and staff of the J.F. Copeland Farm in Alachua, Florida are committed to the prevention of any accidental releases of anhydrous ammonia.  If an accidental release should occur, facility personnel are trained to respond to and stop the release and minimize the offsite consequences.  If the release is too large for personnel at the J.F. Copeland Farm to manage, the facility is prepared to work with the Alachua County Fire Department, or other authorities, to mitigate large releases and minimize the impact of the release to people and the environment. \n\nThe anhydrous ammonia storage process consists of one storage tank, liquid and vapor piping and delivery hose systems.  The process is used to receive anhydrous ammonia from the delivery truck into the storage tank and distributed from the storage tank into smaller, mobile tanks for both direct application and for blending into mixed-grade fertilizers for crop production nutrients.  The anhydrous ammonia process begins with the receipt of anhydrous ammonia via tanker.  The maximum amount of anhydrous ammonia received and stored at J. F. Copeland Farm in Alachua at one time is two tanker-truck loads or 80,000 pounds (lbs.). \n\nAs required by the United States Environmental Protection Agency (EPA), both a worst-case and alternative release scenarios were performed for the anhydrous ammonia storage process.  The hazard assessments were performed on the anhydrous ammonia process using look-up tables provided in revised edition of The Fertilizer Institute's Risk Management Program Document for Agricultural Retailers.  The look-up tables "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13823,
      "SummaryText": "provided in the June 1999 revision of the \"Retail Guidance Document for EPA's Risk Management Program are based on the DEGADIS model.  The worst-case release scenario was assumed to be the release of the total amount of anhydrous ammonia in the storage tank over a duration of 10 minutes. The maximum quantity released would be 80,000 lbs., which represents the maximum volume of anhydrous ammonia stored at the site at any one time. The distance to the toxic endpoint (point of dispersion to 200 parts per million) is 2.13 miles.\n\nThe alternative release scenario selected for the J.F. Copeland Farm in Alachua was a break in the pipe leading to the anhydrous ammonia storage tank. In this scenario, a 2-inch diameter break in the pipe occurs in the pipe creating a leak in the system.  J.F. Copeland Farm employees are capable of responding to and stopping the leak within two minutes of detection.  The distance to the 200 parts per million endpoint is 1.18 miles. \n\nTo comply with the requirements of EPA's Risk Management Program (RMP) rule, J. F. Copeland Farm has developed an accidental release prevention program and emergency action plan for the Alachua farm. The accidental release prevention program satisfies the requirements for the EPA RMP.  The prevention program ensures that our facility is operated under safe conditions and that any risk of an accidental release of anhydrous ammonia is minimized.  The program has been written to reduce the potential of an accidental release due to human error, or equipment failure at our facility.  In order to prevent the release of anhydrous ammonia due to human error, our prevention program ensures that operating procedures are current and reviewed annually.  Training also plays a vital part in our program.  Employees and contractors working on or near the anhydrous ammonia area are trained in the hazards associated with anhydrous ammonia.   \n\nTo prevent equipment failure that could result in an accidental release, our program ensur"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13823,
      "SummaryText": "es that equipment inspections, tests, and preventive maintenance are performed in accordance with accepted engineering practices and manufacturer's recommendations.  The J.F. Copeland Farm in Alachua has implemented the provisions of \"Safety Requirements for the Storage and Handling of Anhydrous Ammonia, K-61.1\", published by the American National Standards Institute, Inc.  We also comply with the standards of the United States Occupational Safety and Health Administration's (OSHA), 29 CFR 1910.111, Storage and Handling of anhydrous ammonia. All anhydrous ammonia delivery trucks and equipment are examined upon delivery and are rejected if there are any signs of damage to transfer hose or other delivery system component.  In addition, equipment pertaining to the anhydrous ammonia process is visually inspected each time the system is operated and daily at a minimum. Employees actively participate in the implementation of the RMP at our facility. Employees responsible for performing task involving the anhydrous ammonia process have each been given a number of tasks to complete to ensure that all elements of the RMP are implemented.  We have developed and incorporated many different forms into our RMP to assist employees in recording and documenting the various activities required to be completed to comply with program requirements. \n\nAt the time of the submittal of this Risk Management Plan, there have been no accidental releases of anhydrous ammonia from our facility in the past five years that:\n\n1. have caused any deaths, injuries, or significant property damage at the J.F. Copeland Farm in Alachua; nor\n\n2. to our knowledge, have resulted in offsite deaths, injuries, and evacuations, sheltering in place or environmental damage.\n\nHowever, in the event that there is an accidental release of anhydrous ammonia, an Emergency Action Plan has been written in compliance with 29 CFR 1910.38 to assist employees in responding to the release. We have also provided state and loca"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13823,
      "SummaryText": "l authorities the emergency planning and community right-to-know information required under SARA Title III (EPCRA) and have been included in the Local Emergency Planning Committee hazard assessment and emergency response plan. We also have a written emergency response program, which complies with 29 CFR 1910.120, including pre-emergency planning and employee training. Our employees are trained in accordance with our written programs and are capable of responding to accidental releases of anhydrous ammonia.  In the event that a release of anhydrous ammonia occurs, employees will respond and stop the leak and report the incident to the Alachua County Fire Department if outside assistance is required.  Our emergency action plan consists of evacuation procedures for various spill scenarios, facility emergency numbers, and notification procedures for Alachua County Fire and Rescue.  The plan also contains procedures for notifying the public and the LEPC.\n \nWe assisted the planning the Local Emergency Planning Committee's (LEPC) Safety Street program and actively participated in the Safety Street Rollout in Gainesville.  Improvements in safety at the J.F. Copeland Farm are an on-going process.  We routinely evaluate and inspect the anhydrous ammonia system components to assess the maintenance of safe conditions.  Formal inspections and tests are conducted annually. Currently, there are no specific additional recommendations to be implemented at the J.F. Copeland Farm in Alachua Florida."
    }
  ]
}