{
  "FacilityID": 13844,
  "FacilityName": "Wastewater Treatment Plant, Donna, Texas",
  "FacilityStr1": "1-1/4 Mile South 11th Street",
  "FacilityStr2": null,
  "FacilityCity": "Donna",
  "FacilityState": "TX",
  "FacilityZipCode": "78537",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48215",
  "LEPC": "Hidalgo County LEPC",
  "FacilityLatDecDegs": "26.148333",
  "FacilityLongDecDegs": "-98.053278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "HTTP://WWW.DONNA.LIB.TX.US",
  "FacilityEmailAddress": "HALANIS@ACNET.NET",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Donna, Texas",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "ECO Resources, Inc.",
  "OperatorStr1": "114 S. 13th Street",
  "OperatorStr2": null,
  "OperatorCity": "Donna",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78537",
  "OperatorZipCodeExt": null,
  "RMPContact": "F. Beau Delattre",
  "RMPTitle": "District Manager",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000145764",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-30 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 26.14833,
  "FRS_Long": -98.05328,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18883,
      "AltID": "Disinfection",
      "FacilityID": 13844,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19372,
          "ProcessID": 18883,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 23757,
          "ProcessID": 18883,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 523757,
          "ProcessID": 18883,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13844,
      "SummaryText": "\n\nEXECUTIVE SUMMARY \n\nThe City of Donna Wastewater Treatment Plant accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices. The US Environmental Protection Agency (EPA) Prevention Program procedures are adhered to where applicable. The Donna emergency response policy involves the preparation of a response plan, which is tailored, to each facility and to the emergency response services available in the community and complies with the EPA Emergency Response Program requirements.  Senior management is committed to the issue of safety and implementation of safe operating procedures.\n\nThe City of Donna Wastewater Treatment Plant is generally located south of the city at 1-1/4 Mile South 11th Street, in Donna, Hidalgo County, Texas.  The Wastewater Treatment Plant has a treatment capacity of 2.3 million gallons per day and is professionally managed by ECO Resources, Inc.  Chlorine is used as the disinfectant at the Wastewater Treatment Plant and is the only substance used that is above the EPA threshold limit.  The chlorination building consists of a four-sided structure with two one-ton containers facing north and generally located in the southwest portion of the facility. The chlorine containers have manual shut-off valves in case of an emergency, and a chlorine alarm will be triggered if a release occurs. An emergency air supply is available. The facility is manned eight-hours a day. The operator checks the chlorination building daily. A self-contained-breathing-apparatus (SCBA) is stored in the office located approximately 200 ft. away from the chlorination building. The off-site consequence analysis includes consideration of two chlorine release scenarios, identified as \"Worst case\" and \"Alternative\" scenarios. The first scenario is defined by EPA, which states the \"the \nowner or operator shall assume that the ... maximum quantity in the largest vessel... is released as a gas over 10 minutes,"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13844,
      "SummaryText": "\" due to an unspecified failure. The alternative scenario is defined as \"more likely to occur than the worst-case release scenario.\" \n\nThe worst-case release scenario at the Donna Wastewater Treatment Plant involves a failure of one one-ton (2,000-pound) cylinder of chlorine, which would release its entire contents within 10 minutes.  This is a release rate of 200 pounds per minute.  Using EPA's RMP*Comp(tm) dispersion model, the worst-case scenario would have a toxic endpoint of 2.2 miles distance from the Wastewater Treatment Plant, and would impact approximately 15,000 people.  The alternate-case release scenario identified a toxic endpoint distance of 0.2 miles from the Wastewater Treatment Plant, which would impact approximately 50 people.  The alternate-case release scenario identified a release rate of 23.1 pounds of chlorine per minute with a duration of 15 minutes.\n\nThe general Donna Wastewater Treatment Plant accidental release prevention program is based on the following key elements. \n\nz High level training of the operators; \nz Preventive maintenance program; \nz Use of state of the art process and safety equipment; \nz Use of accurate and effective operating procedures, written with the \n    participation of the operators; \nz Performance of a hazard review of equipment and procedures; \nz Implementation of an audit and inspection program. \n\nChemical specific prevention steps include availability of SCBA worn by the operator during connection/disconnection of chlorine supply, awareness of the hazardous and toxic properties of chlorine and presence of chlorine detectors. \n\nNo accidental releases of chlorine have occurred at this facility in the past five years. \n\nThe City of Donna Wastewater Treatment Plant complies with OSHA PSM rule and all regulatory requirements of the Texas Natural Resource Conservation Commission.\n\nThe facility has an emergency response program, which has been coordinated with the City of Donna Fire and Police Departments, which are me"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13844,
      "SummaryText": "mbers of the Local Emergency Response Planning Committee (LEPC). This program includes an emergency response decision and notification plan. Emergency response drills and drill evaluations are conducted annually, emergency operation and response procedures are also conducted annually."
    }
  ]
}