{
  "FacilityID": 13886,
  "FacilityName": "Eastside W.R.F.",
  "FacilityStr1": "3510 E. Laurel Rd",
  "FacilityStr2": null,
  "FacilityCity": "Nokomis",
  "FacilityState": "FL",
  "FacilityZipCode": "34275",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12115",
  "LEPC": "District 9 LEPC",
  "FacilityLatDecDegs": "27.141667",
  "FacilityLongDecDegs": "-82.568889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": "pwilson@ci.venice.fl.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Venice",
  "Company2Name": null,
  "CompanyDUNS": 93602191,
  "Company2DUNS": 0,
  "OperatorName": "City of Venice",
  "OperatorStr1": "401 W. Venice Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Venice",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "34285",
  "OperatorZipCodeExt": "2098",
  "RMPContact": "Patricia S. Wilson",
  "RMPTitle": "Superintendent of Pollution Control",
  "FTE": 23,
  "OtherEPAFacilityID": "FL0041441",
  "EPAFacilityID": "100000145737",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-27 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2003-05-14 00:00:00",
  "DeRegistrationEffectiveDate": "2002-11-30 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 27.13344,
  "FRS_Long": -82.40111,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18935,
      "AltID": "On Site CL2 System",
      "FacilityID": 13886,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19424,
          "ProcessID": 18935,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 23822,
          "ProcessID": 18935,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 523822,
          "ProcessID": 18935,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13886,
      "SummaryText": "FACILITY DESCRIPTION\n\nThe City of Venice operates two wastewater treatment plants located within the city limits. The Eastside Water Reclamation Facility (WRF) is located in the northeast corner of the City just east of I-75.  The Island Beach Wastewater Treatment Plant (WWTP) is located in the southwest corner of the City on the gulf coast.  The function of both plants is to treat wastewater to public access standards for distribution to a reclaimed water irrigation system.  Chlorine gas, a hazardous and toxic chemical, is used for disinfection because it provides the best balance of disinfection ability, ease of use, relatively low cost, and residual disinfecting power for the effluent treated and public served. Typically, the City will store up to 10,000 pounds of chlorine at each plant for current and future use.  The City has provided disinfection with chlorine from the plant's inceptions.  The chlorine is stored in open buildings, each equipped with chlorine alarm systems.  The Eastside WRF has a water curtain, deluge system surrounding the chlorine storage area.\nBoth facilities are protected against intrusion by a perimeter fence.    \n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES:\n\nThe City's overall policy with respect to chlorine gas is based around the need for conscientious storage, handling, and use of the chemical. The City has a comprehensive program of procedures related to these chemicals designed to minimize the likelihood of exposure to our employees as well as the residents. Procedures in place for both Wastewater Treatment Plants mandate the use of a specialized team of employees who are the only persons allowed to handle the containers or equipment.\nThe procedures are based, in part, on the most stringent requirements of the OSHA Process Safety Management rule.  Emergency response, in the event of a release, is handled through a formal Emergency Response Plan enacted by the City several years ago. The City of Venice Fire Depart"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13886,
      "SummaryText": "ment serves as the initial responder in the case of all emergency calls from a Utility facility, including the wastewater plants. In the event that a hazardous release has occurred, the Fire Department will mobilize the Hazardous Materials (HAZMAT) response unit. The HAZMAT team will perform coordination of response, public communication, recovery and cleanup activities.\n\nCHEMICAL RELEASE SCENARIOS:\n\nAs part of the procedure to prepare this Risk Management Plan (RMP), the City has undertaken a rigorous review of the required worst-case and alternate release scenarios for chlorine at the wastewater plants. These scenarios are reviewed to determine the offsite impact, if any, of such a release.\n\nThe \"worst-case\" scenario involves the loss of all the contents of the largest chemical container (a one-ton container of chlorine), which are the largest single storage unit held by the City. Under regulatory requirements, this scenario assumes that the worst possible combination of release rate, weather conditions, and release location occur. If a release were to occur in this \"worst-case\" mode, an area outside the plant site would be affected.\n\nThe City believes that the risk associated with such a scenario is negligible, since the conditions leading to this type of release are considered to be extremely rare. The City, as part of its Accident Prevention Program, requires that the persons delivering chlorine to the wastewater plants be trained in the safe handling of containers and cylinders. The chemical producers, through their professional trade associations, have developed packaging, inspection, and transportation standards designed to maximize the safe handling of chlorine in public areas.\n\nThe most likely form of release involves a container leak as a result of a severely corroded container or a faulty supply valve. Chemical industry standards provide protection against corroded containers and it is the City's policy to reject any container exhibiting traits of a defe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13886,
      "SummaryText": "ctive valve. The City's procedures mandate that the connection of containers or cylinders be performed only during daylight hours with a specifically-trained staff providing the service. In the event of a leak, the gas concentration detectors would sound an alarm. The alarm, in turn, will activate the City's emergency response protocols.\n\nThe City considered an alternate release scenario for this RMP. The alternate release scenario assumes that a lesser amount of gas is released than during the worst-case scenarios. Under these alternates, a relatively small amount of gas would escape leading to a small area of offsite impact.\n\nFIVE-YEAR ACCIDENT HISTORY:\n\nOver the last five years, the City of Venice has not experienced an accidental release of chlorine.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM:\n\nThe City is implementing a program designed to minimize the likelihood, and potential impact, of accidental releases. Specific elements of the program include regular process hazard analysis, training, contractor safety programs, regular review and updating of operating procedures, maintenance programs to enhance mechanical integrity, self-administered compliance reviews, and management of change.\nEach of the individual elements is supported by an organization framework in which key employees are given responsibility for RMP elements. This management program includes mandatory review and documentation procedures to ensure future safety as the plants and processes change."
    }
  ]
}