{
  "FacilityID": 14049,
  "FacilityName": "City of Terrell - Water Treatment Plant",
  "FacilityStr1": "2603 Highway 80 East",
  "FacilityStr2": null,
  "FacilityCity": "Terrell",
  "FacilityState": "TX",
  "FacilityZipCode": "75160",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48257",
  "LEPC": "Kaufman County LEPC",
  "FacilityLatDecDegs": "32.733639",
  "FacilityLongDecDegs": "-96.250028",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": "cityofterrell@airmail.net",
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Terrell",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Terrell",
  "OperatorStr1": "P.O. Box 310",
  "OperatorStr2": null,
  "OperatorCity": "Terrell",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75160",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000148351",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-11 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2007-08-20 00:00:00",
  "DeRegistrationEffectiveDate": "2007-06-28 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.733639,
  "FRS_Long": -96.250028,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19230,
      "AltID": "chlorination",
      "FacilityID": 14049,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 24308,
          "ProcessID": 19230,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 19722,
          "ProcessID": 19230,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 7748,
              "Process_NAICS_ID": 19722,
              "SafetyReviewDate": "1999-06-18 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-18 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-18 00:00:00",
              "TrainingReviewDate": "1999-06-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-18 00:00:00",
              "EquipmentInspectionDate": "1999-06-18 00:00:00",
              "EquipmentTested": "chlorinator",
              "ComplianceAuditDate": "1999-06-18 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 8097,
                  "PreventionProgram2ID": 7748,
                  "ProcessChemicalID": 24308
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 14049,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "City of Terrell Police Dispatcher",
    "CoordinatingAgencyPhone": "9725516622",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 14049,
      "SummaryText": "argest vessel. The alternative-case scenario is defined as a release that is more likely to occur than the worst case scenario. The alternative-case scenario should also reach an offsite endpoint, unless no such scenario exists.\n\nChlorine\n\nAt the City of Terrell WTP, the worst-case scenario for chlorine would result in a release of 2,000 pounds of chlorine gas. The impact radius would be 2.2 miles and affect 1,800 persons. Public receptors would include residences, schools, hospitals, public recreation areas, and major commercial or industrial areas. There were no environmental receptors within the impact radius.\n\nThe alternative-case scenario for chlorine would result in a release of 2,000 pounds of chlorine gas. The impact radius would be 0.6 miles and affect 70 persons. There were no other public or environmental receptors within the impact radius.\n\nAnhydrous Ammonia\n\nThe worst-case scenario for anhydrous ammonia would result in a release of 4,760 pounds of anhydrous ammonia. The impact radius would be 1.3 miles, affecting 330 persons. Public receptors would include residences and major commercial or industrial areas. There were no other public or environmental receptors within the impact radius.\n\nThe alternative-case scenario for anhydrous ammonia would result in a release of 300 pounds of anhydrous ammonia. The impact radius would be 0.5 miles, affecting 50 persons. There were no other public or environmental receptors within the impact radius.\n\n4.0 PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\nThe City of Terrell WTP complies with the EPA's Accidental Release Prevention Rule and with all applicable State codes and regulations. Our facility has taken all the necessary steps to comply with the accidental release prevention requirements under 40 CFR Part 68. The following sections briefly describe the elements of the release prevention program that is in place at our facility.\n\nSafety Information\n\nThe City of Terrell WTP maintains a detailed record o"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 14049,
      "SummaryText": "1.0 REGULATED SUBSTANCES\n\nThe City of Terrell Water Treatment Plant (WTP) uses two regulated chemicals, chlorine and anhydrous ammonia, in the treatment and processing of municipal water. \n\nChlorine is used in the disinfection of municipal water. Chlorine is stored prior to and during use in 1-ton containers on an unenclosed, covered, concrete pad. The chlorine is stored as a pressurized liquefied gas, and is released into wastewater using a vacuum-regulated system. The maximum intended inventory of chlorine at the facility is 12,000 pounds, which exceeds the RMP threshold quantity of 2,500 pounds.\n\nAnhydrous ammonia is used in the removal of organic compounds from municipal water. Anhydrous ammonia is stored prior to and during use in a 1,000-gallon (water capacity) tank. The anhydrous ammonia is stored as a liquefied gas and released into wastewater using a vacuum-regulated system. The maximum intended inventory of anhydrous ammonia at the facility is 4,760 pounds (based on an administrative limit of 82% by volume) which does not exceed the RMP threshold quantity of 10,000 pounds.\n\n2.0 POLICIES\n\nToxic chemicals are used at the facility.  Precautions must be taken in order to prevent unnecessary exposure to facility personnel and to reduce the threat of accidental release which might result in exposure to the surrounding community and to the environment. It is our policy to adhere to all applicable Federal, State, and industry rules, regulations, and guidelines. Chemical safety at the City of Terrell WTP is dependent upon strict operating procedures, safe handling methods, and thorough training of employees. Safety devices are also inherent in the design of the facility and in the equipment used in the chemical processes involving toxic chemicals.\n\n3.0 WORST CASE/ALTERNATIVE CASE SCENARIO ANALYSES INCLUDING ADMINISTRATIVE CONTROLS AND MITIGATION MEASURES TO LIMIT THE DISTANCES FOR EACH REPORTED SCENARIO\n\nEPA defines the worst-case scenario as total failure of the l"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14049,
      "SummaryText": "f safety information that describes the chemical hazards, operating parameters, and equipment designs associated with the wastewater disinfection process.\n\nHazard Review\n\nOur facility conducts detailed studies to ensure that the hazards associated with our chlorine and anhydrous ammonia processes are identified and controlled efficiently. The studies are undertaken by a team of qualified personnel and are revalidated at least once every five years. Any findings related to the hazard review are addressed in a timely manner.\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our chlorine and anhydrous ammonia processes, the City of Terrell WTP maintains written operation procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown, and startup after a turnaround. The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\n\nThe City of Terrell WTP has a comprehensive training program to ensure employees who are operating the chlorine and anhydrous ammonia processes are competent in the operations procedures associated with the processes. \n\nMaintenance\n\nThe City of Terrell WTP conducts regular maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks includes; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nCompliance Audit\n\nThe City of Terrell WTP conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out at least every three years"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14049,
      "SummaryText": "and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\n\nThe City of Terrell WTP promptly investigates any incident that results in, or could reasonably result in a catastrophic release of toxic chemicals. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring. All investigation reports are retained for a minimum of five years.\n\n5.0 FIVE YEAR ACCIDENT HISTORY\n\nIn the past five years, there have been no accidental releases of toxic chemicals that resulted in deaths, injuries, or significant property damage onsite, or known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\n\n6.0 EMERGENCY RESPONSE PROGRAM \n\nThe City of Terrell WTP employees will not respond to a chemical emergency at the plant. As required by 40 CFR Part 68.90, the City of Terrell is included in the community emergency response plan and appropriate mechanisms are in place to notify emergency responders when there is a need for response.\n\n7.0 PLANNED CHANGES TO IMPROVE SAFETY\n\nThe City of Terrell WTP will develop and implement required chemical specific operating procedures, training procedures, and maintenance procedures to attain compliance with RMP regulation requirements as well as to ensure the safe operation and mechanical integrity of the RMP regulated processes."
    }
  ]
}