{
  "FacilityID": 14072,
  "FacilityName": "Precision Specialty Metals",
  "FacilityStr1": "3301 East Medford Street",
  "FacilityStr2": null,
  "FacilityCity": "Los Angeles",
  "FacilityState": "CA",
  "FacilityZipCode": "90063",
  "Facility4DigitZipExt": "2327",
  "FacilityCountyFIPS": "06037",
  "LEPC": "Los Angeles County Fire Dept",
  "FacilityLatDecDegs": "34.061944",
  "FacilityLongDecDegs": "-118.191667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "ST",
  "FacilityURL": "www.psm-inc.com",
  "FacilityEmailAddress": "jimt@psm-inc.com",
  "FacilityDUNS": 804728855,
  "ParentCompanyName": "Precision Specialty Metals, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Precision Specialty Metals, Inc.",
  "OperatorStr1": "3301 East Medford Street",
  "OperatorStr2": null,
  "OperatorCity": "Los Angeles",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90063",
  "OperatorZipCodeExt": "2327",
  "FTE": 30,
  "OtherEPAFacilityID": "90063PRCSN3301M",
  "EPAFacilityID": "100000149136",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-12-23 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-23 00:00:00",
  "ErrorReportDate": "1999-07-23 00:00:00",
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2016-03-15 00:00:00",
  "DeRegistrationEffectiveDate": "2016-03-08 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.06081,
  "FRS_Long": -118.1909,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19272,
      "AltID": "HF Storage in Building 4",
      "FacilityID": 14072,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 24352,
          "ProcessID": 19272,
          "ChemicalID": 55,
          "Quantity": 12703.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 19764,
          "ProcessID": 19272,
          "NAICSCode": "331221",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 7763,
              "Process_NAICS_ID": 19764,
              "SafetyReviewDate": "1999-06-18 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 1,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-18 00:00:00",
              "ChangeCompletionDate": "1999-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 1,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-18 00:00:00",
              "TrainingReviewDate": "1999-01-08 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-01-08 00:00:00",
              "EquipmentInspectionDate": "1999-01-08 00:00:00",
              "EquipmentTested": "Programmable Logic Controller",
              "ComplianceAuditDate": "1999-06-01 00:00:00",
              "AuditCompletionDate": "1999-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-06-01 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 8113,
                  "PreventionProgram2ID": 7763,
                  "ProcessChemicalID": 24352
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 14072,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-06-18 00:00:00",
    "ERTrainingDate": "1999-06-18 00:00:00",
    "CoordinatingAgencyName": "Los Angeles County Fire Department",
    "CoordinatingAgencyPhone": "3238904035",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "Clean Air Act"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14072,
      "SummaryText": "1.1  Introduction\n\n1.  In response to the County of Los Angeles Fire Department, Health Hazardous Materials Division, this Risk Management Plan (RMP) has been developed for the Precision Specialty Metals, Inc. (Precision) facility located in Los Angeles, California as shown in Figure 1.  This document has been prepared to satsify the following regulations:\n- California Office of Emergency Services, California Code of Regulations (CCR), Title 19, Division 2, Chapter 4.5, California Accidental Release Prevention (CalARP) Program.\n- Code of Federal Regulations (CFR), Title 40, Part 68, Chemical Accident Prevention Provisions.\n\n2.  The purpose of this document is to facilitate the protection of public health, the environment, and facility employees by providing to the public and regulatory agencies information on regulated substances, a 5-year history of no accidents, potential offsite consequences of hypothetical worst-case and alternative release scenarios, and coordination with local emergency response agencies.\n\n3.  The regulated substance of concern and focus of this document is hydrofluoric acid (HF, 70 percent by weight).  The facility uses HF to clean and treat the surface of metals that may also be subject to the following onsite processes:\n- Milling\n- Annealing\n- Slitting\n- Polishing\n- Cutting\n- Stamping\n- Grinding\n- Tempering\n\n4.  The United States Environmental Protection Agency (EPA) Risk Management Data Elements are contained in Chapter 2.0 of this RMP.  The format of Chapter 2.0 differs from the remainder of this RMP because the hard copy version of that chapter is generated by a software program (RMP Submit) issued by the EPA.\n\n5.  Information required in the RMP by the EPA Risk Managment Program and the CalARP Program is summarized in Sections 1.2 through 1.7.\n\n1.2  ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n1.  Precision has an existing Emergency Response Plan.  The plan provides emergency response organization, notification procedu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14072,
      "SummaryText": "res, evacuation assembly locations, health hazards, and mitigation procedures.  The objective of the Emergency Response Plan is to avoid, or at least minimize, injuries to onsite and offsite persons, environmental damage, and property damage.\n\n2.  The Emergency Response Plan is reviewed and updated at least once per year.\n\n1.3  STATIONARY SOURCES AND REGULATED SUBSTANCE\n\n1.  Precision uses the following three acids that could potentially be classified as Regulated Substances under CalARP or federal regulations:  hydrofluoric, nitric, and sulfuric.  The six largest storage and process situations that were evaluated to determine if an RMP was needed are listed in Table 1 along with evaluation parameters.\n\n2.  Only the storage of 70 percent by weight hydrofluoric acid in quantities up to twenty-two 55-gallon drums exceeds a threshold quantity (TQ).  The federal TQ for HF in concentrations equal to or greater than 50 percent is 1,000 pounds (lbs).  The amount of stored HF can reach 12, 700 lbs.\n\n3.  All other process and storage quantities of acid fall below threshold requirements of concentration, partial pressure or physical/chemical state of the acid (e.g. anhydrous gas).\n\n1.4  HAZARD ASSESSMENT SUMMARY\n1.4.1  WORST-CASE RELEASE SUMMARY\n\n1.  Scenario Description:  Instantaneous release of the maximum quantity of HF that can be stored in one (1) drum (55 gallons).   The liquid is spread over an area of 40 square feet (ft2) with a depth of 2 inches.  The area and depth are determined by a curbed containment, which had the dimensions of 8 feet by 5 feet.  The drums of HF sit four to a pallet.\n\n2.  The most conservative meteorological conditions were used: 1.5 m/s wind speed, F stability, maximum temperature of 104 degrees Fahrenheit (F) and average relative humidity of 63 percent (2).  See Appendix D.\n\n3.  Hazard was assessed through use of a public domain air dispersion model, HEGADAS.  This model is specifically developed for HF so that the polymerization of HF would "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14072,
      "SummaryText": "be simulated along with the process of dispersion.  In polymerization, some of the HF molecules aggregate to form complexes as follows:\nnHF = HnFn  where 2 < n < 6\n\n4.  The distance to the toxic endpoint (3) is 470 feet.\n- The distance from the HF storage area (see Figure 2) to the nearest point on the property boundary (north side) is approximately 60 feet, beyond which are public receptors.(4)\n- This endpoint reaches beyond the property line on the north and west sides, extending into neighboring industrial property approximately and beyond one (1) residence.\n- Hence, \"The distance to a toxic or flammable endpoint for a worst-case release assessement conducted under Article 4 of Section 2750.3 is ...\" greater \"...than the distance to any public receptor, as defined in Section 2735.3 (mm) and Section 2750.5.\" (5)\n- The distance to the toxic endpoint, despite the accident-free 5-year history, qualifies Precision for CalARP Program 2.\n\n1.4.2 ALTERNATIVE RELEASE RESULT SUMMARY\n\n1.  A forklift picks up a pallet holding at least one full HF drum, which has one of its plug only slightly screwed into its opening.  The forklift lurches as it turns away from the HF storage area and drops a drum in front of the containment.  The loosely fit plug falls out of its opening which is at the bottom when the drum falls onto its side.  The area around the drum has no containment, allowing the HF to spread over the floor to a depth of 1 centimeter (6) with the portion of the 55 gallons that can escape in 10 minutes.  The volume that can leak out is approximately 52. 7 gallons.  It takes about 74 seconds for this leak to be completed.\n\n2.  Federal and CalARP regulations for the alternative release require the meteorological conditions to be typical.  Typical ambient conditions include the following(2):\n- Stability:  D (neutral)\n- Temperature:  68 F\n- Wind speed:  6.2 mph (2.8 m/s)\n- Relative humidity:  63 percent\n\n3.  The same model, HEGADAS, is used to simulate the polymerization of "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14072,
      "SummaryText": "HF and its air dispersion in the alternative release scenario as was used in the worst-case release.\n\n4.  The distance to the toxic endpoint is 269 feet.  As with the \"worst case,\" this distance exceeds the 60 feet to the property line on the north and west sides, but does not reach the residence within the worst-case endpoint distance.\n\n1.5  ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n1.  The basic approach to accidental release prevention is attention and a well-organized and diligently followed preventive maintenance program.  Employees are taught to pay attention to all processes, including storage, that utilize HF or other hazardous chemicals.  Forklift drivers are taught to be especially careful in their use of these machines to handle drums of acid and other hazardous loads.\n\n2.  Acid baths in the pickling system are visually monitored daily to assure that acid level is maintained at least 4 inches below the tank top to provide ample freeboard space.  This freeboard will prevent acid from spilling during an earthquake.\n\n3.  The sulfurice acid system for wastewater treatment has acid level probes in both the storage tank and the day tank.  An alarm (horn and light) will activate if the acid reaches a preset high level or low level in the storage tank.  The acid transfer pump is turned on automatically by the level transmitter to fit the day tank when the level in the day tank is low.  It is automatically turned off when the level reaches the high point.\n\n4.  Table 2 lists 14 specific preventive maintenance checks and the schedule for these checks, for more complete inspections, and for replacement of selected pieces of equipment.\n\n1.5.1  FIVE-YEAR ACCIDENT HISTORY\n\n1.  The accident history researched back 5 years shows that the facility has not had an accidental release or \"near miss\" of HF, the regulated substance subject to this RMP.\n\n1.6  EMERGENCY RESPONSE PROGRAM\n1.6.1  GENERAL\n\n1.  This section covers the procedures to b"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 14072,
      "SummaryText": "e followed by Precision personnel in the event of an emergency.  The operator(s) on duty assess the situation, decide on the plan to follow, and then carry out the plan in an orderly, controlled manner.  The operator is the only person who can assess the situation as it occurs. Therefore, should the operator feel that a change in procedure is justified due to the events as they happen, he will make the changes required.  The operator will discuss these changes with the Environmental Manager later, so that procedures are revised, if appropriate.\n\n1.6.2  DEFINITIONS\n\n1.  Emergency:  An occurrence of such magnitude that normal operations cannot continue.\n\n1.6.3  HANDLING AND CLEANUP OF LEAKS OF SPILLS\n\n1.  In addition to the Material Safety Data Sheet (MSDS), the spill cleanup procedure is included in the Hazardous Material Spill Response Procedures Section of the Health and Safety Manual.\n\n1.6.4  NOTIFICATION\n\n1.  In the event of a significant spill outside of the design containment area, the operator, or his designated representative, shall make notifications to agencies as required by regulations.\n\n1.6.5  EARTHQUAKE\n\n1.  In the event of an earthquake, there is nothing the operator can do while the quake is happening, save protect himself from injury.  However, once the quake has subsided there are certain procedures that will be followed.  These consist of checking for acid leaks or mechanical damages.  \n\n1.7  PLANNED CHANGES TO IMPROVE SAFETY\n\n1.  As a result of evaluations conducted by Precision and a study of the outcome of the HAZOP, several changes to improve safety are being considered.  Recognizing that safety improvements are most likely to be implemented by the plant operators, Precision is considering several steps to enhance overall plant safety.  \n\n2.  Included among these steps are operator-oriented actions to:\n- Conduct periodic inspections of key components when working in the area.  For example, operators would be asked to visually assess the piping "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 14072,
      "SummaryText": "at and around the sulfuric acid day tank for signs of leaks, and the floor of the diked area containing the hydrofluoric acid 55-gallon drums in Building 4 for an evidence of liquid.\n- Observe the available freeboard in the pickling tanks when adding the required materials to the tanks.  \n- Observe any discrepancies in operating procedures, including those by vendors delivering chemicals, and report these immediately to the Environmental Manager and Shift Foreman; assist such vendors in rectifying these discrepancies.\n\n3.  In addition, Precision will implement the recommend actions from the HAZOP; these include specific items related to equipment components and procedures.\n------------\n(1) According to Section 2750.3 of the Final CalARP Regulations of November 16, 1998, \"The worst-case release quantity shall be...For substances in a vessel, the greatest amount held in a single vessel...\"  Note:  Footnotes will all refer to the November 16, 1998 CalARP Regulations.\n(2) Continental Weather and Earth Sciences, Inc., Memorandum, June 20, 1999.\n(3) The HF toxic endpoint of 0.016 mg/L is equivalent to the Emergency Response Planning Guideline Level 2 (ERPG-2) concentration of 20 parts per million by volume (ppmv) averaged over 60 minutes.\n(4) A public receptor is defined in Section 2735.3 (Definitions) of the November 16, 1998 Final CalARP Regulations as follows: \"...offsite residences, institutions (e.g. schools, hospitals), industrial, commercial, and office buildings, parks, or recreational areas inhabited or occupied by the public at any time without restriction by the stationary source where members of the public could be exposed to toxic concentrations, radiant heat, or overpressure, as a result of an accidental release.\"\n(5) According to Section 2735.4 (Applicability) of November 16, 1998 Final CalARP Regulations.\n(6) Depth of uncontained spill is 1 cm, based on reasoning in Section 2750.3 of November 16, 1998 Final CalARP Regulations."
    }
  ]
}