{
  "FacilityID": 14150,
  "FacilityName": "CLARENCE CANNON WHOLESALE WATER COMMISSION",
  "FacilityStr1": "34146 RT. U",
  "FacilityStr2": null,
  "FacilityCity": "STOUTSVILLE",
  "FacilityState": "MO",
  "FacilityZipCode": "65283",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29137",
  "LEPC": "Monroe County LEPC",
  "FacilityLatDecDegs": "39.497778",
  "FacilityLongDecDegs": "-91.850833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "CLARENCE CANNON WHOLESALE WATER COM",
  "OperatorStr1": "34146 RT. U",
  "OperatorStr2": null,
  "OperatorCity": "STOUTSVILLE",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "65283",
  "OperatorZipCodeExt": null,
  "RMPContact": "ELIZABETH GROVE",
  "RMPTitle": "GENERAL MANAGER",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000149564",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-11-23 00:00:00",
  "DeRegistrationEffectiveDate": "2020-11-06 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.5381,
  "FRS_Long": -91.8426,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19383,
      "AltID": "CHLORINE",
      "FacilityID": 14150,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19879,
          "ProcessID": 19383,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 24518,
          "ProcessID": 19383,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 524518,
          "ProcessID": 19383,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14150,
      "SummaryText": "The Clarence Cannon Wholesale Water Commission  (CCWWC) is committed to safety in its operations.  This includes chemical safety for its employees and the surrounding public.  As part of this process, the CCWWC has written and implemented a Process Safety Management program that includes the indentification, evaluation and prevention of chemical releases.  An element of the safety program at the CCWWC is an Emergency Response Plan and effective training for its employees.\n\nThe Clarence Cannon Wholesale Water Commission is a joint municipal utlity commission formed under Chapter 393.700 of the Revised Statutes of Missouri.  The CCWWC is a regional water treatment facility producing drinking water for 16 member communities and rural water districts in northeast Missouri.   \n\n The CCWWC uses chlorine gas in its process.  Chlorine gas is stored in one ton cylinders, with a maximum of five cylinders on site at any given time.  This is the only regulated substance on site at the water treatment plant.   \n\n The water treatment plant is located in Monroe County, Missouri approximately three miles west of Florida, Missouri on State Route U.  It is a very rural area with few households and bordered on the east , north and south by state and federally owned land.\n\nA worst-case release scenario for chlorine at the CCWWC water treatment plant was done using the RMP Comp model.  This scenario assumed a 2000 pound release (one vessel) at 200 lbs/min for 10 minutes.  The distance to the endpoint was 2.5 miles and would affect an estimated residential population of 65 persons. The Mark Twain Lake is within the designated area as well as the Stoutsville boat ramp.  These areas would be recreational areas affected by such a release.   Since the surrounding land areas are state and federally owned grounds, these areas would be the environmental receptors affected.  \n\nThe CCWWC uses an enclosure to limit exposure of chlorine gas to the outside environment.  The enclosure consists of a r"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14150,
      "SummaryText": "oom in the treatment plant facility with access only from the outside.  An alarm system will alert the operator of a chlorine leak prior to the operator entering the room.  The alarm consists of a red light on the wall that lights when a leak is detected as well as an audible alarm that sounds in the operator control room.  It is also connected to a dialer system that alarms an operator off site, if necessary.  The exhaust fan for the enclosed area is not connected to the alarm.  A chlorine leak would be contained in the enclosed area until the leak was stopped.  The fan would then be used to clear the area.  All vacuum feed systems have vacuum regulators mounted on the tanks.  Any loss of vacuum prevents feed. \n\nThe alternative scenario for a chlorine release at the CCWWC facility was done using the RMP Comp model.  The scenario indicated an endpoint of 0.5 miles.  This would affect an estimated residential populaiton of 9 people, Mark Twain Lake and the state and federally owned lands.  The CCWWC uses the same enclosure as described above as a passive mitigation measure with the same affects and results.\n\n\nThe CCWWC complies with the OSHA PSM rule.  The CCWWC also has standard practices to prevent accidents.  These include container inspection - every container is thoroughly inspected upon delivery before being accepted.  Any suspect containers are returned without being used.  Operators do volume readings on containers during every operator's round of the plant.  Any release would be noticed by loss of volume as well as leak indicator.\n\n Additional prevention practices include quarterly safety inspections, operator safety and training program, SOP's for chlorine handling, routine maintenance program and leak detector and alarm dialer.\n\nThe CCWWC has had no reportable accidental releases in the last five years.\n\nThe emergency reponse program in place at the CCWWC includes procedures for simulations to provide training for personnel in the event of a chlorine relea"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14150,
      "SummaryText": "se, detailed evacuation procedures, mutual aid agreements with local emergency response agencies, and  communications protocol in dealing with public notification.  Each member of key personnel has a role in the event of a release.  The emergency response program is reviewed on a regular basis to update information and revise procedures as necessary.\n\nImprovements to the program have included the addition of two key positions to the technical support team of United Water Services, the CCWWC contract operations firm.  The positions include the addition of a safety technician and a regulatory compliance officer."
    }
  ]
}