{
  "FacilityID": 14173,
  "FacilityName": "Claire Manufacturing, Inc",
  "FacilityStr1": "Claire Manufacturing",
  "FacilityStr2": "500 Vista Avenue",
  "FacilityCity": "Addison",
  "FacilityState": "IL",
  "FacilityZipCode": "60101",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17043",
  "LEPC": "Dupage County LEPC",
  "FacilityLatDecDegs": "41.918083",
  "FacilityLongDecDegs": "-88.0015",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "OT",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 363054647,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Goldner, Hawn, Johnson & Morrison",
  "OperatorStr1": "5250 Norwest Center",
  "OperatorStr2": "90 S. 7th Street",
  "OperatorCity": "Minneapolis",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55402",
  "OperatorZipCodeExt": "4123",
  "FTE": 125,
  "OtherEPAFacilityID": "ILD005155973",
  "EPAFacilityID": "100000149804",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "043005AIX",
  "SafetyInspectionDate": "1998-12-03 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2013-08-06 00:00:00",
  "DeRegistrationEffectiveDate": "2012-12-31 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.91774,
  "FRS_Long": -88.00206,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19415,
      "AltID": "underground pentane tank",
      "FacilityID": 14173,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 24552,
          "ProcessID": 19415,
          "ChemicalID": 125,
          "Quantity": 15000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 19912,
          "ProcessID": 19415,
          "NAICSCode": "339999",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 14173,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-02-01 00:00:00",
    "ERTrainingDate": "1999-05-20 00:00:00",
    "CoordinatingAgencyName": "Addison Fire Department",
    "CoordinatingAgencyPhone": "6305436711",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14173,
      "SummaryText": "THE EXECUTIVE SUMMARY\n\nThe accidental release prevention and emergency response policies\nClaire-Sprayway Inc. and its management have adopted, and fully support, a formal and continuing program of review, evaluation and modification of our operations, at all levels, so that the ability to maintain the health and safety of our employees is constantly verified and improved. A company Safety Committee (SC) has been developed and functions to ensure and promote the safe conduct of employees at CSI. The SC recommends to upper management policies and procedures for the safe conduct of employees at CSI and for compliance with applicable federal, state and local regulations governing to use of toxic or hazardous substances. It is the responsibility of the SC to:\n7 Review technical and safety-related aspects of our manufacturing facility and the use of hazardous and toxic substances;\n7 Develop and maintain our Safety & Conduct Rules and the Employee handbooks\n7 Limit or revoke the use of hazardous or toxic materials if such use presents a hazard to individuals or violates health and safety codes\n7 Train everyone who encounters chemical hazards in our workplace, including outside contractors, temporary help and new employees on the Hazardous Communication Standard\nCSI has developed a Hazard Communication Program which incorporates programs such as, but not limited to, area and personnel monitoring and sampling, hazardous waste management preparedness, contingency and emergency spill prevention control and countermeasure plans, emergency response and evacuation programs and the implementation of new safety work rules. It is our view that this program will provide the incentive and initiative to improve work practices, increase employee use of personal protective equipment/safety devices and to follow precautionary measures when handling hazardous chemicals.\n\nProcesses and products of facility and the regulated substances handled\nCSI is primarily a blending and aerosol filling"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14173,
      "SummaryText": "plant where precise amounts of specified chemicals are mixed and packaged in accordance with formulation specifications. The finished products produced are aerosol in nature ranging from a few ounces to over a pound per unit. Most units are packaged in shipping containers of 12 each per corrugated shipping carton. Cartons of finished products are stored on wooden skids placed on pallet racking. Finished goods of a flammable nature are stored in a segregated fire rated area, which is separate from the main warehouse area. Materials of a flammable nature which are used in drum quantities are stored in warehouse areas to meet or exceed EPA, State, and Federal regulation. Solvents which exceed rum quantities such as alcohols, petroleum distillates, and glycol ethers are stored in underground tanks. Liquefied Hydrocarbon Propellants such as propane are stored above ground in accordance with NFPA 58 and local fire district requirements. Nonflammable priority pollutants are stored above ground in a diked area. Materials stored in less than bulk quantities and not considered flammable (drums, pails, etc.) are segregated within the chemical storage area according to their hazard potential. Acids and other oxidizers are stored away from reducing agents, acids away from bases, etc. The company has in place a \"Zero Waste Program\" for our manufacturing process. This program uses any heels generated from the blending, filing, or wash-up processes and adds them to batches of the same product, instead of disposing as waste material. \n\nThe worst-case release scenarios and the alternative release scenarios\nAt CSI our only regulated over threshold chemical is pentane.  We store amounts of pentane up to 15,000 pounds in an underground concrete padded storage tank.  Underground storage eliminates several potential hazards and is an optimal storage situation for this large amount of a chemical.  Because of the underground confinement of this tank, our worst-case scenario leak or spill is"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14173,
      "SummaryText": "limited to mechanical failure during unloading of the chemical from a transfer hose to the tank. The product transfer is accomplished through gravity feeding and slow transfer of the product to the tank.  Due to the above mechanisms and two trained personnel monitoring the transfer at all times, our worst case scenario estimate could only be up to 10 gallons, or 52 pounds.  As RMP Comp software analysis indicates, this would leave a worst case release scenario spill reaching approximately 158 feet away, contacting no public or environmental receptors. If there were to be a leak or spill, the personnel monitoring the transfer would be able to shut off the valve within one minute's time and clean the spill accordingly.  Since we have optimal placement of such a large tank, we are confident that any potential hazards would be kept to a minimum, that being only a small containable spill.  \n\nGeneral accidental release prevention program and chemical-specific prevention steps\nAs of this date, CSI has had no significant spill or discharge at any time in the history of the company. There are two basic areas where a spill could potentially occur following an equipment failure. These two areas are (1) the above ground storage tank areas and (2) the chemical storage area located inside the plant. The first area of concern is the above ground tanks. Countermeasures against any spills have been taken so that if a spill were to happen, the land, air and people in the surrounding area would be safe. The area surrounding the above ground tanks in the southeast quadrant is diked, in case of structural damage of equipment or other deleterious imperfections in the pipage. Any spillage is capsulated by the dike and can be recovered. The area can be immediately cleaned through the use of pumps and/or absorbent material. Above ground tank overflow during filling does not present a potential spillage problem because all tanks are pressure vessels filled under pressure with a liquefied ga"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14173,
      "SummaryText": "s to a level not to exceed 87.5% of normal maximum fill or that amount which does not exceed a 10% safety margin of the hydrostatic fill limit of the tank. All above ground storage tanks are subjected to periodic integrity testing. In addition, qualified company personnel are required to make routine visual inspections including tank integrity, tank supports, tank foundations, and leaked or spilled materials. All above ground valves and pipelines are subject to periodic inspections by operating personnel. All bulk storage of flammable materials is in underground storage tanks in accordance with good engineering practices. All of the underground tanks are considered safe since they utilize a triple containment system. Should a leak occur in the primary containment vessel, a dual barrier prevents any chemical from finding its way into the environment. The entire underground tank system has a series of sumps whereby monthly samples are drawn and analyzed to ensure that no leakage is occurring. A team of qualified personnel has been trained to contend with spills in this area of the production facility. The Addison Fire Department has also been briefed as to the hazards contained herein and is notified as to the contents of all above ground and underground bulk storage tanks. \nThe second area where a spill could potentially occur would be the chemical storage area. The materials stored in this area are contained in quantities of fifty-five (55) gallons or less. Materials are separated by their chemical reactivity to minimize the possibility of spills causing any further deleterious situations. This area is sealed from the remainder to the plant through the use of downgraded flooring in addition to the appropriate use of a diked area. Any materials spilled in this area would be recovered and the area cleaned up through the use of a pump and/or absorbent material depending on the size and nature of the spill. The chemical storage area is equipped with sufficient ventilati"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 14173,
      "SummaryText": "on to allow safe working conditions during the cleanup of any spilled materials. In addition, all walls are fire proof. The inventory in the chemical storage area is rotated in order to preclude the possibility of the degradation of the containers. A team of qualified personnel has been trained to contend with any spills in this area. \n\n\nFive year accident history\nIn the past five years, CSI has not had any reportable accidents.\n\nEmergency response program \nCSI's Emergency Response Program consists of the following:\n7 Facility and Coordinator Identification\n7 Description of plant\n7 Emergency notification\n7 Emergency equipment and supplies\n7 Clean up materials\n7 Reportable releases\n7 On-site hazardous substances \n7 List of CERCLA Hazardous substances\n7 Reporting procedures\n7 Emergency Response procedure\n7 Evacuation plan\n7 Spill prevention and countermeasures\n7 Hazardous waste\n7 Inspection and records\n7 Security\n7 Coordination agreements\n7 Required reporting\n7 Personnel and training\n7 Bulk chemical inventory\n7 List of hazardous substances (over threshold)\n7 Tank farm\n7 Batching tanks\n7 Geographic local of CSI\n\n\n\nPlanned changes to improve safety\n\n7 Updated Training\n7 Safety committee is revamped, new leaders\n7 CPR training\n7 Extended lab safety awareness"
    }
  ]
}