{
  "FacilityID": 14176,
  "FacilityName": "City of Norman Water Treatment Plant",
  "FacilityStr1": "3000 E. Robinson",
  "FacilityStr2": null,
  "FacilityCity": "Norman",
  "FacilityState": "OK",
  "FacilityZipCode": "73071",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40027",
  "LEPC": "Cleveland County LEPC",
  "FacilityLatDecDegs": "35.232417",
  "FacilityLongDecDegs": "-97.395667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Norman",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Norman Utilities Authority",
  "OperatorStr1": "P.O. Box 370",
  "OperatorStr2": null,
  "OperatorCity": "Norman",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "73070",
  "OperatorZipCodeExt": "0370",
  "FTE": 15,
  "OtherEPAFacilityID": "1020801",
  "EPAFacilityID": "100000150016",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-24 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2020-01-21 00:00:00",
  "DeRegistrationEffectiveDate": "2020-01-13 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.23274,
  "FRS_Long": -97.39476,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19418,
      "AltID": "Chlorine Disinfection",
      "FacilityID": 14176,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 24556,
          "ProcessID": 19418,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 19916,
          "ProcessID": 19418,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 7813,
              "Process_NAICS_ID": 19916,
              "SafetyReviewDate": "1999-06-18 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-18 00:00:00",
              "ChangeCompletionDate": "2000-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-18 00:00:00",
              "TrainingReviewDate": "1999-06-21 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-18 00:00:00",
              "EquipmentInspectionDate": "1999-06-07 00:00:00",
              "EquipmentTested": "chlorine gas piping and feed equipment",
              "ComplianceAuditDate": "1999-06-21 00:00:00",
              "AuditCompletionDate": "1999-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 8166,
                  "PreventionProgram2ID": 7813,
                  "ProcessChemicalID": 24556
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 14176,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-18 00:00:00",
    "ERTrainingDate": "1999-06-21 00:00:00",
    "CoordinatingAgencyName": "Cleveland County LEPC",
    "CoordinatingAgencyPhone": "4053660249",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14176,
      "SummaryText": "A. BACKGROUND\nThe United States Congress passed the Clean Air Act Amendments in November 1990.  Section 112R of the Act requires facilities to implement measures to prevent accidental releases of contaminants into the atmosphere and to minimize the consequences of any release. These amendments were a part of a continuing effort to prevent accidental releases of toxic chemicals and minimize damage to human health and the environment.\nThe Act required the Environmental Protection Agency (EPA) to prepare a list of substances with their toxic threshold, and develop rules for a risk management program. It required a facility to identify hazards from potential releases, design and maintain a safe facility, and minimize the consequences of a release.\nThe Risk Management Rule requires all applicable facilities to prepare a Risk Management Program (RM Program) by June 21, 1999 and implement it on an on-going basis. \nB. GOALS AND OBJECTIVES\nThe City of Norman desires to protect the public health by providing a safe water supply in sufficient quantities to meet fire protection needs and satisfy supply demands of the users of our water distribution system. We must strive to maintain a balance between the risks associated with chlorine use and the risks associated with consuming potentially contaminated water.  We believe the benefits of providing a pathogen-free water supply far exceed the risks associated with chlorine usage at a properly operated Water Treatment Plant.\nThe City of Norman's Water Treatment Plant (WTP) utilizes numerous chemicals in order to supply a safe (free of bacteria) and reliable source of potable water to the citizens of Norman. Chlorine and ammonia are utilized in combination forming chloramines to disinfect our water and make it safe to drink. Only chlorine is utilized in quantities greater than the EPA defined threshold quantity of 2,500 pounds. \nAt the Norman WTP, chlorine is delivered and stored in cylinders with each cylinder containing a net weig"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14176,
      "SummaryText": "ht of one-ton or 2,000 pounds.  In accordance with our standard operating procedures, no more than six (6) one-ton cylinders are on site at any time. Thus the maximum quantity of chlorine utilized or stored at the site at any one time is 12,000 pounds.  This exceeds the threshold quantity for chlorine; therefore, the requirements of the Risk Management Rule are applicable to the Norman WTP.\nIt is important to understand that chlorine may present a hazard to the public health if utilized in an uncontrolled manner. Chlorine and numerous other chemicals exhibit acute toxicity at certain levels of exposure. The probability of experiencing toxic levels of exposure at a properly operated WTP is small. However, the consequence of exposure is extreme and can result in severe injury. \nSince chlorine is used in our disinfection process, the goal of the RM Program is to provide a management system that reduces the risk of injury to our employees and to the public as a result of an accidental release. We can manage the risks by taking a proactive approach to chlorine use. \nThe City of Norman WTP RM Program includes a Prevention Program and an Emergency Response Program.  The Prevention Program:\n' provides detailed chlorine safety information, \n' assesses the hazards of chlorine use at the facility,\n'  defines operation, maintenance and training requirements to be used to reduce risk,\n' requires completion of compliance audits; and\n' sets forth a procedure for investigating release incidents and implementing corrective measures to prevent re-occurrence.\nThe Emergency Response Program:\n' documents the impact of a catastrophic release (worst case scenario)  as well as a more realistic release that might occur even at a well operated facility (alternative release scenario);\n' includes a written emergency response plan for responding to the various release scenarios that may occur at the WTP. The plan includes public notification procedures, first aid and emergency medical treatment"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14176,
      "SummaryText": "procedures for chlorine exposure, and the responsibilities of the emergency response entities;\n' includes procedures for using, inspecting, testing and maintaining emergency response equipment;\n' requires emergency response training of all employees at the facility; \n' sets forth procedures for review and update of the emergency response plan to keep it current.\nC. RELEASE SCENARIOS\nSeveral release scenarios for chlorine were considered during the hazard assessment phase of the RM Program. The accident history of the WTP was evaluated and the impacts of the worst case release scenario and a more realistic alternative scenario were assessed.  Release scenarios are evaluated based on the following assumptions: \n' Toxic Endpoint: The toxic endpoint for chlorine of 3 parts per million (ppm) is utilized.  This value corresponds with the Emergency Response Planning Guideline Level of Concern 2 (ERPG-2) which is defined as the maximum airborne concentration below which nearly all individuals could be exposed for one hour without experiencing health effects that could impair their ability to take protective action.  As an alternate, the toxic endpoint for chlorine at ERPG-3 is 20 ppm. This level of concern is defined as the maximum airborne concentration below which nearly all individuals could be exposed for one hour without experiencing or developing life threatening health effects.  Thus, use of 3 ppm for the toxic endpoint for chlorine release scenarios is conservative.\n' Weather Conditions: Ambient relative humidity of 50%, ambient temperature and the temperature of the chemical is 77o F.\n' Location: Release occurs at ground level (10 meters above the ground surface), is located in an urban setting; and the release occurs outdoors.\n' Mitigation: Active and passive mitigating devices were not considered. An example of a passive mitigating device might be the containment of a release provided by the enclosed chlorine room at the WTP.  An example of an active mitigating"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14176,
      "SummaryText": "device might be the closing of a valve to stop the release or the use of air scrubbers to neutralize the chlorine gas prior to release.\n' Wind Speed: The wind speed is assumed to be 3.36 miles per hour for the worst case release scenario while wind speed is assumed to be 6.72 miles per hour for the alternative release scenario.  During 1998, the average annual wind speed was 9.7 mph as measured in NW Norman by the Oklahoma Climatological Survey.\n' Atmospheric Stability: The atmospheric stability is assumed to be Class F (very light wind, late night, partial cloud cover) for the worst case release scenario while the atmospheric stability is assumed to be Class D (moderate wind speed, and completely overcast skies) for the alternative release scenario.\n 5-Year Accident History Review\nThe City of Norman WTP has not had a reportable release of a toxic substance in 33 years since the facility opened in July 1966. The reportable release quantity for chlorine is 10 pounds.  The only releases noted during the most recent 5-year time period are those associated with replacement of the empty chlorine cylinders.  During cylinder change out, a small quantity of chlorine gas remaining in the flexible tubing between the cylinder and the piping manifold can be released.  In this instance, the chlorine gas is retained inside the chlorine room where it can be slowly dispersed.\nWorst Case Scenario\nThe regulations require an assessment of the impact of a worst case release scenario.  The evaluation must consider the maximum quantity of chorine in the piping system or in the largest single storage vessel.  The worst case release scenario for the Norman WTP assumes the release of the entire contents of a 1-ton chlorine cylinder in a ten-minute period. Thus, the release rate is 200 pounds per minute for a ten-minute duration. This release might occur if the cylinder is damaged during unloading at the WTP.  However, the WTP is equipped with hoist and trolley system for unloading cylinders"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 14176,
      "SummaryText": "to reduce the likelihood of this release scenario.\nUsing EPA guidelines presented in Risk Management Program Guidance for Wastewater Treatment Plants, EPA, October 1998, the toxic end point for the above chlorine release is 1.3 miles.  Thus, a circle with a radius of 1.3 miles is drawn around the WTP to account for any possible plume direction. Under this scenario, approximately 3,000 persons in residential structures have a potential to experience a concentration at or above 3 ppm. At a concentration of 3ppm or less, nearly all individuals could be exposed for one hour without experiencing health effects that could impair their ability to take protective action.\nAlternative Worst Case Scenario\nThe regulations also require the presentation of at least one alternative release scenario.  Staff considered historic on-site release data and developed several smaller release scenarios that have a more realistic chance of occurrence.  Plant personnel have effectively handled these release scenarios in the past. However, none of these scenarios caused an off-site release of chlorine. Thus, the following less likely set of alternative scenarios were developed. \n' Worst Case: It is assumed that the contents of the 1-ton chlorine cylinder is released as a liquid through the 5/16-inch diameter opening in the cylinder valve.  This release could occur if a heavy object was dropped shearing the valve. Using the EPA guidelines referenced above, the release rate is estimated at 241 pounds of liquid chlorine per minute.  The toxic end point of this release is 0.3 miles.  Note that even with a slight increase in the release rate (241 versus 200 pounds per minute), the toxic endpoint is reduced from 1.3 miles to 0.3 miles due to increased wind velocity (6.72 versus 3.36 mph) and less stable atmospheric conditions (Class D versus Class F).\n' More Realistic Case: It is assumed that the contents of the 1-ton chlorine cylinder is released as a gas through the 5/16-inch diameter flexible t"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 14176,
      "SummaryText": "ubing connecting the cylinder to the manifold piping.  This release could occur if a heavy object was dropped shearing the tubing, or if the tubing had corroded after an extended period with improper maintenance. Using the EPA guidelines referenced above, the release rate is estimated at 15 pounds per minute. The toxic end point of this release is 0.1 miles.\nTo be conservative, the worst case alternative scenario of a liquid chlorine release is assumed. Thus, a circle with a radius of 0.3 miles is drawn around the WTP to account for any possible plume direction. Under this scenario, 2 persons living in a residential structure NW of the WTP have a potential to experience a concentration at or above 3 ppm. At a concentration of 3ppm or less, nearly all individuals could be exposed for one hour without experiencing health effects that could impair their ability to take protective action.\nD. SUMMARY\nThe City of Norman believes the benefits of providing a pathogen-free water supply far exceed the risks associated with chlorine usage at a properly operated water treatment plant (WTP). The City of Norman has developed and implemented a Risk Management Program to provide a management system that reduces the risk of injury to our employees and to the public as a result of an accidental release. \nThe worst-case chlorine release scenario could impact approximately 3,000 persons within a 1.3-mile radius of the WTP; this release is believed to be very unlikely.\nA more likely alternative release scenario could impact 2 persons within a 0.3-mile radius of the WTP.  \nIn the event of an off-site release, our emergency action plan will be implemented to mitigate the effects of the release. Water treatment plant staff together with emergency response teams from the Norman Fire Department and the Cleveland County Local Emergency Planning Committee (LEPC) will implement a public notification plan, if required."
    }
  ]
}