{
  "FacilityID": 14193,
  "FacilityName": "Jefferson Smurfit Corporation (US)",
  "FacilityStr1": "North 8th Street",
  "FacilityStr2": "P.O. Box 2000",
  "FacilityCity": "Fernandina Beach",
  "FacilityState": "FL",
  "FacilityZipCode": "32034",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12089",
  "LEPC": "NE Florida Regional Planning",
  "FacilityLatDecDegs": "30.681389",
  "FacilityLongDecDegs": "-81.457222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 39574116,
  "ParentCompanyName": "Jefferson Smurfit Corporation (U.S.)",
  "Company2Name": null,
  "CompanyDUNS": 617225727,
  "Company2DUNS": 0,
  "OperatorName": "Jefferson Smurfit Corporation (US)",
  "OperatorStr1": "8182 Maryland Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Clayton",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "63105",
  "OperatorZipCodeExt": null,
  "RMPContact": "Warren S. Flenniken",
  "RMPTitle": "V.P. & General Manager",
  "FTE": 615,
  "OtherEPAFacilityID": "32034CNTNRNORTH",
  "EPAFacilityID": "100000149797",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0890003-001-AV",
  "SafetyInspectionDate": "1998-10-29 00:00:00",
  "SafetyInspectionBy": "FDOT",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-04-21 00:00:00",
  "DeRegistrationEffectiveDate": "2011-02-18 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 30.68139,
  "FRS_Long": -81.45722,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19452,
      "AltID": "Chlorine Rail Car",
      "FacilityID": 14193,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19950,
          "ProcessID": 19452,
          "NAICSCode": "32213",
          "_desc": {
            "NAICS_CODE": "32213",
            "NAICS_DESCRIPTION": "Paperboard Mills"
          }
        },
        {
          "Process_NAICS_ID": 19951,
          "ProcessID": 19452,
          "NAICSCode": "32211",
          "_desc": {
            "NAICS_CODE": "32211",
            "NAICS_DESCRIPTION": "Pulp Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 24603,
          "ProcessID": 19452,
          "ChemicalID": 62,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 524603,
          "ProcessID": 19452,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14193,
      "SummaryText": "Executive Summary\nJefferson Smurfit Corporation (U.S.)\nFernandina Beach Mill\n\n\nPolicy\nAt Jefferson Smurfit Corporation (U.S.), Fernandina Beach, Florida, we are committed to operating and maintaining all of our processes involving hazardous chemicals in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n* A description of our facility and the use of chlorine which is regulated by EPA's Risk Management Program regulation\n* A summary of results from our assessment of the potential offsite consequences from accidental chemical releases\n* An overview of our accidental release prevention programs\n* A five-year accident history for accidental releases of chlorine\n* An overview of our emergency response program\n* An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\n* The certifications required by EPA's RMP rule\n* The data elements information about our risk management program\n\nDescription of Fernandina Beach Mill Operations\nJefferson Smurfit Corporation's Fernandina Beach facility produces unbleached kraft linerboard. Process water is treated with chlorine to prevent bacteriological buildup in the production process.\n\nRMP requirements\nChlorine is the only substance onsite at or above the threshold quantity for an RMP regulated substance. The water treatment process is an OSHA Process Safety Manager covered process with a quantity of chlorine requiring a worst-case release scenario analysis.  A program level 3 RMP has been developed.\n\nDescription of RMP process\nLiquid chlorine is delivered to the mill in 90-ton rail cars. The "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14193,
      "SummaryText": "rail cars are used as the storage container for the chlorine chemical. The liquid chlorine chemical is converted to a gas and metered into the process as necessary.\n\nOur accidental release prevention programs and our contingency planning efforts help us effectively manage the hazards that are posed to our employees, the public, and the environment.\n\nKey Offsite Consequence Analysis Scenarios\nEPA's RMP rule requires that we provide information about the worst-case release scenario and alternative release scenario for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario:\n\nWorst-case Release Scenario                wcs.jpg\nScenario 1    \nRupture of a 90-ton chlorine railcar. A rupture in a 90-ton chlorine railcar leads to a release of 180,000 lbs. of chlorine gas into the atmosphere over a 10-min period.  The chlorine in the railcar is stored at the worst-case ambient temperature and the saturation pressure at that temperature. EPA's wastewater treatment plant guidance document estimates that the cloud disperses below the toxic endpoint about 13 miles from the railcar.\n\nAlternative Release Scenario                acs.jpg\nScenario 2    \nRupture of the unloading hose from the 90-ton chlorine railcar.  A hose rupture in the unloading hose from a 90-ton chlorine railcar leads to the release of 377 lbs. of chlorine to the atmosphere. The railcar is equipped with an excess flow valve designed to stop the flow from the railcar, and there is a check valve in the piping downstream of the chlorine evaporator that should prevent reverse flow of chlorine to the rupture. The amount of chlorine released to the atmosphere is the 355 lbs. in the evaporator plus the 22 lbs. in the piping, for a total of 377 lb. EPA's wastewater treatment plant guidance document estimates that the initial release rate to the atmosphere is 864 lbs./min and that the cloud disperses below"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14193,
      "SummaryText": " the toxic endpoint about 0.46 mile from the railcar unloading area.  \n\nAdministrative Controls\nThere are no administrative controls on chlorine inventory in use at our facility.\n\nPASSIVE CONTROLS\nThe CHLORINE facility employs a chemical monitoring system consisting of six chlorine monitors, interlocks, alarms, and safety items which are part of the system design incorporated into the Emergency Alarm/Shutdown System that closes the emergency shutdown valves in the Chlorine line from the railcar to the evaporator.\n\nFIVE-YEAR ACCIDENT HISTORY\nThere has not been any RMP releases of chlorine within the last five years, covering 1994 to date.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM \nAn OSHA PSM program covering chlorine has been implemented at our facility.  The PSM program meets the requirements of RMP and is utilized as the prevention section for the Fernandina Beach Mill facility. \n\nWe take a systematic, proactive approach to preventing accidental releases of hazardous chemicals.  Our management systems address each of the key features of successful prevention programs including:\n\n* Process safety information\n* Process hazard analysis\n* Operating procedures\n* Training\n* Mechanical integrity\n* Management of change\n* Pre-startup review\n* Compliance audits\n* Incident investigation\n* Employee participation\n* Hot work permit\n* Contractors\n\nThese individual elements of our prevention program work together to prevent accidental chlorine releases.  Our company and our employees are committed to the standard that these management systems are set for the way we do business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention. \n\nEMERGENCY RESPONSE PROGRAM\nWe maintain an integrated contingency plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning.  Our program provides the essential planning and training for effectively protecting work"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14193,
      "SummaryText": "ers, the public, and the environment during emergency situations. \n\nJefferson Smurfit Corporation (JSC) Fernandina Beach mill coordinates emergency response procedures with the local city and county agencies. Qualified JSC employees will respond to minor events, associated with the CHLORINE facility, which does not have potential for significant effects. In the event of a release requiring additional offsite response, the facility will be evacuated and the Fernandina Beach Fire Department contacted.\n\n\n\n\n"
    }
  ]
}