{
  "FacilityID": 14202,
  "FacilityName": "Randalls Distribution Center",
  "FacilityStr1": "10700 Telge Road",
  "FacilityStr2": null,
  "FacilityCity": "Houston",
  "FacilityState": "TX",
  "FacilityZipCode": "77095",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-",
  "FacilityLatDecDegs": "29.9275",
  "FacilityLongDecDegs": "-95.643056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A6",
  "LatLongDescription": "PU",
  "FacilityURL": "www.randalls.com",
  "FacilityEmailAddress": "customerservice@randalls.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Randalls Food Markets, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 57578551,
  "Company2DUNS": null,
  "OperatorName": "Randalls Food Markets, Inc.",
  "OperatorStr1": "3663 Briarpark",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77042",
  "OperatorZipCodeExt": null,
  "FTE": 325,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000149948",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2007-04-09 00:00:00",
  "DeRegistrationEffectiveDate": "2007-01-31 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 29.9254,
  "FRS_Long": -95.64587,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19461,
      "AltID": null,
      "FacilityID": 14202,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 24612,
          "ProcessID": 19461,
          "ChemicalID": 56,
          "Quantity": 10000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 19960,
          "ProcessID": 19461,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 10418,
              "Process_NAICS_ID": 19960,
              "SafetyReviewDate": "1999-06-04 00:00:00",
              "PHA_Date": "2001-06-30 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-04 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-11 00:00:00",
              "TrainingReviewDate": "1999-06-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-11 00:00:00",
              "EquipmentInspectionDate": "1999-06-04 00:00:00",
              "EquipmentTested": "Plant 2 system",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1995-04-15 00:00:00",
              "PreStartupReviewDate": "1999-06-02 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-15 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-14 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-06-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 14701,
                  "PreventionProgram3ID": 10418,
                  "ProcessChemicalID": 24612
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 14202,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-17 00:00:00",
    "ERTrainingDate": "1998-01-15 00:00:00",
    "CoordinatingAgencyName": "Harris County  O. E. M.",
    "CoordinatingAgencyPhone": "7138813082",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14202,
      "SummaryText": "Executive Summary\n\nRandalls Food Markets\n\nRandalls Food Markets is a Houston-based, privately owned supermarket chain, with stores in the Dallas, Houston and Austin markets. The distribution system consists of two facilities, the Randalls distribution center in northwest Houston and the Tom Thumb distribution center in Roanoke. The goal of all of our stores is to offer high quality products, courteous and friendly service in a pleasant, one-stop shopping environment.  Randalls has a history of being a leader in community affairs and a responsible corporate citizen.\n\nRandalls Distribution Center\n\nThe Randalls distribution center provides distribution service to the stores in Houston and Austin.  Both perishable and dry grocery products are received and stored at the distribution center, where stores submit orders on a daily basis. Product is delivered to each store in less than 24 hours from the time of order. Initially occupied by Randalls in 1983, the facility has been expanded several times.  The most recent expansion included a 90,000-square-foot freezer, which was completed in June 1999.  \n\nTo refrigerate the warehouse, the site has two anhydrous ammonia refrigeration systems each containing about 10,000 pounds of ammonia.  One system is designed to refrigerate the new freezer, and the other refrigerates the existing perishable warehouse space. \n\nAccidental Release Prevention and Emergency Response Policies\n\nRandalls has a long and distinguished record in operating an anhydrous ammonia refrigeration plant.  Since 1983, there has not been one major (in excess of 100 pounds) release of ammonia.  The staff who operate and maintain the plant are well trained and they follow recognized preventive maintenance procedures to ensure the system remains safe and effective. They also have the required Personal Protective Equipment (PPE) so that they can quickly react to any release of ammonia in the system.  The goal is always to prevent a release, but to be prepared to han"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14202,
      "SummaryText": "dle one just in case one should occur.\n\nMany parts of the company are involved in the development and maintenance of safety guidelines including the following departments; risk management, loss prevention, safety, public relations, and distribution center personnel. \n\nThe Ammonia Refrigeration System\n\nAmmonia exists in nature and is essential to many biological processes.  It is biodegradable and does not contribute to air pollution.  Many of us know the distinct odor of ammonia because it is an ingredient in many household cleaners. The strong odor is self-alarming, making it easy to detect leaks and respond rapidly.\n\nAmmonia exists around us in large quantities from several sources, including humans, livestock, fertilizer, stationary and mobile fuel combustion, and industrial plant services, including refrigeration. The ammonia used in refrigeration systems like ours represents a small percentage (less than 5 percent) of the total.\n\nThe chemical properties of ammonia make it an efficient, safe and widely used refrigerant.  Ammonia was one of the first refrigerants and has been used as an industrial refrigerant for more than 100 years.  \n\nMany standards governing refrigeration plant design and installation have made ammonia as safe to use as steam or electricity.  In fact, ammonia remains the most environmentally safe refrigerant in use today.\n\nThe refrigeration process involves cycling ammonia through a closed-loop mechanical system.  It is converted from liquid to vapor and back to liquid by compression, expansion and condensation.  During this process it is contained in the process equipment and does not normally come in contact with surrounding air.\n\nAmmonia is only dangerous when exposure occurs in high concentrations.  Due to its distinct odor, the smell can be detected at levels as low as 5 parts per million (ppm). The emergency response planning guideline developed by the American Industrial Hygiene Association has determined that exposure for up to one hou"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14202,
      "SummaryText": "r can be tolerated without serious health effects at a level of 200 ppm.\n\nShould leaks occur, most are small enough that they do not go beyond the boundaries of the facility.  Randalls is actively working with the Houston Local Emergency Planning Committee (LEPC), the Harris County HazMat Response Team, the fire department, police, and media to make sure all safety procedures are strictly followed. In the unlikely event of a major release of ammonia, the community will be notified by the above sources.  Those within the sphere of influence may be asked to either:\n\n1. Remain where you are and keep all doors and windows closed, or\n\n2. Evacuate following prescribed routes. \n\nRMP Offsite Consequence Analysis \n\nRandalls has retained the firm of EQE International to perform the RMP Offsite Consequence Analysis. EPA guidance documents were used. The scenario was modeled using the EPA atmospheric dispersion-modeling package. The results show a scenario hazard distance of 1.2 miles, and a maximum alternative release case hazard distance of 0.5 miles.\n\nThe worst case for us is the total release of the ammonia, due to the catastrophic failure of our Recirculator vessel.  Since the two systems in the plant are not currently connected, the release amount is approximately 10,000 pounds.  Following the EPA guidelines developed by the American Industrial Hygiene Association, our circle of influence is the point where the concentration of ammonia is 200 ppm.\n\n\n\nBecause the ammonia refrigerant is dispersed through the system in liquid and gaseous forms, it is highly unlikely that all of the ammonia could physically be released in a single event.  Our computer assisted control systems monitor system conditions, and sound alarms if certain parameters are violated.  This provides an early warning system, and gives us time to deal with an incident before any ammonia is released.\n\n\n\nAccidental Release Prevention Program\n\nThe program begins with superior design and installation of the refr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14202,
      "SummaryText": "igeration system.  In all cases Randalls has hired professional designers and installers for our facility.  All of the required codes are followed, at initial installation, as well as for any changes that occur after installation. \n\nIn addition, we are in compliance of the OSHA Process Safety Management (PSM) rules, which require us to conduct a Process Hazard Analysis (PHA). These rules require a team of plant personnel, a designer, an installer, and a person trained in the PHA process to examine the entire plant and rank all of the potential causes of leaks in the system.  This process is yet another method that helps us achieve our goal of keeping our system in as designed condition.\n\nThe senior management of Randalls recognizes their responsibility in authorizing the resources to maintain a safe plant for our associates, customers and neighbors.   Knowing that ammonia is one of the many chemicals on both the OSHA and EPA lists, they believe that the benefits of ammonia outweigh any negatives.  They support the local plant staff with the resources needed to train people and upgrade the physical plant.\n\nFive-year Accident History\n\nWe are very proud of the fact that since we began operating a refrigeration plant at the Telge Road site, we have had no incidents that have effected our neighbors.  We believe we have taken the necessary steps to maintain this record. \n\nEmergency Response Program\n\nThe emergency response program includes coordination with local emergency response officials.\nOur risk management and public relations departments will work closely together to ensure that we take appropriate measures informing the surrounding community should a release ever occur.\nRandalls will be conducting drills with the local emergency response officials and local schools to ensure that we are truly prepared to respond to an inadvertent release of ammonia.  These drills will supplement the Hazwoper, Incident Commander, CPR/First Aid/Bloodborne Pathogens training that"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 14202,
      "SummaryText": "our associates receive."
    }
  ]
}