{
  "FacilityID": 14213,
  "FacilityName": "Richfood Mechanicsville",
  "FacilityStr1": "Richfood, Inc.",
  "FacilityStr2": "8258 Richfood Road",
  "FacilityCity": "Mechanicsville",
  "FacilityState": "VA",
  "FacilityZipCode": "23116",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51085",
  "LEPC": "Hanover County LEPC",
  "FacilityLatDecDegs": "37.632778",
  "FacilityLongDecDegs": "-77.401389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Richfood, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Richfood Inc.",
  "OperatorStr1": "Richfood, Inc.",
  "OperatorStr2": "8258 Richfood Road",
  "OperatorCity": "Mechanicsville",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23116",
  "OperatorZipCodeExt": null,
  "RMPContact": "Charlotte Edwards",
  "RMPTitle": "Vice President of Risk Management",
  "FTE": 1276,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000150329",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-13 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 37.63237,
  "FRS_Long": -77.40357,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19472,
      "AltID": "Refrigeration System",
      "FacilityID": 14213,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19971,
          "ProcessID": 19472,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 24627,
          "ProcessID": 19472,
          "ChemicalID": 56,
          "Quantity": 14200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 524627,
          "ProcessID": 19472,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14213,
      "SummaryText": "The Richfood, Inc. Mechanicsville VA facility has a Risk Management Program (RMP) which complies with the requirements of Title 40 Code of Federal Regulations (CFR) part 68.  The facility is also complying with OSHA's Process Safety Management Standard (PSM), Title 29 CFR 1910.119.  The Richfood, Inc. Mechanicsville PSM/RM Program, along with other company safety and training programs, deal with the risks involved in the storage, handling, and processes utilizing hazardous chemicals.  In this way Richfood promotes overall plant, worker, and public safety.  These programs enable our facility to prevent the occurrence, and minimize the consequences, of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents.  Overall, these programs prevent accidental fatalities, injuries and illnesses, and avoid physical property and environmental damage.\n\nThe Richfood safety programs are applied to any activity involving hazardous chemicals including any use, storage, handling, or the on-site movement of such chemicals, or combination of these activities.  Any group of vessels which are interconnected and separate vessels which are located such that a hazardous chemical could be involved in a potential release is considered a single process.  \n\nThe Richfood safety programs prevent accidents because they focus on the rules, procedures, and practices which govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as necessary.  They are also communicated to and accepted by all employees at the facility. \n\nThe process covered by the Richfood, Mechanicsville, VA PSM/RM Program is the ammonia refrigeration system.  The ammonia refrigeration system provides cooling for the refrigerated storage of perishable food products.  The refrigeration process involves a typical vapor compression refrigeration cycle with compressors, condenser and evaporators.  The system is closed and is designed t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14213,
      "SummaryText": "o completely contain the ammonia refrigerant within vessels, equipment and piping specifically constructed for ammonia refrigeration.  Liquid ammonia is circulated from the vessels in the refrigeration equipment room to the evaporator coils which cool the refrigerated spaces by boiling off some of the ammonia liquid to vapor.  The ammonia then returns to the equipment room where the ammonia vapor enters the compressors and is discharged at higher pressure to the condenser.  The vapor is cooled in the condenser causing the vapor to condense to liquid which is drained to the receiver vessel to repeat the refrigeration cycle.\n\nThe Richfood, Mechanicsville refrigeration system contains 14,200 pounds of anhydrous ammonia which is a regulated toxic substance.  The worst case scenario involves failure of the high pressure receiver containing 7,100 pounds of ammonia (with the receiver quantity limited to 50% of the vessel capacity by facility controls and procedures), released over a period of ten minutes.  Under the worst-case weather conditions, ammonia could travel 1.0 mile before dispersing enough to no longer pose a hazard to the public.  This scenario is unlikely for the following reasons: worst case weather conditions are uncommon; industry standards for the manufacture and quality control of pressure vessels; ammonia is not corrosive in this service; pressure safety valves limit operating pressure in this vessel; the accident prevention program in place at the facility including the mechanical integrity program for regular maintenance, inspection and testing, and replacement of equipment, if necessary; installed ammonia sensors in the system to warn of leaks; alarms and the auto-dialing system in place to warn operating personnel of process upsets; and the emergency response plan and equipment in place at the facility.\n\nThe alternative release scenario for the Richfood, Mechanicsville refrigeration system involves a leak from a rooftop pipe or tank resulting in a re"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14213,
      "SummaryText": "lease of 10,800 pounds of ammonia over a time period of 20 minutes.  Under common weather conditions, ammonia could travel 0.2 miles before dispersing enough to no longer pose a hazard to the public.  This scenario was chosen because there is a significant amount of piping and equipment on the roof of the facility.  This scenario is unlikely for the following reasons: industry standards for the manufacture and quality control of equipment and piping; the mechanical integrity program in place at the facility including operating precedures, regular maintenance, inspection and testing, and replacement of equipment, if necessary; and the emergency response plan and equipment in place at the facility.\n\nIn addition to the implementation of safety programs in compliance with the OSHA PSM Standard and the EPA RM Program regulations the Richfood, Inc. Mechanicsville, VA ammonia refrigeration system has been designed and constructed in accordance with applicable codes and standards including ANSI/IIAR 2-1992 Standard for Equipment, Design and Installation of Ammonia Mechanical Refrigerating Systems.  Standard operating procedures and training programs have been developed for the facility personnel to specifically address the characteristics of the Richfood Mechanicsville refrigeration system.\n\nThere have been no accidental releases of ammonia at the Richfood Mechanicsville facility in the past five years.  \n\nThe Richfood Mechanicsville facility's emergency response program is based on the OSHA requirements for Emergency Action Plans (29 CFR 1910.38 and 1910.119) and HAZWOPWER (29 CFR 1910.120).  We have trained employees for emergency response and maintain a written emergency response plan.  This plan is coordinated with the Local Emergency Planning Committee (LEPC) and the local fire department.  We conduct annual drills for implementation of the emergency response plan at the facility with the participation of the LEPC and the fire department.  \n\nThe Richfood Mechanicsville"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14213,
      "SummaryText": " facility has a management system in place which has been developed to assure that the PSM/RM Program is implemented, documented and updated to assure its effectiveness."
    }
  ]
}