{
  "FacilityID": 14216,
  "FacilityName": "AES Redondo Beach, L.L.C.",
  "FacilityStr1": "1100 North Harbor Drive",
  "FacilityStr2": null,
  "FacilityCity": "Redondo Beach",
  "FacilityState": "CA",
  "FacilityZipCode": "90277",
  "Facility4DigitZipExt": "2077",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.848611",
  "FacilityLongDecDegs": "-118.393611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 197235187,
  "ParentCompanyName": "AES Corporation",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "AES Redondo Beach, L.L.C.",
  "OperatorStr1": "1100 North Harbor Drive",
  "OperatorStr2": "P.O. Box 392",
  "OperatorCity": "Redondo Beach",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90277",
  "OperatorZipCodeExt": "2077",
  "FTE": 72,
  "OtherEPAFacilityID": "CAR00008893",
  "EPAFacilityID": "100000149788",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "115536",
  "SafetyInspectionDate": "1999-05-13 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2024-05-22 00:00:00",
  "DeRegistrationEffectiveDate": "2024-03-14 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.850278,
  "FRS_Long": -118.395,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19475,
      "AltID": "NOx Reduction by NH3",
      "FacilityID": 14216,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 24631,
          "ProcessID": 19475,
          "ChemicalID": 57,
          "Quantity": 149620.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 19975,
          "ProcessID": 19475,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 7829,
              "Process_NAICS_ID": 19975,
              "SafetyReviewDate": "1997-07-01 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1997-07-01 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Specific operational permissives and low flow shut off devices",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Spill collection drain",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Tank leak sensors",
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-19 00:00:00",
              "TrainingReviewDate": "1995-05-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1995-02-23 00:00:00",
              "EquipmentInspectionDate": "1998-11-01 00:00:00",
              "EquipmentTested": "Complete inspection of SCR catalyst, instrumentation, alarms, and controls. Currently SCR system is in progress of becoming Y2k compliant.  October 1999 to be certified as Y2k compliant",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1997-07-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 8184,
                  "PreventionProgram2ID": 7829,
                  "ProcessChemicalID": 24631
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 14216,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-09-01 00:00:00",
    "ERTrainingDate": "1999-03-31 00:00:00",
    "CoordinatingAgencyName": "Redondo Beach Fire Department",
    "CoordinatingAgencyPhone": "3103705416",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "California Hazardous Materials Business Emergency Plan and Inventory law (CA H&S Code Ch. 6.95)",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14216,
      "SummaryText": "General Facility Overview and Process Description\n\nFor many decades, the Southern California Edison Company (SCE) has supplied electricity to much of California.  To generate this electricity, SCE operated many power plants which use a variety of resources, including fuel oil, natural gas, coal, nuclear, and hydroelectric.  SCE's Redondo Generating Station, located in the northwestern corner of the City of Redondo Beach, California, has operated in this community serving southern California for over 50 years.  The Redondo Generating Station was purchased by AES Corporation as part of California's deregulation of the electric utility industry (and is now known as AES Redondo Beach, L.L.C.).  SCE retained the electrical transmission facilities (e.g. the switchyards, power distribution lines), and (through Edison O&M Services) provides generating station operation and maintenance services under contract to the new owners of the generating stations. \n\nThe AES Redondo Beach, L.L.C. power generating facility burns natural gas in boilers to produce steam.  The facility has the ability to burn fuel oil, but does so only exceptionally rarely due to air quality concerns.  The steam is used in turbine generators to produce electricity.  Currently, the station actively operates four boiler/steam turbine generating units, designated Units 5, 6, 7 and 8.  Units 5 & 6 are operated from a common control room and are rated at 175 megawatts (MW) each.  Units 7 & 8 are operated from a common control room and are rated at 480 MW each with each producing 3,481,000 lbs/hr. steam.\n\nThe basic flow path of each boiler is as follows:  (1) combustion air is supplied by fans to the air preheater where it is heated, (2) the heated air is mixed with fuel in burners to produce a flame and hot flue gases (combustion products), (3) the hot flue gases flow through the radiant and then the convective passes of the boiler, (4) heat is removed from the flue gas as it flows over the outside of tubes (pi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14216,
      "SummaryText": "pes) in the boiler, (5) water flowing in the inside of the tubes is converted to steam as this heat is absorbed, (6) the flue gas flows through the air preheater where a final increment of heat is removed in preheating the incoming combustion air, and (8) the flue gas exists the boiler stack.\n\nAs part of any fossil fuel combustion process, a small amount of nitrogen oxides (NOx) are produced and is exhausted to atmosphere with the other flue gas constituents (mostly nitrogen, carbon dioxide, and water vapor).  The amount of NOx which the station is allowed to emit is regulated by the South Coast Air Quality Management District (SCAQMD).  In 1991 - 1992, the SCAQMD revised its Rule 1135 which reduced the allowed NOx emissions and specifically required that SCE (the previous owner and current operator (for AES) of the generating station) install a NOx emission reduction system on the two largest Units - # 7&8. In 1993 - 1994, SCE installed a Selective Catalytic Reduction (SCR) NOx Control System on Units 7 & 8,  which are operated from a common control room.  Identical SCR systems were designed and installed by the same firm, Noell, Inc., at several southern California SCE generating stations.\n\nThe SCR process involves injecting aqueous ammonia into the boiler flue gas in the boiler's convective pass.  The ammonia/flue gas mixture flows through a catalyst installed between the convective pass and the air preheater.  In the presence of the catalyst, the ammonia and NOx react to form nitrogen and water vapor, which exits out the boiler stack.  About 87% of the NOx is removed in this manner.  The SCR system uses a 29.4% aqueous ammonia solution in the SCR system.  The aqueous ammonia is stored in a 20,000 gallon double walled underground storage tank.  The aqueous ammonia is one of several hazardous materials used at the facility which are critical to the safe and continued generation of electricity for the community.  As AES Redondo beach utilizes aqueous ammonia over t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14216,
      "SummaryText": "he federal 10,000 pound RMP threshold, the facility and the SCR process are covered under the federal and state Risk Management Prevention program. \n\nAccidental Release Prevention and Emergency Response Policies \n\nAES Redondo Beach has had an active hazardous materials management and accident prevention program for many years, and emphasizes safety and good management practices in all its activities - conducting all activities in accordance with a detailed, well established Accident Prevention Manual and active participation by management, line and contractor employees.  The AES Redondo Beach facility has an exceptionally strong safety team and committee program.  This program is actively and visibly supported by facility management.  The facility has in place several long-established procedures and policies governing hazardous materials and waste handling, spill prevention, environmental compliance and inspections, and several other safety related policies. \n\nAs part of the 1993 - 1993 installation and operation of the SCR system, AES Redondo Beach has developed and implemented a formal (California) Risk Management and Prevention Program (RMPP) in coordination with and under the approval of the Redondo Beach Fire Department (RBFD).  The 1987 RMPP law, one of the first chemical accidental release prevention programs was the state predecessor of the USEPA's federal Accidental Release Prevention / Risk Management Prevention program.  The RMPP contained much of the same elements of the current RMP, and has been in-place at AES Redondo Beach since late 1993 and resulted in may additional administrative/procedural and technical enhancements to aqueous ammonia safety at the facility.  The facility reviewed and revised the RMPP in July 1997 - coordinating the update/revision with the Redondo Beach Fire Department.  \n\nAdditionally, for the past fifteen years, AES Redondo Beach has maintained a hazardous materials emergency preparedness and response program to reduce the lik"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14216,
      "SummaryText": "elihood of a hazardous materials release, and minimize the impacts should any spill or release occur.  Since the installation of the SCR system in 1993 - 1994, the facility has not had any releases of aqueous ammonia from the SCR system or aqueous ammonia storage systems. \n\nThe AES Redondo Beach hazardous materials emergency response program supports and provides for the trained response by designated facility emergency response personnel to incidents involving a wide range of materials.  The facility conduct frequent drills and training for such responses.  Specifically as it relates to the aqueous ammonia and SCR system, AES Redondo Beach personnel are trained to only respond to an aqueous ammonia release if it can be done so safely and without possible risk to safety or health (e.g. minor, incidental spills of low volume).  AES Redondo Beach will immediately contact and rely upon outside response agencies, as well as pre-contracted, qualified emergency response contractor for all other aqueous ammonia releases.\n\nWorst Case and Alternate Release Scenarios\n\nSeveral potential worst case scenarios were evaluated as part of the RMP Offsite Consequence Analysis, with the scenario resulting in the largest calculated off-site impact being selected for inclusion in the final RMP Plan.  EPA has defined the worst-case scenario as the release of the largest quantity of a regulated substance from a single vessel or process line failure that results in the greatest distance to an endpoint without regard to any active control, prevention or mitigation measures in place.\n\nBased on the results of the gas dispersion modeling of scenarios developed from the 1993 and 1999 HAZOP studies and revalidation and the current 1999 EPA Offsite Consequence Analysis Guidelines, it was determined the worst case scenario would be a 20.8 gallon release (over an EPA-specified 10 minute duration) from a complete break/shear in the 1\" aqueous ammonia supply pipeline at the tank/pump connection (abov"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 14216,
      "SummaryText": "e ground section).  The line connects the aqueous ammonia supply pumps inside the underground storage tank to the Units 7&8 SCR metering pumps and vaporizers. The calculated volume of the approximately 510 foot 1\" diameter stainless steel pipeline is 20.8 gallons.  Using the the Areal Locations of Hazardous Atmospheres (ALOHA) gas dispersion modeling program and following the EPA's April 1999 \"Risk Management Program Guidance for Offsite Consequence Analysis\", this scenario was calculated to result in a minor off-site impact.\n\nThe results of the facility's Process Hazard Review was used to determine the most likely (e.g. credible) alternative case release scenario based on operations and system design and maintenance.  It was determined by consensus that the most significant, adverse yet credible release scenario was the catastrophic rupture of the 25 foot long, 2-inch diameter tanker truck offloading hose during loading operations at the 20,000 gallon underground tank.  The maximum delivery rate of the aqueous ammonia from the delivery truck 140 gallons per minute (gpm). The 6,000 gallon capacity truck is equipped with remotely activated emergency shut off controls, and unloading personnel are standing by with splash guards and respirators.  The hazard review team determined that the flow of aqueous ammonia from the truck could be stopped within one minute by the stand by personnel.  In late 1996, the tanker truck unloading area was modified to include a bermed/diked truck unloading basin (18' x 18') significantly sloped to a center 2'x2' drain connected to a 4\" drain line tied into first the an approximately 12,000 gallon capacity oil water separator and then to a 1,000,000 gallon retention basin.  There are several drain openings to the atmosphere along this line.\n\nBased on this scenario - 140 gallons of aqueous ammonia released at the underground tank filling location inside the loading containment berm sloped to the center drain line, the 200 ppm toxic endpoint"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 14216,
      "SummaryText": "(impact zone) does not extend offsite and therefore does not have any off-site impacts.  Other possible alternative case scenarios were evaluated to determine if any would cause an offsite impact but all other alternate release scenarios (toxic endpoints) remained onsite as well.   \n\nGeneral Accidental Release Prevention and Chemical-Specific Steps\n\nAs noted previously, AES Redondo Beach has had an active hazardous materials management and accident prevention program for many years, and emphasizes safety and good management practices in all its activities - conducting all activities in accordance with a detailed, well established Accident Prevention Manual and active participation by management, line and contractor employees.  Specific to the SCR system and underground storage tank, a multitude of release prevention design, procedural and operational elements and controls are in place and effective.  As part of this 1999 RMP development, AES Redondo had performed a Seismic Hazards Analysis which evaluated the stability and integrity of the SCR mechanical systems and related equipment relative to earthquake and related hazards.  Any recommendations to be made upon completion of the report (July 1999) will be evaluated and implemented as appropriate by the facility.  As detailed in the Maintenance section of the RMP, AES Redondo Beach has in place a multi-faceted inspection and maintenance program  - which includes daily visual inspections and annual maintenance overhauls.\n\nThe SCR system was designed by Noell, Inc.  The ammonia storage system was designed by Southern California Edison.  All equipment was installed by Powerplant Specialists, Inc., under contract to Noell, Inc.  The design of the SCR and ammonia storage system is governed by Occupational, Safety and Health Administration (OSHA), American Society of Mechanical Engineers (ASME), American National Standards Institute (ANSI), Uniform Building Code (UBC), National Fire Protection Association (NFPA), and Ca"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 14216,
      "SummaryText": "lifornia codes.  Installation was governed by the same codes.  The underground piping and tank design and installation were permitted and approved by the Los Angeles County Department of Public Works and the Redondo Beach Fire Department.\n\nThe storage facility includes a single 20,000 gallon, double wall underground tank system with three aqueous ammonia supply pumps, piping, valves, instrumentation, controls, and electrical.  The aqueous ammonia storage tank system consists of a 50 psig primary horizontal pressure vessel (designed and manufactured in accordance with ASME Boiler and Pressure Vessel Code Section VIII) enclosed within a secondary containment tank (designed and manufactured in accordance with UL Standard 58) which is externally clad with fiberglass reinforced polyester resin (in accordance with UL Standard 1746).  The fiberglass resin was Holiday tested after delivery to ensure its integrity and corrosion inhibiting capability.\n\nThe primary vessel is equipped with a vacuum breaker with flame arrester and a large capacity relief valve set at 50 psig and vented to the atmosphere 12 ft. above grade.  The flame arrester eliminates any potential for an open flame to be drawn into the main tank.  The secondary containment tank is also vented to the atmosphere 12 ft. above grade through a dryer canister in parallel with a conservation pressure vent.  This arrangement prevents breathing in moisture while allowing a bypass path to prevent pressure build up in the secondary containment.\n\nA two inch fill line and a two inch vapor return line are routed from the primary vessel through block valves to quick connect type couplings for truck unloading.  The fill line allows the transfer of aqueous ammonia from the delivery truck to the tank, while the vapor return line allows the displaced ammonia vapors from the tank to be returned to the truck. The fill and vapor return piping are securely anchored at the truck unloading station.  The unloading station is within th"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 14216,
      "SummaryText": "e spill containment barrier that runs along the perimeter of the tank.  The tank has a visual level gauge in the vicinity of the loading station to assist the unloading truck operator and to prevent overfilling.  A ground cable is provided for connection to the unloading truck.  HAWS safety eyewash/shower combinations are provided at the storage tank and adjacent to the metering pump skid for each unit.\n\nThe aqueous ammonia truck unloading area was redesigned in late 1996 to include an 1,800 gallon capacity truck unloading containment basin connected to an open plant waste water drain system.  The basin us underlined by a synthetic membrane liner.  A plot plan has been included to identify the location relative to the site.  Also, a drawing has been included that sketches out the new containment area pad and redesign of the drain system.\n\nA new drain has been installed in the unloading area for the aqueous ammonia trucks.  It extends out and connects with the existing equipment drain system located near Unit 8 South forced draft fan enclosure.  The floor drain's ultimate discharge is to the station's South Retention Basin.\n\nA containment area pad was also installed adjacent to the aqueous ammonia storage area.  This new containment is designed to capture any spill that may occur during the process of unloading the aqueous ammonia, directing the product to the station's retention basin.\n\nThe piping system for aqueous ammonia is Schedule 80 Grade 316 stainless Steel with welded fittings in all areas by the metering pump, liquid injector area, and ammonia storage area.  The underground containment pipe is compression fitting 4\" PVC schedule 80.\n\nPower Piping Code ANSI B31.1 recommends piping hanger spans of 8 1/2 feet for 1 1/2\" diameter pipe size (water service) at 1g-loads.  The corresponding maximum weight stress level from table 121.5 of the ANSI B31.1 Code, 1989 edition, is 2300 psi.  Since the seismic g-load for the subject area is .3g in any horizontal direction"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 14216,
      "SummaryText": ", the combined load is only .42g in the horizontal direction.  Therefore, the allowable seismic span is estimated to be 20 feet (using (1.0g/0.42g) x 8.5 feet = 20 feet).  The seismic span for the aqueous ammonia piping is less than 10 feet in every case.  In addition, the pressure stress is negligible since the maximum aqueous ammonia pressure is only 90 psi.  Consequently, the seismic design of the aqueous ammonia piping is well within ANSI B31.1 limits.\n\nA liquid leak detection system is provided for the storage tank with leak detector elements installed in the secondary containment compartment (two elements), supply pump columns (one element each), safety relief valve discharge (one element), and underground piping secondary containment (one element).  The elements are wired to a local leak monitor and alarm panel which will also annunciate to control room operators via the plant distributed control system (DCS).  Detection of liquid in the underground piping secondary containment will trip the supply pumps.\n\nAn ammonia vapor detector system is provided with four ammonia detectors installed above grade on the perimeter of the storage tank facility with additional detectors located around the metering pumps.\n\nThe detectors are wired to a local ammonia monitor and alarm panel which will also annunciate to control room operators via the plant DCS.  A safety shower is available in the tank area, and at the metering pump skid.\n\nThe control system has been upgraded using a Rosemount 9000 DCS.  Interlocks have been incorporated to shut off aqueous ammonia flow to the SCR system in case of low boiler load below 130 MW, low gas temperature in the boiler below 3500F, low SCR fan flue gas flow less than 4000 scfm, boiler fuel trip, aqueous ammonia tank pump failure.\n\nEquipment design, fabrication, procurement, and installation has been managed by PSI and Noell with SCE exercising management through application of its quality assurance procedures.  SCE intends to ensure ong"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 14216,
      "SummaryText": "oing mechanical and process integrity of equipment by incorporating manufacturers' maintenance, inspection, and testing procedures in the applicable station orders.\n\nThe existing station chemical feed system is an original Unit installation designed by Bechtel Inc.  The existing Polisher Demineralizer system was designed by the Cochren Division of the Crane Company.  The design of the existing chemical feed system is governed by the following codes:  ASME Section IX - Boilers, ANSI B33.1 - Power Piping, NFPA, OSHA, and the UBC.\n\nFive Year Accident History\n\nAES Redondo Beach has had zero (0) accidents involving the release or threatened release of aqueous ammonia from the SCR system since the system was first installed in 1993.\n\nEmergency Response Program\n\nAES Redondo Beach maintains a strong Hazardous Materials Emergency Response and Prevention Program.  AES Redondo Beach is an active member of the Beach Cities Community Awareness and Emergency Response (CAER) program.  As detailed Section 9 'Training', all employees are trained in Hazardous Waste Operations and Emergency Response (HAZWOPER) Awareness Level 1, with all Team Leaders trained as HAZWOPER Level 5 Incident Commanders.  The curriculum meets federal and state OSHA HAZWOPER regulations. Employees who, in the course of their job duties, are involved in the operation, maintenance, sampling, engineering or supervision of the hazardous material or waste storage facilities receive training in hazardous waste and materials management, as do all facility hazardous waste generators.  This training includes the facility's Emergency Response Business Plan - which includes the required elements of a hazardous waste contingency plan as required by 22 CCR. \n\nThe AES Redondo Beach Emergency Response Business Plan is updated on an annual basis with the new revisions coordinated and reviewed with the Redondo Beach Fire Department upon issuance.  Emergency response and emergency planning issues are also reviewed with the Be"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 14216,
      "SummaryText": "ach Cities CAER group on an ongoing basis.   \n\nThe AES Redondo Beach hazardous materials emergency response program supports and provides for the trained response by designated facility emergency response personnel to incidents involving a wide range of materials.  The facility conduct frequent drills and training for such responses.  Specifically as it relates to the aqueous ammonia and SCR system, AES Redondo Beach personnel are trained to only respond to an aqueous ammonia release if it can be done so safely and without possible risk to safety or health (e.g. minor, incidental spills of low volume).  AES Redondo Beach will immediately contact and rely upon outside response agencies, as well as pre-contracted, qualified emergency response contractor for all other aqueous ammonia releases.\n\nPlanned Changes to Improve Safety\n\nAES Redondo is in the process of developing and conducting a series of RMP management compliance training classes to increase the understanding and reaffirm the commitment of AES corporate and facility management to the RMP program.  Additionally, the facility will review and implement as appropriate the recommendations contained in the impending Seismic Hazards Analysis."
    }
  ]
}