{
  "FacilityID": 14223,
  "FacilityName": "Dreisbach Enterprises",
  "FacilityStr1": "2530 East 11th Street",
  "FacilityStr2": null,
  "FacilityCity": "Oakland",
  "FacilityState": "CA",
  "FacilityZipCode": "94601",
  "Facility4DigitZipExt": "1425",
  "FacilityCountyFIPS": "06001",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "37.779556",
  "FacilityLongDecDegs": "-122.235417",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 73954836,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dreisbach Enterprises",
  "OperatorStr1": "P.O. Box 7509",
  "OperatorStr2": null,
  "OperatorCity": "Oakland",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94601",
  "OperatorZipCodeExt": "7509",
  "RMPContact": "Robert Leuthold",
  "RMPTitle": "Director of Engineering Services",
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000032886",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-07 00:00:00",
  "SafetyInspectionBy": "Oakland Hazardous Materials Div.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-02-27 00:00:00",
  "DeRegistrationEffectiveDate": "2019-02-12 00:00:00",
  "AnniversaryDate": "2004-06-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 37.77964,
  "FRS_Long": -122.23435,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19485,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 14223,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19985,
          "ProcessID": 19485,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 24656,
          "ProcessID": 19485,
          "ChemicalID": 56,
          "Quantity": 23000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 524656,
          "ProcessID": 19485,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14223,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Dreisbach Enterprises facility abides by the emergency response procedures and policies detailed in the Response Plan for On-Site Emergency Operations manual.  This Plan was designed to meet the following objectives:\n\n    1.)    To save lives.\n    2.)    To minimize and avoid injuries.\n    3.)    To protect the environment.\n    4.)    To minimize property damage.\n\nDreisbach maintains an emergency response committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate any facility changes. \n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe ammonia refrigeration system at the Dreisbach facility provides cooling for several cold storage and dock areas.  Different temperatures are maintained by running two suction pressures with different sets of compressors.  The majority of the refrigeration system is located in the compressor room. Evaporator valves and piping are mounted in their respective cold storage/process zones and the condensers are located on the facility roof.\n\nThe refrigeration process, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for process equipment and cold storage rooms.  Changes in pressure are directly related to changes in temperature.  For example, lowering the ammonia pressure lowers its temperature.  Low pressure (cold) liquid ammonia provides refrigeration by removing am"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14223,
      "SummaryText": "bient heat.  Removal of ambient heat causes the liquid ammonia (contained within the system) to vaporize.  Heat is later removed from the ammonia as it is condensed back into a liquid.  Typical operating conditions range from vacuum (approximately 6\" Hg) on the low pressure side of the system to 150-160 psig on the high side.\n                                    \nAmmonia is used as the refrigerant in the refrigeration process.\n\nThe total ammonia inventory is 23,000 pounds.  \n\n\nHAZARD ASSESSMENT SUMMARY\n\nWorst Case Release Result Summary\n\n\nThe worst case release for this facility was that of the maximum quantity of ammonia that can be stored in a vessel.  The largest vessel is the low pressure receiver (RCVR #3) which is located inside the engine room.  This vessel can hold 8130 pounds of ammonia.  This quantity was released in 10 minutes.  This vessel is located inside a building; therefore, the enclosure was used as a passive mitigation measure. The most pessimistic meteorological conditions were used: 1.5 meters/second wind speed, and F stability.  The facility is located in an urban setting.  The downwind distance to 200 ppm was determined using Exhibit 4-4 from the EPA \"Risk Management Program Guidance for Ammonia Refrigeration\", November 1998.  The release reaches off-site and may affect population receptors.  No environmental receptors are affected by this potential scenario.\n\nAlternative Release Result Summary\n\nThe alternative release scenario was that of a 0.25 inch diameter leak of high pressure gas ammonia for one hour.  This scenario was chosen because the facility has high pressure gas lines external to the facility and a 0.25 inch leak could be caused by a flange seal leak or a valve packing leak.  The quantity of ammonia released in one hour at this rate is 8,040 pounds.  The meteorological conditions used were 3 meters/second wind speed, and D stability. The facility is located in an urban setting.  The downwind distance to 200 ppm was determined using Exhibit 4-5 from the EPA \""
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14223,
      "SummaryText": "Risk Management Program Guidance for Ammonia Refrigeration\", November 1998.  The release reaches off-site and may affect population receptors.  No environmental receptors are affected by this potential scenario.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nAdministrative Measures\nThe facility operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines and standards including the following:\n\n    IIAR Bulletin 107, \"Suggested Safety and Operating Procedures When Making Ammonia Refrigeration Tie-ins\"\n    IIAR Bulletin 109, \"Minimum Safety Criteria for a Safe Ammonia Refrigeration System\"\n    IIAR Bulletin 110, \"Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems\"\n    IIAR Publication R-1, \"A Guide to Good Practices for the Operation of an Ammonia Refrigeration System\"\n\nIn addition, Dreisbach has implemented a Process Safety Management program for compliance with the Cal-OSHA 5189 regulation since April 1994.\n\nEngineering Measures\nThe ammonia refrigeration system employed by Dreisbach is equipped with a computer which monitors and  controls the system.  The computer system is connected to controls and status indicators throughout the refrigeration system intended to minimize potential ammonia related accidents and to allow operators to monitor system operations.  This monitoring system is comprised of liquid level controls, pressure and temperature controls and indicators, as well as other system safeguards and methods for allowing the computer (or facility operators) to effectively monitor and control refrigeration operations.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nThe five year accident history shows that there have been no releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds. In addition, there have been no injuries resulting from an ammonia release (June 1994 through June 1999).\n\nEMERGENCY RESPONSE PROGRAM\n\nThe Dreisbach Enterprises Oakland facility has a Response P"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14223,
      "SummaryText": "lan for On-Site Emergency Operations. This Plan outlines the policies and procedures in place to respond to potential ammonia alarms or releases.  Dreisbach's policy is to contact 9-1-1 in the event of an ammonia release.  The facility has several trained personnel to assist in an orderly evacuation as well as to diagnose the alarm condition.  There are three \"Operations Level\" trained employees at the facility. These employees have completed the OSHA 8 Hour Operation Level Training program and participate in 8 hour annual refresher training classes. \n\nThe Response Plan for On-Site Emergency Operations includes the facility emergency coordinators, the staff alerting list, emergency notification list, and the hazardous materials agency notification and procedures.  This Plan then proceeds to detail the procedures for employees and management in the event of a fire, evacuation, compressor room shut down, earthquake, blackout, and ammonia release/clean-up.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nFollowing a review of the existing Process Safety Management programs in place at the facility and the development of the EPA Risk Management Program submittal documentation, the following changes have been planned for the facility.  These mitigation measures will be implemented by the Engineering Department by December 1999.\n\n1.    Update the Process Safety Information Section of the PSM Manual to reflect the modifications made to Room 1 including the following edits:\n    a.    Page 1, Facility Site Map Table\n    b.    Facility Site Map\n    c.    Block Flow Diagram\n    d.    P&ID, Room 1 & 2 Coils\n\n2.    Complete the human factor, facility siting, and emergency response checklists.\n\n3.     Complete the standard operating procedures and certify as complete.  Then review and certify annually thereafter using the Certification form in the PSM notebook.\n\n4.    Incorporate equipment specifications and consequences of deviation in the operating procedures.\n\n5.    Develop and utilize training certification forms for refrigera"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 14223,
      "SummaryText": "tion operators.  One form for existing operators and one form for initial training of new operators to document on-the-job training.  Form 1 is the \"Grandfather\" form.  OSHA allows facilities to certify that the operators who started working at the facility and on the regulated process, prior to June 21, 1999, are qualified to carry out their responsibilities outlined in the operating procedures. Form 2 is the Initial Training Form.  This form should be signed by the supervisor and operator to certify that the operator understands the operating procedures enough to work independently. In addition, Form 2 should be developed for each operating procedure.\n\n6.    Review the Inspection Schedules (Tables 2 - 5) in Section 9 of the PSM manual to ensure that it is an accurate representation of the facility's maintenance program. Once the facility's maintenance schedule has been finalized, develop checklists with dates of completion and operator initials for record keeping purposes.\n\n7.    Include the PSM program to new employee orientation and/or the IIPP Hazard Communication training program to ensure all employees know about the PSM programs.\n\n8.    Conduct an evacuation drill annually and document the results.\n\n9.  Add an ammonia detection system at the facility that will alarm and/or provide automatic shut down of the system in the event of a release of ammonia."
    }
  ]
}