{
  "FacilityID": 14253,
  "FacilityName": "Agrium U.S. Inc. Friend Terminal",
  "FacilityStr1": "401 West Road 10",
  "FacilityStr2": null,
  "FacilityCity": "Scott City",
  "FacilityState": "KS",
  "FacilityZipCode": "67871",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20171",
  "LEPC": "Scott County LEPC",
  "FacilityLatDecDegs": "38.276944",
  "FacilityLongDecDegs": "-100.9125",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.agrium.com",
  "FacilityEmailAddress": "@agrium.com",
  "FacilityDUNS": 9423963,
  "ParentCompanyName": "Agrium U.S. Inc.",
  "Company2Name": null,
  "CompanyDUNS": 808957229,
  "Company2DUNS": null,
  "OperatorName": "Dale Hammerschmidt",
  "OperatorStr1": "401 West Road 10",
  "OperatorStr2": null,
  "OperatorCity": "Scott City",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "67871",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000150953",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-06-10 00:00:00",
  "DeRegistrationEffectiveDate": "2004-03-08 00:00:00",
  "AnniversaryDate": "2004-06-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.48359,
  "FRS_Long": -100.89826,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19516,
      "AltID": null,
      "FacilityID": 14253,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 24688,
          "ProcessID": 19516,
          "ChemicalID": 57,
          "Quantity": 40450000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 20016,
          "ProcessID": 19516,
          "NAICSCode": "325311",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 10459,
              "Process_NAICS_ID": 20016,
              "SafetyReviewDate": "1999-01-18 00:00:00",
              "PHA_Date": "1995-07-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1994-07-09 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-01-18 00:00:00",
              "TrainingReviewDate": "1999-01-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-01-18 00:00:00",
              "EquipmentInspectionDate": "1999-05-19 00:00:00",
              "EquipmentTested": "boiler",
              "ChangeMgmtDate": "1996-06-30 00:00:00",
              "ChangeMgmtReviewDate": "1999-01-18 00:00:00",
              "PreStartupReviewDate": "1999-01-18 00:00:00",
              "ComplianceAuditDate": "1999-01-25 00:00:00",
              "AuditCompletionDate": "1999-12-31 00:00:00",
              "IncidentInvestigationDate": "1997-06-10 00:00:00",
              "InvestigationChangeDate": "1997-06-10 00:00:00",
              "ParticipationPlansReviewDate": "1999-01-18 00:00:00",
              "HotWorkPermitReviewDate": "1999-01-18 00:00:00",
              "ContractorSafetyReviewDate": "1999-01-18 00:00:00",
              "ContractorSafetyEvalDate": "1999-01-18 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 14762,
                  "PreventionProgram3ID": 10459,
                  "ProcessChemicalID": 24688
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 14253,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-01-18 00:00:00",
    "ERTrainingDate": "1999-01-18 00:00:00",
    "CoordinatingAgencyName": "Scott County LEPC",
    "CoordinatingAgencyPhone": "3168722133",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 14253,
      "SummaryText": "titute's (AFI) Ammonia Tables, PHAST Professional Dispersion Model (version 5.20), TRC Environmental Corporation Model for Refrigerated Ammonia, EPA's RMP Comp software and the lookup tables in EPA's RMP Offiste Consequence Analysis Guidance (OCAG).  All of these models predict pollutant concentration downwind from the source, taking into consideration the physical characteristics of the pollutant, the physical characteristics of the site, weather conditions, and the circumstance of the release.                                                                                                                                                                                                                                                                                                                            \nWorst-Case Release Scenario Analysis\n\nFor the worst-case release scenario analysis, several release scenarios were modeled for anhydrous ammonia and one release scenario was modeled for propane.  The scenario that resulted in the largest footprint in the event of an anhydrous ammonia release will be selected as the worst-case anhydrous ammonia release scenario for the Friend Terminal.  The propane worst-case release scenario is represented by the only scenario modeled.  The release scenarios modeled are summarized as follow:\n\n1. Complete failure of the refrigerated AST resulting in the release of 20,000 tons of anhydrous ammonia.  All of the anhydrous ammonia will be discharged into the containment dike.\n2. Failure of ammonia pressure vessel resulting in the release of 68 tons of anhydrous ammonia.\n3. Failure of ammonia railcar resulting in the release of 80 tons of anhydrous ammonia.\n4. Failure of ammonia tanker truck resulting in the release of 20 tons of anhydrous ammonia.\n5. Complete failure of the pressurized propane vessel resulting in the release of 15,300 gallons of propane.\n\nBased on all of the information available, the offsite impacts from these release"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14253,
      "SummaryText": "scenarios are predicted by the models.  All of the worst case release scenarios resulted in offsite impact.  The scenario resulted in the largest footprint for the anhydrous ammonia release is the complete failure of the ammonia pressure vessel resulting in the release of 200 tons of anhydrous ammonia.  The worst case release scenario for propane is represented by the complete failure of the pressurized propane vessel resulting in the release of 15,300 gallons of propane. Modeling shows that worst case scenarios for both the ammonia and the propane will reach reach offsite endpoints and nearby public receptors.\n\nAlternative Release Scenario Analysis\n\nSeveral alternative release scenarios were investigated for anhydrous ammonia and one alternative release scenario was modeled for propane.  Again, the scenarios that resulted in the largest footprints will be selected as the alternative release scenarios for anhydrous ammonia and propane for the Friend Terminal.  The alternative release scenarios modeled are as follow:\n\n1. Rupture of the 2 ammonia loading hose.\n2. Failure of ammonia pump seal.\n3. Failure of ammonia safety release valve on the 75 tons pressure vessel.\n4. Rupture of the 2 propane loading hose.\n\nAll of the alternative release scenarios resulted in offsite impact.  The alternative scenario that resulted in the largest footprint for anhydrous ammonia release is the rupture of the 2 ammonia loading hose.  The alternative scenario for propane release is represented by the rupture of the 2 propane loading hose.\n\n.\n\nFive Year Accident History\n\nThe five-year accident history involves an examination of the effects of any accidental releases of anhydrous ammonia in the five years prior to the submission of a risk management program.  The five-year accident history covers:\n\n7 The release of ammonia from Agrium's facility.\n7 The release that caused at least one of the following:\n  1. On site deaths, injuries, or significant property damage (40 CFR part 68.42(a))"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 14253,
      "SummaryText": "; or\n  2. Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (40 CFR Part 68.42 (a)).\n\nDuring the last five years, the Friend Terminal has had no releases that caused death, injuries, property damage, or environmental damage either on or off site.\n\n\n\nRelease Prevention Program\n\nAgrium has a Release Prevention Program (RPP) in placed to prevent accidental releases of hazardous materials at this facility.  The RPP include:\n\n7 Process Safety Information (PSI)\n Agrium will develop and keep current working copies of the PSI including information pertaining to the hazards of the process, the technology of the process, and equipment of the process.  All employees are trained in the operation of the entire terminal and all contractors are given training before performing work in the terminal.  The PSI will enable the employees and contractors of Agrium to identify and understand the hazards posed by the process involving anhydrous ammonia.\n \n7 Process Hazard Analysis (PHA)\n Agrium is committed to performing PHA to identify, evaluate, and control hazard associated with the Agrium's operations.  The PHA is to analyze the potential mishaps, identify the mishaps that could occur, analyze the likelihood that mishaps will occur, evaluate the consequence of these mishaps, and analyzed the likelihood that safety systems, mitigation systems, and emergency systems will function properly to eliminate or reduce the consequences of a mishap.\n \n The PHA will be updated at least every five (5) years to assure that the PHA is consistent with the current process  \n \n7 Operating Procedures (OPs)\n Agrium is committed to the development of OPs to assure safe work practices are maintained.  The OPs are reviewed after unsafe work practice occurs.  The unsafe work practice is investigated and the OPs will be revised to reflect the unsafe practices.  The OPs are updated annually.\n \n7 Training\n Agrium is committed to provide its employee's com"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 14253,
      "SummaryText": "Executive Summary\nFriend Terminal\n\nBackground\n\nAgrium U.S. Inc. Friend Terminal stores liquid anhydrous ammonia in a pressure vessel and an aboveground storage tank (AST) within its facility.  The liquid anhydrous ammonia stored in the pressure vessel is pressurized under atmospheric temperature.  The liquid anhydrous ammonia stored in the ASTs is refrigerated under atmospheric pressure.  The pressure vessel has a capacity of 75 tons while the AST can store up to 20,000 tons of refrigerated anhydrous ammonia.\n\nThe Friend Terminal received anhydrous ammonia from pipeline and dispenses to tank trucks for fertilizer application.  The Friend Terminal also dispenses anhydrous ammonia to tank cars for distribution to other Agrium's terminals that do not have direct hookup to pipeline.  All of the ammonia transfer processes are accomplished with ammonia transfer pumps.  The Friend Terminal also stores propane in a pressure vessel for heating purpose.  The capacity of the pressure vessel is 18,000 gallons and the maximum fill level is 85%.  As the result, the maximum amount of propane can be stored in the Friend Terminal is 15,300 gallons.\n\nRationale for Risk Management Program Development and Implementation\n\nThe 1990 Amendments to the Clean Air Act (CAA) require Environmental protection Agency (EPA) to issue a rule specifying the type of actions to be taken by facilities to prevent accidental releases of substances into the atmosphere and reduce their potential impact on the public and the environment.  As the results of the 1990 Amendments, EPA issued the Chemical Accident Prevention Provisions (part 68 of Title 40 of the Code of Federal Regulations (CFR)) that requires affected facilities to develop and implement a risk management program.  The affected facilities include any facilities that handle, manufacture, store, or use above the specified threshold quantities of toxic substances in a process, including ammonia and propane.  The threshold quantities for ammonia a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14253,
      "SummaryText": "nd propane to trigger the development and implementation of a risk management program are 10,000 pounds.\n\nThe risk management program is designed to prevent accidental releases of substances that can cause serious harm to the public and the environment from short-term exposures and to mitigate the severity of releases that does occur. Since Agrium is handling more than 10,000 pounds of ammonia and propane, it is required to develop and implement a risk management program.  The Agrium's risk management program includes an offsite consequence analysis of a potential accidental release, a five-year accident history, a release prevention program, and an emergency response program\n\nOffsite Consequence Analysis\n\nUnder the risk management program, an offsite consequence analysis is required for an accidental release of a regulated source.  In Agrium's case, anhydrous ammonia and propane are the regulated sources.  Modeling of the worst-case scenario and at least one alternative release scenario for each regulated source is required for offsite consequence analyses under this program.\n\nEPA has defined a worst-case release as the release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to a specified endpoint.  The largest quantity is determined taking into account administrative controls that limit the quantity of a substance that can be stored or processed in a vessel or pipe at any one time, or alternatively, procedures that occasionally allow the vessel or pipe to store greater than usual quantities.  EPA defined alternative release scenarios to be any release that is more likely to occur than the worst-case scenarios and that reaches an endpoint offsite.\n\nFor offsite consequence analysis, the movement and dispersion of a regulated source release to the atmosphere is predicted using a computer model.  Agrium uses four (4) different models for this purpose.  The models used are The Fertilizer Inis"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 14253,
      "SummaryText": "prehensive training to assure that the work force can perform their duties safely, efficiently, and effectively.\n \n7 Mechanical Integrity (MI)\n Agrium has developed a written program of maintaining of the MI of process equipment at the Friend Terminal.  The MI program includes pressure vessels and storage tanks, piping systems and ancillary equipment, relief and  vent systems and devices, emergency shutdown systems, controls, and pumps.\n \n7 Incident Investigation\n Agrium has communicated to all of its employees that it is every employee's responsibility to report incidents and near misses to their immediate supervisor.  After an incident is reported, an incident investigation team which includes the employees involved in the incident will initiate an incident investigation.  The leader of the incident investigation team is knowledgeable of the plant and have received formal training in incident investigation.\n \n \n7 Compliance Audit\n A compliance audit of the Agrium facility will be conducted at least every three (3) years to evaluate compliance of Agrium's process with the release prevention program (RPP).  The audit team will include one person knowledgeable in audit skills and techniques and team members with appropriate technical expertise.\n \n7 Management of Change (MOC)\n Agrium's MOC system was developed to ensure that changes at Agrium will not result in undetected unsafe situations and employees will be aware of all changes and their implications.  The Agrium's MOC system includes the following considerations before any changes take place:\n- the authorization requirements for the change.\n- the technical basis for the proposed change\n- the impact of the change on health and safety.\n- the necessary time for the change.\n- required modification to Operating Procedures.\n \n  After changes are made, all employees will be informed about the change and training will be provided to the employees prior to startup of the modified process.  In addition, the PSI and OP will"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 14253,
      "SummaryText": "be updated to reflect the changes made.\n \n7 Pre-Startup Review (PSR)\n When change to the process is significant enough to require a change in safety information under the MOC, Agrium will conduct a PSR.  The PSR Team Leader will develop a checklist and assemble team of key personnel to go over every element on the checklist during the PSR.  All PSR team members will be knowledgeable about the process and trained in the area of change. \n \n7 Contractors\n Agrium has developed and implemented safe work practices to control the entrance, presence and exit of contract employees in the terminal.  It is Agrium's policy to select safe contractors, provide appropriate safety related information to contractors, develop safe work practices related to contractors and periodically evaluate contractors.\n \n Agrium will inform contractors of the known potential fire explosion, or toxic release hazards related to the contractors work and the process.  Agrium will also explain to contractor the applicable provisions of Agrium's emergency response plan.\n \n7 Employee Participation\n Agrium is committed to involving employees and their representatives on the conduct and development of PHA and on the development of the other elements of plant safety, process safety management, and risk management planning.  Agrium encourages employees to read, review and provide comments on all PSM/RMP documents.\n \n7 Hot Work Permits\n Hot work is defined as work that could generate a flame, intense heat, or sparks as a result of electric or gas welding, cutting, blazing, abrasions or similar operations.  A permit is required when hot work is to be conducted in the terminal.\n\nAgrium is committed to the implementation of the RPP to ensure safe operations of its plant and to prevent accident. \n\nEmergency Response Program\n\nAgrium has an Emergency Response Program (ERP) in place to respond to releases of hazardous material at this facility.  All Agrium employees are part of the emergency response team together"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 14253,
      "SummaryText": "with the local fire department and LEPC.  All Agrium employees received 24 hours training at the Hazardous Materials Technician level and continue to receive 8-hour update training class annually.  They are trained in emergency response procedures, first aid and CPR.  They will be responsible for responding to all releases and performing first aid duties at the immediate scene of a release.\n\nAgrium is working closely with the local fire department and LEPC in responding to emergency.  Agrium also keeps the fire department informed of any new hazardous materials that are introduced into the workplace.  The other outside agencies that will be involved in responding to emergencies at Agrium include the County Sheriff, Highway Patrol, local hospital, and outside contractors that are needed for such operations as containment, cleanup, material handling, etc.\n\nAll reportable releases of hazardous material will be reported immediately to the National Response Center, State Emergency response Commission, and the Local emergency Planning Committee."
    }
  ]
}