{
  "FacilityID": 14258,
  "FacilityName": "Russer Foods",
  "FacilityStr1": "665 Perry Street",
  "FacilityStr2": null,
  "FacilityCity": "Buffalo",
  "FacilityState": "NY",
  "FacilityZipCode": "14210",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36029",
  "LEPC": "Erie County Emergency Services",
  "FacilityLatDecDegs": "42.871389",
  "FacilityLongDecDegs": "-78.851944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 49169147,
  "ParentCompanyName": "Foodbrands America",
  "Company2Name": "IBP, Inc.",
  "CompanyDUNS": 5569397,
  "Company2DUNS": 7296056,
  "OperatorName": "Russer Foods",
  "OperatorStr1": "665 Perry Street",
  "OperatorStr2": null,
  "OperatorCity": "Buffalo",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14210",
  "OperatorZipCodeExt": null,
  "RMPContact": "Viren Sitwala",
  "RMPTitle": "Director of Operations",
  "FTE": 400,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000151131",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-15 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-04-13 00:00:00",
  "DeRegistrationEffectiveDate": "2015-04-10 00:00:00",
  "AnniversaryDate": "2004-06-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.87151,
  "FRS_Long": -78.85253,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19521,
      "AltID": "Refrigeration System",
      "FacilityID": 14258,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 20021,
          "ProcessID": 19521,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 24693,
          "ProcessID": 19521,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 524693,
          "ProcessID": 19521,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14258,
      "SummaryText": "RUSSER FOODS\nBUFFALO, NEW YORK\n\nBackground Data\n\nIn accordance with Title 40 of the Code of Federal Regulations Chapter 68 (40 CFR 68) promulgated by the Environmental Protection Agency (EPA), Russer Foods submits this Risk Management Plan (RMP) for operations at their Buffalo, New York facility.  The operations at Russer Foods include the processing of meat products for public consumption, packaged under the familiar Russer Foods brand name.  Russer Foods has been in operation at this facility for over 30 years, providing quality meat products and over 400 jobs to the local community.\n\n\nAccidental Release Prevention and Emergency Response Policy\n\nRusser Foods is committed to protecting the health of its employees, the surrounding community, and the environment.  It is Russer Foods' policy to maintain a safe and healthy workplace, protect the environment, and comply with all applicable regulations, including 40 CFR 68 and the Occupational Safety and Health Administration's (OSHA's) Process Safety Management (PSM) regulation, 29 CFR 1910.119.  \n\n\nStationary Sources and Regulated Substances\n\nTo ensure the quality of Russer Foods' products, refrigeration is necessary to maintain the low temperatures required for the food processing and storage areas of the plant.  These requirements are promulgated and monitored by the United States Department of Agriculture (USDA).  In addition, the refrigeration system is utilized to operate a spiral freezer for product preparation and large coolers for product storage.  To achieve this, Russer Foods uses anhydrous ammonia, a 112(r) regulated substance, as the refrigerant in the cooling system.  The ammonia refrigeration system maintains the 180,000 sq. ft. facility within the required range of operating temperatures and provides the cooling necessary to process and store products.  Anhydrous ammonia is a standard refrigerant for the food industries and widely used throughout the country.  \n\nThe refrigeration system at Russer Foods c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14258,
      "SummaryText": "onsists of receiver vessels, compressors, evaporators, condensers, and piping.  At the time of this Risk Management Plan filing, the system can contain a maximum of approximately 9,700 pounds of ammonia at any time during the course of the year.  However, new production equipment to expand Russer Foods' line of products, will require the addition of ammonia to the refrigeration system.  It is anticipated, based on project schedules at the time of filing this RM Plan, that ammonia could be added to the system as early as the week of June 28, 1999.  Engineering calculations and system operations experience estimate the system will contain a maximum total of approximately 15,000 pounds of ammonia after the addition.   Russer Foods' Risk Management Program, including the release scenarios and consequence modeling, is based upon the post-expansion system conditions and increased ammonia inventory.\n\n \nWorst-Case Release Scenario\n\nAs required by 40 CFR 68 Subpart B, Russer Foods has evaluated a worst-case release scenario for anhydrous ammonia using the parameters specified by the EPA.  The worst-case release scenario is defined as the release, over a 10-minute period, of the entire contents of the largest vessel or pipe in the system.  Based on the design of Russer Foods' refrigeration system, the worst-case release scenario is the rupture of the High Pressure Receiver, which is the largest single vessel in the system.  The High Pressure Receiver can contain approximately 6,640 pounds of ammonia when filled to 75% capacity, which is the maximum fill capacity allowed by Russer Foods.  The High Pressure Receiver, like all other major vessels in the system, is located inside the building in the facility's compressor room.  While this room is ordinarily isolated from the outside environment, it was assumed to be in direct contact with the outside air for the purposes of the worst-case release scenario.  It was assumed that an exterior door, which is normally closed, was open "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14258,
      "SummaryText": "allowing the building to provide only partial passive mitigation of the release.  Using the EPA's RMP*Comp computer program, the maximum distance to the specified \"endpoint\" was calculated.  This is a conservative distance, established by the EPA, at which it is expected that a person could be exposed to the chemical for an hour without suffering irreversible health effects.  The distance to the endpoint, calculated for the worst-case release scenario, includes offsite receptors.\n\nThe worst-case release scenario was developed following EPA regulations and is not considered by Russer Foods to be a likely release scenario for the facility.  During normal operations, Russer Foods maintains the High Pressure Receiver at no more than 30% capacity.  The receiver would only have the potential to be filled to 75% of capacity during a pump-down operation.  The High Pressure Receiver is only operated in pump-down mode potentially two times during the course of a year.  \n\n\nAlternative Release Scenario\n\nA more realistic release scenario (alternative release) was developed by Russer Foods taking into consideration the 30-year history of operations and the hazards identified in the process hazard analysis (PHA) conducted to ensure that Russer Foods hazards are identified and minimized.  The analysis was conducted in accordance with OSHA's Process Safety Management regulations contained in 29 CFR 1910.119.  The alternate release scenario identified by Russer Foods involves damaging a = inch diameter pipe containing high-pressure liquid ammonia.  Piping routed to, or installed on, equipment located outside the buildings was considered.  Since all of the ammonia-containing equipment located outside of the buildings at Russer Foods is installed on the roofs of the buildings, this would be a roof level release.  However, to be conservative, the release was considered to have occurred at the ground level.  In developing the release parameters of this alternative scenario, Russer Foods "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14258,
      "SummaryText": "considered piping and equipment located in areas where personnel foot traffic and work-related activities were likely to occur.  Other considerations include a full flow liquid release from the leaking pipe and a conservative estimate of the response time necessary to control the release. \n\nUsing the equations in Chapter 4 of the EPA's RMP Guidance for Ammonia Refrigeration and the RMP*Comp computer program, the maximum distance to the specified \"endpoint\" was calculated.  This is a conservative distance, established by the EPA, at which it is expected that a person could be exposed to the chemical for an hour without suffering irreversible health effects.  The distance to the endpoint, calculated for the alternate case release scenario, includes offsite receptors.\n \nAccidental Release Prevention Program\n\nTo prevent and mitigate accidental releases of anhydrous ammonia, Russer Foods has implemented several precautionary measures including process and equipment controls, operating procedures, preventive-maintenance programs, employee training, and audit programs.  In addition, the ammonia refrigeration system itself is designed and constructed in accordance with ANSI/IIAR 2-1992 Standard for Equipment, Design, And Installation of Ammonia Mechanical Refrigerating Systems. \n\nRusser Foods has also developed and implemented a PSM program pursuant to OSHA regulations and as such, has evaluated the refrigeration system for the potential to release anhydrous ammonia.  Some of the controls installed to prevent catastrophic releases of ammonia include process equipment (pressure relief valves, check valves, backup pumps, and manual shutoffs), automated controls (automatic shutoffs, ammonia leak detection system, and electrical distribution system grounding) and emergency power supply. \n\nRusser Foods has developed standard operating procedures for all employees and contractors that have contact with the ammonia refrigeration system.  These procedures incorporate safety measure"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 14258,
      "SummaryText": "s to prevent employee injury, equipment damage, and accidental releases.  The procedures were developed by a team consisting of personnel from operations and maintenance, plant engineering, and Russer Foods' refrigeration contractor.  Pursuant to written management of change procedures established by Russer Foods, any changes to the operating procedures are to be communicated to affected employees.\n\nRusser Foods understands that maintaining the refrigeration system in good working order is essential to preventing accidental releases; therefore Russer Foods has implemented a preventative maintenance program.  The preventative maintenance program is scheduled, documented and managed to ensure that regular maintenance occurs on the system.  Also, to ensure the mechanical integrity of critical refrigeration system components, inspections including vibration analysis and ultrasonic testing are performed.\n\nTo ensure that the control measures at Russer Foods are effective in maintaining the safe operation of the plant, regularly scheduled audits are performed on the ammonia refrigeration system:\n\n7 In accordance with the PSM program, Russer Foods conducts detailed PSM compliance audits every three years.  Each audit incorporates review of process safety information, process hazard analysis, operating procedures, training programs, system mechanical integrity, management of change, pre-start up safety review procedures, compliance audit procedures, incident investigation procedures, employee participation programs, hot work permit procedures, and contractor safety procedures.\n \n7 In addition, Russer Foods' insurance carrier also conducts independent audits every year.\n \n \nFive-Year Accident History\n \nOver the last five years, Russer Foods has not experienced an accidental off-site release of anhydrous ammonia from the ammonia refrigeration system.\n \n  \nEmergency Response Program\n \nThe Russer Foods facilities are included in the written community emergency response plan deve"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 14258,
      "SummaryText": "loped by Erie County Emergency Services.  In addition, Russer Foods has developed an emergency action program designed to protect both employees and the community in the event of an ammonia release, fire, or other emergency.  This program is fully described in a document entitled FACILITY RESPONSE PROCEDURE FOR RUSSER FOODS.  Included in the document are measures to be taken by Russer Foods including emergency notifications and evacuation procedures. \n \nRusser Foods has also arranged for emergency response assistance with a local refrigeration contractor knowledgeable in the facility layout and the design and operation of the ammonia refrigeration system.\n \nIn the event of an anhydrous ammonia release with off-site effects, the general public will be warned using the following methods:\n \n7 Police and fire vehicles equipped with public address systems,\n\n7 Door-to-door notification of residents, and\n\n7 Broadcast message via the Erie County Emergency Broadcast System, if necessary.\n\n\nContinuing Efforts to Improve Safety\n\nAs part of Russer Foods' continuous efforts to improve the performance of its safety systems, several changes are planned at the facility to improve safety and prevent anhydrous ammonia releases.  These changes are scheduled to be implemented by the first quarter of calendar year 2000 and include equipment upgrades, additional preventive maintenance procedures, and additional safety systems."
    }
  ]
}