{
  "FacilityID": 14388,
  "FacilityName": "Harbor Cogeneration Company Wilmington Plant",
  "FacilityStr1": "420 Henry Ford Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Wilmington",
  "FacilityState": "CA",
  "FacilityZipCode": "90748",
  "Facility4DigitZipExt": "1317",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.778056",
  "FacilityLongDecDegs": "-118.228278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.edisonx.com",
  "FacilityEmailAddress": "Tony_Blakemore@edisonmission.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Edison Mission Operation and Maintenance",
  "Company2Name": "Edison Mission Energy",
  "CompanyDUNS": 0,
  "Company2DUNS": 154272918,
  "OperatorName": "Harbor Cogeneration Company",
  "OperatorStr1": "P.O. Box 550",
  "OperatorStr2": null,
  "OperatorCity": "Wilmington",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90748",
  "OperatorZipCodeExt": "0550",
  "FTE": 7,
  "OtherEPAFacilityID": "N/A",
  "EPAFacilityID": "100000151088",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "106325",
  "SafetyInspectionDate": "1999-03-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-26 00:00:00",
  "ErrorReportDate": "1999-07-26 00:00:00",
  "ReceiptDate": "1999-06-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-24 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2000-02-08 00:00:00",
  "DeRegistrationEffectiveDate": "1999-11-18 00:00:00",
  "AnniversaryDate": "2004-06-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.77397,
  "FRS_Long": -118.23999,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19693,
      "AltID": "Ammonia System",
      "FacilityID": 14388,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 24903,
          "ProcessID": 19693,
          "ChemicalID": 56,
          "Quantity": 81889.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 20199,
          "ProcessID": 19693,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 10541,
              "Process_NAICS_ID": 20199,
              "SafetyReviewDate": "1999-03-02 00:00:00",
              "PHA_Date": "1995-09-15 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-09-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-01 00:00:00",
              "TrainingReviewDate": "1999-02-04 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-02 00:00:00",
              "EquipmentInspectionDate": "1998-10-05 00:00:00",
              "EquipmentTested": "Ammonia Storage Vessel",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-02-04 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-01-11 00:00:00",
              "AuditCompletionDate": "1999-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1994-05-11 00:00:00",
              "HotWorkPermitReviewDate": "1995-02-02 00:00:00",
              "ContractorSafetyReviewDate": "1999-02-04 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "The Ammonia Distribution System is designed to safely store anhydrous ammonia and supply ammonia vapors (mixed with air) to the turbine exhaust, and then through a catalyst, in order to nearly eliminate potentially harmful pollutants from the HCC Wilmington Plant's exhaust.  The Prevention Program at the HCC Wilmington Plant is a mature program that originated through the Company's interest in the health and safety of employees and the Community, as well as the environment.  The HCC Wilmington Plan has been diligently applying key Accidental Release Prevention Program elements since the inception of its Risk Management and Prevention Program (RMPP) (1988 facility start-up), and more recently via the implementation of the Process Safety Management (PSM) Standard.  All of the Prevention Program elements were inspected during the preparation of this RMP Submittal.",
              "_chemicals": [
                {
                  "PrimaryKey": 14867,
                  "PreventionProgram3ID": 10541,
                  "ProcessChemicalID": 24903
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 14388,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-05-27 00:00:00",
    "ERTrainingDate": "1999-09-01 00:00:00",
    "CoordinatingAgencyName": "Los Angeles City Fire Department",
    "CoordinatingAgencyPhone": "2134858658",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14388,
      "SummaryText": "RISK MANAGEMENT PLAN - HARBOR COGENERATION COMPANY - WILMINGTON PLANT - AMMONIA DISTRIBUTION SYSTEM\n\nHarbor Cogeneration Company (HCC) has established a risk management plan according to EPA's Risk Management Program regulation (40 CFR Part 68) to enhance already existing safety and emergency response programs.  HCC is extremely diligent in the handling of all chemicals and is very diligent about the safety of its employees and the neighboring Community.  HCC staff is highly trained and utilizes modern equipment to monitor its facility to provide safeguards, while effectively and safely using anhydrous ammonia for pollution control.  Ammonia plays a key role in nearly eliminating potentially harmful pollutants from the HCC Wilmington Plant turbine exhaust.\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe HCC Wilmington Plant has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of the Wilmington Plant processes.  HCC's policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.\n\nAn Emergency Action Plan for the Ammonia Distribution System has been in-place since initial operation to handle potential emergency situations at the facility.  Various reviews and updates have occurred throughout the life of the facility as part of Harbor Cogeneration Company's diligent interest in the protection of personnel and the Community, as well as regulatory requirements such as PSM and RMPP.  The May 27, 1999 (Rev. 7) Emergency Action Plan represents an evolution of previous revisions, is complete, is current, and meets or exceeds key regulatory requirements.  This plan was designed to meet the following objectives:\n\n1) To save lives\n2) To minimize and avoid injuries\n3) To protect the environment\n4) To minimize property damage\n\nKe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14388,
      "SummaryText": "y elements of the Emergency Action Plan include:\n\n - Identification of emergency response duties\n - Clear identification of emergency response goals and objectives \n - An Emergency Action Guide\n - Key phone numbers and contact points for Municipal and Mutual Aid Emergency Response\n - Incident Command System (ICS) definition\n - Vicinity maps with emergency mitigation equipment identified\n - Detailed task-by-task plans for:\n     - Injury and Illness\n     - Natural Disasters (Earthquake)\n     - Bomb Threat\n     - Fire\n     - Off-Site Emergency \n     - Hazardous Material Release (e.g., ammonia, sulfuric acid/caustic soda, other materials)\n     - Civil Disturbance\n     - Intrusion\n\nThe Wilmington Plant does not have a designated emergency response team; however, Los Angeles City Fire Department specialists are trained and fully equipped to respond to hazardous material releases.  The Wilmington Plant Emergency Preparedness Coordinator maintains the Emergency Action Plan for the facility.\n\nThe Emergency Action Plan provides the response protocols and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which have been implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year to ensure compliance with PSM, RMP, and CalARP regulations.\n\n\nStationary Source and Regulated Substance\n\nAlthough at the time of this CalARP/RMP Submittal, the oil field is shut-in, the Harbor Cogeneration Company Wilmington Plant is designed to support thermally enhanced oil recovery operations by cogenerating electricity and steam, using natural gas and refinery gas to fire a turbine and other auxiliary equipment.  Electricity is supplied to the utility grid, and as needed, steam may be injected into local oil producing reservoirs to enhance the recovery of heavy oil.\n\nThe exhaust gas from the cogeneration unit contains oxides of nitrogen (NOx).  The emissions are redu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14388,
      "SummaryText": "ced to authorized levels by mixing the turbine exhaust gas with small amounts of ammonia and passing them over a catalyst.  The Selective Catalytic Reduction (SCR) process involves NOx and ammonia (NH3) reacting to form nitrogen (N2) and water vapor (H2O).  Thus, the primary purpose of the ammonia is to contribute to the reduction of air pollution in the Los Angeles Basin.\n\nAnhydrous ammonia is stored on-site in a 15,000 gallon pressurized storage vessel (22' 6\" long by 10' 0\" diameter).  Ammonia vapor is withdrawn from the top of the vessel at a rate of ~84 lb/hr.  It is then mixed with air and diluted to a concentration of less than 2% by volume before being fed into the turbine exhaust and then over the catalyst.  A small electric vaporizer adjacent to the storage vessel ensures that the pressure in the vessel is kept in the range of 120-125 psig.  The storage vessel is designed for a pressure of 265 psig at 250F, well in excess of the normal operating pressure and temperature.\n\nWhen the plant is continuously operating, the storage vessel is filled 15-20 times per year via delivery truck.\n\n\nHazard Assessment Summary\n\nWorst-Case Release Scenario Results Summary\nScenario Description: Release of the maximum quantity of anhydrous ammonia that can be stored in the largest equipment item (the Ammonia Storage Vessel) - 81,889 pounds in 10 minutes.  Although there are numerous controls to prevent such a release and to manage its consequences, the Ammonia Storage Vessel is located outside, and no credit for administrative controls or passive mitigation features was taken for the worst-case release scenario.  The most pessimistic meteorological conditions were used, as specified by regulation.  The SLAB Dispersion Modeling software was used to determine the maximum downwind endpoint distance to 200 ppm.  The result shows that off-site areas may be affected.\n\nAlternative Release Scenario Results Summary\nScenario Description: A release of anhydous ammonia liquid as a result "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14388,
      "SummaryText": "of a gasket rupture (0.098 sq. in.) for 60 minutes.  For this alternative release scenario, the total quantity of ammonia calculated to be released is 12,240 pounds.  Since water deluge and firewater monitors can be readily applied to any potential accidental release of ammonia, the resultant endpoint distance would be expected to be limited to within the perimeter of the Wilmington Plant.  Therefore, these practical, active mitigation features are not credited.  Excess flow valves were credited for reducing endpoint distance.\n\nThe meteorological conditions specified by regulation for alternative release scenarios were used, except for wind speed (5.32 m/s determined from a site-specific meteorological evaluation performed for the 1992 RMPP).  The SLAB Dispersion Modeling software was used to determine the maximum downwind endpoint distance to 200 ppm.  The downwind distance for this alternative release scenario is significantly less than that for the worst-case scenario.  Although off-site areas may also be affected for this alternative release scenario, the maximum endpoint distance for this alternative release scenario is just beyond the Harbor Cogeneration Company perimeter.\n\nRisk Considerations\nAlthough the storage and use of anhydrous ammonia has inherent potential risks, and worst-case release scenarios can potentially reach the Community; the Harbor Cogeneration Company Wilmington Plant has recognized these potential risks and structured its safety programs to make this type of event non-credible.  In addition to the safety practices of the Company and plant personnel to make this worst-case event non-credible, it should also be recognized that there are inherent analysis assumptions that make the results of the atmospheric dispersion analyses appear worse than what would actually be expected during such an event (e.g., In the event of a release, sudden rupture and flashing of ammonia would be highly turbulent.  Turbulence causes entrainment of air and the r"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 14388,
      "SummaryText": "eleased vapor dilutes much more quickly).\n\nIn addition to the use of conservative analysis assumptions that overpredict the effects of a potential release, other characteristics of the facility and site serve to minimize the potential risks associated with an ammonia release:\n - The HCC Wilmington Plant site is in a large industrial complex and relatively distant from populated neighborhoods or other potentially sensitive receptors.\n - The prevalent wind direction is not directly toward any potentially sensitive receptors.\n - The Ammonia Storage Vessel makes use of excess flow valves to minimize the amount of a potential release.\n - Firewater systems, firewater monitors, and Ammonia Storage Vessel spray systems; provide a significant capability to emergency responders to scrub ammonia vapors from the air should there be a release.\n - Valves to permit isolation of the process exist.\n - Diking to provide containment for liquid releases exists.\n - Personal Protective Equipment (PPE) (e.g., protective clothing, self-contained breathing apparatus) is used by plant personnel.\n - The history of the HCC Wilmington Plant (i.e., no RMP-applicable ammonia releases) reflects the adequacy of the design and diligence of the plant staff in safely operating the Ammonia Distribution System.\n\n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nHCC has an existing Process Safety Management program to safely manage the handling of ammonia.  In addition, common industry standards, policies, and procedures are utilized to ensure safe practices are being performed.  The PSM Program was inspected (during the course of the preparation of this RMP Submittal) and was found to meet or exceed regulatory requirements, as well as reflect a spirit of interest in the health and safety of employees and the Community, as well as for the environment.\n\nThe HCC Wilmington Plant has been diligently applying key Accidental Release Prevention Program elements since the inception "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 14388,
      "SummaryText": "of its Risk Management and Prevention Program (1988 facility start-up), and more recently via the implementation of the Process Safety Management (PSM) Standard.  All of the Prevention Program elements:\n - Process Safety Information\n - Process Hazard Analysis\n - Operating Procedures\n - Training\n - Mechanical Integrity\n - Management of Change\n - Pre-Startup Review\n - Compliance Audits\n - Incident Investigation\n - Employee Participation\n - Hot Work Permit\n - Contractors\n - Emergency Response\nwere inspected during the preparation of this RMP Submittal.\n\n\nFive-Year Accident History\n\nThere have been no RMP-applicable releases of ammonia at the Harbor Cogeneration Company Wilmington Plant in the past five years.\n\n\nEmergency Response Program\n\nSee above discussion in \"Accidental Release Prevention and Emergency Response Policies\".\n\n\nPlanned Changes to Improve Safety\n\nSeveral studies have been conducted over the years to examine mitigation measures to improve safety at the Harbor Cogeneration Company Wilmington Plant.  These studies include the following: Risk Management and Prevention Program (RMPP), Process Safety Management (PSM), Process Hazard Analysis (PHA), Seismic Assessment, Hazard Assessment, RMPP Compliance Audits, and PSM Compliance Audits.  The recommendations from these previous studies have been implemented.  Some minor additional recommendations precipitated from the preparation of this RMP Submittal.  These additional recommendations will be addressed by December 31, 1999."
    }
  ]
}