{
  "FacilityID": 14437,
  "FacilityName": "Durham Co Triangle Wastewater Treatment Facility",
  "FacilityStr1": "NC Highway 55 East",
  "FacilityStr2": "Alexander Drive",
  "FacilityCity": "Durham",
  "FacilityState": "NC",
  "FacilityZipCode": "27713",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37063",
  "LEPC": "Durham County LEPC",
  "FacilityLatDecDegs": "35.878056",
  "FacilityLongDecDegs": "-78.898611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "OT",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Durham County, Engineering Dept.",
  "OperatorStr1": "120 East Parrish Street, Suite 110",
  "OperatorStr2": null,
  "OperatorCity": "Durham",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27701",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": "NC0026051",
  "EPAFacilityID": "100000152176",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-10 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-29 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-25 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-06-25 00:00:00",
  "DeRegistrationEffectiveDate": "2003-05-01 00:00:00",
  "AnniversaryDate": "2004-06-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.878056,
  "FRS_Long": -78.898611,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19745,
      "AltID": "Chlorine Disinfection",
      "FacilityID": 14437,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 24980,
          "ProcessID": 19745,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 20252,
          "ProcessID": 19745,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 10569,
              "Process_NAICS_ID": 20252,
              "SafetyReviewDate": "1999-04-08 00:00:00",
              "PHA_Date": "1999-04-08 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-08-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-28 00:00:00",
              "TrainingReviewDate": "1999-05-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-15 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "detectors, chlorinators, switchover valves",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-15 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-28 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-28 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-15 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-28 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 14918,
                  "PreventionProgram3ID": 10569,
                  "ProcessChemicalID": 24980
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 14437,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-27 00:00:00",
    "ERTrainingDate": "1999-02-10 00:00:00",
    "CoordinatingAgencyName": "Durham CO. Emerg. Managment Agency",
    "CoordinatingAgencyPhone": "9195600660",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "29CFR1910.1200;",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14437,
      "SummaryText": "Risk Management Plan\nExecutive Summary \nDurham County - Triangle Wastewater Treatment Plant\n\nDurham, North Carolina\n\n\nI.0 Executive Summary\n\nA. Accidental Release Prevention and Emergency Response Policies \n\nDurham County is committed to operating its Triangle Wastewater Treatment Plant (Triangle WWTP) located on the corner of NC Highway 55 East and Alexander Drive in Durham County, Durham, North Carolina in an environmentally responsible manner, and is committed to providing a safe place for the Triangle WWTP employees and the surrounding community.  As part of this commitment to environmental stewardship and worker safety, Durham County and their contract operator of the Triangle WWTP have developed and implemented numerous environmental and safety programs that are designed to eliminate and/or drastically reduce the potential for accidental releases.  Durham County and their contract operator have also developed and implemented a number of programs that are designed to ensure that if an accidental release occurs, it will be handled in a manner that minimizes adverse impact to people, the environment and the plant.\n\nDurham County and their contract operator view accident prevention, and personnel and environmental protection as a continuous process.  Consequently, Durham County and their contract operator continuously strive to improve its accident prevention, environmental protection and emergency response programs.  A recent addition to Durham County and their contract operator's overall accident prevention and response program is the development of its Risk Management Program (RMP).  Durham County and their contract operator's RMP complies with the U.S. Environmental Protection Agency's (EPA's) Chemical Accident Prevention rule found at 40 C.F.R. Part 68.  One of the requirements of this rule is to submit a Risk Management Plan.  This document is Durham County and their contract operator's RMP plan and provides the public with information about Durham County an"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14437,
      "SummaryText": "d their contract operator's processes, accident prevention programs and emergency response planning efforts.   Durham County and their contract operator's compliance with EPA's RMP rule includes:\n\n1. Completion of a hazard assessment in compliance with 40 C.F.R. Part 68, Subpart B, including the five-year accidental release history-Durham County and their contract operator have never experienced an RMP reportable release or accident at its Triangle WWTP.\n2. Implementation of a accident prevention program.  The plant's RMP accident prevention program is coordinated with the plant's Process Safety Management (PSM) program which was developed under similar rules administered by the Occupational Safety and Health Administration (OSHA);\n3. Implementation of an emergency response program.  As recommended in the RMP rule and by numerous federal response entities, the plant has developed a single response plan that is designed to meet the emergency response planning requirements, applicable to the plant under a number of applicable state and federal emergency response planning laws. \n\nAdditional information regarding how Durham County and their contract operator addresses each of the requirements is provided below and in the attached RMP plan.\n\nWhile the RMP program at Triangle WWTP helps ensure that the facility is maintained and operated in a safe and environmentally responsible manner, it is just one component of Triangle WWTP's comprehensive safety and environmental programs.  Additional components that are beyond the scope of the RMP include, but are not limited to: regular employee/contractor safety training, periodic table-top safety and emergency response drills, acquisition and maintenance of emergency response and personnel protective equipment, development of safe work practices (confined space, lockout/tagout, hot work), implementation of safe work procedures, new project safety review procedures, preventive maintenance and regular inspections of all tanks and e"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14437,
      "SummaryText": "quipment that contain hazardous chemicals, chemical control and purchasing procedures, emergency response training, contractor certification, etc. \n\nThe plant and all equipment is designed and operated to minimize the possibility of an accidental release.  At a minimum, the plant and equipment meet government and industry design and construction standards.\n\nThe following most recent process changes and safety initiatives demonstrate Durham County and their contract operator's commitment to environmental stewardship and providing a safe workplace:\n\n1.  In 1995, the chlorine feed system was equipped with cylinder mounted vacuum operated automatic switchover valves. These valves eliminate the need for a pressurized whip assembly (which often is the source of breaks and leaks) and enable the entire chlorine gas delivery system to be operated under a vacuum.\n \n2.  In 1998 and 1999, Durham County and their contract operator developed an Integrated Contingency Plan (ICP).  The ICP is designed to provide more-effective emergency response guidance and to comply with a number of state and federal laws.\n\n3.  Currently, the facility is planning a major upgrade that will eliminate the use of chlorine gas for disinfection.  Safer alternative disinfection methods are being evaluated.\n\n \nB.  RMP Covered Stationary Source and Regulated Substance\n\nDurham County owns and contracts the operation of the Triangle WWTP in Durham County, North Carolina.  The plant treats wastewater from the Research Triangle Park area and Durham County.  The only chemical present at the plant in sufficient quantity to be regulated by the chemical accident prevention rule is chlorine.  Chlorine is used to disinfect the wastewater before it is discharged into Northeast Creek pursuant to the Clean Water Act permit.\n\nChlorine is stored in 2,000 lb. tanks on the chlorine storage pad and scale area.  The chlorinator room is equipped with a chlorine detector that sounds an alarm in the event of an accidental rele"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14437,
      "SummaryText": "ase of chlorine.  Vacuum operated cylinder valves have also been installed to seal off the 2,000 lb. tank in the event of a loss of vacuum due to a pipe break, etc.\n\nThe total maximum amount of chlorine stored on-site is 12,000 lbs. (6 tanks).  The maximum amount of chlorine used at any one time in the chlorination process is 2,000 lbs.\n\nC. Off-site Consequence Analysis\n\nAs required by the RMP rule, Durham County and their contract operator's off-site consequence analysis included evaluation of a worst-case accidental release for all toxic chemicals and an alternative release for each covered chemical.\n\nA worst-case release is defined by EPA as \"a release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to an endpoint defined in ' 68.22.\"  40 C.F.R. ' 68.3.   EPA requires the worst-case accidental release to be modeled using highly conservative meteorological data designed to result in the maximum possible adverse impact.  For example, EPA requires worst-case models to be based on the hottest day of the year, occurring at night with a very slow, steady wind which would not disperse a release very effectively. Further, the model assumes that the entire contents of the largest vessel is released instantaneously.  According to the Chlorine Institute, no 2,000 lb. chlorine tank has ever released its contents in ten minutes.  Accordingly, the probability of a 2,000 lb. tank of chlorine instantaneously releasing its contents in North Carolina on a 990F night when the wind is blowing at 3.4 miles per hour is extremely low.\n\n\nUsing the EPA mandated criteria described above, the worst-case release at the plant (for purposes of RMP) would involve a complete failure of a 2,000 lb. chlorine tanks, filled to maximum capacity.  If such a release occurred, it would result in a vapor cloud that could impact persons outside of the plant's property line.\n\nDurham County and their contract operator developed al"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 14437,
      "SummaryText": "ternative releases of chlorine that focus on more realistic release scenarios occurring during more common meteorological conditions.  However, EPA requires modeling of a release which could impact off-site locations. After considering all criteria in the RMP rule, the Process Hazard Analysis performed on the chlorination process, and all past releases, Durham County and their contract operator have chosen an alternative release for chlorine.  The alternate scenario involves a cylinder valve becoming stuck in the open position and being broken or disconnected from the vacuum operated valve.\n\nThe alternative release scenario for chlorine is based on a leak from a 5/16\" valve in one chlorine tank.  Chlorine would exit from such a leak as a gas because only gas is withdrawn from the tanks for disinfection.  The chlorine gas would then migrate based on meteorological conditions.  Durham County and their contract operator have never had a leak in any of the chlorine tanks in the past.  However, because cylinder mounted vacuum operated valves prevent a release resulting from a whip assembly failure or broken pipe, the valve leak appeared to be the most likely scenario.\n\nD. Accident Release Prevention Program\n\nDurham County and their contract operator have developed an accidental release prevention program that is designed and implemented to drastically reduce the possibility of an accidental catastrophic release.   The program complies with the requirements of OSHA's Process Safety Management rule found at 29 C.F.R. Part 1910.119 and is analogous to RMP requirements found at 40 C.F.R. Part 68, Subpart D.  The program has been very successful as evidenced by the fact that the plant has never experienced an accidental release that requires reporting under EPA's RMP rule.  See 40 C.F.R. ' 68.42.  To comply with the RMP rule, the plant's existing PSM program has been modified to incorporate an additional focus-protection of the public.\n\nThe basic elements of Durham County and"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 14437,
      "SummaryText": "their contract operator's prevention program are described below:\n\n1.  Employee Participation. Durham County and their contract operator have developed and implemented a written plan of action regarding employee participation in the safety and accident prevention process.  The plan describes how employees are:  (A)  consulted and what input they will have in the development of process hazard analysis (PHA) and other PSM and RMP safety elements; and (B) given access to PSM and RMP information at the plant.\n\n2.  Process Safety Information. Durham County and their contract operator have compiled written process safety information which helped identify the hazards posed by chlorine, handling of materials, management, storage activities and the chlorination process in general.  The compilation of process safety information provided the foundation for understanding the hazards involved in the wastewater process and was crucial to the development of a complete and thorough process hazard analyses (discussed in subsection 3 immediately below).  The required process safety information includes information pertaining to the hazardous chemicals (e.g. chlorine), the technology of the process, and the process equipment.   29 C.F.R. ' 1910.119(d). \n\nThe type of information pertaining to the technology of the process includes: (1) block flow diagrams; (2) process chemistry; (3) maximum intended inventory; (4) safe upper and lower limits for temperature, pressure, flow and composition; and (5) an evaluation of the consequences of deviations, including those affecting the safety and health of employees and the nearby public.\n\nThe equipment information includes: (1) materials of construction; (2) piping and instrument diagrams (P&IDs); (3) electrical classification; (4) relief system design and design basis; (5) ventilation system design; (6) design codes and standards employed; and (7) material and energy balances for processes built after May 26, 1992.\n\n3.  Process Hazard Analyses"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 14437,
      "SummaryText": ".  Durham County and their contract operator performed its most recent process hazard analysis (PHA) on the chlorination system in April 1999.  The PHA is a key component of the PSM system and Durham County and their contract operator's RMP accident prevention program.  It provides a thorough, orderly, systematic approach for identifying, evaluating, and controlling hazards posed by the chlorination process.  The PHA utilized the what-if/PHA methodology in accordance with 29 C.F.R. ' 1910.119(e) and 40 C.F.R. ' 68.67.  \n\nThe PHA addressed: (1) hazards of the process; (2) engineering and administrative controls applicable to the hazards and their interrelationships such as appropriate application of detection methodologies to provide early warning of releases (e.g., process monitoring and control instrumentation with alarms); (3) consequences of failure of engineering and administrative controls; (4) facility siting; (5) human factors (human error); and (6) a qualitative evaluation of a range of the possible safety and health effects of failure of controls on the employees in the work place.\n\n4.  Operating Procedures.  Durham County and their contract operator have developed and implemented written operating procedures that provide clear instructions for safely conducting activities involved in the chlorination process.  These procedures are consistent with the process safety information described in subtask 2, above, and cover:\n\nA.  Initial startup;\nB.  Normal operations;\nC.  Temporary operations;\nD.  Emergency shutdown including the conditions under which emergency shutdown is required, and the assignment of shutdown responsibility to qualified operators to ensure that emergency shutdown is executed in a safe and timely manner;\nE.  Emergency Operations;\nF.  Normal shutdown; \nG.  Startup following a turnaround, or after an emergency shutdown;\nH.  Consequences of deviation from operating limits;\nI.  Steps required to correct and/or to avoid deviation;\nJ.  Precautions"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 14437,
      "SummaryText": "necessary to prevent exposure, including engineering controls administrative controls, and personal protective equipment;\nK.  Control measures to be taken if physical contact or airborne exposure occurs;\nL.  Quality control for raw materials and control of hazardous chemical inventory levels; and\nM.  Safety systems and their functions.\n\nDurham County and their contract operator have also developed and implemented safe work practices that provide for the control of hazards during operations.  For example, Durham County and their contract operator have programs that govern the following activities:  lockout/tagout; confined space entry; opening process equipment or piping; and control over entrance into PSM and RMP covered portions of the plant by maintenance, contractor or other support personnel.\n\n5.  Training.  Durham County and their contract operator provide employees, contractors and visitors with training that focuses on special safety and health hazards posed by the plant operations, RMP and PSM covered processes, emergency operations including shutdown, and safe work practices applicable to the employees job tasks.  Durham County and their contract operator confirm that employees and contractors involved in operating a covered process have successfully completed the required training. Durham County and their contract operator documents that covered employees and contractors have received and understood the required training.  Documentation, at a minimum, includes the identity of the employee or contract employee, the date of training, and the means used to verify that the employee understood the training.\n\n6.  Contractors.  As part of Durham County and their contract operator's contractor selection process it obtains and evaluates information regarding contract employer's safety performance and programs: (29 C.F.R. ' 1910.119(h). Durham County and their contract operator also: \n\nA.  Inform contract employers of the known potential fire, explosion, or toxic r"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 14437,
      "SummaryText": "elease hazards related to the contractor's work and the process;\nB.  Explain to contract employers the applicable provisions of the facility's integrated contingency plan (discussed below); and\nC.  Develop and implement safe work practices to control the entrance, presence and exit of contract employers and contract employees in covered process areas.\n\n7.  Pre-startup Safety Review.  Durham County and their contract operator always confirm that prior to the introduction of highly hazardous chemicals to a new or existing RMP/PSM covered process, the process is constructed and the equipment is designed in accordance with specifications; and that appropriate safety, operating, maintenance, and emergency procedures are in place to adequately protect the health and safety of employees and the nearby public.\n\n8.  Mechanical Integrity.  Durham County and their contract operator have developed and implemented written procedures to maintain the ongoing integrity of the process equipment listed below.  Durham County and their contract operator also train employees to maintain the following process equipment:\n\nA.  Pressure vessels and storage tanks;\nB.  Piping systems (including piping components such as valves);\nC.  Relief and vent systems and devices;\nD.  Emergency shutdown systems;\nE.  Controls (including monitoring devices and sensors, alarms, and interlocks); and\nF.  Pumps.\n\n9.  Hot Work Permit.  Durham County and their contract operator implement a stringent hot work permit program for all hot work operations (e.g., welding, soldering) conducted on or near any of the components involved in the chlorination process.\n\n10.  Management of Change.  Durham County and their contract operator have established and implemented written procedures to manage changes to process chemicals, technology, equipment, and procedures associated with the chlorination process; and changes to facilities that affect these processes.  These procedures ensure that the following considerations are a"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 14437,
      "SummaryText": "ddressed prior to any change:\n\nA.  The technical basis for the proposed change;\nB.  Impact of change on safety and health;\nC.  Modifications to operating procedures;\nD.  Necessary time period for the change; and\nE.  Authorization requirements for the proposed change.\n\n11.  Incident Investigation.  Durham County and their contract operator investigate each incident that resulted in, or could reasonably have resulted in, a catastrophic release of a highly hazardous chemical in the workplace.  An incident investigation team is established and consists of at least one person knowledgeable in the process involved, including a contract employee, if the incident involved work of the contractor, and other persons with appropriate knowledge and experience to thoroughly investigate and analyze the incident. \n\n12.  Emergency Planning and Response.  Durham County and their contract operator have developed an Integrated Contingency Plan (ICP) that satisfies all applicable state and federal emergency response and prevention planning requirements (described under emergency response policies below). \n\n13.  Compliance Audits.  Durham County and their contract operator will evaluate the wastewater treatment plant's compliance with the PSM Standard and the RMP rule at least every three years to verify that the procedures and practices it has developed are adequate and being followed.  A report of the RMP and PSM audit findings will be developed. \n\n14.  Trade Secrets.  Durham County and their contract operator make all necessary information available to those persons responsible for compiling process safety information and those assisting in the development of the process hazard analysis. \n\nE.  Five Year Accident History\n\nThe Triangle WWTP has never experienced a release that requires reporting under the chemical accident prevention rule.\n\nF.  Emergency Response Procedures and Policies\n\nDurham County and their contract operator's WWTP employees have been trained to control \"non-emergen"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 14437,
      "SummaryText": "cy\" incidents such as small, incidental spills and leaks.  Employees have been trained on confined space entry procedures and the proper use of personal protection equipment (PPE).  In the event of small fires, all plant employees are trained in the use of fire extinguishers.  Personnel have also been trained to notify the plant manager in the event of more extensive accidental releases.  The plant manager is responsible for assessment of the extent of the release, internal notification of the release and determination of whether or not outside responders are needed.  During an emergency, all applicable Durham County employees and all their contract operator employees have been trained to evacuate to a predesignated assembly point to assist outside emergency response teams.\n\nIn the event that an accidental release occurs that is beyond the capabilities of Durham County and their contract operator's wastewater treatment plant employees to control, the plant depends on the Parkwood and Durham County Fire and Police Departments, and local ambulance services for outside support.  The Parkwood Fire Department operates under mutual aid agreements with Durham County and surrounding communities to ensure additional emergency response personnel and equipment are available to respond to an emergency release at the plant.  In addition, Durham County and their contract operator have an agreement with an outside contractor to provide emergency response services, if needed.\n\nDurham County and their contract operator have also adopted and implemented an ICP that meets the regulatory requirements of the following federal and state response planning and prevention laws:\n\n7 OSHA Emergency Response Plan (29 C.F.R. 1910.120(q))\n7 OSHA Process Safety Management emergency response requirements (29 C.F.R. ' 1910.119(n))\n7 OSHA Hazard Communication Plan (29 C.F.R. ' 1910.1200(h))\n7 EPA Risk Management Plan Emergency Response Program (40 C.F.R. ' 68.95)\n7 EPA Hazardous Waste Contingency Pla"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 14437,
      "SummaryText": "n (851 DEP Regs. ' 8(B)(5) incorporating by reference 40 C.F.R. ' 264.51-.56)\n7 EPA Oil Spill Prevention Control and Countermeasure Plan (40 C.F.R. ' 112.7)\n7 EPA Best Management Practices Plan (40 C.F.R. ' 112.104(b))\n\nThe ICP includes, among other things:\n\n7 Procedures for notifying the public and the local emergency planning committee\n7 Arrangements for first-aid procedures and emergency medical treatment procedures for exposure to chlorine and sulfur dioxide\n7 Emergency response and incident termination procedures\n7 Procedures for using, inspecting and testing emergency response equipment\n7 Employee training procedures\n7 Procedures to amend the ICP plan\n \nG.  Planned Changes\n\nAs previously noted, Durham County intends on upgrading and/or building a new treatment plant at the Triangle WWTP location.  This capital improvement project is expected to begin in the next five years.  Durham County is planning on eliminating the use of chlorine for disinfection.  At that time the facility will no longer be subject to RMP or PSM requirements."
    }
  ]
}