{
  "FacilityID": 14586,
  "FacilityName": "Bellvue Water Treatment Plant",
  "FacilityStr1": "4505 Filter Plant Road",
  "FacilityStr2": null,
  "FacilityCity": "Bellvue",
  "FacilityState": "CO",
  "FacilityZipCode": "80512",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08069",
  "LEPC": "Larimer County LEPC",
  "FacilityLatDecDegs": "40.654",
  "FacilityLongDecDegs": "-105.193",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G3",
  "LatLongDescription": "PP",
  "FacilityURL": "www.ci.greeley.co.us/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 82649583,
  "ParentCompanyName": "City of Greeley",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Greeley",
  "OperatorStr1": "1000 10th Street",
  "OperatorStr2": null,
  "OperatorCity": "Greeley",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80631",
  "OperatorZipCodeExt": "3808",
  "RMPContact": "David F. McClanahan",
  "RMPTitle": "Water Treatment Plant Superintenden",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000055753",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-12-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-21 00:00:00",
  "ErrorReportDate": "1999-07-21 00:00:00",
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.654,
  "FRS_Long": -105.193,
  "FRS_Description": "PLANT ENTRANCE (PERSONNEL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19947,
      "AltID": "22131",
      "FacilityID": 14586,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 20460,
          "ProcessID": 19947,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 25213,
          "ProcessID": 19947,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 525213,
          "ProcessID": 19947,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14586,
      "SummaryText": "   Bellvue Water Treatment Plant / Risk Management Program\n\n' 68.155             Revision :    \nExecutive Summary                   Effective Date: 062199     \nPage : 1 of 3 \n\n\n(a)The City of Greeley Bellvue Water Treatment Plant (\"WTP\") accidental release prevention policy addresses the chlorine that the facility uses for drinking water disinfection purposes.  The policy combines advanced technology, standardized operating procedures, personnel training requirements, and a top- down management commitment to safe chlorine handling practices.  The facility emergency response policy involves utilization of , and coordination with, off-site responders to address potential chlorine related incidents.\n\n(b)The Bellvue WTP is located northwest of Fort Collins, Colorado near the mouth of the Cache la Poudre River Canyon.  The plant provides high-quality drinking water to the City of Greeley, Colorado.  An inventory of four one- ton chlorine containers is regularly maintained on-site in a dedicated chlorination building.  The plant operates 24 hours per day, 365 days per year.  Resident operators address after-hours alarms and monitor overall facility security.\n\n(c)The plant performed the required off-site consequence analyses (\"OCA\") for the agency- defined \"worst- case\" and \"alternative\" release scenarios.  The plant utilized the OCA guidance for chlorine published by the United States Environmental Protection Agency (\"EPA\") in the Risk Management Program Guidance for Wastewater Treatment Plants (40 CFR Part 68).\n\nThe worst- case scenario must assume the catastrophic release over ten minutes of the entire contents of a full one- ton container of chlorine, certain specified atmospheric conditions and the failure of all active mitigation systems.  As permitted by the guidance, the facility assumed that the chlorination building would provide a degree of passive mitigation by slowing the release of chlorine gas to the atmosphere.  Applying the guidance, and assuming an unobst"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14586,
      "SummaryText": "ructed (\"rural\") landscape, the plant determined that the defined worst-case release scenario would have an off-site toxic endpoint of 2.2 miles.  (The toxic endpoint is identified as the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or \n   Bellvue Water Treatment Plant / Risk Management Program\n\n' 68.155             Revision :    \nExecutive Summary                   Effective Date: 062199     \nPage : 2 of 3 \n\ndeveloping irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.)\n\nThe facility is also supposed to identify an alternative release scenario that is more likely to occur than the worst-case scenario, but still result in an off-site toxic endpoint.  The plant utilized a scenario involving the rupture of  5/16 inch tubing releasing chlorine gas at a rate of 15 pounds per  minute.  Applying the guidance, and assuming a rural landscape with no active or passive  mitigation, the plant determined the alternative release scenario would have an off-site toxic endpoint of two-tenths of a mile (0.2 miles).\n\n(d)The Bellvue WTP Accidental Release Prevention Program is based on the following elements:\n\nAdvanced process and safety equipment;\nA chlorine gas detector alarm in the chlorine building that triggers at concentrations greater than one part per million. (The alarm consists of audible horns located throughout the plant and a strobe light at the entrance to the chlorine building.  This alarm is also connected to a computerized auto-dialing system that alerts on- call personnel.);\nStandardized operating procedures;\nTraining of operators and maintenance personnel in the chlorine process;\nPreventive maintenance program for chlorine process equipment;\nPeriodic hazard review of chlorine process equipment and procedures;\nAuditing and inspection program;\nInvestigation program (which will investigate future i"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14586,
      "SummaryText": "ncidents that could  reasonably result in a chlorine release); and\nPersonnel protective equipment, including self-contained breathing apparatus.\n\n   Bellvue Water Treatment Plant / Risk Management Program\n\n' 68.155             Revision :    \nExecutive Summary                   Effective Date: 062199     \nPage: 3 of 3 \n\n\n(e)No accidental releases of chlorine have occurred at the Bellvue WTP in the past five years.\n\n(f)The Bellvue WTP Emergency Response Program utilizes local hazardous response personnel to respond to emergencies at the plant.  The program has been reviewed by the Larimer County Office of Emergency Management and coordinated with the Poudre Fire Authority.  All personnel will review these procedures on an annual basis.\n\n(g)The Bellvue WTP has made several changes in its chlorine process, including the purchase of a multi-point chlorine gas detector, and the use of check lists for chlorine deliveries and weekly maintenance inspections.  Additionally, the entire plant is scheduled to begin a comprehensive refurbishing in the year 2000.  This will include the construction of a new chlorination building with state-of-the-art safety equipment, including a chlorine scrubber that will be designed to safely contain and neutralize the contents of a full one-ton container."
    }
  ]
}