{
  "FacilityID": 1466,
  "FacilityName": "Sunkist Growers, Inc.",
  "FacilityStr1": "616 East Sunkist Street",
  "FacilityStr2": null,
  "FacilityCity": "Ontario",
  "FacilityState": "CA",
  "FacilityZipCode": "91761",
  "Facility4DigitZipExt": "0993",
  "FacilityCountyFIPS": "06071",
  "LEPC": "San Bernardino County LEPC",
  "FacilityLatDecDegs": "34.056389",
  "FacilityLongDecDegs": "-117.641389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.sunkist.com",
  "FacilityEmailAddress": "tcatlin@sunkistgrowers.com",
  "FacilityDUNS": 8514051,
  "ParentCompanyName": "Sunkist Growers, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sunkist Growers, Inc.",
  "OperatorStr1": "616 East Sunkist Street",
  "OperatorStr2": null,
  "OperatorCity": "Ontario",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91761",
  "OperatorZipCodeExt": "0993",
  "RMPContact": "Robert Eldridge",
  "RMPTitle": "Director of Operations",
  "FTE": 388,
  "OtherEPAFacilityID": "CAD981412828",
  "EPAFacilityID": "100000018287",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-02-19 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-03-23 00:00:00",
  "DeRegistrationEffectiveDate": "2009-02-25 00:00:00",
  "AnniversaryDate": "2004-06-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.4",
  "FRS_Lat": 34.05756,
  "FRS_Long": -117.64332,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1590,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1466,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1613,
          "ProcessID": 1590,
          "NAICSCode": "311411",
          "_desc": {
            "NAICS_CODE": "311411",
            "NAICS_DESCRIPTION": "Frozen Fruit, Juice, and Vegetable Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1692,
          "ProcessID": 1590,
          "ChemicalID": 56,
          "Quantity": 37000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 501692,
          "ProcessID": 1590,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1466,
      "SummaryText": "Sunkist Growers, Inc. (Sunkist) is a membership cooperative marketing association representing citrus growers with orchards in California and Arizona.  The Ontario facility comprises of a Citrus Processing Plant at 616 East Sunkist Street.  The facility also operates a Research and Technical Services Division at 616 East Sunkist Street, and a Licensed Products Division at 720 East Sunkist Street.  However, the scope of this study only includes the Citrus Processing Plant.  The Site is involved in the production of citrus juices, refrigeration and warehousing.  There are three systems within the Site boundary housing ammonia for refrigeration purposes.  These are as follows:\n          1.  The Tank Farm Area\n          2.  Freezer 30 Area\n          3.  Main Compressor Area\nIn addition, there is a Building 31 area which is operated by a different company and is the subject of a different Risk Management Plan (RMP).\n\nPursuant to the RMP regulations (40 CFR 68) and the Process Safety Management (PSM) regulations, Sunkist has developed a comprehensive PSM written program to protect workers and the surrounding community from exposure to anhydrous ammonia.  The facility completed a process hazards analysis (PHA) for ammonia using a modified what-if?/checklist approach.  The checklist was an industry standard assessment developed by the International Institute of Ammonia Refrigeration (IIAR).  The PHA was completed using technical and operations staff from the Sunkist facility and experienced facilitators from an outside engineering firm.\n\nSunkist's implementation of the PSM program includes employee education in the hazards of ammonia and measures that can be used to reduce employee and community exposure to accidental ammonia releases.  The plan includes a preventive maintenance program (mechanical integrity) for the ammonia system and a program for both pre-startup safety reviews and management of changes (MOC) to the ammonia refrigeration system.  The program also include"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1466,
      "SummaryText": "s specific requirements for safe work practices (such as safe approaches to welding and similar hot work) and safety requirements for contractors who may be hired to work on the refrigeration system.  \n\nLastly, the PSM written program incorporates the Sunkist facility's emergency response plan and places special emphasis on handling accidental releases of ammonia and coordination of emergency response with local fire departments and other emergency response organizations.  \n\nAs part of the RMP requirements, Sunkist undertook a review of the potential offsite consequences of the accidental release of the largest vessel of ammonia at the facility.  Although such a release is highly unlikely, the regulation requires this review.  Sunkist's analysis indicates that such a release would involve the release of the contents of the facility's high pressure receiver.  The release would result in the potential exposure of an area approximately 0.7 miles in diameter (distance to endpoint of 0.35 miles).  The total population within this potential exposure area is 19,000.\n\nAlthough the worst-case scenario is highly unlikely, there are accidental release scenarios that might result in a release of ammonia affecting employees of surrounding businesses and residents in the surrounding area.  Sunkist has analyzed incidents occurring at other ammonia rerigeration facilities, past operating experience, and the results of the internal process hazards analysis (PHA), to determine an alternative case.  For the Sunkist facility, this release is assumed to be a one-centimeter hole at the connection to the high-pressure receiver, located on the roof of Freezer #30, resulting in the emptying of the receiver.  Such a release would affect an area of 0.2 miles in diameter (distance to endpoint of 0.1 miles), and would affect surrounding businesses, but would have no affect on residential populations in the area. \n\nSunkist is committed to minimizing accidental releases from the ammonia refigerat"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1466,
      "SummaryText": "ion process.  Facility management is involved in the design, operation, and maintenance of the system.  Facility personnel at all levels have been involved in the development of the PSM and RMP progams.  Management has committed to working with local agencies and the community to educate the public regarding the hazards of ammonia and to ensure a safe workplace and surrounding community.  Specific questions regarding Sunkist's RMP compliance should be addressed to the senior technical manager of the facility."
    }
  ]
}