{
  "FacilityID": 14797,
  "FacilityName": "Pearl Brewing Company",
  "FacilityStr1": "312 Pearl Parkway",
  "FacilityStr2": null,
  "FacilityCity": "San Antonio",
  "FacilityState": "TX",
  "FacilityZipCode": "78296",
  "Facility4DigitZipExt": "1661",
  "FacilityCountyFIPS": "48029",
  "LEPC": "Bexar County LEPC",
  "FacilityLatDecDegs": "29.443806",
  "FacilityLongDecDegs": "-98.478139",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 8115248,
  "ParentCompanyName": "S&P Corporation",
  "Company2Name": null,
  "CompanyDUNS": 8115248,
  "Company2DUNS": 0,
  "OperatorName": "Pearl Brewing Company",
  "OperatorStr1": "312 Pearl Parkway",
  "OperatorStr2": null,
  "OperatorCity": "San Antonio",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78296",
  "OperatorZipCodeExt": "1661",
  "RMPContact": "Mr. Gary G. Hampel",
  "RMPTitle": "Maintenance Superintendent",
  "FTE": 300,
  "OtherEPAFacilityID": "TXD008115248",
  "EPAFacilityID": "100000022708",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-05-10 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 29.44192,
  "FRS_Long": -98.47913,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 20237,
      "AltID": "Ammonia (anhydrous)",
      "FacilityID": 14797,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 20755,
          "ProcessID": 20237,
          "NAICSCode": "31212",
          "_desc": {
            "NAICS_CODE": "31212",
            "NAICS_DESCRIPTION": "Breweries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 25599,
          "ProcessID": 20237,
          "ChemicalID": 56,
          "Quantity": 36000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 525599,
          "ProcessID": 20237,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14797,
      "SummaryText": "                            Executive Summary\n\n   Pearl Brewing Company of San Antonio, Texas maintains a solid reputation within the\ncommunity and throughout the region for high quality products and, above all, concern for\nemployee and environmental safety.   Pearl Brewing Company implemented numerous safety\nand environmental initiatives in recent years.  Specific accomplishments are as follows;\n\n1.   Accidental Release Prevention and Emergency Response Policies -\n     \n     Policy and prevention are spelled out in our Ammonia Refrigeration Process Safety\nManagement (PSM) program, Spill Prevention, Control and Countermeasures Plan (SPCC), and\nthe Storm Water Pollution Prevention Plan (SWPPP), Chemical Hygiene Plan, and the Safety\nand Health Program.   In addition to written guidelines for safe performance in the workplace\nand environmental awareness by all employees, safety and environmental consultants are\nroutinely enlisted to conduct surveys, report findings and make recommendations to improve\nfacilility and employee safety.   Deficiencies are corrected by plant maintenance personnel,\noperators or assigned to a contractor for completion. A service agreement is in place with a local\ncontractor (Eagle Construction and Environmental) to provide Hazmat assistance in the event of\na major release.   Also, Pearl Brewing Company is represented at Bexar County Local\nEmergency Planning Commission (LEPC) monthly seminars.      \n\n2.  Facility Information - \n\n     Pearl Brewing Company is located on thirteen acres north of the city center at the junction of\nInterstate 35 and U.S 281.   As a beer and beverage producer, ammonia mechanical refrigeration\nplays a key role in the process.  Anhydrous ammonia is the refrigerant of choice in large\nindustrial applications.  Leaks are easily detectable, not damaging to the environment as it is\nproduced by naturally occurring organic processes on a commercial basis, and replacement cost\nis low.   Our major effort lies in the safe and efficien"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14797,
      "SummaryText": "t operation of the ammonia refrigeration\nsystem.  Our ammonia charge totals 36,000 lbs. to support a wide variety of refrigeration\nrequirements in production, storage and product preparation for packaging.  Breweries use\nrefrigeration for wort cooling, propylene glycol for attemperation, carbon dioxide liquifaction\nand maintaining low temperatures in the large storage cellars, yeast and hop storage rooms.  \nRefrigeration is a process for removing heat from a space or substance, to bring about a\nreduction in temperature, by transferring that heat to another substance.   Cellars are normally\nheld at low temperatures, typically 45-55 degrees F. for fermenting and 32-33 degrees F for\nstorage and bottling and glycol temperatures range from 22-24 degrees F.\n\n3.   Worst Case Release Scenario and Alternative Release Scenario -    \n\nToxic Worst Case Scenario:   Environmental Protection Agency OCA guidance was used to\ndevelop a worst case release scenario for ammonia.   Ammonia Process Safety Management\n(PSM) information contributed to the selection of the worst case scenario.   Normal operating\nlevel of our high pressure receivers is about 1300 lbs. as the refrigeration load varies slightly\nthroughout the year.   Cellars are kept at constant temperatures within a few degrees and the only\nload variance comes from cooler and chiller start-up and shut-down for production.   The five\nseparate ammonia receivers are the largest quantity of liquid ammonia under pressure (150 psi).  \nA catastrophic release is unlikely, but could reach a .3 mile endpoint offsite.   The receivers are\nlocated in the engineroom mitigating a release to the environment.   Drains are situated to divert\nany unevaporated liquid to the sanitary sewer as opposed to a storm sewer outfall.   The sight\nglasses on the receivers could be vulnerable to accidental breakage only in rare circumstances.  \nEach sight glass is protected by heavy metal guards to reduce the chance of damage from\nimpact.   The receivers are "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14797,
      "SummaryText": "not in a vehicular traffic area, but occaisionally fork lifts are used to\nmove motors, pumps, etc. into and out of the engineroom.   A remote possibility of impact is\npresent if a driver fails to use caution or if a mechanical failure of the lift occurs and the load\nshifts breaking a sight glass.   Only if immediate isolation near the point of impact is not\npossible could a catastrophic release take place.\n\nToxic Alternate Case Scenario -   The alternate scenario would be an ammonia release from the\nCascade ammonia receiver located outside the engineroom on the north side.  This receiver\ncontains a large quantity (450 lbs.) of liquid ammonia under pressure (35 psi).   This vessel is\nlocated adjacent to other large tanks with a wooden overhead enclosure.   The other large tanks\nand the wooden overhead may not be able to withstand the effects of extreme weather or natural\nevents, such as a tornado or flooding from torrential rain.   Recent severe flooding of the San\nAntonio River occurred with several feet of water blanketing most of the plant grounds.   The\nwater level rose and receded very quickly with tremendous force.   A variety of objects were\nobserved being carried away during that period.   The water level rose to within a foot of the\nCascade receiver.   Impact from displaced tanks, possible collapse of the wooden overhead\nenclosure, or collision from large floating objects could damage the vessel or more likely, the\nvessel's sight glass.   Again, any circumstances preventing immediate isolation at the point of\nrelease could result in a catastrophic release to the environment.   A catch basin has been\nconstructed to direct unevaporated liquid from entering the storm sewer and diverting it to the\nsanitary sewer.   The vapor release has the potential to reach a .1 mile endpoint offsite.      \n\n4.   General Accident Release Prevention Program and Chemical-specific\nPrevention Steps - \n\n      A major advance was made in developing and implementing the Ammonia Proce"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14797,
      "SummaryText": "ss Safety\nManagement (PSM) program.  This project was a mutual effort between plant personnel and a\nprofessional environmental consulting firm, Safe-T-Train, Inc. of San Antonio, Texas.   If a\nhazardous substance, in this case ammonia, is maintained on site in quantities of 10,000 lbs. or\nmore, then 29 CFR 1910.119 requires a PSM program be in place.   As mentioned earlier, our\ncharge as calculated by Mr. Thomas Collard, a Professional Engineer, is approximately 36,000\nlbs.   Upon completion of a thorough inspection lasting approximately 5 weeks of all ammonia\nequipment (compressors, evaporators, condensers, piping, valves, etc.), Mr. Collard noted in his\nfinal report, \" All equipment is in a safe working condition, no unguarded dangerous machinery\nand the workplace at Pearl to be quite safe, generally.   It is my opinion that the equipment and\npiping are in safe working order, and that the refrigeration personnel do a remarkable job.\"   \n      The Ammonia PSM program is implemented on a daily basis beginning with regular\noperator rounds.   The purpose of this program is not to merely meet an administrative\nrequirement set forth by OSHA, but to ensure the safety of personnel, protect the environment\nand reduce release probabilities.   Ammonia leaks are corrected on the spot or internal work\norders generated and in-house crafts or a qualified contractor selected to effect repairs.  \nEquipment or system piping repairs require thorough evacuation prior to cutting or welding to\nprevent an explosion.   A lockout/tagout program ensures equipment may not be inadvertantly\nstarted or valves operated, which may cause injury/death or damage to equipment.   Key\nelements of the Ammonia Process Safety Management (PSM) program are:\n\na.   Employee Participation:   Ammonia refrigeration system operators and maintenance\npersonnel are aware of the hazards of ammonia and the danger it would pose to themselves,\nothers and the environment should a major release occur.  OSHA mandates empl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 14797,
      "SummaryText": "oyees\nparticipate in development and implementation of the PSM program.  All employees have ready\naccess to PSM files and documentation upon request.  Major areas included in the Employee\nParticipation element are;\n\n-    Employee Awareness:   New employees are made aware of ammonia refrigeration PSM as\npart of their initial orientation.  The International Institute of Ammonia Refrigeration (IIAR)\nvideos, \"Ammonia, Refrigerant of the Future\" are shown to help them gain an understanding of\nammonia, why and how it is used in our refrigeration process, and the health hazards associated.  \nIn addition, recent Hazardous Waste Operations and Emergency Response Training (40-hour\ncourse) included an Ammonia PSM block of instruction to potential responders.  All recipients\nof this training acknowledge their awareness of Ammonia PSM by signing a document upon\ncompletion of the presentation.  \n\n-    Employee Involvement:   At least one employee directly involved in the operation or\nmaintenance of the ammonia system is present for meetings and/or discussions concerning\nammonia refrigeration.  PSM procedures affecting hourly employees are discussed with at least\none hourly in attendance at all times.   Any employee having concerns about aspects of the PSM\nprogram may direct his/her concerns to the Plant Engineer and Plant Safety Director.  Numerous\nplant ammonia safety procedures and policies are to be revisited at regular intervals, such as\nProcess Safety Information accuracy and thoroughness, Operating Procedures validation,\ntraining, anticipated changes to the system, Emergency Planning and Response procedures, and\nonce every three years an hourly employee will be involved in the PSM compliance audit.  All\nemployees directly involved with the operation or maintenance of the ammonia refrigeration\nsystem may review the process safety information and process hazard analysis.  Such reviews are\nconsidered training and are conducted on company time.\n   \n\nb.   Process Safety Informat"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 14797,
      "SummaryText": "ion:   Health and environmental hazards are listed in this element\nof which an MSDS (Material Safety Data Sheet) provides some of the necessary information.   A\nProcess Technology section includes plant specific equipment operating safety parameters and\ndevices, as well as Process Flow Diagrams and Piping and Instrumentation Diagrams.  A Block\nFlow Diagram or Process Flow Diagram shows the major components of the ammonia system\nand flow directions.  A Piping and Instrumentation Diagram depicts an in-depth view of all\npiping, valves, vessels, safety devices, etc. in a comprehensive set of engineering drawings. \nApproximately two years of intense effort by plant and contractor personnel were invested in\nthis project. The Process Safety Information assesses all hazards of the ammonia system.  It is\navailable to all employees and is included in the Ammonia PSM awareness lectures.  Process\nSafety Information is broken down into key catogories;\n\nHazards of Ammonia:\n\n     - Chemical properties\n     - Environmental effects\n     - Physical data\n     - Toxicity data\n     - Stability data (thermal and chemical)\n     - Reactivity data\n     - Corrosiveness\n     - Erosion effects \n     - Physiological effects and health information\n     - Fire protection information\n     \nProcess Technology Information:\n\n     - Simplified Block Flow or Process Flow Diagram\n     - Piping and Instrumentation Diagram\n     - Safe operating limits for;\n          --temperature\n          --pressure\n          --liquid levels\n     - Plant specific equipment information for;\n          --compressors\n          --condensers\n          --receivers\n          --evaporators\n          --cascade ammonia system \n     - Process Risk Assessment and Severity    \n     - Environmental Conditions in a Leak Area and Emergency Response\n\n\nc.   Process Hazard Analysis:   The purpose of this element is to identify possible conditions,\npractices, design problems, facility siting or human factors which could lead to a major relea"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 14797,
      "SummaryText": "se.  \nA What-If-Checklist methodology was used employing approximately 260 potential release\nscenarios with consequences and associated assessments for each scenario.  A risk assessment\nmatrix was employed to determine which scenarios held the greatest potential for a release.\n\nThe Process Hazard Analysis (PHA) is a thorough and systematic method for identifying,\nevaluating, and controlling potential hazards within any process such as ammonia.  The scope of\nPHA was applied to all equipment and procedures involving the ammonia refrigeration system. \nThe obvious objective was to identify possible deviations from process design, maintenance,\ninspection, or operating procedures which have the potential to cause a major release if no plant\nadministrative or engineering controls are in place.  \nDevelopment of our PHA required a time-consuming and labor intensive process.  A key\ningredient is selecting knowledgeable participants.  Personnel selected for the PHA Team had to\nbe intimately familiar with operational and maintenence aspects of the ammonia system.  The\nteam members had to have the necessary experience to visualize the causes or deviations from\nnormal operation of the ammonia system and evaluate current controls and their effectiveness. \nNext, the analysis had to be conducted using one of a variety of methodologies.  Methodologies\navailable for consideration include;\n\n     - What-If\n     - Checklist\n     - What-If /Checklist\n     - Hazard & Operability Study (HAZOP)\n     - Failure Mode and Effects Analysis (FMEA)\n     - Fault Tree Analysis (FTA)\n\nA decision was made to use the What-If/Checklist methodology as it appeared to cover the\ngreatest number of probabilities in which a release could occur and was more suitable for group\nanalysis.   Since all members of the team are well versed in the operation of ammonia systems, \nprior experience with Ammonia PSM Process Hazard Analysis development was a major plus\nfor the team as one member developed and implemented PSM"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 14797,
      "SummaryText": " programs during previous\nemployment with another company.   The equipment in the PHA generic scenarios had to be\ntailored and specifically identified using in-house designations.  Each scenario followed the\nbelow format:\n\n      - Equipment: describes the equipment or activity for which a particular scenario \n                   applies.\n      - Question: a question on which the scenario and consequence is based. \n      - Scenario: serves to identify an event associated with the question.\n      - Consequences/Hazards: indicates the possible impact on employees or equipment.\n      - Engineering/Administrative Controls: any controls which would mitigate the \n                  hazard.  (Routine operator inspections during rounds is an example of an \n                  E/A Control.)\n      - Risk Matrix analysis:  \n          -- C (Consequence): a column to record the consequence ranking from a      \n          qualitative analysis.\n          -- F (Frequency): a column to record the frequency ranking from a qualitative \n               analysis.\n          -- R (Risk): a column to record the risk assesment degree from \"A\" (most severe) \n               to \"D\" (least severe) from a qualitative consequence and frequency \n               analysis.\n     - Recommendations: Essentially, where no E/A Controls are present and the degree of \n     risk should warrant some control, then a recommendation is entered in the PHA   \n     Recommendations section.       \n\nUsing the above format, team members analyzed a wide variety of scenarios in the following\nfunctional ammonia refrigeration areas;\n\n     - Compressors\n     - Condensers\n     - Air Purgers\n     - Pressure Vessels\n     - Evaporators\n     - Piping and Valves\n     - Pumps\n     - Instrumentation\n     - Start-up of systems\n     - Shut-down of systems\n     - Emergency operations\n     - Charging NH3 system\n     - Pump-out of NH3 system\n     - Human factors\n     - Facility siting\n     - Identification of past incidents\n   \nThe PHA took a"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 14797,
      "SummaryText": " week to accomplish once the groundwork was in place.  A number of morning\nworking sessions were held as that time proved the most beneficial.  Each session was very\nintense and lasted several hours.  In general, each study had to take into account the potential for\na hazardous situation to occur given the current environment in our plant.  The bottom-line\nquestion at the root of each scenario was, \" what is the likelyhood of a release with our present\nE/A controls?\"  This was the underlying thought process of each member throughout the entire\nstudy.  Once complete, a management system was developed to address, resolve, and document\nrecommendations from the study.         \n\n\nd.   Operating Procedures:   Standard Operating Procedures (SOPs) were developed for\nequipment and system functions to include normal start-up and shut-down, emergency shut-\ndown, maintenance procedures, etc.  Procedures include photographs of key valves and valve\nidentification using valve tags.  Since OSHA requires employers consult with employees in the\ndevelopment of PSM, it was only logical for operators of the ammonia system to play a key role. \nThe Lead Utility Engineer, one of Pearl Brewing's most experienced operators, played a\nsignificant part in the development of our SOPs.  The contractor incorporated our drafts into a\nwell-organized and \"user friendly\" set of manuals.  SOPs serve several valuable functions.  First,\nthey reduce the probablility of operator error.  Secondly, they provide a new operator with\nreadily available references to assist break-in.  Much has to be remembered by the new\nemployee during the break-in process.  If any element of the break-in process can be put in\nwriting and easily accessed, then the likelyhood of mistakes is reduced.   Lastly, they create a\nproven operational method which can be reviewed periodically for accuracy and validity, also a\nrequirement of PSM.\n\nAll operators of the ammonia system have a full understanding and good overview of the process"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 14797,
      "SummaryText": "\nand principles of refrigeration.  SOPs deal with specific tasks related with the operation of the\nammonia process.  An SOP has two specific areas to address;\n\n(1)  procedures for routine and emergency operations, and\n(2)  procedures for relevant tasks such as maintenance.  \n\nTypical procedures for routine and emergency operations include, \n\n     - start-up,\n     - normal operations,\n     - temporary operations,\n     - emergency shut-down,\n     - normal shut-down, and\n     - start-up following an emergency shut-down.\n\nTypical procedures for maintenance activities of include,\n\n     - draining refrigerant oil,\n     - purging non-condensibles,\n     - pump-out (evacuate) to ensure all liquid is removed to reduce pressure within the piece \n       of equipment.  Equipment must be down to a vacumn as this procedure is essential to \n       safely open the equipment so that little or no refrigerant escapes to the atmosphere and \n              creates a  health hazard.\n\nOperating procedures were developed to cover safe work practices, such as Lockout/Tagout,\nHot Work Procedures, and Confined Space Entry.  \n\n     Lockout/Tagout - Detailed procedures are developed to electrically and mechanically\nisolate a piece of equipment for personnel to safely perform maintenance functions.  Each piece\nof equipment is identified as to Equipment Inventory Number, Location, and Energy Sources.\nIn order for an equipment to be safely locked out, all energy sources must be isolated.  Possible\nenergy sources are;\n\n     - electric,\n     - steam,\n     - stored energy,\n     - pneumatic,\n     - hydraulic,\n     - ammonia, and\n     - carbon dioxide.\n\nThe energy sources are identified for equipment to be locked out.  The energy source location\nprovides the exact physical location in the plant to find and effect the lockout.  The procedure to\nlockout and/or tagout provides the required actions necessary to isolate the equipment. \nMaintenance personnel should start work only after an attempt is made to s"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 14797,
      "SummaryText": "tart the machine.  If\nthe machine fails to start, then the lockout is satisfactory.\n\n     Hot Work Procedures - (See Hot Work Permits, paragraph i).\n\n     Confined Space Procedures - This facility contains a large number of vessels which\nrequire atmospheric testing prior to entry.  A confined space is defined as a space which is not\nnormally occupied, has restricted entry,  and could present a health hazard if entered without\nnecessary safeguards in place.   All confined spaces are identified with a placard at or near the\npoint of entry.   Confined space entry requires a check of the atmosphere for oxygen levels and\npresence of combustible and toxic gases.  Knowledge of the process is important to determine\nwhich hazards may be present.   No entry into a confined space is made without proper\npersonnel protective equipment (respirator) unless the atmosphere contains sufficient oxygen\nand/or devoid of any potentially harmful gases.   Detectors for oxygen, combustible and toxic\ngases are used to read levels.  Thorough venting, either with natural or mechanical means, is\nemployed to ensure the atmosphere is safe to enter.   As a confined space is made ready to enter,\na safety observer must be posted at the access with visual or other means of communication.  \nOur Confined Space Entry permits contain all the requirements necessary to conduct a safe entry\nevolution.             \n       \ne.   Training:    All operators of the ammonia system require thorough training.  A\ncomprehensive break-in period is required prior to an operator being allowed to stand a shift\nsolo.  Many of the operators have extensive experience with this ammonia refrigeration\ninstallation or with prior facilities from past employment.   Training involves a combination of\nformal classroom, hands-on, and OJT.  Training material included IIAR video training modules,\nNIOSH Safety and Health Manual, North American Emergency Response Guide, Spill\nPrevention Control and Countermeasures and Storm Water Pollut"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 14797,
      "SummaryText": "ion Prevention Plan, Sensidyne\nGas Detector as well as locally prepared hand-outs on the plant refrigeration systems,  Each\noperator has received training in the below areas of ammonia refrigeration:\n\n     - Understanding MSDSs.\n     - Ammonia properties, safety and health hazards.\n     - The refrigeration cycle, how the plant operates.\n     - Each plant component (i.e. compressors, pumps,\n        evaporators, receivers, control valves, etc.)\n     - Mechanical integrity program requirements.\n     - Identifying and correcting abnormal operating conditions.\n     - Process Flow Diagrams.\n     - Routine refrigeration system operation.\n     - Individual's role in the emergency response plan.\n     - Emergency and normal refrigeration safety procedures.\n     - Ammonia Process Safety Management \n\nf.   Contractor Qualification: The primary purpose of this element is to ensure contractors are\nfully aware of the dangers of a system covered under Process Safety Management (PSM).   This\nsection applies to all contractors performing any type of maintenance or installation projects on\nthe ammonia system.  It does not apply to contractors performing a service, such as janitorial or\nfood, for example.  Contractors are required to train and inform their employees. \n\nContractor selection:\n     \n     - We implement a selection process involving bids on work directly associated with the \n     ammonia refrigeration system.\n\n     - Previous working experience with ammonia systems is the first requirement.  However, \n     as long as the contractor can demonstrate technical and procedural knowledge of      \n     ammonia systems and Process Safety Management program elements then due    \n     consideration will be given.\n\n     - A contractor's past safety record and current safety programs are taken into account in \n     the selection process.\n\n     - If the contractor has worked for Pearl Brewing in the past and the work was similar to \n     that which is currently bid, then an evaluation a"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 14797,
      "SummaryText": "nd bid acceptance may be based upon       \n     such performance. \n\nContractor awareness:\n\n     - Hazards of the ammonia system are identified during the job walk-through.\n\n     - Review piping color codes to familiarize contractor with the ammonia system.\n\n     - Review safety practices for presence, entry and exit of contractor's employees.\n\n     - Review facility emergency response plan to include egress routes and muster area \n     in the event evacuation is ordered.\n\n     - Each contractor employee must acknowledge receipt of this information.  \n\nContractor follow-up:\n\n     - It is necessary to periodically evaluate the contractor's adherance to PSM and other \n     safety elements.\n\n     - An illness and injury log related to the contractor's employees is maintained on-site.\n\ng.   Pre-Start Up Safety Review: The purpose of the Pre-Start Up Safety Review is to ensure\nthat all considerations are addressed prior to admitting ammonia to the process.  PSRs are\nrequired for all new facilities and for modifications to existing facilities that result in a change to\nthe process safety information.\n\nNew Facilities: (Pearl Brewing is not a new facility, however the following is for information\npurposes only and not applicable.) \n\n     - All information regarding a new installation needs to be incorporated into the Process \n     Safety Information of Ammonia PSM.  The information will be made readily available to\n     employees upon request.\n\n     - A Process Hazard Analysis will be conducted to identify any unique hazards associated \n     with the new installation.   All recommendations from the PHA should be resolved prior \n     to start-up.\n\n     - Construction and materials must be in compliance with current codes.\n\n     - All operating, maintenance, and emergency procedures must be documented and \n     implemented.  Standards, codes and manufacturer's instructions are to be part of this \n     PSR.\n\n     - Training on the new equipment or installation must be documente"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 14797,
      "SummaryText": "d.\n\nModified facilities:\n\n     - Update the Process Safety Information.\n\n     - Management of Change initiative documentation should reflect whether change is \n     major or minor, temporary or permanent.\n\n     - Update operating, maintenance and emergency procedures. \n\n     - Initiate training program for the modification.\n\n     - The Pre-Start Up must follow guidelines set forth by PSM.  A one page summary form \n     is used to verify compliance with the PSR\n\nh.   Mechanical Integrity:   Purpose is to ensure components are in good working condition and\nare leak free.  This element, however, is implemented on a daily basis with operators making\nroutine rounds, documenting discrepancies through a plant work order procedure and corrective\naction follow-up.  A team comprised of contractor and plant personnel walked every ammonia\nline and inspected each piece of ammonia equipment to include compressors, pumps,\ncondensers, evaporators, shell and tube heat exchangers, vessels, piping and system elements in\ngeneral in accordance with IIAR (International Institute of Ammonia Refrigeration) inspection\nsheets. In addition, sections of in-service piping were removed to evaluate serviceability.  All\nsections were deemed satisfactory and not in need of replacement.  Documentation for the\nrecord is maintained on-site and available to all personnel. \n\ni.    Hot Work Permits:   Cutting, welding, burning, or any use of an open flame operations pose\na special problem as all ammonia equipment must be thoroughly pumped out or evacuated prior\nto welding or cutting.   The procedure covers any type of operation which could be a source of\nignition.   All employees and contractors are required to use hot work permits.   This\nrequirement is well understood by maintenance personnel and operators.  Pressure in the vessel\nor piping indicates a potentially explosive situation.  Only when the pump out gauge indicates a\nsub-atmospheric pressure in that part of the ammonia system should maintenanc"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 14797,
      "SummaryText": "e begin.  In\naddition to pump-out requirements, a fire extinguisher must be nearby, the immediate area must\nbe checked for presence of combustibles, and one person must remain to act as a fire watch until\nno danger of fire exists.  A fire watch is required where there is the possibility that a fire might\ndevelop due to stray sparks, where there are wall or floor openings within 35 feet, or where there\nis the presence of combustibles within 35 feet of the hot work.   The hot work permit contains\nnumerous safety precautions which must be considered prior to, during and after cutting or\nwelding operations are completed.   The hot work permit details the precautions necessary for\nthe safe conduct of hot work operations.  The following is a brief summary of what steps are\nrequired to execute a hot work permit requirement:\n\n     1.  The need for a hot work permit is identfied.  This may be indicated verbally or in \n     writing by in-house crafts or a contractor.   The need for a hot work permit arises if it is \n     deemed that the work is located in an area where combustibles may be present, a      \n     machinery space, or any area in which the present of open flame could pose a problem.  \n     \n     2.  The maintenance supervisor has responsibility to inspect the space where the work \n     is to take place and fill out the hot work permit.\n     \n     3.   Hot work permits are valid for periods of no longer than 8 hours.  It contains the \n     name of the maintenance personnel, along with one individual designated as the fire \n     watch, if required.  \n     \n     4.   The maintenance supervisor reviews the list of general precautions with    \n     personnel performing the work and identifies any unusual conditions which might call \n     for special attention.  The permit is signed by the supervisor and maintenance personnel \n     and posted at the site or on the equipment.\n     \n     5.   The fire watch should remain 30 minutes after the work is completed and return t"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 14797,
      "SummaryText": "o \n     the site 2-4 hours later as sometimes smoldering fires take that long for a fire to become \n     apparent.   \n     \n     6.   The supervisor will sign the hot work permit once the work is complete. Permits are \n     retained for 30 days.  Hot work performed within the crafts's shops, such as the     \n     pipefitters' shop or the machinists' shop does not require a hot work permit as those \n     areas are designed for and have the necessary safeguards in place for cutting, welding, \n     brazing or any open flame operations. \n       \nj.   Management of Change:   With the addition of new equipment or any change which is not a\n\"replacement in kind\", a thorough evaluation takes place to ensure unrecognized or\nunacceptable hazards are not introduced to the process.   Changes are necessary to improve the\nprocess, replace defective or outdated equipment or to increase capacity.  The purpose is to\nensure significant changes warrant proper review beforehand.  The Management of Change\n(MOC) procedure is intended to apply to all ammonia related equipment and system\ncomponents, regardless of whether it is major or minor, or of a temporary or permanent nature. \nExamples of changes which are subject to MOC initiative (This list is not intended to be\nexhaustive):\n\n     - Installation of a by-pass around a piece of equipment.\n     - Piping changes.\n     - Installation of a parallel piece of equipment.\n     - Replacement of a control valve of a different size or rating.\n     - Replacement of a gasket of a different material.\n     - Replacement of a vessel of different pressure rating.\n     - New construction.\n     - Change in operating parameters.\n     - Increase in ammonia inventory.\n     - Change in process variables, such as flow, temperature or pressure.\n \nA Management of Change initiative is not required when the change is a \"replacement in kind\". \nExamples would be:\n\n     - \"Like for like\" such as a 450 lb/hr carbon dioxide condenser with a 450 lb/hr carbon \n     diox"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 14797,
      "SummaryText": "ide condenser from a different manufacturer, as long as piping and instrumentation \n     configurations are the same. (Ammonia is used in the liquifaction of carbon dioxide gas.)\n     - \"Like for like\"such as a 250 Ton Ammonia Compressor from the same manufacturer.\n     - Any change which does not impact the Process Safety Information.\n\nThe procedure for MOC is as follows:\n\n     1.    A Management of Change Form (MCF) is initiated indicating priority, reason, and \n     technical description of the change.\n     2.   The MCF is reviewed by the Maintenance Supervisor for \"replacement in kind\", \n     major or minor, temporary or permanent change. \n     3.   If the assessment does not fall within the definition of change and thus is a   \n     replacement in kind, then review, approval and disposition is outside the scope of this \n     procedure.\n\nk.   Incident Investigation:   A formal investigation is required in the event of a major\ncatastrophic release.  By definition, a catastrophic release is a major uncontrolled emission, fire,\nor explosion involving ammonia that presents a serious danger to employees, contractors\nworking on-site, or to off-site neighbors.   An incident investigation examines source of the\nrelease, causes (design shortcomings, corrosion, inadequate maintenance, process upsets, etc.).  \nAlso, what changes will take place to prevent future releases must be addressed in the\ninvestigation.  The following is a list of criteria that is use to determine whether an incident\ninvestigation should be made:\n\n     - Quantity of ammonia released.\n     - Injuries or death.\n     - Fire or explosion.\n     - Property damage.\n\nThe following outlines an incident investigation procedure:\n\n     1.  Initial incident response.\n     2.  Establish Investigation Team.\n     3.  Determine the facts.\n     4.  Determine the cause.\n     5.  Recommend results/follow-up.\n     6.  Communicate results/follow-up.\n\n\nl.   Emergency Planning:   An Emergency Response Plan identifies perso"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 14797,
      "SummaryText": "nnel, procedures,\nequipment, federal, state, and local notification requirements, coordination with outside\nassistance (fire department, HAZMAT) etc. should a major release occur.  A critical element to\ndiscuss is the importance of the Incident Command System.   Why use an Incident Command\nSystem?  First and foremost, this system provides a clear structure for the diverse activities\ntaking place during a major uncontrolled release.   Twenty-three salaried and hourly personnel\nhave received training in Hazardous Waste Operations and Emergency Response (40-hour\ncourse) at our facility.  All personnel are familiar with the requirements and provisions of the\nIncident Command System.   \n\nWhat does the Incident Command structure accomplish?\n\n     - Emergency response personnel are confronted by a number of safety hazards during an \n     emergency.   This system helps ensure that actions taken at an incident are effectively \n     controlled and that the risks and benefits of various alternative courses of action are \n     evaluated on an ongoing basis.   This organized approach helps to ensure that the safety \n     of forces operating at an emergency is not comprised.   An important part of this    \n     structure assists accountability and status of all personnel at the scene. \n\nThe Incident Command System ensures that someone is always in charge.\n\n     - A single person must be in charge at the scene.  Imagine the confusion if no one or \n     more than one person assumes control.  An organized command structure is a well \n     recognized function of successful groups of people striving to accomplish common \n     goals and objectives.  By having one person in charge, major pitfalls are avoided.  The \n     incident scene will not quickly deteriorate into chaos and information passed to   \n     responders will be recognized as having originated from the acknowledged authority.   \n\nThe Incident Command System conforms to Laws and Standards.\n\n     - The Superfund Amendments a"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 14797,
      "SummaryText": "nd Reauthorization Act of 1986 (SARA) requires that \n     emergency response organizations handling hazardous materials incidents operate with \n     an Incident Command System.   In addition, Occupational Safety and Health  \n     Administration (OSHA) and Environmental Protection Agency (EPA) mandate use of \n     Incident Command Systems as well.\n\nThe Incident Command System efficiently utilizes resources.\n\n     - It is important that the resources for stabilizing and controlling the incident be used \n     efficiently and provide the structure for managing these resources.  These resources \n     include personnel, apparatus, specialized equipment, materials, and facilities required to \n     deal with the emergency.\n\nResponsibilities of the Incident Commander\n\nThere are six responsibilities Pearl Brewing Company expects an Incident\nCommander to assume:\n\n1.   Make an Initial On-Scene Assessment and Evaluation.\n\n     -Carefully evaluate the situation.  Are lives in jeopardy?  What is the hazard?  What\nproperty is at risk?  What resources are available?  What can be done to safely control the\nrelease?\n\n2.   Determine Actions.\n\n     - After the initial evaluation is made, a fundamental decision mus tbe made...whether to\napproach stabilization and control from an offensive or defensive mode.   Where lives are at risk\nand where prompt safe control is probable, offensive actions are appropriate.  In an incident\ninvolving little or no life hazard or where the size of the incident, chemicals, or lack of\nappropriate resources preclude prompt stabilization, defensive action is warranted.\n\n3.   Determine Additional Resource Requirements.\n\n     - Our Incident Commanders are taught that in severe situations initial response resources\nmay not be adequate to attain stabilization.   One of the most important functions of the Incident\nCommander is to determine resource needs and initiate requests for additional support.\n\n4.   Deploy Personnel and Units.\n\n     - An integral element of "
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 14797,
      "SummaryText": "deploying personnel and units is issuing specific, objective-\noriented assignments.  Our response concept involves, depending on the size of the release, a\nrequest for support from Eagle Construction and Environmental and possibly the Fire\nDepartment which would result in a large number of on-scene assets.\n\n5.   Establish a Command Post.\n\n     - During the initial evaluation, the Incident Commander may have to move around in\norder to gather information.  In all but the most minor incidents, a formal, stationary command\npost is necessary, located in a safe area and easily visible.\n\n6.   Transfer of Command.\n\n     - As an incident evolves, it may be necessary to transfer command to a more experienced\nprofessional.   This is a transaction between two parties.  It is the duty of the incumbent to brief\nthe oncoming Incident Commander on the action plan in effect, status of resources and/or any\nunusual safety problems being encountered.  Upon arrival of the HAZMAT team on-scene\ncommander or the Fire Chief, command will transfer to one of these individuals from the Pearl\nBrewing Incident Commander.\n\n7.   Activities During Termination.\n\n     - As incident planning, operations, clean-up, logistics and finance wind down\ndisengagement and termination may take place over a considerable period of time.  Transfer of\ncommand would pass \"down\" rather than \"up\" as in the initial stage of the incident.   Hazardous\nmaterials incidents are not considered under control until the spill, leak or fire has been\ncontained.  Decontamination of personnel is a major issue to be dealt with during termination. \nThere are certain legal and political concerns, jurisdictional disputes, length of time a major\nhighway should remain closed or status of personnel displaced from their homes or busineses. \nFinally, a complete accounting of the incident must be made and attention to this detail can be\ngiven during termination.  \n\n8.   Summary.\n\n     - Hazardous materials incidents could present many unfore"
    },
    {
      "ESSeqNum": 20,
      "FacilityID": 14797,
      "SummaryText": "seen problems.   A well-\nstructured Incident Command system applies to small, as well as large releases.  Pearl Brewing\nCompany realizes the importance of sound training and coordination with outside agencies.\n\nm.   Compliance Audit:   Every three years the program is subject to examination to ensure all\nprovisions meet compliance.   A compliance audit is conducted by a party knowledgable with\nthe process and familiar with the PSM elements.  Documentation review and personal interviews\ncomprise the bulk of the audit.\n\nn.   Trade Secrets:   A company or firm may not withhold information to prevent establishment\nof a PSM program.  Typically, no trade secrets exist which would prevent development of a\nPSM program, since ammonia refrigeration principles of operation are universal and well known\nand fall into the category of utilities support.  The Trade Secrets element of PSM is more\ndirected to those aspects of a company's production process or service which solely may need to\nbe safeguarded.   \n\n5.    Five Year Accident History - \n  \n     The company has had no reportable accidents within the past five years.\n\n6.    The Emergency Response Program -  \n\n      Pearl Brewing Company emergency responders completed a 40-hour HAZWOPER\n(Hazardous Waste Operations and Emergency Response) training program for selected salary\nand hourly personnel which included a response scenario and drill.   The training was conducted\non-site with classroom, hands-on and actual in-plant exercises by Safe-T-Train, Inc. \nCoordination with Eagle Construction and Environmental, Inc. ensures if an outside assistance\nteam (HAZMAT) is necessary to contain a major release, additional support would be available\nwithin minutes.  Eagle Incident Commanders and corporate representatives conducted a plant\nwalk-through to become familiar with the facility, in general, chemicals in use, equipment\narrangements, egress routes, etc.   In the event a reportable incident occurs, emergency\nnotification phone number"
    },
    {
      "ESSeqNum": 21,
      "FacilityID": 14797,
      "SummaryText": "s are in place to alert federal, state, and local authorities.   Elements of\nan Emergency Response Plan should include:\n\n     - Pre-emergency planning\n     - Personnel roles, lines of authority, training and communication.\n     - Emergency recognition and prevention.\n     - Safe distances and places of refuge (muster areas).\n     - Site security and control.\n     - Evacuation routes and procedures.\n     - Decontamination.\n     - Emergency medical treatment and first aid. \n     - Emergency notifications.\n     - Critique and follow-up.\n     - Emergency equipment.\n\n7.   Planned Changes To Improve Safety -              \n\nWith the approach of hot, humid weather and the resultant additional load on the refrigeration\nsystem, plant maintenance personnel have invested much effort into overhauls of several\nammonia compressors, repair/replacement of purge point solenoids, cleaning louvres, strainers,\nspray nozzles, replacing and tightening fan belts, etc. on the ammonia evaporative condensers. \nProper operation of ammonia system components is essential to reducing risk of release.   With \nrecent replacement of certain ammonia liquid metering devices, strainers and level controls on \nthe carbon dioxide liquifaction system undertaken last fall, the ammonia system is in the highest\nstate of operational safety and readiness ever.  Other than routine replacement of any defective\nor unserviceable components, as discovered by our operators or maintenance personnel, no major\nchanges are anticipated in our ammonia refrigeration system."
    }
  ]
}