{
  "FacilityID": 14993,
  "FacilityName": "Dakota Coop",
  "FacilityStr1": "5984 IL 75 E",
  "FacilityStr2": null,
  "FacilityCity": "Dakota",
  "FacilityState": "IL",
  "FacilityZipCode": "61018",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17177",
  "LEPC": "Stephenson County LEPC",
  "FacilityLatDecDegs": "42.423111",
  "FacilityLongDecDegs": "-89.564694",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "Z1",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Pearl City Elevator Inc.",
  "Company2Name": null,
  "CompanyDUNS": 25730920,
  "Company2DUNS": 0,
  "OperatorName": "Todd Block",
  "OperatorStr1": "119 South Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Pearl City",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "61062",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mert Green",
  "RMPTitle": "Asst. Manager",
  "FTE": 9,
  "OtherEPAFacilityID": "ILD116054552",
  "EPAFacilityID": "100000153941",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "177040AAB",
  "SafetyInspectionDate": "1998-06-08 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-27 00:00:00",
  "ErrorReportDate": "1999-07-27 00:00:00",
  "ReceiptDate": "1999-07-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-07-01 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-07-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.39014,
  "FRS_Long": -89.52114,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 20600,
      "AltID": null,
      "FacilityID": 14993,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 21135,
          "ProcessID": 20600,
          "NAICSCode": "42291",
          "_desc": {
            "NAICS_CODE": "42291",
            "NAICS_DESCRIPTION": "Farm Supplies Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 26134,
          "ProcessID": 20600,
          "ChemicalID": 56,
          "Quantity": 125000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 526134,
          "ProcessID": 20600,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14993,
      "SummaryText": "EXECUTIVE SUMMARY\n\n1.  Accidental release prevention and emergency response policies\n\n     In this facility we handle anhydrous ammonia that is considered hazardous by the EPA.  The same properties that make anhydrous valuable to growing a good crop also make it necessary to observe certain safety precautions; handling anhydrous to prevent unnecessary human exposure, to reduce the threat to our own personal health and to reduce the threat to the nearby members of the community.  It's our policy to adhere to all applicable Federal and State regulations.  Our safety measures depend on the manner in which we handle anhydrous along with the safety devices applied to the design of our anhydrous facility.  We also rely strongly on our safe handling procedures that we use and the training of our personnel.\n\n     Our emergency response program is based upon the IFCA ( Illinois Fertilizer and Chemical Association) compliance checklist, (How to Properly Respond to an Agrichemical Release) but is tailored in such a way to fit our specific needs.  It is the purpose of our program to establish an orderly system to assure that responsible parties are adequately prepared to respond to the release of chemical substances into the environment and to improve the ability of state and local authorities to respond to such a release.\n\n2.  The stationary source and regulated substance handled\n\n     The primary purpose of our anhydrous facility is to distribute anhydrous to our retail customers.  Anhydrous is used by our customers as a valuable source of nitrogen for their crops.  The anhydrous is received by truck transport and is stored in (1) 30,000 gallon bottle.  Anhydrous is then distributed to retail customers by transporting the product to a smaller bottle (1000 gallon or 1500 gallon bottles) which is attached to a running gear.\n\n3.  The worst-case scenario and the alternative release scenario.\n                                                                                         "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14993,
      "SummaryText": "                                                                                          Worst-case scenario -- Failure of our anhydrous storage tank when filled to the greatest amount allowed would release 125,000 pounds of product.  Company policy limits the maximum filling capacity of the tank to 85%.\n\n     The estimated distance to the toxic endpoint for the worst-case scenario would be 6.9 miles assuming a wind speed of 1.5 meters/second with an air temperature of 77 degrees F.  This scenario is based on the fact that our active mitigation controls were to fail.\n\n     Alternative scenario -- A pull away from the loading dock causing a transfer hose to break.  The excess flow valve would function to stop the flow of product.  In the event of mitigation device failure the manual shut-off would be closed.  Giving that it could take 2 minutes to reach and manually close the valves we would lose 2800 pounds of product per minute, making the toxic endpoint 1.0 miles assuming a wind speed of 3 meters/second with an air temperature off 77 degrees F.\n\n4.  The general accidental release prevention program and the specific prevention steps.\n\n     This facility complies with EPAs Accidental release Prevention Rule and with all state and federal codes.  Our emergency response program is based upon the IFCA compliance checklist,(How to Properly Respond to Agrichemical Release) but is tailored in such a way to fit our specific needs.  All our employees who work directly with anhydrous ammonia are thoroughly trained by the IFCA\n\n5.  Five year accident history\n\n      We have had no accidents within the last five years.\n\n6.  The emergency response program\n\n     This facilitys emergency response program is based upon the IFCA compliance checklist and copies are kept with the Stephenson County Emergency Planning Committee, Department of Labor and the local fire department.  We also have an in-house training class yearly.\n\n7.  Planned changes to improve safety.\n\n     In the past"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14993,
      "SummaryText": " year we have created an in-house safety committee consisting of employees, management and board members.  We have created this committee to create and apply better safety measures to our facility.  We feel this will greatly improve our companys awareness of how important safety is."
    }
  ]
}