{
  "FacilityID": 15025,
  "FacilityName": "Agrilink Foods, Inc. - Alamo",
  "FacilityStr1": "111 North 7th Street",
  "FacilityStr2": null,
  "FacilityCity": "Alamo",
  "FacilityState": "TX",
  "FacilityZipCode": "78516",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48215",
  "LEPC": "Hidalgo County LEPC",
  "FacilityLatDecDegs": "26.183056",
  "FacilityLongDecDegs": "-98.1175",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Agrilink Foods, Inc.",
  "Company2Name": "Pro-Fac Cooperative",
  "CompanyDUNS": 2212611,
  "Company2DUNS": 64255938,
  "OperatorName": "Kim A. Baiers",
  "OperatorStr1": "111 North 7th Street",
  "OperatorStr2": "P.O. Box 459",
  "OperatorCity": "Alamo",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78516",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kim A. Baiers",
  "RMPTitle": "Facility Manager",
  "FTE": 313,
  "OtherEPAFacilityID": "78516STHRN111N7",
  "EPAFacilityID": "100000154067",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-12-15 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-07-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-07-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2003-12-10 00:00:00",
  "DeRegistrationEffectiveDate": "2002-03-04 00:00:00",
  "AnniversaryDate": "2004-07-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 26.18241,
  "FRS_Long": -98.11533,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 20647,
      "AltID": null,
      "FacilityID": 15025,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 21184,
          "ProcessID": 20647,
          "NAICSCode": "31141",
          "_desc": {
            "NAICS_CODE": "31141",
            "NAICS_DESCRIPTION": "Frozen Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 26235,
          "ProcessID": 20647,
          "ChemicalID": 56,
          "Quantity": 53000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 526235,
          "ProcessID": 20647,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15025,
      "SummaryText": "This is to inform all interested persons, including employees that Agrilink Foods is complying with OSHA's Process Safety Management Standard (called Process Safety Management or PSM), Title 29 Code of Federal Regulations (CFR) 1910.119 and EPA's Risk Management Program regulations (called RM Program), Title 40 CFR Part 68, to manage the risks involved with the storage, handling, and processing of hazardous chemicals.  In this way we promote overall plant, worker and public safety.  These programs enable our facility to minimize the occurance, and the consequences of significant releases of toxic substances,  as well as fires, explosions, and other types of catastrophic accidents.  Overall, these programs prevent accidental fatalities, injuries and illnesses and avoid physical property damage.\n\n                                                                                                                                                                \nOur safety programs are applied to any activity involving hazardous chemicals including the use, storage,  handling, or on-site movement of such chemicals.  Any group of vessels which are interconnected and separate vessels which are located such that a hazardous chemical could be involved in a potential release shall be considered a single process.\n\n\nOur safety programs minimize accidents because they focus on the rules, procedures, and practices that govern individual processes, activities, or equipment.  These rules are detailed and improved as necessary.  They are also communicated to and accepted by all employees at the facility. \n\n                                                                                                                                            Description                                                                                                                                                                                                                                             "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15025,
      "SummaryText": "                                                                                         The ammonia refrigeration process at the facility consists of various pumps, compressors, and condensers that are used to change the state of NH3 from a gas to a liquid and is a closed system.  The system operation is similar to the operation of a household refrigerator.  The total ammonia inventory on site is 53,000 pounds.  The ammonia is used in the freezing process of okra, squash, carrots, greens, onions, celery and broccoli.\n                                                                                                                                                                   \n\nWorst-case Scenario\n\nFailure of the high-pressure receiver containing 53,000 pounds of ammonia would result in a ten minute release.  Under worst-case weather conditions, ammonia could travel 2.6 miles before dispersing enough to no longer pose a hazard to the public or the environment.  This scenario is unlikely for the following reasons: industry standards for the manufacture and quality control of pressure vessels; ammonia is not corrosive in this service; pressure safety valves limit operating pressure in this vessel; the accident prevention program in place at the facility including the mechanical integrity program for regular maintenance; inspection and testing, and replacement of equipment, if necessary; installed ammonia sensors to warn of leaks; and the emergency response plan and equipment in place at the facility.\n\n\nAlternative Release Scenario \n\nFailure of a 1/4 inch diameter pipe would result in the release of approximately 6,000 pounds of ammonia over a time period of 60 minutes.  Under common weather conditions, ammonia would travel 0.10 miles before dispersing enough to no longer pose a hazard to the public or the environment.  The 1/4 inch pipe was chosen because it is used to temporarily bleed off a pump so that maintenance activities can be conducted.  This scenario is un"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 15025,
      "SummaryText": "likely due to the following reasons:  the pump is isolated with valves in the closed position and only a few pounds of ammonia would be released; the valves in the pump would have to fail completely; the faciltiy has an accident prevention program in place during operational procedures that includes having personnel present at all times during maintenance of a pump; a mechanical integrity program for regular maintenance of a pump is in place at the faciltiy; routine inspection and testing of valves is conducted; replacement of defective equipment occurs if necessary; and the facility emergency reponse plan and equipment in place at the facility.\n\n\nPrevention Program\n\nThe general accident prevention program and ammonia-specific prevention steps were developed as required and complies with OSHA PSM Standard 29 CFR 1910.119 and EPA RM Program regulation in 40 CFR Part 68.  The key prevention steps at the facility consists of the following:    Process Safety Information,  Process Hazard Ananlysis,  Standard Operating Procedures, Training,  Mechanical Integrity Program,  Management of Change,  Pre-startup Safety Review,  Compliance Audits,  Incident Investigations,Employee Participation, Hot Work Permit, and Contractor Qualifications. \n\n\nFive Year Accident HIstory\n\nThere has been no reportable accidents in the last five years. \n                                                                                                                                                                                                                                                                                                                                                        Emergency Response Program\n\nAlamo facility's emergency response program is based on the OSHA requirements for Emergency Action Plans (29 CFR 1910.38 and 1910.119) and HAZWOPER (29 CFR 1910.120).  We have trained employees for emergency response and maintain a written emergency response plan.  This plan is coor"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 15025,
      "SummaryText": "dinated with the Alamo Fire Department and Boots and Coots (Code 3).  We conduct annual drills for implementation of the emergency response plan at the facility with participation of the fire department and Boots and Coots."
    }
  ]
}