{
  "FacilityID": 15237,
  "FacilityName": "PPG Industries Ohio, Inc.",
  "FacilityStr1": "760 Pittsburgh Drive",
  "FacilityStr2": null,
  "FacilityCity": "Delaware",
  "FacilityState": "OH",
  "FacilityZipCode": "43015",
  "Facility4DigitZipExt": "3811",
  "FacilityCountyFIPS": "39041",
  "LEPC": "Delaware County LEPC",
  "FacilityLatDecDegs": "40.300556",
  "FacilityLongDecDegs": "-83.058722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1344803,
  "ParentCompanyName": "PPG Industries, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1344803,
  "Company2DUNS": 0,
  "OperatorName": "PPG Industries Ohio, Inc.",
  "OperatorStr1": "760 Pittsburgh Drive",
  "OperatorStr2": null,
  "OperatorCity": "Delaware",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43015",
  "OperatorZipCodeExt": "3811",
  "RMPContact": "Stephen M. Petz",
  "RMPTitle": "Senior Environmental Engineer",
  "FTE": 542,
  "OtherEPAFacilityID": "43015PPGND760PI",
  "EPAFacilityID": "100000073993",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1990-07-11 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-29 00:00:00",
  "ErrorReportDate": "1999-07-29 00:00:00",
  "ReceiptDate": "1999-07-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-07-22 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.282,
  "FRS_Long": -83.09579,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 20988,
      "AltID": "Store/Use Acrylonitrile",
      "FacilityID": 15237,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 21541,
          "ProcessID": 20988,
          "NAICSCode": "32551",
          "_desc": {
            "NAICS_CODE": "32551",
            "NAICS_DESCRIPTION": "Paint and Coating Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 26724,
          "ProcessID": 20988,
          "ChemicalID": 25,
          "Quantity": 65000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 25,
            "ChemicalName": "Acrylonitrile  [2-Propenenitrile]",
            "CASNumber": "107-13-1",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 526724,
          "ProcessID": 20988,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15237,
      "SummaryText": "EXECUTIVE SUMMARY\n\nPPG Industries Ohio, Inc., Delaware, Ohio\n\nAccidental release prevention and emergency response policies\n\nThe PPG Delaware facility complies with OSHA's Process Safety Management Rule (29 CFR 1910.119), applicable Ohio and federal EPA regulations, and applicable Coast Guard and Department of Transportation requirements.  PPG also follows the Responsible Care. Codes of Management Practice, including the Responsible Care. Community Awareness Code of Management Practice, and PPG's own Community Awareness and Emergency Response (CAER) Policy to assure emergency preparedness and foster community right-to-know.  PPG's CAER Policy requires each manufacturing plant to have a pro-active community awareness and emergency response program to handle emergencies that might happen in that facility.  All of these activities form an integral part of PPG's overall Environment, Health and Safety Policy, whose goal is \"to manufacture, sell, and distribute products worldwide in a manner that is safe and protective of our employees, neighbors, customers and other stakeholders, and the environment.\"\n\n\nRegulated substances handled.\n\nPPG Delaware is part of the Refinish Business Unit of PPG Industries Ohio, Inc.   PPG Delaware produces refinish coatings for automobiles, resins which are used to give coatings their protective qualities, and waterbased uniprime coatings used for corrosion resistance on automobiles. The facility stores acrylonitrile.   \n\nWorst-case and alternative case release scenarios.\n\nAn off-site consequence analysis was performed for the largest quantities of flammable and toxic materials in the facility.  The guidelines and Offsite Consequence Analysis Guidance look-up tables and ALOHA were utilized in this process.  \n\nEPA rules require that a worst case scenario be analyzed which would involve the highly unlikely release in ten minutes of the entire contents of the largest storage container.  Based on dispersion modeling using ALOHA software and the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15237,
      "SummaryText": "EPA specified assumptions, offsite concentrations of Acrylonitrile would cause a minor offsite impact. \n\nAn alternative case release scenario (ACR) was developed for the listed chemical in the facility.  This scenario followed the guidelines provided by EPA and used a computer program to perform the end-point calculations.  The local emergency planning committee and office of emergency planning will utilize the alternative case release scenario information in conjunction with PPG experts to develop emergency response plans, train responders, perform practice drills and maintain the appropriate equipment. \n\nAn alternative case release scenario was developed for acrylonitrile.  Acrylonitrile is a monomer used in the manufacture of certain resins at PPG Delaware.  The alternative case scenario used for the facility involved a failure of the liquid line used to transfer acrylonitrile from the tank truck to the storage tank.  The facility installed additional diking around the acrylonitrile storage tank as a mitigation measure.   Evaluation from this ACR  did not show an off site impact.   \n\n\nGeneral accidental release prevention program and chemical specific prevention steps.\n\nTrained personnel and environmental, health and safety measures are included in all phases of the PPG Delaware operation.  Detailed engineering and design standards are used.  These standards may include national codes and standards, quality assurance inspections, over pressure protection systems, flammable and toxic gas detectors, emergency shutdown systems, and fire water system and computer controls for the processes.  Employees at the facility receive job-appropriate training.  Training includes periodic retraining, as necessary.   Safety, environmental, operating and training procedures are subject to periodic reviews and updates, as appropriate.  Additional systems are in place to review proposed changes and assure that any new training requirements are met.  Another system assures a detaile"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 15237,
      "SummaryText": "d review for hazards in each operating unit on a prescribed frequency.  Training and updating procedures are monitored.\n\nThe PPG Delaware facility has an array of maintenance and inspection programs that minimize the possibility of equipment or piping failures.  Periodic equipment inspections are performed to assure the equipment integrity.  Equipment inspections utilize procedures such as proof testing where safeguard systems are forced to function in a controlled manner.  This assures that the safeguards will function if they are ever needed.  Preventive and predictive maintenance programs are utilized and can include vibration monitoring, infrared images to detect differences in temperature, inspections by independent experts, inspections by insurance specialists and a root-cause analysis program. Maintenance personnel and supervisors are included in many of the training and testing programs that the operators utilize.  Additional training and procedures have been developed for activities that are specific to maintenance.  Although some of the training and testing is specific to maintenance, the same monitoring process is used.\n\nFive-year accident history.\n\nThere have been no releases in the past 5 years that resulted in an on-site or off-site impact.\n\nEmergency response program.\nPPG's emergency response program includes an emergency response plan.  The plan includes procedures for responding to an acrylonitrile release, evacuating employees, notifying the local police and fire department, as well as the hospital, if needed.\n\nPlanned changes to improve safety.\n\nPPG is committed to the process of continuous improvement.  This commitment extends beyond production issues into the environmental and safety aspects of all operations. Changes in control instruments are made on an ongoing basis, as necessary, to assure that the most reliable and effective controls are used. For additional information, contact Philip Trew at 740-363-9610."
    }
  ]
}