{
  "FacilityID": 15352,
  "FacilityName": "Old (Original) Treatment Plant",
  "FacilityStr1": "Storm Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Wanaque",
  "FacilityState": "NJ",
  "FacilityZipCode": "07465",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34031",
  "LEPC": "Passaic County OEM",
  "FacilityLatDecDegs": "41.033694",
  "FacilityLongDecDegs": "74.299222",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "C3",
  "LatLongDescription": "WM",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "North Jersey District Water Supply",
  "Company2Name": "N/A",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "North Jersey District Water Supply",
  "OperatorStr1": "1 F. A. Orechio Drive",
  "OperatorStr2": "Storm Ave.",
  "OperatorCity": "Wanaque",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07465",
  "OperatorZipCodeExt": null,
  "RMPContact": "Lewis Schneider",
  "RMPTitle": "RMP/Lab Manager",
  "FTE": 150,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000124536",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-09-09 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Old (Original) Treatment Plant",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2008-01-16 00:00:00",
  "DeRegistrationEffectiveDate": "2008-01-08 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.0538,
  "FRS_Long": -74.2803,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS BLOCK/TRACT-1990-CENTROID",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 21120,
      "AltID": "WaterTreatment/ Supply",
      "FacilityID": 15352,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 21677,
          "ProcessID": 21120,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 26872,
          "ProcessID": 21120,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 526872,
          "ProcessID": 21120,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15352,
      "SummaryText": "NORTH JERSEY DISTRICT WATER SUPPLY COMMISSION\nWANAQUE, NEW JERSEY\n\nRMProgram/TCPA\n\nEXECUTIVE SUMMARY\n\n\nStationary Source and Regulated Substance:\n\nNorth Jersey District Water Supply Commission (NJDWSC) is a large regional water treatment plant in northeastern New Jersey in the town of Wanaque.  The regulated substance handled is chlorine.  This is used in two ways.  The first is as an oxidizing agent (literally combining with oxygen) to neutralize inorganics such as iron and manganese, and organic matter.  The second is as a disinfectant to kill pathogenic or disease causing organisms.    The chlorine is kept at three stationary sites - the Chemical Building, Original Treatment Plant (OTP), and the Lower Gate House (LGH).\n\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps:\n\nThe NJDWSC has an extensive Release Prevention Program.  If we were to follow the letter of the regulations we would be classified as Program 2 Prevention Program.  However, with the safety of the plant personnel and the surrounding population in mind, we have chosen to follow Program 3 Prevention Program.  This program is much more rigorous and includes elements such as Management of Change, Pre-Startup Safety Review, Employee Participation, Hot Work Permits, and Contractor Training, which are not found in Program 2.\n\nOur effective prevention program begins with a management system.  This designates an overall responsible manager, the Risk Management Program (RMP) Manager, and responsible individuals to implement each of the key elements.  These individuals work closely with the RM Program Manager and together with an employee representative form the TCPA (Toxic Catastrophic Prevention Act) team or committee.  The key elements are as follows:\n\n1. Management System\n2. Hazard Assessment including Off-Site Consequence Analysis and 5 Year Accident History\n3. Process Safety Information\n4. Process Hazard Analysis (PHA) with Risk Assessment\n5. Standard Operating Proce"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15352,
      "SummaryText": "dures (SOP's)\n6. Training/Initial & Refresher\n7. Mechanical Integrity/Preventive Maintenance\n8. Management of Change\n9. Pre-Startup Safety Review\n10. Compliance Audits and Annual Reports\n11. Incident/Accident Investigation\n12. Employee Participation\n13. Contractor Training\n14. Hot Work Permits\n15. Emergency Response\n\nRelease Scenarios:\n\nAs per the RMP/TCPA regulations, we are required to do release scenarios .  A release scenario is a simulation of a defined release of the toxic substance.  These include a worst case and alternate release scenario.  The worst case scenario is defined as the direct release of the largest vessel on-site in 10 minutes.  This scenario is possible but not probable.  The largest vessel on-site is a one ton container holding 2000 lbs. of chlorine.  This is done for an urban setting, with ambient air temperature at 770 F and wind speed at 3.4 mph.  The distance to the end point of the release for each stationary source (per RMP Comp. Version 1.06) is 1.3 mi.  The alternate release scenario defines a release that is more likely to occur.  The release we have chosen involves rupturing a 1\" carbon steel header liquid chlorine pipe within the chlorine scale room.  In this release scenario the room acts as passive mitigation, that is it controls the loss of the substance and minimizes its effect on the public and the environment.  ROV's or Remote Operating Valves act in active mitigation by isolating the chlorine release source.  With the same factors as above, the distance to the end point for each stationary source is 0.4 mi.\n\nThe Hazardous Assessment area of Program 3 details the off-site impacts to the population and environment within the effected area.  It must be remembered that the worst case scenario designates the worst possible occurrence, and is unlikely to occur.  The alternate release scenario is more probable.  To combat these release scenarios, NJDWSC has an Emergency Response Plan that designates outside assistance from County H"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 15352,
      "SummaryText": "azardous Materials Teams, Fire and Police Departments, and Emergency Medical Teams.  We also have our own Emergency Response Team to mitigate a release at site (see Accidental Release Prevention and Emergency Response).\n\nAccidental Release Prevention and Emergency Response:\n\nPrevention of a chlorine release is done in a number of ways.  The first is by an effective preventive maintenance program.  This ensures all processes for applying chlorine are checked routinely; either hourly, daily, weekly, monthly, quarterly and yearly as designated.  A computer runs the preventive maintenance or mechanical integrity program.  Input is logged into the computer designating equipment to be checked, frequency and procedure.  This is then \"kicked out\" at the required interval for the maintenance staff to perform.  The maintenance person than does the prescribed procedure, fills out the computer generated form, makes note of any necessary repairs, and returns the form to the supervisor for re-entry into the computer for task completion.\n\nThe second way a release is prevented is by a rigorous training program.  This is done initially when the employee begins work at the chlorine site (or stationary source).  Annual refresher training then follows it up.\n\nOther methods to reduce risk include a Management of Change and a Pre-startup Safety Review.  The Management of Change subjects a modification of design to a Process Hazard Analysis type review.  This review takes place prior to the change and includes revisions to training, SOP's, P&ID's, flow diagrams, and mechanical integrity.  The Pre-startup Safety Review is then performed after all Management of Change are done but prior to actual startup.  This trial run is done by the TCPA staff to correct any safety or operational problems prior to full startup.\n \nAnother risk reduction method is our 5 year Process Hazard Analysis (PHA) program.  This involves an evaluation of all processes and a \"what if\" occurrence analysis.\n\nIf in spit"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 15352,
      "SummaryText": "e of these preventive measures a release occurs, NJDWSC has an Emergency Response Program.  This details immediate operator response to stop or contain a release.  Supervisory assistance is then immediately called for and a decision made from the operator's description of the incident.  A site emergency response team can then be assembled to mitigate the release.  The Passaic County Emergency Response Team, an Emergency Medical Team, Police and Fire Departments are put on alert and can be called as necessary.  The DEP is kept constantly informed of the incident and mitigation process until the leak is contained.\n\nEmergency Response Plan (ERP):\n\nThe ERP clearly delineates a team leader and a team of 19 members.  The number of team members is large to provide for back up teams as well as unavailable individuals.  All members of the team are trained in chlorine leak mitigation, use of repair kits for ton chlorine containers, donning of self contained breathing apparatus, and Level B protective suits.  At least one (1) simulated release drill is held a year.  All members of the ERT are given 24 hours of refresher training a year by a qualified outside specialist.  In addition, all employees on-site are given training once a year on Evacuation Programs.  After a release an immediate incident investigation is done to determine cause and effect.  The recommended changes are put into effect so that the incident will not reoccur.\n\n5 year Accident Updated History:\n\nThe above programs have achieved their goals.  There have been no accidents in the past 5 years with off-site consequences or on-site injuries.\n\nPlanned Changes to Improve Safety:\n\nCurrently NJDWSC is working on installing ROV's (remote operating valves) on the emergency gas lines at the Chemical Building.  ROV's allow an operator to close off the chlorine feed without entering a room where a chlorine release has occurred.  This protects the operator from exposure as well as starting mitigation of the leak.  Ultima"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 15352,
      "SummaryText": "tely this will reduce risk both on and off site.  \n\nNJDWSC plans to remove the gaseous chlorine (decommission) at the OTP by the end of 1999.  The LGH chlorine system will be decommissioned next year, 2000.  Decommissioning these systems will remove the risk and improve safety both on and off site."
    }
  ]
}