{
  "FacilityID": 15378,
  "FacilityName": "C&S WHOLESALE GOCERS INC. HATFIELD",
  "FacilityStr1": "95 N.HATFIELD RD",
  "FacilityStr2": null,
  "FacilityCity": "HATFIELD",
  "FacilityState": "MA",
  "FacilityZipCode": "01066",
  "Facility4DigitZipExt": "9998",
  "FacilityCountyFIPS": "25015",
  "LEPC": null,
  "FacilityLatDecDegs": "42.398611",
  "FacilityLongDecDegs": "-72.618889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1842467,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "C&S WHOLESALE GROCERS INC.",
  "OperatorStr1": "OLD FERRY RD",
  "OperatorStr2": null,
  "OperatorCity": "BRATTLEBORO",
  "OperatorStateFIPS": null,
  "OperatorZipCode": null,
  "OperatorZipCodeExt": null,
  "FTE": 500,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000155805",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1995-11-13 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": "VT.",
  "ForeignZipCode": "05302",
  "ForeignCountry": "US",
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.397509,
  "FRS_Long": -72.613546,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 21147,
      "AltID": "AMMONIA REFRIGERATION",
      "FacilityID": 15378,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 26901,
          "ProcessID": 21147,
          "ChemicalID": 56,
          "Quantity": 54000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 21705,
          "ProcessID": 21147,
          "NAICSCode": "42241",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 11452,
              "Process_NAICS_ID": 21705,
              "SafetyReviewDate": "1999-05-01 00:00:00",
              "PHA_Date": "1999-05-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-07-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "computer controls enable us to control refrigeration from a remote location",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "supply and exhaust fans that are controlled by ammonia detection system.",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-01 00:00:00",
              "TrainingReviewDate": "1999-05-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-16 00:00:00",
              "EquipmentTested": "COMPRESSORS, CONDENSERS,EVAPORATERS, PUMPS",
              "ChangeMgmtDate": "1995-10-01 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-01 00:00:00",
              "PreStartupReviewDate": "1995-11-13 00:00:00",
              "ComplianceAuditDate": "1999-05-05 00:00:00",
              "AuditCompletionDate": "1999-07-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-05 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-05 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-05 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 16206,
                  "PreventionProgram3ID": 11452,
                  "ProcessChemicalID": 26901
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 15378,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-29 00:00:00",
    "ERTrainingDate": "1999-05-24 00:00:00",
    "CoordinatingAgencyName": "HATFIELD FIRE DEPT.",
    "CoordinatingAgencyPhone": "4132479008",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15378,
      "SummaryText": "C & S Wholesale Grocers, Inc.\nFacility Maintenance / Engineering Department\n\nEPA - Risk Management Program\nExecutive Summary \n\nHatfield North Facility\n95 North Hatfield Road\nHatfield, Ma.\n\nAccidental Release Prevention and Emergency Policies\n\n\tC& S Wholesale Grocers, Inc. is the third largest grocery wholesaler in the United States.  We have facilities located in six states in the greater New England region, massing over 5million square feet of distribution warehouses.  C&S Wholesale Grocers management team understands the responsibility in protecting its employees, and surrounding environmental receptors.  The continued safety of all persons within the property boundaries and adjacent receptors will continue to be a priority of our maintenance and engineering team.  This facility incorporates a proactive and reactive emergency response program encompassing both systems to mitigate accidental releases, and preventative measures.  This program is designed and maintained in accordance with OSHA's existing Process Safety Management of highly hazardous chemicals, 29CFR1910.119 and new EPA's Risk Management Program regulation under ,40CPRPart 68.\nThe V.P. of Maintenance and Engineering is responsible for the management of the prevention and emergency response programs.\tThe design and management of our programs has been facilitated by both in-house and outsourced professionals.  Its purpose is to prevent and plan for the occurrence of a significant release.  The program intent and application is to effectively minimize the consequences of  a significant release of hazardous and potentially toxic substances. \n\nFacility Overview and Regulated Substances Handled\n\n\tThe facility located at the above-mentioned address, is subject to Program 3 of the EPA's RM Program.  The facility encompasses approximately 465,000 square feet of  ammonia refrigerated warehouse.  This facility contains a maximum inventory of 54000lbs of anhydrous ammonia.\n(CAS # 7662-41-7).  Since the possibili"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15378,
      "SummaryText": "ty of a catastrophic release could affect offsite receptors, the systems are subject to the Program # requirements of the RM program.  The system is used to control various temperatures of food products located within the facility.  The system is controlled by a central computer command center and monitored at all times for specified points.  The system can be controlled both at the central computer, and remotely via modem ports.  The use of ammonia sensors within the engine rooms and immediate area are connected to an alarm system and corresponding alert system.  All responsible parties are notified via telecommunication systems, beepers and pagers from a central monitoring station. \n\nSummary of Worst-Case and Alternate Case Scenarios\n\nThe information contained within the scenarios provided has been used for its probability and potential of an actual occurrence.  After developing several potential scenarios for each area, the worst case model of each required scenario was used for this filing.  The commitment of C&S is to take the, \"high road\" in regards to its safety programs and implementations of OSHA and EPA guidelines.  It is believed that the safest approach is not only best but also required.  The modeling software utilized for this submission is, RMP COMP.\n\n\n\n\n\n\n\nWorst Case Scenario\n \n\tThe worst case scenario for this facility involves the release of 14,400 lbs. of anhydrous ammonia, under a release rate of  792 lbs/min. within an enclosed space, in direct contact with outside air due to a failure within the high pressure receiver.  The modeling software utilized for this scenario, RMP COMP, has used a release duration of 10min, liquefied under pressure, with a with speed of 3.4 MPH, a stability class of F with an air temperature of 77 degrees F.  The resulting ammonia could travel 1.6 miles before dispersing enough to no longer pose a hazard to the public. (Toxic endpoint @ 0.14 mg/l :basis ERPG-2) \nThe Worst-case release scenario is unlikely for the follo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 15378,
      "SummaryText": "wing reasons:\n                -The worst-case weather conditions which were used for this scenario are uncommon;\n               -Industry standards were followed for the manufacture and quality control of the vessels and       IIAR guidelines followed for installation:\n               -Ammonia is not corrosive in this service and the vessels are relatively new.\n\t-Pressure safety valves limit operating pressures in these vessels\n\t-Corporate commitment for five- year change-out of pressure safety valves;\n-The facility has preventative maintenance program in place to maintain the on-going integrity of      the vessels;\n-The facility has a training program designed to ensure that the system is operated by qualified    personnel:\n-Areas are designated \"authorized personnel only\" and kept locked; \n               -The facility emergency response procedures which enable trained personnel  to respond quickly        to isolate any potential release.\n\n\nAlternateCase Scenario\n \nThe alternative release scenario at the facility involves the release of 54000 pounds of anhydrous ammonia, under a release rate of 1320 lbs/min. over a 40 minute period, due to a fracture in a =\" liquid bypass line.  Under alternative release weather conditions, wind speed 6.7 MPH, stability class D, resulting ammonia could travel 0.5 miles before dispersing enough to no longer pose a hazard to the public. (Toxic endpoint @ 0.14 mg/l :basis ERPG-2)\n\n-The Alternative release scenario is unlikely for the following reasons:\n\t-Industry standards were followed for the manufacture and quality control of the lines \n\t  and IIAR guidelines followed for installation;\n\t-Ammonia is not corrosive in this service and the vessels are relatively new;\n-The facility has preventative maintenance program in place to maintain the on-going integrity of        the lines;\n               -The facility has a training program designed to ensure that the system is operated by qualified            personnel: \n-Areas are designated a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 15378,
      "SummaryText": "uthorized personnel only and kept locked;\n-The facility emergency response procedures which enable trained personnel  to respond quickly     to isolate any potential release.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDescription of the Accidental Release Prevention Program\n\n7 Employee Participation   This program involves the employees in establishing and implementing the program.  Employees are also in involved when a process hazard analysis is conducted, and audited.  The program also ensures that all employees have complete access to the program. \n7 Process Safety Information  Collected information is provided which enables the employees to identify and understand the potential hazards of the system.  The written information includes the ammonia MSDS and a description of the design of the ammonia refrigeration system.\n7 Process Hazard Analysis  Written formal studies conducted utilizing the, \"What-if  / Checklist\" protocol have been completed to identify all feasible potential hazards.\n7 Operating Procedures   Written procedures have been generated to detail and describe safe and practical standard procedures to safely operate and maintain the ammonia refrigeration system and its integral components.\n7  Training  An in-depth, comprehensive training program has been developed to meet and exceed training guidelines as issued by OSHA, and the IIAR.  This training encompasses both classroom instruction, and practical exams and observations. Annual refresher training exercises are conducted to maintain and certify our refrigeration technicians and level A hazmat team.\n7 Contractors  All outsourced contractors must pass a safety orientation and required provide criteria, regardless of their interaction with the ammonia refrigeration system.  Additionally contractors are periodically reviewed for their compliance with company protocol.  All outsourced contractors are coordinated by the maintenance and engineering department for inclusion in this requisite.\n7 Pre-startup Safety Review  A pre-startu"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 15378,
      "SummaryText": "p safety review is completed for all new ammonia projects to verify that all implemented safety programs are in place.  All projects completed for the ammonia refrigeration system are reviewed for their respective scope of work, completeness and compliance with design standards.  \n7 Mechanical Integrity   This program has been developed to maintain the system and its components, using preventative maintenance measures as dictated by manufactures and IIAR recommendations. Annual inspections performed by a Factory Mutual representative of the boiler and machinery division, are completed to add to the completeness of our program.\n7 Hot Work Permit   The development and use of these permits is mandatory for all employees and contractors.  The permits are issued by the maintenance and engineering department and are reviewed by Factory Mutual representative.  No cutting, welding or burning shall commence without the issuance of a hot work permit.\n7 Management of Change   All changes to the ammonia refrigeration system are documented as dictated by OSHA under the PSM.  Written documentation is generated and filed per company directives.\n7 Incident Investigation    An incident investigation team has been assembled comprised of ammonia refrigeration technicians, refrigeration manager and the V.P. of Maintenance and Engineering.  This team reviews all incidents and near incidents, and generates documentation for the occurrence.\n7 Compliance Audits   Current OSHA PSM programs are audited per established guidelines to ensure completeness and accuracy. Audits have been completed in preparation for this submission.\n\n\n\n\n\n\nFive-Year Accident History\n\nNo-ammonia-related incidents have been identified for the facility in the previous five years resulting in on-site or off-site consequences.  No releases of substantial amounts ie.  > 10 lbs. have been experienced.\n\n\nEmergency Response Program\n\n\tA  corporate wide emergency response program has been implemented at all refrigerated wareh"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 15378,
      "SummaryText": "ouse facilities.  This program includes procedures describing the response efforts necessary for an ammonia incident, and other emergencies.  This program is coordinated with local fire departments.  The corporate wide commitment to employee and community safety has been demonstrated by the purchase, installation and maintenance of a fully equipped \"Level A\tHazMat Trailer\" on site.  An (30)member hazmat team has been collected, and trained to effectively mitigate an ammonia incident detected by alarm and alert systems.\n\n7 Organizational plan and responsibilities legend\n7 Communication procedures and requisites\n7 Detailed action plans and contingency efforts\n7 Fire aid procedures\n7 Emergency responders are located at each facility\n7 EMT procedures\n7 Evacuation plans\n7 Description of outside assistance available\n7 Site re-entry procedures and requisites\n7 Training programs and drills\n\n\nFacility Design Criteria\n\nThe design specifications for the facility incorporate several measures to aid in the initial prevention and preventative maintenance of the ammonia refrigeration system.  The construction \nof an interior catwalk aids in the protection of evaporators and lines."
    }
  ]
}