{
  "FacilityID": 1542,
  "FacilityName": "Shady Hills Wastewater Treatment Plant",
  "FacilityStr1": "14220 Hays Road",
  "FacilityStr2": null,
  "FacilityCity": "Spring Hill",
  "FacilityState": "FL",
  "FacilityZipCode": "34610",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12101",
  "LEPC": "District 8 LEPC",
  "FacilityLatDecDegs": "28.377222",
  "FacilityLongDecDegs": "-82.57",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Pasco County Utility Services",
  "OperatorStr1": "7530 Little Road Suite 205",
  "OperatorStr2": null,
  "OperatorCity": "New Port Richey",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "34654",
  "OperatorZipCodeExt": null,
  "RMPContact": "Harold Bungard",
  "RMPTitle": "Operations Manager",
  "FTE": 3,
  "OtherEPAFacilityID": "FLA012741",
  "EPAFacilityID": "100000018731",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-02-11 00:00:00",
  "SafetyInspectionBy": "County Safety Officer",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-01-25 00:00:00",
  "DeRegistrationEffectiveDate": "2003-04-02 00:00:00",
  "AnniversaryDate": "2004-06-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.4",
  "FRS_Lat": 28.36474,
  "FRS_Long": -82.56899,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Switched from gas chlorine to liquid chlorine.",
  "_processes": [
    {
      "ProcessID": 1669,
      "AltID": "Wastewater treatment",
      "FacilityID": 1542,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1705,
          "ProcessID": 1669,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1775,
          "ProcessID": 1669,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 501775,
          "ProcessID": 1669,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1542,
      "SummaryText": "a.     The Pasco County Utilities Department accidental release prevention policy combines sound operating procedures, and management practices.  The policy complies with all pertinent procedures of the U. S. Environmental Protection Agency (EPA) Accidental Release Prevention Program.  The Pasco County emergency response policy involves the preparation of site specific response plans, taking into consideration the available emergency response services surrounding each facility.  The emergency response policy is in accordance with the EPA Emergency Response Program requirements.\n\nb.     The Shady Hills Wastewater Treatment Plant (WWTP) is located at 14220 Hays Road in Pasco County, approximately three (3) miles north of State Road (S.R.) 52.  The WWTP employs advanced secondary treatment processes to remove solids and contaminants from the wastewater and reclaim a high quality treated effluent to be used as a source of irrigation water.  The final treatment process involves the treatment of the effluent with chlorine.  Disinfection of all irrigation water to be applied to publicly accessable lands is mandated by Florida Department of Environmental Protection rules (F.A.C. 62-600) and is necessary to prevent waterborne diseases such as cholera, typhoid, and dysentery.  The WWTP contains a chlorination room which houses two chlorinators and various process piping; an outdoor, open, roofed chlorine storage area with up to four \"ton\" chlorine containers; and assorted safety equipment.  Adjacent to the chlorination room is the operations room containing flow and turbidity recorders, various electrical panels, and additional safety equipment.  the facility is staffed 16 hours per day, seven days per week.  The facility is equipped with an auto dialer to notify on-call personnel of a problem when the plant is not staffed.\n\nc.     The offsite consequence analysis takes into consideration two chlorine release scenarios, specified as \"worst-case release\" and \"alternative scena"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1542,
      "SummaryText": "rio\".  The \"worst-case release\" is defined by the EPA as \"the release of the largest quantity of a regulated substance (chlorine gas) from a vessel or process line failure that results in the greatest distance to a specified endpoint\".  The \"alternative scenario\" is defined as the \"more probable\" scenario of a failure, than is the \"worst-case release\".\n\nAtmospheric models determine the distance from a point of release to the \"toxic endpoint\" where the chlorine concentration has decreased to three (3) ppm as selected by the EPA.  The toxic endpoint selected by the EPA is based on Emergency Response Planning Guide 2 (ERPG-2) \"toxic endpoint\" which is defined by the American Industrial Hygiene Association as \"the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing life-threatening health effects\".  The ERPG-2 for chlorine is 0.0087 mg/l or 3 ppm (40 CFR 68.22, Appendix A).  The residential population found within the circle defined by the radius to the toxic endpoint for each scenario has been determined using the 1990 census data projections for 1997 from geographic information systems (GIS) software produced by Environmental Systems Research Institute (ESRI).  For both the worst-case and the alternative scenario the percentage of each census tract inside the area defined by the toxic endpoint was estimated and multiplied by the total population for each affected tract to determine the residential population affected by an accidental release.\n\nThe worst-case release scenario at the Shady Hills WWTP involves the release of one one-ton cylinder of chlorine (2,000 lbs.) outdoors.  The offsite consequence analysis for this scenario is determined based on predefined conditions set by the EPA.  The general conditions are as follows:  the release of the entire contents from the cylinder as a gas in 10 minutes, an atmospheric stability class of F, wind speed of 1.5 m/s, am"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1542,
      "SummaryText": "bient temperature of 25 degrees celsius, and a relative humidity of 50 percent.  The conditions surrounding the Shady Hills WWTP are defined as \"rural\" by the EPA.  Based on exhibit 4-3 of the Risk Management Program Guidance for Wastewater Treatment Plants (EPA 550-B-98-010 October 1998), the distance to the toxic endpoint for the worst-case release scenario is 3.0 miles.  The distance closely corresponds to independent site specific modeling performed using the DEGADIS model.\n\nThe case study for the alternative release scenario involves the failure of a 5/16\" gas valve to close.  It is assumed that chlorine detectors alert the WWTP operators to the release.  The amount of chlorine released is equal to 2,000 lbs., released at an average rate corresponding to the 5/16\" hole, which equates to a release rate of 240 lb/min.  The entire contents of the cylinder are released in 8.3 minutes.  Exhibit 4-13 of the Risk Management Program Guidance for Wastewater Treatment Plants (EPA 550-B-98-010 October 1998), determines that the distance to the toxic endpoint is 0.7 miles.\n\nd.     The Pasco County Utility Services accidental release prevention program consists of the following elements:\n\n       -     The ongoing and continuous training of the operators.\n       -     A preventative maintenance program that follows manufacturer's specifications and acceptable \n             engineering practices.\n       -     The Implementation of state-of-the-art process and safety equipment.\n       -     Ongoing equipment and hazard reviews.\n       -     The use of current operations and maintenance manuals.\n       -     Continued equipment inspections.\n\n       The Pasco County Utility Services have also included the following chemical specific prevention steps:\n\n       -     The use of chlorine dectectors.\n       -     The use of self-contained breathing apparatuses (SCBA), when handling chlorine containers.\n       -     All operators have been trained to be aware of the hazardous effects "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1542,
      "SummaryText": "and toxic properties of\n              chlorine.\n\ne.     The Shady Hills WWTP has experienced no accidental releases of chlorine over the past five (5) years.\n\nf.     The Shady Hills facility has an emergency response plan that has been coordinated with the Local Emergency Planning Committe (LEPC).  This plan consists of a chain of command and decision tree for the response to a release of chlorine.  The plan coordinates local and regional organizations to combat the effects of the release."
    }
  ]
}