{
  "FacilityID": 15497,
  "FacilityName": "Central Valley Water Reclamation",
  "FacilityStr1": "800 West Central Valley Road",
  "FacilityStr2": null,
  "FacilityCity": "Salt Lake City",
  "FacilityState": "UT",
  "FacilityZipCode": "84119",
  "Facility4DigitZipExt": "3379",
  "FacilityCountyFIPS": "49035",
  "LEPC": "Salt Lake County LEPC",
  "FacilityLatDecDegs": "40.705556",
  "FacilityLongDecDegs": "-111.913333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Central Valley Water Reclamation",
  "Company2Name": "Central Valley Water Reclamation",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Central Valley Water Reclamation",
  "OperatorStr1": "800 West Central Valley Road",
  "OperatorStr2": null,
  "OperatorCity": "Salt Lake City",
  "OperatorStateFIPS": "UT",
  "OperatorZipCode": "84119",
  "OperatorZipCodeExt": "3379",
  "RMPContact": "William H. Fox",
  "RMPTitle": "Project Engineer",
  "FTE": 72,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000018688",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-10 00:00:00",
  "SafetyInspectionBy": "Insurance C.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-29 00:00:00",
  "ErrorReportDate": "1999-07-29 00:00:00",
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-10 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2010-07-15 00:00:00",
  "DeRegistrationEffectiveDate": "2010-06-01 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.70611,
  "FRS_Long": -111.915,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 21392,
      "AltID": null,
      "FacilityID": 15497,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 21956,
          "ProcessID": 21392,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 27212,
          "ProcessID": 21392,
          "ChemicalID": 62,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 27213,
          "ProcessID": 21392,
          "ChemicalID": 49,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 527212,
          "ProcessID": 21392,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 527213,
          "ProcessID": 21392,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15497,
      "SummaryText": "    Central Valley Water Reclamation Facility is a wastewater treatment plant located at about the middle of the Salt Lake Valley.  This plant was put on line in 1988 to replace five old, existing, out dated plants that were having trouble meeting their permits.  This plant was mandated by the EPA to improve the wastewater treatment in the Salt Lake Valley.  Since Central Valley Water Reclamation was organized in 1980 and before the new plant was built, it was faced with  meeting stringent standards with facilities that were old and near the end of their operative life.  Chlorination of the plant effluents was part of the treatment.  In the old plants, this was accomplished with liquid chlorine brought on plant site in ton containers.  Liquid chlorine was used because it was the most cost effective  and was the traditional method of disinfection.  With the advent of the new regional plant, the chlorine was brought on plant site in rail tank cars.  The tank cars are 90 ton cars which requires less handling than any other method and therefore is the most safe.  Also,  new regulations required the addition of sulfur dioxide to eliminate the chlorine residual being discharged to the receiving waters.  This requirement added another hazardous chemical to be handled.  Sulfur dioxide is brought on plant site in tank truck quantities and transferred to a rail tank car stored permanently on site.  Since the start of the new plant, CVWRF has not had a reportable incident with either chlorine or sulfur dioxide.  In spite of the fact that much more hazardous material is stored on plant site, the use of rail cars and bulk quantities have made the process more safe than ever before.  \n\n    CVWRF policy regarding the safety of plant personnel and surrounding population is that we intend to comply with all safety rules and agencies to make this a safe plant and a good neighbor.  CVWRF has a team that is trained in handling both chlorine and sulfur dioxide and is ready to deal with whatev"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15497,
      "SummaryText": "er emergency may arise.  Safety equipment is provided for the spill team and other plant personnel.  This includes SCBA's and equipment to cap leaks at the tank car.  Regular exercises are held to rehearse the procedures necessary to deal with emergencies.\n\n    The Risk Management Program requires CVWRF to analyze what would happen in the unlikely event that a chlorine spill should occur.  This includes what is known as a \"Worst Case Scenario\".  The worst case release scenario involves chlorine since there is considerably more chlorine stored on plant site than sulfur dioxide.  Both of these materials have about the same toxic end point but there is a maximum of 90 tons of chlorine and only about 30 tons of sulfur dioxide on plant site.  Therefore the chlorine worst case release scenario is the more serious.  The worst case scenario consists of the entire 90 tons of chlorine being released in 10 minutes.  Using the chart in Reference Table 1 of the RMP OFFSITE CONSEQUENCE ANALYSIS GUIDANCE for Chlorine, we find the toxic end point is 15 miles.  A 15 mile radius around the Plant site includes about 100% of the Salt Lake Valley, which is only about 26 miles wide and about that long.  This area includes all of down town, a number of hospitals, a number of high schools, a number of elementary schools, a number of rest homes, a number of public parks, a number of day care centers, three prisons, at least two Universities, down town Murray, and a number of just about any other type of sensitive facility that you can imagine to say nothing of a number of business and residential areas.  Under such a scenario as this, there is nothing that Central Valley could do to mitigate the disaster.  By the time personnel could react to the situation, all the Cl2 would be spilled and evaporated and drifting off with the wind.  No corrective action would be of any significant value.\n\n    A more likely scenario is one involving the total rupture of the liquid line leaving the tank car that re"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 15497,
      "SummaryText": "moves the liquid withdrawal valve.  This type of failure could possibly result from neglecting to remove the hose from the tank car before the car is moved.  In such a case, the flow rate from the open line is calculated to be about 22.5 lb/min.  Using the chart in Reference Table 1 of the RMP OFFSITE CONSEQUENCE ANALYSIS GUIDANCE for Chlorine, we find the toxic end point is about 3590 ft, or about 2/3 of a mile.  The area includes one prison and some businesses including a railroad yard and a few residences.\n   \n    As had been stated already, CVWRF has never had a significant release of either Cl2 or SO2.  The most hazardous operation involving either Cl2 or SO2 is the connecting and disconnecting of tanks.  The use of tank cars minimizes the handling and is therefore inherently safer than all other methods of handling either of these materials."
    }
  ]
}