{
  "FacilityID": 15500,
  "FacilityName": "Wabash Alloys, L.L.C",
  "FacilityStr1": "9100 S. 5th St.",
  "FacilityStr2": null,
  "FacilityCity": "Oak Creek",
  "FacilityState": "WI",
  "FacilityZipCode": "53154",
  "Facility4DigitZipExt": "4800",
  "FacilityCountyFIPS": "55079",
  "LEPC": "Milwaukee County LEPC",
  "FacilityLatDecDegs": "43.876444",
  "FacilityLongDecDegs": "-87.848667",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "A5",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 174363044,
  "ParentCompanyName": "Connell, L.L.C",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Wabash Alloys, L.L.C",
  "OperatorStr1": "9100 S. 5th St.",
  "OperatorStr2": null,
  "OperatorCity": "Oak Creek",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53154",
  "OperatorZipCodeExt": "4800",
  "FTE": 89,
  "OtherEPAFacilityID": "53154BSHLL9100S",
  "EPAFacilityID": "100000039665",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": "Wabash Alloys, Milwaukee, Wisconsin",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2001-05-09 00:00:00",
  "DeRegistrationEffectiveDate": "2001-04-01 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.87798,
  "FRS_Long": -87.85332,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 21395,
      "AltID": "Aluminum Demagging",
      "FacilityID": 15500,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 27216,
          "ProcessID": 21395,
          "ChemicalID": 62,
          "Quantity": 180000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 21959,
          "ProcessID": 21395,
          "NAICSCode": "331314",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 11636,
              "Process_NAICS_ID": 21959,
              "SafetyReviewDate": "1998-12-21 00:00:00",
              "PHA_Date": "1999-06-10 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1994-12-28 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Development of ERP, P&IDs, and Mechanical Integrity Program",
              "OpProceduresReviewDate": "1998-12-21 00:00:00",
              "TrainingReviewDate": "1998-12-21 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-01-25 00:00:00",
              "EquipmentInspectionDate": "1999-01-25 00:00:00",
              "EquipmentTested": "Connections, vaporizer, piping, valves, ejectors",
              "ChangeMgmtDate": "1999-01-25 00:00:00",
              "ChangeMgmtReviewDate": "1998-01-25 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1998-12-21 00:00:00",
              "AuditCompletionDate": "1999-06-10 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-12-21 00:00:00",
              "HotWorkPermitReviewDate": "1998-12-21 00:00:00",
              "ContractorSafetyReviewDate": "1998-12-21 00:00:00",
              "ContractorSafetyEvalDate": "1998-12-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 16444,
                  "PreventionProgram3ID": 11636,
                  "ProcessChemicalID": 27216
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 15500,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-12-21 00:00:00",
    "ERTrainingDate": "1999-04-12 00:00:00",
    "CoordinatingAgencyName": "Milwaukee County Emergency Mgmt Ag",
    "CoordinatingAgencyPhone": "4142784709",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 15500,
      "SummaryText": "ee's job tasks.\n\tDesignated personnel have specific responsibilities related to the use of contractors who perform maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to areas where the Chlorine is received, stored, or processed in the facility.  These responsibilities include specific requirements in selection of contractors regarding the contractor's safety performance and programs; the provision of information concerning the emergency action plans related to the process; development and implementation of safe work practices regarding the control of entrance and exit of contract employers and contract employees in the process areas, periodic evaluation of the contractor related to safety management at the process; maintenance of certain records related to contractor employee injury and illness; development of written procedures for any new processes, and provision of training to employees.  \n\tContractors performing work on or adjacent to equipment or processes in which Chlorine is present must have clearance from the Maintenance Supervisor prior to beginning operations.  Each contractor will also complete the Wabash Alloys Divisional Visitor and Contractor Safety Rules form prior to entry into the facility.\n\tIn those cases where contractors will perform work directly to or on the process equipment in which the Chlorine is present, the Safety Coordinator and Maintenance Supervisor will provide an orientation section to them prior to beginning operations.  This orientation will include an introduction to the Wabash Alloys Process Safety Management Program, information concerning the toxicological and physical hazards of Chlorine, and the emergency response plan in the case of an incident involving a release.  Upon completion, the contractor will be issued a permit by the Maintenance Supervisor to begin work.\nThe Wabash facility and the Chlorine Process\n\tWabash Alloys provides employment for 89 workers in Oak Creek, Wisconsin.  This"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 15500,
      "SummaryText": "Accidental release prevention and emergency response policies at Wabash\nThe policy of Wabash Alloys, is to develop those programs necessary to protect the health of its employees against on-the-job hazards which may cause sickness or injury now or in the future.  Also, as the operator of a facility at which substances may be used that in uncontrolled situations could cause harm to the public and damage to the environment, we will strive for environmental excellence with a commitment to continual improvement, pollution prevention and compliance with legislative requirements.  The Risk Management Program (RMP) is one of these programs.\n     Each employee in areas where the RMP is applicable will be knowledgeable of the related policies and procedures and the supervisors or a designated person is required to insure that they understand them.  Employees and supervisors are required to comply with our policies and are subject to corrective action in those cases determined to indicate willful violation.\n\tA written plan of action regarding the implementation of employee participation in the program has been developed as a part of our Release Prevention Program as specified by 29 CFR 1910.119.  A compilation of safety information to enable Wabash Alloys and the employees involved in the chlorine operations to operate safety has been accumulated.  This process safety information includes information pertaining to the toxicological and physical hazards of the chemical listed.  This plan of action includes information pertaining to the technology of the processes, and information pertaining to any equipment used in the processes.\nA complete hazard analysis and study of the chlorine systems' mechanical integrity has been completed on the chlorine receipt, storage, and utilization operations have been completed.  This analysis was completed by safety and health staff, engineering and maintenance personnel, and certain operational personnel.  This analyses involved a review of ea"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15500,
      "SummaryText": "ch operation of the processes to address steps for each operating phase, operating limits, safety and health considerations, and safety systems and their functions.  The assessment also included information concerning the emergency action plans related to the process; development and implementation of safe work practices regarding the control of entrance and exit of personnel in the process areas; pre-startup safety; mechanical integrity of equipment; inspection and testing, correction of deficiencies in equipment, planned or unexpected changes to the process, equipment, and procedures to the processes.\nA system was developed and is maintained to promptly address the team's findings and recommendations.  The hazard analyses will be updated as needed and at least every five (5) years.\n\tWabash Alloys has developed and implemented written operating procedures to provide clear instructions for safely conducting activities involved in the processes at each operation by our employees, consistent with the process safety information and to address steps for each handling phase, limitations, safety and health considerations, and safety systems and their functions.  Other written documentation of standard operating procedures as a part of this program is included in the following documents:\nJob Safety Analyses\nMechanical Integrity Study of Process Equipment\nPreventive Maintenance Program\nWritten Emergency Response Plan\nEmployee Emergency Action and Evacuation Plan\n\tEach employee involved in operations within the processes where the chlorine is received, processed, or used at the facility has been trained in an overview of the processes and in the operating procedures as outlined by OSHA regulations.  Refresher training is required every three years, and more often if necessary.  Training includes:\n\ta.  Emphasis on the specific safety and health hazards;\n\tb.  Emergency operations in the case of a release including shutdown; and\n\tc.  Safe work practices applicable to the employ"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 15500,
      "SummaryText": "facility is one of eight other Aluminum recycling plants in the United States owned by Connell Ltd.  As a manufacturer of aluminum ingots its products are sold globally under its corporate company, Connell, Ltd, 1 International Place, Fort Hill Square, Boston Massachusetts.\n\tThe facility is located in Oak Creek, Wisconsin in the industrial park.  Its Dun and Bradstreet number is 17-436-3044.  Map location 880 0'W X 430 0'N.\n3.3  Site Description:\n\tThe facility is located in the Southwest quarter of the northwest quarter of Section 24, Township 5 North, Range 22 East, Milwaukee county, Wisconsin.  Specifically, the site is located at 9100 South 5th Avenue, Oak Creek, Wisconsin.  The site is approximately 36 acres in size, and is located in a predominantly industrial area of Oak Creek.  The site is serviced with electricity, water, natural gas, and sewer lines.  The water lines, natural gas lines and sewer laterals enter the site from the west.\n\tThe surrounding vicinity consists generally of industrial and manufacturing structures.  The property is bordered on the north by railroad tracks, residences, and the former Perter Cooper Corporation; to the east by Lake Michigan; to the west by 5th Avenue, and the south by the former Allis-Chalmers (DuPont) site.\n\tThe western, active portion of the site is mostly occupied by the Wabash by the Wabash facility building.  Scrap metal piles, loading docks, and railroad spurs are to the east of the building.  Chlorine cars and propane tanks setting on paved ground are to the north of the building.  The area on the western side to the south of the building provides site access and is for employee parking.  The 12 acres to the west of the site are fenced.  Access to this area is protected by a locked gate at the western boundary.  Lake Michigan is located approximately 1,500 feet east of the facility.\nOperation Description\nChlorine\n\tPreviously, form 1968 until 1987, the site was owned and operated by Vulcan Material Company.  While"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 15500,
      "SummaryText": "owned by Vulcan Materials a secondary aluminum smelter operation was constructed and is presently in use by Wabash Alloys.  The site was purchased by Wabash Alloys in June 1987.\n\tThe site process involves the sorting, grading, processing (removing organics via a rotary kiln), melting, and alloying of metals for sale.  As part of the sorting process, large aluminum scrap is shredded or crushed, and ferrous metals are removed using a maseparation process.  A dryer with a secondary combustion unit and baghouse is used to remove impurities from the aluminum scrap such as moisture, paints and resins.\n\tThe sorted aluminum is charged into one of three furnaces where the metal is melted.  Once melted, various additives are used to modify the composition and hence the physical characteristics of the metal.  The metal is degassed by bubbling nitrogen through the molten metal.   Magnesium is removed by bubbling chlorine through the melt to form magnesium chloride.  Materials kept on-site for the process are aluminum, magnesium, zinc, copper, silicon, sodium, beryllium, and strontium.  Approximately 8,000,000 pounds of these materials are on-site at any given time.\n\tOnce the molten product is prepared, the melt is either poured and cooled as ingots or sows, or is transferred to heated crucibles for shipment as a molten material.  Particulate emissions from the crusher are controlled with a baghouse.  The emissions from the dryer are treated first using a secondary combustion unit, and then with a baghouse.  Emissions from melters, ingot and sow molding processes, and dross cooling operations are controlled using a baghouse.\nGeography and Weather:\n\tOak Creek is located along Lake Michigan in the southeast corner of Milwaukee County and adjacent to the City of Milwaukee.  The city is comprised of 28.4 square miles of area and is 85 miles from Chicago.  The City of Oak Creek is located 10 miles south of the Port of Milwaukee.\nPopulation & Workforce\n\tThe population of the city as o"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 15500,
      "SummaryText": "f 1994 according to the US Bureau of Census, Wisconsin Department of Administration, and SEWRPC is 21,984.  The Milwaukee County Employment as of March 1993 totaled 503,100.\n\tThe city has two industrial parks.  Northbranch and Southbranch Industrial Parks together contain approximately 1500 acres.  Nearly 100 firms are located in the parks.\n\tHousing runs the gamut from mobile to estate homes and condominiums.  A little more than one-half of all the housing units are owner-occupied.  Mobile home parks (totaling 316 units) are available in three locations in the city.\nTransportation\n\tOak Creek is accessible by road, rail or air.  It is served by our Interstate 94 interchanges.  I-94 passes through the city in a north/south direction.  Rail freight service is provided by the Soo Line Railroad Company and Union Pacific Railroad.  Rail Passenger service is provided by Amtrak.  Air service is provided by three general aviation airports:  General Mitchell International Airport, located adjacent to the city limits; John H. Batten Field, located seven miles southeast of the city limits; and Rainbow Airport, located four miles west of the city limits.\n\tThere are 385 trucking and warehousing establishments in Milwaukee County.\nEmergency Services\n\tOak Creek provided a city-wide 911 system in conjunction with its police and fire departments.  Fire service is provided out of two fire stations.  Police service is provided out of a centrally located facility.  The Highway Department provides snow removal and street maintenance services.\n\tThe City has three full-service hospitals located in neighboring communities:  St. Luke's South Shore in Cudhy; St Francis Hospital in Milwaukee; and St. Luke's Medical Center in Milwaukee.  There are two physician clinics within the city with physicians specializing I primary care internal medicine, pediatrics, occupational medicine, dentistry, an a variety of other specialties.\nSchools\n\tThe City has five elementary schools, two middle schools, on"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 15500,
      "SummaryText": "e high school, four parochial-elementary schools, four pre-schools, one daycare facility, two colleges and universities, and one technical/vocational school.\nParks & Recreation\nOak Creek is located near two existing County parks.  Plans are underway or construction of a 300 acre and 6100 feet of shoreline frontage on Lake Michigan. \nWorst-case release scenario and alternative release scenario\n\tAs a part of the Wabash Alloys proactive program concerning the hazards of chlorine to its' workers and the surrounding public, its staff has conducted a thorough hazard assessment.\n\tFor the hazard assessment and the RMP, populations potentially affected are defined as those within a circle that has as its center the point of release and its radius the distance to the toxic or flammable endpoint.  Owners or operators may use Census data to define this population.  The presence of schools, hospitals, other institutions, public arenas, recreational areas, and large commercial and industrial developments that can be identified on street maps within this circle must be noted.  The presence of environmental receptors within this circle must also be listed.  The EPA has defined environmental receptors as natural areas such as national or state parks, forests, or monuments; officially designated wildlife sanctuaries, preserves, refuges, or areas; and Federal wilderness areas, that can be exposed to an accidental release.\n\tThe worst case scenario for chlorine was decided as the complete rapid loss of 90 tons of chlorine during a one minute time frame. The following information was determined using the Automated Resource for Chemical Hazard Incident Evaluation (ARCHIE) model, based on the stability class D , 5.5 mph wind speed, and the IDLH level of 10ppm for chlorine.  This resulted in a release rate of 180,000 lbs/min, and an end point of 30.05 miles from the spill point during summer season at 85 degrees F.\n\tThe alternate case scenario for chlorine was decided as the loss of chlorin"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 15500,
      "SummaryText": "e resulting from a release through a 1 inch line break. . The following information was determined using the Automated Resource for Chemical Hazard Incident Evaluation (ARCHIE) model, based on the stability class D, 4.5 mph wind speed, and the level of 3ppm for chlorine.  This resulted in a release rate of 2 lbs/min, for a duration of 15 minutes, and an end point of .09 miles from the spill point during the summer season at 900 F.\nGeneral accidental release prevention program and chemical-specific prevention steps\n\tPrevention of a release is a core component of the Wabash, LLC Risk Management Program.  This program is designed to insure proper work practices and an on-going mechanical integrity program.  This program also insures compliance with 29 CFR 1910.38, 1910.120, 1910.1200, 40 CFR, Part 68, Part 112, and Part 260.\n\tWabash Alloys has developed and implemented written operating procedures to provide clear instructions for safely conducting activities involved in the processes at each operation by our employees, consistent with the process safety information and to address steps for each handling phase, limitations, safety and health considerations, and safety systems and their functions.  Other written documentation of standard operating procedures as a part of this program is included in the following documents:\nMechanical Integrity Study of Process Equipment\nPreventive Maintenance Program\nWritten Emergency Response Plan\nEmployee Emergency Action and Evacuation Plan\nJob Safety Analysis\nTraining\nEach employee involved in operations within the process where Chlorine is received, processed, or used at the facility has been trained in an overview of the process and in the operating procedures as outlined by 29 CFR 1910.119.  Refresher training is provided no less than every three years and more often if necessary. \nMechanical Integrity\nAlso, each maintenance person who has responsibilities to perform maintenance on the process components receives training on an a"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 15500,
      "SummaryText": "s needed basis, but no less than every three years.\nEmergency Response\nA team of individuals has been trained and is equipped as a HAZMAT team.  The team is equipped with Self-Contained Breathing Apparatuses, Level A suits and monitoring equipment to respond in an offensive manner.\n\tA record of the training, which contains the identity of the employee, the date of training, and the means, used to verify that the employee understood the training is completed and maintained.\n\tContractors.\n\tDesignated personnel have specific responsibilities related to the use of contractors who perform maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to areas where the Chlorine is received, stored, or processed in the facility.  These responsibilities include specific requirements in selection of contractors regarding the contractor's safety performance and programs; the provision of information concerning the emergency action plans related to the process; development and implementation of safe work practices regarding the control of entrance and exit of contract employers and contract employees in the process areas, periodic evaluation of the contractor related to safety management at the process; maintenance of certain records related to contractor employee injury and illness; development of written procedures for any new processes, and provision of training to employees.  \nFive-year accident history\nNo incidences of chlorine release have occurred at the facility that resulted in deaths or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\nEmergency response program\n\tDue to the receipt, usage, and storage of Chlorine in large quantities, Wabash Alloys takes a proactive approach to the protection of its employees, the public, and the environment.  In consideration of the hazardous effects that Chlorine may have on human health and the environment the f"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 15500,
      "SummaryText": "ollowing outlines the facilities prevention and emergency response plans:\n\tWritten Emergency Response Plan\n\tOffensively Trained & Equipped Emergency Action Team in accordance with 29 CFR 1910.120\n\tDevelopment of a Written Implementation Plan of Action\n\tConduction of Hazard Analysis on routine and periodic basis\n\tDevelopment of and documentation of safe work practices\n\tInitial and periodic training of employees\n\tConduction of pre-startup safety reviews\n\tConduction of Compliance Audits\n\tConduction of incident investigations\n\tContractor Program Safety Program\n\tHot Work Permit Program\n\tProcess Safety Management & Chemical Accidental Release Prevention Committee\n\tMechanical Integrity & Preventive Maintenance Program\n\tDetermination and planning for Worst-Case and Alternative Case Release Scenarios\n\tContinual evaluation for methods to improve facility safety - Safety Committee\n\tMeetings with the Local Emergency Planning Committee and Fir Department\n\nPlanned changes to improve safety\n\tIn an attempt to insure a continual improvement in the facility worker protection and release prevention programs, training concerning this safety and environmental program and others is conducted for eight hours each month.  This training requires the attendance by all personnel whose job may have any relationship to the chlorine operations."
    }
  ]
}