{
  "FacilityID": 15589,
  "FacilityName": "Reddy-Phoenix",
  "FacilityStr1": "4626 South 40th Street",
  "FacilityStr2": null,
  "FacilityCity": "Phoenix",
  "FacilityState": "AZ",
  "FacilityZipCode": "85040",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.407222",
  "FacilityLongDecDegs": "-111.999722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Packaged Ice, Inc./Reddy Ice Corporation",
  "Company2Name": null,
  "CompanyDUNS": 364514133,
  "Company2DUNS": 0,
  "OperatorName": "Packaged Ice, Inc./Reddy Ice Corp",
  "OperatorStr1": "3535 Travis Street",
  "OperatorStr2": "Suite 170",
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75204",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bob Crow",
  "RMPTitle": "Engineer",
  "FTE": 75,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000133526",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.40514,
  "FRS_Long": -111.99529,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 21546,
      "AltID": null,
      "FacilityID": 15589,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 22115,
          "ProcessID": 21546,
          "NAICSCode": "312113",
          "_desc": {
            "NAICS_CODE": "312113",
            "NAICS_DESCRIPTION": "Ice Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 27395,
          "ProcessID": 21546,
          "ChemicalID": 56,
          "Quantity": 19000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 527395,
          "ProcessID": 21546,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15589,
      "SummaryText": "The Reddy Ice facility located in Phoenix, Arizona manufactures ice for wholesale/retail distribution.  The facility utilizes approximately 19,000 pounds of anhydrous ammonia as a refrigerant for ice manufacturing and storage.\n\nThe Reddy - Phoenix plant #352 facility operates a standard refrigeration design using anhydrous ammonia as its refrigerant.  The system has five screw compressors, twelve P-34 Vogt ice machines, two accumulators, three transfer vessels, a thermosyphon vessel, seven evaporators, one water chiller, and four evaporator condensers.  Each of the compressors has numerous protective controls (motor overload, high discharge temperature, high discharge pressure, low suction pressure, and low oil pressure) that will shut down the compressor if operating limits are violated.  The compressors are run and shut down manually; however, the ice makers are operated through the computer.\n\nAll five compressors use the same discharge line and condensers.  Compressor #5 uses an independent suction line; it runs the seven evaporators at 15 pounds of pressure, cooling the storage vault with three evaporators and the rake room with four evaporators.  The #1 through #4 compressors are used for the twelve ice machines.\n\nThe water chiller cools the water before it goes to the ice machines.  The chiller gets its suction from the economizer ports of #2 through #5 compressors.\n\nBeginning with the ice machines, the flow of anhydrous ammonia is as follows:\n\nThe liquid anhydrous ammonia leaves the controlled pressure receiver to the ice machines.  It leaves the ice machines as a low pressure gas at 25 pounds of pressure and flows to the large accumulator.  The anhydrous ammonia then flows to the #1 through #4 compressors where it is compressed into a hot gas and then to the four evaporator condensers where it is cooled and condensed back into a liquid.  From the condensers it will go to the thermosyphon vessel where a portion goes to the compressor oil coolers.  The liquid "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15589,
      "SummaryText": "anhydrous ammonia not used for oil cooling is transferred back to the receiver.\n\nThe evaporators work in a similar fashion except at a lower pressure.  Liquid leaves the receiver to the evaporators at a low pressure gas of 15 pounds.  It then goes to the small accumulator and on to the #5 compressor.  It leaves the #5 compressor as a hot gas to the condensers, on top the thermosyphon as a liquid and to the receiver.\n\n\nAny liquid that builds up in the accumulators will run into the transfer vessels and will be transferred to the receiver.  The receiver is maintained at 90 pounds of pressure, controlled by the economizer ports of #2 through #5 compressors.\n\nAn outside supplier delivers anhydrous ammonia 1 to 2 times per year to replenish the ammonia in the system.\n\nAnhydrous ammonia, when properly used, has proven to be a safe and reliable refrigerant.  The sharp odor of ammonia provides its own warning agent.  Practically all accidents involving anhydrous ammonia are the result of a lack of knowledge, misunderstanding, carelessness or poorly maintained or unsuitable equipment.\n\nThe Reddy Ice Phoenix facility is committed to operating a safe and compliant facility for the protection of its employees, the general public, and the environment.  The facility has multiple safeguards pertinent to the ammonia process.  These include an ammonia detection and alarm system, exhaust purge fans, controls which shut down the compressors if operating limits are violated, and the capability of shutting the entire system down if required.  Administrative controls are in place which limit the utilization of vessels at approximately 33% of their intended capacities.\n\nThe company has developed an emergency response and action plan which includes notification of emergency authorities/agencies and the public, to evacuation and first responder duties.\n\n\nMANAGEMENT SYSTEM\n\nThe Reddy Ice Phoenix facility has developed a management system to oversee the implementation of the risk management p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 15589,
      "SummaryText": "rogram elements.  A single person has been identified that has overall responsibility for developing, implementing and integrating the risk management program requirements.\n\nThere may be different levels of responsibility assigned, depending on the size and complexity of the facility.  A Risk Management Coordinator may be responsible for developing and implementing the overall risk management program, while other personnel may be responsible for developing and implementing the operating procedures element or developing a particular operating procedure.  The management system is, therefore, operating at each of these levels depending on the way these responsibilities are carried out.\n\nThe Risk Management Coordinator is responsible for all aspects of the development and update of the overall Risk Management Program.  The coordinator will determine the necessity of establishing additional responsibilities for facility personnel concerning various operations at the facility.  As other personnel are identified, they will be documented and lines of authority will be defined within the management system.\n\nBy defining the lines of authority and roles and responsibilities of staff that oversee the risk management program elements it will:\n\n    Ensure effective communication about process changes;\n    Clarify the roles and responsibilities related to process safety issues;\n    Avoid problems or conflicts among the people responsible for implementing elements of the program; and\n    Ensure that the program elements are integrated into an ongoing approach to identifying hazards and managing risks.\n\nManagement commitment to process safety is critical in the facility's risk management program.  For process safety to be a constant priority, the facility will remain committed to every element of the risk management program.\n\nTo maintain an integrated approach to managing risks, each RMP rule element will be implemented on an ongoing, daily basis and become a part of the way the facility op"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 15589,
      "SummaryText": "erates.\n\nRisk Management Coordinator:    Bob Crow\nTitle:    Engineer\nAdditional Responsible Personnel:    None at this time.\n\nHAZARD ASSESSMENT\n\nAs required by the Risk Management Program regulations, the Reddy Ice facility has conducted offsite consequence analyses relative to the potential accidental release of anhydrous ammonia.  The scenarios related to a worst case release scenario and an alternative release scenario.  This involved calculating worst case and alternative scenarios utilizing the RMP*Comp modeling program.\n\nThe facility considered worst case release scenarios relating to the receiver within the enclosed ammonia system, as it would house the largest mass of a regulated substance at any given time. The release model considered the potential release of 3,500 pounds of liquid ammonia from the vessel, during a 10 minute release.  The scenario endpoint was 0.3 mile.  This scenario generated a toxic endpoint of 200 ppm, the maximum airborne concentration below which it is believed nearly all individuals can be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individuals ability to take protective action.\n\nAlternative scenarios, or potentially more likely scenario, for the facility system were considered and it was determined that there is a potential loss of ammonia due to the breaking of a 1\" line.  The predicted distance to the 200 ppm endpoint is less than 0.1 mile.\n\n\n"
    }
  ]
}