{
  "FacilityID": 1564,
  "FacilityName": "GILLAM & MASON, INC.",
  "FacilityStr1": "HIGHWAY 45 NORTH",
  "FacilityStr2": null,
  "FacilityCity": "HARRELLSVILLE",
  "FacilityState": "NC",
  "FacilityZipCode": "27942",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37091",
  "LEPC": "Hertford County LEPC",
  "FacilityLatDecDegs": "36.305306",
  "FacilityLongDecDegs": "-76.805139",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "WBGILLAM@COASTALNET.COM",
  "FacilityDUNS": 72021637,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "WILEY B. GILLAM III",
  "OperatorStr1": "HIGHWAY 45 NORTH",
  "OperatorStr2": null,
  "OperatorCity": "HARRELLSVILLE",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27924",
  "OperatorZipCodeExt": null,
  "RMPContact": "WILEY GILLAM",
  "RMPTitle": "PRESIDENT",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000020087",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-30 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-07-16 00:00:00",
  "DeRegistrationEffectiveDate": "2014-05-01 00:00:00",
  "AnniversaryDate": "2004-06-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.4",
  "FRS_Lat": 36.30531,
  "FRS_Long": -76.80514,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1693,
      "AltID": "ANHYDROUS AMMONIA",
      "FacilityID": 1564,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1729,
          "ProcessID": 1693,
          "NAICSCode": "325314",
          "_desc": {
            "NAICS_CODE": "325314",
            "NAICS_DESCRIPTION": "Fertilizer (Mixing Only) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1800,
          "ProcessID": 1693,
          "ChemicalID": 56,
          "Quantity": 47700.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 501800,
          "ProcessID": 1693,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1564,
      "SummaryText": "Gillam & Mason, Inc is an agricultural retail outlet which sells chemicals and fertilizer in addition to irrigation equipment and parts. The anhydrous ammonia is used in the blending of liquid fertilizer and also for the direct fertilization of corn.\n\nThe maximum quantity of ammonia stored here at any one time is 47.700lbs\n\nWe have an emergency plan in case it is needed but we would rather practise safety and have mechanisms in place so as to avoid ever having to use our emergency plan.\n\nWe believe emergencies can be prevented by having trained personnel. Our people are trained to handle ammonia properly. Safety equipment is provided and is religiously used. Equipment is maintained. Defective parts are replaced immediately, we do not try to \"get by\" with questionable equipment. Employees are encouraged to talk, practice and think safety.\n\nIn case there is a leak, rupture or complete escape of the anhydrous ammonia the first thing to do is evacuate everyone from the immediate area, that is, everyone within 800 yards of the facility. If it is a worse case release scenario evacuation of people within 2.9 miles, downwind of the facility, will be given next priority. Additional evacuation will be done on a \"need to\" basis depending on the extent and severity of the spill. Every effort will be made to inform as many people in the vicinity as possible. Assembly points are at the Fire House north of the facility and The Wiiccacon Center to the south, depending on the wind direction.\n\nIn the meantime the Director of Emercency Services in Winton (Phone - 252-358-7861) will be notified by dispatch and Harrellsville Fire Department (911) will be contacted. Both of these departments have our emergency response plan and Risk Management Program.\n\nAs a precaution, we have access to enough ammonia nurse tanks to transfer and contain the maximum capacity of the bulk storage ammonia tank at the facility. We would have to use the 6 nurse tanks that Gillam & Mason has along with the bal"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1564,
      "SummaryText": "ance from Powell and Stokes, Inc. who are a neighboring anhydrous ammonia facility.\n\nOnce everyone has been notified and evacuated we would approach the scene of the accident from upwind. Water would be applied through a fog-nozzle to the point of the ammonia leak. We would be cautious not to apply water to the tank unless it is being heated by a nearby fire.\nValves are then closed between the tank and the leak. This is done by one or two men with self-contained breathing equipment and protective clothing going in under cover of water fog. A safety line would be used. If the leak cannot be controlled by closing the valves we would continue to put water on the discharge point and transfer product into mobile units.\n\nAs far as First Aid and health aspects of a leak are concerned we have made everyone aware that water is the best emergency first aid treatment for ammonia burns. The importance of time is stressed. Water needs to be applied to the injured area of skin or eyes immediately. If burns are extensive there is an on-site pond/reservoir specifically for full emergence if necessary. Exposed area would be flushed or irrigated for at least 15 minutes. No salves, ointments or oils would be applied to burn for at least 24 hours. Contaminated clothing would be removed as soon as practical. Because of the freezing action of anhydrous ammonia, clothing may be frozen to the skin in which case, clothing would be thawed first. Victim would be kept warm and a doctor called. If victim stops breathing , artficial respiration would begin and oxygen administered.\n\nAll in all everyone is fully aware of the potential danger of anhydrous ammonia and subsequently handles ammonia with due caution. As a result we have not had any incidents of spills/releases for the 15 years the facility has been in place."
    }
  ]
}