{
  "FacilityID": 1569,
  "FacilityName": "FREMAR Farmers Cooperative Inc.",
  "FacilityStr1": "44610 273rd Street",
  "FacilityStr2": null,
  "FacilityCity": "Marion",
  "FacilityState": "SD",
  "FacilityZipCode": "57043",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "46125",
  "LEPC": "Turner County LEPC",
  "FacilityLatDecDegs": "43.430333",
  "FacilityLongDecDegs": "-97.278472",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "dtieszen@fremarcoop.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "FREMAR Farmers Cooperative Inc.",
  "OperatorStr1": "300 North Broadway",
  "OperatorStr2": "PO Box 357",
  "OperatorCity": "Marion",
  "OperatorStateFIPS": "SD",
  "OperatorZipCode": "57043",
  "OperatorZipCodeExt": "0357",
  "RMPContact": "John Husk",
  "RMPTitle": "General Manager",
  "FTE": 26,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000020112",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-01 00:00:00",
  "SafetyInspectionBy": "Millers Mutual Insurance Company",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-06-18 00:00:00",
  "DeRegistrationEffectiveDate": "2004-06-18 00:00:00",
  "AnniversaryDate": "2004-06-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.4",
  "FRS_Lat": 43.43056,
  "FRS_Long": -97.27889,
  "FRS_Description": "LOADING FACILITY",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1698,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1569,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1734,
          "ProcessID": 1698,
          "NAICSCode": "115112",
          "_desc": {
            "NAICS_CODE": "115112",
            "NAICS_DESCRIPTION": "Soil Preparation, Planting, and Cultivating"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1805,
          "ProcessID": 1698,
          "ChemicalID": 56,
          "Quantity": 52489.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 501805,
          "ProcessID": 1698,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1569,
      "SummaryText": "              Risk Management Plan (RMP) - Ammonia\n                       Executive Summary\n                FREMAR Farmers Cooperative, Inc.\n                      Marion, South Dakota\n                                \n                                \n  1. Accidental Release Prevention and Emergency Response Policies\nWe at FREMAR Farmers Cooperative, Inc. in Marion are strongly committed to employee, public,\nand environmental safety.  This commitment is an inherent part of our comprehensive accidental\nrelease prevention program that covers areas such as design, installation, operating procedures,\nmaintenance, and employee training associated with the processes at our facility.  It is our policy to\nimplement appropriate controls to prevent possible releases of regulated substances.  If such a release\ndoes occur, our trained emergency response personnel are at hand to control and mitigate the effects\nof the release.  We also coordinate our response efforts with the Marion Fire Department, which\nprovides additional emergency response expertise.\n\n  2. Stationary Source and Regulated Substances Handled\nOur facility's primary activities include support services for crop production.  We have anhydrous\nammonia stored in a 12,000- and two 11,000-gallon tanks at our facility in Marion (Figure 1).  The\nmaximum amount stored is 28,900 gallons (148,719.4 pounds) at the maximum fill capacity of 85%.\n\n  3. Worst Case Release and Alternative Release Scenarios\nWe utilized RMP PRO for the worst case and alternate case scenarios of the required offsite\nconsequence analysis for our facility.  The following details these scenarios.\n\nThe worst case release scenario involves a catastrophic release of the entire contents of the largest\nanhydrous ammonia storage tank (52,489.2 pounds) in gaseous form over a 10-minute period.  At\nClass F atmospheric stability, 1.5 m/s wind speed, and urban topography, the maximum distance to\na toxic endpoint of 0.14 mg/L is 3.4 miles (Figure 2).  The estimated"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1569,
      "SummaryText": " population within a 3.4-mile\nradius of this facility is 950.\n\nThe alternative release scenario involves a release from an anhydrous ammonia product line.  The\nscenario involves the release of 6,854.78 pounds of ammonia in a gaseous form over a period of 30\nminutes.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.14\nmg/L of ammonia is 0.19 mile (Figure 3).  The estimated population within a 0.19-mile radius of the\nfacility is zero.\n\n  4. General Accidental Release Prevention Program\nOur facility has taken all the necessary steps to comply with the EPA's accidental release prevention\nrequirements as set forth in 40 CFR part 68.  The following sections briefly describe the elements\nof the release prevention program that is in place at our stationary source.\n\n\nProcess Safety Information\nFREMAR Farmers Cooperative, Inc. maintains a detailed record of safety information that describes\nthe chemical hazards, operating parameters, and equipment designs associated with all processes\n(Appendix D).\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are\nidentified and controlled effectively.  Any findings from the hazard analysis are addressed in a\ntimely manner.\n\nOperating Procedures\nFREMAR Farmers Cooperative, Inc. maintains written operating procedures to ensure that activities\nwithin our covered processes are conducted safely.  These procedures address various modes of\noperation; the information is regularly reviewed and is readily accessible to operators involved in\nthe processes (Appendix B).\n\nTraining\nFREMAR Farmers Cooperative, Inc. has a comprehensive training program in place to ensure that\nemployees who are operating processes are competent in the operating procedures associated with\nthese processes.\n\nMechanical Integrity\nFREMAR Farmers Cooperative, Inc. conducts documented maintenance checks on process\nequipment to ensure proper operation.  Maintenance checks ar"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1569,
      "SummaryText": "e conducted by qualified personnel\nwith previous training in maintenance practices.  Examples of process equipment that would receive\nmaintenance checks include:  pressure vessels, storage tanks, piping systems, relief and vent systems,\nemergency shutdown systems, controls, and pumps.  Any equipment deficiencies identified by the\nmaintenance checks are corrected in a safe and timely manner (Appendix C).\n\nManagement of Change\nWritten procedures are in place at FREMAR Farmers Cooperative, Inc. to manage changes in\nprocess chemicals, technology, equipment, and procedures.  Process operators, maintenance\npersonnel or other employees whose job tasks are affected by a modification in process conditions\nare promptly notified of the modification and offered training to deal with it.\n\nPre-startup Reviews\nFREMAR Farmers Cooperative, Inc. routinely conducts pre-startup safety reviews related to new\nprocesses and modifications in established processes.  These reviews are conducted to confirm that\nconstruction, equipment, and operating and maintenance procedures are suitable for safe startup prior\nto placing equipment into operation.\n\nCompliance Audits\nFREMAR Farmers Cooperative, Inc. conducts compliance audits on a regular basis to determine\nwhether the plan's provisions, set out under the 40 CFR part 68, are being implemented.  Any non-\ncompliance issue discovered during the audit is promptly corrected.\n\nEmployee Participation\nFREMAR Farmers Cooperative, Inc. truly believes that process safety management and accident\nprevention is a team effort.  Company employees are strongly encouraged to express their views\nconcerning accident prevention issues and to recommend improvements.  In addition, our employees\nhave access to all information created as part of the facility's implementation of the RMP,\nparticularly information resulting from process hazard analyses.\n\n  5. Five-year Accident History\nFREMAR Farmers Cooperative, Inc. has had an excellent record of preventing accidental "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1569,
      "SummaryText": "releases\nover the last 5 years.  Due to our stringent release prevention policies, no accidental release has\noccurred during this period.\n\n  6. Emergency Response Plan\nFREMAR Farmers Cooperative, Inc. maintains a written emergency response plan to deal with\naccidental releases of hazardous materials.  The plan addresses all aspects of emergency response\nincluding first aid and medical treatment, evacuations, and notification of local emergency response\nagencies and the public (Appendix A).\n\n  \n"
    }
  ]
}