{
  "FacilityID": 15810,
  "FacilityName": "City of Hays Water Softening Plant",
  "FacilityStr1": "10th & Vine Street",
  "FacilityStr2": null,
  "FacilityCity": "Hays, KS",
  "FacilityState": "KS",
  "FacilityZipCode": "67601",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20051",
  "LEPC": "Ellis County LEPC",
  "FacilityLatDecDegs": "38.867139",
  "FacilityLongDecDegs": "-99.317139",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Hays, Kansas",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Hays",
  "OperatorStr1": "10th & Vine Street",
  "OperatorStr2": null,
  "OperatorCity": "Hays, KS",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "67601",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joesph Obholz",
  "RMPTitle": "Plant Superintendent",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000043277",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-01-31 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-08-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-08-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.86714,
  "FRS_Long": -99.31714,
  "FRS_Description": "ATMOSPHERIC EMISSIONS TREATMENT UNIT",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 21853,
      "AltID": "Water softening",
      "FacilityID": 15810,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 22428,
          "ProcessID": 21853,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 27842,
          "ProcessID": 21853,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 527842,
          "ProcessID": 21853,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15810,
      "SummaryText": "Executive Summary\n\na)  The City of Hays  Water Softening Plant (WSP), acidental release prevention policy involves a unified approach that intergrates technologies, procedures, and management practices.  All applicable procedures of the U.S. Environmental Protection Agency (EPA) Prevention Program are adhered to.  The WSP emergency response policy involves the preparation of response plans which are tailored to the Hays water softening plant facility and to the emergency response services available in the community, and is in compliance with the EPA Emergency Response Program requirements.\n\nb)  The Water Softening Plant Chlorination Station has been installed to disinfect the water flow into the City of Hays water distribution system.  The chlorination system is located on the southeast corner of the intersection of Vine Street and 10th Street.  The station includes a chlorination room, which contains liquid chlorine containers, a chlorinator, and various safety equipment, and an instrument room, which contains a flow recorder, various electrical panels, and additional safety equipment.  The amount of chlorine handled is 3 one-ton containers and 25 one-hundred fifty pounds containers.  The chlorine station is not continously manned 24-hours per day but water treatment operators visit the chlorine station periodically throughout the 24-hour day and respond to any trouble alarms which may occur.\n\nc)  The offsite consequence analysis includes consideration of two chlorine release scenarios, identified as \"worst case release\" and \"alternative scenario\".  The first scenario is identified by EPA, which states that \"the owner or operator shall assume that the  ... maximum quantity in the largest vessel... is released as a gas over a period of 10 minutes,\" due to an unspecified failure.  The alternative scenario is defined as \"more likely to occur than the worst case scenario\".\n\nEPA's RMP*Comp(tm) atmospheric dispersion modeling has to be performed to determine the distance"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15810,
      "SummaryText": " traveled by the chlorine released before its concentration decrease to the \"toxic endpoint\" selected by EPA of 3 ppm, which the Emergency Response Planning Guideline Level 2 (ERPG-2).  This is defined by the American Industrial Hygiene Association (AIHA) as the \"maximum airborne concentrations below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\"  The residential population within a circle with a radius corresponding to the toxic endpoint distance has to be defined, \"to estimate the population potentially affected\".\n\nd)  The general DWS accidental release prevention program is based on the following key elements:\n\n- High level of training of the operators\n\n- Prevention maintenance program\n\n- Use of state-of-the-art process and safety equipment\n\n- Use of accurate and effective operating procedures, written with the participation of the operators\n\n- Performance of a hazard review of equipment and procedures\n\n-  Implementation of an auditing and inspection program\n\nChemcial-specific prevention steps include the availability of self-contained breathing apparatus SCBA),  awareness of the hazardous and toxic properties of chlorine, and presence of chlorine detectors.\n\ne)  No accidental release of chlorine have occurred at this facility in the past five-years.\n\nf)  The facility has an emergency response program, which has been coordinated (reviewed) by the City of Hays Fire Department, which is a member of the Local Emergency Response Planning Committee (LEPC).  This program includes an emergency response decision tree and a notification plan.  Emergency response drills and drill evaluations are conducted very six months; emergency operation and response produres are also reviewed at that time.\n\ng) Four changes to improve safety (recommended actions) were identified in May an"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 15810,
      "SummaryText": "d June 1999, when a Risk Management Program was begun for the facility.  These recommended actions are now in various stages of completion and will be implemented as projected."
    }
  ]
}