{
  "FacilityID": 15863,
  "FacilityName": "Roche Vitamins Inc. Belvidere, NJ",
  "FacilityStr1": "206 Roche Drive",
  "FacilityStr2": null,
  "FacilityCity": "Belvidere",
  "FacilityState": "NJ",
  "FacilityZipCode": "07823",
  "Facility4DigitZipExt": "1113",
  "FacilityCountyFIPS": "34041",
  "LEPC": "White Twp OEM",
  "FacilityLatDecDegs": "40.843611",
  "FacilityLongDecDegs": "-75.066389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "FC",
  "FacilityURL": "www.roche.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 42321042,
  "ParentCompanyName": "Roche Vitamins Inc. Parsippany, NJ",
  "Company2Name": "Roche Holdings, AG.",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Roche Holdings Inc.",
  "OperatorStr1": "One Commerce Center",
  "OperatorStr2": "Suite 1050",
  "OperatorCity": "Wilmington",
  "OperatorStateFIPS": null,
  "OperatorZipCode": null,
  "OperatorZipCodeExt": null,
  "FTE": 560,
  "OtherEPAFacilityID": "NJD042321042",
  "EPAFacilityID": "100000155547",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "85435",
  "SafetyInspectionDate": "1999-05-11 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "USEPA RMP version, Roche Vitamins Inc. , 06/18/99",
  "NoAccidents": 1,
  "ForeignStateProv": "DE",
  "ForeignZipCode": "19801",
  "ForeignCountry": "US",
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-08-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-04-17 00:00:00",
  "DeRegistrationEffectiveDate": "2005-12-08 00:00:00",
  "AnniversaryDate": "2004-07-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.84275,
  "FRS_Long": -75.06456,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 21942,
      "AltID": "Water/wastewater trmt.",
      "FacilityID": 15863,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 28029,
          "ProcessID": 21942,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 22519,
          "ProcessID": 21942,
          "NAICSCode": "325411",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 11967,
              "Process_NAICS_ID": 22519,
              "SafetyReviewDate": "1998-12-22 00:00:00",
              "PHA_Date": "1997-11-19 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-02-18 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "System is under vacuum, fusible plug on cylinders",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Testing of audible chlorine alarms systems; use of two-way radios; cylinders are chocked during storage and transport",
              "OpProceduresReviewDate": "1999-02-17 00:00:00",
              "TrainingReviewDate": "1999-02-17 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-17 00:00:00",
              "EquipmentInspectionDate": "1999-06-02 00:00:00",
              "EquipmentTested": "Chlorine leak detectors",
              "ChangeMgmtDate": "1997-10-14 00:00:00",
              "ChangeMgmtReviewDate": "1998-01-14 00:00:00",
              "PreStartupReviewDate": "1997-10-14 00:00:00",
              "ComplianceAuditDate": "1998-12-22 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1999-05-13 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-11 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-11 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-14 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-27 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 16990,
                  "PreventionProgram3ID": 11967,
                  "ProcessChemicalID": 28029
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 21943,
      "AltID": "Cnloroform Storage Proces",
      "FacilityID": 15863,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 28030,
          "ProcessID": 21943,
          "ChemicalID": 4,
          "Quantity": 341200.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 22520,
          "ProcessID": 21943,
          "NAICSCode": "325411",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 15863,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-04-15 00:00:00",
    "ERTrainingDate": "1999-04-11 00:00:00",
    "CoordinatingAgencyName": "White Township Office of Emergency",
    "CoordinatingAgencyPhone": "9084752093",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15863,
      "SummaryText": "Executive summary for the Roche Vitamins Inc. Belvidere, NJ facility.\n\nRoche Belvidere is an important manufacturing facility for Roche Vitamins Inc. While our principal business is the production of bulk Vitamin C (ascorbic acid), the facility also produces sodium lasalocid, (the active ingredient in a line of animal feed additives), as well as finished forms of Vitamins A, D3, E, B1, B2, B6, B12, biotin and beta-carotene.\n\nThe facility  was established on a 500 acre site bordering the Delaware River in rural Warren County in the late 1960s. Today Roche Belvidere includes over 50 buildings, which includes four major production operations and a complete utility systems infrastructure, including co-generation of electricity and steam and onsite water and wastewater treatment facilities.\n\nRight from the very beginning safety and environmental stewardship has been a matter of course. Protecting people and the environmental is a serious business at Roche Belvidere. Roche has reduced emissions to the environment by 90% through continuous improvement of our operations and a capital investment of several millions of dollars. These improvements have been recognized by both local and federal regulatory agencies. Roche is proud of these accomplishments. This site has PSM covered processes. We follow OSHA, EPA/NJDEP and Roche Corporate Safety, Environmental and Industrial Hygiene Standards, Guidelines and Directive. Senior Management at the site, through a site Leadership Team that includes all operating units and support functions ensures that these initiatives are visible and implemented throughout the site..\n\nChlorine is one of two RMP regulated chemicals on the plant site. The other one is chloroform. The Worst Case Scenario modeling for chlorine produces the largest impact area of the two chemicals we use at the plant site. Roche uses chlorine to purify both drinking water and waste water. It is not used in the production of our products. Chlorine has a sharp, disagree"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15863,
      "SummaryText": "able odor. The vapor can be extremely irritating to the eyes, throat and breathing passages when inhaled. This odor warns us to avoid it before we encounter high concentrations. High concentrations could cause more serious problems, such as convulsive coughing, difficult and painful breathing, and, in extreme cases, death. Contact of the eyes and skin with liquid chlorine is serious requiring prompt medical attention.\n\nChloroform is a building block used in the production of other products. It is ranked among the top 50 chemicals with the highest production volumes in the US. We use chloroform as a media in the rearrangement process. Chloroform is a colorless liquid with a strong odor. The vapor can be extremely irritating to the eyes, throat and breathing passages when inhaled. This irritation warns us to avoid it before we encounter higher concentrations. It also causes headaches. High concentrations could cause more serious problems, such as difficult and painful breathing and, in extreme cases, death. For repeated exposures, other potential health effects may occur. Employees or contractors who work around chloroform take the following extra precautions:  Wearing appropriate safety equipment and undergoing special OSHA training to ensure safe handling of the product.\n\nRoche Vitamins Inc. (Roche) uses a variety of safety equipment and procedures to prevent accidental releases of chlorine. The Chlorine Institute produces standards for safety regarding the production and handling of chlorine. Roche follows these standards. Relief valves handle unexpected rises in temperature or pressure. Safety controls, including warning alarms and leak detectors and employee monitoring provide multiple lines of defense. Frequent monitoring of  pressure in vessels and piping prevents problems.  An extensive preventative maintenance program and monthly equipment inspections ensure proper operation. Staff and our emergency responders receive extensive health and safety training, fol"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 15863,
      "SummaryText": "lowing OSHA guidelines. Staff are trained in start-up, operation, shut-down, and maintenance of all equipment. Full investigation of any incident -- even small leaks -- prevents them from occurring again.\nAppropriate permits have been obtained and are maintained (site is a New Jersey Toxic Catastrophe Prevention Act registered facility).  Inspections  are performed to ensure correct procedures are followed.\n\n Roche Vitamins Inc. (Roche) uses a variety of safety equipment and procedures to prevent accidental releases of chloroform.7 Automatic shut-off devices and relief valves handle unexpected rises in temperature or pressure. Safety controls, including warning alarms, interlocks and leak detectors, provide multiple lines of defense. Frequent monitoring of pressure in vessels and piping prevents problems. Regular equipment inspections and preventative maintenance procedures ensure proper operation.  Staff and contractors receive extensive health and safety training, following OSHA guidelines. Staff are trained in startup, operation, shut-down, loading and unloading, and maintenance of all equipment.  Full investigation of any incident -- even small leaks -- prevents them from occurring again.  Appropriate permits have been obtained and are maintained.  Audits (inspections) are performed to ensure correct procedures are followed.\n\nFor chlorine, using the Phast Air Dispersion Modeling,  the Worst Case Scenario for Roche Vitamins Inc., Belvidere is: Catastrophic failure of a chlorine cylinder. Approximately 2,000 pounds of chlorine leaks from the cylinder within 10 minutes and vaporizes. This worst case release scenario for chlorine has an offsite impact. This scenario occurs within an enclosure (building) which reduces the release rate to the outside environment by 45%.\n\nFor chlorine, using the Phast Air Dispersion Modeling,  the Alternate Release Scenario for the Roche Vitamins Inc., Belvidere, Site is: a relief valve venting.  Approximately 141 pounds of chlorine le"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 15863,
      "SummaryText": "aks from a vent and vaporizes. This alternate case release scenario for chlorine has an offsite impact. This scenario occurs within an enclosure (building) which reduces the release rate to the outside environment by 45%. Having had no accidental releases of chlorine, although very unlikely, this scenario was chosen as a possible release event that could occur.\n\nFor chloroform, using the Phast Air Dispersion Modeling, the Worst Case Scenario for Roche Vitamins Inc., Belvidere is: catastrophic tank failure. Approximately 341,200 pounds of chloroform leaks from a tank within 10 minutes and vaporizes. This worst case release scenario has no offsite impact. Passive mitigation considered in this release scenario is  a concrete dike (secondary containment) large enough to contain the entire contents of the tank.\n\nFor chloroform, there are no offsite consequences for any alternative release scenarios. Therefore, no alternate case is presented.\n\nThe following is a five year history of reportable incidents. There were no incidents involving chlorine or chloroform which impacted the community or the environment during this time frame. \n\nTo be prepared for potential chemical accidents, Roche communicates regularly and works closely with the Local Emergency Planning Committees (LEPCs), the Office of Emergency Management (OEM) and local community responders. A detailed emergency response plan has been developed and tested.  The plans are shared with the LEPCs, local fire departments and OEM. The  Roche emergency response team has routine joint drills with these agencies participating. Each community has developed Emergency Response Procedures. It is important to follow the directions of the local officials. Information will be broadcast on the Local Emergency Stations.  Roche Vitamins Belvidere participates in a computer based 24 hour telephone emergency notification service called Community Alert Network (CAN). The system allows emergency responders to quickly contact a large n"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 15863,
      "SummaryText": "umber of residents with specific instructions about an impending or ongoing emergency situation. \n\nElements of Roche Vitamin Inc. Belvidere emergency response plan include: Around the clock coverage with trained emergency response teams including continuous on site incident command leadership. And as mentioned previously, the CAN emergency notification system that would instruct residents to shelter in place - stay indoors, close all windows and doors, and monitor a local radio station. When the emergency situation is over, a second telephone call will be received from CAN."
    }
  ]
}