{
  "FacilityID": 15911,
  "FacilityName": "Crest Foam",
  "FacilityStr1": "122 Parker Street",
  "FacilityStr2": null,
  "FacilityCity": "Newburyport",
  "FacilityState": "MA",
  "FacilityZipCode": "01950",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25009",
  "LEPC": "Amesbury LEPC",
  "FacilityLatDecDegs": "42.798611",
  "FacilityLongDecDegs": "-70.866944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 192729490,
  "ParentCompanyName": "Leggett & Platt, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 192729490,
  "Company2DUNS": 0,
  "OperatorName": "Leggett & Platt, Inc.",
  "OperatorStr1": "122 Parker Street",
  "OperatorStr2": null,
  "OperatorCity": "Newburyport",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "01959",
  "OperatorZipCodeExt": null,
  "RMPContact": "Frank Ippolito",
  "RMPTitle": "Regional Manager",
  "FTE": 90,
  "OtherEPAFacilityID": "MAD982749095",
  "EPAFacilityID": "100000034045",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-16 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-08-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-07-17 00:00:00",
  "DeRegistrationEffectiveDate": "2007-03-30 00:00:00",
  "AnniversaryDate": "2004-08-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.79952,
  "FRS_Long": -70.88767,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility sold to Sleep Innovations-AUT Newburyport, Inc.",
  "_processes": [
    {
      "ProcessID": 22014,
      "AltID": "Polyurethane Foam Mfg.",
      "FacilityID": 15911,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 22594,
          "ProcessID": 22014,
          "NAICSCode": "32615",
          "_desc": {
            "NAICS_CODE": "32615",
            "NAICS_DESCRIPTION": "Urethane and Other Foam Product (except Polystyrene) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 28112,
          "ProcessID": 22014,
          "ChemicalID": 44,
          "Quantity": 122000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 44,
            "ChemicalName": "Toluene 2,4-diisocyanate  [Benzene, 2,4-diisocyanato-1-methyl-]",
            "CASNumber": "584-84-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 528112,
          "ProcessID": 22014,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15911,
      "SummaryText": "Executive Summary\n\n\n1.0 Accidental Release Prevention and Emergency Response Policies\n\nAt Crest Foam, we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n? A description of our facility and use of substances regulated by the EPA's RMP regulation\n? A summary of results from our assessment of the potential offsite consequences from accidental chemical releases\n? An overview of our accidental release prevention programs\n? A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\n? An overview of our emergency response program\n? An overview of  planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\n? The certifications that EPA's RMP rule requires us to provide\n? The detailed information (called data elements) about our risk management program\n\n\n2.0 Stationary Source and Regulated Substances\n\nOur facility produces polyurethane foam using a variety of chemicals and processing operations.  Crest Foam uses a listed chemical, Toluene Diisocyanate, in its manufacturing operation to make flexible polyurethane slab stock foam.  In our processes, we use the following chemicals that the EPA has identified as having the potential to cause significant offsite consequences in the event of a substantial accidental release:\n\nToxics\nSee Appendix E, MSDS for Toluene Diisocyanate.\n\nFlammables\nNone\n\nOur accidental release prevention programs and our contingency planning efforts help us effectively manage the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15911,
      "SummaryText": "hazards that are posed to our employees, the public, and the environment by our use of these chemicals.\n\n\n3.0 Key Offsite Consequence Analysis Scenarios\n\nEPA's RMP rule requires that we provide information about the worst-case release scenario(s) and alternative release scenario(s) for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario:\n\nWorst-case Related Scenario(s) - Regulated Toxic Chemicals\n\nWe used a tank failure with a 2 inch diameter hole.  This hole can simulate a hose or pipe failure or a puncture in the tank. The tank capacity is 10,000 gallons. The puddle area is limited to 560 square feet due to the containment system.  The area of concern is 20 yards.  There is no population concerns according to the model created using ALOHA software.\n\nAlternative Release Scenario(s) - Regulated Toxic Chemicals\n\nFor the alternative release we used a two inch pipe failure being 34 feet in length.  We used the estimated contents of the pipe.  With the criteria used, ALOHA software was unable to generate a plume.\n\nWe are using this information to help us ensure that our emergency response plan and community contingency response plan address all reasonable contingency cases.  Additional parameters and maps are located in Appendix A.\n\n4.0 General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nWe take a systematic, proactive approach to preventing accidental releases of hazardous chemicals.  Our management systems address each of the key features of successful prevention programs including:\n\n? Process safety information\n? Process hazard analysis\n? Operating procedures\n? Training\n? Mechanical Integrity\n? Pre-start up review\n? Compliance audits\n? Incident Investigation\n? Employee participation\n? Hot work permit\n? Contractors\n\nThe key to preventing accidental chemical releases are the Standard Ope"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 15911,
      "SummaryText": "rating Procedures that are in Appendix D.\n\nThese individual elements of our prevention program work together to prevent accidental chemical releases.  Our company and our employees are committed to the standard that these management systems set for the way we do business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\n\n\n5.0 Five-Year Accident History\n\nWe keep records for all significant accidental chemical release that occur at our facility.  The following is a brief summary of accidental releases involving materials covered under EPA's RMP rule during the past five years:\n\nThere have been none.\n\n\n6.0 Emergency Response Program\n\nWe maintain an integrated contingency plan, which  consolidates all of the various federal, state, and local regulatory requirements for emergency response planning.  Our program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situation.  Furthermore, we coordinate our plan with the community emergency response plan.\n\n\n7.0 Planned Changes to Improve Safety\n\nThe following is a list of improvements that we are planning to implement at the facility to help prevent and/or better respond to accidental chemical releases:\n\nMonitors\nRadios\nHigh level alarms with interlocks\n\n\n8.0 Certifications\n\nBased on the criteria in 40 CFR 68.10, our Risk Management Program is written to comply\nwith Program level two.  The distance to the specified endpoint for the worst-case  accidental release scenario for the covered process is less than the distance to the nearest public receptor.\n\nWithin the past five years, the process has had no accidental releases that caused offsite\n impacts provided in the RMP rule (40 CFR 68.10(b)(1)).  We have taken voluntary measures\n to improve our operations to minimize potential releases of covered materials in order to\n protect both our employees and the public. In the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 15911,
      "SummaryText": " event of fire, explosion, or a release of\n a regulated substance from the process, entry within the distance to the specified endpoint\n may pose a danger to public emergency responders.  Therefore, public emergency responders should not enter this area  except as arranged with the emergency contact indicated in the   \nRMPlan.  The undersigned certifies that, to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate, and complete.\n\nSignature:          Frank Ippolito   \n\nTitle:                  General Manager \n\nDate:                  April 27, 1999      \n\n\n9.0 RMP Data Elements\n\nThe following pages present additional information about our risk management program that EPA's RMP rule has asked us to provide.  This information is categorized as follows:\n\n? Registration\n? Offsite consequence analysis\n? Five-year accident history\n? Program 2 prevention program\n? Emergency response program\n"
    }
  ]
}