{
  "FacilityID": 15919,
  "FacilityName": "MARIGOLD FOODS, INC.",
  "FacilityStr1": "406 N. BROADWAY",
  "FacilityStr2": null,
  "FacilityCity": "ROCHESTER",
  "FacilityState": "MN",
  "FacilityZipCode": "55906",
  "Facility4DigitZipExt": "6668",
  "FacilityCountyFIPS": "27109",
  "LEPC": null,
  "FacilityLatDecDegs": "44.027778",
  "FacilityLongDecDegs": "-92.462222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6172134,
  "ParentCompanyName": "WESSANEN, U.S.A.",
  "Company2Name": null,
  "CompanyDUNS": 31901705,
  "Company2DUNS": 0,
  "OperatorName": "MARIGOLD FOODS, INC.",
  "OperatorStr1": "P.O. BOX 309",
  "OperatorStr2": null,
  "OperatorCity": "ROCHESTER",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55903",
  "OperatorZipCodeExt": "0309",
  "FTE": 110,
  "OtherEPAFacilityID": "MN0985681899",
  "EPAFacilityID": "100000109508",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-15 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "PRM-1999-1-000459-3",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Paper",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 1,
  "PostmarkDate": "1999-07-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 44.02795,
  "FRS_Long": -92.46287,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 22022,
      "AltID": null,
      "FacilityID": 15919,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 28120,
          "ProcessID": 22022,
          "ChemicalID": 56,
          "Quantity": 65000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 22602,
          "ProcessID": 22022,
          "NAICSCode": "31152",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 12014,
              "Process_NAICS_ID": 22602,
              "SafetyReviewDate": "1999-06-01 00:00:00",
              "PHA_Date": "1995-10-10 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-28 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "HUMAN FACTOR, FACILITY SITING",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "VENTILATION SYSTEM",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-01 00:00:00",
              "TrainingReviewDate": "1998-12-28 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "COMPRESSORS",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-01-18 00:00:00",
              "PreStartupReviewDate": "1999-03-15 00:00:00",
              "ComplianceAuditDate": "1999-03-15 00:00:00",
              "AuditCompletionDate": "1999-09-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-03-15 00:00:00",
              "HotWorkPermitReviewDate": "1999-03-15 00:00:00",
              "ContractorSafetyReviewDate": "1999-03-15 00:00:00",
              "ContractorSafetyEvalDate": "1999-04-15 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 17046,
                  "PreventionProgram3ID": 12014,
                  "ProcessChemicalID": 28120
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 15919,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-03-15 00:00:00",
    "ERTrainingDate": "1999-01-29 00:00:00",
    "CoordinatingAgencyName": "ROCHESTER FIRE DEPARTMENT",
    "CoordinatingAgencyPhone": "5072858963",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15919,
      "SummaryText": "1. Describe briefly the safety commitments of the facility and the overall approach to process safety.  Provide a description of:\na. Corporate and facility policies related to accident prevention and emergency preparedness and response.\nb. Safety procedures at the facility.\nc. Safety systems at the facility.\n\nThis is to inform all interested persons, including employees that Marigold Foods, Inc. is complying with OSHA's Process Safety Management Standard (called Process Safety Management or PSM), Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA's Risk Management Program regulations (called RM Program), Title 40 CFR Part 68, SARA Title III Superfund Amendments and Reauthorization Act and Community Right-to-Know Law, to deal with the risks involved with the storage, handling, and processing of hazardous chemicals.  In this way, we promote overall plant, worker, and public safety.  These programs enable our facility to prevent the occurrence, and minimize the consequences, of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents.  Overall, these programs prevent accidental fatalities, injuries and illnesses and avoid physical property damage.\nOur safety programs are applied to any activity involving hazardous chemicals, including any use, storage, manufacturing, handling, or the on-site movement of such chemicals, or combination of these activities.  Any group of vessels which are interconnected, and separate vessels which are located such that a hazardous chemical could be involved in a potential release shall be considered a single process.\nOur safety programs prevent accidents because they focus on the rules, procedures, and practices which govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as necessary.  They are also communicated to and accepted by all employees at the facility.\nOur facility has written policies and procedures addressing the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15919,
      "SummaryText": "Process Safety Management (PSM) compliance regulation and written policies and procedures involving an extensive emergency preparedness and response plan addressing ammonia situations.  We have developed proactive and reactive safety procedures governing ammonia systems that involve joint ventures with outside contractors and public sector emergency responders.\nWe have installed ammonia leak sensors that are connected to automatic venting systems in our ammonia compressor areas to reduce the likelihood of a fire or explosion as a safety system.  Our fault tree analysis during the PSM process identified some areas and processes that needed improvement that led to making our facility more efficient and safer.\n\n2. Briefly describe the ammonia refrigeration process at the facility, the ammonia inventory on-site, what it is used for (e.g., cooling and freezing of products), and what the general products are (e.g., produce, poultry, cold storage warehouse, etc.).\n\nWe have a two-staged, closed looped ammonia refrigeration system used in the manufacturing of ice cream products with minimal storage area.  We have an operating capacity of about 65,000 lbs. of ammonia.  The ammonia is used to freeze the ice cream hard and to provide limited storage for the finished product prior to being shipped to other off-site warehouses.\n\n3. Briefly describe the worst-case scenario(s) and identify the distance to the ammonia endpoint.  Include a brief description of any administrative controls and passive mitigation systems that were incorporated in the worst-case scenario(s).  Discuss the systems or procedures that would make the worst-case scenario(s) unlikely such as the mitigation equipment and other safeguards in place at the facility.\n\nFailure of the high pressure receiver containing 6922 lbs. resulting in a 10 minute release, under worst-case weather conditions, ammonia could travel 1.4 miles down wind direction before dispensing enough to no longer pose a hazard to the public.  Thi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 15919,
      "SummaryText": "s scenario is unlikely for the following reasons: worst-case weather conditions are uncommon; industry standards for the manufacture and quality control of pressure vessels; ammonia is not corrosive in this service; pressure safety valves limit operating pressure in this vessel; the accident prevention program in place at the facility including the mechanical integrity program for regular maintenance, inspection and testing, and replacement of equipment, if necessary; installed ammonia sensors in the system to warn of leaks and to ventilate to the outside; and the emergency response plan and equipment in place at the facility.\n\n4. Briefly describe the alternative release scenario(s) and identify the distance to the ammonia endpoint.  Include a brief description of any administrative controls, passive mitigation systems, and active mitigation systems that were incorporated in the alternative release scenario(s).  Discuss the rationale for the choice of alternative release scenario(s).\n\nFailure of a transfer hose during unloading resulting in a release of 1170 lbs. of ammonia over a time of 10 minutes under common weather conditions, ammonia could travel .62 miles before dispersing enough to no longer pose a hazard to the public.  Transfer hose failure was chosen as the alternative release scenario because it is a temporary connection and constructed of materials other than steel.  This scenario is unlikely for the following reasons: emergency equipment such as an excessive flow valve on the tank truck and valves to isolate the transfer hose; the facility accident prevention program in place at the facility including operating procedures to have personnel present at all times during unloading, and the mechanical integrity program for regular maintenance, inspection and testing, and replacement of equipment, if necessary; and the emergency response plan and equipment in place at the facility.\n\n5. Briefly describe the general accidental release prevention program and am"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 15919,
      "SummaryText": "monia-specific prevention steps at the facility.  Highlight the key steps in the prevention program and identify the regulations and standards that the facility complies with (e.g., OSHA PSM Standard 29 CFR 1910.119, EPA RM Program regulations in 40 CFR Part 68, ANSI/IIAR 2-1992 Standard for Equipment, Design, and Installation of Ammonia Mechanical Refrigerating Systems).\n\nWe are complying with the OSHA PSM Standard 29 CFR 1910.119, EPA RM Program regulations in 40 CFR Part 68 and the ANSI/IIAR 2-1992 Standard for Equipment, Design and Installation of Ammonia Mechanical Refrigerating Systems through the assistance of our insurance company and outside contractors and consultants.  Here is a brief summarization of what we would do in the event of accidental release of ammonia at our facility: a release is discovered by an employee who then calls a maintenance employee to check out the nature of the release(e.g., valve packing, loose flange, fine crack, etc.), maintenance employee decides corrective action such as minor repair, isolation of area or evacuation is needed, if evacuation is needed, the plant manager or asst. plant manager, or maintenance chief or facility safety designate is contacted to make a decision to which area(s) need to be evacuated, then outside responding agencies are notified if the threat of off-site evacuation is deemed necessary (fire, medical, police), shut off supplying valve and vent to the atmosphere in a safe and controlled fashion, repair leak when atmosphere tests safe, if determined that the release exceeded the reportable quantity, the state duty officer, EPA Region 5 and the National Response Center will be notified immediately, after repair, the facility can resume normal operations and conduct an incident investigation to determine cause, a written report will be submitted to the state duty officer and an incident report developed for the PSM program.\n\n6. Summarize the five-year Accident History by describing the number of qualify"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 15919,
      "SummaryText": "cost in production downtime.  All these things mentioned above should greatly improve our preparedness for chemical emergencies."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 15919,
      "SummaryText": "ing accidental releases, the largest release, and any off-site consequences or other impacts that qualify for inclusion under the requirements of 40 CFR 68.42.\n\nThere has only been one accidental release of ammonia in the past five years which resulted in a release of less than 100 lbs.  There were no on-site or off-site as a result of this release.  Off-site evacuation was not needed.  We conducted a thorough incident investigation and discovered the cause and developed a correction action plan and implementation process to eliminate to possibility of a recurrence.\n\n7. Briefly describe the emergency response program at the facility such as coordination with local emergency responders, emergency response training of employees, drills conducted at the facility, and public notification and alert systems.\n\nThis facility's emergency response program is based on the OSHA requirements for Emergency Action Plans (29 CFR 1910.38 and 1910.119) and HAZWOPER (29 CFR 1910.120).  We have trained our employees for emergency response and maintain a written emergency response plan.  This plan is coordinated with the Regional Review Committee (RRC) and the local fire department (We have a Chemical Analysis Team- C.A.T. in the city that is trained to handle all chemical situations).  We conduct annual training for all employees and have the local fire department tour our facility periodically to stay current on our situation.\n\n8. Briefly describe any planned changes to improve safety at the facility such as training, installation of new mitigation or control equipment or technology, and organizational changes.\n\nUpon a recent review of our PSM program, we feel more testing of our plan and equipment is possibly needed.  Periodic testing of our ammonia sensors is being planned.  Our notification of employees system will also be tested more frequently to keep people on the alert for emergency situations.  We plan on doing table-top scenarios in leu of conducting actual drills due to the "
    }
  ]
}