{
  "FacilityID": 15927,
  "FacilityName": "North Wastewater Treatment Plant",
  "FacilityStr1": "2100 W. Sprague Road",
  "FacilityStr2": null,
  "FacilityCity": "McAllen",
  "FacilityState": "TX",
  "FacilityZipCode": "78501",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48215",
  "LEPC": "Richard Rydl",
  "FacilityLatDecDegs": "26.304444",
  "FacilityLongDecDegs": "-98.218333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of McAllen",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "McAllen Public Utilities",
  "OperatorStr1": "P.O. Box 220",
  "OperatorStr2": null,
  "OperatorCity": "McAllen",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78505",
  "OperatorZipCodeExt": null,
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000057993",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-30 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Chlorine",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-08-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2012-10-05 00:00:00",
  "DeRegistrationEffectiveDate": "2012-01-06 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 26.305278,
  "FRS_Long": -98.218889,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 22032,
      "AltID": "Disinfection System",
      "FacilityID": 15927,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 28133,
          "ProcessID": 22032,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 22613,
          "ProcessID": 22032,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 8709,
              "Process_NAICS_ID": 22613,
              "SafetyReviewDate": "1999-05-28 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "Standard Fire Code, TNRCC",
              "FR_Comments": null,
              "HazardReviewDate": "1999-04-29 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-13 00:00:00",
              "TrainingReviewDate": "1999-04-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-16 00:00:00",
              "EquipmentInspectionDate": "1999-05-19 00:00:00",
              "EquipmentTested": "Chemical Feed Systems",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 9113,
                  "PreventionProgram2ID": 8709,
                  "ProcessChemicalID": 28133
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 15927,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-15 00:00:00",
    "ERTrainingDate": "1999-04-18 00:00:00",
    "CoordinatingAgencyName": "McAllen Fire Department",
    "CoordinatingAgencyPhone": "9566871111",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Local Ordinances"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15927,
      "SummaryText": "INTRODUCTION\nThe Accidental Release Prevention Risk Management Program rule (40 CFR Part 68) is similar to the Occupational Safety and Health Administration's Process Safety Management Program, which is designed to protect workers from accidental releases of hazardous substances.  The Risk Management Program rule addresses over 100 chemical substances>77 of which are acutely toxic and 63 of which are flammable gases>and the accidental release of these substances. The United States Environmental Protection Agency (USEPA) estimates that over 100,000 sources are covered by the rule, including chemical manufacturers and wholesalers, certain retailers, potable water treatment systems, wastewater treatment plants, ammonia refrigeration systems, and federal facilities.\nThe North Wastewater Treatment Plant (WWTP) falls under this regulation because of the on-site storage of chlorine.  The amount of chlorine stored is above the threshold limit specified by the USEPA thereby making the facility subject to compliance with the regulation.  The North WWTP personnel have complied with the USEPA Risk Management Program rule and have completed an Accidental Release Prevention Program (ARPP) Plan that contains the following required information:\n7 Management System\n7 A hazard assessment that establishes the worst-case and alternate release scenarios and their impact on the population and the environment (40 CFR Part 68 Subpart B).\n7 A prevention program that includes safety information, a hazard review, operating procedures, training, maintenance, compliance audits, and incident investigations. (40 CFR Part 68 Subpart C)\n7 An emergency response plan (40 CFR Part 68 Subpart E)\nThe following subsections discuss details of the plan that has been implemented at the North WWTP.\nRELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nThe North WWTP facility in McAllen, Texas has an excellent record in preventing and minimizing releases of chlorine. \n\nThe emergency response policies at this fac"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15927,
      "SummaryText": "ility ensure that there is emergency response coverage 24 hours per day, 7 days per week.  There are also adequate provisions for coordination with outside agencies, such as the  McAllen Fire Department in the event of an emergency.   In the event of a release, plant staff will contact the McAllen Fire Department, relaying information regarding the release prior to implementing plant evacuation to a location outside the plant gates, awaiting the arrival of the fire department to inform its personnel of all information about the release and to provide assurance that the plant has been totally evacuated.  \n\nREGULATED SUBSTANCE\nThe North WWTP uses chlorine as a disinfectant in the wastewater treatment process.  The North WWTP regularly has a storage maximum quantity of 6 one-ton containers of chlorine at its facility that is stored outside.  This is above the threshold limit (2,500 pounds) set by the USEPA. \n\nPROCESS DESCRIPTION\nThe North WWTP is located at 2100 W. Sprague Road, McAllen Texas.  The wastewater is treated at the plant and subsequently discharged, after being dechlorinated using sulfur dioxide.  \nThe existing chlorine feed facility at the North WWTP consists of  (1) 6 one-ton chlorine containers, (2) two vacuum regulators mounted to an automatic switchover module with gas piping and miscellaneous valves, (3) four flow proportionate feed chlorinators, and (4) gas piping and ejectors.  \nOn treatment plant grounds, the only area in which chlorine has a potential to generate a gaseous release is the chlorine storage area (items 1 and 2 above). \nChlorine is delivered to the North WWTP by truck and chlorine containers are stored in the outside storage area located to the north of the Chemical Building. Chlorine is removed as a gas under pressure of the liquid in the individual containers; however the majority of the chlorine feed is operated through a water injection induced vacuum, making the system extremely safe and minimizing potential pressurized leaks alo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 15927,
      "SummaryText": "ng the feed lines.  \n   \nWORST-CASE AND ALTERNATIVE RELEASE SCENARIOS\nThe chlorine storage and process areas have associated hazards that can potentially affect on-site employees and the off-site population and environment.  The U.S. EPA requires that one worst-case scenario and one alternate release scenario is reported for each regulated chemical. \n\nWorst-Case Scenario\nThe largest potential release of chlorine would occur through a valve failure on one of the one ton cylinders located at the plant.  This valve failure could potentially release all 2,000 pounds of the chlorine as a gas.  Under Section 68.25(c)(1), the release time for a chemical such as chlorine is 10 minutes.  Passive mitigation controls were not applicable to the worst-case release at this plant.\n \n The EPA-approved modeling program DEGADIS+ was used to characterize the effects of the worst case scenario at the North WWTP facility.  The distance to the toxic endpoint of 3 ppm was determined to be 1.66 miles.  The estimated affected residential population is 4,800 people.  Commercial/industrial areas and residential areas would be affected in the worst-case release scenario.\n \nAlternate Scenario\nOne alternate scenario was modeled for the North WWTP. The release was established as a leak that would potentially develop in the packing at the chlorine container valve.  A release of chlorine through the 1/5-inch diameter hole in the valve packing would occur for about 10 minutes, and is presumed to be observed or detected.  The release rate of chlorine caused by leakage through this opening is calculated to be 73.7 lb/min.  DEGADIS+ was also used to characterize the effects of the alternative case scenario at the North WWTP.  The distance to the USEPA defined toxic endpoint of 3 ppm was determined to be 1.33 miles.  The estimated affected residential population is 2,700 people.  \n\n\nGENERAL ACCIDENTAL RELEASE PRECAUTION PROGRAM\nThe North WWTP carries out consistent operation and maintenance of its chlor"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 15927,
      "SummaryText": "ine equipment utilizing only fully trained personnel in this area.  North WWTP management enforces consistent operation through discipline for operational deviations.\n\nFIVE-YEAR ACCIDENT HISTORY\nThe North WWTP's accident history was reviewed for a period from June, 1994, through June, 1999.  During this period of time, no accidental releases of chlorine had occurred.  \n\nEMERGENCY RESPONSE PROGRAM\nAs mentioned earlier, this facility has developed an Emergency Response Program involving immediate plant evacuation once the City's Fire Department is called to implement response and repair to leaking chlorine gas.  The plant is staffed 24 hours per day and 7 days per week.  Plant operators are required to make rounds for inspection and monitoring of the plant processes at least every two hours.  Accordingly, plant staff will detect any releases of chlorine and the Fire Department is trained to respond to this situation. \n\nThe Emergency Response Plan includes: (1) procedures to follow in the event of a chlorine emergency, (2) information about the plant evacuation plan, and (3) a detailed description of the emergency responder's plan for handling such an emergency. \n\nThe McAllen Fire Department has been designated to provide emergency responders and equipment, and will assume Incident Command upon arrival to the plant's emergency call. \n\nPLANNED CHANGES TO IMPROVE SAFETY\nBased on the hazard review and prevention evaluation completed for chlorine, a list of action items was developed and is being considered by North WWTP management to determine if implementation is to be accomplished.  The most notable planned changes include the following:\n\n7 Ensure that the delivery driver follows a set procedure in the delivery of chlorine.  MW will coordinate with the staff to develop a procedure for how the chlorine truck driver or vendor should perform while on plant grounds.  It is anticipated that the vendor can then be subjected to this procedure at the time of the plant's next bi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 15927,
      "SummaryText": "d for chemical purchase.  However, the existing vendor will likely accept these requirements voluntarily to ensure customer satisfaction. \n\n7 The consideration of remote leak detection for chlorine gas in the chlorinator building, as a warning of vacuum regulator failure, and as a backup sensor.\n\n7 Provide backup power for the plant systems in case of a power outage.\n\n7 In the future when the plant facilities are expanded or upgraded, consideration should be given to design and construction of a containment building to encompass the chlorine cylinders designed in conjunction with the capability to chemically neutralize any accidental releases of chlorine.  This option might be compared with the conversion to a nongaseous chlorine compound."
    }
  ]
}