{
  "FacilityID": 16121,
  "FacilityName": "EBRP - North Wastewater Treatment Plant",
  "FacilityStr1": "50 Woodpecker Street",
  "FacilityStr2": null,
  "FacilityCity": "Baton Rouge",
  "FacilityState": "LA",
  "FacilityZipCode": "70807",
  "Facility4DigitZipExt": "2679",
  "FacilityCountyFIPS": "22033",
  "LEPC": "East Baton Rouge LEPC",
  "FacilityLatDecDegs": "30.534167",
  "FacilityLongDecDegs": "-91.206389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A6",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Baton Rouge - East Baton Rouge Parish",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Baton Rouge   EBRP",
  "OperatorStr1": "2443 River Road",
  "OperatorStr2": null,
  "OperatorCity": "Baton Rouge",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70802",
  "OperatorZipCodeExt": "8074",
  "RMPContact": "Bob Wilks",
  "RMPTitle": "North WWTP Superintendent",
  "FTE": 28,
  "OtherEPAFacilityID": "4843",
  "EPAFacilityID": "100000043669",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-10-10 00:00:00",
  "DeRegistrationEffectiveDate": "2018-10-08 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 30.53429,
  "FRS_Long": -91.20221,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 22293,
      "AltID": null,
      "FacilityID": 16121,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 22877,
          "ProcessID": 22293,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 28473,
          "ProcessID": 22293,
          "ChemicalID": 62,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 28474,
          "ProcessID": 22293,
          "ChemicalID": 49,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 528473,
          "ProcessID": 22293,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 528474,
          "ProcessID": 22293,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 16121,
      "SummaryText": "EXECUTIVE SUMMARY\nCity of Baton Rouge\nNorth Wastewater Treatment Plant\n\nDEQ Facility Number 4843\n\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nThe City of Baton Rouge is committed to maintaining full compliance with all federal, state and local regulations.  Pursuant to this commitment, the City makes every effort to operate the wastewater treatment facilities in a safe manner, in accordance with all applicable rules and regulations and according to established good engineering and management principles.  \n\nThe Baton Rouge North Wastewater Treatment Plant (NWWTP) was designed by qualified and experienced engineers and all operating personnel received the necessary training for the safe operation of the plant.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES.\n\nThe NWWTP receives domestic wastewater from the north side of the City's urban perimeter including the Southern University campus, and provides secondary treatment to this wastewater.  Before being discharged into the Mississippi River, the treated effluent is disinfected with chlorine and further treated with sulfur dioxide for removal of the residual chlorine.  The use of these two chemicals makes the NWWTP subject to the provisions and requirements of Section 112(r) of the Clean Air Act.\n\nChlorine.  The NWWTP has two 40,000-gallon storage tanks (nominal size) to satisfy the chlorine needs of the wastewater disinfection process.  Each tank has a working capacity of approximately 30,000 gallons, or approximately 50,000 lb. of liquid chlorine.  This chemical is delivered on the plant site by dedicated tanker trucks operated by the chlorine supplier.  All of the chlorine storage and handling facilities are enclosed inside a steel-frame and concrete building.\n\nSulfur Dioxide.  The NWWTP receives sulfur dioxide in one-ton cylinders which are delivered by truck.  The cylinders are stored inside the sulfur dioxide building, a steel-frame and concrete structure that also houses all of the major"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16121,
      "SummaryText": " components of the dechlorination system.\n\nHAZARD ASSESSMENT RESULTS\n\nPart of the requirements of Section 112(r) is the development of a Worst-Case Scenario (WCS) and an Alternative Release Scenario (ARS)  for the possible release of significant quantities of the regulated toxic substances (chlorine and sulfur dioxide).\n\nWorst Case Scenarios.  The WCS's associated with the NWWTP were assumed as follows:\n\n7 Chlorine: catastrophic failure of a chlorine storage tank, resulting in the release of the entire tank contents (50,000 lb.) within a period of 10 minutes, and \n\n7 Sulfur Dioxide: the total failure of an angle valve on a sulfur dioxide cylinder, resulting in the release of the entire contents of the cylinder (2,000 lb.) within a period of 10 minutes.  \n\nThese worst-case scenarios are extremely unlikely to occur. Also, while these scenarios took into account that the chemicals are inside an enclosed building, they did not take into account other available mitigating conditions such as the existing leak detection devices and alarms and the existing emergency scrubber systems. The caustic scrubber systems are designed to capture the entire contents of a chlorine tank and of a sulfur dioxide cylinder, respectively.  Therefore it was necessary to assume, for the purposes of the Worst-Case Scenarios, that these systems would be inoperable at the time of the release (i.e., they would trip out as soon as they tried to start).\n\nThe maximum distance to the chlorine toxic end point of 0.0087 mg/L was calculated at 5.4 miles.  The maximum distance to the sulfur dioxide toxic end point of 0.0078 mg/L was calculated at 0.9 miles.\n\nAlternate Release Scenarios.  The ARS's associated with the NWWTP were assumed as follows:\n\n7 Chlorine: Failure of a flexible hose connector at one of the chlorine storage tanks.  This would release chlorine gas from the broken hose for one minute, until the tank excess-flow valve is activated. The amount of chlorine released under this scenario was e"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16121,
      "SummaryText": "stimated at approximately 1,610 lb.\n\n7 Sulfur Dioxide: Rupture of a metal tube connection on an empty sulfur dioxide cylinder, while changing cylinders.  This would cause the release of sulfur dioxide gas at an approximate rate of 30 lb. per min. and it would last for approximately 30 minutes until the Hazmat team arrived and closed the cylinder valve.  Total amount released was estimated at approximately 900 lb.\n\n\nThese scenarios are also unlikely but they represent a somewhat more realistic view of a hypothetical release.  Just as in the WCS, existing mitigating conditions were not taken into account in the development of this scenario.  It was also necessary to assume that the caustic scrubber system would trip out as soon as it tried to start and therefore would not be able to capture the released chemical.\n\n\nThe maximum distance to the chlorine toxic end point of 0.0087 mg/L  was calculated at 0.6 miles.  The maximum distance to the sulfur dioxide toxic end point of 0.0078 mg/L was calculated at 0.1 miles.\n\n\nPREVENTION PROGRAM\n\n1.0    Safety Information\n\nThe North Wastewater Treatment plant of the city of Baton Rouge keeps on site the necessary documents related to the operation and maintenance of the plant in a safe manner.  Documentation kept on site provides information regarding the chemical properties and chemical hazards associated with the regulated chemicals (not only chlorine and sulfur dioxide but caustic as well); operating limits for all key process parameters; record of the current inventory of these chemicals; and data on equipment design and specifications.\n\nThese documents include, but are not limited to the following:\n\n7 Copies of current Material Safety Data Sheets (MSDS's) for the chemicals involved\n7 Vendor's Operation and Maintenance (O&M) manuals for each major component of the chlorination and dechlorination systems.\n7 A complete set of construction drawings and specifications\n7 A copy of the plant's Emergency Response Plan\n7 Copies of Shop "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 16121,
      "SummaryText": "Drawings and assembly instructions for all major components\n7 Copies of the Operator's daily log sheets are kept on file.  They show material inventories and a record of the shipments of chemicals delivered on site.\n\nThe above records are updated as applicable and necessary.\n\n2.0     Hazard Review\n\nA review of the hazards associated with the operation of the chlorination and dechlorination systems at the NWWTP was performed in the late Winter and early Spring of 1999.  The Process Hazard and Operability (HAZOP) review technique was used to identify any hazards and ensure that the necessary controls are in place to manage such hazards.\n\nA team of individuals representing the operations, maintenance, safety, engineering and management departments conducted the HAZOP review and issued a report that presents and discusses the \"Action Items\" identified.  This report was submitted to management for resolution.  The corrective action, if any, identified for each action item will be documented and retained on record for future reference.  Similar hazard reviews will be performed in the future, at least once every 5 years.\n\n3.0     Operating Procedures\n\nThe NWWTP keeps on site copies of all operating and maintenance procedures that were prepared and submitted to the city by the plant design firm.  These procedures address not only normal plant operations but other operating modes such as start-up, normal shut-down, emergency shut-downs, start-up following emergency shut-downs, etc.  These procedures also address the removal of individual components from the process for inspection and/or maintenance and they discuss the consequences of deviations from the normal operating conditions and the steps to be followed to correct such deviations.\n\nThe plant's operating and maintenance procedures are reviewed and updated any time that the process undergoes a significant modification or improvement.\n\n4.0    Training\n\nAll of the employees involved in the operation of the chlorination and dechlor"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 16121,
      "SummaryText": "or resolution and corrective action as necessary and applicable.  Documentation of the audits, findings and resolutions will be maintained as part of the prevention program.\n\nThe audit team will include members of the operation, maintenance and management staffs of the wastewater treatment department.\n\n7.0    Incident Investigation\n\nThe NWWTP has established procedures to promptly investigate all incidents which result, or could reasonably have resulted, in a significant release of one or more of the regulated chemicals.  The objectives of such investigations are:\n\n7 to establish the facts relating to the incident, \n7 to determine the factors causing or contributing, directly or indirectly, to the incident and\n7 to define what corrective actions, if any, are necessary to prevent such incidents from occurring in the future.\n\nThe incident investigation team will include members of the staff who are familiar with the process involved in the incident and shall also include personnel from the operations, maintenance and management departments.\n\nThe investigating team will submit its findings and recommendations to plant management for resolution.  Corrective actions taken in response to the investigation report will be tracked until completed.  The final resolution of each finding or recommendation will be documented and the investigation results will be reviewed with all employees, including contractors, who could be affected by said findings.  Incident investigation reports will be kept on file for a minimum of 5 years so that they can be reviewed during future process hazard reviews."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 16121,
      "SummaryText": "ination systems at the NWWTP underwent initial class-room and hands-on training provided by the design consulting firm.  As a part of this training, the employees were given written tests to verify their understanding of the process, the operating conditions, the hazards inherent in the materials being handled and the appropriate responses to alarm conditions and emergencies.  \n\nAny time that the process undergoes modifications, changes or improvements, all operators affected by such changes will be provided with the necessary training.  In addition, periodic refresher training sessions are held with the participation of all operating and maintenance personnel.\n\n5.0    Maintenance\n\nThe NWWTP has in place procedures for the periodic inspection and maintenance of the major components of the chlorination and dechlorination systems.  The operator performs daily rounds, during which he/she visually inspects all process equipment, instruments and piping and also verifies that the system is operating according to design.  The operator will enter his/her comments and observations on the daily log, when and as applicable.  Any condition that requires the maintenance department's attention will be called to the maintenance supervisor's attention, via the submittal of a work order request.\n\nAll members of the maintenance department staff have undergone training and have hands-on experience in the repair and maintenance of process equipment.  In addition, specialized equipment such as the chlorinators, sulfonators and evaporators are maintained by contract personnel who have experience with this particular type of equipment.\n\n\n6.0    Compliance Audits\n\nThe NWWTP has in place compliance safety audit procedures that call for periodic audits to be performed on the plant's Risk Management Program (RMP) at least every three years.  These audits will determine how effectively the policies and procedures of the RMP have been implemented.  The audit findings will be submitted to management f"
    }
  ]
}