{
  "FacilityID": 16187,
  "FacilityName": "Graham-Mebane Water Treatment Plant",
  "FacilityStr1": "8124 US 70",
  "FacilityStr2": null,
  "FacilityCity": "Mebane",
  "FacilityState": "NC",
  "FacilityZipCode": "27302",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37001",
  "LEPC": "Alamance County LEPC",
  "FacilityLatDecDegs": "36.099167",
  "FacilityLongDecDegs": "79.330278",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "G6",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 878957000,
  "ParentCompanyName": "NA",
  "Company2Name": "NA",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Graham",
  "OperatorStr1": "8124 US 70",
  "OperatorStr2": null,
  "OperatorCity": "Mebane",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27302",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000072084",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-08 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Wastewater Treatment - Water Chlorination",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-19 00:00:00",
  "ErrorReportDate": "1999-08-19 00:00:00",
  "ReceiptDate": "1999-08-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-08-16 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2003-08-12 00:00:00",
  "DeRegistrationEffectiveDate": "2002-09-01 00:00:00",
  "AnniversaryDate": "2004-08-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 36.1052,
  "FRS_Long": -79.2652,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 22413,
      "AltID": "Wastewater Treatment",
      "FacilityID": 16187,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 28649,
          "ProcessID": 22413,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 23000,
          "ProcessID": 22413,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 12211,
              "Process_NAICS_ID": 23000,
              "SafetyReviewDate": "1999-03-01 00:00:00",
              "PHA_Date": "1999-03-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-08-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Back Flow System",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Full Scale Excercise",
              "OpProceduresReviewDate": "1999-03-01 00:00:00",
              "TrainingReviewDate": "1999-01-18 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-01-11 00:00:00",
              "EquipmentInspectionDate": "1999-03-01 00:00:00",
              "EquipmentTested": "Full processing area, pipes, valves, and moving equipment",
              "ChangeMgmtDate": "1999-07-10 00:00:00",
              "ChangeMgmtReviewDate": "1999-12-14 00:00:00",
              "PreStartupReviewDate": "1999-03-01 00:00:00",
              "ComplianceAuditDate": "1999-06-11 00:00:00",
              "AuditCompletionDate": "1999-01-25 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-03-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-11-16 00:00:00",
              "ContractorSafetyReviewDate": "1999-12-21 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Wastewater is received and it is treated with chlorine and other chemicals and is then discharged for public use.",
              "_chemicals": [
                {
                  "PrimaryKey": 17352,
                  "PreventionProgram3ID": 12211,
                  "ProcessChemicalID": 28649
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 16187,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-07-10 00:00:00",
    "ERTrainingDate": "1998-07-10 00:00:00",
    "CoordinatingAgencyName": "Graham Fire Dept. - HazMat Response",
    "CoordinatingAgencyPhone": "3365706701",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 16187,
      "SummaryText": "\n\nGeneral Executive Summary for Graham-Mebane Water Treatment Plant\n\n1.    Accidental Release Prevention and Emergency Response Policies\nWe at Graham-Mebane Water Treatment Plant are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, we are completely coordinated with Graham Fire Department - HazMat Response Team which provides highly trained emergency response personnel to control and mitigate the effects of the release.\n\n\n2.    The Stationary Source and the Regulated Substances Handled\nOur facility's primary activities encompass Treatment of water using chlorination.  We have 1 regulated substances present at our facility.  These substances include  and Chlorine.  The regulated substances at our facility are involved in several uses.  Chlorine is used for the  chlorination of waste water.\n\nThe maximum inventory of Chlorine at our facility is 8000.00 lb..\n\n3.    The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\nTo perform the required offsite consequence analysis for our facility, we have used the look-up tables and equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance.  The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for Program 2 and 3 toxic substances as a class involves a catastrophic release from Chlorination of wastewater.  The scenario involves the release of 8000 lb. of Chlorine in a gaseous form over 10 minutes.  At Class F atmospheric stability a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16187,
      "SummaryText": "nd 1.5 m/s windspeed, the maximum distance of 12 miles is obtained corresponding to a toxic endpoint of 0.0087 mg/L.\n\nOne alternative release scenario has been submitted for each toxic substance present in Program 2 and Program 3 processes cumulatively.  \n\nThe alternative release scenario for Chlorine involves a release from Chlorine Processing Area and Storage in the Chlorination of wastewater process.  The scenario involves the release of 2000 lb. of Chlorine in a gaseous form over 10 minutes.  The release is also assumed to be controlled by active mitigation measures that include emergency shutdown systems.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.0087 mg/L of Chlorine is 2.4 miles.\n\n\n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119.  Our facility is also subject to EPCRA Section 302 notification requirements.    The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nGraham-Mebane Water Treatment Plant maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is a combination of What-If scenarios and Checklists.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of (time period).  Any findings related to the hazard "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16187,
      "SummaryText": "analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Graham-Mebane Water Treatment Plant maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nGraham-Mebane Water Treatment Plant has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least yearly and more frequently as needed.\n\nMechanical Integrity\nGraham-Mebane Water Treatment Plant carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Graham-Mebane Water Treatment Plant to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regul"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 16187,
      "SummaryText": "ar practice at Graham-Mebane Water Treatment Plant.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nGraham-Mebane Water Treatment Plant conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nGraham-Mebane Water Treatment Plant promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nGraham-Mebane Water Treatment Plant truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Graham-Mebane Water Treatment Plant has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n5.    Fiv"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 16187,
      "SummaryText": "e-year Accident History\nGraham-Mebane Water Treatment Plant has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n6.    Emergency Response Plan\nGraham-Mebane Water Treatment Plant carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nAlamance County LEPC (Kevin Dull, Chairperson) is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n7.    Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Review of the process area and the current storage procedures are some of the major steps we want to take to improve safety at our facility.  These changes are expected to be implemented if the changes are approved.\n\n8.    Certification Statement\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\nName:\nSignature:\nTitle:\nDate signed:"
    }
  ]
}