{
  "FacilityID": 1620,
  "FacilityName": "Palm Beach County Water Treatment Plant #9",
  "FacilityStr1": "22438 SW 7th Street",
  "FacilityStr2": null,
  "FacilityCity": "Boca Raton",
  "FacilityState": "FL",
  "FacilityZipCode": "33428",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12099",
  "LEPC": "Treasure Coast Reg Pl Council",
  "FacilityLatDecDegs": "26.342694",
  "FacilityLongDecDegs": "-80.196667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G3",
  "LatLongDescription": "PU",
  "FacilityURL": "http://www.co.palm-beach.fl.us",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 609070768,
  "ParentCompanyName": "Palm Beach County Board of County Commissioners",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "PBC Water Utilities Dept",
  "OperatorStr1": "2065 Prairie Road",
  "OperatorStr2": null,
  "OperatorCity": "West Palm Beach",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33406",
  "OperatorZipCodeExt": "7718",
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000018991",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-01-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2002-10-28 00:00:00",
  "DeRegistrationEffectiveDate": "2002-10-01 00:00:00",
  "AnniversaryDate": "2004-06-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.4",
  "FRS_Lat": 26.34269,
  "FRS_Long": -80.19667,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1752,
      "AltID": "Chlorine System",
      "FacilityID": 1620,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1866,
          "ProcessID": 1752,
          "ChemicalID": 62,
          "Quantity": 44000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1789,
          "ProcessID": 1752,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 407,
              "Process_NAICS_ID": 1789,
              "SafetyReviewDate": "1996-07-17 00:00:00",
              "PHA_Date": "1996-07-17 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-02-11 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-02-15 00:00:00",
              "TrainingReviewDate": "1999-02-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1996-07-17 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "Facility uses an ongoing scheduled-frequency Preventive Maintenance Program computer generated for equipment such as vacuum regulators, Cl2 detectors, emergency scrubber unit, etc.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-01 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Prevention Program Description\n\n\nThe Executive Summary provides additional information regarding the elements of the facility prevention program.  The following is a brief summary of the prevention program:\n\nThe facility operates a single process chlorine system for the disinfection of treated water.  The amount of chlorine used is in excess of the threshold quantities published by EPA.  The chlorine system is operating under the findings of a Hazard & Operability Study as part of a Process Hazard Analysis review.  This review critically reviews each pipeline, each piece of equipment, each procedure looking for ways where a chlorine release may occur.  As a result, recommendations are made and implemented which eliminates or lessens the risk of a release.  It should be noted that the facility did not have an accidental release of chlorine in the last five years.\n\nEmployees participate and are encouraged to participate in many aspects of the entire Risk Management Program including elements of the prevention program.\n\nOperating Procedures are an important part of the prevention program.  Written procedures are in place and appropriate training is given to each operator of the system.  Mechanical integrity of the components of the chlorine system is aggressively performed.  The facility uses a computer generated work order system, that directs mechanics and electricians in to how and when to perform preventive maintenance on the system components.  Frequency of maintenance and maintenance procedures are scheduled in accordance with the equipment manufacturer's recommendations.\n\nThe replacement of exact components of the system is acceptable.  However, the replacement of components not considered \"replacement in kind,\" must follow a Management of Change procedure and a Pre-startup Safety Review.  This may require a Hazard and Operability Study.\n\nThe facility has a detailed procedure for the investigation of any chlorine release incidents.  Findings of the investigation result in recommendations, which are then implemented and communicated to appropriate personnel.\n\nThe facility has Hot Work Permit procedure in the prevention program.  The purpose of the procedure is to ensure that a Hot Work Permit is issued for all hot work operations performed on or near the chlorine process.\n\nIt should be noted that a Management Plan, specifying responsibilities, is part of the overall Risk Management Plan.  It serves as a tool that avoids miscommunication in the implementation of all program elements.",
              "_chemicals": [
                {
                  "PrimaryKey": 466,
                  "PreventionProgram3ID": 407,
                  "ProcessChemicalID": 1866
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1620,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Palm Beach County Fire/Rescue",
    "CoordinatingAgencyPhone": "5619651872",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1620,
      "SummaryText": "EXECUTIVE SUMMARY\nFOR WTP #9\n\n\nRegulatory Overview\n\nThe Clean Air Act was Amended in 1990 and among its many changes, created Section 112(r), Prevention of Accidental Releases.  The Environmental Protection Agency instituted 40 CFR Part 68, Chemical Accident Prevention Provisions, as an implementing rule.  The purpose of the rule is to set forth requirements to prevent the accidental release of toxic substances and minimize the consequences of any release.  The rule is commonly referred to as the Risk Management Plan Rule.  The Environmental Protection Agency also finalized a list of 77 toxic and 63 flammable substances with specific threshold quantities.  Facilities that handle any of the listed substances above the threshold quantity are subject to the requirements of the Risk Management Program Rule.\n\n\nChemical Substance\n\nOf the 140 chemical substances on the list, Water Treatment Plant #9 only uses or stores chlorine above the threshold quantity and has the capacity to store up to 44,000 pounds.\nThe facility is designed to safely treat and provide 20 million gallons of safe drinking water to its customers each day.  Chlorine is used as a disinfectant in the water treatment process to eliminate the risk of such waterborne diseases as cholera, typhoid and dysentery.  Chlorine has been used as a disinfectant for almost a hundred years, and today, chlorine is safely used in 98% of all water systems.\n\n\nFive Year Accident History\n\nThe Risk Management Program requires the reporting of all accidental releases of covered processes that resulted in deaths, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage, in the last five years.  Water Treatment Plant #9 has had no accidental chlorine releases.\n\n\nOverall Safety\n\nThe facility implements safety and health policies and procedures that are communicated in the Water Utilities Department Safety and Health Manual.  The"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1620,
      "SummaryText": "se procedures are designed to protect workers from potential hazards when handling chemicals, operating a process, and maintaining equipment.  The Water Utilities Department has also prepared a Safety and Health Policy Statement.  A few extractions are as follows:\n\n\"It is the policy of Palm Beach County Water Utilities Department to ensure that every employee is entitled to a safe and healthful place to work and that activities are conducted in such a manner as to minimize risk to employees and the surrounding community.\"\n\n\"Operational decisions affecting safety and health will receive greater consideration than those affecting productivity.\"\n\n\"Management commitment and support is given to all initiatives regarding safety and health.\"\n\nThe Chlorine system is enclosed in a block constructed building with metal doors.  Included in the chlorine system design is a chlorine gas scrubbing system that absorbs and neutralizes any chlorine gas emitted inside the chlorine building.  The scrubbing system disallows chlorine gas to escape to the outdoor atmosphere.\n\nWater Treatment Plant #9 has been in compliance with OSHA 1910.119 \"Process Safety Management of Highly Hazardous Chemicals,\" for the chlorine system, since May 1997.  The OSHA Standard has a prevention program similar to the Risk Management Program Rule.\n\nThe Risk Management Program Rule allows the facility to incorporate the requirements of the OSHA Standard and in effect, provide a facility plan that manages a formal prevention program and a emergency response program.  The facility meets compliance with both the Risk Management Plan Rule and OSHA's Process Safety Standard.\n\n\nProcess Description Overview\n\nChlorine gas is delivered to Water Treatment Plant #9 by truck in 1 ton steel containers (2,000 pounds of chlorine in each container).  A bridge crane and hoist are used to off-load the containers from the truck and place them inside the chlorine building in holders called trunnions.  This prevents containers fro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1620,
      "SummaryText": "m moving.  Empty containers are removed from the trunnions and placed on the truck to be returned to the supplier.\n\nThe chlorine gas process is operated such that only four containers are in use at any time and another four containers are on-line in reserve.  The containers being used and the reserve containers are placed on scales.  The scales are used to measure chlorine container contents and system usage.\n\nA vacuum regulator is connected to each 1 ton container and in turn is connected to piping that leads to the chlorinators.  The chlorinators are connected to piping that leads to the injectors.  The chlorination process begins when process water flowing through the injector induces vacuum that is maintained throughout the entire chlorine feed system.  The chlorinator is set to allow a specific amount of chlorine gas to travel to the injector.  The vacuum allows the vacuum regulators on the chlorine containers to open and allow the chlorine gas to enter the piping system.  In any situation that decreases the vacuum in the pipelines, the vacuum regulators on the containers will close.  This safety feature prevents chlorine from escaping any part of the system.\n\nThere are chlorine detectors inside the chlorine building.  The detector is set to alarm at 1 part per million and 3 parts per million and activate an audible and visual alarm.  At 3 Parts per million, the chlorine gas scrubber unit that is interlocked with the detector will activate.  The scrubber system will maintain a negative pressure inside the chlorine building and draw the chlorine gas to wear it will be neutralized.  No chlorine gas is expected to be emitted to the outside of the building.\n\nThe chlorine gas feed system has many built-in safety features that minimizes a chlorine gas release to the atmosphere.  They are: \n\nVacuum feed system instead of a pressurized system;\nVacuum regulator closes when vacuum is lost (i.e. broken pipe);\nVacuum regulator at each container;\nChlorine detector and alarm"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1620,
      "SummaryText": " system in the immediate area;\nEnclosed chlorine gas system;\nChlorine gas scrubber system;\nOperational procedures\nEmergency Action Plans\n\n\nWorst-case Release Scenario\n\nThe EPA defines worst-case release scenario as a release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to a specified endpoint.  The EPA has determined that the endpoint for chlorine is 0.0087 milligrams of chlorine, per liter of air (about 3 parts per million).  The endpoint value, determined by the American Industrial Hygiene Association, is the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to 1 hour without experiencing or developing irreversible or other serious health effects or symptoms that could impair an individual's ability to take protective action.\n\nThe selected worst-case release scenario at Water Treatment Plant #9 is a catastrophic failure of a one-ton chlorine container.  This event takes place outdoors by the chlorine building and no active or passive mitigation is available.  The event results in a release of 2,000 pounds of chlorine gas.\n\nSpecific EPA release parameters and EPA RMP*COMP dispersion modeling were used to calculate the distance to endpoint.  The modeling estimates the endpoint to be 1.3 miles from the release location.  Therefore, the boundary within the 1.3-mile radius from the point of release is considered the area of concern.\n\nResidential population in the radius is estimated to be 29,000.  Public receptors include residences, a school, a hospital, park/recreation areas, and commercial office buildings. There are no environmental receptors such as national or state parks, monuments, or officially designated wildlife sanctuaries.\n\nThe worst-case release scenario is an event that is unlikely to occur but is considered to have the greatest impact on the facility and the community.  Considerations for minimizing the risk of this"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1620,
      "SummaryText": " scenario are: one-ton chlorine containers are welded steel; and valve covers are in place when transporting and handling them.\n\n\nAlternative Release Scenario\n\nThe EPA requires a selection of an alternate release scenario that is more likely to occur than the worst-case release scenario and will reach and endpoint off-site.  In this scenario, the endpoint for chlorine remains the same as 0.0087 milligrams of chlorine, per liter of air (about 3 parts per million).\n\nThe selected alternative release scenario at Water Treatment Plant #9 is when a chlorine valve is dislodged from a one-ton chlorine container.  The event takes place inside the closed chlorine building.  The dedicated chlorine scrubber system, which is considered active mitigation, fails to operate.  This event releases 2,000 pounds of chlorine gas inside the building with an estimated 1,100 pounds seeping outdoors, by EPA estimate.  The building is considered passive mitigation.\n\nEPA release parameters and EPA RMP*COMP dispersion modeling were used to calculate the distance to endpoint.  The modeling estimates the endpoint to be 0.2 miles (1,056 feet) from the chlorine building.  Therefore, the boundary within the 0.2 mile radius is considered the area of concern.\n\nResidential population is estimated to be 1,900 with no environmental receptors.  There are numerous built-in safety features that minimize the risk of this scenario from happening.  As stated in the process overview, vacuum regulators are used at each container, the scrubber system is interlocked with the chlorine detector and activates at 3 ppm, the scrubber system can be manually activated, and the facility has a generator for alternative electrical power.  Emergency action plans are in place for first responders.\n\n\nAccidental Release Prevention Program\n\nBoth the EPA Risk Management Plan and OSHA Process Safety Management Plan requires a accidental release prevention program.  The release prevention program in the Risk Management Plan for Wa"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1620,
      "SummaryText": "ter Treatment Plant #9 complies with the requirements of both agencies.\n\nThe goal of the release prevention program is to reduce the risk to employees and the community of injury or death and the protection of the environment.  The prevention program requires an in-depth review of the chlorine process and allows for the implementation of key elements or programs that prevent a release.  The following is an overview of the release prevention elements at Water Treatment Plant #9:\n\n\nProcess Safety Information\n\nA gathering of information relative to the chlorine process was obtained.  This information includes the hazards of chlorine, the equipment used in the chlorine process such as vacuum regulators, type of piping for chlorine use, chlorinators, detector equipment, scrubber system components, etc.  This information is necessary to proceed with a process hazard analysis for the entire chlorine system.\n\n\nProcess Hazard Analysis\n\nA process hazard analysis is a method of identifying, evaluating, and controlling any risks associated with the chlorine process.  A Hazard and Operability Study was used to review the entire chlorine process.  Essentially it is a method where all parts of the system (i.e. from delivery of one-ton containers to the endpoint of chlorine injected into the processed water) are looked at.  Any equipment or existing operational procedure that reveals a potential of a release is scrutinized and recommendations are made that will lessen or eliminate the risk of a release.  These recommendations are instituted where appropriate.  \n\nIt should be noted that the Hazard and Operability Study is a multidisciplinary team approach that allows the participants to review risk in their area of expertise.  Some team members included a Process Hazard Analysis Team Leader, Plant Engineer, Plant Superintendent, Project Engineer, Facility Chief Operator, Industrial Electrician, and a Utility Plant Mechanic.\n\n\nOperating Procedures\n\nWritten operating procedures are in"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1620,
      "SummaryText": " place for all stages of the chlorine system operation.  The facility uses a Job Safety Analysis format.  This format describes steps to be taken in a job task in proper sequence and integrates critical safety precautions and personal protective equipment necessary to perform the task.  As examples, there are operating procedures for unloading new chlorine containers, system emergency shutdown, initial startup, chlorine scrubber test, chlorine detector test, etc.  Operators are trained and tested in these operating procedures.\n\n\nTraining\n\nThe purpose of training is to ensure that personnel working on or near the chlorine process are adequately trained and understand the inherent hazards and appropriate responses.  Training is an integral part of preventing and mitigating the effects of accidental releases. The training section of the facility release prevention program specifies who and when an employee is to be trained and what the employee is to be trained on.  Training is ongoing and any equipment or procedural change that is made is communicated to the employees.\n\n\nMechanical Integrity\n\nMechanical Integrity is defined as the process of ensuring that process equipment is fabricated from the proper materials of construction and is properly installed, maintained, and replaced to prevent failures and accidental releases.  The facility Mechanical Integrity Program addresses the following:\n\n7 Identification of critical process equipment and instrumentation;\n7 Written maintenance, testing, and inspection schedules and procedures;\n7 Maintenance, testing, and inspection completion and documentation;\n7 Correction of equipment deficiencies;\n7 Quality assurance;\n7 Maintenance personnel training.\n\nAs part of the preventive maintenance program, equipment mechanical integrity is managed through a computer generated work order system.  This work order system handles all maintenance aspects of the chlorine system, which includes work order management, planning and scheduling, as"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1620,
      "SummaryText": "set management and tracking, and reports and analysis.  Identification of critical equipment is part of the work order system and is scheduled for preventive maintenance in accordance with manufacturer's recommendations.\n\n\nManagement of Change\n\nRegarding the chlorine system, change is defined as all modifications to raw materials, process technology, facility, equipment, and procedures.  Changes not considered as a \"replacement in kind,\" are subject to the facility Management of Change Procedure and will not be performed without authorized approval.  Changes that have an effect on the chlorine process may be subject to a Hazard and Operability Study to analyze the change in equipment and conditions that may present risk.  Where changes are significant enough to require a change in process safety information, the Management of Change Procedure must be performed in conjunction with the facility Pre-startup Safety Review Procedure.\n\n\nPre-startup Safety Review\n\nA Pre-startup Safety Review is required when changes to the existing chlorine process results in a modification that is significant enough to require a change in process safety information.  The purpose of the Pre-startup Safety Review is to ensure that the facility is ready to safely operate the modified chlorine system.  The review consists of a chlorine system checklist, approvals by the Plant Engineer, required documentation, operator and maintenance mechanic training, and corrections of any deficiencies discovered in the review.\n\n\nCompliance Audits\n\nA Risk Management Program audit will be performed at least once every three years at this facility, in accordance with the Risk Management Plan requirements.  An internal audit team will perform the audit.  The audit will include a review of the facility's Risk Management Program for the chlorine process.  This includes required supporting documentation, interviews of personnel, and a walk through and inspection of the chlorine process area.\n\nAn audit report docu"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1620,
      "SummaryText": "menting all findings will be prepared.  This will include a listing of all deficiencies and recommended corrective actions.  Plant management will ensure that all corrective actions are resolved in a timely manner.  Chlorine process operators and maintenance mechanics will be informed of all changes.\n\n\nIncident Investigation\n\nAll chlorine incidents at the facility, which result in or could have resulted in a release of chlorine, will be promptly investigated.  The incident investigation procedure is part of the preventive maintenance program.  The purpose of the incident investigation procedure is to identify the underlying causes of an incident and to implement corrective measures to prevent the incident from reoccurring.  Chlorine release incidents are communicated immediately to appropriate government agencies.\n\nThe facility uses an investigative team approach to discover the contributory and root causes of an incident.  The Director of Operations and Maintenance establishes the investigation team.  Members of the team include the Director of O&M, Plant Superintendent, Regulatory Programs Coordinator, Plant Engineer, and affected and/or responding employees.  Other individuals with appropriate knowledge will be asked to participate (i.e., plant electrician, plant mechanic, equipment supplier).\n\nThe team will prepare a report of the findings and submit recommendations that will prevent a similar incident from occurring.  All recommendations are resolved.  The incident investigation report findings and recommendations are communicated to all facility employees.\n\n\nEmployee Participation\n\nThe facility recognizes that it is essential to involve its employees in the development and implementation of this OSHA Process Safety Management and EPA Risk Management Program.  The facility has an Employee Participation Plan procedure as part of its prevention program.  It sets forth procedures for involving employees in Process Hazard Analysis and other Risk Management Program "
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1620,
      "SummaryText": "elements.  It also provides procedures for communicating employees rights to access Risk Management Program information, and documenting employee participation.\n\n\nHot Work Permit\n\nThe facility has a Hot Work Permit Procedure in its prevention program.  The purpose of the procedure is to ensure that a Hot Work Permit is issued for all hot work operations performed on or near the chlorine process.  Hot Work is defined as work involving electric or gas welding, cutting, brazing, or similar flame or spark-producing operations.  Chlorine is not flammable, but is considered an oxidizer and can support combustion of burning materials.  There are practically no materials in the chlorine building that can burn.\n\n\nEmergency Response\n\nThis treatment facility is limited in its ability to provide a full emergency response to an accidental release of chlorine.  Therefore, it is prudent to institute emergency action plans that allow a release to be managed by experienced responders such as Palm Beach County Fire/Rescue Responders and Public Safety Officials.  The facility meets compliance with emergency action plans listed in OSHA 1910.38.\n\nThe emergency action plans are performed on a first responder level which includes the recognition of a chlorine release, appropriate means of reporting a release, site emergency evacuation procedures, and accounting of evacuated personnel.\n\nThe emergency action plan is reviewed by Fire/Rescue personnel. Facility and Fire/Rescue personnel will perform an annual drill at the site.  All facility employees receive training on the emergency action plan.  Changes to the plan are communicated to all affected personnel.\n\n\nPlanned Changes to Improve Safety\n\nPalm Beach County Water Utilities Department is presently building a new membrane softening water treatment facility on this site.  The new facility will be using sodium hypochlorite instead of chlorine as a disinfectant."
    }
  ]
}