{
  "FacilityID": 16278,
  "FacilityName": "Magnesium Corporation of America",
  "FacilityStr1": "15 Miles North of Exit 77 on I-80",
  "FacilityStr2": null,
  "FacilityCity": "Rowley",
  "FacilityState": "UT",
  "FacilityZipCode": "84074",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "49045",
  "LEPC": "Tooele County LEPC",
  "FacilityLatDecDegs": "40.915944",
  "FacilityLongDecDegs": "112.731944",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I1",
  "LatLongDescription": "PP",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 113405435,
  "ParentCompanyName": "The Renco Group Inc.",
  "Company2Name": null,
  "CompanyDUNS": 147854152,
  "Company2DUNS": null,
  "OperatorName": "Magnesium Corporation of America",
  "OperatorStr1": "238 North 2200 West",
  "OperatorStr2": null,
  "OperatorCity": "Salt Lake City",
  "OperatorStateFIPS": "UT",
  "OperatorZipCode": "84116",
  "OperatorZipCodeExt": null,
  "FTE": 550,
  "OtherEPAFacilityID": "84074MXMGNROWLE",
  "EPAFacilityID": "100000146683",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-07-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-08-11 00:00:00",
  "ErrorReportDate": "1999-08-11 00:00:00",
  "ReceiptDate": "1999-08-09 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-08-03 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.915581,
  "FRS_Long": -112.734253,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 22580,
      "AltID": "Magnesium Manufacture",
      "FacilityID": 16278,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 28871,
          "ProcessID": 22580,
          "ChemicalID": 62,
          "Quantity": 600000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 28872,
          "ProcessID": 22580,
          "ChemicalID": 51,
          "Quantity": 3200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 23169,
          "ProcessID": 22580,
          "NAICSCode": "33141",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 12316,
              "Process_NAICS_ID": 23169,
              "SafetyReviewDate": "1999-06-01 00:00:00",
              "PHA_Date": "1999-09-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-01 00:00:00",
              "TrainingReviewDate": "1999-06-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-01 00:00:00",
              "EquipmentInspectionDate": "1999-04-01 00:00:00",
              "EquipmentTested": "East Chlorine Storage Tank;  Secondary Chlorine Accumulator",
              "ChangeMgmtDate": "1999-03-01 00:00:00",
              "ChangeMgmtReviewDate": "1992-08-15 00:00:00",
              "PreStartupReviewDate": "1999-05-01 00:00:00",
              "ComplianceAuditDate": "1999-06-10 00:00:00",
              "AuditCompletionDate": "1999-12-31 00:00:00",
              "IncidentInvestigationDate": "1995-09-01 00:00:00",
              "InvestigationChangeDate": "1996-02-01 00:00:00",
              "ParticipationPlansReviewDate": "1992-08-12 00:00:00",
              "HotWorkPermitReviewDate": "1990-06-01 00:00:00",
              "ContractorSafetyReviewDate": "1998-06-03 00:00:00",
              "ContractorSafetyEvalDate": "1997-03-27 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 17496,
                  "PreventionProgram3ID": 12316,
                  "ProcessChemicalID": 28871
                },
                {
                  "PrimaryKey": 17497,
                  "PreventionProgram3ID": 12316,
                  "ProcessChemicalID": 28872
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 16278,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-01 00:00:00",
    "ERTrainingDate": "1998-08-01 00:00:00",
    "CoordinatingAgencyName": "Tooele County LEPC",
    "CoordinatingAgencyPhone": "4358825600",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 16278,
      "SummaryText": "Executive Summary (Submitted in accordance w/ 40 CFR 68.155)\n\n\nMagnesium Corporation of America (Magcorp) is a fully integrated primary magnesium producer located at a remote portion Tooele County in Western Utah identified on maps as Rowley.  Magcorp employs approximately 550 individuals in a wide variety of jobs.    The facility for magnesium production at Rowley has operated for approximately 27 years.  The magnesium operation derives it's raw materials form the waters of the Great Salt Lake.   The manufacturing facility utilizes a wide variety of chemical, electrochemical and pyro-metallurgical unit processes to produce high grade primary and alloyed magnesium. In addition to magnesium, Magcorp also produces chlorine as a co-product and other byproducts from its operations.\n\nMagcorp is committed to the safety of it's employees as well as the safety of the surrounding community.  It has taken the necessary steps to prevent the accidental release of hazardous chemicals including those  regulated by the regulation under which this document is submitted.    To aid the prevention of accidental releases, Magcorp has long had a published  emergency response plan that addresses a wide range of contingencies involving on site as well as off site consequences should an accident occur.  Magcorp has analyzed it's production processes by formal HAZOP functions utilizing a diversity of employee disciplines and perspectives to assure that the potential hazards are recognized and properly addressed.  Magcorp has a system that addresses and manages changes to it's equipment and processes in a controlled way that recognizes and minimizes the inherent hazards.   Magcorp has an extensive employee training program that deals with all facets involved of its operations.      The range of that training involves job safety, product quality, environmental responsibility, production efficiency, etc.   This training systems develops the necessary working knowledge to assist the preventio"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16278,
      "SummaryText": "n of accidental releases.     \n\nIn regards to the RMP plan that is being submitted, Magcorp has two  chemicals in volumes that exceed the threshold quantities specified by the regulation.  Chlorine which is produced  onsite is at all times in excess of the 2,500 lb threshold value.  This chlorine is stored for use in the  manufacture of magnesium and ferric chloride, and is also available for outside sales via rail cars or trucks.  Titanium tetrachloride is used as a manufacturing aid to produce certain specialty magnesium products.    It is not always present on plant site, but is onsite an estimated 60 days per year.   It is received in commercial liquid cylinders of 3200 lbs which exceeds the 2500 lbs threshold.\n\n\nAll of the equipment involved in producing magnesium and chlorine is protected by a detailed preventative and predictive maintenance program to assure proper equipment operation and availability.   The vessels  that store and transport chlorine are coded pressure vessels and are periodically checked in accordance with applicable codes and good engineering practice via hydrostatic testing, ultrasonic thickness gauging, and other non-destructive testing to assure safe and continued operation.    The processes involving chlorine production and use are monitored and in many areas controls are automated to assist accident prevention.  The equipment that controls chlorine in the manufacturing process have adequate redundancy and failsafes that aid in preventing catastrophic releases of chlorine in any, but most unlikely circumstances.   Accidental release of stored chlorine is prevented by the standard industrial systems including vents, pressure relief valves and disks; check valves, excess flow valves, scrubbing equipment, manual and automatic shut off systems, and other conventional systems.\n\nTitanium tetrachloride is received in commercial DOT approved transport cylinders containing 3200 lbs when full.  It is conveyed into the process by a short run of tu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16278,
      "SummaryText": "bing.   The titanium tetrachloride process has been subjected to process hazard analysis via HAZOP.  Employees are appropriately trained to deal with the potential hazard and to avoid accidental releases.\n\n.The worst case release scenario for chlorine envisions the rupture,  and nearly instantaneous emptying and vaporization of chlorine from one of two 600,000 lbs (300 ton) liquid chlorine storage vessels.  The effects of this imagined event according to the atmospheric modeling (RMP Comp. Ver. 1.06)  could have effects for up to 25 miles from the point of origin.    If the predicted laminar flow winds were from an unfavorable direction with the unusual weather conditions specified by the regulation, the model predicts that some  residents living on the northwest quadrant of Grantsville, Utah could be effected near the end of the 25 mile  radius. It should be noted, however, that this worst case scenario for chlorine is very unrealistic in fact because: 1) the type of event necessary to cause a  rupture in a heavy steel storage vessel sufficient to empty the entire contents in 10 minutes has an extremely low probability; 2)  The amount of energy input required to vaporize 300 tons of stored liquid chlorine in 10 minutes is very large (a rate of 50 billion Btu/hr) to the point of being essentially impossible; and 3) The model doesn't account for the atmospheric reactivity of chlorine which would substantially diminish the predicted downstream concentrations and largely mitigate the predicted toxic endpoint. Other atmospheric models (not used in the scenarios presented in this document) that account for the atmospheric degradation of chlorine would drastically reduce the distance to the toxic end point.  The emergency response procedure for the kind of catastrophic  release produced in the worst case release scenario would likely trigger evacuation procedures on-site and the  notification of the local emergency response agencies to allow for evacuation, in place shelt"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 16278,
      "SummaryText": "ering, or other protective measures to be taken. \n\t\nThe alternate release scenario for chlorine envisions the complete failure of a loading hose at the railcar loading station where for unknown reasons normal automatic shut offs fail to activate and the release continued undetected for 10 minutes releasing a maximum of 10,000 lbs of chlorine.    According to the atmospheric model used , the toxic end point for this alternative scenario would extend for 1.3 miles.    There is only one industrial facility, Hills Bros. Chemical, that could potentially be affected by such an occurrence and no other public receptors.   Hills Bros. Chemical is located directly adjacent to the Magcorp facility and is well acquainted with appropriate emergency procedures appertaining to Magcorp's operation.   In the unlikely occurrence of this alternative scenario, the chlorine flow could be curtailed  by shutting down the loading pump.  Wind direction and other conditions may trigger an evacuation at Magcorp and/or Hill Bros. Chemical. \n\n The worst case release scenario for titanium tetrachloride envisions the complete  rupture and evacuation of a full cylinder of liquid TiCl4  in the outside air at the receiving dock  followed by vaporization.   The toxic endpoint for this occurrence is predicted by the model to be 1.4 miles from the point of origin.   Due to the remote location, the only offsite receptor affected by this worst case release would be the previously mentioned Hill Bros. Chemical facility.    \n\nAn alternative release scenario for titanium tetrachloride envisions failure of the storage cylinder.  This scenario shows the release of 3110 lbs, essentially a full cylinder, over a ten minute period into class Datmospheric conditions rather than the class F in the worst case scenario.The model for the alternate scenario shows a toxic end point of 0.4 miles. (Other alternate scenarios evaluated showed no off site affects.)    The predicted toxic endpoint for this scenario would"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 16278,
      "SummaryText": "be just offsite and could reach to Hill Bros. Chemical. This is scenario is wholly unrealistic in that it presumes that the release would go undetected for a substantial amount of time, and that after the spill was finally detected, no mitigating measures would be taken during the two and half hours required for the spilled liquid to volatilize and disperse.   The products of  titanium tetrachloride emissions  are highly visible as a ground hugging intensely white cloud and are easily identified.  In the unlikely event that such a release occurred, the effects could be easily mitigated with water sprays. It is possible that an onsite and off site evacuation could be triggered by this alternate scenario.\n\nIn the last five years, there have been no accidental releases of regulated chemicals that have caused injury, evacuation or property damage.   Our current records don't show any incident where there were off site deaths, injuries, significant property or environmental damage have occurred as the result of accidental release of either chlorine or titanium tetrachloride. \n\nMagcorp is actively involved as member of the local emergency planning committee and contributes expertise as well as some resources to that group.     That plan has been reviewed in the past by the Utah Div. of Emergency Response and Remediation and was given the grade of A for completeness and applicability.  Magcorp's emergency response plan and resources are included in the Tooele County Emergency Response Plan.   Due to its' remote location, it is unrealistic to expect immediate response from public agencies in the event of an emergency.   Consequently Magcorp maintains a fire brigade composed of state certified fireman, an Emergency Medical Technician group, and a hazardous material response team.   All of these groups have onsite presence at Rowley 24 hours of every day.\n\nMagcorp is committed to continuous improvement.   The current systems in place to prevent accidental releases will be p"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 16278,
      "SummaryText": "eriodically reviewed.   Modifications that will improve safety and avoid accidental release of regulated substances will be implemented through managed improvement."
    }
  ]
}