{
  "FacilityID": 16300,
  "FacilityName": "AES Somerset L.L.C.",
  "FacilityStr1": "7725 Lake Road",
  "FacilityStr2": null,
  "FacilityCity": "Barker",
  "FacilityState": "NY",
  "FacilityZipCode": "14012",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36063",
  "LEPC": "Niagara County LEPC",
  "FacilityLatDecDegs": "43.3545",
  "FacilityLongDecDegs": "-78.604694",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A5",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "AES Eastern Energy, L.P.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "AES Somerset L.L.C.",
  "OperatorStr1": "7725 Lake Road",
  "OperatorStr2": null,
  "OperatorCity": "Barker",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14012",
  "OperatorZipCodeExt": null,
  "RMPContact": "Richard M. Scott",
  "RMPTitle": "Safety Coordinator",
  "FTE": 144,
  "OtherEPAFacilityID": "NYD000730465",
  "EPAFacilityID": "100000158269",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "9-2938-00003",
  "SafetyInspectionDate": "1991-06-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-13 00:00:00",
  "ErrorReportDate": "1999-08-13 00:00:00",
  "ReceiptDate": "1999-07-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-07-07 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2020-05-08 00:00:00",
  "DeRegistrationEffectiveDate": "2020-04-30 00:00:00",
  "AnniversaryDate": "2004-07-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 43.353,
  "FRS_Long": -78.59628,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 22611,
      "AltID": null,
      "FacilityID": 16300,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 23200,
          "ProcessID": 22611,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 28914,
          "ProcessID": 22611,
          "ChemicalID": 56,
          "Quantity": 405450.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 528914,
          "ProcessID": 22611,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 16300,
      "SummaryText": "AES Somerset, L.L.C. has established accidental release prevention and emergency response policies to ensure the safety of plant employees and the surrounding community. AES Somerset strives to improve safety conditions in all processes, and works closely with local and state emergency response agencies to minimize the potential for and the consequences of accidental releases.\n AES Somerset owns and operates a coal-fired electric generation plant in the Town of Somerset, New York, to meet new air quality standards, the facility is installing a selective catalytic reduction (SCR) system. The SCR system uses anhydrous ammonia to reduce nitrogen oxides (NOx) to nitrogen and water. The facility will have the working capacity to store 76,500 gallons of anhydorus ammonia on site. The SCR system will be operational in the summer of 1999. This is the initial RMP submittal.\n A worst case release scenario was performed based on the release of one storage tank (38,250 gallons) of ammonia in 10 minutes. No active mitigation measures were considered and worst case meterological condiditons were assumed. The model results showed an impact of 4.9 miles down wind of the facility. Population and environmental receptors were evaluated. \nThe consequence analysis was performed for the alternate release scenario of a line break during ammonia delivery. The model results showed an impact of 183 yards down wind of the facility. This scenario takes into account mitigative equipment and measures such as excess flow valves, system check valves and compressor and vaporizer automatic shut down functions. AES Somerset has programs in place to prevent the accidental release of chemicals stored on site. These programs are detailed in the Environmental Compliance Program manual, Spill Prevention Control and Countermeasures (SPC&C) plan, spill prevention reports, specific training programs and written process, operating and safety procedures. To augment these general accidental release programs, AE"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16300,
      "SummaryText": "S Somerset has developed prevention measures specific to the transfer, storage, and handling of anhydrous ammonia. These measures include safety equipment, personnel training, process procedures, and an audit program. \nAES Somerset has engineered the design of the anhydrous ammonia facility to minimize the impact of any release. These items include a storage area water curtin, anhydrous ammonia detectors, hydrostatic relief valves, and a planned scrubber for relief valve discharge.\nThe facility has not experienced any ammonia accidents. Anhydrous ammonia is the only hazardous substance on site that is subject to Risk Management Plan (RMP) and Process Safety Management (PSM) requirements. A research facility, formerly operated by the Electric Power and Research Insititute (EPRI) , stored 1,000 gallons of anhydrous ammonia on site for approximately two years with no accidental releases.\nThere are three levels of action for any emergencies or disasters. The Safety Coordinator shall act as the lead incident commander unless he has delegated this responsibility to a qualified backup incident commander. The following is a brief discussion of the responsibilites of station personnel during the three levels of emergency action. Level 1 emergency: is an operational emergency that can be controlled by the affected area without additional assistance or endangering the remainder of the plant. Level 2 emergency: If, in the judgment of the Incident Commander, an emergency cannot be controlled by AES Somerset personel, the incident commander will initiate internal warning systems such as the radio, or plant intercom system. The incident commander will determine whether or not non-essential people are to be evacuated. When the emergency has been cleared, the Incident Commander will announce the all clear over the plant radio and intercom system. Level 3: will be put into effect by the safety coordinator/incident commander, when an emergency call is made to 911 for outside assistanc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16300,
      "SummaryText": "e. The level 3 emergency will be the result of a plant disaster, or extreme emergency.  AES Somerset has appointed Richard M. Scott as the facility coordinator. The coordinator or his designee is the site's link to emergency response resources provided by the village and county. The principal responsibilities include the following: assisting in timely notification of employees and nearby individuals in the event of an emergency. Timely reporting of emergencies to the Local Emergency Planning Committee, the New York State Department of Environmental Conservation and the National Response Center. Initial classification of an emergency to assist in determining appropriate action. Representing the facility in the event of a hazardous materials release on or near the facility. Providing follow up reports to the NYSDEC (New York State Department of Enviornmental Conservation) and LEPC (Local Emergency Planning Committee) on the incident. The initial notification shall be made via phone and if requested a narrative type report shall be issued to the appropriate regulatory agencies.\nThe following programs were developed for the RMP: Management system, process safety information, process hazard analysis, O&M manuals, training programs, management of change programs, pre start up review, incident investigation procedures, employee participation plan,hot work permits, contractor programs and, emergency response plan.\n Each aspect of the Risk Management Program will be reviewed annually in an effort to improve safety."
    }
  ]
}