{
  "FacilityID": 16312,
  "FacilityName": "The Lundy Packing Company",
  "FacilityStr1": "424 Railroad St",
  "FacilityStr2": null,
  "FacilityCity": "Clinton",
  "FacilityState": "NC",
  "FacilityZipCode": "28329",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37163",
  "LEPC": "Sampson County LEPC",
  "FacilityLatDecDegs": "34.993333",
  "FacilityLongDecDegs": "-78.31",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 928663293,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "The Lundy Packing Company",
  "OperatorStr1": "424 Railroad St",
  "OperatorStr2": null,
  "OperatorCity": "Clinton",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28329",
  "OperatorZipCodeExt": null,
  "RMPContact": "Allen Raynor",
  "RMPTitle": "Safety Director",
  "FTE": 1200,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000043188",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-08-15 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-08-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-08-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.99442,
  "FRS_Long": -78.31099,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 22645,
      "AltID": "Refrigeration System",
      "FacilityID": 16312,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 23234,
          "ProcessID": 22645,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 28966,
          "ProcessID": 22645,
          "ChemicalID": 56,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 528966,
          "ProcessID": 22645,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 22646,
      "AltID": "Boilers",
      "FacilityID": 16312,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 23235,
          "ProcessID": 22646,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 28967,
          "ProcessID": 22646,
          "ChemicalID": 98,
          "Quantity": 257000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 528967,
          "ProcessID": 22646,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 16312,
      "SummaryText": "THE ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nIn this facility, we use Anhydrous Ammonia and propane, which are considered hazardous by the EPA. These chemicals must be used to provide cooling for the process and controlling the humidity in the areas.  It is our policy to have programs in place dealing with safety precautions in handling these substances and to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as our co-workers, and to reduce the threat to nearby members of the community.  It is our policy to adhere to all applicable Federal and state rules and regulations. Safety depends upon the manner in which we handle ammonia and propane combined with the safety devices inherent in the design of this facility combined with the safe handling procedures that we use and the training of our personnel. \n\nThis facilities emergency response program is based on the IIAR's \"Risk Management Guidelines Program for Ammonia Refrigeration\" and NPGA's LP Gas Handbook, \"Guidelines for Developing Plant Emergency Response Procedures.\" The plan has been provided and reviewed with the Sampson County Local Emergency Planner Center.  Coordination with the LEPC has been made to notify them through the emergency response plan to respond to incidents that may affect the public.\n\nSTATIONARY SOURCES AND REGULATED SUBSTANCES HANDLED \n\nThe Lundy Packing Company's manufacturing facility is in the business of processing hog meats for the food industry. These products require controls for humidity and cooling of the materials during and after being processed.  There are two hazardous chemicals (Anhydrous Ammonia and propane) used at this site for these purposes.\n\nAnhydrous Ammonia is the refrigerant used for the cooling process due to the low cost of the medium and the low temperatures that must be obtained.  The ammonia is enclosed within a closed loop that removes heat from the products and storage rooms.  The ammonia is evapora"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16312,
      "SummaryText": "ted by removing heat from the products and cooling areas at low temperatures and pressures and then dispenses the heat at high pressures and temperatures to outside air.\n\nThe ammonia system at the Lundy Packing Company contains 120,000 pounds of ammonia.\n\nPropane is also used at the facility.  Propane is used in dryers to control the humidity in the processing rooms.  It is received from retailers by truck and stored in two 30,000 gallon and four 2,000 gallon tanks.  The maximum inventory of any of the tanks is controlled at 85 percent level.  \n\nThe maximum amount of propane that can be stored at this plant is 257,300 pounds.\n\nSUMMARY OF MAJOR HAZARDS\n\nConsequence of Failure to Control Hazards\n\nAmmonia\n\nHealth Hazards\n\nAmmonia is a colorless gas with extremely pungent odor.  Liquid ammonia vaporizes to a poisonous gas cloud.\n\nAmmonia is a severe irritant of the eyes.  It penetrates the eyes more readily than any other alkali.  Contact with liquid anhydrous ammonia and concentrated solutions can produce severe eye injury or blindness.  Exposure of the eyes to high gas concentrations can cause temporary blindness and severe eye damage.  Laceration or watering of the eyes can occur upon exposure to 150 ppm ammonia gas and higher.\n\nAmmonia is an irritant by inhalation.  At increasing concentrations it can cause symptoms ranging from runny nose, coughing, chest pain, trouble with breathing, and death.  It can cause severe breathing difficulties that are delayed in onset.  Inhalation of concentrations of 2,500 to 6,500 ppm causes shortness of breath, bronchospasm, chest pain, and pulmonary edema (filling of the lungs with fluid) that may be fatal.\n\nExposure of the skin to liquid anhydrous ammonia or high concentrations of the gas can cause first and second degree burns of the skin.  Vapor concentrations of 10,000 ppm are mildly irritating to moist skin, while 30,000 ppm or greater causes a stinging sensation and can produce skin burns and blisters.  These high concentrati"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16312,
      "SummaryText": "ons of ammonia are corrosive to moist skin and other moist body tissues.\n\n\nPhysical Hazards\n\nAmmonia or ammonia with oil or other debris is an explosion hazard when exposed to flame or fire.  The Lower Explosive Limit (LEL) is 16% and Upper Explosive Limit (UEL) is 25% by volume in air.  Elevated temperatures can cause containers of the substance to explode.  Ammonia emits toxic fumes when exposed to heat.  When heated to temperatures above 8500F, ammonia will emit hydrogen gas.  The auto ignition temperature is 12040F if catalyzed by iron.\n\nAmmonia can react to form potential violent or explosive reactions with halogens (e.g., chlorine, bromine).  It can react to form potential violent or explosive reactions with strong oxidizers, hypochlorite bleaches, silver compounds, mercury compounds, gold, other metals, and acids.\n\n\n\n\nCommon Exposure Control Methods\no Process enclosure\no Local exhaust ventilation\no General dilution ventilation\no Personal protective equipment\no Use of water\no Area monitoring (with alarm systems)\n\nPotential for Exposure to Ammonia\n\nThe refrigeration operation is a closed system with no purposeful exposure to ammonia.  As a closed system, exposure potentials are primarily related to equipment failure, fugitive emissions from improperly adjusted or worn valve packings, pump and compressor seals and pipe connector gaskets, or mistakes in operation of the system. \n\nPropane\n\nHealth Hazards\n\nPropane is a colorless gas with faint petroleum like odor.  It is shipped as a liquefied gas under its vapor pressure.  For transportation it may be stenched.  Contact with the liquid can cause frostbite.  It is easily ignited.  Its vapors are heavier than air and a flame can flash back to the source of leak very easily.  This leak can be either a liquid or vapor leak.  It can asphyxiate by the displacement of air.  Under fire conditions the cylinders or tank cars may violently rupture and rocket.\n\nWORST CASE - TOXIC \n\nThe worst case scenario for the Lundy Packin"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 16312,
      "SummaryText": "g Company is the release of 18,253 pounds of ammonia from the system's largest vessel, the high pressure receiver, in a 10 minute period.  The toxic endpoint was determined by using the Aloha computer model.  With a wind speed of 1.5 m/sec and a Stability Class of F in an urban topography the endpoint of the spill was determined to be 1.1 miles from the receiver.  The plant site is located in the suburb of the city of Clinton, North Carolina.  The public receptors within a radius of 1.1 miles from the plant site are schools, residents, hospital public parks and downtown office buildings with a population of 600.  A map shows the receptors within the radius of the worst case release.  In case of a major leak, passive mitigation's in place are drains that go to a collection tank for the ammonia area.\n\nWORST CASE SCENARIO - FLAMMABLE SUBSTANCE\n\nPropane is used at the Thorn Apple Valley site and falls into EPA's Program 2.  The worst case scenario for propane was calculated using a 30,000-gallon storage tank that is one of the largest tanks installed on site.  The endpoint was calculated to be 0.43 miles from a source release of 150,000 pounds.  The company policy is to limit filling the storage tanks to 85% capacity.  It was assumed that the entire contents of the storage tank were released as a vapor and 10% of the released quantity was assumed to participate in the resulting explosion.  The endpoint was determined using the \"RMP Offsite Consequence Analysis Guidance\" manual and RMP Comp computer program.  This endpoint will extend beyond the facility boundary. \n\nALTERNATE CASE SCENARIO - TOXIC\n\nAlternate case scenarios for the Lundy Packing Company was reviewed by the maintenance and operating sections.  Considerations were given to the most probable cause of a leak within the system.  The possible leak scenarios considered were:\no Transfer hose rupture\no Process piping failure\no Process vessel or pump releases from seals, drains, bleeds\no Rupture of a sightglass\no O"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 16312,
      "SummaryText": "ted until 1998.  Therefore detailed information concerning these incidents are not available.  OSHA's PSM program has been implemented and Incident Investigations have been conducted in 1998.  From these investigations, maintenance procedures and equipment inspections have been revised to provide more reliable equipment.\n\nExplanation of How Releases are Prevented\n\nHistorically, exposures to ammonia most often occur from:\no Leaking valve stem packing glands while opening or closing a valve\no Leaking at valve flanges or other piping connections\no Pressurizing any equipment with sight glasses. especially the round type\no Mistakenly venting gas through open equipment to the atmosphere\no Malfunctioning pressure relief valves\no Mechanical seal failures on compressors and pumps\n\nRELEASE PREVENTION PROGRAM AND PREVENTION STEPS\n\nLundy Packing Company complies with the EPA's Accidental Release Preventative Rule with all applicable state codes and regulations for ammonia and propane.  Management systems are in place to administer the RMP prevention programs for ammonia and propane.  The Environmental Safety and Health Manager is the responsible person for leading this program.\n\nLundy Packing Company is in compliance with OSHA's PSM rule for ammonia.  The RMP's accidental release preventative program for ammonia is covered by the elements of the PSM program.  Controls for the preventative programs are acquired by:\n\no Effective preventative maintenance programs\no Reviews for proper design\no Development of and following operating procedures\no A mechanical integrity program that includes equipment testing procedures\no Training to be aware of potential exposure situations and using exposure prevention procedures and/or protective equipment.\n\nEMERGENCY RESPONSE PLAN\n\nThis facilities emergency response program is based on the IIAR's \"Risk Management Guidelines Program for Ammonia Refrigeration\" and NPGA's LP Gas Handbook, \"Guidelines for Developing Plant Emergency Response Procedures"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 16312,
      "SummaryText": "verpressure and release through relief valves\n\nAfter discussing these and the operations of the refrigeration system, it was decided that the rupture of a high pressure receiver was the most probable cause of a leak within the system.  Calculations were made considering the leakage of high pressure ammonia liquid from the high pressure receiver sightglass.  The breakage would create a 0.5\" orifice in the sightglass.  At the system pressures, it was determined that a release rate of 391 lbs/min would be released for13 minutes if this incident occurred.  Wind speeds of 3.0 m/sec and a stability class of D were used.  The toxic endpoint was determined to be 0.47 miles by using the Aloha computer modeling program.  This was based on releasing 4,679 pounds of liquid ammonia.\n\nThe public receptors in this area would include residents and public recreational areas.  The population of this area would be 148.  There were no active or passive mitigation credits for this scenario.\n\nALTERNATE CASE SCENARIO - FLAMMABLE SUBSTANCE\n\nAn alternate case scenario for propane was calculated resulting in a rupture of a one-inch line on a 30,000-gallon storage.  This resulted in a leak of 150,000 pounds of propane in a 10-minute period.  The endpoint was calculated to be 0.26 miles from the source of release.  The endpoint was determined using the \"RMP Offsite Consequence Analysis Guidance\" manual and RMP Comp computer program.  This endpoint will extend beyond the facility boundary. \n\nTHE FIVE YEAR HISTORY\nLundy Packing Company started recording ammonia leaks in January 1997.  Since that time there have been eight leaks that resulted in over 100 pound releases.  The leaks resulted from relief valve openings, a pump shaft seal failure, a pin hole in a piping line, and a float chamber failure.  These incidents did not result in injuries, deaths or damage to properties either on site or to the community and the community was not evacuated.  Formalized incident investigations were not initia"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 16312,
      "SummaryText": ".\"  An emergency response plan is in place at Lundy Packing Company to deal with incidents and emergencies that might take place on site.  The site maintains it's own HAZMAT teams.  Training for these functions is given annually per state requirements.  Onsite drills are also scheduled as part of the emergency response plan to familiarize employees of the dangers of ammonia and propane and the proper response to alarms and evacuations. .  The plan has been provided and reviewed with the Sampson County Local Emergency Planner Center.  Coordination with the LEPC has been made to notify them through the emergency response plan to respond to incidents that may affect the public. \n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Lundy Company is putting together a training program to enhance the skills of the refrigeration operators and increase their ability to respond to emergencies. This includes refrigeration training courses, operating procedure reviews and drills."
    }
  ]
}