{
  "FacilityID": 16325,
  "FacilityName": "Ethyl Petroleum Additives, Inc.",
  "FacilityStr1": "501 Monsanto Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Sauget",
  "FacilityState": "IL",
  "FacilityZipCode": "62201",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17163",
  "LEPC": "St. Clair County LEPC",
  "FacilityLatDecDegs": "38.613889",
  "FacilityLongDecDegs": "-90.168889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": "http://www.ethyl.com",
  "FacilityEmailAddress": "Ed_Cox@Ethyl.com",
  "FacilityDUNS": 53969234,
  "ParentCompanyName": "Ethyl Corporation",
  "Company2Name": null,
  "CompanyDUNS": 3132222,
  "Company2DUNS": 0,
  "OperatorName": "Ethyl Corporation",
  "OperatorStr1": "330 South Fourth Street",
  "OperatorStr2": null,
  "OperatorCity": "Richmond",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23219",
  "OperatorZipCodeExt": null,
  "RMPContact": "Edward Cox",
  "RMPTitle": "Environmental Advisor",
  "FTE": 300,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000082929",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "163121AAB",
  "SafetyInspectionDate": "1997-09-22 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-08-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.60079,
  "FRS_Long": -90.17218,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 22662,
      "AltID": "Liquid Chlorine Storage,",
      "FacilityID": 16325,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 23251,
          "ProcessID": 22662,
          "NAICSCode": "324191",
          "_desc": {
            "NAICS_CODE": "324191",
            "NAICS_DESCRIPTION": "Petroleum Lubricating Oil and Grease Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 28990,
          "ProcessID": 22662,
          "ChemicalID": 62,
          "Quantity": 216000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 528990,
          "ProcessID": 22662,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 22663,
      "AltID": "Carbon Disulfide Storage,",
      "FacilityID": 16325,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 23252,
          "ProcessID": 22663,
          "NAICSCode": "324191",
          "_desc": {
            "NAICS_CODE": "324191",
            "NAICS_DESCRIPTION": "Petroleum Lubricating Oil and Grease Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 28991,
          "ProcessID": 22663,
          "ChemicalID": 8,
          "Quantity": 408000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 8,
            "ChemicalName": "Carbon disulfide",
            "CASNumber": "75-15-0",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 528991,
          "ProcessID": 22663,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 22664,
      "AltID": "Isobutylene Storage, Hand",
      "FacilityID": 16325,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 23253,
          "ProcessID": 22664,
          "NAICSCode": "324191",
          "_desc": {
            "NAICS_CODE": "324191",
            "NAICS_DESCRIPTION": "Petroleum Lubricating Oil and Grease Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 28992,
          "ProcessID": 22664,
          "ChemicalID": 131,
          "Quantity": 590000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 131,
            "ChemicalName": "2-Methylpropene  [1-Propene, 2-methyl-]",
            "CASNumber": "115-11-7",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 528992,
          "ProcessID": 22664,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 16325,
      "SummaryText": "\nRisk Management Plan Executive Summary for the Ethyl Facility in Sauget, Illinois\n\n\nAccidental Release Prevention and Response Policies\n\nThe Ethyl Petroleum Additives, Inc. (Ethyl) facility in Sauget, Illinois, has a long-standing \ncommitment to worker and public safety.  This commitment is demonstrated by the resources \nwe invest in accident prevention, such as training personnel and considering safety in the \ndesign, installation, operation, and maintenance of our processes.  Our policy is to implement \nreasonable controls to prevent foreseeable releases of regulated substances.  However, if a \nrelease does occur, our trained personnel will respond to, control, and contain the release.\n\n\nDescription of the Stationary Source and Regulated Substances\n\nThe Ethyl facility, located in Sauget, Illinois, operates a variety of processes to produce \nlubricant additive packages that help meet or exceed a wide range of industry and \ngovernment performance standards.  The most prominent of these include reducing exhaust \nemissions, improving fuel economy, prolonging oil-drain intervals, and extending equipment \nlife.  The facility has one regulated flammable substance (2-methylpropene, commonly \nreferred to as isobutylene) and two regulated toxic substances (chlorine and carbon disulfide).  \n\n\nHazard Assessment Results\n\nThe worst-case scenario associated with toxic substances at the facility is a catastrophic \nfailure of a 90-ton chlorine railcar, resulting in a release of 179,000 lb of chlorine gas over a \n10-minute period.  Although we have numerous controls to prevent such releases and to \nmanage their consequences, no credit for administrative controls or passive mitigation \nmeasures is taken into account in evaluating this scenario.  Because the plant is located in a \npopulated area, the toxic cloud formed by such an event would reach offsite public receptors.\n\nThe worst-case scenario associated with a release of flammable substances at the facility is a \nvapor cloud ex"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16325,
      "SummaryText": "plosion involving the full inventory of a railcar containing isobutylene.  The \nmaximum railcar inventory of 160,000 lb is assumed to be released to the atmosphere, to \ncompletely vaporize, and to ignite, resulting in a vapor cloud explosion.  The overpressure \ngenerated by the explosion would reach nearby offsite public receptors.  Although we have \nnumerous controls to prevent such releases and to manage their consequences, no credit for \npassive mitigation measures was taken into account in evaluating this scenario.\n\nThe alternative scenario for chlorine is a failure of a 2-in. diameter liquid charge line between \nthe railcar and the vaporizer.  If this scenario were to occur, automatic sensors would detect \nchlorine and shut off flow from the railcar immediately, releasing only the contents of the \nline (approximately 38 lb of chlorine) to the atmosphere.  The toxic cloud formed by such an \nevent would reach public receptors immediately adjacent to the facility boundary.\n\nThe alternative scenario for carbon disulfide is a failure of a 2-in. diameter liquid charge line \nfrom a storage tank to a reactor.  If this scenario were to occur, our operators would shut off \nthe flow from the tank within a few minutes.  For this scenario, however, we chose to \nassume that it takes 1 hour to stop the spill, so that the results from our analysis should be \nlarger than would actually be the case if this event were to occur.  The toxic cloud formed by \nsuch an event would reach nearby public receptors.\n\nThe alternative scenario for flammables is a rupture of an unloading hose from a railcar \ncontaining isobutylene.  If this scenario were to occur, our operators would shut off the flow \nfrom the railcar within a few minutes.  For this scenario, however, we chose to assume that it \ntakes 15 minutes to stop the release, so that the results from our analysis should be larger than \nwould actually be the case if this event were to occur.  The isobutylene spilled during this 15-\nminu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16325,
      "SummaryText": "te period is assumed to ignite, resulting in a pool fire.  The excessive thermal radiation \ngenerated by the pool fire would reach public receptors immediately adjacent to the facility \nboundary.\n\n\nGeneral Accidental Release Prevention Program Steps\n\nThe following is a summary of the general accident prevention program in place at the Ethyl \nfacility.  Because processes at the plant that are regulated by the EPA risk management \nprogram (RMP) rule are also subject to the Occupational Safety and Health Administration \n(OSHA) process safety management (PSM) rule, this summary addresses each of the OSHA \nPSM elements that are part of the RMP prevention program and describes the management \nsystem in place to implement the accident prevention program.\n\nEmployee Participation\n\nThe Ethyl facility encourages employees to participate in all facets of PSM and accident \nprevention.  Examples of employee participation range from updating and compiling \ntechnical documents and chemical information to participating as a member of a process \nhazard analysis (PHA) team.  Employees have access to all information created as part of the \nfacility accident prevention program. Ways in which employees can be involved in the \naccident prevention program are documented in an employee participation plan that is \nmaintained at the facility and addresses each accident prevention program element.  In \naddition, the facility has a number of initiatives under way that address process safety and \nemployee safety issues.  These initiatives include forming teams to promote both process and \npersonal safety.  The teams typically include members from various areas of the plant, \nincluding operations, maintenance, engineering, and plant management.\n\nProcess Safety Information\n\nThe Sauget, Illinois, facility keeps a variety of technical documents that are used to help \nmaintain safe operation of the processes.  These documents address chemical properties and \nassociated hazards, limits for key process"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 16325,
      "SummaryText": " parameters and specific chemical inventories, and \nequipment design basis/configuration information.  Specific departments within the facility \nare assigned responsibility for maintaining up-to-date process safety information.\n\nChemical-specific information, including exposure hazards and emergency \nresponse/exposure treatment considerations, is provided in material safety data sheets \n(MSDSs).  This information is supplemented by documents that specifically address known \ncorrosion concerns and any known hazards associated with the inadvertent mixing of \nchemicals.  The facility has documented safety-related limits for specific process parameters \n(e.g., temperature, level, composition) in the operating procedures for each process, and \nensures that the process is maintained within these limits using process controls and \nmonitoring instruments, highly trained personnel, and protective instrument systems (e.g., \nautomated shutdown systems).  \n\nThe facility also maintains numerous technical documents that provide information about the \ndesign and construction of process equipment.  This information includes materials of \nconstruction, design pressure and temperature ratings, electrical rating of equipment, etc. \nThis information, in combination with written procedures and trained personnel, provides a \nbasis for establishing inspection and maintenance activities, as well as for evaluating \nproposed process and facility changes to ensure that safety features in the process are not \ncompromised.\n\nProcess Hazard Analysis\n\nThe Ethyl facility has a comprehensive program to help ensure that hazards associated with \nthe various processes are identified and controlled.  Within this program, each process is \nsystematically examined to identify hazards and ensure that adequate controls are in place to \nmanage these hazards.\n\nPrimarily, the Ethyl facility uses the \"What-if\" analysis technique to perform these evaluations.\nThe \"What-if\" technique is recognized as one of the mo"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 16325,
      "SummaryText": "s, (3) temporary operations, (4) \nemergency shutdown, (5) normal shutdown, and (6) initial startup of a new process.  These \nprocedures can be used as a reference by experienced operators and provide a basis for \nconsistent training of new operators.  These procedures are periodically reviewed and \nannually certified as current and accurate.  By revising the procedures as necessary to reflect \nchanges made through the management of change process, the procedures are maintained \ncurrent and accurate.  \n\nIn addition, the operating procedures at the Ethyl facility provide guidance on how to respond \nto upper or lower limit exceedances for specific process or equipment parameters.  This \ninformation is readily available to operators in the process unit and for other personnel to use \nas necessary to safely perform their job tasks.\n\nTraining\n\nTo complement the written procedures for process operations, the Ethyl facility has \nimplemented a comprehensive training program for all employees involved in operating a \nprocess.  New employees receive basic training in facility operations.  After successfully\ncompleting this training, a new operator is paired with a senior operator to learn process-specific\nduties and tasks.  After operators demonstrate (e.g., through tests/skills demonstration) having\nadequate knowledge to perform the duties and tasks in a safe manner on their own, they can\nwork independently.  In addition, all operators periodically receive refresher training on the\noperating procedures to ensure that their skills and knowledge are maintained at an acceptable level.\nThis refresher training is conducted at least every 3 years.  All of this training is documented for\neach operator, including the means used to verify that the operator understood the training.\n\nContractors\n\nThe Ethyl facility uses contractors to supplement its work force.  Because some contractors \nwork on or near process equipment, the facility has procedures in place to ensure that \ncontractors "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 16325,
      "SummaryText": "st systematic and thorough hazard\nevaluation techniques.  The analyses are conducted using a team of people who have operating\nand maintenance experience as well as engineering expertise.  This team identifies and evaluates\nhazards of the process as well as accident prevention and mitigation measures, and makes\nsuggestions for additional prevention and/or mitigation measures when the team believes\nsuch measures are necessary.  \n\nThe PHA team findings are forwarded to local and corporate management for resolution.  \nImplementation of mitigation options in response to PHA findings is based on a relative risk \nranking assigned by the PHA team.  This ranking helps ensure that potential accident \nscenarios assigned the highest risk receive immediate attention.  All approved mitigation \noptions being implemented in response to PHA team findings are tracked until they are \ncomplete.  The final resolution of each finding is documented and retained.\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate \nsignificantly from the original design safety features, the Ethyl facility periodically updates \nand revalidates the hazard analysis (PHA) results.  These periodic reviews are conducted at least \nevery 5 years and will be conducted at this frequency until the process is no longer operating.\nBetween formal PHA reviews, Ethyl conducts \"Potential Problem Analyses\" (PPAs) when changes\nto the process warrent such an evaluation. This also ensures that the process controls and/or process hazards\ndo not deviate significantly from the orginal design safety features.  The results and findings from these updates\nare documented and retained.  Once again, the team findings are forwarded to management for\nconsideration, and the final resolution of the findings is documented and retained.\n\nOperating Procedures\n\nThe Ethyl facility maintains written procedures that address various modes of process \noperations, such as (1) unit startup, (2) normal operation"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 16325,
      "SummaryText": "(1) perform their work in a safe manner, (2) have the appropriate knowledge and \nskills, (3) are aware of the hazards in their workplace, (4) understand what they should do in \nthe event of an emergency, (5) understand and follow site safety rules, and (6) inform plant \npersonnel of any hazards that they find during their work.  This is accomplished by providing \ncontractors with (1) a process overview, (2) information about safety and health hazards, (3) \nemergency response plan requirements, and (4) safe work practices prior to their beginning \nwork.  In addition, the Ethyl facility evaluates contractor safety programs and performance \nduring the selection of a contractor.  Plant personnel periodically monitor contractor \nperformance to ensure that contractors are fulfilling their safety obligations.\n\nPre-startup Safety Reviews (PSSRs)\n\nThe Ethyl facility conducts a PSSR for any facility modification that requires a change in the \nprocess safety information.  The purpose of the PSSR is to ensure that safety features, \nprocedures, personnel, and the equipment are appropriately prepared for startup prior to \nplacing the equipment into service.  This review provides one additional check to make sure \nconstruction is in accordance with the design specifications and that all supporting systems \nare operationally ready.  The PSSR team uses checklists to verify all aspects of readiness.  A \nPSSR involves field verification of the construction and serves a quality assurance function \nby requiring verification that accident prevention program requirements are properly \nimplemented.\n\nMechanical Integrity\n\nThe Ethyl facility has well-established practices and procedures to maintain pressure vessels, \npiping systems, relief and vent systems, controls, pumps and compressors, and emergency \nshutdown systems in a safe operating condition.  The basic aspects of this program include: \n(1) conducting training, (2) developing written procedures, (3) performing inspections and \ntests"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 16325,
      "SummaryText": ", (4) correcting identified deficiencies, and (5) applying quality assurance measures.  In \ncombination, these activities form a system that maintains the mechanical integrity of the \nprocess equipment.\n\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and \nhealth hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) \napplicable safe work practices to help ensure that they can perform their job in a safe manner.  \nWritten procedures help ensure that work is performed in a consistent manner and provide a \nbasis for training.  Inspections and tests are performed to help ensure that equipment \nfunctions as intended and to verify that equipment is within acceptable limits (e.g., adequate \nwall thickness for pressure vessels).  If a deficiency is identified, employees will correct the \ndeficiency before placing the equipment back into service (if possible), or a management of \nchange (MOC) team will review the use of the equipment and determine what actions are \nnecessary to ensure the safe operation of the equipment.\n\nAnother integral part of the mechanical integrity program is quality assurance.  The Ethyl \nfacility incorporates quality assurance measures into equipment purchases and repairs.  This \nhelps ensure that new equipment is suitable for its intended use and that proper materials and \nspare parts are used when repairs are made.  \n\nSafe Work Practices\n\nThe Ethyl facility has long-standing safe work practices in place to help ensure worker and \nprocess safety.  Examples of these include (1) control of the entry/presence/exit of support \npersonnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment \nundergoing maintenance, (3) a procedure for safe removal of hazardous materials before \nprocess piping or equipment is opened, (4) a permit and procedure to control spark-producing \nactivities (i.e., hot work), and (5) a permit and procedure to ensure that adequate prec"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 16325,
      "SummaryText": "autions \nare in place before entry into a confined space.  These procedures (and others), along with \ntraining of affected personnel, form a system to help ensure that operations and maintenance \nactivities are performed safely.\n\nManagement of Change\n\nThe Ethyl facility has a comprehensive system to manage changes to processes.  This system \nrequires that changes to items such as process equipment, chemicals, technology (including \nprocess operating conditions), procedures, and other facility changes be properly reviewed \nand authorized before being implemented.  Changes are reviewed to (1) ensure that adequate \ncontrols are in place to manage any new hazards and (2) verify that existing controls have not \nbeen compromised by the change.  Affected chemical hazard information, process operating \nlimits, and equipment information, as well as procedures are updated to incorporate these \nchanges.  In addition, operating and maintenance personnel are provided any necessary \ntraining on the change.\n\nIncident Investigation\n\nThe Ethyl facility promptly investigates all incidents that result in, or reasonably could \nhave resulted in, a fire, explosion, or toxic gas release that caused major property damage, \nenvironmental loss, or personal injury.  The goal of each investigation is to determine the \nfacts and develop corrective actions to prevent a recurrence of the incident or a similar \nincident.  The investigation team documents its findings, develops recommendations to \nprevent a recurrence, and forwards these results to facility management for resolution.  \nCorrective actions taken in response to the investigation teams findings and \nrecommendations are tracked until they are complete.  The final resolution of each finding or \nrecommendation is documented, and the investigation results are reviewed with all \nemployees (including contractors) who could be affected by the findings.  Incident \ninvestigation reports are retained for at least 5 years so that the reports can"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 16325,
      "SummaryText": " be reviewed \nduring future PHAs and PHA revalidations.  \n\nCompliance Audits\n\nTo help ensure that the accident prevention program is functioning properly, the Ethyl facility \nperiodically conducts an audit to determine whether the procedures and practices required by \nthe accident prevention program are being implemented.  Compliance audits are conducted at \nleast every 3 years.  Both hourly and management personnel participate as audit team \nmembers.  The audit team develops findings that are forwarded to facility management for \nresolution.  Corrective actions taken in response to the audit teams findings are tracked until \nthey are complete.  The final resolution of each finding is documented, and the two most \nrecent audit reports are retained.  \n\n\nChemical-specific Prevention Steps\n\nThe processes at the Ethyl facility have hazards that must be managed to ensure continued \nsafe operation.  The accident prevention program summarized previously is applied to all \nEPA RMP-covered processes at the plant.  Collectively, these prevention program activities \nhelp prevent potential accident scenarios that could be caused by (1) equipment failures and \n(2) human errors.\n\nIn addition to the accident prevention program activities, the Ethyl facility has safety features \non many units to help (1) contain and control a release, (2) quickly detect a release, and (3) \nreduce the consequences of (mitigate) a release.  The following types of safety features are \nused in various processes:\n\nRelease detection\n- Chlorine detectors with alarms and automatic shutdown\n- Carbon disulfide detector with alarm\n- Hydrocarbon detectors with alarms and automatic shutdown\n\nRelease containment and control\n- Scrubber to neutralize chemical releases\n- Valves to permit isolation of the process (manual and/or automated)\n- Automated shutdown systems for specific process parameters (e.g., high level, high \ntemperature)\n- Vessels to permit partial removal of the process inventory in the event of a r"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 16325,
      "SummaryText": "elease \n(e.g., a dump tank)\n- Curbing or diking to contain liquid releases\n- Redundant equipment and instrumentation (e.g., uninterruptible power supply for \nprocess control system, backup firewater pump)\n- Atmospheric relief devices\n- Isobutylene water injection / displacement system\n\nRelease mitigation\n- Fire suppression and extinguishing systems \n- Deluge system for specific equipment\n- Trained emergency response personnel\n- Personal protective equipment (e.g., protective clothing, self-contained breathing \napparatus)\n- Blast-resistant buildings to help protect control systems and personnel\n\n\nFive-year Accident History\n\nThe Ethyl facility has an excellent record of accident prevention over the past 5 years.  Ethyl \nhas not experienced any accident in the past 5 years involving an RMP-regulated substance \nthat has resulted in any of the EPA-specified onsite or offsite effects.  One reason for our \nsuccess at preventing accidents is that we address every incident very carefully to determine \nways to prevent similar incidents from occurring.\n\n\nEmergency Response Program Information\n\nThe Ethyl facility maintains a written emergency response program, which is in place to \nprotect worker and public safety, as well as the environment.  The program consists of \nprocedures for responding to a release of a regulated substance, including the possibility of a \nfire or explosion if a flammable substance is accidentally released.  Specific emergency \nresponse procedures address all aspects of emergency response, including proper first aid and \nmedical treatment for exposures, evacuation plans and accounting for personnel after an \nevacuation, notification of local emergency response agencies and the public if a release \noccurs, and post-incident cleanup and decontamination requirements.  Also, the Ethyl facility \nhas procedures that address maintenance, inspection, and testing of emergency response \nequipment, as well as instructions that address the use of emergency response "
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 16325,
      "SummaryText": "equipment.  \nEmployees receive training in these procedures as necessary to perform their specific \nemergency response duties.  The emergency response program is updated when necessary \nbased on modifications made to facility processes or other plant facilities.  The emergency \nresponse program changes are administered through the MOC process, which includes \ninforming and/or training affected personnel in the changes.\n\nThe overall emergency response program for the Ethyl facility is coordinated with the St.\nClair County Local Emergency Planning Committee, local fire and police departments, and \nstate and federal agencies through the Incident Command System.  The Ethyl facility has \nround-the-clock communications capability with appropriate community officials and \nemergency response organizations (e.g., the fire department).  This provides a means of \nfacilitating quick response to an incident, as well as notifying the public of an incident if \nnecessary.  The Ethyl facility conducts periodic emergency response exercises that involve \nfacility personnel, contractors, and emergency response organizations.  The facility provides \nmonthly refresher training to emergency responders regarding their responsibilities during an \nemergency.  \n\n\nPlanned Changes to Improve Safety\n\nEthyl resolves all findings from PHAs, some of which result in modifications to the process.\nThe following types of changes are planned:\n7 Capital project papers have been prepared to upgrade many of the valves in isobutylene service.\nThe upgraded valves will help prevent isobutylene from being trapped inside the valve body and\nreduce the potential for a release when these valves are removed for maintenance.\n7 A project to improve the operation of the chlorine system's emergency scrubber is also planned.\nThis project will allow the emergency scrubber to continue to function, even in the unlikely event the\nscrubber's eductor becomes plugged with solids.\n7 Finally, several projects are being done on t"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 16325,
      "SummaryText": "he carbon disulfide system to reduce the likelihood of\na CS2 release or fire due to a process upset or equipment malfunction.\n\nEthyl has recently purchased an emergency telephone calling system that is designed to notify facility\nneighbors within a two-mile radius in the event of a chemical emergency.  The system is capable of\nnotifying Ethyl's 2800 neighbors within minutes with important information and instructions.  The system\nshould be fully functional in June of 1999.\n\nEthyl employees have also been instrumental in the recent formation of a \"volunteer\" HAZMAT team\nfor St. Clair County.  The team consists of volunteers from both the private and public sectors.\nThe mission of the volunteer HAZMAT team is to respond to chemical release emergency in the county.\nThe team is expected to be fully functional by the end of 1999.\n\nFinally, Ethyl continues to reassess its current PSM and RMP practices to look for ways to improve these\nprograms.  This ongoing effort is part of Ethyl's commitment to compliance and CMA's Responsible Care program.\n\n\n"
    }
  ]
}