{
  "FacilityID": 16491,
  "FacilityName": "Kingsburg Cogeneration Facility",
  "FacilityStr1": "11765 Mountainview",
  "FacilityStr2": null,
  "FacilityCity": "Kingsburg",
  "FacilityState": "CA",
  "FacilityZipCode": "93631",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": null,
  "FacilityLatDecDegs": "36.519694",
  "FacilityLongDecDegs": "-119.555278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "Z1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "Boliver559@aol.com",
  "FacilityDUNS": 965412935,
  "ParentCompanyName": "KES Kingsburg, L.P.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "KES Kingsburg, L.P.",
  "OperatorStr1": "100 Clinton Square, Suite 403",
  "OperatorStr2": null,
  "OperatorCity": "Syracuse",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13202",
  "OperatorZipCodeExt": null,
  "RMPContact": "Buck Oliver",
  "RMPTitle": "Facility Manager",
  "FTE": 12,
  "OtherEPAFacilityID": "CAL000073539",
  "EPAFacilityID": "100000121343",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-08-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 36.54685,
  "FRS_Long": -119.57841,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 22937,
      "AltID": "Ammonia Storage & Deliver",
      "FacilityID": 16491,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 23529,
          "ProcessID": 22937,
          "NAICSCode": "22111",
          "_desc": {
            "NAICS_CODE": "22111",
            "NAICS_DESCRIPTION": "Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 29364,
          "ProcessID": 22937,
          "ChemicalID": 56,
          "Quantity": 52020.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 529364,
          "ProcessID": 22937,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 16491,
      "SummaryText": "\nKingsburg Cogeneration Facility\nKingsburg, California\n\nExecutive Summary\n\n\nThe accidental release prevention and emergency response policies at the facility:\n\nThe Kingsburg Cogeneration Safety Program consists of two separate but related documents:  the EHS Procedures and Programs Manuals, and the Standard Operating Procedures Manual.  These manuals contain procedures for the following:\n\n* Hazard Communications Program\n* Respiratory Protection\n* Hearing Conservation\n* Use of Personal Protective Equipment\n* Safe Ammonia Handling Procedures\n\nAll personnel receive training in health and safety upon employment.  This training includes instruction in the following areas:\n\n* Safe hazardous materials handling and storage procedures\n* Use of personal protective equipment\n* Fire prevention and fire fighting procedures\n* First aid\n* Procedures and requirements for storage and handling of compressed gases\n* Procedures for use of heavy, overhead, and otherwise dangerous equipment and machinery\n* Lock Out / Tag Out procedures\n* Symptoms of acute exposure to hazardous materials\n* Heat stress\n* Accident reporting\n* Procedures to follow in the event of a natural disaster such as earthquakes, wind storms, lightning storms, etc.\n* Working with electrical equipment\n* Operation of fire fighting equipment\n\nKingsburg Cogeneration management is committed to ensuring a safe workplace.\n\n \n\nFacility description and regulated substances handled:\n\nThe KES Kingsburg, LP (Kingsburg Cogeneration Facility) is a combined cycle cogeneration plant located at 11765 Mountainview, Kingsburg, CA 93631.  The total facility covers about 1.8 acres of land and includes, in addition to the cogeneration (plant), which occupies an area of approximately 50,000 square feet (sq. ft), a sugar concentration process totaling approximately 26,000 sq. ft.  The construction of the facility began in fall 1990 on SunMaid Growers of California (SunMaid) property.  The transportation routes near the facility include Mounta"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16491,
      "SummaryText": "inview to the north, Bethel Avenue to the east, which also provides the access road and entrance to the facility, and California Route 99 immediately to the west.  The elevation of Route 99 is approximately that of the facility ground level.\nThe plant produces electrical power, and supplies steam for operation of the concentrator process as well as the thermal host's processes.  The remaining electrical power, after satisfying the facility auxiliary energy needs, is sold to Pacific Gas and Electric Company (PG&E).\nThe plant consists of the following major equipment:\n* Combustion turbine generator (CTG)\n* Heat recovery steam generator (HRSG)\n* Steam turbine generator (STG).\n\nThe plant also has the following ancillary systems and equipment that support its operation:\n* Fuel gas system\n* Condensate system\n* Feedwater system\n* Steam system\n* Demineralized water supply system\n* Cooling water systems\n* Compressed air system\n* Anhydrous ammonia storage tank and delivery system\n* Cycle chemical feed system\n\nThe plant supplies energy for cogeneration by sending steam to the concentrator process as well as supplying process steam to the thermal host.  The equipment and systems have been selected or designed specifically for the Kingsburg facility.  The plant produces a net maximum electrical output of 34.5 megawatts (MW) while supplying all necessary steam to support operation of the multiple processes.\n\nAcutely hazardous materials (AHMs) that are used at the facility include a anhydrous ammonia solution.  Approximately 12,000 gallons of anhydrous ammonia is stored the facility, for emissions control.  Routine deliveries consist of quantities averaging 20 tons of anhydrous ammonia transported to the facility when it is necessary to refill the storage tank.  The anhydrous ammonia stored on site is used for controlling concentration of oxides of nitrogen (NOx) in the combustion flue gas from the boiler unit.  This solution is volatilized into anhydrous ammonia vapor prior to in"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16491,
      "SummaryText": "jection into the boiler.  The anhydrous ammonia is consumed by the selective catalytic reduction (SCR) system to convert NOx emissions into nitrogen and water.\n\n\nWorst-case scenario and the alternate release scenario:\n\nThe air dispersion model proposed in the work plan was the Environmental Protection Agency (EPA) public domain version 1.01 of the RMP* Comp.  This model implements Section 1 of the 1990 Clean Air Act.  RMP* Comp was developed by the CAMEO Team at the Hazardous Materials Response Assessment Division, NOAA, and the Chemical Emergency Prevention and Preparedness Division of the USEPA.\nA worst case release scenario was considered for the OCA.  It is briefly described below.\n* A catastrophic failure of the storage portion of the system which would release 26.01 tons of anhydrous ammonia (CAS #: 7664-41-7) into the atmosphere.  The material is held in a storage tank in a liquefied form under saturation pressure.  With a release duration of 10 minutes, at a rate of 5,200 pounds per minute, the toxic endpoint of 0.14 mg/L, based upon ERPG-2, with an air temperature of 77F (25C) and wind speed of 6.7 miles per hour (3.0 meters per second) would reach off-site to a distance of 1.3 miles (2.1 kilometers).\nAn alternate case release scenario was also considered for the OCA.  It is briefly described below.\n* A failure of a storage tank fitting with a one (1) square inch area would release anhydrous ammonia (CAS #: 7664-41-7) into the atmosphere.  The material is held in a storage tank in a vapor form under saturation pressure.  With a release duration of 60 minutes, at a rate of 122 pounds per minute, the toxic endpoint of 0.14 mg/L, based upon ERPG-2, with an air temperature of 77F (25C) and a wind speed of 6.7 miles per hour (3.0 meters per second) would reach off-site to a distance of 0.2 miles (0.3 kilometers).\nConclusions\nBased on the OCA, the most potentially harmful release scenarios is worst case.  The likelihood of this release scenario occurring is slim "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 16491,
      "SummaryText": "to none.  The storage tank is constructed to withstand earthquakes such that a major guillotine break is highly improbable.  Padlocks are placed on the fill, vent, and drain lines such that sabotage to the unit would be difficult.  Proper emergency procedures, as outlined in Section 10 of the Emergency Response Plan would be implemented, however, in the event that this release scenario should occur.\nThe most probable release scenario, based upon facility history, would be a release due to the failure of the ammonia evaporator rupture disc due to carryover of liquid fluid.  The  carryover would cause an increase in pressure, rupturing the disc and causing the evaporator relief to lift.  \nA scenario similar to this would not result in a release off-site as the system could be shut down and repaired with parts held on site in spares inventory.\n\n\nGeneral accidental release prevention program and chemical-specific prevention steps:\n\nMention rules and regulations you comply with (PSM)\nHighlight practices that are important to prevention program:  systems, procedures, training\n\nProcess Safety Management (PSM) was promulgated on February 24, 1992 and become effective May 26, 1992.  Kingsburg Cogeneration has had in place a PSM meeting the requirements of OSHA Final Rule - 29 CFR 1910.119.  The PSM is designed to minimize the likelihood of a catastrophic release of designated hazardous materials.  The plan includes sections on:\n\n* Employee involvement\n* Process safety information\n* Process Hazard Analysis\n* Operating procedures\n* Training, both employee and contractor\n* Pre-startup safety reviews\n* Mechanical integrity\n* Hot Work Permits\n* Management of Change\n* Incident Investigation\n* Emergency Planning and Response and\n* Compliance Audits\n\nKingsburg Cogeneration also has in place approved and proven operating and maintenance procedures, including specific Job Safety Analysis procedures, in place to minimize risk to employees, off-site personnel, and the environment.\n\n\n\nFi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 16491,
      "SummaryText": "ve (5) year accident history:\n\nThe facility has not experienced a release of a reportable quantity in the history of plant installation, commissioning, an operation.\n\n\n\nEmergency Response Plan:\n\nThe Emergency Response Plan consists of elements including applicability to specific emergencies, outlining of responsibilities, and symptoms and indications of various emergencies.  It also contains immediate and supplementary actions to be taken.  These actions are identified in outline form, supplemented with precautions to be considered during the response.  Each procedure also contains an emergency call list specific to the response.  Site personnel, business neighbors, site ownership and regulators are included in the call list, as are medical contacts.  Site personnel are trained annually on all emergency response procedures, and the contact lists are reviewed on a monthly basis.\n\n\n\nPlanned changes to improve safety\n\nKingsburg Cogeneration will continue to improve safety at the facility by:\n\n* Continued training and involvement of site personnel\n* Routine review of site operating and maintenance procedures\n* Maintaining adequate supply and condition of personal protective equipment\n* Maintenance of system integrity via Management of Change\n* Periodic review of recommendations founded in the HazOp process\n* Completion of root-cause failure analysis in incident investigation\n* Performance of scheduled auditing of the Program\n10-1\n\n"
    }
  ]
}