{
  "FacilityID": 16584,
  "FacilityName": "AmeriCold Logistics Plant # 80557",
  "FacilityStr1": "280 W Hwy. 30",
  "FacilityStr2": null,
  "FacilityCity": "Burley",
  "FacilityState": "ID",
  "FacilityZipCode": "83318",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "16031",
  "LEPC": null,
  "FacilityLatDecDegs": "42.083333",
  "FacilityLongDecDegs": "-113.133333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7909161,
  "ParentCompanyName": "Vornado/Crescent RIT",
  "Company2Name": null,
  "CompanyDUNS": 7909161,
  "Company2DUNS": 0,
  "OperatorName": "AmeriCold Logistics, LLC",
  "OperatorStr1": "10 Glenlake Parkway Suite 800",
  "OperatorStr2": null,
  "OperatorCity": "Atlanta",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30328",
  "OperatorZipCodeExt": null,
  "RMPContact": "Sonny Basaldua",
  "RMPTitle": "Chief Engineer",
  "FTE": 85,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000159909",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-09-01 00:00:00",
  "SafetyInspectionBy": "fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Burley",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-08-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-08-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.08333,
  "FRS_Long": -113.13333,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 23126,
      "AltID": "nh3 system",
      "FacilityID": 16584,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 23718,
          "ProcessID": 23126,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 29560,
          "ProcessID": 23126,
          "ChemicalID": 56,
          "Quantity": 32003.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 529560,
          "ProcessID": 23126,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 16584,
      "SummaryText": "7.0  RISK MANAGEMENT PLAN AND DATA ELEMENTS\n\nThe following subsections outline the Executive Summary requirements of the EPA's 40 CFR Part 68.155.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe AmeriCold Logistics, Inc. Plant 80557 facility abides by the emergency response procedures and policies detailed in the Emergency Response Plan manual.  This Plan was designed to meet the following objectives:\n\n1.)    To save lives.\n2.)    To minimize and avoid injuries.\n3.)    To protect the environment.\n4.)    To minimize property damage.\n\nAmeriCold Logistics maintains an emergency response committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan will be reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate any facility changes. \n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n    The AmeriCold Logistics, Inc. Plant 80557 facility chills and stores a variety of food products in their cold storage warehouse.  The refrigeration process, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for cold storage rooms.  Changes in pressure are directly related to changes in temperature.  For example, lowering the ammonia pressure lowers its temperature.  Low pressure (cold) liquid ammonia provides refrigeration by removing ambient heat.  Removal of ambient heat causes the liquid ammonia (contained within the system) to vaporize.  Heat is later removed from the ammonia as it is condensed back into a liquid"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16584,
      "SummaryText": ".  Typical operating conditions range from vacuum (approximately 6\" Hg) on the low pressure side of the system to 150-160 psig on the high side.\n\n    Ammonia is used as the refrigerant in the refrigeration process.\n\n    The total ammonia inventory is 32,003 pounds.  \n\n HAZARD ASSESSMENT SUMMARY\n\nWorst Case Release Result Summary\n\n    Scenario Description: Release of the maximum quantity of ammonia that can be stored in a vessel (accounting for administrative controls) - 8040 pounds - in 10 minutes.  No passive mitigation measures were used.  The most pessimistic meteorological conditions were used: 1.5 meters/second wind speed, and F stability.  Reference Table 15 from the EPA RMP Off-Site Consequence Analysis Guidance Document was used. See Appendix A. The toxic endpoint was determined using EPA's \"RMP -Comp\" computer \n    program downloaded from their Website.\n\n\n    Distance to Toxic Endpoint: The one hour, time averaged concentration of 200 ppm (0.14 mg/L) reached 1.2  miles.\n\nAlternative Release Result Summary\n\n    Scenario Description: A 0.25 inch diameter leak of high pressure liquid ammonia for one hour.  The quantity of ammonia released in one hour at this rate is 6000 pounds.  The meteorological conditions used were 3 meters/second wind speed, and D stability.  Reference Table 5 from the EPA RMP Off-Site Consequence Analysis Guidance Document was used. See Appendix A.  The toxic endpoint was determined using EPA's \"RMP -Comp\" computer \n    program downloaded from their Website.\n\n    Distance to Toxic Endpoint: The one hour, time averaged concentration of 200 ppm (0.14 mg/L) reached  .19 miles\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe facility operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines and standards including the following:\n\n    IIAR Bulletin 107, \"Suggested Safety and Operating Procedures When Making Ammonia Refrigeration Tie-ins\"\n    IIAR Bulletin 109, \"Minimum Safety Criteria for a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16584,
      "SummaryText": " Safe Ammonia Refrigeration System\"\n    IIAR Bulletin 110, \"Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems\"\n    IIAR, \"A Guide to Good Practices for the Operation of an Ammonia Refrigeration System\"\n\nIn addition, the AmeriCold Logistics, Inc. Plant 80557 has implemented a Process Safety Management program for compliance with the OSHA 1910.119 regulation since 4-14-94.\n\n FIVE YEAR ACCIDENT HISTORY\n\nThere have been no reported releases of ammonia at this facility over the last five years 6-21-1994 through 6-21-1999.  \n\nEMERGENCY RESPONSE PROGRAM\n\nThe AmeriCold Logistics, Inc. Plant 80557 has an Emergency Response Program in place.  The facility has an Emergency Response Team that is trained to First Responder Operations Level on an annual basis.  All Emergency Response Team members are fit tested and respiratory trained annually.   \n\nDuring the RMP Development Review, it was recommended that the facility conduct annual evacuation drills to ensure all employees understand the emergency response procedures.  In addition, it was recommended that the facility contact the local Fire Department regarding participation in the evacuation drills.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nDuring the development of the Process Safety Management program at this facility, the initial Process Hazard Analysis study (Apr-94) generated mitigation measures that would improve safety at the AmeriCold Logistics, Inc. Plant 80557 facility located at 280 West Highway 30 in Burley, Idaho.  These action items are as follows:\n\nR-13  Install a reliable Ammonia detection System throughout the warehouse and test annually\nR-14  Replace all Relief Valves on a (5) Year Schedule and document results\n\nIn addition to the equipment related mitigation measures recommended to improve safety at this facility, the RMP Development Team made several procedural/managerial recommendations to improve safety.  These recommendations are a result of the review of the PSM prevention programs and the Eme"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 16584,
      "SummaryText": "rgency Response Program for preparation of the Risk Management Program and Plan. These recommendations are as follows:\n\n\nR-01  Up date Process flow diagram to reflect Management of Change\nR-02  Up date P & ID to reflect Management of Change               \nR-03  Up date Haz-Op to reflect Management of Change\nR-04  Up date Standard Operating Procedures to reflect Management of Change\nR-05  Up date Process Safety Management notebook with Training Records of all Employees and           document Refresher training annually\nR-06  Engineers need response training up to the minimum requirements of  the Emergency                  Response Guidebook and document Refresher training annually\nR-07  Up date all records on Contractor Safety to reflect Management of Change\nR-08  Up date Pre-Start Up Safety file to reflect management of Change\nR-09  No Mechanical Integrity records on file, gather all necessary data and submit all documents           into the Process Safety Management notebook\nR-10  Emergency Response Guidebook is incomplete, develop and maintain a guidebook in                   accordance with SARA title III and distribute to the proper agencies i.e. Fire                               Dept, EPA, Facility Manager, Office Personnel, and throughout the warehouse\nR-11  Train all Employees on the Emergency Response Guidebook\nR-12  Install Remote operated control switch outside of L.P.R. room\nR-15  Conduct annual Engineroom safety trip test and document results\nR-16  Conduct Compliance audits of the Process Safety Management every(3) years\nR-17  Recommend review of all Standard Operating Procedures at least annually\nR-18  Implement a Confined Space Entry program and documentation\nR-19  Implement a Lockout/Tagout program and documentation"
    }
  ]
}