{
  "FacilityID": 16688,
  "FacilityName": "The Valvoline Company",
  "FacilityStr1": "720 Vaiden Drive",
  "FacilityStr2": null,
  "FacilityCity": "Hernando",
  "FacilityState": "MS",
  "FacilityZipCode": "38632",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28033",
  "LEPC": "Desoto County LEPC",
  "FacilityLatDecDegs": "34.815833",
  "FacilityLongDecDegs": "-89.976389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "WWW.ASHLAND.COM",
  "FacilityEmailAddress": "rewilliams@ashland.com",
  "FacilityDUNS": 612138743,
  "ParentCompanyName": "Ashland, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 5003264,
  "Company2DUNS": null,
  "OperatorName": "James D. Woodrum",
  "OperatorStr1": "720 Vaiden Drive",
  "OperatorStr2": null,
  "OperatorCity": "Hernando",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "38632",
  "OperatorZipCodeExt": null,
  "FTE": 94,
  "OtherEPAFacilityID": "MSD982779547",
  "EPAFacilityID": "100000086783",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-12 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": "Starting Fluid Process",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-08-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-06 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-08-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.815294,
  "FRS_Long": -89.976969,
  "FRS_Description": null,
  "FRS_Method": "GPS CODE (PSEUDO RANGE) STANDARD POSITION (SA OFF)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 23278,
      "AltID": "STARTING FLUID MFG.",
      "FacilityID": 16688,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 29743,
          "ProcessID": 23278,
          "ChemicalID": 92,
          "Quantity": 170000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 23875,
          "ProcessID": 23278,
          "NAICSCode": "325998",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 12794,
              "Process_NAICS_ID": 23875,
              "SafetyReviewDate": "1999-04-12 00:00:00",
              "PHA_Date": "1997-11-14 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "Yes",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Human errors, sources of ignition",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Nitrogen blanket system, level instrumentation, fire safe outlet valves with fusible links",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Monitor nozzles, electrical  classification",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "tank farm daily inspections",
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "preventive maintenance management system",
              "OpProceduresReviewDate": "1998-12-21 00:00:00",
              "TrainingReviewDate": "1999-01-19 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "computer-based interactive",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Buddy system",
              "MaintenanceReviewDate": "1999-01-21 00:00:00",
              "EquipmentInspectionDate": "1999-02-18 00:00:00",
              "EquipmentTested": "Ether storage tanks",
              "ChangeMgmtDate": "1999-04-27 00:00:00",
              "ChangeMgmtReviewDate": "1999-01-27 00:00:00",
              "PreStartupReviewDate": "1999-04-29 00:00:00",
              "ComplianceAuditDate": "1999-12-14 00:00:00",
              "AuditCompletionDate": "1999-03-31 00:00:00",
              "IncidentInvestigationDate": "1999-01-18 00:00:00",
              "InvestigationChangeDate": "1999-05-31 00:00:00",
              "ParticipationPlansReviewDate": "1999-02-22 00:00:00",
              "HotWorkPermitReviewDate": "1999-02-19 00:00:00",
              "ContractorSafetyReviewDate": "1998-12-22 00:00:00",
              "ContractorSafetyEvalDate": "1998-12-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 18117,
                  "PreventionProgram3ID": 12794,
                  "ProcessChemicalID": 29743
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 23279,
      "AltID": "Product Warehouse",
      "FacilityID": 16688,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 29744,
          "ProcessID": 23279,
          "ChemicalID": 92,
          "Quantity": 18000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 23876,
          "ProcessID": 23279,
          "NAICSCode": "325998",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 16688,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-07-27 00:00:00",
    "ERTrainingDate": "1999-05-03 00:00:00",
    "CoordinatingAgencyName": "Desoto County emergency Management",
    "CoordinatingAgencyPhone": "6014291359",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "OSHA Regulation at 29 CFR 1910.119"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 23,
      "FacilityID": 16688,
      "SummaryText": "and solvent storage tanks are provided.\n\n    Perimeter security fence provides facility access control and prevents entry of unauthorized\n    personnel\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe Valvoline Pyroil plant has an excellent record of accidental release prevention over the past five (5)\nyears. There has not been any reportable release or accidents involving ethyl ether at the Pyroil plant over\nthe past 5 years. Every incident (including any near-miss) is thoroughly investigated to determine ways to\nprevent similar incidents from recurring and this is applied to all relevant processes and operations.\n\n\nPROCESS 2.  PRODUCT DISTRIBUTION CENTER (WAREHOUSE)\n\nValvoline has provided many safeguards to prevent and/or mitigate consequences of accidental releases: \n\n         automatic fire water sprinkler system\n         segregation of products containing ethyl ether to isolate highly-flammable materials\n         control of ignition sources (e.g., only EE-rated fork trucks are allowed)\n         personnel training, including fork truck driver certification program,\n         special fire detectors and alarms for life safety.\n\nThe WCS does not take credit for any of these safeguards. (Please see file VALP2WC1.jpg)\n\n\nEMERGENCY ACTION PROGRAM INFORMATION\n\nThe Valvoline Pyroil plant maintains a written emergency action program, which is in place to protect worker\nand public safety as well as the environment and meets the requirements of OSHA's standard found in 29\nCFR 1910.38(a). The program consists of procedures for responding to a release of a regulated substance,\nincluding the possibility of a fire or explosion if a flammable substance is accidentally released. The\nprocedures address all aspects of emergency response, including proper first aid and medical treatment for\nexposures, evacuation plans and accounting for personnel after an evacuation, notification of local\nemergency response agencies and the public if a release occurs, and postincident cleanup and\ndecontamination"
    },
    {
      "ESSeqNum": 24,
      "FacilityID": 16688,
      "SummaryText": "requirements. In addition, the plant has procedures that address maintenance, inspection,\nand testing of emergency response equipment, as well as instructions that address the use of emergency\nresponse equipment. Employees receive training in these procedures as necessary to perform their specific\nemergency response duties. The emergency action program is updated when necessary based on\nmodifications made to Pyroil plant processes or other Valvoline facilities. The emergency action program\nchanges are administered through the change management system, which includes informing and/or training\naffected personnel in the changes.\n\nThe overall emergency response program for the Valvoline Pyroil plant is coordinated with the Desoto\nCounty Emergency Management. This coordination includes periodic meetings of the local emergency\nplanning commission (LEPC), with local fire / emergency response officials, local government officials, and\nindustry representatives. The Valvoline Pyroil plant has around-the-clock communications capability with\nappropriate LEPC officials and emergency response organizations (e.g., fire department). This provides a\nmeans of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.\nIn addition to periodic LEPC meetings, the Valvoline Pyroil plant conducts periodic emergency drills that\ninvolve the emergency response organizations, and the Pyroil plant provides annual refresher training to\nlocal emergency responders regarding the hazards of regulated substances in the Pyroil plant."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 16688,
      "SummaryText": "RISK MANAGEMENT PLAN \nTHE VALVOLINE COMPANY      PYROIL PLANT\n                      HERNANDO, MISSISSIPPI\n\n                        EXECUTIVE SUMMARY\n\n\nThe Valvoline Company (Valvoline) has a long-standing commitment to worker and public safety and strives\nto continuously improve safety and environmental operations of its facilities. This commitment is\ndemonstrated by significant investments of resources to prevent releases of hazardous substances and for\naccident prevention, such as employee participation and training, and considering safety in the design,\ninstallation, operation, and maintenance of processes.  Valvoline policy is to implement practical controls to\nprevent foreseeable releases of hazardous substances.  However, if a releases does occur, the Hernando\nPlant has a well-defined emergency action plan and trained personnel to control and contain the release.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Valvoline Pyroil Plant, located in Hernando, Mississippi, produces a variety of car-care products.  The\nfacility consists of an outdoor tank farm and administrative and manufacturing buildings where the finished\nproducts are processed and packaged (Please see bitmap Valvplant.bmp).  These products are well known\nunder the Pyroil brand name and the manufacturing facility is ISO 9002 certified.  The plant has an excellent\nsafety and environmental record, with a high level of employee involvement and commitment to operational\nexcellence.  \n\nThe Pyroil plant has one manufacturing process (starting fluid manufacturing process) that uses a flammable\nsubstance - ethyl ether - listed in the EPA's Risk Management Program (RMP) rule.  There are no toxic or\nreactive regulated substances involved at the site.  The starting fluid manufacturing process involving ethyl\nether consists of storage, blending and packaging.  The process operations are covered by OSHA's process\nsafety management (PSM) standard and are considered Program"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16688,
      "SummaryText": "Level 3 for the RMP rule.  \n\nA product distribution center, located on adjoining property (separated by railroad tracks), warehouses  the\nfinished products, containing ethyl ether.  The warehouse is also included in this RMP as a separate process\nbecause the total quantity in small product containers (7.8 and 11 avdp oz. cans) may exceed the threshold\nquantity sometime during peak storage season.  The warehouse is considered eligible for Program Level 1\nfor the RMP rule because:\n\n     1.   There are no public receptors within a distance to an endpoint from a worst-case scenario;\n     2.   The warehouse has had no release of a regulated substance in the past five years resulting\n          in offsite exposure or consequences; and\n     3.   The warehouse emergency response activities are coordinated with the local responders. \n\n\nPROCESS 1.  STARTING FLUID MANUFACTURING PROCESS\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe following is a summary of the accidental release prevention program in place for the starting fluid\nmanufacturing process at the Hernando, MS plant.  Because the plant process regulated by the\nEnvironmental Protection Agency's (EPA's) risk management program (RMP) regulation is also subject to\nthe Occupational Safety and Health Administration's (OSHA's) process safety management (PSM) standard,\nthis summary addresses each of the OSHA PSM elements and describes the management systems in place\nto implement the accidental release prevention program.\n\nEmployee Participation\n\nThe Pyroil plant conducts its business using a teamwork approach.  A number of business and operational\nteams provide an active forum for employee participation in the implementation of PSM standard elements. \nExamples of employee involvement range from participation in the initial process hazard analysis in 1993 \nto recent development of operating procedures.  Employees have access to all information created as a part\nof the prevention program.  Specific ways that employees can be inv"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16688,
      "SummaryText": "olved in the accidental release\nprevention program are documented in an employee participation plan in the PSM Manual.  In addition,\nspecific employee participation activities include operations teams, plant staff, and business team meetings,\nand periodic safety meetings to discuss specific safety-related topics.  Meeting attendance sheets are\nmaintained as primary documentation. \n\nProcess Safety Information\n\nThe Pyroil plant develops and updates a variety of technical documents that are used to help maintain safe\noperations of the process.  These documents address chemical properties and associated hazards, limits\nfor key process parameters and specific chemical inventories, and equipment design basis and configuration\ninformation.   A table summarizing the reference documents and their locations is readily available along with\nspecific procedures for maintaining current and accurate process safety information in the PSM Manual.\n\nChemical-specific information, including exposure hazards and emergency response exposure treatment\nconsiderations, is provided in material safety data sheets (MSDSs). This information is supplemented by\ndocuments that specifically address known corrosion concerns and any known hazards associated with the\ninadvertent mixing of chemicals. The Pyroil plant has established safety-related limits for specific process\nparameters (e.g., level, composition) in process documentation. The Pyroil plant ensures that the process\nis maintained within these limits using process controls and monitoring instruments, highly-trained personnel,\nand protective instrument systems (e.g., automated shutdown).\n\nThe Pyroil plant also maintains numerous technical documents that provide information about the design and\nconstruction of process equipment. This information includes materials of construction, design pressure and\ntemperature ratings, and electrical rating of equipment. This information, in combination with written\nprocedures and trained personnel, provide"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 16688,
      "SummaryText": "s a basis for establishing inspection and maintenance activities,\nas well as for evaluating proposed process and facility changes to ensure that safety features in the process\nare not compromised.\n\nProcess Hazard Analysis (PHA)\n\nThe Valvoline Pyroil plant has a comprehensive program to help ensure that hazards associated with the\nvarious processes are identified and controlled. Within this program, each process is systematically\nexamined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\nThe Valvoline Pyroil plant primarily uses a combination of What-If, checklist and hazard and operability\n(HAZOP) analysis techniques to perform these evaluations.  The analyses are conducted using a team of\npeople who have operating and maintenance experience as well as engineering expertise. This team\nidentifies and evaluates hazards of the process as well as accidental release prevention and mitigation\nmeasures, and the team makes suggestions for additional safeguards when the team believes such\nmeasures are needed.\n\nThe PHA team findings are evaluated by local and corporate management for resolution. Implementation of\nmitigation options in response to PHA findings is based on a relative risk ranking assigned by the PHA team.\nThis ranking helps ensure that potential accident scenarios assigned the highest risk ranking receive prompt\nattention. All approved mitigation options in response to PHA team findings are tracked until they are\ncompleted. The formal resolution of each finding is documented and retained.\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from\nthe original design safety features, the plant periodically updates and revalidates the hazard analysis results.\nThese periodic reviews are conducted at least every five (5) years and will be conducted at this frequency\nuntil the process is no longer operating. The results and findings from these updates are documented and\nret"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 16688,
      "SummaryText": "ained. Once again, the team findings are forwarded to management for consideration, and the final\nresolution of the findings is documented and retained.\n\nOperating Procedures\n\nThe Pyroil plant maintains written procedures that address various modes of process operations, such as\n(1) process  startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) and\nnormal shutdown. These procedures can be used as a reference by experienced operators and provide a\nbasis for consistent training of new operators. These procedures are periodically reviewed and annually\ncertified as current and accurate. The procedures are kept current and accurate by revising them as\nnecessary to reflect changes made through the management of change process.\n\nIn addition, the Pyroil plant has established documentation requirements for logging key process parameters. \nThis documentation also provides guidance on how to respond to a deviation from upper or lower limits for\nspecific process or equipment parameters. This information, along with written operating procedures, is\nreadily available to operators in the process area and for other personnel to use as necessary to safely\nperform their tasks.\n\n\nTraining\n\nTo complement the written procedures for process operations, the Pyroil plant has implemented a\ncomprehensive training program for all employees involved in process operations. New employees receive\nbasic training in Pyroil plant operations if they are not already familiar with such operations. After\nsuccessfully completing this training, a new operator is paired with a senior operator to learn process-specific\nduties and tasks. After operators demonstrate (e.g., through skills demonstration) having adequate\nknowledge to perform the duties and tasks in a safe manner on their own, they can work independently. In\naddition, all operators periodically receive refresher training on the operating procedures to ensure that their\nskills and knowledge are maintained at an acce"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 16688,
      "SummaryText": "ptable level. This refresher training is conducted at least\nevery 3 years. All of this training is documented for each operator, including the means used to verify that\nthe operator understood the training.  For specific safety (e.g., fork truck operation) and/or regulatory (hazard\ncommunications) issues, Valvoline has developed a customized computer-based training (CBT) program that\nprovides interactive training for all employees on a routine basis.  \n\nContractors\n\nThe Pyroil plant uses contractors to supplement its work force during periods of increased maintenance or\nconstruction activities. Because some contractors work on or near process equipment, the Pyroil plant has\nprocedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have the\nappropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they\nshould do in the event of an emergency, (5) understand and follow site safety rules, and (6) inform Pyroil\nplant personnel of any hazards found during their work. This is accomplished by providing contractors with\na thorough site orientation that includes (1) a process overview, (2) information about safety and health\nhazards, (3) emergency response plan requirements, and (4) safe work practices, prior to their beginning\nwork. In addition, the Valvoline Pyroil plant evaluates contractor safety programs and performance during\nthe selection of a contractor. Pyroil plant personnel periodically monitor contractor performance to ensure\nthat contractors are fulfilling their safety obligations.\n\nPre-startup Safety Review (PSSR)\n\nThe Pyroil plant conducts a PSSR for any new facility or facility modification that requires a change in the\nprocess safety information. The purpose of the PSSR is to ensure that safety features, procedures,\npersonnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.\nThis review provides one additional check to make sure cons"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 16688,
      "SummaryText": "truction is in accordance with the design\nspecifications and that all supporting systems are operationally ready. The PSSR review team uses\nchecklists to verify all aspects of readiness. A PSSR involves field verification of the construction and serves\na quality assurance function by requiring verification that accidental release prevention program\nrequirements are properly implemented.\n\n\nMechanical Integrity\n\nThe Valvoline Pyroil plant has well-established practices and procedures to maintain pressure vessels,\npiping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown\nsystems in a safe operating condition. The basic aspects of this program include: (1) conducting training,\n(2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies,\nand (5) applying quality assurance measures. In combination, these activities form a system that maintains\nthe mechanical integrity of the process.\n\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards,\n(3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work\npractices to help ensure that they can perform their jobs in a safe manner. Written procedures help ensure\nthat work is performed in a consistent manner and they provide a basis for training. Inspections and tests\nare performed to help ensure that equipment functions as intended and to verify that equipment is within\nacceptable limits (e.g., adequate wall thickness for pressure vessels). If a deficiency is identified, employees\nwill correct the deficiency before placing the equipment back into service (if possible), or a management of\nchange team will review the use of the equipment and determine what actions are necessary to ensure the\nsafe operation of the equipment.\n\nAnother integral part of the mechanical integrity program is quality assurance. The Valvoline Pyroil plant\nincorporates quality assuran"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 16688,
      "SummaryText": "ce measures into equipment purchases and repairs. This helps ensure that new\nequipment is suitable for its intended use and that proper materials and spare parts are used when repairs\nare made.\n\nSafe Work Practices\n\nThe Pyroil plant has long-standing safe work practices in place to help ensure worker and process safety.\nExamples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout\nprocedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for\nsafe removal of hazardous substances before process piping or equipment is opened, (4) a permit and\nprocedure to control spark-producing activities (i.e., hot work), and (5) a permit and procedure to ensure that\nadequate precautions are in place before entry into a confined space. These procedures (and others), along\nwith training of affected personnel, form a system to help ensure that operations and maintenance activities\nare performed safely.\n\nManagement of Change\n\nThe Pyroil plant has a comprehensive system to manage changes to all covered processes. This system\nrequires that changes to items such as process equipment, chemicals, technology (including process\noperating conditions), procedures, and other facility changes be properly reviewed and authorized before\nbeing implemented. Changes are reviewed to (1) ensure that adequate controls are in place to manage any\nnew hazards and (2) verify that existing controls have not been compromised by the change. Affected\nchemical hazard information, process operating limits, and equipment information, as well as procedures,\nare updated to incorporate these changes. In addition, operating and maintenance personnel are provided\nany necessary training on the change.\n\nIncident Investigation\n\nThe Pyroil plant promptly investigates all incidents that resulted in, or reasonably could have resulted in, a\nfire or explosion, major property damage, environmental loss, or personal injury. The goal of each\ni"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 16688,
      "SummaryText": "nvestigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident\nor a similar incident. The investigation team documents its findings, develops recommendations to prevent\na recurrence, and forwards these results to Pyroil plant management for resolution. Corrective actions taken\nin response to the investigation team's findings and recommendations are tracked until they are resolved.\nThe final resolution of each finding or recommendation is documented, and the investigation results are\nreviewed with all employees (including contractors) who could be affected by the findings. Incident\ninvestigation reports are retained for at least five (5) years so that the reports can be reviewed during future\nPHAs and PHA revalidations.\n\nCompliance Audits\n\nTo help ensure that the accidental release prevention program is functioning properly, the Valvoline Pyroil\nplant periodically conducts an audit to determine whether the procedures and practices required by the\naccidental release prevention program are being implemented. Compliance audits are conducted at least\nevery three (3) years. Both hourly and staff personnel participate as audit team members. The audit team\ndevelops findings that are forwarded to Pyroil plant management for resolution. Corrective actions taken in\nresponse to the audit team's findings are tracked until they are resolved. The final resolution of each finding\nis documented, and the two most recent audit reports are retained.\n\n\nPROCESS-SPECIFIC SAFEGUARDS TO PREVENT ACCIDENTAL RELEASE SCENARIOS\n\nThe regulated process at the Valvoline Pyroil plant has hazards that must be managed to ensure continued\nsafe operation. The Pyroil plant has safety features to help (1) prevent occurrence of a release, (2) quickly\ndetect a release, and (3) reduce the consequences of (mitigate) a release. The following is a description of\nexisting process-specific safety features applicable to prevention of accidental releases of regulated\ns"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 16688,
      "SummaryText": "ubstance in the facility. These safeguards, combined with the general prevention program described in the\nprevious sections, collectively help prevent potential accident scenarios that could be caused by equipment\nfailures and human errors.\n\nRelease Detection / Prevention\n\n    Ethyl ether storage tank maximum allowable working pressure (MAWP) is 300 psig and this tank is\n    equipped with a spring-loaded pressure relief device set at 100 psig.  The other two smaller ethyl\n    ether blend tanks have a MAWP of 200 psig and 300 psig and their spring-loaded pressure relief\n    devices are set at 100 psig and 140 psig, respectively.  The normal operating pressure for all three\n    of these ethyl ether storage tanks is 5-8 psig, providing a significant safety margin before\n    challenging the pressure relief devices.\n\n    All storage tanks' vapor space is blanketed with nitrogen to keep oxygen out.  (The nitrogen supply\n    system has an overpressure relief device set at 12 psig).\n\n    Low oxygen level in the ether storage tanks reduces overall corrosion rates.\n\n    Ether with a stabilizer is purchased to minimize formation of hydrogen peroxide (and other ether\n    decomposition products).  Each shipment is received with a Certificate of Analysis for the stabilized\n    contents and hydrogen peroxide levels.\n\n    Ether contains an extremely low level of water, thus minimizing corrosion rate.\n\n    Ether and starting fluid storage tanks were initially inspected (e.g., wall thickness, weld inspections)\n    in 1995-96 and were reinspected in February, 1999 and recertified.  A program is in place to inspect\n    these tanks on a periodic basis.\n\n    Administrative practice is implemented to close manual valves on each tank in the event of process\n    shutdown (e.g., during weekends, or at night, when the process is shut down).\n\n    A visual inspection of the ether tank farm is carried out on a regular basis.\n\n    Containment wall protects storage tanks from external impact (e.g."
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 16688,
      "SummaryText": ", from tank trailer).\n\n    Mechanical integrity inspections include daily visual inspection of piping, pumps and associated\n    systems for leaks. \n    Safe work practices (e.g., hot work practice) include cessation of all traffic and construction activities\n    during ether tank trailer unloading; and\n\n    All flammable solvent storage tanks are equipped with level indication and high level alarm.\n\nRelease/Fire Containment / Control\n\n    Tank farm has a concrete floor and grooves cut in the floor to channel small spills to low point drain.\n\n    The tank farm area is covered by monitor nozzles to cool flammable solvent tanks (including ether\n    storage tanks) in case of external fire.\n\n    The Pyroil site is in close proximity to Hernando Fire Department with capability of foam solvent pool\n    type fire suppression system.\n\n    Dual isolation valves are provided for all ether-containing tanks.  A fire-safe valve with fusible link\n    on each tank isolates the tank contents from further release.  A manual block valve is provided\n    downstream of the firesafe valve.  The valve is normally open during process operations. \n\n    Separate containment areas for tank trailer unloading and solvent storage tanks are provided.\n\n    Perimeter security fence provides facility access control and prevents entry of unauthorized\n    personnel\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe Valvoline Pyroil plant has an excellent record of accidental release prevention over the past five (5)\nyears. There has not been any reportable release or accidents involving ethyl ether at the Pyroil plant over\nthe past 5 years. Every incident (including any near-miss) is thoroughly investigated to determine ways to\nprevent similar incidents from recurring and this is applied to all relevant processes and operations.\n\n\nPROCESS 2.  PRODUCT DISTRIBUTION CENTER (WAREHOUSE)\n\nValvoline has provided many safeguards to prevent and/or mitigate consequences of accidental releases: \n\n         automatic fire water spr"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 16688,
      "SummaryText": "inkler system\n         segregation of products containing ethyl ether to isolate highly-flammable materials\n         control of ignition sources (e.g., only EE-rated fork trucks are allowed)\n         personnel training, including fork truck driver certification program,\n         special fire detectors and alarms for life safety.\n\nThe WCS does not take credit for any of these safeguards. (Please see bitmap file VALP2WC1.BMP)\n\n\nEMERGENCY ACTION PROGRAM INFORMATION\n\nThe Valvoline Pyroil plant maintains a written emergency action program, which is in place to protect worker\nand public safety as well as the environment and meets the requirements of OSHA's standard found in 29\nCFR 1910.38(a). The program consists of procedures for responding to a release of a regulated substance,\nincluding the possibility of a fire or explosion if a flammable substance is accidentally released. The\nprocedures address all aspects of emergency response, including proper first aid and medical treatment for\nexposures, evacuation plans and accounting for personnel after an evacuation, notification of local\nemergency response agencies and the public if a release occurs, and postincident cleanup and\ndecontamination requirements. In addition, the plant has procedures that address maintenance, inspection,\nand testing of emergency response equipment, as well as instructions that address the use of emergency\nresponse equipment. Employees receive training in these procedures as necessary to perform their specific\nemergency response duties. The emergency action program is updated when necessary based on\nmodifications made to Pyroil plant processes or other Valvoline facilities. The emergency action program\nchanges are administered through the change management system, which includes informing and/or training\naffected personnel in the changes.\n\nThe overall emergency response program for the Valvoline Pyroil plant is coordinated with the Desoto\nCounty Emergency Management. This coordination includes per"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 16688,
      "SummaryText": "iodic meetings of the local emergency\nplanning commission (LEPC), with local fire / emergency response officials, local government officials, and\nindustry representatives. The Valvoline Pyroil plant has around-the-clock communications capability with\nappropriate LEPC officials and emergency response organizations (e.g., fire department). This provides a\nmeans of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.\nIn addition to periodic LEPC meetings, the Valvoline Pyroil plant conducts periodic emergency drills that\ninvolve the emergency response organizations, and the Pyroil plant provides annual refresher training to\nlocal emergency responders regarding the hazards of regulated substances in the Pyroil plant.\n                                 \n                   RISK MANAGEMENT PLAN \nTHE VALVOLINE COMPANY      PYROIL PLANT\n                      HERNANDO, MISSISSIPPI\n\n                        EXECUTIVE SUMMARY\n\n\nThe Valvoline Company (Valvoline) has a long-standing commitment to worker and public safety and strives\nto continuously improve safety and environmental operations of its facilities. This commitment is\ndemonstrated by significant investments of resources to prevent releases of hazardous substances and for\naccident prevention, such as employee participation and training, and considering safety in the design,\ninstallation, operation, and maintenance of processes.  Valvoline policy is to implement practical controls to\nprevent foreseeable releases of hazardous substances.  However, if a releases does occur, the Hernando\nPlant has a well-defined emergency action plan and trained personnel to control and contain the release.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Valvoline Pyroil Plant, located in Hernando, Mississippi, produces a variety of car-care products.  The\nfacility consists of an outdoor tank farm and administrative and manufacturing buildings where the finished\nproducts a"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 16688,
      "SummaryText": "re processed and packaged (Please see Valvplant.jpg).  These products are well known\nunder the Pyroil brand name and the manufacturing facility is ISO 9002 certified.  The plant has an excellent\nsafety and environmental record, with a high level of employee involvement and commitment to operational\nexcellence.  \n\nThe Pyroil plant has one manufacturing process (starting fluid manufacturing process) that uses a flammable\nsubstance - ethyl ether - listed in the EPA's Risk Management Program (RMP) rule.  There are no toxic or\nreactive regulated substances involved at the site.  The starting fluid manufacturing process involving ethyl\nether consists of storage, blending and packaging.  The process operations are covered by OSHA's process\nsafety management (PSM) standard and are considered Program Level 3 for the RMP rule.  \n\nA product distribution center, located on adjoining property (separated by railroad tracks), warehouses  the\nfinished products, containing ethyl ether.  The warehouse is also included in this RMP as a separate process\nbecause the total quantity in small product containers (7.8 and 11 avdp oz. cans) may exceed the threshold\nquantity sometime during peak storage season.  The warehouse is considered eligible for Program Level 1\nfor the RMP rule because:\n\n     1.   There are no public receptors within a distance to an endpoint from a worst-case scenario;\n     2.   The warehouse has had no release of a regulated substance in the past five years resulting\n          in offsite exposure or consequences; and\n     3.   The warehouse emergency response activities are coordinated with the local responders. \n\n\nPROCESS 1.  STARTING FLUID MANUFACTURING PROCESS\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe following is a summary of the accidental release prevention program in place for the starting fluid\nmanufacturing process at the Hernando, MS plant.  Because the plant process regulated by the\nEnvironmental Protection Agency's (EPA's) risk management program (RMP) r"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 16688,
      "SummaryText": "egulation is also subject to\nthe Occupational Safety and Health Administration's (OSHA's) process safety management (PSM) standard,\nthis summary addresses each of the OSHA PSM elements and describes the management systems in place\nto implement the accidental release prevention program.\n\nEmployee Participation\n\nThe Pyroil plant conducts its business using a teamwork approach.  A number of business and operational\nteams provide an active forum for employee participation in the implementation of PSM standard elements. \nExamples of employee involvement range from participation in the initial process hazard analysis in 1993 \nto recent development of operating procedures.  Employees have access to all information created as a part\nof the prevention program.  Specific ways that employees can be involved in the accidental release\nprevention program are documented in an employee participation plan in the PSM Manual.  In addition,\nspecific employee participation activities include operations teams, plant staff, and business team meetings,\nand periodic safety meetings to discuss specific safety-related topics.  Meeting attendance sheets are\nmaintained as primary documentation. \n\nProcess Safety Information\n\nThe Pyroil plant develops and updates a variety of technical documents that are used to help maintain safe\noperations of the process.  These documents address chemical properties and associated hazards, limits\nfor key process parameters and specific chemical inventories, and equipment design basis and configuration\ninformation.   A table summarizing the reference documents and their locations is readily available along with\nspecific procedures for maintaining current and accurate process safety information in the PSM Manual.\n\nChemical-specific information, including exposure hazards and emergency response exposure treatment\nconsiderations, is provided in material safety data sheets (MSDSs). This information is supplemented by\ndocuments that specifically address known corrosi"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 16688,
      "SummaryText": "on concerns and any known hazards associated with the\ninadvertent mixing of chemicals. The Pyroil plant has established safety-related limits for specific process\nparameters (e.g., level, composition) in process documentation. The Pyroil plant ensures that the process\nis maintained within these limits using process controls and monitoring instruments, highly-trained personnel,\nand protective instrument systems (e.g., automated shutdown).\n\nThe Pyroil plant also maintains numerous technical documents that provide information about the design and\nconstruction of process equipment. This information includes materials of construction, design pressure and\ntemperature ratings, and electrical rating of equipment. This information, in combination with written\nprocedures and trained personnel, provides a basis for establishing inspection and maintenance activities,\nas well as for evaluating proposed process and facility changes to ensure that safety features in the process\nare not compromised.\n\nProcess Hazard Analysis (PHA)\n\nThe Valvoline Pyroil plant has a comprehensive program to help ensure that hazards associated with the\nvarious processes are identified and controlled. Within this program, each process is systematically\nexamined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\nThe Valvoline Pyroil plant primarily uses a combination of What-If, checklist and hazard and operability\n(HAZOP) analysis techniques to perform these evaluations.  The analyses are conducted using a team of\npeople who have operating and maintenance experience as well as engineering expertise. This team\nidentifies and evaluates hazards of the process as well as accidental release prevention and mitigation\nmeasures, and the team makes suggestions for additional safeguards when the team believes such\nmeasures are needed.\n\nThe PHA team findings are evaluated by local and corporate management for resolution. Implementation of\nmitigation options in response to"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 16688,
      "SummaryText": "PHA findings is based on a relative risk ranking assigned by the PHA team.\nThis ranking helps ensure that potential accident scenarios assigned the highest risk ranking receive prompt\nattention. All approved mitigation options in response to PHA team findings are tracked until they are\ncompleted. The formal resolution of each finding is documented and retained.\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from\nthe original design safety features, the plant periodically updates and revalidates the hazard analysis results.\nThese periodic reviews are conducted at least every five (5) years and will be conducted at this frequency\nuntil the process is no longer operating. The results and findings from these updates are documented and\nretained. Once again, the team findings are forwarded to management for consideration, and the final\nresolution of the findings is documented and retained.\n\nOperating Procedures\n\nThe Pyroil plant maintains written procedures that address various modes of process operations, such as\n(1) process  startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) and\nnormal shutdown. These procedures can be used as a reference by experienced operators and provide a\nbasis for consistent training of new operators. These procedures are periodically reviewed and annually\ncertified as current and accurate. The procedures are kept current and accurate by revising them as\nnecessary to reflect changes made through the management of change process.\n\nIn addition, the Pyroil plant has established documentation requirements for logging key process parameters. \nThis documentation also provides guidance on how to respond to a deviation from upper or lower limits for\nspecific process or equipment parameters. This information, along with written operating procedures, is\nreadily available to operators in the process area and for other personnel to use as necessary to safely\nperform t"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 16688,
      "SummaryText": "heir tasks.\n\n\nTraining\n\nTo complement the written procedures for process operations, the Pyroil plant has implemented a\ncomprehensive training program for all employees involved in process operations. New employees receive\nbasic training in Pyroil plant operations if they are not already familiar with such operations. After\nsuccessfully completing this training, a new operator is paired with a senior operator to learn process-specific\nduties and tasks. After operators demonstrate (e.g., through skills demonstration) having adequate\nknowledge to perform the duties and tasks in a safe manner on their own, they can work independently. In\naddition, all operators periodically receive refresher training on the operating procedures to ensure that their\nskills and knowledge are maintained at an acceptable level. This refresher training is conducted at least\nevery 3 years. All of this training is documented for each operator, including the means used to verify that\nthe operator understood the training.  For specific safety (e.g., fork truck operation) and/or regulatory (hazard\ncommunications) issues, Valvoline has developed a customized computer-based training (CBT) program that\nprovides interactive training for all employees on a routine basis.  \n\nContractors\n\nThe Pyroil plant uses contractors to supplement its work force during periods of increased maintenance or\nconstruction activities. Because some contractors work on or near process equipment, the Pyroil plant has\nprocedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have the\nappropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they\nshould do in the event of an emergency, (5) understand and follow site safety rules, and (6) inform Pyroil\nplant personnel of any hazards found during their work. This is accomplished by providing contractors with\na thorough site orientation that includes (1) a process overview, (2) information about safe"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 16688,
      "SummaryText": "ty and health\nhazards, (3) emergency response plan requirements, and (4) safe work practices, prior to their beginning\nwork. In addition, the Valvoline Pyroil plant evaluates contractor safety programs and performance during\nthe selection of a contractor. Pyroil plant personnel periodically monitor contractor performance to ensure\nthat contractors are fulfilling their safety obligations.\n\nPre-startup Safety Review (PSSR)\n\nThe Pyroil plant conducts a PSSR for any new facility or facility modification that requires a change in the\nprocess safety information. The purpose of the PSSR is to ensure that safety features, procedures,\npersonnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.\nThis review provides one additional check to make sure construction is in accordance with the design\nspecifications and that all supporting systems are operationally ready. The PSSR review team uses\nchecklists to verify all aspects of readiness. A PSSR involves field verification of the construction and serves\na quality assurance function by requiring verification that accidental release prevention program\nrequirements are properly implemented.\n\n\nMechanical Integrity\n\nThe Valvoline Pyroil plant has well-established practices and procedures to maintain pressure vessels,\npiping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown\nsystems in a safe operating condition. The basic aspects of this program include: (1) conducting training,\n(2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies,\nand (5) applying quality assurance measures. In combination, these activities form a system that maintains\nthe mechanical integrity of the process.\n\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards,\n(3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work\npractices to"
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 16688,
      "SummaryText": "help ensure that they can perform their jobs in a safe manner. Written procedures help ensure\nthat work is performed in a consistent manner and they provide a basis for training. Inspections and tests\nare performed to help ensure that equipment functions as intended and to verify that equipment is within\nacceptable limits (e.g., adequate wall thickness for pressure vessels). If a deficiency is identified, employees\nwill correct the deficiency before placing the equipment back into service (if possible), or a management of\nchange team will review the use of the equipment and determine what actions are necessary to ensure the\nsafe operation of the equipment.\n\nAnother integral part of the mechanical integrity program is quality assurance. The Valvoline Pyroil plant\nincorporates quality assurance measures into equipment purchases and repairs. This helps ensure that new\nequipment is suitable for its intended use and that proper materials and spare parts are used when repairs\nare made.\n\nSafe Work Practices\n\nThe Pyroil plant has long-standing safe work practices in place to help ensure worker and process safety.\nExamples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout\nprocedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for\nsafe removal of hazardous substances before process piping or equipment is opened, (4) a permit and\nprocedure to control spark-producing activities (i.e., hot work), and (5) a permit and procedure to ensure that\nadequate precautions are in place before entry into a confined space. These procedures (and others), along\nwith training of affected personnel, form a system to help ensure that operations and maintenance activities\nare performed safely.\n\nManagement of Change\n\nThe Pyroil plant has a comprehensive system to manage changes to all covered processes. This system\nrequires that changes to items such as process equipment, chemicals, technology (includin"
    },
    {
      "ESSeqNum": 20,
      "FacilityID": 16688,
      "SummaryText": "g process\noperating conditions), procedures, and other facility changes be properly reviewed and authorized before\nbeing implemented. Changes are reviewed to (1) ensure that adequate controls are in place to manage any\nnew hazards and (2) verify that existing controls have not been compromised by the change. Affected\nchemical hazard information, process operating limits, and equipment information, as well as procedures,\nare updated to incorporate these changes. In addition, operating and maintenance personnel are provided\nany necessary training on the change.\n\nIncident Investigation\n\nThe Pyroil plant promptly investigates all incidents that resulted in, or reasonably could have resulted in, a\nfire or explosion, major property damage, environmental loss, or personal injury. The goal of each\ninvestigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident\nor a similar incident. The investigation team documents its findings, develops recommendations to prevent\na recurrence, and forwards these results to Pyroil plant management for resolution. Corrective actions taken\nin response to the investigation team's findings and recommendations are tracked until they are resolved.\nThe final resolution of each finding or recommendation is documented, and the investigation results are\nreviewed with all employees (including contractors) who could be affected by the findings. Incident\ninvestigation reports are retained for at least five (5) years so that the reports can be reviewed during future\nPHAs and PHA revalidations.\n\nCompliance Audits\n\nTo help ensure that the accidental release prevention program is functioning properly, the Valvoline Pyroil\nplant periodically conducts an audit to determine whether the procedures and practices required by the\naccidental release prevention program are being implemented. Compliance audits are conducted at least\nevery three (3) years. Both hourly and staff personnel participate as audit team members."
    },
    {
      "ESSeqNum": 21,
      "FacilityID": 16688,
      "SummaryText": "The audit team\ndevelops findings that are forwarded to Pyroil plant management for resolution. Corrective actions taken in\nresponse to the audit team's findings are tracked until they are resolved. The final resolution of each finding\nis documented, and the two most recent audit reports are retained.\n\n\nPROCESS-SPECIFIC SAFEGUARDS TO PREVENT ACCIDENTAL RELEASE SCENARIOS\n\nThe regulated process at the Valvoline Pyroil plant has hazards that must be managed to ensure continued\nsafe operation. The Pyroil plant has safety features to help (1) prevent occurrence of a release, (2) quickly\ndetect a release, and (3) reduce the consequences of (mitigate) a release. The following is a description of\nexisting process-specific safety features applicable to prevention of accidental releases of regulated\nsubstance in the facility. These safeguards, combined with the general prevention program described in the\nprevious sections, collectively help prevent potential accident scenarios that could be caused by equipment\nfailures and human errors.\n\nRelease Detection / Prevention\n\n    Ethyl ether storage tank maximum allowable working pressure (MAWP) is 300 psig and this tank is\n    equipped with a spring-loaded pressure relief device set at 100 psig.  The other two smaller ethyl\n    ether blend tanks have a MAWP of 200 psig and 300 psig and their spring-loaded pressure relief\n    devices are set at 100 psig and 140 psig, respectively.  The normal operating pressure for all three\n    of these ethyl ether storage tanks is 5-8 psig, providing a significant safety margin before\n    challenging the pressure relief devices.\n\n    All storage tanks' vapor space is blanketed with nitrogen to keep oxygen out.  (The nitrogen supply\n    system has an overpressure relief device set at 12 psig).\n\n    Low oxygen level in the ether storage tanks reduces overall corrosion rates.\n\n    Ether with a stabilizer is purchased to minimize formation of hydrogen peroxide (and other ether\n    decomposition produc"
    },
    {
      "ESSeqNum": 22,
      "FacilityID": 16688,
      "SummaryText": "ts).  Each shipment is received with a Certificate of Analysis for the stabilized\n    contents and hydrogen peroxide levels.\n\n    Ether contains an extremely low level of water, thus minimizing corrosion rate.\n\n    Ether and starting fluid storage tanks were initially inspected (e.g., wall thickness, weld inspections)\n    in 1995-96 and were reinspected in February, 1999 and recertified.  A program is in place to inspect\n    these tanks on a periodic basis.\n\n    Administrative practice is implemented to close manual valves on each tank in the event of process\n    shutdown (e.g., during weekends, or at night, when the process is shut down).\n\n    A visual inspection of the ether tank farm is carried out on a regular basis.\n\n    Containment wall protects storage tanks from external impact (e.g., from tank trailer).\n\n    Mechanical integrity inspections include daily visual inspection of piping, pumps and associated\n    systems for leaks. \n    Safe work practices (e.g., hot work practice) include cessation of all traffic and construction activities\n    during ether tank trailer unloading; and\n\n    All flammable solvent storage tanks are equipped with level indication and high level alarm.\n\nRelease/Fire Containment / Control\n\n    Tank farm has a concrete floor and grooves cut in the floor to channel small spills to low point drain.\n\n    The tank farm area is covered by monitor nozzles to cool flammable solvent tanks (including ether\n    storage tanks) in case of external fire.\n\n    The Pyroil site is in close proximity to Hernando Fire Department with capability of foam solvent pool\n    type fire suppression system.\n\n    Dual isolation valves are provided for all ether-containing tanks.  A fire-safe valve with fusible link\n    on each tank isolates the tank contents from further release.  A manual block valve is provided\n    downstream of the firesafe valve.  The valve is normally open during process operations. \n\n    Separate containment areas for tank trailer unloading"
    }
  ]
}