{
  "FacilityID": 16684,
  "FacilityName": "Roquette America, Inc. Keokuk PLant",
  "FacilityStr1": "1003 S. 5th. Street",
  "FacilityStr2": null,
  "FacilityCity": "Keokuk",
  "FacilityState": "IA",
  "FacilityZipCode": "52632",
  "Facility4DigitZipExt": "6647",
  "FacilityCountyFIPS": "19111",
  "LEPC": "Lee County LEPC",
  "FacilityLatDecDegs": "40.388972",
  "FacilityLongDecDegs": "-91.394333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 627984446,
  "ParentCompanyName": "Roquette America, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Roquette America, Inc.",
  "OperatorStr1": "1003 S. 5th. Street",
  "OperatorStr2": null,
  "OperatorCity": "Keokuk",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52632",
  "OperatorZipCodeExt": "6647",
  "FTE": 363,
  "OtherEPAFacilityID": "52632THHBNONEPR",
  "EPAFacilityID": "100000130823",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "Not Issued",
  "SafetyInspectionDate": "1992-06-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-08-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.3883,
  "FRS_Long": -91.3953,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 23274,
      "AltID": "Anhydrous Ammonia Storage",
      "FacilityID": 16684,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 29739,
          "ProcessID": 23274,
          "ChemicalID": 56,
          "Quantity": 55000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 23871,
          "ProcessID": 23274,
          "NAICSCode": "311221",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 12791,
              "Process_NAICS_ID": 23871,
              "SafetyReviewDate": "1999-05-20 00:00:00",
              "PHA_Date": "1995-12-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "Yes",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1996-02-09 00:00:00",
              "TrainingReviewDate": "1996-02-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1996-10-14 00:00:00",
              "EquipmentInspectionDate": "1997-04-21 00:00:00",
              "EquipmentTested": "Valves and flanges",
              "ChangeMgmtDate": "1996-02-09 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-20 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1996-02-09 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-20 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-20 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-20 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 18114,
                  "PreventionProgram3ID": 12791,
                  "ProcessChemicalID": 29739
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 16684,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-14 00:00:00",
    "ERTrainingDate": "1999-02-26 00:00:00",
    "CoordinatingAgencyName": "Lee County Emergency Response",
    "CoordinatingAgencyPhone": "3193724124",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 16684,
      "SummaryText": "RMP Executive Summary\n\nIntroduction\nThe purpose of the EPA Risk Management Program (RMP) rule (40 CFR 68) is to prevent and reduce the severity of impacts from releases of toxic and flammable substances to the air.  EPA and Roquette feel that with this information, the Keokuk Community will better understand local risks and improve community emergency notification and response.  This document summarizes the work done by Roquette to satisfy the requirements of the RMP rule.\n\nRoquette is required to comply with the RMP rule because of the presence of ammonia above the threshold quantity.  The largest single vessel contains 51,000 lbs. and is equivalent to about 8 farmer-sized tanks of ammonia.  We have safely used ammonia for over 20 years.  At this time, Roquette has stopped using liquid sulfur dioxide.  \n\nRoquette also uses hydrogen.  Praxair, Inc. owns, operates, and maintains a hydrogen storage facility on Roquette property.  Elements of this Executive Summary also deal with hydrogen.  For full details, the reader is referred to the Praxair RMP.\nCompliance with the RMP Rule\nRoquette has undertaken substantial effort to comply with the RMP rule.  First, we completed all of our Process Hazard Analyses (PHA's), Prevention Programs, and Emergency Response Planning under OSHA's Process Safety Management (PSM) rule several years ago.  These elements are the basis for the RMP.  The RMP focus is on off-site impacts. The PSM focus is on worker safety.  To ensure compliance with the RMP rule, Roquette hired a consultant to review these elements and to perform accidental release modeling to assess any off-site impacts.  \n \nThe PSM related information must be reviewed every 3 years.  Therefore, Roquette had the consultant review the PSM documents.  During the reviews, we were unable to document that some of the work had been completed to our satisfaction.  We are updating the Prevention Program on an expedited basis.  The RMP will be revised to reflect this new Prevention Pro"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16684,
      "SummaryText": "gram work and will be completed by the end of June. \n\nBoth Safety Managers for Roquette have recently left our employment. The original Prevention Program work required follow through by this department.  It took six months to find and hire qualified individuals to fill the Safety Department openings. The Safety Department was short staffed.  However, as of June, two new safety professionals have been hired.  The newly revamped Safety Department will assure that this work is complete.\n\nRoquette also complies with several related government regulations such as:\n\n* Emergency Planning and Notification (40 CFR 355)\n* Hazardous Chemical Reporting & Community Right-to-Know (40 CFR 370)\n* Toxic Chemical Release Reporting (40 CFR 372)\n* Process Safety Management of Highly Hazardous Chemicals (29 CFR 1910.119)\n* OSHA Emergency Action Plan (29 CFR 1910.38), and\n* OSHA Hazard Communication Standard (29 CFR 1910.1200).\n\nRoquette's Accidental Release Prevention and Emergency Response Policies\nFacility Approach\nThe Roquette accidental release prevention policy involves an approach that integrates technologies, procedures, and management practices to reduce risk.  Roquette adheres to all applicable procedures of the EPA Prevention Program.  The Roquette emergency response policy is to prepare response plans tailored to the emergency response services available in the community and comply with the EPA Emergency Response Program requirements.\nCorporate Environmental Policy\nIt is the policy of Roquette America to comply with all environmental laws and regulations; to be a responsible corporate citizen and neighbor; and to protect human health, the community, and environment from the adverse impacts of our activities.  \n\nWe will implement this policy by: \n\n* Following our Environmental Discharge Notification Procedure;\n* Encouraging employees to identify environmental issues and improvement opportunities;\n* Properly operating and maintaining pollutant emitting processes;\n* Reducing en"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16684,
      "SummaryText": "ergy and raw material usage whenever possible;\n* Seeking reductions in the amount of wastes generated, and responsibly managing the remaining wastes; \n* Preventing unplanned chemical releases; \n* Seeking suppliers and vendors who share our environmental commitment; and \n* Evaluating the environmental impacts of new projects to ensure compliance with this policy.\n\nRoquette America is committed to continually improving environmental performance, and to pollution prevention. We will periodically set and review our environmental objectives and targets.  \n\nEnvironmental performance is the responsibility of every employee, and an important measure of employee performance.  This policy will be communicated to all employees and made available to the public. All employees are expected to follow the environmental policy. \nFacility Description\nProcesses\nThe Keokuk Plant performs corn wet-milling (SIC code 2046) to produce many everyday food and industrial ingredients from corn.  Local corn is purchased, cleaned and stored prior to use. We add the corn to water containing dissolved sulfur dioxide to soften the kernel and prepare it for grinding and separation.  After separation, the various fractions (germ, fiber, gluten, and starch) are further processed and/or dried.  Various chemicals and enzymes are used in the processes that convert the starch into the finished products.  The advanced processes are performed in state-of-the-art facilities under computer control. \nRaw Materials\nThe other raw materials Roquette uses include (but are not limited to) ammonia, hydrochloric acid, caustic, sodium hydroxide, lime, activated carbon, diatomaceous earth, hydrogen, nitrogen, nickel, magnesium bisulfite, sodium bisulfite, sodium hypochlorite, and sulfuric acid.  While these chemicals have special handling precautions, only ammonia and hydrogen are dangerous enough and present in large enough quantities to be covered by the RMP rule.\nProducts\nRoquette uses these raw materials to produce"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 16684,
      "SummaryText": "many products we encounter every day.  Our products are used to make baked goods, soft drinks, candy, gum, mints, toothpaste, mouthwash, paper and cardboard, pharmaceutical products, surgical gloves, corn oil, and animal feed.  Our products are found wherever the label mentions cornstarch, corn syrup, fructose, dextrose, maltodextrins, sorbitol, maltitol, and corn oil.\nAccidental Release Scenarios\nProfile of Ammonia\nAmmonia is a clear gas that is important to human and animal life.  At -28xF or under pressure, ammonia becomes a liquid.  It is both manufactured and found in nature, however, the amount of ammonia occurring in nature far exceeds that which is manufactured.  Ammonia is found in water, soil, and air and is a source of much-needed nitrogen for plants and animals.  \n\nOver 80 percent of man-made ammonia is used as fertilizer.  Ammonia is used to manufacture synthetic fiber and plastics (10 percent) and explosives (5 percent).  The small proportion of commercially produced ammonia not incorporated into fertilizers is used as a refrigerant, a corrosion inhibitor, in the purification of water supplies, and as a component of household cleaners.  Ammonia provides a safe and reliable system of refrigeration and has been used for this purpose for more than 100 years.  \n\nAmmonia does not last long in the environment.  In soil or water, plants and microorganisms rapidly take up ammonia.  As a fertilizer, the amount of ammonia in the soil decreases to low levels in a few days.  In the air, ammonia will last about one week.  Ammonia exists naturally in the air at levels between 1 and 5 parts per billion (ppb).  The ammonia levels in rivers and bays are usually less than 6 parts per million (ppm).\n\nAmmonia has a very strong odor that most people can smell in the air at a level higher than 50 ppm.  Therefore, most people will smell ammonia in the air before it can harm them.  Above 35 ppm, most people can taste ammonia in water.  A Food and Drug Administration (FDA) re"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 16684,
      "SummaryText": "port indicates that levels of 50 ppm in the air for less than 1 day may cause slight eye and throat irritation and the urge to cough.  At 500 ppm for 30 minutes, ammonia inhalation may result in increased air intake and a sore nose and throat.  Levels of 1,700 to 2,500 ppm results in coughing, bronchospasm and chest pain along with severe eye irritation and tearing.  Levels above 5,000 ppm are potentially fatal. \n\nLarge amounts of ammonia are released into the atmosphere worldwide by domesticated farm animals.  The application of fertilizer to the soil is a well-documented source of ammonia released into the atmosphere; however, biological activity of the soil itself is believed to be the primary global source of atmospheric ammonia.  Ammonia can be released into the atmosphere through venting of gases during its production and from leaks in pipelines, transport vehicles and storage tanks.\n\nAlthough not a major source of ammonia in the atmosphere, releases from industrial tanks and pipelines are problematic because they may be concentrated and may occur in populated areas.  However, with proper safety precautions, ammonia can be safely handled in manufacturing and other industrial uses.\nRelease Modeling Discussion\nNumerous release models and EPA guidance documents can be used to model the impact of accidental releases.  These models do not take terrain (topography) into consideration, may make other assumptions for simplification, and generally overestimate the downwind impact from releases.  The terrain height along the northern edge of the Roquette Plant should mitigate some of the exposure from a release, but this has not been taken into consideration in our analysis of potential off-site impacts.\n\nThe off-site consequence analysis includes two release scenarios, identified as worst case release and alternative scenario.  The worst case release is defined by EPA, which states that the maximum quantity in the largest vessel is released as a gas over ten minute"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 16684,
      "SummaryText": "s.  The alternative scenario is defined as more likely to occur than the worst-case release scenario, should such an incident ever occur.  \n\nAtmospheric dispersion modeling has to be performed to determine the distance traveled by the ammonia release before its concentration decreases to the toxic endpoint selected by EPA of 200 ppm, which is the Emergency Response Planning Guideline Level 2 (ERPG-2).  This is defined by the American Industrial Hygiene Association as the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms that could impair an individual's ability to take protective action.   \n\nNot everyone within the distance to the toxic endpoint will be affected.  Released chemicals usually move in the direction of the wind.  Only people in a small fraction of the circle extending out to the toxic endpoint would be exposed if a release occurred.  Whether someone is hurt depends on many factors such as:\n\n* Wind speed and direction\n* Ambient temperature and humidity\n* Age and health\n* Air tightness of the home, and\n* Release quantity and duration.\nWorst-case Scenario\nEPA requires that the worst-case scenario incorporate certain parameters related to the chemical released, conditions of the release, atmospheric conditions, and toxic or flammable endpoints.  Facilities use these parameters to estimate the distance away from the location of a release beyond which no serious, acute effects are anticipated.\nAmmonia\nThe ammonia storage tanks can contain 51,000 pounds of anhydrous ammonia when filled to its 87% maximum capacity limit.  The worst-case scenario involves a complete failure of a full tank under the worst possible atmospheric conditions.  Roquette also assumed rural topography as an extra measure of conservativeness.  Using urban terrain will reduce the distance to the toxic endpoint by approxima"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 16684,
      "SummaryText": "tely 45%.\n\nAtmospheric dispersion modeling using EPA approved software (DEGADIS) using the EPA assumptions for the worst-case release resulted in a distance to the toxic endpoint of 2.3 miles.  The estimated residential population potentially affected is estimated to be 6,411.  For comparison, the distance to the toxic endpoint for a farmer's tank using the EPA program RMP COMP is 1.4 miles.\nHydrogen\nThe 22,000-gallon Praxair hydrogen tank holds 13,000 pounds of liquid hydrogen. The worst-case scenario is an instantaneous tank failure, immediate vaporization of the hydrogen, which reaches an ignition source and explodes.  The distance to the flammable endpoint using the EPA program RMP COMP is 0.26 miles. The estimated residential population potentially affected is estimated to be 168.  \nAlternate Release Scenario\nThe EPA also requires that facilities use certain parameters for predicting the impact (endpoint) distance as part of the alternate release scenario.\nAmmonia\nThe alternate release scenario selected involves rupture of the 2-inch liquid supply line at the start of truck unloading.  The truck driver is overcome by ammonia, and the release continues for 45 minutes before the leak is discovered and stopped.  The tank truck contains 5,000 gallons, which is released at a constant rate for 45 minutes.  At the same time, the storage tank (holding a maximum of 5,400 gallons) also discharges its contents through the ruptured line.  The overall release amount is 54,000 pounds over 45 minutes.\n\nAs the release is horizontal, the EPA approved dispersion modeling software (SLAB) using EPA required atmospheric conditions resulted in a distance to the toxic endpoint of 0.68 miles. The estimated residential population potentially affected is estimated to be 2,416.       \nHydrogen\nThe alternate release scenario is a rupture of the tank truck unloading line discharging the entire contents of the truck over a 40-minute period.  The resulting vapor cloud explodes.  The distance"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 16684,
      "SummaryText": "to the flammable endpoint using the EPA program RMP COMP is 0.2 miles. The estimated residential population potentially affected is estimated to be 65.  \nRoquette's Accidental Release Prevention Program\nRoquette's general accidental release prevention program is based on the following key elements:\n\n* High level of training of operators\n* Preventive maintenance program\n* Use of state-of-the-art process and safety equipment\n* Use of accurate and effective operating procedures, written with the participation of the operators\n* Performance of a hazard review of the equipment and procedures\n* Implementation of an auditing and inspection program.\nPrevention Practices\nFacility Design\nIt is Roquette's policy that accident prevention be the number one priority in facility design and improvements.  The ammonia system was designed and built in conformance with all applicable industrial standards and regulations including: \n\n* The National Fire Protection Association (NFPA)\n* The American National Standards Institute (ANSI)\n* The Compressed Gas Association (CGA) Pamphlet G-2\n* The American Society of Mechanical Engineers (ASME)\n* The American Society for Testing Materials (ASTM)\n* The Occupational Health and Safety Administration (OSHA) 29 CFR 1910, and\n* The National Electric Code.\n\nWith this in mind, the following safety devices are present in the ammonia system:\n\n* Double relief valves\n* Isolation valves\n* Check valves\n* Automatic and manual shutoffs\n* Alarms\n* Keyed bypass\n* Grounding equipment, and\n* Excess flow device.\n\nFacility Operation\nRoquette's ammonia system operating procedures have been developed to reduce the possibility of an accidental release.  This procedure incorporates: \n\n* Daily tank level and system safety inspections performed by the operator  \n* Tank truck offloading restrictions requiring the operator to initiate the unloading process\n* Verification that the tank is empty enough to prevent overfilling during product delivery\n* A preventive maintenanc"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 16684,
      "SummaryText": "e program that checks the operation of all safety devices, and\n* A high level of operator training. \nFive-year Accident History\nThere have been no reportable accidental releases of ammonia at the Roquette Plant in the last five years.  Four years ago, we had a small release of sulfur dioxide.  There were no injuries or off-site impacts.  This release would not be reportable today due to changes in the reporting threshold.\nRoquette's Emergency Response Program\nIf a Release Occurs...\nIf a major ammonia leak/release occurs, Roquette has a comprehensive emergency response plan in place.  A series of coordinated events to manage the situation will take place.\n\n1. All nonessential personnel leave the plant, emergency controls are activated, and plant workers with specialized emergency response training are mobilized. Local officials are immediately notified and requested to assist if necessary.\n2. Our Plant HAZMAT Team is trained and available 24 hours per day to respond.  They are our first line of response in the event of an ammonia release.\n3. A Roquette representative will contact the Fire Department if we need to activate the Community Notification Plan.\n4. The Community Notification Plan is activated if the ammonia release could affect the surrounding neighborhood.  We prepared this plan with input from our local fire, police, and medical officials.\n5. If the release expands into the surrounding community, a Shelter-in-Place Plan will go into effect.  When ammonia is in the atmosphere, the safest place is indoors with the windows and doors shut.\nCoordination with Local Emergency Responders\nRoquette has an emergency response program that has been coordinated with the City of Keokuk Fire Department (a member of the Local Emergency Planning Committee or LEPC), the Police Department, the hospital, and the LEPC.  This program includes an emergency response decision tree and a notification plan.  Emergency response drills (and evaluations) are conducted annually.  Emergen"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 16684,
      "SummaryText": "cy operation and response procedures are also reviewed at that time.\nPlant Incident Response Team (HAZMAT Team)\nThe HAZMAT Team is composed of a core of nine people trained to the Hazardous Material Technician level. CMS, Inc. of Colorado Springs trained the HAZMAT team.  The training consisted of 24 hours of classroom and field exercises to allow the participants to qualify for the Hazardous Material's Technician level as prescribed by the National Fire Protection Association.  The Team conducts annual refresher training as prescribed in the OSHA regulations.  Additionally, 20 maintenance people have been trained to establish and operate a decontamination facility.  The Team is equipped with Level A totally encapsulating suits, as well as Level B and Level C equipment to allow for safe response to a spill or release.  The emergency response equipment is kept in a dedicated emergency response truck.\nPublic Notification\nWhen operational, public notification will occur using the new Emergency Alert System being built in Keokuk.  Until then, Roquette will notify by phone, the Fire Department, and they will be responsible for public notification.\nPlanned Changes to Improve Safety\nEmployee Training\nAll employees are trained in hazardous material awareness through their yearly training and through monthly safety meetings. Upon completion of the June 1999 Prevention Program review, Roquette will evaluate and implement the recommended training actions by December 31, 1999 as required.\nMitigation & Control Equipment\nUpon completion of the June 1999 Prevention Program review, Roquette will evaluate and implement the recommended equipment improvements by December 31, 1999 as required.\nOrganizational Changes\nNo organizational changes are planned at this time.\n1\n\n\n1"
    }
  ]
}