{
  "FacilityID": 16823,
  "FacilityName": "Statewide Cooling Co",
  "FacilityStr1": "761 Commercial Ave",
  "FacilityStr2": null,
  "FacilityCity": "Oxnard",
  "FacilityState": "CA",
  "FacilityZipCode": "93030",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06111",
  "LEPC": null,
  "FacilityLatDecDegs": "34.194444",
  "FacilityLongDecDegs": "-119.1665",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 151092038,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Statewide Cooling Co",
  "OperatorStr1": "P.O. Box 5083",
  "OperatorStr2": null,
  "OperatorCity": "Oxnard",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93031",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000124581",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-08-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.19407,
  "FRS_Long": -119.17374,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 23548,
      "AltID": "Refrigeration",
      "FacilityID": 16823,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 30080,
          "ProcessID": 23548,
          "ChemicalID": 56,
          "Quantity": 12500.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 24157,
          "ProcessID": 23548,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 12992,
              "Process_NAICS_ID": 24157,
              "SafetyReviewDate": "1999-02-01 00:00:00",
              "PHA_Date": "1999-05-19 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-05-01 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-01 00:00:00",
              "TrainingReviewDate": "1999-10-21 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-01 00:00:00",
              "EquipmentInspectionDate": "1999-05-12 00:00:00",
              "EquipmentTested": "Compressor Control Switches  tested / verified",
              "ChangeMgmtDate": "1998-04-05 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-01 00:00:00",
              "PreStartupReviewDate": "1999-01-07 00:00:00",
              "ComplianceAuditDate": "1999-05-12 00:00:00",
              "AuditCompletionDate": "2000-05-01 00:00:00",
              "IncidentInvestigationDate": "1997-08-12 00:00:00",
              "InvestigationChangeDate": "1997-08-12 00:00:00",
              "ParticipationPlansReviewDate": "1999-05-03 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-19 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Refrigeration Facility",
              "_chemicals": [
                {
                  "PrimaryKey": 18374,
                  "PreventionProgram3ID": 12992,
                  "ProcessChemicalID": 30080
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 16823,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-02-02 00:00:00",
    "ERTrainingDate": "1998-10-10 00:00:00",
    "CoordinatingAgencyName": "Oxnard City Fire Department",
    "CoordinatingAgencyPhone": "8054820000",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "CFR 1910.120(q)"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 16823,
      "SummaryText": "Statewide Cooling (SWC)  is a facility located in Oxnard, CA in a commercial / industrial area of the city.  The facility was built in  the early 1970's.  The facility provides refrigeration effect for the removal of field heat from freshly harvested vegetables and fruit (strawberries).  The refrigerant in use is anhydrous ammonia (NH3).  The product that comes to the facility for pre-cooling and short term storage is on site generally less than four days from harvesting.  The facility is a seasonally operated plant with product harvest periods picking up in the month of October and finishing in July.  The remaining months see little fresh product, however the refrigeration equipment is still operative.  Annual maintenance is performed on the equipment during August and September.\n\nSWC is supported by an affiliate company, Western Precooling Systems (WPS), for maintenance and service of the refrigeration equipment.  WPS has offices and staff on site at SWC's location.  WPS employs mechanical staff that have been trained for CFR1910.120(q) emergency response, as well as technical training for the tasks they perform as it relates to the refrigeration equipment.  One of the avenues for training that WPS uses is through the Refrigerating Engineers and Technicians Association (RETA).  WPS sponsors its technicians in that trade association and has personnel who have challenged and successfully passed the RETA Plant Operators Certification Examination.  Other training is through offsite seminars and on-the-job skill development.  Bi-weekly safety tailgate meetings help keep the message of safe operating and safe work behaviors in the foreground of the employee's thinking.\n\nWPS performs plant inspections as an ongoing process at the facility.  As equipment maintenance needs are determined the need is expressed at the weekly work load meeting conducted by SWC's general manager.  The specific repair task or upgrade for the expressed need is decided at the workload meeting and"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16823,
      "SummaryText": " assigned with a due date.  Minutes are maintained of the workload meetings.  Through this regular routine of inspect, discuss, assign and confirmation of completion SWC and WPS have reduced the equipment operational problems and also reduced the release potential.\n\nIn 1996 and 1997 modifications were made to the piping system that gave more support to the piping.  At that same time SWC decided to reduce its offsite consequence potential by piping all relief valves to water absorbing tanks.  Relief excursions were identified as the most common unwanted release situation and by routing to a secondary containment system the effects of a relief situation no longer affected people on-site, nor off site.  The second most common unwanted release situation involved the process of oil removal from the low temperature portion of the system.  Special self-closing valves were installed as a permissive for oil drain flow.  If a release were to develop during the oil draining task the mechanic simply releases the handle of the self-closing valve and flow is terminated.  WPS has installed  these types of valves at oil drain points.\n\nOther release prevention steps taken at SWC:\n-  SWC has enclosed the facility with fencing and gates to limit access to the facility to increase the security of the facility from potential 'wrong-do-er's\".\n-  All employees are trained for hazard communication (discovery and communicating) for releases, fires, vandals, etc.  Training is documented through the \"Personal Qualifications Standard\" booklet which is in each employees training record file.\n-  A strong relationship exists with the Oxnard Fire Department.  There have been demonstrations and tours of the system with the first responding engine companies to familiarize the crews with the facility layout and where hazardous areas are located.\n-  The engine room is computer controlled with telephone access for monitoring and parameter changes.  The equipment may be shutdown from off site via phone "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16823,
      "SummaryText": "if it were not possible to directly access the control area.\n-  There is an automatic dialing machine that is connected to the computer control.  When there is an equipment failure, or when the pressures are rising and approaching the shut down setting, or if there is a power failure, this autodialer begins calling out to eight successive phone numbers to summon technicians to solve the problem.\n-  SWC proactively trains its personnel in the benefits of good housekeeping.  There is a staff to maintain the general appearance of the facility on a day to day basis.\n\nThe policy at SWC is to not have emergencies.  This is accomplished by due diligence with the thoughts of \"prevention, preparation, mitigation, response & recovery.  There have been no reportable releases at SWC in the past five years.  However, there is a need to be prepared to respond to and mitigate a release situation.  The SWC staff is trained to communicate to WPS and the Fire Department and to evacuate (shelter in place or evacuate off site) when there is a release situation or fire.  SWC employees and managers are trained to shepherd visitors (truck drivers receiving product or delivering product) when there is an emergency.  By effectively determining all persons are safe, the integrated emergency response with Oxnard Fire can more swiftly manage the tactical part of the response.\n\nWPS has trained individuals (CFR1910.120(q) First Responder - Technician) who are trained to respond to, size up and mitigate a release situation.  WPS personnel have served as industry liaison at incident command during response situations and as entry team participants at other facilities in Oxnard and Ventura County over the years (again, the problem was not at SWC).\n\nThe worst case scenario depicts a vessel failure at the central receiver.  Even though the receiver does not operate at the level in the scenario we modeled as though it were 80% full.  The toxic endpoint reaches 1.5 miles from the source.  There are res"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 16823,
      "SummaryText": "idences, schools and city offices within the possible footprint.\n\nThe alternative case scenario depicts a pressure relief valve failing to close and allowing the vapor pressure in the hypothetically full largest vessel to drop to zero psig.  There would be a release of 2,608 pounds of ammonia over a 38 minute period in this instance.  There are no residences within the footprint of this scenario"
    }
  ]
}