{
  "FacilityID": 169,
  "FacilityName": "O'Toole Inc.",
  "FacilityStr1": "18239 O ave",
  "FacilityStr2": "corner of G-40 & G-34",
  "FacilityCity": "Letts",
  "FacilityState": "IA",
  "FacilityZipCode": "52754",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19115",
  "LEPC": "Louisa County LEPC",
  "FacilityLatDecDegs": "41.3285",
  "FacilityLongDecDegs": "-91.273694",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "SW",
  "FacilityURL": null,
  "FacilityEmailAddress": "otoole&lisco.net",
  "FacilityDUNS": 133192120,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "O'Toole Inc.",
  "OperatorStr1": "18239 O ave",
  "OperatorStr2": "corner of G-40 & G-34",
  "OperatorCity": "Letts",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52754",
  "OperatorZipCodeExt": null,
  "RMPContact": "Greg O'Toole",
  "RMPTitle": "president",
  "FTE": 5,
  "OtherEPAFacilityID": "69544-Ia-001",
  "EPAFacilityID": "100000001446",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-07-16 00:00:00",
  "SafetyInspectionBy": "Iowa Dept of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-04-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-03-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-03-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-03-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0.5",
  "FRS_Lat": 41.32446,
  "FRS_Long": -91.27327,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 183,
      "AltID": "retail anhydrous ammonia",
      "FacilityID": 169,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": {
        "Process_NAICS_ID": 184,
        "ProcessID": 183,
        "NAICSCode": "42291",
        "_desc": {
          "NAICS_CODE": "42291",
          "NAICS_DESCRIPTION": "Farm Supplies Wholesalers"
        }
      },
      "_chemicals": [
        {
          "ProcessChemicalID": 228,
          "ProcessID": 183,
          "ChemicalID": 56,
          "Quantity": 153000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 500228,
          "ProcessID": 183,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 169,
      "SummaryText": "OToole Inc submits this Risk Management Plan as an ongoing effort to maintain the safety and confidence which our\ncommunity has placed with us to coexist safely within the neighborhood.  We strive to keep all storage and mobile\nequipment up to the latest state codes.  Our facility is inspected by the Iowa Department of Agriculture at the\nminimum of once a year and sometimes twice. As a part of  our continuing effort to maintain safety we change all\npressure relief valves when the dates stamped on them by the manufacturers expire. These valves are all stamped with\nthe date of manufacture ,the expiration date & flow capacity. There are no shutoff valves between these reliefs and\nthe tank. These valves act to keep the pressures in the storage facility well under the designed strength of the tank. \nThey are set to relieve the pressure at 250psi.and there are 4 of them on the storage tank.  The design test pressure of\nthe storage tank is 375psi at 115 degrees F.  Pressure in the storage tank is monitored by an external 0-400 psi gauge\non the dial end of the tank.  The shell thickness of our tank is 15/16 thick and the ends are over 1/2 thick.  The\nstorage tank is built to 1965 AMSE code Sec II,VII,Ix Par UWSI with 5 pc. head beads spot x-rayed per Par\nUW52A.  The tank was also heat treated per Par UW40&UCS56.  It was manufactured in Memphis Tennessee\nespecially for anhydrous ammonia use by Flint Steel Corporation and inspected by a commissioned inspector of the\nNational Board of Boiler & Pressure Vessel Inspectors of the state of Tennessee.  All outlets of  the tank vapor and\nliquid contain excess flow valves which are spring loaded .  These valves function  if a pipe were to be compromised\nthe flow of ammonia would close these valves thus preventing a massive outflow of ammonia.  The storage tank is\nlocated 60 from our water supply.  All plumbing on the storage facility was professionally installed by Dales\nPetroleum Service of Fort Dodge Ia.  All piping is schedule"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 169,
      "SummaryText": " 80 and rated for anhydrous ammonia and protected from\ntraffic by two cement filled pillars 4 foot in the ground.  Safety measures included in the plumbing include hydrostatic\nrelief valves which are placed anywhere in the system which ammonia is confined between two valves with no place\nto escape.  These valves will vent the pressure in these pipes to prevent pipe failure.  Other safety measures include a\ncable operated shutoff valve which can be accessed at the opposite end of the tank from all other plumbing this valve\nwas installed after the plant was built as soon as they became available.  The pump itself can be shutoff at 4 locations\nwithin the plant site.  The pump is equipped with a 0-400psi pressure gauge on the pressure side and a bypass line\nwhich returns product to the suction side of the pump.  \n \nHoses on the loading dock are all rated for anhydrous ammonia and carry dates of manufacture and pressure ratings\nstamped at a minimum of every 5 foot intervals for the length of hose.  These hoses are replaced on or before their\nstamped expiration dates.  Where these hoses connect to plant piping special breakaway valves are installed which are\ndesigned to uncouple in the event of someone driving away while hoses are still connected with a loss of less than 1\noz. of liquid anhydrous being released. In addition the hoses are protected by hydrostatic relief valves to keep trapped \nammonia from building pressures over their rated capacity.  Ends of hoses are hung in lockable racks which prevents\nunauthorized access.\n\nOToole Inc. has annual training for employees for the safety and handling of anhydrous ammonia. They are required\nto view a state approved video on the safe handling of anhydrous ammonia which is done on site.  OToole Inc keeps\ntwo anhydrous ammonia gas masks on site with anhydrous ammonia rated canisters including one extra canister for\neach mask.  The canisters are replaced on or before the  expiration date stamped on them by the  manufacturer."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 169,
      "SummaryText": " \nEmployees are trained not to fill any nurse tanks or the storage tank to over 85% full at any time.  During any transfer\nof anhydrous there is always an employee present. OToole Inc. maintains 2 water tanks located in transfer areas for\nload-in and load -out operations and also has a shower in the office nearby for any exposure to anhydrous needing\nwater applied immediately.  Goggles and gloves are furnished for all employees and growers free of charge and are\nrequired apparel during transfer operations.  The Letts Fire Department has been on site for instruction on how to\nshutoff pumps and to the basic operation of the plant .  Each year the facility undergoes a checklist inspection of all\nhoses,relief valves,guages,and all other safety related equipment.  These safeguards and preventive maintenance are\nall in an all out effort by OToole to be as safe as humanly possible."
    }
  ]
}