{
  "FacilityID": 16975,
  "FacilityName": "HCI Clearwater Chemical Corporation",
  "FacilityStr1": "1575 Sunshine Drive",
  "FacilityStr2": null,
  "FacilityCity": "Clearwater",
  "FacilityState": "FL",
  "FacilityZipCode": "33765",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12103",
  "LEPC": "District 8 LEPC",
  "FacilityLatDecDegs": "27.981111",
  "FacilityLongDecDegs": "-82.749167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "UN",
  "FacilityURL": "www.hollandchemical.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 122625064,
  "ParentCompanyName": "HCI USA Distribution Cos., Inc.",
  "Company2Name": null,
  "CompanyDUNS": 926348517,
  "Company2DUNS": 0,
  "OperatorName": "HCI Clearwater Chemical Corporation",
  "OperatorStr1": "P. O. Box 6865",
  "OperatorStr2": null,
  "OperatorCity": "Clearwater",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33758",
  "OperatorZipCodeExt": null,
  "RMPContact": null,
  "RMPTitle": "Plant Manager",
  "FTE": 36,
  "OtherEPAFacilityID": "34625CLRWT1575S",
  "EPAFacilityID": "100000042438",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-09-01 00:00:00",
  "SafetyInspectionBy": "DOT",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-08-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 27.98111,
  "FRS_Long": -82.74917,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 23790,
      "AltID": "Sodium Hypochlorite Manuf",
      "FacilityID": 16975,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 24407,
          "ProcessID": 23790,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 30511,
          "ProcessID": 23790,
          "ChemicalID": 62,
          "Quantity": 360000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 530511,
          "ProcessID": 23790,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 16975,
      "SummaryText": "\nHCI Clearwater Chemical Corporation\nClearwater, FL\n\n\nHCI Clearwater Chemical Corporation is a chemical manufacturing and distribution plant located in Clearwater, FL. It is part of HCI USA Distribution Companies Inc. headquartered in St. Louis, Missouri.  HCI USA Distribution Companies is a distribution company serving customers worldwide with products, chemicals and advanced materials. The company ranks among the top 10 chemical distribution firms in North America.  HCI USA Distribution Companies has approximately 1,000 employees at more than 50 facilities in 21 states and Mexico.  HCI USA Distribution Companies may be found at its Web Page: www.hollandchemical.com.\n\nIt is the world-wide policy of HCI USA Distribution Companies to design, blend and distribute its products and to handle materials throughout their life cycle in a manner that protects the environment and safeguards employees, customers and the public from unacceptable risk. \n\nThis facility participates in the CMA's Responsible Care Program and the Responsible Distribution Process Program of the National Association of Chemical Distributors. The Community Outreach and Emergency Response Plan of Responsible Distribution Process brings chemical distribution plants and local communities together through communications and cooperative emergency planning. We have also been members of the Chlorine Institute for 15 years. \n\nThe HCI Safety Program of the HCI Health, Safety and Environmental Program is designed to prevent fires, explosions and accidental chemical releases. The program requires safety audits, inspection and maintenance programs, and safety training for employees and contract workers. Facilities are encouraged to listen to the concerns of the community and to consider these concerns when designing and implementing process safety systems.\n\nIn this distribution facility, we handle chlorine, which is considered hazardous by the Environmental Protection Agency (EPA).  The same properties that make t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16975,
      "SummaryText": "his chemical valuable as a commodity also makes it necessary to observe certain safety precautions in handling it to reduce the threat to nearby members of our community as well as to that of the people in our company. It is our policy to adhere to all applicable Federal, State and Local regulations. \n\nWe are located at 1575 Sunshine Drive in Clearwater.   We employ 36 people.  This plant manufactures bleach from chlorine. Bleach is used to chlorinate swimming pools and purify water at water and sewer treatment facilities. We are active participants in the District 8 Pinellas County Local Emergency Planning Committee.\n \nThe Emergency Programs in place at this facility include an:\n\nEMERGENCY ACTION PLAN \nFIRE PREVENTION PLAN\nEMERGENCY RESPONSE PLAN\nTRANSPORTATION EMERGENCIES PLAN\nSPILL PREVENTION CONTROL & COUNTERMEASURE PLAN\n \nThe EPA was mandated by law to define the Worst Case Scenario (WCS) as an unlikely event: the largest single storage vessel losing all of its contents in 10 minutes. This facility does have off-site consequences to the public and the environment.\n \nThe EPA calls a more likely incident, many of which will have limited or no off-site consequences, an Alternate Release Scenario (ARS). An ARS could be a hose or small vessel leak. For this facility, the ARS will have off-site consequences.\n \nHCI USA Distribution Co., Inc maintains Health, Safety and Environmental manuals, which contain company policies for Risk Management, Training, Product Stewardship, Community Outreach and Hazard Communication among others.  The manuals also include Emergency Action Plans, Emergency Response Plans, and Transportation Emergency Plans. The facility is also in compliance with the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard which requires careful reviews of the hazards with and the safeguards that must be implemented to prevent releases of regulated chemicals. This facility has 30 years experience handling chlorine. "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16975,
      "SummaryText": "Our bleach manufacturing operations have automatic shutdown systems and perimeter vapor monitors. \n \nThere have been no accidental releases in the past 5 years.  No one off-site was injured and no evacuation measures have ever been taken.\n \nThis facility has emergency plans, which have been coordinated with the Clearwater Fire Department, Pinellas County Emergency Response Team and the Pinellas County Emergency Management Office. The facility conducted a joint classroom and hands-on training and drill on chlorine with the City of Clearwater Fire Department, Pinellas County Hazardous Materials Response Team and Pinellas County Emergency Management on February 22-25, 1999.  All of our safety equipment is Y2K compatible.\n\nOur response plan for chlorine is based upon the Chlorine Institute's Pamphlet 64, Emergency Response Plans for Chlorine Facilities. The emergency response plans for this facility include procedures for notification of the local fire authority and notification of any potentially affected neighbors.\n \nTo continue to improve upon its safety record, this facility does conduct incident investigations, safety compliance audits, continuous training of emergency procedures, and continuous community outreach actions which include: educating and training neighbors, customers, fire departments and emergency response teams."
    }
  ]
}