{
  "FacilityID": 17070,
  "FacilityName": "The Dial Corporation",
  "FacilityStr1": "2467 Henry Ladyn Drive",
  "FacilityStr2": "Hwy 61 South",
  "FacilityCity": "Fort Madison",
  "FacilityState": "IA",
  "FacilityZipCode": "52627",
  "Facility4DigitZipExt": "1427",
  "FacilityCountyFIPS": "19111",
  "LEPC": "Lee County LEPC",
  "FacilityLatDecDegs": "40.576778",
  "FacilityLongDecDegs": "-91.437361",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": "www.dialcorp.com",
  "FacilityEmailAddress": "hausch@dialcorp.com",
  "FacilityDUNS": 70252531,
  "ParentCompanyName": "The Dial Corporation",
  "Company2Name": "N A",
  "CompanyDUNS": 70252531,
  "Company2DUNS": 0,
  "OperatorName": "The Dial Corporation",
  "OperatorStr1": "2467 Henry Ladyn Drive",
  "OperatorStr2": "Hwy 61 South",
  "OperatorCity": "Fort Madison",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52627",
  "OperatorZipCodeExt": "1427",
  "RMPContact": "Jim Longnecker",
  "RMPTitle": "Plant Manager",
  "FTE": 538,
  "OtherEPAFacilityID": "52627THDLCHWY61",
  "EPAFacilityID": "100000029266",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "not issued yet",
  "SafetyInspectionDate": "1992-09-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-07-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-07-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.6244,
  "FRS_Long": -91.43574,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 23946,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 17070,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 24564,
          "ProcessID": 23946,
          "NAICSCode": "311422",
          "_desc": {
            "NAICS_CODE": "311422",
            "NAICS_DESCRIPTION": "Specialty Canning"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 30709,
          "ProcessID": 23946,
          "ChemicalID": 56,
          "Quantity": 17000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 530709,
          "ProcessID": 23946,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17070,
      "SummaryText": "EXECUTIVE   SUMMARY\n\n\n\na.The Dial Corporation Food Plant in Fort Madison, Iowa uses many systems (refer to section d. below) to prevent accidental releases of toxic or flammable substances.  Should a release occur Dial employees have training in emergency response.  Approximately 40 employees are members of Dial's Emergency Action Team (EAT).  The local fire department will provide backup responders and provide fire response.  \n\nb.The Dial Food Plant is located at 2467 Henry Ladyn Drive in the city limits of Fort Madison, IA.  The Dial property consists of a 117 acre site with Henry Ladyn Drive as its Southern boundary.  The plant produces shelf stable foods which are palletized and shipped by truck and rail.  All ingredients and packaging materials are received by truck.\n\nA majority of the food ingredients require refrigeration.  Dial has a newly built (April, 1995) ammonia refrigeration system that provides the required cooling.  The system has a nominal charge of 17,000 lbs. of anhydrous ammonia.\n\nc.The offsite consequence analysises considered two scenarios:\nWorst case release and an alternative for ammonia.\n\nThe worst case scenario is defined by EPA, which states that \"the owner or operator shall assume that the ... maximum quantity in the largest vessel ... is released and vaporizes to a gas over 10 minutes,\" due to an unspecified failure.  The alternative scenario is defined as \"more likely to occur than the worst-case scenario\".\n\nAtmospheric dispersion modeling was performed to determine the distance traveled by the ammonia released before its concentration decreases to the \"toxic endpoint\" selected by EPA as 200 ppm, which is the Emergency Response Planning Guideline Level 2 (ERPG-2).  This is defined by the American Industrial Hygiene Association (AIHA) as the \"maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17070,
      "SummaryText": "cts or symptoms which could impair an individual's ability to take protective action.\"  The residential population within a circle with a radius corresponding to the toxic endpoint distance was defined, \"to estimate the population potentially affected\".\n\nThe ammonia worst-case release scenario at Dial assumes the Control Pressure Vessel (CPV) is full of liquid to the 100% probe level which is 80% of the vessel volume.  The entire contents of the CPV would equal 8,968 lbs.  Because the building is an enclosure only 55% of this amount will be lost in the 10 minute period by EPA definition.  Therefore the spill quantity considered is 4,900 lbs.  A drain flume is located along the South wall of the refrigeration building.  The floor under the major ammonia liquid vessels is sloped to this flume.  Any large liquid ammonia release from these vessels remaining after vaporization would drain by gravity to Dial's process waste water treatment system.  The passive mitigation of the drainage is considered to only handle ammonia from piping connected to the CPV.  Therefore a release of 8,968 lbs times 0.55 results in 4,900 lbs. to consider as the worst case.  At this level of ammonia sensors will automatically open a remote electrical breaker of the compressor room.  The exhaust fans are explosion proof and will remain on as they are powered via the emergency circuity.  The endpoint radius for this worst case scenario is 1.36 miles or 7,200 feet.  The population inside this area in all directions is 450.  For toxic gas releases the only population that will potentially be affected are those within an elliptical plume extending downwind of the release point.  This plume area, or footprint, is approximately 6% (one-twentieth) of the area of the full circle.\n\nAn alternative ammonia release assumes a leak of 260 pounds from piping on the roof.  The DEGADIS program was used for toxic gas modeling.  The toxic end point for this quantity of release over 10 minutes modeled to be 980 fe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17070,
      "SummaryText": "et.  This would reach only one residence or a public receptor population of two if the wind is out of the NNE.  \n\n\nd.Dial's accidental release prevention program is based on the following key elements:\nTrained operators for the ammonia system\nUse of state-of-the-art ammonia system with built in safety features\nUse of written standard operating procedures\nPerformance of a hazard review of the equipment and procedures\nUse of inspection and auditing programs.\n\ne.No major releases of ammonia have occurred since ammonia was brought on site in April of 1995. EPA specifies inclusion of all releases that resulted in:  deaths, injuries, significant property damage on site, known offsite deaths, evacuations, sheltering in place, property damage or environmental damage. \n\nf. The Dial Food Plant has an Emergency Response Plan and coordinates with the local fire department.  Dial has 40 or so employees trained in medical & emergency response.  Twice a year training, reviews & practice occurs.  Medical, evacuation, tornado, explosion and ammonia release scenarios are addressed.  Utilities operators are involved in this program as key presonnel with working knowledge of the ammonia system.\n\ng.Improvements to the prevention program include recommendations by AcuTect, a process risk management consultant.  They performed the first audit of Dial's PSM program for our ammonia refrigeration system. \n\n\n  \nExecutive Summary\n\nRMP/NH3-C3H8/EXECSUM/omh/REVISION#5/rmpexsum2txt/060399"
    }
  ]
}