{
  "FacilityID": 17247,
  "FacilityName": "Texas Signature Food Company",
  "FacilityStr1": "800 Ellen Trout Drive",
  "FacilityStr2": null,
  "FacilityCity": "Lufkin",
  "FacilityState": "TX",
  "FacilityZipCode": "75902",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48005",
  "LEPC": null,
  "FacilityLatDecDegs": "31.371194",
  "FacilityLongDecDegs": "-94.704722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Armour-Swift Eckrich Deli Foodservice Company",
  "Company2Name": "Con Agra Refrigerated Prepared Foods",
  "CompanyDUNS": 7258908,
  "Company2DUNS": 7258909,
  "OperatorName": "Texas Signature Food Company",
  "OperatorStr1": "800 Ellen Trout Drive",
  "OperatorStr2": null,
  "OperatorCity": "Lufkin",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75902",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike Faber",
  "RMPTitle": "Plant Manager",
  "FTE": 275,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000122805",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Not applicable",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Lufkin, TX",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-09-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-09-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-08-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-04-29 00:00:00",
  "DeRegistrationEffectiveDate": "2008-03-31 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 31.37304,
  "FRS_Long": -94.71669,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "removed all ammonia from the ammonia refrigeration system & sold the facility",
  "_processes": [
    {
      "ProcessID": 24224,
      "AltID": null,
      "FacilityID": 17247,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 24847,
          "ProcessID": 24224,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 31075,
          "ProcessID": 24224,
          "ChemicalID": 56,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 531075,
          "ProcessID": 24224,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17247,
      "SummaryText": "EXECUTIVE SUMMARY\n\n1.0    RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Texas Signature Foods facility in Lufkin, Texas has a good record in preventing releases of anhydrous* ammonia.  The facility has implemented an Emergency Response Plan which is to ensure that the plant is properly prepared and equipped to respond to any emergency including an ammonia release.  This detailed emergency response program includes procedures for handling an emergency - the established action plan and appropriate personnel involved in containing an ammonia release - Emergency Response Team. The Emergency Response Plan is a thorough and comprehensive plan for release prevention and emergency response.  The emergency response policies at the Texas Signature Foods facility ensure that there is emergency response coverage 24 hours - 7 days per week. \n\n*From this point in the Executive Summary, anhydrous ammonia will be synonymous with ammonia.\n\n2.0    PROCESS DESCRIPTION AND REGULATED SUBSTANCES\n\nThe Texas Signature Foods Lufkin Plant is a producer of numerous meat products and sauces /gravies.  Some of the meat products include marinated chicken and fajita meat.  The NAICS code for the processes at this facility is 311612.   Many areas of the plant are refrigerated to preserve the meat products. Texas Signature Foods has one regulated substance under 40 CFR 68: ammonia.  Ammonia is used as a refrigerant in the refrigeration of the products in the various areas of the plant.\n\nThe ammonia threshold for triggering applicability to 40 CFR 68 is 10,000 pounds.  The total quantity of ammonia stored in the refrigeration process is 10,000 pounds.  The process exceeds the threshold quantity of approximately 10,000 pounds as set by 40 CFR 68 and thus is regulated by the Risk Management Program.\n\n 3.0    WORST-CASE AND ALTERNATIVE RELEASE SCENARIOS\n\nThe ammonia refrigeration system has associated hazards that can potentially affect on-site employees and the general public off-site if there is a r"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17247,
      "SummaryText": "elease from the system.  Described below are the associated hazards and the worst-case and alternative release scenario for the regulated chemical.  Though there may be other scenarios possible, EPA only requires that one worst-case and one alternative scenario be reported for each regulated chemical. \n\nAmmonia is classified as a Group 2 Refrigerant per ASHRAE Standard 34-1989.  The dominant characteristic of this chemical is its toxicity.  It is a self-alarming chemical by its distinctive pungent odor.  Due to this odor, persons exposed to ammonia vapor will not voluntarily stay in areas of even small concentrations.  Ammonia will burn at a very narrow and high range of concentrations accompanied with a high ignition temperature.  Although ammonia is not poisonous, it is corrosive to human tissue.  Ammonia is readily absorbed into the moisture of the skin and, at high concentrations, can cause severe burns.\n\nThe risks to persons in an accidental release of ammonia include:\n\n1.    Corrosive attack of skin and other tissue (including lung tissue)\n2.    Freezing of skin and other body tissue when contacted by liquid ammonia\n3.    Eye contact\n\nBelow is a description of the release scenarios for ammonia and their off-site consequences:\n\n3.1    Worst-Case Scenario Description\n\nOne worst-case scenario has been developed for the Lufkin plant.  The largest potential release of ammonia would occur with a 7/8 inch diameter puncture in the liquid portion of the high pressure receiver.  Taking the specific definition of the worst-case from 40 CFR 68.25, the vessel that can store the largest quantity of ammonia is the blast freezer recirculator.  However, the high pressure receiver would be used as the primary liquid storage vessel during pumpout conditions.  The remainder of the system charge would be transferred to the other parts of the system.  The total quantity of ammonia that can be stored in the high pressure receiver is 6,351 pounds. It is assumed that the entire 6,351 pounds are r"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17247,
      "SummaryText": "eleased inside the building in 10 minutes.  However, the high pressure receiver is located in the engine room which allows for building mitigation.  Therefore, the worst-case release rate to the atmosphere will be reduced to 216 lbs/min. Administrative controls are not applicable to this scenario. For the worst-case release, regulations dictate that the release height is at ground level.  \n\nUnder Section 68.25(c)(1), a regulated toxic substance such as ammonia that is normally a gas at ambient temperature and handled as a liquid under pressure shall be considered to be released as a gas over a 10 minute period.  Thus, ammonia's physical state in the worst-case scenario is a gas.\n\nSince this facility is located in a populated area, the worst-case release scenario distance-to-endpoint will reach off-site public receptors.\n\n3.2    Alternative Release Scenario Description\n        \nThe alternative release scenario is an ammonia release from a liquid ammonia line on the roof. The release scenario considers a forklift truck hitting an evaporator in the entry to the retail room.  The evaporator falls pulling on a liquid ammonia pipe which splits above the roof. The opening in the damaged pipe is assumed be equivalent to a < inch diameter orifice, and is located 35 feet above ground level.  Administrative and passive controls are not applicable to this scenario.  Active mitigation of the release is human intervention.    \n\nSince this facility is located in a populated area, the alternative release scenario distance-to-endpoint will reach off-site public receptors.\n    \n4.0    GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nTexas Signature Foods is currently in the process of developing an OSHA (PSM) program for their ammonia refrigeration system. At Texas Signature Foods, ammonia falls under the RMP Program 3 Prevention Program which is identical to the OSHA PSM program.  EPA has said that if the process is in compliance with OSHA PSM, then it is compl"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 17247,
      "SummaryText": "iance with RMP Program 3.  Thus, Texas Signature Foods's ammonia PSM system has been reviewed and the PSM system elements are being implemented for the RMP document. \n\n5.0    FIVE-YEAR ACCIDENT HISTORY\n\nThe review of Texas Signature Foods's accident history includes the following range of dates: June 21, 1994 - June 21, 1999.  According to 40 CFR Part 68.42(a), there have been no accidental releases at this facility.\n\n6.0    EMERGENCY RESPONSE PROGRAM\n\nAs mentioned previously, the Texas Signature Foods facility has developed an Emergency Response Plan (ERP). The ERP is a detailed document which discusses the role of employees in an emergency situation. The plan outlines specific procedures for evacuations for plant personnel. All emergency response personnel (Emergency Response Team) undergo emergency response training at the HAZMAT technician level. The Emergency Coordinator is responsible for implementing the ERP and controlling all aspects of the plan and personnel.\n\nThis document contains information regarding:  1) roles and lines of authority, 2) training, 3) communication, 4) coordination with outside parties, 5) personal protective and emergency equipment, 6) site security and control, 7) emergency medical treatment and first aid, 8) ammonia decontamination, 9) emergency alerting and response procedures, 10) emergency recognition and prevention, and 11) critique of response and follow-up.\n\n7.0    PLANNED CHANGES TO IMPROVE SAFETY\n\nThe plant currently has several safety issues that will be resolved.  The plant will implement a Process Safety Management Program with all 14 elements that meet the RMP criteria.  This will improve the safety of the ammonia system.  In particular, a preventative maintenance system will be implemented which is a key aspect in preventing releases of ammonia.  Additionally, the facility is completing design of a new ammonia refrigeration system for the entire plant.  This design and installation is estimated to be completed by June 2000."
    }
  ]
}