{
  "FacilityID": 17330,
  "FacilityName": "ARCHIMICA (PUERTO RICO), INC.",
  "FacilityStr1": "C Street, Humacao Industrial Park",
  "FacilityStr2": null,
  "FacilityCity": "Humacao",
  "FacilityState": "PR",
  "FacilityZipCode": "00741",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "72069",
  "LEPC": null,
  "FacilityLatDecDegs": "18.15675",
  "FacilityLongDecDegs": "-65.788722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 12077228,
  "ParentCompanyName": "ARCHIMICA (FLORIDA), INC.",
  "Company2Name": null,
  "CompanyDUNS": 175070242,
  "Company2DUNS": null,
  "OperatorName": "Eng. Santiago Hernandez",
  "OperatorStr1": "C Street, Humacao Industrial Park",
  "OperatorStr2": null,
  "OperatorCity": "Humacao",
  "OperatorStateFIPS": "PR",
  "OperatorZipCode": "00741",
  "OperatorZipCodeExt": null,
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000158679",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-16 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-09-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-09-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-09-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2016-07-11 00:00:00",
  "DeRegistrationEffectiveDate": "2016-04-28 00:00:00",
  "AnniversaryDate": "2004-08-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 18.152222,
  "FRS_Long": -65.789444,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 24387,
      "AltID": "Manufacture 5-fluorouraci",
      "FacilityID": 17330,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 31270,
          "ProcessID": 24387,
          "ChemicalID": 61,
          "Quantity": 3600.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 25011,
          "ProcessID": 24387,
          "NAICSCode": "32541",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 13499,
              "Process_NAICS_ID": 25011,
              "SafetyReviewDate": "1999-04-08 00:00:00",
              "PHA_Date": "1999-04-08 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-04-08 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Nitrogen failure shuts process down",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "20 %vol fluorine in nitrogen",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Pressure switch activates alarm.",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Use of third reactor",
              "OpProceduresReviewDate": "1999-03-15 00:00:00",
              "TrainingReviewDate": "1994-05-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1995-05-31 00:00:00",
              "EquipmentInspectionDate": "1999-01-22 00:00:00",
              "EquipmentTested": "Fluorine delivery system.",
              "ChangeMgmtDate": "1997-05-13 00:00:00",
              "ChangeMgmtReviewDate": "1994-05-30 00:00:00",
              "PreStartupReviewDate": "1992-12-01 00:00:00",
              "ComplianceAuditDate": "1999-04-12 00:00:00",
              "AuditCompletionDate": "1999-10-12 00:00:00",
              "IncidentInvestigationDate": "1995-01-26 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-15 00:00:00",
              "HotWorkPermitReviewDate": "1994-05-30 00:00:00",
              "ContractorSafetyReviewDate": "1998-12-01 00:00:00",
              "ContractorSafetyEvalDate": "1994-05-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 19145,
                  "PreventionProgram3ID": 13499,
                  "ProcessChemicalID": 31270
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 17330,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1997-07-01 00:00:00",
    "ERTrainingDate": "1999-06-11 00:00:00",
    "CoordinatingAgencyName": "Humacao Civil Defense Department",
    "CoordinatingAgencyPhone": "7878520460",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17330,
      "SummaryText": "This Risk Management Plan is presented as a measure for preparedness in case of an emergency dealing with fluorine which is classified as toxic and which is stored in ARCHIMICA (PUERTO RICO), INC. above the threshold quantity of 1,000 lbs. according to 40 CFR 68.130.\n\nARCHIMICA  (PUERTO RICO), INC. with SIC Code 2834, has a Contingency Plan which activates a team of employees during emergencies like fires, spills, explosions, or releases which could threaten the human health or environment. ARCHIMICA (PUERTO RICO), INC. also complies with the OSHA PSM standard to protect the employees and so also protecting the environment.\n\nARCHIMICA (PUERTO RICO), INC. uses fluorine in the manufacture of 5-fluorouracil and the largest quantity stored at any time in the facility is 3,600 lbs. of fluorine in two (2) trailers (1,800 ea) whose measurements per trailer are 40' L x 8' W x 11' Each trailer is composed of eight (8)  tubes storing 20% F2 and 80% N2  at 2100 psig and 700 F,  parked in an area reserved for that purpose and with security measures to avoid entrance of personnel unknowledgeable of the substance's management. Each storage tube has a maximum of 225 lbs of fluorine. \n\nThe offsite consequence analysis includes two fluorine release scenarios, identified as \"worst case scenario\" and \"alternative release scenario\". The first scenario is defined by EPA as \"the release of the maximum quantity in a vessel or process line failure that results in the greatest distance to a specified endpoint\". It should take in consideration administrative controls and the release must occur in ten (10) minutes. Alternative release scenarios should be \"those that lead to concentrations above the toxic endpoint beyond the fenceline\". In this case it is allowed to consider both active and passive mitigation systems and the quantity and time of release is estimated. \n\nAtmospheric dispersion modeling is performed to determine the distance traveled by the fluorine released before its concentrat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17330,
      "SummaryText": "ion decreases to the \"toxic endpoint\" selected by EPA as 0.0039 ppm, which is the level of concern (LOC) for extremely hazardous substances (EHSs) regulated under section 302 of the Emergency Planning and Community Right-to-Know Act (EPCRA) based on one-tenth of the Immediately Dangerous to Life and Health (IDLH) level as developed by the National Institute for Occupational Safety and Health (NIOSH), using IDLH values developed before 1994. The IDLH exposure condition, as stipulated in the NIOSH Respirator Decision Logic, is a condition \"that poses a threat of exposure to airborne contaminants when that exposure is likely to cause death or immediate or delayed permanent adverse health effects or prevent escape from such an environment\".  It was established to ensure that a worker could escape without injury or irreversible health effects in the event of the failure of respiratory protection  equipment. As a safety margin IDLH values were based on the effects that might occur as a consequence of a 30-minute exposure.  A self-contained breathing apparatus equipped with a full facepiece and operated in a pressure-demand or other positive pressure mode should be used for entry into IDLH atmospheres.\n\nThe residential population within a circle with a radius corresponding to the toxic endpoint distance  has to be defined to estimate the population potentially affected.       \n\nThe worst case release scenario at ARCHIMICA (PUERTO RICO), INC.involves the release of 225 lbs in 10 minutes from a single vessel considering the maximum quantity stored at any one time, or the release of 22.5 lbs per minute. The Offsite Consequence Analysis Guidance requires that for the analysis of the worst case scenario, the determination of quantity must be done considering the largest quantity of a regulated substance handled on site in a single vessel at any one time, taking into account administrative controls. The administrative controls are procedures that limit the quantity of a substanc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17330,
      "SummaryText": "e that can be stored or processed in a vessel or pipe at any one time, which in this case is the maximum quantity of 225 lbs. \n\nAn atmospheric stability class of  F, a wind speed of 3.4 miles per hour and ambient air temperature of 770 F, as required by EPA, was used. Urban conditions were used because the site is located in an area with many obstacles in the immediate area. By definition the release would be of a toxic gas as fluorine is kept in the gaseous state. \n\nWhen atmospheric dispersion modeling for the worst case scenario was performed using the conditions mentioned, a distance to toxic endpoint of 2.9 miles and an estimate of residential population potentially affected of 8,100 was obtained.\n\nThe alternative release scenario involves the rupture of a valve in the piping. Gas would escape at a rate of 15 lbs per hour which is the normal flow through the pipes. An atmospheric stability class of D, a wind speed of 6.7 miles per hour and ambient air temperature of 770 F was used.  Atmospheric dispersion modeling was performed using this set of conditions and a distance to toxic endpoint of 0.1 miles and an estimate of residential population potentially affected of 10 was obtained. \n\nThe modeling tool used, RMP*Comp version 1.06, is based on the EPA's Offsite Consequence Analysis Guidance. It is a planning tool designed to help easily identify high-priority hazards at a facility. Because it relies on simplified and generalized calculations the results are conservative. Thus, the extent and location of the area that might be placed at risk by a particular chemical release is overestimated.\n\nARCHIMICA (PUERTO RICO), INC.is in compliance with the OSHA PSM rule at 29 CFR ' 1910.119 with requirements \"for preventing or minimizing the consequences of catastrophic releases of toxic, reactive, flammable, or explosive chemicals\" and which \"may result in toxic, fire or explosion hazards\". The key to the prevention program is procedural/ managerial. The facility has a str"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 17330,
      "SummaryText": "ong maintenance program coupled with strict follow-up of Standard Operating Procedures (SOPs) and training. Training includes safety and health consideration when dealing with fluorine/ nitrogen mixture. A calibration procedure is part of the Maintenance SOPs. Information is well documented. All valves are well identified in field as well as in SOPs.  A Hazard and Operability log sheet was prepared which includes all possible causes of deviation from normal operation, consequences and action recommended. Job tasks and procedural steps dealing with the fluorine delivery system were translated to Spanish to assure comprehension by operators.\n\nNo major accidental releases of fluorine/ nitrogen mixture have occurred in the facility in the past five years.         \n\nThe facility has a Contingency Plan which provides with measures to minimize hazards to human health or the environment in case of a release of hazardous materials to the environment. The  Plan has a decision tree as to the potential hazard and they have emergency coordinators which with the aid of the available plant staff will take remedial action and will call Fire Department if necessary. The Humacao Fire Department has an annually updated list and amounts of the hazardous chemicals maintained at the plant as required by SARA 313. The Humacao Civil Defense Department also keeps the same updated records of the hazardous chemicals utilized at the plant as the President of the Regional SARA Committee is the Director of the Humacao Civil Defense Department.    \n\nA Safety Audit was completed in September 1992 as part of the Pre-startup of the plant. Sixteen (16) recommendations were identified. These recommended actions were evaluated and implemented."
    }
  ]
}