{
  "FacilityID": 17390,
  "FacilityName": "Kings Laboratory, Inc.",
  "FacilityStr1": "424 Blythewood Road",
  "FacilityStr2": null,
  "FacilityCity": "Blythewood",
  "FacilityState": "SC",
  "FacilityZipCode": "29016",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45079",
  "LEPC": "Richland County LEPC",
  "FacilityLatDecDegs": "34.215278",
  "FacilityLongDecDegs": "-80.991667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.kings-lab.com",
  "FacilityEmailAddress": "amontgom@kings-lab.com",
  "FacilityDUNS": 44939833,
  "ParentCompanyName": "Kings Laboratory, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 44939833,
  "Company2DUNS": null,
  "OperatorName": "Kings Laboratory, Inc.",
  "OperatorStr1": "P. O. Box 609",
  "OperatorStr2": null,
  "OperatorCity": "Blythewood",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29016",
  "OperatorZipCodeExt": null,
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000156467",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-10-23 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-09-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-08-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2006-06-06 00:00:00",
  "DeRegistrationEffectiveDate": "2006-06-05 00:00:00",
  "AnniversaryDate": "2004-07-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.21345,
  "FRS_Long": -80.99208,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "EPA has administratively marked this facility 'closed'.",
  "_processes": [
    {
      "ProcessID": 24462,
      "AltID": "Bromination",
      "FacilityID": 17390,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 31374,
          "ProcessID": 24462,
          "ChemicalID": 60,
          "Quantity": 56000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 25088,
          "ProcessID": 24462,
          "NAICSCode": "32519",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 13534,
              "Process_NAICS_ID": 25088,
              "SafetyReviewDate": "1999-05-15 00:00:00",
              "PHA_Date": "1999-06-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-07-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-01 00:00:00",
              "TrainingReviewDate": "1999-05-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-01 00:00:00",
              "EquipmentInspectionDate": "1998-08-26 00:00:00",
              "EquipmentTested": "Reactor",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-06-01 00:00:00",
              "AuditCompletionDate": "1999-07-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-06-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 19208,
                  "PreventionProgram3ID": 13534,
                  "ProcessChemicalID": 31374
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 17390,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-15 00:00:00",
    "ERTrainingDate": "1999-05-15 00:00:00",
    "CoordinatingAgencyName": "Richland County LEPC",
    "CoordinatingAgencyPhone": "8036919000",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 17390,
      "SummaryText": "bromine feed and process systems (piping, valves, reactor), safety systems (secondary containment, bromine vapor scrubber), and related equipment and instrumentation.  The Kings Laboratory, Inc. plant site is restricted to authorized personnel.\n\n3.  Worst-case release scenario and the alternative release scenario: \n\nThe worst-case release scenario is defined by EPA as the release of the maximum quantity of a regulated substance from a process vessel or pipe line failure that will result in the greatest distance to the designated endpoint.  The probability of the release occurring is not considered, it is just assumed to happen.  The worst-case bromine release scenario at Kings Laboratory, Inc. involves a catastrophic failure of the bromine storage tank and the predicted release of 56,000 pounds of bromine to a secondary containment.  The pooled bromine would then be subject to evaporation and release to the atmosphere.  The plant's passive mitigation (containment dike) was considered in this scenario.  The offsite consequence analysis for this scenario was performed following conditions pre-defined by EPA, namely bromine toxic endpoint of 0.0065 mg/l (i.e., the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individuals ability to take protective action), and worst-case weather conditions (i.e., stable atmospheric conditions and a wind speed of 1.5 m/s).  The DEGADIS+ computer model was used to perform this consequence analysis.  The results of the consequence analysis performed for the hypothetical worst-case bromine release scenario did predict an offsite impact.\n\nEPA describes the alternative release scenario as simply a more realistic release than the worst-case release or a release that is more likely to occur than the worst-case release.  The alternative release scenario chos"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17390,
      "SummaryText": "en for Kings Laboratory, Inc. involves a complete failure of a reactor discharge valve resulting in the predicted release of 4,200 pounds of bromine to a containment structure.  The alternative bromine release scenario chosen for the Kings Laboratory, Inc. was selected based on the results of a qualitative risk analysis of possible release alternatives.  The offsite consequence analysis for this scenario incorporated  less stable weather conditions (i.e., Stability D and wind speed of 3.0 m/s) and passive mitigation (i.e., containment sump).  The DEGADIS+ computer model was used to perform this consequence analysis.  The results of the consequence analysis performed for the hypothetical alternative bromine release scenario did predict an offsite impact.\n\nWhile EPA requires analysis of the consequence of a worst-case release scenario, worst-case scenarios as defined by the EPA have an extremely low probability of occurrence.  The worst-case release could only happen if the majority of the safety and technology features in use failed at the same time. Additionally, it would have to occur at exactly the time the worst-case weather conditions also existed, a most improbable event.  However, there is no allowance in the EPA Risk Management Program (RMP) rule for making an adjustment to the worst-case release scenario conditions.  For this reason, the alternative release scenario should be the focus of prevention and preparedness efforts.  \n\n4.  General accidental release program and the chemical-specific prevention steps:\n\nKings Laboratory, Inc. complies with EPA's RMP rule, OSHA's Process Safety Management standard (29 CFR 1910.119), and with all applicable state and local codes and regulations.  The bromination process was constructed, and is operated, in accordance with recommendations of the bromine supplier and manufacturers of the bromine process equipment.  The Kings Laboratory, Inc. accidental release prevention program is based on the following key elements:"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 17390,
      "SummaryText": "High level of training for operators and maintenance personnel\n \t Equipment inspection, testing, and preventive maintenance\n \t Use of industry standard process and safety equipment\n \t Use of accurate and effective operating procedures\n \t Performance of hazard review of equipment and procedures\n \t Implementation of an internal and external auditing program\n \t Segregation of chemical processes for compatibility and fire prevention/control\n \t Bromine vapor scrubber system\n \t Secondary containment systems\n \t Availability of SCBAs and bromine neutralization materials\n \t Maintenance of approved parts inventory\n\n5.  Five-year accident history:\n\nThe Kings Laboratory, Inc. has had an excellent record of preventing accidental releases over the past five years.  Due to the effectiveness of the  release prevention program, there have been no accidental releases of bromine during the past five years.\n\n6.  Emergency Response Program:\n\nKings Laboratory, Inc. has an emergency preparedness plan that is integrated with the LEPC plan.  Kings Laboratory, Inc. maintains in-house spill response capabilities (HAZMAT Team) to provide emergency response in the event of a bromine spill.  The plant HAZMAT TEAM operates in accordance with the requirements of OSHA standard 1910.120.  The plant emergency response plan includes procedures for the activation of the plant HAZMAT Team as well as notification of the LEPC, SCDHEC, and the public along with a discussion of actions to be taken in the event of a bromine spill.  The plan also addresses first aid and medical treatment.\n\n7.  Planned changes to improve safety:\n\nThe Process Hazard Analysis (PHA) was updated in June 1999 and it resulted in recommendations for minor changes (clarification) to the written SOPs, prevention program, and management of change procedure.  No process changes were recommended."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 17390,
      "SummaryText": "Kings Laboratory, Inc.\n\n1.  Accidental release prevention and emergency response policies:\n\nThe Kings Laboratory, Inc. accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices.  Accidental release prevention is a function of the safety devices (technology) inherent in the facility design, safe material handling practices used (procedures), and commitment to training of plant employees (management practices).  All applicable requirements of the U.S. Environmental Protection Agency (EPA) Risk Management Prevention Program (40 CFR 68.65-87) are adhered to.  It is the goal of Kings Laboratory, Inc. to ensure plant and community safety through an aggressive program of hazard analysis, preventive maintenance, equipment testing, standard operating procedures, and employee training.\n\nThe Kings Laboratory, Inc. emergency response policy involves the preparation of an emergency response plan which is tailored to the facility and to the emergency response services available in the community.   The emergency response program includes procedures for activation of the Kings Laboratory, Inc. HAZMAT Team and notification of the Richland County LEPC (community response plan) and SCDHEC (state response plan).  The Kings Laboratory, Inc. emergency response program is based upon recommendations of the Chemical Manufacturers Association and is in compliance with the EPA Risk Management Emergency Response Program (40 CFR 68.90) requirements.\n\n2.  Stationary source and regulated substances handled:\n\nThe regulated substance handled and used at Kings Laboratory, Inc. is bromine.  The maximum intended inventory of bromine at the facility at anytime is 56,000 pounds. \n\nKings Laboratory, Inc. is a manufacturer of fine and specialty chemicals.  Kings Laboratory, Inc. bromination products are used as intermediates throughout the chemical industry. The bromination process includes bromine receiving and storage facilities,"
    }
  ]
}