{
  "FacilityID": 17401,
  "FacilityName": "Kraft Foods Inc.",
  "FacilityStr1": "2504 Industrial Road",
  "FacilityStr2": null,
  "FacilityCity": "Kirksville",
  "FacilityState": "MO",
  "FacilityZipCode": "63501",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29001",
  "LEPC": "Adair County LEPC",
  "FacilityLatDecDegs": "40.19",
  "FacilityLongDecDegs": "-92.58",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 39010590,
  "ParentCompanyName": "Kraft Foods Inc.",
  "Company2Name": "Phillip Morris Inc.",
  "CompanyDUNS": 39010590,
  "Company2DUNS": 6105266,
  "OperatorName": "Kraft Foods Inc.",
  "OperatorStr1": "Three Lakes Drive",
  "OperatorStr2": null,
  "OperatorCity": "Northfield",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60093",
  "OperatorZipCodeExt": null,
  "FTE": 385,
  "OtherEPAFacilityID": "MOD006203202",
  "EPAFacilityID": "100000158241",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "6/1/94",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-09-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-09-03 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-08-31 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.21913,
  "FRS_Long": -92.59185,
  "FRS_Description": null,
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 24486,
      "AltID": "Plant Refrigeration",
      "FacilityID": 17401,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 31400,
          "ProcessID": 24486,
          "ChemicalID": 56,
          "Quantity": 41700.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 25112,
          "ProcessID": 24486,
          "NAICSCode": "311612",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 13554,
              "Process_NAICS_ID": 25112,
              "SafetyReviewDate": "1994-05-01 00:00:00",
              "PHA_Date": "1997-03-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "PHA Document located at the plant in Kirksville",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Trained operators on site 24 hours a day 7 days a week.",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1994-02-01 00:00:00",
              "TrainingReviewDate": "1994-02-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1993-12-01 00:00:00",
              "EquipmentInspectionDate": "1993-12-01 00:00:00",
              "EquipmentTested": "System, Compressors, Evaporative Condensers",
              "ChangeMgmtDate": "1997-02-01 00:00:00",
              "ChangeMgmtReviewDate": "1994-03-01 00:00:00",
              "PreStartupReviewDate": "1997-03-01 00:00:00",
              "ComplianceAuditDate": "1996-07-01 00:00:00",
              "AuditCompletionDate": "1997-07-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1994-05-01 00:00:00",
              "HotWorkPermitReviewDate": "1997-04-01 00:00:00",
              "ContractorSafetyReviewDate": "1997-02-01 00:00:00",
              "ContractorSafetyEvalDate": "1996-08-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 19230,
                  "PreventionProgram3ID": 13554,
                  "ProcessChemicalID": 31400
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 17401,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-01 00:00:00",
    "ERTrainingDate": "1999-03-18 00:00:00",
    "CoordinatingAgencyName": "Kirksville Fire Department",
    "CoordinatingAgencyPhone": "6606653734",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 17401,
      "SummaryText": "ease in pounds is grouped in the following way:\n\n1.\tReceivers #1 and #2 = 4,802 pounds\n2.\tCondensers #1 - #8 = 2,642 pounds\n3.\tLiquid Transfers Units AHD and ALD = 129 pounds\n4.\tInterconnecting pipework = 360 pounds\n\nTotal Ammonia Released = 7,933 pounds\n\nUnder Section 68.25(c)(1), a regulated substance such as ammonia that is normally a gas at ambient temperature and handled as a liquid under pressure shall be considered to be released as a gas over a 10 minute period.  Thus,  ammonia\u0012s physical state in the worst-case release is a gas.  Passive mitigation controls were not applicable to the worst-case release at this plant.\n\n \tThe Model Risk Management Program and Plan for Ammonia Refrigeration (look-up tables - Table 2-1) was used to obtain the distance to toxic endpoint which is 1.6 miles.  Rural dispersion coefficients were used.  \n\n \tThe estimated affected residential population is 6,900 people.  The types of affected receptors are listed in the Data Elements section.\n\n \tAlternative Release Scenario - This scenario is more likely to occur than the worst-case release.  In Kraft\u0012s case the alternative release scenario is caused by the failure/blowing of  a relief valve.  The release rate of ammonia due to the relief valve failure is calculated to be 118 lb/min.\n\n \tTable A-1 was used to determine the distance to toxic endpoint.  An interpolation was made between the 100 lb/min and 150 lb/min release rate. The distance to toxic endpoint is 1,100 feet (0.2 miles).\n\n \tThe estimated affected residential population is 5 people.  Only residences will be affected by a PRV release. \n\n4.0\tGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nKraft Foods has developed an OSHA PSM  program for  the ammonia refrigeration system.  At Kraft, ammonia falls under the RMP Program 3 prevention program which is identical to the OSHA PSM program.  EPA has said that if the process is in compliance with OSHA PSM, then it is in compliance with RMP Progra"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 17401,
      "SummaryText": "m 3.  Thus, Kraft\u0012s ammonia PSM has been reviewed and determined to be complete for the RMP document.  \n\nThere are several aspects of the prevention program that are key:\n\n1.\tThe Utility Service Area (USA) serves as an excellent safeguard for plant personnel because it greatly reduces the amount of ammonia piping inside the occupied rooms.  Also, since most of the pipework is out of the way of people and the machinery, there is less of a chance of a ammonia release.\n\n2.\tThe plant  maintains good training, certification and employee awareness of operating procedures.\n\n5.0\tFive-year Accident History\n\nThe review of Kraft Food\u0012s accident history includes the following range of dates: June 22, 1994 - June 21, 1999.  To date, there have been no accidents with ammonia at the facility.  \n\n6.0\tEmergency Response Program\n\nAs mentioned earlier, the Kraft facility has developed an emergency response program in which plant employees are divided into various response teams. There are nine in-plant contacts for an emergency which can be found in the Emergency Response Plan. There are also back-up personnel in the event that the primary incident response personnel cannot be contacted.  The emergency response plan includes information about the frequency of employee emergency response training as well as a detailed description of the training content.   There are also specific procedures to follow in the event of an ammonia emergency.  \n\nAt the discretion of  the Incident Commander, the Kirksville Fire Department will be called to provide back-up emergency responders and equipment.   The Kirksville Fire Department will be called for fire related emergencies.  In all cases where the fire department is called, Adair County Ambulance District personnel will be called to the scene.\n\n7.0\tPlanned Changes to Improve Safety\n\nBased on the  PHA completed for ammonia, a list of action items were developed and monitored to determine if implementation was accomplished.  For example, in the ammon"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 17401,
      "SummaryText": "ia system, a leak from condenser fittings, piping, valves or other instrumentation is a potential release scenario.  The following action item was recommended: implement visual inspection program on piping systems.  The recommendations were followed and the condenser inspection system was updated on 9/5/94.  There are numerous other examples of safety improvements as a result of the PHA results.  These include:\n\n1.\tNeed to post signs in appropriate locations that unauthorized personnel are not permitted in the engine room nor the USA areas.  (Implemented, 4/97)\n\n2.\tA hand truck will occasionally enter the engine room to move oil drums.  Proper awareness of hazards is required.  Only authorized personnel should be permitted to do this.  (Implemented, 4/97)\n\n3.\tProduction personnel currently enter the engine room to turn evaporators on and off.  These people need to be properly trained and certified in the operation of the ammonia system or this function should only be performed by the refrigeration system operators.  (Implemented, 3/94)"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 17401,
      "SummaryText": "KRAFT RISK MANAGEMENT PROGRAM DOCUMENT\n\nThis document contains all required information in order to meet 40 CFR 68 \u0013Risk Management Program\u0014 including an Executive Summary and RMP data elements (68.155 through 68.185).  \n\nEXECUTIVE SUMMARY\n\n1.0\tRelease Prevention and Emergency Response Policies\n\nThe Kraft Foods facility in Kirksville, Missouri has an excellent record in preventing releases of anhydrous* ammonia. The Kraft Foods facility has a thorough emergency training program for on-site emergency responders.  The facility has implemented the  MUSCLE system which is a system that uses a real time data base to track training and inspection dates and issue reminders to responsible groups.  As part of the MUSCLE program, an annual audit is carried out by the Technical Services Group.\n\nThe emergency response policies at the Kraft facility ensure that there is emergency response coverage 24 hours - 7 days per week.  There are also adequate provisions for coordination with outside agencies, such as with the Kirksville Fire Department, in the event of an emergency.\n\n*From this point in the Executive Summary, anhydrous ammonia will be synonymous with ammonia.\n\n2.0\tProcess Description and Regulated Substances\n\nKraft Foods is a manufacturer of meat products. The NAICS code for the  primary process at this facility is 311612.   The facility is capable of producing and packaging various ham and bacon products for consumer intake but the plant is not equipped to slaughter hogs.  Many areas of the plant are refrigerated to preserve the meat products.  \n\nKraft Foods has a regulated substance under 40 CFR 68: ammonia.  Ammonia is used as a refrigerant in the refrigeration of the meats in the various areas.\n\nThe  ammonia threshold for triggering applicability to 40 CFR 68 is 10,000 pounds. The quantity of ammonia  stored on-site is approximately 42,5006 pounds. Thus, 40 CFR 68 is applicable to Kraft Foods in Kirksville.\n\n3.0\tWorst-case and Alternative Release Scenarios\n\nAlthough t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17401,
      "SummaryText": "here are quality and safety systems in place at Kraft's Kirksville plant, a relaease from the ammonia refrigeration system could potentially affect employees on-site and the general public offsite. USEPA requires companies to use models for worst case and alternative release scenarios for each regulated chemical. Given the safety precautions at the plant, both scenarios are unlikely to occur. If a release occured, the alternative scenario would be more likely.\n\nAmmonia is classified as a Group 2 Refrigerant per ASHRAE Standard 34-1989.  The dominant characteristic of this chemical is its toxicity.  It is a self-alarming chemical by its distinctive pungent odor.  Due to this odor, persons exposed to ammonia vapor will not voluntarily stay in areas of even small concentrations.  Ammonia will burn in a very narrow and high range of concentration with a high ignition temperature.  It is not poisonous, but it is corrosive to human tissue.  Ammonia is readily absorbed into the moisture of the skin and, at high concentrations, can cause severe burns.\n\nThe risks to persons in an accidental release of ammonia include:\n\n1.\tCorrosive attack of skin and other tissue\n2.\tFreezing of skin and other body tissue when contacted by liquid ammonia\nBelow is a description of the release scenarios for ammonia and their off-site consequences:\n\n \tWorst-case scenario - the largest potential release of ammonia will occur with a puncture in one of the receivers located on the south side of the plant approximately 50 feet from the fenceline.  Because of interconnecting pipework and other vessels that can discharge into this pipework, the amount of ammonia released will be greater than amount stored in one of the receivers.  The connected \u0013other\u0014 vessels include the condensers (eight) and the liquid transfer units.  The low and high temperature accumulators are connected to the receivers through pipework; however, the accumulators cannot discharge ammonia into the receivers.  The ammonia rel"
    }
  ]
}