{
  "FacilityID": 17496,
  "FacilityName": "Portland Wastewater Treatment Plant",
  "FacilityStr1": "500 Marginal Way",
  "FacilityStr2": null,
  "FacilityCity": "Portland",
  "FacilityState": "ME",
  "FacilityZipCode": "04103",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "23005",
  "LEPC": "Cumberland County LEPC",
  "FacilityLatDecDegs": "43.672944",
  "FacilityLongDecDegs": "-70.263056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "www.pwd.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Portland Water District",
  "Company2Name": null,
  "CompanyDUNS": 61002440,
  "Company2DUNS": null,
  "OperatorName": "Portland Water District",
  "OperatorStr1": "225 Douglass Street",
  "OperatorStr2": null,
  "OperatorCity": "Portland",
  "OperatorStateFIPS": "ME",
  "OperatorZipCode": "04104",
  "OperatorZipCodeExt": "3553",
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000161665",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Wastewater treatment",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-09-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-19 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-08-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2006-10-17 00:00:00",
  "DeRegistrationEffectiveDate": "2006-05-01 00:00:00",
  "AnniversaryDate": "2004-08-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 43.673684,
  "FRS_Long": -70.255584,
  "FRS_Description": null,
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 24658,
      "AltID": "Wastewater Treatment",
      "FacilityID": 17496,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 31675,
          "ProcessID": 24658,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 31676,
          "ProcessID": 24658,
          "ChemicalID": 49,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 25284,
          "ProcessID": 24658,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 13661,
              "Process_NAICS_ID": 25284,
              "SafetyReviewDate": "1998-07-17 00:00:00",
              "PHA_Date": "1998-05-19 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-03-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Installation of automatic valve actuators on chlorine and sulfur dioxide cylinders is scheduled for 1999.  Valve actuators will be linked to chlorine and sulfur dioxide sensors in the process.",
              "OpProceduresReviewDate": "1999-05-14 00:00:00",
              "TrainingReviewDate": "1999-05-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-14 00:00:00",
              "EquipmentInspectionDate": "1997-10-06 00:00:00",
              "EquipmentTested": "Chlorinators",
              "ChangeMgmtDate": "1999-04-27 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-14 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-14 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-14 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-05-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 19409,
                  "PreventionProgram3ID": 13661,
                  "ProcessChemicalID": 31675
                },
                {
                  "PrimaryKey": 19410,
                  "PreventionProgram3ID": 13661,
                  "ProcessChemicalID": 31676
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 17496,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-27 00:00:00",
    "ERTrainingDate": "1998-12-13 00:00:00",
    "CoordinatingAgencyName": "Portland Fire Dept.",
    "CoordinatingAgencyPhone": "2078748400",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17496,
      "SummaryText": "Risk Management Plan\nExecutive Summary \nPortland Water District\nWastewater Treatment Plant\nPortland, Maine\n\n\nI. Executive Summary\n\nA. Accidental Release Prevention and Emergency Response Policies \n\nPortland Water District (PWD) is committed to operating its wastewater treatment plant in Portland, Maine in an environmentally responsible manner and to providing a safe work place for its employees and the surrounding community.  As part of this commitment to environmental stewardship and worker safety, PWD has developed and implemented numerous environmental and safety programs that are designed to eliminate and/or drastically reduce the potential for accidental releases.  PWD has also developed and implemented a number of programs that are designed to ensure that if an accidental release occurs, it will be handled in a manner that minimizes adverse impact to people, the environment and the plant.  Many of these programs have been in place for some time. \n\nPWD views accident prevention, and personnel and environmental protection as a continuous process.  Consequently, PWD continuously strives to improve its accident prevention, environmental protection and emergency response programs.  A recent addition to PWD\u0012s overall accident prevention and response program is the development of  its Risk Management Program.  PWD\u0012s Risk Management Program (RMP) complies with the U.S. Environmental Protection Agency\u0012s (\"EPA\u0012s\") Chemical Accident Prevention rule found at 40 C.F.R. Part 68.  One of the requirements of this rule is to submit a Risk Management Plan.  This document is PWD\u0012s RMP plan and provides the public with information about PWD\u0012s processes, accident prevention programs and emergency response planning efforts.   PWD\u0012s compliance with EPA\u0012s RMP rule includes:\n\n1. Completion of a hazard assessment in compliance with 40 C.F.R. Part 68, Subpart B, including the five-year accidental release history--PWD has never experienced an RMP reportable release or accident at its Por"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17496,
      "SummaryText": "tland Wastewater Treatment Facility.   \n2. Implementation of a accident prevention program.  The plant\u0012s RMP accident prevention program is coordinated with the plant\u0012s Process Safety Management (PSM) program which was developed under similar rules administered by the Occupational Safety and Health Administration \"OSHA\";\n3. Implementation of an emergency response program.  As recommended in the RMP rule and by numerous federal response entities, the plant has developed a single response plan that is designed to meet the emergency response planning requirements, applicable to the plant under a number of applicable state and federal emergency response planning laws. \n\nAdditional information regarding how PWD addresses each of these requirements is provided below and in the attached RMP plan.\n\nWhile the RMP program at PWD helps ensure that the facility is maintained and operated in a safe and environmentally responsible manner, it is just one component of PWD\u0012s comprehensive safety and environmental programs.  Additional components that are beyond the scope of the RMP include, but are not limited to: regular employee/contractor safety training, periodic table-top safety and emergency response drills, acquisition and maintenance of emergency response and personnel protective equipment, development of safe work practices (confined space, lockout/tagout, hot work), implementation of safe work procedures, new project safety review procedures, preventive maintenance and regular inspections of all tanks and equipment that contain hazardous chemicals, chemical control and purchasing procedures, medical emergency response training, contractor certification, etc. \n\nThe plant and all equipment is designed and operated to minimize the possibility of an accidental release.  At a minimum, the plant and equipment meet government and industry design and construction standards.\n\nThe following most recent process changes and safety initiatives demonstrate PWD\u0012s commitment to environmen"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17496,
      "SummaryText": "tal stewardship and providing a safe workplace:\n\n1.  In 1999, the Portland wastewater treatment facility will install valve actuators on its chlorine and sulfur dioxide tanks.  These actuators automatically seal chlorine or sulfur dioxide tanks in the event of a leak or break in the whip assembly, which delivers chlorine and sulfur dioxide from the tanks to the evaporator room.\n \n2.  In 1998 and 1999, PWD integrated  all of its emergency response and accident prevention plan into a single, easy to use Integrated Contingency Plan (ICP).  The ICP is designed to provide more-effective emergency response guidance and to comply with a number of state and federal laws.  \n\n \n  \nB.  RMP Covered Stationary Source and Regulated Substance\n\nPWD owns and operates the Portland Wastewater Treatment Facility in Portland, Maine.  The plant treats waste water from the city of Portland and septic water from several adjacent towns.  The only chemicals present at the plant in sufficient quantities to be regulated by the chemical accident prevention rule are chlorine and sulfur dioxide.  Chlorine is used to disinfect the wastewater.  Sulfur dioxide is subsequently used to dechlorinate the wastewater before it is discharged into Casco Bay pursuant to the Clean Water Act permit.\n\nChlorine is stored in 2,000 lb. tanks within the chlorine scale room.  The chlorine scale room is equipped with chlorine detectors which sound an alarm in the event of an accidental release of chlorine.  Valve actuators will be installed to seal off the 2,000 lb. tank in the event of any chlorine leak in the water treatment process.\n\nSulfur dioxide is stored in 2000 lb. tanks within the sulfur dioxide scale room.  The sulfur dioxide scale room is equipped with detectors which sound an alarm in the event of an accidental release of sulfur dioxide.  Valve actuators will also be installed to seal off the sulfur dioxide tanks in the event of any sulfur dioxide leak in the water treatment process.\n\nThe total maximum am"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 17496,
      "SummaryText": "ount of chlorine stored on-site is 32,000 lbs. (16 tanks).  The maximum amount of chlorine used at any one time in the chlorination process is 8,000 lbs.  The total maximum amount of sulfur dioxide stored on-site is 16,000 pounds.  The maximum amount of sulfur dioxide used at any one time in the dechlorination process is 8,000 pounds.\n\nC. Off-site Consequence Analysis\n\nAs required by the RMP rule, PWD\u0012s off-site consequence analysis included evaluation of a worst-case accidental release for all toxic chemicals and an alternative release for each covered chemical.\n\nA worst-case release is defined by EPA as \"a release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to an endpoint defined in ' 68.22.\"  40 C.F.R. ' 68.3.   EPA requires the worst-case accidental release to be modeled using highly conservative meteorological data designed to result in the maximum possible adverse impact.  For example, EPA requires worst-case models to be based on the hottest day of the year, occurring at night with a very slow, steady wind which would not disperse a release very effectively. Further, the model assumes that the entire contents of the largest vessel is released instantaneously.  According to the Chlorine Institute, no 2,000 lb. chlorine tank has ever released its contents in ten minutes.  Accordingly, the probability of a 2,000 lb. tank of chlorine instantaneously releasing its contents in Maine on a 960F night when the wind is blowing at 3.4 miles per hour is extremely low.\n\n\nUsing the EPA mandated criteria described above, the worst-case release at the plant (for purposes of RMP) would involve a complete failure of a 2,000 lb. chlorine tanks, filled to maximum capacity.  If such a release occurred, it would result in a vapor cloud that could impact persons outside of the plant\u0012s property line.\n\nPWD developed alternative releases of chlorine and sulfur dioxide that focus on more realistic release"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 17496,
      "SummaryText": "scenarios occurring during more common meteorological conditions.  However, EPA requires modelling of a release which could impact off-site locations. After considering all criteria in the RMP rule, the Process Hazard Analysis performed on the chlorination and dechlorination processes, and all past releases, PWD has chosen an alternative release for chlorine and an alternative release for sulfur dioxide.  Each scenario involves a pinhole leak in the storage tanks.\n\nThe alternative release scenarios for chlorine is based on a pinhole leak from a 1/16\" hole in one chlorine tank.  Chlorine would exit from such a leak as a liquid, gas or as an aerosol.  The liquid portion of the leak would vaporize into a gas almost immediately.  The chlorine gas would then migrate based on meteorological conditions.  PWD has never had a pinhole leak in any of the chlorine tanks in the past.\nHowever, because actuators on the tanks would prevent a release resulting from a whip assembly failure from leaving the site, the pinhole leak appeared to be the most likely scenario.\n\nThe alternative release scenario for sulfur dioxide is identical to the scenario described for the chlorine release.  Since the physical and chemical properties of sulfur dioxide are different that those of chlorine, the migration of this compound off-site would be not be identical to that of chlorine.  There has also never been a pinhole leak in any of the sulfur dioxide tanks in the past.  \n\nD. Accident Release Prevention Program\n\nPWD has developed an accidental release prevention program that is designed and implemented to drastically reduce the possibility of an accidental catastrophic release.   The program complies with the requirements of OSHA\u0012s Process Safety Management rule found at 29 C.F.R. Part 1910.119 and is analagous to RMP requirements found at 40 C.F.R. Part 68, Subpart D.  The program has been very successful as evidenced by the fact that the plant has never experienced an accidental release that req"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 17496,
      "SummaryText": "uires reporting under EPA\u0012s RMP rule.  See 40 C.F.R. ' 68.42.  To comply with the RMP rule, the plant has taken its existing PSM program and incorporated an additional focus\u0017protection of the public.  \n\nThe basic elements of PWD\u0012s prevention program are described below: \n\n1. Employee Participation.  PWD has developed and implements a written plan of action regarding employee participation in the safety and accident prevention process.  The plan describes how employees are:  (A)  consulted and what input they will have in the development of process hazard analysis (PHA) and other PSM and RMP safety elements; and (B) given access to PSM and RMP information at the plant.   \n\n2. Process Safety Information.  PWD has compiled written process safety information which helped identify the hazards posed by chlorine and sulfur dioxide, handling of materials, management, storage activities and the chlorination and dechlorination processes in general.  The compilation of process safety information provided the foundation for understanding the hazards involved in the wastewater  process and was crucial to the development of a complete and thorough process hazard analyses (discussed in subsection 3 immediately below).  The required process safety information includes information pertaining to the hazardous chemicals (e.g. chlorine and sulfur dioxide), the technology of the process, and the process equipment.   29 C.F.R. ' 1910.119(d). \n\nThe type of information pertaining to the technology of the process includes: (1) simplified process flow diagrams; (2) process chemistry; (3) maximum intended inventory; (4) safe upper and lower limits for temperature, pressure, flow and composition; and (5) an evaluation of the consequences of deviations, including those affecting the safety and health of employees and the nearby public.  \n\nThe equipment information includes: (1) materials of construction; (2) piping and instrument diagrams (P&IDs); (3) electrical classification; (4) relief syste"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 17496,
      "SummaryText": "m design and design basis; (5) ventilation system design; (6) design codes and standards employed; and (7) material and energy balances for processes built after May 26, 1992.\n\n3. Process Hazard Analyses.  PWD performed its most recent process hazard analysis (PHA) on the chlorination and dechlorination systems in 1998.  The PHA is a key component of the  process safety management system and PWD\u0012s RMP accident prevention program.  It provided a thorough, orderly, systematic approach for identifying, evaluating, and controlling hazards posed by the chlorination and dechlorination processes.  The PHA utilized the what-if/PHA methodology in accordance with 29 C.F.R. ' 1910.119(e) and 40 C.F.R. ' 68.67.  \n\nThe PHA addressed: (1) hazards of the process; (2) engineering and administrative controls applicable to the hazards and their interrelationships such as appropriate application of detection methodologies to provide early warning of releases (e.g., process monitoring and control instrumentation with alarms); (3) consequences of failure of engineering and administrative controls; (4) facility siting; (5) human factors (human error); and (6) a qualitative evaluation of a range of the possible safety and health effects of failure of controls on the employees in the work place.\n\n4. Operating Procedures.  PWD has developed  and continues to develop and implement written operating procedures that provide clear instructions for safely conducting activities involved in the chlorination and dechlorination processes.  These procedures are consistent with the process safety information described in subtask 2:\n\nPWD has also developed and implements safe work practices that provide for the control of hazards during operations.  For example, PWD has programs that govern the following activities:  lockout/tagout; confined space entry; opening process equipment or piping; and control over entrance into PSM and RMP covered portions of the plant by maintenance, contractor or other supp"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 17496,
      "SummaryText": "ort personnel.\n\n5.  Training.  PWD provides employees, contractors and visitors with training that focuses on the special safety and health hazards posed by the plant operations, RMP and PSM covered processes, emergency operations including shutdown, and safe work practices applicable to the employees job tasks.  PWD confirms that employees and contractors  involved in operating a covered process have successfully  completed the required training.  PWD documents that covered employees and contractors have received and understood the required training.  Documentation, at a minimum, includes the identity of\nthe employee or contract employee, the date of training, and the means used to verify that the employee understood the training.\n\n6.  Contractors.  As part of PWD\u0012s contractor selection process it obtains and evaluates\n       information regarding contract employer\u0012s safety performance and programs: (29 C.F.R. ' \n       1910.119(h).  PWD also: \n\nA. Informs contract employers of the known potential fire, explosion, or toxic release hazards related to the contractor\u0012s work and the process;\nB. Explains to contract employers the applicable provisions of the facility\u0012s integrated contingency plan (discussed below); and\nC. Develops and implements safe work practices to control the entrance, presence and exit of contract employers and contract employees in covered process areas.\n\n7. Pre-startup Safety Review.  PWD always confirms that prior to the introduction of highly hazardous chemicals to a new or existing RMP/PSM covered process, the process is constructed and the equipment is designed in accordance with specifications; and that appropriate safety, operating, maintenance, and emergency procedures are in place to adequately protect the health and safety of employees and the nearby public.\n\n8. Mechanical Integrity.  PWDis developing written procedures to maintain the ongoing integrity of the process equipment listed below.  PWD will train employees on the written proce"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 17496,
      "SummaryText": "dures that ensure that the following process equipment is maintained:\n\nA. Pressure vessel\u0012s and storage tanks;\nB. Piping systems (including piping components such as valves);\nC. Relief and vent systems and devices;\nD. Emergency shutdown systems;\nE. Controls (including monitoring devices and sensors, alarms, and interlocks); and\nF. Pumps.\n\n9. Hot Work Permit.  PWD implements a hot work permit program for all hot work operations (e.g., welding, soldering) conducted on or near any of the components involved in the chlorination or dechlorination processes.\n\n10. Management of Change.  PWD has established and implements written procedures to manage changes to process chemicals, technology, equipment, and procedures associated with the chlorination and dechlorination processes; and, changes to facilities that affect these processes.  These procedures ensure that the following considerations are addressed prior to any change:\n\nA. The technical basis for the proposed change;\nB. Impact of change on safety and health;\nC. Modifications to operating procedures;\nD. Necessary time period for the change; and\nE. Authorization requirements for the proposed change.\n\n11. Incident Investigation.  PWD investigates each incident which resulted in, or could reasonably have resulted in, a catastrophic release of a highly hazardous chemical in the workplace.  An incident investigation team is established and consists of at least one person knowledgeable in the process involved, including a contract employee if the incident involved work of the contractor, and other persons with appropriate knowledge and experience to thoroughly investigate and analyze the incident. \n\n12. Emergency Planning and Response.  PWD has developed an integrated contingency plan that satisfies all applicable state and federal emergency response and prevention planning requirements (described under emergency response policies below). \n\n13. Compliance Audits.  PWD will evaluate the wastewater treatment plant\u0012s complianc"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 17496,
      "SummaryText": "e with the PSM Standard and the RMP rule at least every three years to verify that the procedures and practices it has developed are adequate and being followed.  A report of the RMP and PSM audit findings will be developed. \n\n14. Trade Secrets.  PWD makes all necessary information available to those persons responsible for compiling process safety information and those assisting in the development of the process hazard analysis.\n\nE. Five Year Accident History\n\nThe Portland plant has never experienced a release that requires reporting under the chemical accident prevention rule.\n\nF. Emergency Response Procedures and Policies\n\nPWD\u0012s wastewater treatment plant employees have been trained to control \"non-emergency\" incidents such as small, incidental spills and leaks.  Employees have been trained on confined space entry procedures and the proper use of personal protection equipment (PPE).  In the event of small fires, all plant employees are trained in the use of fire extinguishers.  Personnel have also been trained to notify the plant manager in the event of more extensive accidental releases.  The plant manager is responsible for assessment of the extent of the release, internal notification of the release and determination of whether or not outside responders are needed.  During an emergency, all PWD employees have been trained to evacuate to a predesignated muster point to assist outside emergency response teams.\n\nIn the event that an accidental release occurs that is beyond the capabilities of PWD\u0012s wastewater treatment plant employees to control, the plant depends on the the Portland Fire and Police Departments, and Med-Cu ambulance services for outside support.  The Portland Fire Department operates under mutual aid agreements with the cities of Westbrook and South Portland and with the towns of Cape Elizabeth, Falmouth, and Scarborough to ensure that additional  emergency response personnel and equipment are available to respond to an emergency release at the p"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 17496,
      "SummaryText": "lant.  In addition, PWD has an agreement with an outside contractor, Clean Harbors Inc., to provide emergency response services, if needed.\n\nPWD has also adopted and implements an Integrated Contingency Plan that meets the regulatory requirements of the following federal and state response planning and prevention laws:  \n\n7 OSHA Emergency Response Plan (29 C.F.R. 1910.120(q))\n7 OSHA Process Safety Management emergency response requirements (29 C.F.R. ' 1910.119(n))\n7 OSHA Hazard Communication Plan (29 C.F.R. ' 1910.1200(h))\n7 EPA Risk Management Plan Emergency Response Program (40 C.F.R. ' 68.95)\n7 EPA Hazardous Waste Contingency Plan (851 DEP Regs. ' 8(B)(5) incorporating by reference 40 C.F.R. ' 264.51-.56)\n7 EPA Oil Spill Prevention Control and Countermeasure Plan (40 C.F.R. ' 112.7)\n \n7 EPA Best Management Practices Plan (40 C.F.R. ' 112.104(b))\n7 Maine Emergency Response Plan (37-B M.R.S.A. ' 795)\n7 Maine Hazardous Matter Spill Prevention Control and Cleanup Plan (38 M.R.S.A. ' 1318-C). \n\nThe ICP includes, among other things:\n\n7 Procedures for notifying the public and the local emergency planning committee\n7 Arrangements for first-aid procedures and emergency medical treatment procedures for exposure to chlorine and sulfur dioxide\n7 Emergency response and incident termination procedures\n7 Procedures for using, inspecting and testing emergency response equipment\n7 Employee training procedures\n7 Procedures to amend the ICP plan \n \nG. Planned Changes\n\nThe Portland Water District plans to equip chlorine and sulfur dioxide tanks with emergency shut off actuators which would automatically close the tank and stop all releases other than pinhole leaks in the tank itself."
    }
  ]
}