{
  "FacilityID": 17514,
  "FacilityName": "West Bay Organics",
  "FacilityStr1": "6655 West Bay Road",
  "FacilityStr2": null,
  "FacilityCity": "Baytown",
  "FacilityState": "TX",
  "FacilityZipCode": "77520",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48071",
  "LEPC": "Baytown LEPC",
  "FacilityLatDecDegs": "29.744444",
  "FacilityLongDecDegs": "-94.925",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Dennis Hearn",
  "OperatorStr1": "6655 West Bay Road",
  "OperatorStr2": null,
  "OperatorCity": "Baytown",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77520",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000161683",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "O-01572",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-09-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-09-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-09-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2006-03-02 00:00:00",
  "DeRegistrationEffectiveDate": "2001-07-01 00:00:00",
  "AnniversaryDate": "2004-09-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 29.74442,
  "FRS_Long": -94.92207,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 24686,
      "AltID": "Commercial Unit",
      "FacilityID": 17514,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 31704,
          "ProcessID": 24686,
          "ChemicalID": 56,
          "Quantity": 34000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 31705,
          "ProcessID": 24686,
          "ChemicalID": 109,
          "Quantity": 172000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 25313,
          "ProcessID": 24686,
          "NAICSCode": "32519",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 13685,
              "Process_NAICS_ID": 25313,
              "SafetyReviewDate": "1999-08-20 00:00:00",
              "PHA_Date": "1999-08-20 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-07-28 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fire Water System",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-08-20 00:00:00",
              "TrainingReviewDate": "1999-07-31 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-31 00:00:00",
              "EquipmentInspectionDate": "1999-03-31 00:00:00",
              "EquipmentTested": "Pumps, Piping, Instruments",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-07-31 00:00:00",
              "PreStartupReviewDate": "1999-08-20 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-07-31 00:00:00",
              "HotWorkPermitReviewDate": "1999-01-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-03-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 19434,
                  "PreventionProgram3ID": 13685,
                  "ProcessChemicalID": 31704
                },
                {
                  "PrimaryKey": 19435,
                  "PreventionProgram3ID": 13685,
                  "ProcessChemicalID": 31705
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 17514,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Baytown Fire Department",
    "CoordinatingAgencyPhone": "2814205329",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17514,
      "SummaryText": "Accidental Release Prevention and Response Policies\n\nWest Bay Organics' commitment to the safety of workers and the public is illustrated by the resources invested in accident prevention, training personnel, and considering safety in the design, installation, operation, and maintenance of the chemical manufacturing unit.  Controls have been implemented to prevent foreseeable releases of regulated substances.  In the event of an accidental release, trained plant personnel in conjunction with the Baytown Fire Department and contracted Emergency Response Teams (ERTs) will respond to control and contain the release.  West Bay Organics does not have the resources necessary to be the sole responder to a catastrophic release.\n\n\nDescription of the Stationary Source and Regulated Substances\n\nWest Bay Organics' Baytown plant is located near Baytown in Chambers County, Texas.  It operates an organic chemical manufacturing plant to produce specialty chemicals.  Currently, the facility uses a catalytic distillation unit for the production of amines.  The plant uses anhydrous ammonia, which is a regulated toxic substance, as feed material.  It produces isopropylamine, a regulated flammable substance.  The anhydrous ammonia is received by the plant via tank trailers or trucks and stored at ambient temperature in two above-ground 12,000-gal pressure tanks.  The finished product, isopropylamine, is stored in above-ground 30,000-gal pressure tanks and shipped to customers via tank trailers or trucks. \n\n\nOff-site Consequence Analysis Results\n\nThe worst-case scenario (WCS) associated with a release of flammable substances in the Program Level 3 process at the chemical plant is a vapor cloud explosion (VCE) involving the full inventory of the largest vessel containing isopropylamine.  The maximum capacity of the vessel is 172,000 lb of isopropylamine.  It is assumed that the complete inventory is released and ignited, resulting in the VCE.  The maximum distance to the 1-psi endpoint fo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17514,
      "SummaryText": "r this WCS is 0.42 mile.  Although there are numerous controls to prevent such releases and to manage their consequences, no credit for passive mitigation measures was taken into account in evaluating this WCS.\n\nAn alternative release scenario (ARS) for the flammable substance, isopropylamine, is from shearing of a pipe attached to the storage tank.  This will result in a release of 45,700 lb isopropylamine over a 10-minute period.  The 10-minute release duration is the approximate time necessary for operators to detect and stop the release.  No other mitigation measures were taken into account in evaluating this scenario.  The maximum distance to the 1-psi endpoint for this ARS is 0.2 mile.\n\nThe WCS associated with a release of a toxic substance is a catastrophic storage tank failure resulting in a release of 34,000 lb of anhydrous ammonia gas over a 10-minute period.  Although there are numerous controls in place to prevent such an incident and to manage its consequence, no credit for administrative controls or passive mitigation measures was taken into account in evaluating this scenario.  The maximum distance to the toxic endpoint of 0.14 mg/L (milligrams per liter) for this WCS is 3.6 miles.  \n\nThe ARS for ammonia is from a transfer hose release due to split or sudden uncoupling.  All safety equipment will operate according to design, limiting the release to 300 lb of ammonia gas.  The maximum distance to the toxic endpoint of 0.14 mg/L for this ARS is 0.3 mile.  \n\n\nGeneral Accidental Release Prevention Program\n\nThe following is a summary of the accident prevention program that is being implemented at the plant.  Because the process at this plant, which is regulated by the Environmental Protection Agency's (EPA) Risk Management Program (RMP) regulation, is also subject to the Occupational Safety and Health Administration's (OSHA) process safety management (PSM) standard, this summary addresses each of the OSHA PSM elements and describes the management system in"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17514,
      "SummaryText": "place to implement the accident prevention program.\n\n\nEmployee Participation\n\nWest Bay Organics' employees are an essential part of the development and implementation of the PSM and conduct of the process hazard analyses programs.\n\nThe Work Place Safety Manual and Document Files were created to distribute to employees and to be accessed by others interested in the safety and health programs at West Bay Organics.  The employee training records and safety meeting documentation are also kept in these files.  The Work Place Safety Manual is an extensive volume of policies for health and safety at the plant.  The Encouragement of Suggestion Policy is stated throughout the handbook for continual improvement and understanding of safe and efficient work practices and involvement.\n\nThe Process Hazard Analysis (PHA) is conducted periodically by a team consisting of the Operations Manager, Operations Supervisor, and the Lead Operators.  This team of professionals has experience in both engineering and process operations.  As each process is analyzed, input from all sources are considered.\n\nAll records of health and safety, PHA and incident investigations are provided to all employees during safety meetings and as periodical handouts throughout the week.\n\n\nProcess Safety Information\n\nWest Bay Organics keeps a variety of technical documents that help maintain safe operation of the process.  These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis information.  Specific personnel are assigned responsibility for maintaining up-to-date process safety information.\n\nThe toxicity, permissible exposure limits, physical data, reactivity data, corrosivity data, thermal and chemical stability data, and hazardous effects of inadvertent mixing of different materials that could occur with the chemicals used in the process is provided in material safety data sheets (MSDSs).  This info"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 17514,
      "SummaryText": "rmation is supplemented, if necessary, by documents that specifically address known safety concerns and any known hazards.  For specific areas within the plant, West Bay Organics has documented safety-related limits for process-specific parameters (e.g., temperature, pressure, flow).  The plant ensures that the process is maintained within these limits using process controls and monitoring instruments, highly trained personnel, and protective instrument systems (e.g., automated shutdown systems, alarm systems).\n\nThe plant also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment.  This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\n\nProcess Hazard Analysis (PHA)\n\nWest Bay Organics has implemented a program to ensure that hazards associated with the process are identified and controlled.  Within this program, the process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\nWest Bay Organics primarily uses the hazard and operability (HAZOP) analysis technique to perform these evaluations.  HAZOP is recognized as one of the most systematic and thorough hazard evaluation techniques.  The analysis is performed by a team of people with expertise in engineering and process operations.  This team identifies and evaluates hazards of the process, as well as accident prevention and mitigation measures, and makes suggestions for additional prevention and/or mitigation measures when they believe such measures are necessary.\n\nThe PHA team findings are documented and are forwarded to and revie"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 17514,
      "SummaryText": "wed by the appropriate personnel.  All approved mitigation options in response to PHA team findings are documented, and actions taken or not taken are recorded and retained.\n\nTo ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the plant will periodically update and revalidate the hazard analysis results.  These periodic reviews will be conducted at least every 5 years until the process is no longer operating.  The results and findings from these updates will be documented and retained.  The team findings will be forwarded to appropriate personnel for consideration, and the final resolution of the findings will be documented and retained.\n\n\nOperating Procedures\n\nWest Bay Organics has developed and implemented written operating procedures that provide clear instructions for safely conducting activities involved in each covered process.  Steps that are covered in the written procedures are:  unit startup, normal operation, temporary operation, emergency shutdown, emergency operation, normal shutdown, and initial startup of a new process.  These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.  These procedures are periodically reviewed and annually certified as current and accurate.  \n\n\nTraining\n\nWest Bay Organics has implemented a training program for all employees involved in operating the process.  The training includes specific safety and health hazards, emergency operations including shutdown, and safe work practices applicable to the employee's job tasks.  In addition, refresher training on the operating procedures will be provided every 3 years to ensure that the skills and knowledge are maintained at an acceptable level.  All training activities are documented, including the means used to verify that the operator understood the training.\n\n\nContractors\n\nWest Bay Organics uses contractors to supplemen"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 17514,
      "SummaryText": "t its work force during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipment, the plant has procedures in place to ensure that contractors perform the work in a safe manner, have the necessary knowledge and skills, are aware of the hazards in their workplace, understand what they should do in the event of an emergency, understand and follow site safety rules, and inform plant personnel of any hazards that they find during their work.  This is accomplished by providing contractors with a process overview, information about safety and health hazards, emergency response plan requirements, and safe work practices prior to their beginning work.  In addition, West Bay Organics evaluates contractor safety programs and performance during the selection of a contractor.  West Bay Organics will periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\n\n\nPre-startup Safety Review (PSSR)\n\nWest Bay Organics will conduct a PSSR for any modification when the modification is significant enough to require a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup.  This review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready.  The PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\n\n\nMechanical Integrity\n\nWest Bay Organics has established and implemented written procedures to maintain the on-going integrity of the process equipment including pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition.  Inspec"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 17514,
      "SummaryText": "tions and testing of pressure safety valves, corrosion, leaks and calibrations will follow recognized and generally accepted good engineering practices.  Frequency will be consistent with manufacturer's recommendations identified in the equipment manuals.  Inspection/training logs are maintained for all equipment.  Equipment deficiencies will be identified and equipment will be repaired or replaced.\n\nQuality assurance of new equipment is performed with the appropriate checks and inspections to assure equipment is installed properly and consistent with design specifications and manufacturers' instructions.  Spare parts, maintenance materials and equipment will be suitable for all process applications as per manufacturers' and West Bay Organics' specifications. \n\n\nHot Works Permits and Other Safe Work Practices\n\nWest Bay Organics employs safe work practices to help ensure worker and process safety.  Examples of these include:  control of the entry/presence/exit of support personnel, a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, a procedure for safe removal of hazardous substances before process piping or equipment is opened, a permit and procedure to control spark-producing activities (i.e., hot work), and a permit and procedure to ensure that adequate precautions are in place before entry into a confined space.  These practices form a system that ensures that operations and maintenance activities are performed safely.\n\n\nManagement of Change (MOC)\n\nThe Operations Manager is responsible for establishing and implementing written procedures to manage changes to process chemicals, technology, equipment, and procedures and changes to the plant that affect a covered process.  The procedures will include the following information:  the technical basis for the proposed change, the impact of the change on safety and health, modifications to operating procedures, necessary time period for the change, and authorization req"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 17514,
      "SummaryText": "uirements for the proposed change.\n\nAll employees involved in the change will be notified in writing and, if necessary, trained for the process change prior to the change.  All process health and safety documents will be updated accordingly.\n\n\nIncident Investigation\n\nWest Bay Organics will investigate each incident that resulted in, or could reasonably have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident.  The investigation will be initiated as soon as possible, but no later than 48 hours after the incident.  The Operations Manager has the responsibility and knowledge of the process to conduct the investigation.  If the incident involved a contractor, a knowledgeable representative of the contractor will assist in the investigation.\n\nThe Operations Manager documents its findings, develops recommendations to prevent a recurrence, and forwards these results to the plant management for resolution.  Corrective actions taken in response to the findings and recommendations are tracked until they are complete.  The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all affected employees (including contractors).  Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHAs and PHA revalidations.\n\n\nCompliance Audits\n\nTo help ensure that the accident prevention program is functioning properly, West Bay Organics will periodically conduct an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  Compliance audits will be conducted at least every 3 years.  The Operations Manager is responsible for the audit.  All findings will be forwarded to plant management for resolution.  Co"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 17514,
      "SummaryText": "rrective actions taken in response to the audit's findings will be tracked until they are complete.  The final resolution of each finding will be documented, and the two most recent audit reports will be retained. \n\n\nChemical-specific Prevention Steps\n\nThe processes at West Bay Organics have hazards that must be managed to ensure continued safe operation.  The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\n\n\nUniversal Prevention Activities\n\nThe accident prevention program summarized previously is applied to the entire plant.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n\n\nSpecified Safety Features\n\nWest Bay Organics has safety features on the unit to help contain/control a release, quickly detect a release, and reduce the consequences of (mitigate) a release.  The following types of safety features are used in the covered process:\n\n\tRelease Detection\n\t- Hydrocarbon detectors with alarms\n\t- Ammonia detectors with alarms\n\t- Operator walkthrough\n\n\tRelease Containment/Control\n\t- Process relief valves that discharge to a flare to capture and incinerate episodic releases\n\t- Valves to permit isolation of the process (manual or automated)\n\t- Automated shutdown systems for specific process parameters (e.g., high temperature,\n        pressure, high liquid level)\n\t- Diking to contain liquid releases\n\t- Redundant equipment and instrumentation\n\t- Atmospheric relief valves\n\n\tRelease Mitigation\n\t- Fire suppression and extinguishing systems\n\t- Deluge system for specific equipment\n\t- Trained emergency response personnel\n\t- Personal protective equipment (e.g., chemical protective clothing, self-contained breathing\n        apparatus)\n\t\n\nFive-Year Accident History\n\nWest Bay Organics has an excellent record of accident prevention over the last 5 years.  There has not been an accident s"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 17514,
      "SummaryText": "ince inception of the plant.\n\n\nEmergency Response Program (ERP) Information\n\nWest Bay Organics developed an ERP that will protect worker and public safety, as well as the environment.  All employees will be trained to recognize and assess an emergency situation and respond before it becomes worse.  The person that discovers the emergency will communicate the emergency first to the affected personnel.  The plant's two-way radios (intrinsically safe), the emergency alarm system, and the intercom system will be used to alert on-site employees of the presence of an emergency situation.  They will then proceed to communicate the emergency to the ERTs and their supervisors.  The supervisors will report to management and others.  \n\nWest Bay Organics will not have an on-site ERT due to the inadequate staffing required for such a team.  The employees will respond to a major emergency by sounding the evacuation alarm and calling 911 to report the incident.  The employee contacting 911 will request (as needed) ambulance and/or fire department services.  An employee will then proceed to the main gate and wait for the dispatched services from the City of Baytown.  Upon arrival, the employee will convey the details of the emergency to the ambulance or fire department personnel.  \n\n\nPlanned Changes to Improve Safety\n\nWest Bay Organics will resolve all findings from future PHAs, some of which will result in modifications to the process.  Currently, there are no changes planned that would improve safety."
    }
  ]
}