{
  "FacilityID": 17557,
  "FacilityName": "Kempton Grain & Supply Corp.",
  "FacilityStr1": "109 E. Colonial Street",
  "FacilityStr2": "P.O. Box 28",
  "FacilityCity": "Kempton",
  "FacilityState": "IN",
  "FacilityZipCode": "46049",
  "Facility4DigitZipExt": "0028",
  "FacilityCountyFIPS": "18159",
  "LEPC": "Tipton County LEPC",
  "FacilityLatDecDegs": "40.291083",
  "FacilityLongDecDegs": "-86.227222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Harold W. Boyer",
  "OperatorStr1": "109 E. Colonial Street",
  "OperatorStr2": "P.O. Box 28",
  "OperatorCity": "Kempton",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46049",
  "OperatorZipCodeExt": "0028",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000161772",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-27 00:00:00",
  "SafetyInspectionBy": "Farmland Insurance Companies",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-09-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-09-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-09-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2005-11-07 00:00:00",
  "DeRegistrationEffectiveDate": "2003-04-01 00:00:00",
  "AnniversaryDate": "2004-09-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.291083,
  "FRS_Long": -86.227222,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 24745,
      "AltID": null,
      "FacilityID": 17557,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 31776,
          "ProcessID": 24745,
          "ChemicalID": 56,
          "Quantity": 84000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 25374,
          "ProcessID": 24745,
          "NAICSCode": "42291",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 9485,
              "Process_NAICS_ID": 25374,
              "SafetyReviewDate": "1999-06-16 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "Yes",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-12 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-12-30 00:00:00",
              "TrainingReviewDate": "1999-03-08 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Competency",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-12-30 00:00:00",
              "EquipmentInspectionDate": "1999-06-12 00:00:00",
              "EquipmentTested": "Excerise Relief Valve Manifold",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-06-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 9932,
                  "PreventionProgram2ID": 9485,
                  "ProcessChemicalID": 31776
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 17557,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-03-08 00:00:00",
    "ERTrainingDate": "1999-03-08 00:00:00",
    "CoordinatingAgencyName": "Kempton Fire Department",
    "CoordinatingAgencyPhone": "7659475511",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17557,
      "SummaryText": "Safety at the workplace is the only environment one can experience to have an expectation for long life and good health. As a small business the management is the workforce. As employees we are responsible for the safety of our work space, our fellow workers, our customers, and our community. To be ever vigilant, alert, and sensitive to our surroundings is imperative.\nAs the calendar year dictates the type of products to be handled and everchanging tasks to be completed a safe work space can be maintained. The prelude is to implement and practice the safety codes of the industry and the postlude is to react to the work experience with reasonable corrective inquiry.\nKempton Grain & Supply Corp. is a supplier of grain, feed, seed, fertilizer, and other agricultural products to rural and urban patrons. Manufactured products are delivered to our storage facility and are available to the consumer at demand. Maintenance and repairs are ongoing to the physical plant. Agricultural commodities are very stable in a maintained environment but ammonia (anhydrous) is a regulated substance that must be reported of its storage location and recognized as a environmental hazard if released inappropriately.\nMaterial safety data informs that Ammonia (anhydrous) is a corrosive compressed gas with oral toxicity. Symptoms of overexposure are acute. Ammonia is a severe irritant of the eyes, respiratory tract and skin. It may cause burning and tearing of the eyes, runny nose, coughing, chest pain, cessation of respiration and death. It may cause severe breathing difficulties which may be delayed in onset. Exposure of the eyes to high concentrations may produce temporary blindness (cataracts and glaucoma) and severe eye damage. Exposure of the skin to high concentrations of the gas may cause burning and blistering of the skin. Contact with liquid Ammonia (anhydrous) may produce blindness, severe eye and skin burns.\nThe 18,000 gallons Ammonia (anhydrous) storage tank is located on the South"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17557,
      "SummaryText": "East corner of our property. To the East and South are nonpopulated agricultural terrain. To the North and West are residences that would be effected by a worse case release of the total storage capacity. Although to the north are six (6) 80 feet tall grain storage silos which form a barrier that would hamper movement of the vaper plume into the populated areas. The storage vessel has manual shut off valves that are pad-locked closed when the system is not in use, as well as relief valves for overpressureizition per industry standards. Maintenance staff is physically on site 6 days a week to be alert to any abnormalities and trained to respond to events. Due to the seasonal nature of agriculture the storage vessel is pumped near empty for 9 months yearly and electricity is shut off to the system, but the worse case event must be addressed. If personel with their safety equipment could not control a worst case release the immediate assistence from the Kempton Fire Department (with the Chief becoming site commander) and using other agencies and HasMat teams at their disposal would be implemented. If past history can be used as a standard then well maintained facilities with alert workers make a worst case release unlikely.\nThe alternative scenario release would be transfer hose failure. This is an event that could happen since the outward appearance of the speciality design hose could have premature internal wear not detectable at inspection but must be changed according to month and year code. A ruptured hose would release its volume into the atmosphere at 600 pounds per minute indicated by DEGADIS model for two (2) minutes. The excess flow valve, check valve, and valve closure would be the active mitigation to stop the release. Ammonia (anhydrous) vapor of 1200 pounds according to model would not reach off our property and minimium requirements for clean up and contrainment would be initated.\nThe general accidental release prevention program was initated by Preside"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17557,
      "SummaryText": "nt Bush who signed the Clean Air Act Amendents of 1990 into law, Section 112 (r) of the Act seeks to prevent chemical accidents and minimize their consequences. Both OSHA and EPA were required to develop regulations aimed at preventing catastrophic chemical releases. OSHA's response is the Process Safety Management Standard and EPA's is the Risk Management Program. Although these two regulations complement each other, they are clearly different. OSHA's Process Safety Management Standard was established to protect employees. EPA's Risk Management Program is aimed at protecting the public and the environment.\nIn addition to Federal/State regulation, industry specific design codes and standards are used to demonstrate compliance for personnel and equipment safety. for example ANSI Standards requires each permanent storage location must hae one full face gas mask with one industrial size ammonia canister, plus a spare canister, protective gloves, ventilated goggles, protective boots, pants, and jacket, and an open top stock tank or deluge shower for emergency water.\nEmergencies can be prevented. People need to be trained and retrained to handle ammonia (anhydrous) properly. Use the resources available as insurance carriers, fire department personnel, safety coordinators employed by the industry, manufacturers of equipment, and contractors that install systems are willing participants to train and educate. Provide safety equipment without hesitation and insist on its use. Maintain equipment properly replacing all defective parts immediately at first knowledge. Invite people on site to critic your procedural efferts to training and maintenance. Listen to their recommedations and then do the right thing to provide a safe environment for the work place and for the community.\nKempton Grain & Supply Corp. did not have any reportable accidents in the last five (5) years handling the regulated substance of ammonia (anhydrous).\nThe elements of our Emergency Response Program are"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 17557,
      "SummaryText": "both local and regional in nature by design. Employees, customers, town persons, and business associates are local emergency responders for fire, medical and hazardous material occurances. Our insurance carrier's material and loss control video library are shared with these agencies giving current copywrited information and instruction for updated training. Our personnel receive local classroom and on site instruction with interaction being requested. Annually regional safety and information seminars under university and corporate sponsership are required attendance for some employees. Semi-annually a contracted inspector is physically on site to inspect and repair safety equipment. On going communications with churches, schools, hospitals, food suppliers, and a local diaster relief agency with what if situations have been explored. Planned changes to improve safety are current. Insurance personnel are date pending an interaction exercise on site with employees and local fire emergency responders. A new computer system is now installed for information gathering and monitering assistance, and filling out this Risk Management Plan for the EPA has stimulated thought for worker and community safety."
    }
  ]
}