{
  "FacilityID": 17570,
  "FacilityName": "Johns Manville Corporation, Defiance, OH, 08",
  "FacilityStr1": "925 Carpenter Road",
  "FacilityStr2": null,
  "FacilityCity": "Defiance",
  "FacilityState": "OH",
  "FacilityZipCode": "43512",
  "Facility4DigitZipExt": "7218",
  "FacilityCountyFIPS": "39039",
  "LEPC": "Defiance County LEPC",
  "FacilityLatDecDegs": "41.301806",
  "FacilityLongDecDegs": "-84.340278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.jm.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 157276411,
  "ParentCompanyName": "Johns Manville International, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 45426558,
  "Company2DUNS": 0,
  "OperatorName": "Johns Manville International, Inc.",
  "OperatorStr1": "PO Box 5108",
  "OperatorStr2": null,
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80217",
  "OperatorZipCodeExt": "5108",
  "FTE": 348,
  "OtherEPAFacilityID": "OHD980701718",
  "EPAFacilityID": "100000066144",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "per approval",
  "SafetyInspectionDate": "1998-11-20 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-09-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-09-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-09-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2001-09-04 00:00:00",
  "DeRegistrationEffectiveDate": "1999-06-21 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.30376,
  "FRS_Long": -84.34152,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 24762,
      "AltID": "Resin 89",
      "FacilityID": 17570,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 31793,
          "ProcessID": 24762,
          "ChemicalID": 1,
          "Quantity": 25000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 25393,
          "ProcessID": 24762,
          "NAICSCode": "327993",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 24763,
      "AltID": "Resin East & West",
      "FacilityID": 17570,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 31794,
          "ProcessID": 24763,
          "ChemicalID": 1,
          "Quantity": 19000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 25394,
          "ProcessID": 24763,
          "NAICSCode": "327993",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 17570,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-05-14 00:00:00",
    "ERTrainingDate": "1999-05-28 00:00:00",
    "CoordinatingAgencyName": "Defiance County EMA",
    "CoordinatingAgencyPhone": "4197841155",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17570,
      "SummaryText": "Johns Manville International, Inc.\nDefiance, Ohio - Plant 08\n\nRMP EXECUTIVE SUMMARY\n\n1)  Brief Description of the Defiance, Ohio - Plant 08 Facility:                                      \n                                                                                                      \n    The Johns Manville (JM) in Defiance, Ohio - Plant 08 was constructed in 1960.  The              \n    facility manufactures fiberglass building insulation which is sold in the commercial,             \n    residential, and retail markets.  The facility currently encompasses approximately                \n    578,500 square feet under roof and is set in 40.6 acres of urban area.  There are presently       \n    about 350 full time employees who operate the Plant 24 hours a day, 365 days a year.              \n                                                                                                      \n    Johns Manville places a strong emphasis on safety and environmental leadership.  The              \n    Company fosters a proactive philosophy to ensure that employees work in a safe                    \n    environment and that each facility remains in full compliance with all applicable federal,        \n    state, county and local regulations.  JM is also committed to environmental leadership            \n    within the community served.  This commitment is exemplified in the Defiance 08                   \n    Facilitys strong recycling and waste minimization programs.  The Companys long term             \n    goal is to have zero process wastes taken to disposal facilities, with all residual materials     \n    either recycled or used for beneficial purposes.  The Facility demonstrates another               \n    example of its aggressive position on recycling through its use of extraordinarily high           \n    levels of outside, post-consumer glass in its forming process.  This crushed glass, or            \n    cullet would otherwise be deposited in municipal landfi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17570,
      "SummaryText": "lls.                                     \n                                                                                                      \n    The facility maintains a good working relationship with all federal, state, county and            \n    local agencies.                                                                                   \n                                                                                                      \n                                                                                                      \n2)  Brief Description of the Accidental Release Prevention and Emergency Response                     \n     Policies at the Johns Manville Facility in Defiance, Ohio  Plant 08:                             \n                                                                                                      \n    The Johns Manville fiberglass manufacturing Plant 08 in Defiance, Ohio qualifies for the          \n    USEPA 112R (40 CFR 68) requirements due to the use of formaldehyde.  The facility                 \n    exceeds the qualifying threshold of 15,000 pounds of this material onsite for two               \n    separate processes.                                                                               \n                                                                                                      \n    Liquid resin solution containing formaldehyde (above 1% mixture) is delivered to the              \n    facility via truck transport.  Resin solution is stored in cold storage until it is mixed with    \n    water and other materials to make a binder solution (less than 1% formaldehyde) which is          \n    applied to fiberglass.  This binder solution is applied in the fiberglass manufacturing           \n    process as a low VOC binder which acts to bind glass fibers.  The formaldehyde                    \n    containing resin solution is stored as a liquid in numerous storage tanks associated with         \n  "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17570,
      "SummaryText": "  two similar (but separate) processes located inside the facility.  The storage vessels are        \n    constructed and operated in accordance with ASME specifications.  The resin storage               \n    processes are designed to minimize spills in the event of an accidental release.  The resin       \n    storage rooms are equipped with trenches that minimize the surface area of a spill.  In           \n    addition, the resin storage rooms are maintained at 50 degrees F to reduce the volatility of      \n    the material.  Although not a qualifying mitigation measure for the 112R program, low             \n    storage temperatures give plant personnel adequate time to react to the situation by              \n    reducing the volatilization rate of the resin material.  As a result of these factors, Johns      \n    Manville has not experienced an accidental release of formaldehyde over the entire life of        \n    the facility.  Modeling impacts indicate that a worst-case release of formaldehyde from           \n    the resin storage tanks would not impact the public beyond the Facilitys property line           \n    and therefore is qualified as a Program 1 facility.                                               \n                                                                                                      \n    With the exception of minor incidents, it is the Facilitys policy to immediately contact         \n    and rely on outside emergency responders in the event of a significant unforeseen or              \n    accidental release of formaldehyde-containing liquid resin.  Outside responders would             \n    include the community fire department and other community or contractor services as               \n    required.                                                                                         \n                                                                                                      \n                                             "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 17570,
      "SummaryText": "                                                         \n3)  Brief Description of the Worst Case Scenario, including Administrative Controls and               \n     Mitigation Measures to Limit the Distances for each Reported Scenario:                            \n                                                                                                      \n    According to 40 CFR 68, the worst-case scenario is to be based on the release of the              \n    greatest amount held in a single vessel, taking into account administrative controls that         \n    limit the maximum quantity.  At Defiance 08, two formaldehyde processes, Resin 89 and             \n    Resin West/Resin East (same process, but different tank locations) are considered.  The           \n    Resin East location represents the worst-case scenario for the Resin West/Resin East              \n    formaldehyde process.                                                                             \n                                                                                                      \n    Under a worst-case scenario for the Resin 89 process, a single vessel containing 5,000            \n    gallons of liquid resin, which includes about 12.5% formaldehyde, is assumed to spill             \n    with partial containment (low-lying pavement and trenches) in the resin room.  Liquid not         \n    contained in the resin room is assumed to spill outside and is contained by low-lying             \n    paved areas.  Distance to the toxic endpoint of 12.0 mg/m3 is calculated for Defiance 08          \n    using AFTOX, a dispersion model that will determine toxic chemical concentrations at              \n    hazard distances.  According to AFTOX, a worst-case resin spill and subsequent                    \n    formaldehyde vaporization onsite at Defiance 08 will result in a distance of 0.04 miles to        \n    the toxic endpoint.  A plant and topographic map analysis indicates that 0.04 miles"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 17570,
      "SummaryText": " from          \n    the location of the resin tank is completely onsite.                                              \n                                                                                                      \n    Under a worst-case scenario for the Resin West process, a single vessel containing 4,500          \n    gallons of liquid resin is assumed to spill with partial containment (low-lying pavement          \n    and trenches) in the resin room.  Liquid not contained in the resin room is assumed to            \n    spill outside via trenching and is contained by two separate outdoor liquid capture pits          \n    which are connected by trenching.  According to AFTOX, a worst-case resin spill and               \n    subsequent formaldehyde vaporization onsite at Defiance 08 will result in a distance of 0.01         \n    miles to the toxic endpoint.  A plant and topographic map analysis indicates that 0.01            \n    miles from the location of the resin tank is completely onsite.                                   \n                                                                                                      \n    Under a worst-case scenario for the Resin East process, a single vessel containing 3,750          \n    gallons of liquid resin is assumed to spill with partial containment (low-lying pavement          \n    and trenches) in the resin room.  Liquid not contained in the resin room is assumed to            \n    spill outside via trenching and is contained by two separate outdoor liquid capture pits          \n    which are connected by trenching.  According to AFTOX, a worst-case resin spill and               \n    subsequent formaldehyde vaporization onsite at Defiance 08 will result in a distance of 0.01         \n    miles to the toxic endpoint.  A plant and topographic map analysis indicates that 0.01            \n    miles from the location of the resin tank is completely onsite.                                   \n                     "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 17570,
      "SummaryText": "                                                                                 \n    Therefore, the formaldehyde-containing liquid resin processes at Defiance 08 do not               \n    qualify for Program 2 of 112R.                                                                    \n                                                                                                      \n                                                                                                      \n4)  Brief Description of the Five Year Accident History (68.42):                                      \n                                                                                                      \n    The Defiance 08 facility has never had an accident involving formaldehyde-containing              \n    liquid resin that caused deaths, injuries, property or environmental damage, evacuations,         \n    or sheltering in place.                                                                           \n                                                                                                      \n                                                                                                      \n5)  Brief Description of the Emergency Response Program (68.90  68.95):                              \n                                                                                                      \n    In the event of an emergency involving the Facilitys formaldehyde-containing liquid              \n    resin system, it is the Facilitys policy to notify the local fire department and other           \n    emergency responders and request that they respond to the emergency.  Plant personnel             \n    have discussed this policy with the fire department; members of the fire department have          \n    inspected the facility.                                                                           \n                                                                "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 17570,
      "SummaryText": "                                      \n    In addition to the emergency action and notification procedures described earlier in this         \n    document, Johns Manville complies with and maintains numerous other operational                   \n    programs for the purpose of promoting employee safety and minimizing potential hazards            \n    to the surrounding community. These include, but are not limited to:                              \n        a. Emergency Hotline notifications                                                                \n        b. Spill, Prevention, Control and Countermeasure Plan and equipment.                          \n        c.  RCRA Contingency Plan                                                                     \n        d.  Hot Work Permit Program                                                                   \n        e.  Safety Lockout-Tagout Program                                                             \n        f.  Extensive safety programs throughout the location                                         \n        g.  Fire Prevention Plan                                                                      \n        h.  Bomb Threat Plan                                                                          \n        i.  Agency, insurance and physicians inspections                                              \n        j.  Job Safety Analyses                                                                       \n        k.  Confined Space Entry procedures                                                           \n        l.  Injury Investigation Procedure and Root Cause Analysis                                    \n        m.  New and Altered Equipment Inspection (Management of Change)                               \n        n. Outside Contractor Review Policy                                                           \n        o. Community Emergency Response Coordination Policy                                           \n"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 17570,
      "SummaryText": "        p.  Various emergency communication systems throughout the facility                           \n                  such as audible alarms, paging systems, hand-held radios, phones,                   \n                  visual alarms.                                                                      \n        q.  Right-To-Know Notification Programs issued to State and local                             \n                  agencies (Emission Release Reports, SARA Title III, etc)                            \n        r.  Extensive and detailed employee training in all phases of job related                     \n                  safety, chemical awareness, handling potential spills, HAZCOM,                      \n                  RTK, emergency procedures, notification and numerous other programs"
    }
  ]
}