{
  "FacilityID": 17654,
  "FacilityName": "PELICAN SEAFOODS",
  "FacilityStr1": "1 SALMON WAY",
  "FacilityStr2": null,
  "FacilityCity": "PELICAN",
  "FacilityState": "AK",
  "FacilityZipCode": "99832",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": null,
  "LEPC": null,
  "FacilityLatDecDegs": "58.966667",
  "FacilityLongDecDegs": "136.225",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "KTRIBAL@PTIALASKA.NET",
  "FacilityDUNS": 0,
  "ParentCompanyName": "KAKE & RIBAL CORPORATIONS",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "PELICAN SEAFOODS",
  "OperatorStr1": "1 SALMON WAY/BOX 110",
  "OperatorStr2": null,
  "OperatorCity": "PELICAN",
  "OperatorStateFIPS": "AK",
  "OperatorZipCode": "99832",
  "OperatorZipCodeExt": null,
  "RMPContact": "THOMAS WHITMARSH",
  "RMPTitle": "CHIEF ENGINEER",
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000160504",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-06-10 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "PRM-1999-1-000579-8",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-09-20 00:00:00",
  "ErrorReportDate": "1999-09-20 00:00:00",
  "ReceiptDate": "1999-09-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Paper",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-09-09 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2014-05-16 00:00:00",
  "DeRegistrationEffectiveDate": "2012-05-01 00:00:00",
  "AnniversaryDate": "2004-08-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 58.12473,
  "FRS_Long": -135.64923,
  "FRS_Description": "OTHER",
  "FRS_Method": "ZIP CODE-CENTROID",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 24853,
      "AltID": null,
      "FacilityID": 17654,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 25489,
          "ProcessID": 24853,
          "NAICSCode": "311712",
          "_desc": {
            "NAICS_CODE": "311712",
            "NAICS_DESCRIPTION": "Fresh and Frozen Seafood Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 31898,
          "ProcessID": 24853,
          "ChemicalID": 56,
          "Quantity": 25000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 531898,
          "ProcessID": 24853,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17654,
      "SummaryText": "Pelican Seafoods has a Risk Management Program for dealing with ammonia.  The program is a detailed procedures manual for preventing ammonia leaks and dealing with leaks if they should occur.  The Risk Management Program is an extension to the OSHA required Process Safety Management (PSM) plan for dealing with the hazards of using ammonia in the refrigeration system on Pelican Seafoods property.  The Risk Management Program extends the safety considerations of the PSM plan to locations beyond the Pelican Seafood, Inc. property boundaries to the City of Pelican.\n\nThe Risk Management Program includes physical plant information, information on safety controls and alarms, routine and non-routine operating procedures, process hazard analysis, maintenance information, training records of plant operators, training of non-plant community emergency response personnel, and an Emergency Response Plan.\n\nPelican Seafoods, Inc. uses ammonia for refrigeration in the freezing and storage of frozen seafood.  The facility contains ammonia in two separate systems.  The crab plant building contains ammonia in a brine tank freezing system.  This facility contains an estimated maximum 800 pounds of ammonia.  The major facility is the Pelican Seafoods plant cold storage building, refrigeration compressor room, and ice plant.  This refrigeration system consists of a high pressure receiver, a low pressure receiver, and two intermediate pressure receivers located in the compressor room building and the ammonia in the piping in the adjacent cold storage facility which is a 3 story building measuring 70 by 120 feet and also the ammonia in the piping involved with the ice making/holding room facility which is three story 20 by 72 foot area.\n\nThe cold storage plant operates year around, and there is never a time when all of the ammonia is returned to a central location.  It is therefore difficult to determine exactly how much ammonia is contained in this refrigeration system.  Measuring the rece"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17654,
      "SummaryText": "ivers in the compressor room, the piping in the cold storage building and the ice facility indicates that the system probably contains between 20,000 and 25,000 pounds of ammonia.\n\nThe worst case risk to the community would result from a failure of the high pressure receiver located in the compressor room and the release of a large cloud of ammonia gas in a short period of time.  A failure of the receiver in the crab plant building should not result in major consequences to the community because of the small amount of ammonia contained in this facility.  This Risk Management Plan discusses a worst case scenario where the high pressure receiver is completely full when it fails; however, due to normal operating procedures, it is extremely unlikely that an emergency release of ammonia would be as large as indicated in this document for the simple reason that the high pressure receiver during normal conditions is usually less than half full.\n\nAmmonia is a colorless gas with an extremely pungent odor which is corrosive, causes eye and skin damage and is harmful or fatal if inhaled.  The human nose is very sensitive to ammonia and can detect ammonia at levels that are much lower than those that cause immediate health effects.  Additional safety information about ammonia is located in the Material Data Safety Sheet (MSDS) which is included in the Process Safety Management/Emergency Response Program."
    }
  ]
}