{
  "FacilityID": 17783,
  "FacilityName": "Mohawk Water Treatment Plant",
  "FacilityStr1": "3600 E. Mohawk Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Tulsa",
  "FacilityState": "OK",
  "FacilityZipCode": "74115",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40143",
  "LEPC": "Tulsa LEPC",
  "FacilityLatDecDegs": "36.213833",
  "FacilityLongDecDegs": "-95.933944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Tulsa",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Tulsa",
  "OperatorStr1": "707 S. Houston",
  "OperatorStr2": "Room 401",
  "OperatorCity": "Tulsa",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74127",
  "OperatorZipCodeExt": null,
  "FTE": 28,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000032788",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-10-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-09-30 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-09-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 36.21449,
  "FRS_Long": -95.93483,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 25076,
      "AltID": "Chlorine Feed System",
      "FacilityID": 17783,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 32324,
          "ProcessID": 25076,
          "ChemicalID": 62,
          "Quantity": 80000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 25720,
          "ProcessID": 25076,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 9592,
              "Process_NAICS_ID": 25720,
              "SafetyReviewDate": "1999-05-01 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 0,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Chlorine Institute",
              "FR_Comments": null,
              "HazardReviewDate": "1999-05-03 00:00:00",
              "ChangeCompletionDate": "1999-06-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "Chlorine Gas Scrubber",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-11 00:00:00",
              "TrainingReviewDate": "1999-05-11 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-18 00:00:00",
              "EquipmentInspectionDate": "1999-05-24 00:00:00",
              "EquipmentTested": "Chlorine Tanks, Evaporators, and Feed Systems",
              "ComplianceAuditDate": "1999-05-15 00:00:00",
              "AuditCompletionDate": "1999-05-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "Mohawk Water Treatment Plant Chlorine Bulk Storage and Feed System",
              "_chemicals": [
                {
                  "PrimaryKey": 10044,
                  "PreventionProgram2ID": 9592,
                  "ProcessChemicalID": 32324
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 17783,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-05-10 00:00:00",
    "ERTrainingDate": "1999-06-02 00:00:00",
    "CoordinatingAgencyName": "Tulsa LEPC",
    "CoordinatingAgencyPhone": "9185969422",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17783,
      "SummaryText": "The City of Tulsa stores liquid chlorine in two 25-ton aboveground storage tanks at the Mohawk Water Treatment Plant (WTP).  Chlorine is provided for primary disinfection, preoxidation, and filter cleansing. It is the City of Tulsa's policy to adhere to all applicable federal, state, and local laws.  If an emergency were to occur and the City of Tulsa was not able to contain the release, the City will notify the Tulsa Fire Department HAZMAT Team and Advance Chemical to request assistance in responding to the emergency.\n\nChlorine is stored at the water treatment plant in two 25-ton aboveground storage tanks. Chlorine is a toxic gas stored as a liquid under pressure.  Chlorine vapors are irritating and corrosive to eyes, skin, and the respiratory tract and react violently with easily oxidized materials.  Chlorine gas is heavier the air and will tend to travel along the ground and collect in low areas and fill below ground areas such as pits and sumps.   \n\nThe chlorine storage tanks are located inside the chemical feed building at the Mohawk WTP. The bulk storage tanks were designed, constructed, tested, and marked in accordance with the ASME Boiler and Pressure Vessel Code, Section VIII, Division 1, Rules for Construction of Pressure Vessels. Chlorine is fed to the process using evaporators and vacuum chlorinators.  In addition, the storage room is equipped with an air collection system and packed tower scrubber to minimize the impact of a potential release.  The chlorine scrubber system is designed to withdraw air containing chlorine from the building.  The contaminated air passes through a weak caustic solution to neutralize the chlorine prior to discharge of the air to the atmosphere.  The scrubber system was designed in accordance with the Uniform Fire Code and is large enough to treat the contents of one 25-ton storage tank.  The storage tanks, relief valves, piping, and appurtenances were designed in accordance with Chlorine Institute Standards.\n\nThe worst-case "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17783,
      "SummaryText": "release scenario for the Mohawk WTP is defined as the release of the entire contents of one 25-ton liquid chlorine storage tank as defined by the regulations.  The tank is assumed to be 80 percent full.  The release occurs inside the chemical feed building.  Credit was taken for passive mitigation.  The chlorine scrubber is considered active mitigation and according to the rule, no credit is taken for this system. The AWWARF Compliance Guidance and Model Risk Management Program for Water Treatment Plants guidance document, scenario CLW-3 was used to estimate the distance to the toxic endpoint.  The estimated distance to the endpoint is greater than 6.2 miles.  Based on 1990 Census data, approximately 130,000 people in Tulsa and Osage counties live within the 6.2-mile radius.\n\nThe chlorine system is equipped with a chlorine scrubber system that is designed to minimize the impact of any chlorine release from the Mohawk WTP.  Two alternative scenarios were evaluated.  Scenario 1 evaluates the scrubber system design leak.  The scrubber is designed to treat the entire content of one 25-ton bulk storage tank.  The leak is assumed to occur downstream of the excess flow valve.   Chlorine is assumed to leak at a rate of 7,000 lbs./hr over a period of 7 hours.  When a leak is detected, normal ventilation is shutdown and contaminated air is drawn through the scrubber system.  The system is designed to treat the design leak and reduce the chlorine concentration to less than 15 ppm prior to discharging the air.  The endpoint for Scenario 1 was estimated using RMP Comp.  The distance to the endpoint is 0.11 miles.  \n\nScenario 2 evaluates a potential release scenario that would not be contained by the chlorine scrubber.  This scenario assumed that chlorine is released to the atmosphere as a result a failure of the transfer hose during between the delivery tanker and the bulk storage tank. This scenario assumed that excess flow valves provided on both the bulk storage tank and the "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17783,
      "SummaryText": "tank truck function properly thus limiting the release to the volume of the hose. The transfer line is estimated to contain 42.8 lbs. of chlorine when the release occurs.  The duration of the release is assumed to be 10 minutes.  The distance to the endpoint is estimated to be 0.21 miles.  \n\nThe Mohawk WTP complies with EPA's accident prevention rule and all applicable state and local regulations.  The chlorine bulk storage tanks, scrubber system, piping, evaporators, and associated equipment are design, manufactured, installed, and maintained in accordance with applicable ASTM, Chlorine Institute, and Uniform Fire Code Standards.  The City of Tulsa has completed a hazard review of the chlorine system and documented the findings.  Operations and maintenance procedures have been developed and implemented.  All employees responsible for the operation of the chlorine system have been trained and a training certification is provided in the Risk Management Plan.  \n\nThe City of Tulsa has not had an accident involving the chlorine system at Mohawk that is reportable under the RMP rules.  The facility has not experienced a release resulting in deaths, injuries, property or environmental damage, evacuations, or sheltering-in-place.  \n\nThe City of Tulsa has prepared and implemented an Emergency Response Plan (ERP) for chlorine releases.  The purpose of the ERP is to protect employees and the public in the event of the accident release of chlorine from the facility.  City of Tulsa personnel will initiate the emergency response plan and will provide the initial response to a chlorine emergency.  Responsible personnel have been trained in accordance with the City Health and Safety procedures and the RMP in the use of personnel protective equipment and required emergency response equipment.   If Mohawk personnel are unable to contain a chlorine release with an emergency repair kit, outside assistance will be requested.  Outside assistance may be provided by the City of Tulsa Fire"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 17783,
      "SummaryText": " Department, HAZMAT Team, Police Department, and Advance Chemical (the chlorine supplier).  The responsibilities of each outside agency are provided in the RMP."
    }
  ]
}