{
  "FacilityID": 17819,
  "FacilityName": "Fisher Scientific Co-Delmar Distribution Center",
  "FacilityStr1": "355 Corporate Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Newark",
  "FacilityState": "DE",
  "FacilityZipCode": "19702",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "10003",
  "LEPC": null,
  "FacilityLatDecDegs": "39.615833",
  "FacilityLongDecDegs": "-75.755556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "OT",
  "FacilityURL": "Fishersci.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 175537430,
  "ParentCompanyName": "Fisher Scientific Company L.L.C.",
  "Company2Name": "Fisher Scientific International, Inc.",
  "CompanyDUNS": 4321519,
  "Company2DUNS": 557448065,
  "OperatorName": "Fisher Scientific Company L.L.C.",
  "OperatorStr1": "2000 Park Lane",
  "OperatorStr2": null,
  "OperatorCity": "Pittsburgh",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "15275",
  "OperatorZipCodeExt": "1126",
  "FTE": 50,
  "OtherEPAFacilityID": "DED981938046",
  "EPAFacilityID": "100000162557",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-01-31 00:00:00",
  "SafetyInspectionBy": "New Castle County Dept. of Public Safety",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-10-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-10-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-10-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-06-25 00:00:00",
  "DeRegistrationEffectiveDate": "2009-06-17 00:00:00",
  "AnniversaryDate": "2004-10-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.61594,
  "FRS_Long": -75.75225,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 25130,
      "AltID": "Storage",
      "FacilityID": 17819,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 32399,
          "ProcessID": 25130,
          "ChemicalID": 4,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 32400,
          "ProcessID": 25130,
          "ChemicalID": 92,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 25775,
          "ProcessID": 25130,
          "NAICSCode": "42149",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 25776,
          "ProcessID": 25130,
          "NAICSCode": "42269",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 17819,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-03-01 00:00:00",
    "ERTrainingDate": "1998-03-01 00:00:00",
    "CoordinatingAgencyName": "Newark Fire Department Station 9",
    "CoordinatingAgencyPhone": "3024543309",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17819,
      "SummaryText": "Facility Overview:  The Delmar Distribution Center in Newark, Delaware is a distribution center for laboratory equipment, apparatuses, and laboratory-grade chemicals.  The facility is regulated under 40 CFR Part 68 of the Clean Air Act Amendments due to onsite storage capacities of chloroform and ethyl ether.  At the time of the submittal, the facility had approximately 13,441 pounds of chloroform and 6,805 pounds of ethyl ether in storage.  The amounts of both chemicals differ from the quantities reported in Section 1.17 of this document; the amounts in Section 1.17 are the threshold quantities of the two chemicals.  The facility predictively filed for chloroform and ethyl ether in the event that the quantities of these materials stored on site exceed the respective threshold quantities.  Chemical storage is the only regulated process at the facility.\n\nAccidental Release Prevention and Emergency Response Policies:  The facility's overall approach and committment to proper chemical management is demonstrated by training, procedures, and maintenance systems currently in place at the facility.  The facility is committed to ensuring safe operations in accordance with Part 68 requirements and has established a senior manager responsible for Part 68 implementation and compliance.  \n\nRelease Scenarios:  Worst-case scenarios were conducted for chloroform and ethyl ether for each chemical's single largest vessel based on US EPA's Offsite Consequence Analysis guidance and EPA-approved modeling.  The worst-case release scenario for chloroform consisted of a liquid spill and vaporization.  The largest container size of chloroform was 200 liters.  The distance to the toxic endpoint for chloroform was 0.03 miles.  The worst-case release scenario for ethyl ether involved a vapor cloud explosion of a 20 liter container.  The distance to the endpoint was 0.02 miles.  None of the worst-case scenarios resulted in an impact to the public or environmental receptors.\n\nGeneral Accidental"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17819,
      "SummaryText": " Release Prevention Program and Chemical-specific Prevention Steps:  New employees are trained on chemical handling and release prevention during the orientation process.  Existing employees receive refresher training on proper chemical handling, proper loading and unloading of chemicals, and on material safety data sheets through hazard communication and Department of Transportation training.  \n\nFive-year Accident History:  The facility has had no RMP-reportable accidents/releases of ethyl ether or chloroform within the five years preceding RMP submittal.\n\nEmergency Response Program:  The facility has instituted an emergency response team consisting of employees from various shifts.  The team has received training as described in 29 CFR 1910.120.  The facility has contracted with AETS to provide assistance in the event of a release.  In addition, the facility has coordinated response efforts with the Newark Fire Department Station 9 and established a notification mechanism to ensure that the Newark Fire Department Station 9 will be properly notified when response is required.  The facility has submitted copies of its SARA 302, 311, and 312 reports to the Newark Fire Department Station 9.  The Delmar Distribution Center is subject to emergency response plan requirements including 29 CFR 1910.38 and 1920.120.  In addition, the facility is subject to the preparedness and prevention requirements of 40 CFR 265 Subpart C since the facility is a small quantity generator of hazardous waste.\n\nPlanned Changes to Improve Safety:  Periodic reviews of the program, training, and maintenance procedures are conducted to ensure that any necessary and appropriate changes are made to maintain and improve safety.  \n\nSummary:  As documented in this submittal, the facility has met Part 68 requirements and has certified compliance."
    }
  ]
}