{
  "FacilityID": 17823,
  "FacilityName": "Sid Richardson Keystone Plant",
  "FacilityStr1": "9 miles NE of Kermit, Texas",
  "FacilityStr2": null,
  "FacilityCity": "Kermit",
  "FacilityState": "TX",
  "FacilityZipCode": "79745",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48495",
  "LEPC": "Winkler County LEPC",
  "FacilityLatDecDegs": "31.933333",
  "FacilityLongDecDegs": "103.041667",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": "http://srcg",
  "FacilityEmailAddress": "rlgawlik@sidrich.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Sid Richardson Gasoline Co.",
  "Company2Name": null,
  "CompanyDUNS": 8016495,
  "Company2DUNS": 8016495,
  "OperatorName": "Sid Richardson Gasoline Co.",
  "OperatorStr1": "P.O. Drawer R",
  "OperatorStr2": null,
  "OperatorCity": "Kermit",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79745",
  "OperatorZipCodeExt": null,
  "FTE": 34,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000162628",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-09-04 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-10-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-10-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-10-04 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-10-04 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 31.945556,
  "FRS_Long": -103.044167,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) STANDARD POSITION (SA ON)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 25136,
      "AltID": "Tank Farm",
      "FacilityID": 17823,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 32407,
          "ProcessID": 25136,
          "ChemicalID": 155,
          "Quantity": 410497.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 24352,
              "ProcessChemicalID": 32407,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 24353,
              "ProcessChemicalID": 32407,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 24354,
              "ProcessChemicalID": 32407,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 24355,
              "ProcessChemicalID": 32407,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 24356,
              "ProcessChemicalID": 32407,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 24357,
              "ProcessChemicalID": 32407,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 24358,
              "ProcessChemicalID": 32407,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 25782,
          "ProcessID": 25136,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 25137,
      "AltID": "Refrigerant Storage",
      "FacilityID": 17823,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 32408,
          "ProcessID": 25137,
          "ChemicalID": 155,
          "Quantity": 121503.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 24359,
              "ProcessChemicalID": 32408,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 24360,
              "ProcessChemicalID": 32408,
              "ChemicalID": 129
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 25783,
          "ProcessID": 25137,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 25138,
      "AltID": "Cryo Plant Product",
      "FacilityID": 17823,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 32409,
          "ProcessID": 25138,
          "ChemicalID": 155,
          "Quantity": 68540.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 24361,
              "ProcessChemicalID": 32409,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 24362,
              "ProcessChemicalID": 32409,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 24363,
              "ProcessChemicalID": 32409,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 24364,
              "ProcessChemicalID": 32409,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 24365,
              "ProcessChemicalID": 32409,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 24366,
              "ProcessChemicalID": 32409,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 24367,
              "ProcessChemicalID": 32409,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 25784,
          "ProcessID": 25138,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 17823,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-09-01 00:00:00",
    "ERTrainingDate": "1998-11-01 00:00:00",
    "CoordinatingAgencyName": "Kermit Fire Dept",
    "CoordinatingAgencyPhone": "9155862577",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "Texas Railroad Commission"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17823,
      "SummaryText": "Sid Richardson Gasoline Co.\nKeystone Gas Plant\nExecutive Summary RMP\n\nSid Richardson Gasoline Co. is a privately held company that has been in the gas processing business for more than 50 years.  We operate two natural gas processing plants in West Texas and Southeast New Mexico.  The Keystone gas plant has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, trained gas plant personnel will respond to control and contain the release.  \n\nThis facility gathers field natural gas processing.  The facility and system of pipelines is jurisdictional to the Environmental Protection Agency, Texas Natural Resources Conservation Commission, Texas Railroad Commission, the Occupational Safety and Health Administration, and the United States Department of Transportation.  These agencies conduct periodic facility inspections and report any findings to Sid Richardson Gasoline Co. management.\n\nThe Keystone gas plant is located northeast of Kermit, in Winkler County, Texas, at coordinates of Lat. 31(56'00 Long 103(02'30.  The plant operates a variety of processes to separate raw natural gas into methane gas and natural gas liquid (NGL) product (Product), with black gasoline and scrubber oil (compression liquids) as by-products.\n\nSeveral regulated flammables occur as various mixtures in the natural gas stream being processed and in the produced liquids.  These are methane, ethane, butane, propane, and pentane.  These mixtures meet the NFPA 4 flammability criteria, and the mixtures are present in amounts above the threshold quantity.  Propylene and methyl alcohol, also regulated flammables, are purchased for use in the refrigeration of t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17823,
      "SummaryText": "he gas stream for processing, and for de-icing as needed of internal components during processing, respectively.\n\nTwo regulated toxics are present: the plant purchases chlorine gas for use at its cooling towers, and hydrogen sulfide gas occurs in, and is removed from, the raw natural gas.  The quantity on hand of each of these toxics is less than the threshold quantity, so they are not covered processes under the RMP.  However, both of these toxics are addressed in our existing emergency action plan.  In addition, the hydrogen sulfide gas is covered under Texas Statewide Rule 36, that deals with the protection of the general public. This facility does not have a threshold planning quantity of any toxic; therefore, a worst-case scenario (WCS) for a toxic release was not evaluated.  \n\n\nWorst-case scenarios were identified for three processes involving a release of flammable substances at the plant:\n\n1. Overpressure resulting from a vapor cloud explosion (VCE) caused by the release and ignition of the full vessel capacity of Natural Gas Liquids (product) from the largest vessel in the Cryo Plant.  The maximum distance to the 1-psi endpoint for this WCS is 0.33 mile.\n\n2. Overpressure resulting from a VCE caused by the release and ignition of the full vessel capacity of propylene (refrigerant) from the largest vessel in the Refrigeration System. The maximum distance to the 1-psi endpoint for this WCS is 0.40 mile.\n\n3. Overpressure resulting from a VCE caused by the release and ignition of the maximum inventory of mixed hydrocarbon liquids (hydrocarbon mix) from the largest storage tank in the Tank Farm.  This inventory is limited by administrative controls to 60% of the vessel capacity.  The maximum distance to the 1-psi endpoint for this WCS is 0.60 mile.\n\nThe vessel locations vary for each of these three scenarios.  The endpoints for the first two scenarios fall within the radius of the third endpoint, which is thus taken to be the limiting radius.\n\nAlthough we h"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17823,
      "SummaryText": "ave numerous controls to prevent such releases and to manage their consequences, no credit for passive mitigation measures was taken into account in evaluating any of these WCS's.  These processes involving regulated flammable substances are all Program Level 1.  There are no public or environmental receptors within any endpoint.\n\nAttached are exhibits of the calculations that support these findings as well as maps of the plant and of the surrounding area.\n\nAlthough Program Level 1 limits scenarios to overpressure resulting from a VCE involving the entire vessel contents, it should be noted that the farthest overpressure endpoint of 0.60 mile is unrealistically high, in that this is an atmospheric storage vessel with hydrocarbon liquid at ambient temperature.  A realistic scenario would be a pool fire for the contents of this vessel, which would yield an endpoint of 0.39 mile rather that the 0.60 mile, which results from a VCE.\n\nThe Keystone gas plant has an excellent record in preventing accidental releases.  Over the past five years there have been no releases that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas accident, major property damage, environmental loss, or personal injury at this facility.\n\nYear:                                  1994     1995     1996     1997     1998     (1999)\nNumber of RMP releases:     0            0          0           0            0            0\n\n\nThe Keystone gas plant maintains a written emergency action program, which is in place to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released, and includes names and telephone numbers of contact persons for Sid Richardson, for surrounding public receptors, for emergency responders, and for affected agencies.  The Keystone gas plant has around-the-clock communic"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 17823,
      "SummaryText": "ations capability and staff.  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.\n\nThe emergency response program for the Keystone gas plant is coordinated with the Local Emergency Planning Committee (LEPC) for Winkler County.  Keystone Plant Management has notified the LEPC of the desire to present and discuss the Risk Management Plan for the Keystone Plant to the Committee, and is currently (5/22/99) awaiting scheduling by the LEPC Chairperson of the RMP presentation.\n\nSid Richardson Gasoline Co.\nDunn & Bradstreet # is 008016495\n\nCorporate Headquarters\nSid Richardson Gasoline Co.                                         Herb Harless\n201 Main Street                                                              Environmental Health & Safety Manager\nSuite 3000                                                                      Phone: 817-338-8386\nFort Worth, Texas 76102                                               Fax: 817-390-8663\n\nKeystone Plant                                                              William Bill Webb\nSid Richardson Gasoline Co.                                         Plant Manager\nDrawer R                                                                       Phone: 915-586-3431\nKermit, Texas 79745                                                      Fax: 915-586-5211\nKeyRMPExeSum"
    }
  ]
}