{
  "FacilityID": 17873,
  "FacilityName": "Okeechobee Utility Authority SWTP",
  "FacilityStr1": "371 HWY. 78 WEST",
  "FacilityStr2": null,
  "FacilityCity": "OKEECHOBEE",
  "FacilityState": "FL",
  "FacilityZipCode": "34974",
  "Facility4DigitZipExt": "0835",
  "FacilityCountyFIPS": "12093",
  "LEPC": "District 7 LEPC",
  "FacilityLatDecDegs": "28.196667",
  "FacilityLongDecDegs": "80.831667",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "A5",
  "LatLongDescription": "ST",
  "FacilityURL": "N/A",
  "FacilityEmailAddress": "lfortner@ouafl.com",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "OKEECHOBEE UTILITY AUTHORITY",
  "OperatorStr1": "P.O.BOX 835",
  "OperatorStr2": null,
  "OperatorCity": "OKEECHOBEE",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "34973",
  "OperatorZipCodeExt": "0835",
  "FTE": 5,
  "OtherEPAFacilityID": "1999-2-014529-1",
  "EPAFacilityID": "100000162815",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-10-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-10-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-10-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2005-03-22 00:00:00",
  "DeRegistrationEffectiveDate": "2005-01-10 00:00:00",
  "AnniversaryDate": "2004-10-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 27.196952,
  "FRS_Long": -80.83225,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 25220,
      "AltID": "CHLORINE",
      "FacilityID": 17873,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 32549,
          "ProcessID": 25220,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 25868,
          "ProcessID": 25220,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 9635,
              "Process_NAICS_ID": 25868,
              "SafetyReviewDate": "1999-07-27 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "Yes",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-07-27 00:00:00",
              "ChangeCompletionDate": "1999-08-06 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-21 00:00:00",
              "TrainingReviewDate": "1999-06-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-21 00:00:00",
              "EquipmentInspectionDate": "1999-07-21 00:00:00",
              "EquipmentTested": "CHLORINE REGULATORS",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 10089,
                  "PreventionProgram2ID": 9635,
                  "ProcessChemicalID": 32549
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "ProcessID": 25221,
      "AltID": "Ammonia",
      "FacilityID": 17873,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 32550,
          "ProcessID": 25221,
          "ChemicalID": 56,
          "Quantity": 4250.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 25869,
          "ProcessID": 25221,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 17873,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-07-27 00:00:00",
    "ERTrainingDate": "1999-06-28 00:00:00",
    "CoordinatingAgencyName": "ST.LUCIE COUNTY-FT.PIERCE FIRE DIS.",
    "CoordinatingAgencyPhone": "5614622300",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17873,
      "SummaryText": "Chlorine:\n\n1.  Chlorine gas is used in water treatment process for the \n   purpose of disinfecting the effluent.  In those cases where    \n   chlorine gas is supplied for one ton chlorine containers (i.e. \n   more than 1,500 lbs. is present on site)) the chlorine supply \n   system must comply with the requirements of 29 CFR 1910.119 - \n   Process Safety Management of Highly Hazardous Chemicals.  The \n   purpose of this document is to meet the requirements for a \n   written compilation of Process Safety Information, and to  \n   record the results of the recently completed Process Hazards \n   Analysis.  The process includes the Chlorine Supply and \n   distribution system from the ton cylinders up to the point the \n   chlorinated effluent is dispersed into the Contact Chamber, \n   where the chlorine is dissolved.  At this point, the potential \n   for a release of highly hazardous material as defined by OSHA \n   does not exist.\n\n2.  This document provides guidelines to ensure the health and \n   safety of our employees and the general public where potential \n   releases of chlorine may occur when working with one ton    \n   chlorine cylinders. The provision of these guidelines will be  \n   implemented by facility personnel during routine maintenance   \n   and when there is an unusual occurrence that could threaten \n   human health, the environment and property.  This document \n   will be reviewed and updated as needed, and at least annually.\n\nII.  Site description\n\n1.  The Surface Water Plant and Ground Water Plant provides \n   drinking water for approximately 19,000 people.  \n\n2.  At the Surface Water Treatment Plant the chlorine supply and \n   finished water pumps are on-site and located approximately 100 \n   yards from the plant office.  The ton containers and \n   associated equipment is located at the southeast corner of the \n   site on a cement pad, outdoors, but roofed to protect \n   cylinders from direct sunlight.  Plant layout is depicted in \n   Figure 5. At the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17873,
      "SummaryText": "Ground Water Treatment Plant the ton \n   cylinders and associated equipment are located on the \n   southwest corner of the site on a cement pad, roofed and \n   partially covered, protected from sunlight and located \n   approximately 25 yards from the plant office.  At the Waste \n   Water Treatment Plant the ton containers and associated \n   equipment are located at the north end of the Plant \n   approximately 50 yards from the office.   \n\nIII. Employee Participation\n\n1. Two operators, who are at least C level certified by the \n   Department of Environmental Protection, are required to be \n   present at all times whenever connecting or disconnecting one \n   ton chlorine cylinders.  Routine removal and installation of \n   one-ton chlorine cylinders shall take place only during normal \n   working hours (7:00AM to 3:00PM- Monday to Friday). The \n   secondary operator will perform the task and the shift \n   operator is designated the backup should an emergency arise.\n                                \n2.  The shift operator will also assist in the transporting of  \n   empty and full cylinders to their stations with the cylinder \n   covers (bonnets) in place.  A shift operator will supervise \n   the tasks of disconnecting and reconnecting of chlorine \n   cylinders.  This requires the operator actually performing the \n   disconnecting and reconnecting tasks and breathing with SCBA \n   before beginning and during this work. The operator will stand \n   by upwind, observing work being performed from a safe distance \n   within visual contact and ready to assist should an emergency \n   arise.  This requires that a SCBA be worn, but is not required \n   to have face mask connected unless assisting in the actual \n   disconnecting or reconnecting of chlorine cylinders. Both \n   operators will work together in moving of empty cylinders and \n   their replacement with full ones on the scales.  A SCBA must \n   be worn but masks does not have to be donned during these \n   operations.  E"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17873,
      "SummaryText": "nsure that cylinder covers are installed during \n   movement of chlorine cylinders.\n\n\nIV.  Material Properties and Hazards\n\n1. General.  Chlorine is one of the chemical elements. It is a    \n   member of the halogen (or salt-forming group) along with \n   fluorine, bromine, iodine and astatine.  Chlorine occurs \n   naturally only in a combined state, primarily  with sodium as  \n   salt (NaCl).  As an element, the atomic symbol is Cl, its \n   atomic weight is 35.453, and the atomic number is 17. The \n   molecular symbol is Cl2 and the molecular weight is 70.906.  \n   It is manufactured predominately by electrolytic cell process  \n   and is widely used for treating municipal and industrial water \n   supplies. \n\n  a. Chlorine gas is a severe respiratory irritant, and chlorine \n   liquid is irritating to the skin.  The gas has a pungent odor \n   detectable at concentrations of less than 1 ppm.  A few \n   breaths of air with a concentration of 100 ppm of Chlorine is \n   likely to be fatal.  The following exposure limits apply:  \n\n    Permissible Exposure Limit (PEL) is 1 ppm (ceiling) and time \n    weighted Average (TWA) is 3mg/m3 (ceiling).\n\n\n  b. Chlorine has the following physical and chemical \n    characteristics:\n\n   (1) It is colorless in small amounts.\n   (2) It is a liquid only if pressurized or at very\n      low temperatures.\n   (3)It has an expansion rate of 457 to 1, or, simply\n      stated, 1 part of liquid evaporates to 457 parts\n      of gas.\n   (4) It is 2.5 times heavier than air in the gaseous\n       state.\n   (5) It is not flammable, however, it supports\n       combustion.\n   (6) It reacts violently with hydrocarbons and other\n       volatile substances.\n   (7) It will cause most metals to burn at elevated\n       temperatures.\n   (8) It is only slightly soluble in water.\n   (9) It reacts with water (moisture) to produce\n       hydrochloric acid (HCl) and hypochlorous acid\n       (HOCl).\n\nA material safety data sheet is included in appendix C.\n\n2.  Reacti"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 17873,
      "SummaryText": "vity and Incompatibility.  Chlorine is a strong         \n    oxidizer and will react chemically with many substances,  \n    often with the evolution of heat.  At temperatures above  \n    approximately 150' F, chlorine reacts vigorously with many \n    metals, including steel.  \n\n    Chlorine systems should be kept as dry as possible.  Chlorine \n    reacts with water evolving heat and producing a corrosive \n    acidic solution.  In the event of a leak, water sprays should \n    not be used since the resulting corrosion will worsen the \n    leak. Chlorine gas will react with ammonia gas to produce a \n    visible cloud of ammonia chloride.  This property is used for \n    leak checking by squirting ammonia gas from the vapor space \n    above an ammonium hydroxide solution over any suspected \n    leakage areas while looking for a white plume.\n\n\n\n\n\nV.   Process Technology\n\n1.   Process Flow Diagram.    A simplified process flow\n    diagram of a typical chlorinator system using one-ton chorine\n    cylinders is shown in Appendix D. The process description \n    below refers to this diagram.\n\n2.   Process Description.\n\n  a. Chlorine is injected in the filter effluent for \n    disinfection.  At the WTP/WWTP gaseous chlorine is     \n    continuously fed to the Chlorine Contact Chamber to achieve a \n    1.0 to 10.0 ppm residual total chlorine level in the \n    effluent.Typically, about 100 pounds per day of chlorine is \n    used for every 700,000 gallons of effluent at the Water \n    Plants (Surface and Ground) and 60 to 70 pounds for every \n    600,000 gallons of effluent at the Waste Water Treatment \n    Plant.\n  \n  b. Four one ton gas/liquid chlorine containers are fabricated\n    to DOT specifications as large steel welded tanks or cylin\n    ders.  The average container is about 30 inches in outside \n    diameter and about 82 inches in length.  Average tare weight \n    is 1500 pounds, average gross weight is about 3,500 pounds, \n    leaving 2,000 pounds net weight.  Each end of"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 17873,
      "SummaryText": "a difuser.  The feed system from the \n    container to the ejector is operated under vacuum, so any \n    small leaks pull in air instead of releasing chlorine.\n\n  f. The chlorinator is equipped with a small 25 watt heater \n    element.  As chlorine is drawn into the chlorinator from the \n    one-ton container, it is deflected down into a drip leg where \n    any liquid chlorine is vaporized, permitting only gas to \n    enter the regulating portion of the chlorinator.\n\n  g. A vent valve with plastic tubing is provided with the chlo\n    rinator unit.  The vent tube is routed to vent to the \n    atmosphere.  Also provided with the chlorinator is a chlorine \n    supply indicator.  A green indication represents the presence \n    of chlorine and a red indication represents a loss of \n    chlorine supply and that the inlet safety valve is closed.\n\n  h. Appendix E shows vendor details of the chlorinator.  Water, \n    at about 40 to 60 psig pressure, from a two inch supply line \n    is piped to the ejector. This circuit contains a shutoff \n    valve, and pressure gauge.  As this water flows through the \n    ejector at high velocity, it creates a vacuum in the chlorine \n    feed tubing which opens a spring-loaded check valve contained \n    in the ejector assembly. When the check valve at the ejector \n    opens this permits the vacuum to travel back through the \n    plastic vacuum tubing to the chlorinator.  This causes the \n    inlet safety valve in the chlorinator to open, initiating \n    chlorine gas flow.  A filter located in the chlorinator \n    removes any foreign material from the gas.  A spring-opposed \n    diaphragm regulates the vacuum at this point to allow the gas \n    to pass through a rotameter.  A manual feed rate control \n    valve is provided to regulate the chlorine gas flow to the \n    ejector.  From the ejector, the gas is thoroughly mixed with \n    water and carried through schedule eighty (80) PVC pipe to \n    the diffuser located in the Chlorine Contact"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 17873,
      "SummaryText": "a ton container \n    is concave, with one end equipped with two valves protected \n    by a removal bonnet housing.  The valves are connected to \n    eduction pipes located inside the container. The valves must \n    be aligned vertically so that the upper valve is used to \n    withdraw gaseous chlorine from above the liquid level in the \n    container.  The lower valve is for liquid withdrawal and is \n    not to be used.\n\n  c. There are six to eight fusible metal plugs in a one ton \n    container, three to four in each end.  These serve as an   \n    over-pressure relief device.  The internal pressure of the \n    container is equal to the vapor pressure of liquid chlorine \n    which varies with ambient temperature.  A container exposed \n    to ambient temperatures of 0 degrees to 100 degrees will have \n    an internal pressure ranging from 14 psig to 143 psig.  In \n    the event of a fire or overheating, at a temperature of about \n    160 degrees and a resulting vapor pressure of approximately \n    320 psig, the fusible plugs will melt and release the \n    contents of the container to the atmosphere. The DOT \n    Hydrostatic pressure specification of the container is 500 \n    psig.\n\n\n  d. Chlorine container trunnions are used for supporting and \n    spacing the containers and allowing for easy rotation of the \n    containers to correctly position the outlet valves.\n\n  e. Because chlorine poses a serious health risk if released to \n    the atmosphere, chlorine is fed from the one-ton containers \n    through a fail-safe device called a chlorinator.  A chlori\n    nator system includes two main components, a vacuum regulator \n    which mounts directly to the upper gas valve of the one-ton \n    chlorine container by means of a lead gasket positive yoke \n    assembly, and an ejector which uses effluent flow to create \n    the necessary vacuum. From the ejector the chlorine gas mixes \n    with the effluent before being injected into the chlorine \n    contact chamber through"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 17873,
      "SummaryText": "Chamber for \n    final dispensing of the chlorinated solution.\n\n\n3. Plant Specific Characteristics.  The Okeechobee Surface Water  \n    Treatment Plant, Ground Water Treatment Plant and Waste Water \n    Treatment Plant differ from the general description as shown  \n    in Appendix D, a schematic of a chlorine feed system.         \n    Specifically, Two one-ton cylinders are interconnected by a   \n    vacuum operated switch over valve which feeds to the ejector. \n    Chlorinated effluent can then be fed into an intermediate     \n    pumping station then pumped to a 1.5 million gallon contact   \n    chamber.  A copy of the instruction manual for Capital      \n    Controls Advance` 200 Series Gas Feeders is located in      \n    Appendix E.  A copy of the instruction manual for Capital     \n    Controls Automatic Switch over Module, Vacuum Type, is      \n    located in Appendix E.  A copy of the instruction manual for  \n    Capital Controls Advance` Gas Feeder (Ton Mounted) is located \n    in Appendix E.\n\n\nAmmonia:\n\n1.  Ammonia gas is used in water treatment process for the \n   purpose of THM control in the effluent.  In those cases \n   where Ammonia gas is supplied for 1000 gallon containers \n   (i.e.more than 4000 lbs. is present on site)) the Ammonia \n   supply system must comply with the requirements of 29 CFR\n   1910.119 -Process Safety Management of Highly Hazardous \n   Chemicals. The purpose of this document is to meet the \n   requirements for a written compilation of Process Safety \n   Information, and to record the results of the recently \n   completed Process Hazards Analysis.  The process includes \n   the Ammonia Supply and distribution system from the 1000 lb.\n   cylinders up to the point the chlorinated effluent is \n   dispersed into the Contact Chamber where the Ammonia is \n   dissolved.  At this point, the potential for a release of \n   highly hazardous material as defined by OSHA does not exist.\n\n2.  This document provides guidelines to ensure the health"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 17873,
      "SummaryText": "and \n   safety of our employees and the general public where potential \n   releases of Ammonia may occur when working with one thousand    \n   gallon cylinders. The provision of these guidelines will be  \n   implemented by facility personnel during routine maintenance   \n   and when there is an unusual occurrence that could threaten \n   human health, the environment and property.  This document \n   will be reviewed and updated as needed, and at least annually.\n\nII.  Site description\n\n1.  The Surface Water Plant and Ground Water Plant provides \n   drinking water for approximately 19,000 people.  \n\n2.  At the Surface Water Treatment Plant the Ammonia supply and \n   finished water pumps are on-site and located approximately 100 \n   yards from the plant office.  The 1,000 gallon containers and \n   associated equipment is located at the southwest corner of the \n   site on a cement pad, outdoors, but roofed to protect \n   cylinders from direct sunlight.  Plant layout is depicted in \n   Figure 5. At the Ground Water Treatment Plant the 1,000 gal. \n   cylinders and associated equipment are located on the \n   southwest corner of the site on a cement pad, roofed and \n   partially covered, protected from sunlight and located \n   approximately 25 yards from the plant office.     \n\nIII. Employee Participation\n\n1. Two operators, who are at least C level certified by the \n   Department of Environmental Protection, are required to be \n   present at all times whenever connecting or disconnecting lines \n   on any part of the cylinders.  Routine removal and installation\n   of regulator units and piping shall take place only during \n   normal working hours (7:00AM to 3:00PM- Monday to Friday).The \n   secondary operator will perform the task and the shift \n   operator is designated the backup should an emergency arise.\n                                \n2  A shift operator will supervise and assist in closing valves, \n   andthe tasks of disconnecting regulators and any piping \n   conne"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 17873,
      "SummaryText": "cted to cylinders.  This requires the operator actually \n   performing the disconnecting and reconnecting tasks and \n   breathing with SCBA before beginning and during this work. \n   The shift operator will stand by upwind, observing work being \n   performed from a safe distance within visual contact and ready\n   to assist should an emergency arise.  This requires that a SCBA\n   be worn, and to  have face mask connected and assisting in the \n   actual disconnecting or reconnecting of regulators and piping \n   if needed. Both operators will work together concerning this \n   task.  A SCBA must be worn and masks  have to be donned during \n   these operations.  \n   \n\n\nIV.  Material Properties and Hazards\n\n1. Ammonia can be supplied for water treatment applications in\n   three different forms: as a pure liquid (anhydrous ammonia),\n   dissolved in water(aquaeous ammonia), and as a dry ammonium\n   salt. At normal temperatures and pressures, anhydrous ammonia\n   (>99 percent NH3)is a gas. However, anhydrous can be easily \n   liquified and it is commonly stored and transported in liquid\n   form in pressurized containers very similar to chlorine \n   cylinders.At atmospheric pressure, liquid anhydrous ammonia \n   has a density of 42.6 lb/ft3, approximately two thirds that \n   of water.\n \n   Molecular weight=17.03, \n   Boiling point= -280f (-33.40 c), \n   Freezingpoint= -107.90f (-77.70c)\n\n Liquid density \n  @ bp and 1 atm (o psig.)        42.57 lb/ft3 (0.682 kg/l\n  @ 700f (21.10c)and 8.76 atm(114.1 psig.)38.00 lb/ft3 (0.609 kg/l)\n  @ 950f (350) and 13.32 atm (131.1 psig. 36.6 lb/ft3 (0.587 kg/l\n   \n Vapor Pressure\n    @ -400f (-400c)                      0.78 atm   \n    @ -200f (-28.90c)                    1.244 atm  (3.6 psig.)\n    @ 00f (-17.80c)                      3.28 atm   (33.5 psig.)\n    @ 400f (4.40c)                       4.98 atm   (57.6 psig.)\n    @ 700f (21.20c)                      8.76 atm   (114.1 psig.)\n    @ 950f (350c)                        13.32 atm  (181"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 17873,
      "SummaryText": ".1 psig.)\n \n   Latent Heat of Evaporation           589.3 BTU/LB\n    @ BP and 1 atm                      (327.4 cal/gm)\n       \n   Heat of Solution                     214.9 BTU/LB\n    @ 28% concentration                 (119 cal/gm\n\n\n  a. Ammonia gas is a severe respiratory irritant, and Ammonia \n   liquid is irritating to the skin.   \n   The following exposure limits apply:  \n\n    Permissible Exposure Limit (PEL) is 50 ppm (ceiling) and time \n    weighted Average (TWA) is 25 ppm (ceiling).\n\n\n  b. Ammonia has the following physical and chemical \n    characteristics:\n\n   (1) It is colorless in small amounts.\n   (2) It is a liquid only if pressurized or at very\n       low temperatures.\n   (3) Can cause severe burns, eye and lung injuries.\n   (4) Skin and respiratory related diseases aggravated by\n       exposure.\n   (5) Extreme exposure (5000ppm) can cause immediate death \n       from spasm, inflamation or Edema of larynx.\n\n\n     A material safety data sheet is included in appendix C.\n\n\n2.  Reactivity and Incompatibility.  \n\n    Avoid mixing with sulfuric acid or other strong mineral acids.\n    Avoid mixing with Hypochlorites (chlorine bleach) or other\n    halogens and sodium hydroxide. Avoid contact with galvanized\n    surfaces,copper,brass,bronze,aluminum alloys,mercury,gold,\n    silver, and strong oxidizers. Avoid heating. \n\n\n\n\nV.  Process Technology\n\n1.  Process Flow Diagram.    A simplified process flow\n    diagram of a typical Ammonia system  is shown in Appendix D.\n    The process description below refers to this diagram.\n\n2.  Process Description.\n\n    Ammonia is injected in the filter effluent for THM control\n    At the SWTP/GWTP gaseous Ammonia is continuously fed to the\n    Chlorine Contact Chamber to achieve a ratio of 3 parts CL2\n    to 1 part Ammonia residual in the effluent.Typically, about\n    33.3 pounds per day of chlorine is used for every 700,000 \n    gallons of effluent at the Water Plants (Surface and Ground).\n    \n  \n    Two one trhousand gallon"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 17873,
      "SummaryText": "gas/liquid containers are fabricated\n    to DOT specifications as large steel welded tanks or cylin\n    ders. The average container is about 40 inches in outside \n    diameter and about 96 inches in length. Holding a maximum \n    weight of 4,250 lbs."
    }
  ]
}