{
  "FacilityID": 17874,
  "FacilityName": "Okeechobee Utility Authority WWTP",
  "FacilityStr1": "1335 N.E. 39th Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Okeechobee",
  "FacilityState": "FL",
  "FacilityZipCode": "34972",
  "Facility4DigitZipExt": "8629",
  "FacilityCountyFIPS": "12093",
  "LEPC": "District 7 LEPC",
  "FacilityLatDecDegs": "28.245556",
  "FacilityLongDecDegs": "80.818611",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A5",
  "LatLongDescription": "ST",
  "FacilityURL": "N/A",
  "FacilityEmailAddress": "lfortner@ouafl.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Okeechobee Utility Authority",
  "OperatorStr1": "P.O. Box 835",
  "OperatorStr2": null,
  "OperatorCity": "Okeechobee",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "34973",
  "OperatorZipCodeExt": "0835",
  "RMPContact": "Landon C. Fortner Jr.",
  "RMPTitle": "Executive Director",
  "FTE": 6,
  "OtherEPAFacilityID": "1999-2-014529-1",
  "EPAFacilityID": "100000162824",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-10-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-10-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-10-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-03-22 00:00:00",
  "DeRegistrationEffectiveDate": "2005-01-10 00:00:00",
  "AnniversaryDate": "2004-10-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 27.28646,
  "FRS_Long": -80.8193,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 25222,
      "AltID": "Chlorine",
      "FacilityID": 17874,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 25870,
          "ProcessID": 25222,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 32551,
          "ProcessID": 25222,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 532551,
          "ProcessID": 25222,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17874,
      "SummaryText": "1.  Chlorine gas is used in water treatment process for the\n     purpose of disinfecting the effluent.  In those cases where\n     chlorine gas is supplied for one ton chlorine containers (i.e.\n     more than 1,500 lbs. is present on site)) the chlorine supply\n     system must comply with the requirements of 29 CFR 1910.119 -\n     Process Safety Management of Highly Hazardous Chemicals.  The \n     purpose of this document is to meet the requirements for a\n     written compilation of Process Safety Information, and to record\n     the results of the recently completed Process Hazards Analysis. \n     The process includes the Chlorine Supply and distribution system\n     from the ton cylinders up to the point the chlorinated effluent\n     is dispersed into the Contact Chamber, where the chlorine is\n     dissolved.  At this point, the potential for a release of highly\n     hazardous material as defined by OSHA does not exist.\n\n2.  This document provides guidelines to ensure the health and\n      safety of our employees and the general public where potential\n     releases of chlorine may occur when working with one ton chlorine\n     cylinders. The provision of these guidelines will be implemented\n     by facility personnel during routine maintenance and when there\n     is an unusual occurrence that could threaten human health, the\n     environment and property.  This document will be reviewed and\n     updated as needed, and at least annually.\n\n\nII.  Site description\n\n1.  The Surface Water Plant and Ground Water Plant provides\n     drinking water for approximately 19,000 people.  \n\n2.  At the Surface Water Treatment Plant the chlorine supply and\n     finished water pumps are on-site and located approximately 100\n     yards from the plant office.  The ton containers and associated\n     equipment is located at the southeast corner of the site on a\n     cement pad, outdoors, but roofed to protect cylinders from direct\n     sunlight.  Plant layout is depicted in Figure 5. At the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17874,
      "SummaryText": "Ground\n     Water Treatment Plant the ton cylinders and associated equipment\n     are located on the southwest corner of the site on a cement pad,\n     roofed and partially covered, protected from sunlight and located\n     approximately 25 yards from the plant office.  At the Waste Water\n     Treatment Plant the ton containers and associated equipment are\n     located at the north end of the Plant approximately 50 yards from\n     the office.   \n\nIII. Employee Participation\n\n1. Two operators, who are at least \"C\" level certified by the\n     Department of Environmental Protection, are required to be\n     present at all times whenever connecting or disconnecting one ton\n     chlorine cylinders.  Routine removal and installation of one-ton\n     chlorine cylinders shall take place only during normal working\n     hours (7:00AM to 3:00PM- Monday to Friday). The secondary\n     operator will perform the task and the shift operator is\n     designated the backup should an emergency arise.\n                                \n2.  The shift operator will also assist in the transporting of\n     empty and full cylinders to their stations with the cylinder\n     covers (bonnets) in place.  A shift operator will supervise the\n     tasks of disconnecting and reconnecting of chlorine cylinders. \n     This requires the operator actually performing the disconnecting\n     and reconnecting tasks and breathing with SCBA before beginning\n     and during this work. The operator will stand by upwind,\n     observing work being performed from a safe distance within visual\n     contact and ready to assist should an emergency arise.  This\n     requires that a SCBA be worn, but is not required to have face\n     mask connected unless assisting in the actual disconnecting or\n     reconnecting of chlorine cylinders. Both operators will work\n     together in moving of empty cylinders and their replacement with\n     full ones on the scales.  A SCBA must be worn but masks does not\n     have to be donned duri"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17874,
      "SummaryText": "ng these operations.  Ensure that cylinder\n     covers are installed during movement of chlorine cylinders.\n\nIV.  Material Properties and Hazards\n\n1. General.  Chlorine is one of the chemical elements. It is a\n     member of the halogen (or salt-forming group) along with\n     fluorine, bromine, iodine and astatine.  Chlorine occurs natu-\n     rally only in a combined state, primarily  with sodium as salt\n     (NaCl).  As an element, the atomic symbol is Cl, its atomic\n     weight is 35.453, and the atomic number is 17. The molecular\n     symbol is Cl2 and the molecular weight is 70.906.  It is\n     manufactured predominately by electrolytic cell process and is\n     widely used for treating municipal and industrial water supplies. \n\n            a. Chlorine gas is a severe respiratory irritant, and chlorine\n               liquid is irritating to the skin.  The gas has a pungent odor\n               detectable at concentrations of less than 1 ppm.  A few breaths\n               of air with a concentration of 100 ppm of Chlorine is likely to\n               be fatal.  The following exposure limits apply:  \n\n               Permissible Exposure Limit (PEL) is 1 ppm (ceiling) and time\n               weighted Average (TWA) is 3mg/m3 (ceiling).\n\n\n            b. Chlorine has the following physical and chemical\n               characteristics:\n\n            (1) It is colorless in small amounts.\n            (2) It is a liquid only if pressurized or at very\n               low temperatures.\n            (3)It has an expansion rate of 457 to 1, or, simply\n                stated, 1 part of liquid evaporates to 457 parts\n                of gas.\n            (4) It is 2.5 times heavier than air in the gaseous\n                state.\n            (5) It is not flammable, however, it supports\n                combustion.\n            (6) It reacts violently with hydrocarbons and other\n                volatile substances.\n            (7) It will cause most metals to burn at elevated\n              "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 17874,
      "SummaryText": "  temperatures.\n            (8) It is only slightly soluble in water.\n            (9) It reacts with water (moisture) to produce\n                hydrochloric acid (HCl) and hypochlorous acid\n                (HOCl).\n\nA material safety data sheet is included in appendix C.\n\n2.  Reactivity and Incompatibility.  Chlorine is a strong\n     oxidizer and will react chemically with many substances, often\n     with the evolution of heat.  At temperatures above approximately\n     150' F, chlorine reacts vigorously with many metals, including\n     steel.  \n     Chlorine systems should be kept as dry as possible.  Chlorine\n     reacts with water evolving heat and producing a corrosive acidic\n     solution.  In the event of a leak, water sprays should not be\n     used since the resulting corrosion will worsen the leak. Chlorine\n     gas will react with ammonia gas to produce a visible cloud of\n     ammonia chloride.  This property is used for leak checking by\n     squirting ammonia gas from the vapor space above an ammonium\n     hydroxide solution over any suspected leakage areas while looking\n     for a white plume.\n\n\n\n\nV.   Process Technology\n\n1.   Process Flow Diagram.    A simplified process flow\n     diagram of a typical chlorinator system using one-ton chorine\n     cylinders is shown in Appendix D. The process description below\n     refers to this diagram.\n\n2.   Process Description.\n\n            a. Chlorine is injected in the filter effluent for\n               disinfection.  At the WTP/WWTP gaseous chlorine is continuously\n               fed to the Chlorine Contact Chamber to achieve a 1.0 to 10.0 ppm\n               residual total chlorine level in the effluent.  Typically, about\n               100 pounds per day of chlorine is used for every 700,000 gallons\n               of effluent at the Water Plants (Surface and Ground) and 60 to 70\n               pounds for every 600,000 gallons of effluent at the Waste Water\n               Treatment Plant.\n  \n            b. Four one "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 17874,
      "SummaryText": "ton gas/liquid chlorine containers are fabricated\n               to DOT specifications as large steel welded tanks or cylinders. \n               The average container is about 30 inches in outside diameter and\n               about 82 inches in length.  Average tare weight is 1500 pounds,\n               average gross weight is about 3,500 pounds, leaving 2,000 pounds\n               net weight.  Each end of a ton container is concave, with one end\n               equipped with two valves protected by a removal bonnet housing. \n               The valves are connected to eduction pipes located inside the\n               container. The valves must be aligned vertically so that the\n               upper valve is used to withdraw gaseous chlorine from above the\n               liquid level in the container.  The lower valve is for liquid\n               withdrawal and is not to be used.\n\n            c. There are six to eight fusible metal plugs in a one ton\n               container, three to four in each end.  These serve as an over-\n               pressure relief device.  The internal pressure of the container\n               is equal to the vapor pressure of liquid chlorine which varies\n               with ambient temperature.  A container exposed to ambient\n               temperatures of 0 degrees to 100 degrees will have an internal\n               pressure ranging from 14 psig to 143 psig.  In the event of a\n               fire or overheating, at a temperature of about 160 degrees and a\n               resulting vapor pressure of approximately 320 psig, the fusible\n               plugs will melt and release the contents of the container to the\n               atmosphere. The DOT Hydrostatic pressure specification of the\n               container is 500 psig.\n\n            d. Chlorine container trunnions are used for supporting and\n               spacing the containers and allowing for easy rotation of the\n               containers to correctly position the outlet valves.\n\n      "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 17874,
      "SummaryText": "      e. Because chlorine poses a serious health risk if released to\n               the atmosphere, chlorine is fed from the one-ton containers\n               through a fail-safe device called a chlorinator.  A chlorinator\n               system includes two main components, a vacuum regulator which\n              mounts directly to the upper gas valve of the one-ton chlorine\n              container by means of a lead gasket positive yoke assembly, and\n              an ejector which uses effluent flow to create the necessary\n              vacuum. From the ejector the chlorine gas mixes with the effluent\n              before being injected into the chlorine contact chamber through a\n              difuser.  The feed system from the container to the ejector is\n              operated under vacuum, so any small leaks pull in air instead of\n              releasing chlorine.\n\n            f. The chlorinator is equipped with a small 25 watt heater\n              element.  As chlorine is drawn into the chlorinator from the one-\n              ton container, it is deflected down into a drip leg where any\n              liquid chlorine is vaporized, permitting only gas to enter the\n              regulating portion of the chlorinator.\n\n            g. A vent valve with plastic tubing is provided with the chlo-\n              rinator unit.  The vent tube is routed to vent to the atmosphere. \n              Also provided with the chlorinator is a chlorine supply\n              indicator.  A green indication represents the presence of\n              chlorine and a red indication represents a loss of chlorine\n              supply and that the inlet safety valve is closed.\n\n            h. Appendix E shows vendor details of the chlorinator.  Water,\n              at about 40 to 60 psig pressure, from a two inch supply line is\n              piped to the ejector. This circuit contains a shutoff valve, and\n              pressure gauge.  As this water flows through the ejector at high\n              "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 17874,
      "SummaryText": "velocity, it creates a vacuum in the chlorine feed tubing which\n              opens a spring-loaded check valve contained in the ejector\n              assembly. When the check valve at the ejector opens this permits\n              the vacuum to travel back through the plastic vacuum tubing to\n              the chlorinator.  This causes the inlet safety valve in the\n              chlorinator to open, initiating chlorine gas flow.  A filter\n              located in the chlorinator removes any foreign material from the\n              gas.  A spring-opposed diaphragm regulates the vacuum at this\n              point to allow the gas to pass through a rotameter.  A manual\n              feed rate control valve is provided to regulate the chlorine gas\n              flow to the ejector.  From the ejector, the gas is thoroughly\n              mixed with water and carried through schedule eighty (80) PVC\n              pipe to the diffuser located in the Chlorine Contact Chamber for\n              final dispensing of the chlorinated solution.\n\n\n\n3. Plant Specific Characteristics.  The Okeechobee Surface Water\n     Treatment Plant, Ground Water Treatment Plant and Waste Water\n     Treatment Plant differ from the general description as shown in -\n     Appendix D, a schematic of a chlorine feed system. Specifically,\n     Two one-ton cylinders are interconnected by a vacuum operated\n     switch over valve which feeds to the ejector.  Chlorinated\n     effluent can then be fed into an intermediate pumping station\n     then pumped to a 1.5 million gallon contact chamber.  A copy of\n     the instruction manual for Capital Controls Advance` 200 Series\n     Gas Feeders is located in Appendix E.  A copy of the instruction\n     manual for Capital Controls Automatic Switch over Module, Vacuum\n     Type, is located in Appendix E.  A copy of the instruction manual\n     for Capital Controls Advance` Gas Feeder (Ton Mounted) is located\n     in Appendix E.\n\n4. Maximum Intended Inventory.  Five one-t"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 17874,
      "SummaryText": "on containers with\n     one in use, one valved in and one on standby, and a maximum of\n     three back-up containers."
    }
  ]
}