{
  "FacilityID": 18010,
  "FacilityName": "Tanimura & Antle, Inc.:  Tres Picos Facility",
  "FacilityStr1": "20009 So. Derrik Ave",
  "FacilityStr2": null,
  "FacilityCity": "Cantua Creek",
  "FacilityState": "CA",
  "FacilityZipCode": "93608",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": null,
  "FacilityLatDecDegs": "36.436528",
  "FacilityLongDecDegs": "-120.394528",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 22002509,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Tanimura & Antle, Inc.",
  "OperatorStr1": "P.O. Box 4070",
  "OperatorStr2": null,
  "OperatorCity": "Salinas",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93902",
  "OperatorZipCodeExt": null,
  "FTE": 25,
  "OtherEPAFacilityID": "CAL0015869",
  "EPAFacilityID": "100000163119",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-10-12 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-10-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-10-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-10-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-10-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 36.43653,
  "FRS_Long": -120.39453,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 25447,
      "AltID": "Refrigeration Systems",
      "FacilityID": 18010,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 33163,
          "ProcessID": 25447,
          "ChemicalID": 56,
          "Quantity": 30500.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 26103,
          "ProcessID": 25447,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 14116,
              "Process_NAICS_ID": 26103,
              "SafetyReviewDate": "1998-05-01 00:00:00",
              "PHA_Date": "1998-03-11 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-06-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Ammonia  Deffuser System",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Equipment & Piping Amchors",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Wind Sock",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-05-01 00:00:00",
              "TrainingReviewDate": "1998-05-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-05-01 00:00:00",
              "EquipmentInspectionDate": "1999-10-12 00:00:00",
              "EquipmentTested": "Refrigeration Equipment",
              "ChangeMgmtDate": "1998-05-01 00:00:00",
              "ChangeMgmtReviewDate": "1998-05-01 00:00:00",
              "PreStartupReviewDate": "1998-05-01 00:00:00",
              "ComplianceAuditDate": "1998-10-12 00:00:00",
              "AuditCompletionDate": "2000-06-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-05-01 00:00:00",
              "HotWorkPermitReviewDate": "1998-05-01 00:00:00",
              "ContractorSafetyReviewDate": "1998-05-01 00:00:00",
              "ContractorSafetyEvalDate": "1998-05-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "There are both fixed and portable type refrigeration systems at this facility.  All are being treated as one process as there are no risk differences except that the portable units are not tied into an alarming system.  Operators are present whenever these units are active.",
              "_chemicals": [
                {
                  "PrimaryKey": 20449,
                  "PreventionProgram3ID": 14116,
                  "ProcessChemicalID": 33163
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 18010,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-05-01 00:00:00",
    "ERTrainingDate": "1999-04-01 00:00:00",
    "CoordinatingAgencyName": "Fresno County Health Department",
    "CoordinatingAgencyPhone": "2094453271",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18010,
      "SummaryText": "EXECUTIVE SUMMARY\n\n1. PREVENTION AND RESPONSE\n\nTanimura & Antle operates a shipping and cooling facility at Cantua Creek, CA. in addition to other similar facilities.  Risk prevention and emergency response procedures are in place at all T&A facilities.  The same management and maintenance personnel are responsible for maintaining the ammonia refrigeration equipment to prevent accidents, and for responding to an emergency.  The Emergency Response Plan lists the responsible personnel and the policies for responding to an accident involving the regulated substance.\n\nThere are both portable and fixed refrigeration systems onsite and all have safeties to detect unsafe operating conditions.  The fixed system supports the main cold storage facility and has an ammonia detection system tied into an alarm system that is monitored 24 hours per day.  The portable systems have no detection since the units are outdoors.  Operators are present to monitor these units when they are running.  There is a list of responders experienced with ammonia refrigeration that would respond and determine specific responses for any incident.  Safeties and detection equipment are tested and maintained by experienced maintenance personnel as spelled out in the SOPs (Stand Operating Procedures) and the maintenance program.\n\n2. STATIONARY SOURCE AND SUBSTANCE DESCRIPTION\n\nAt the Cantua Creek facility, ammonia refrigeration systems are used for cold storage and  produce precooling.  A fixed system is attached to the cold storage building and is used for cold storage and pressure cooling.  It also supports one vacuum tube used for product precooling.  The portable refrigeration equipment is trailer mounted and supports additional vacuum tubes for produce precooling.  The fixed refrigeration system is new and will be started in October, 1999.  Portable units vary in age but are well maintained and in good condition.  The total charge for the all the refrigeration systems is approximately 30,500 LBS. ma"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18010,
      "SummaryText": "in cold storage building and the fixed system refrigeration equipment locations. \n\n3.  RELEASE SCENARIOS\n\nBoth a worse case and an alternate release scenario were modeled for this RMP utilizing a computer modeling program.  The worse case was an release of the entire ammonia charge of the largest system in 10 minutes with ambient conditions as required by EPA regulations.  This is a highly unlikely or even impossible scenario.  The alternate was a release for 24 minutes averaging approximately 100 LBS/minute.  This is a more probable release due to items such as rotating seals, pressure relief valves, leaks in piping, charging system or draining oil.  The modeling software used was \"A Real Locations Of Hazardous Atmospheres\" (ALOHA).  Both scenarios were considered releases in a rural setting.  Release plumes were plotted on maps which show the location of populations, schools,  public areas, and acute care facilities if effected by the release.  The mapping software utilized was \"Mapping Application for Response and Planning of Local Operational Tasks\" (MARPLOT).  Effected populations were estimated using \"Land View III\", a computer census modeling program from the Bureau of Census that is able to calculate census data of areas defined on MARPLOT generated maps.\n\nOffsite consequences were analyzed at 200 PPM  level of concern for the two above release scenarios.  Results show the worse case scenario having a potential endpoint of 2.2 miles.  If the area was encircled with the 2.2 mile endpoint distance as the radius, the total area population would be approximately 300 as per Land View.  This is a rural area with only residences and farm employees being effected.  Part of a Interstate 5 is in the potentially effected area.  The alternate scenario has considerably less offsite consequence with an endpoint of 1,344 feet at 200 PPM.  Only Interstate 5 would be effected at 200 PPM. \n\nThere are various measures in place to limit the endpoint distances of a release.  One"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18010,
      "SummaryText": " is an ammonia monitoring system for early detection.  Relief valves for the fixed system are tied into a water diffuser tank rather than piped to ambient.  There is an emergency control box for the fixed system which allows for manual pressure release. The control box is also tied into the water diffuser tank.  Preventive maintenance and safety inspections are used to insure equipment and piping is maintained and operating in a safe manner.\n\n4. GENERAL RELEASE PREVENTION PROGRAM\n\nT&A maintains a release prevention program to eliminate or minimize releases.  The program includes regular inspections, monitoring equipment and logging conditions, scheduled maintenance, and operator training.  Releases are documented and analyzed for ways to prevent a similar future release.  A Risk Management Program which includes accident prevention procedures for the ammonia refrigeration system is maintained onsite. \n\nThe ammonia refrigeration system has specific safety procedures to prevent a release.  Operators and mechanics are trained for safe operation and maintenance of the refrigeration system.  They are also trained in emergency response procedures in the event of an ammonia release.  There are emergency shut off switches outside the mechanical room of the fixed system for shutting down the equipment.  An alarm and detection system will monitor the facility for unsafe ammonia concentration levels and for operating conditions outside of safety set points.  Monitoring is 24 hours per day.  An emergency control box allows system pressures to be relieved without releasing to ambient.  \n\n5. FIVE YEAR ACCIDENT HISTORY\n\nThis is a new facility and there have been no accidents at this facility.\n\n6. EMERGENCY RESPONSE PROGRAM\n\nIn event of a release, certain personnel are designated to determine the potential hazard and coordinate response procedures.  The emergency coordinator is responsible for contacting emergency response agencies, schools, daycare centers, and acute care faciliti"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 18010,
      "SummaryText": "es that may be effected by the release.  The coordinator will also be responsible for evacuation of employees if necessary, and for coordination with community emergency responders if offsite evacuations are required.  \n\n7. PLANNED CHANGES TO IMPROVE SAFETY\n\nSpecific recommendations resulting from the PHA are listed in the Risk Management Program kept on file at this facility.  All refrigeration equipment is well maintained and operated in a safe manner by trained personnel.  Operating, maintenance, training and safety procedures will be formalized with improved written documentation."
    }
  ]
}