{
  "FacilityID": 18167,
  "FacilityName": "Stephenville Wastewater Treatment Plant",
  "FacilityStr1": "County Road 454",
  "FacilityStr2": null,
  "FacilityCity": "Stephenville",
  "FacilityState": "TX",
  "FacilityZipCode": "76401",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48143",
  "LEPC": "Stephenville Fire Department",
  "FacilityLatDecDegs": "32.199722",
  "FacilityLongDecDegs": "98.188889",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Stephenville",
  "OperatorStr1": "354 North Belknap",
  "OperatorStr2": null,
  "OperatorCity": "Stephenville",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76401",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000059134",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-10-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.270443,
  "FRS_Long": -98.246717,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 25641,
      "AltID": "Chlorine Process",
      "FacilityID": 18167,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 33372,
          "ProcessID": 25641,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 26304,
          "ProcessID": 25641,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 14184,
              "Process_NAICS_ID": 26304,
              "SafetyReviewDate": "1999-05-07 00:00:00",
              "PHA_Date": "1999-05-07 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-07 00:00:00",
              "TrainingReviewDate": "1999-05-07 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-07 00:00:00",
              "EquipmentInspectionDate": "1999-05-07 00:00:00",
              "EquipmentTested": "chlorine storage equipment, valves, hoist, injection equipment, piping, leak detectors, associated process equipment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-05-07 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-07 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-07 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-05-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 20524,
                  "PreventionProgram3ID": 14184,
                  "ProcessChemicalID": 33372
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 18167,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-07 00:00:00",
    "ERTrainingDate": "1999-05-07 00:00:00",
    "CoordinatingAgencyName": "Stephenville Fire Department",
    "CoordinatingAgencyPhone": "2549181210",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "40 CFR Part 122",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 18167,
      "SummaryText": "hazardous effects of chemical releases and to minimize the effects of releases on the general public.  The program is routinely reviewed and updated to reflect personnel and regulatory changes.\n\nPlanned Changes for Improved Safety\n\nIdeas for changes to improve safety are actively sought from employees.  Employee meetings that focus on safety issues are held regularly at the Stephenville WWTP.  Employees are encouraged and trained to recognize hazards and to present ideas to eliminate them or to minimize the potential consequences of those hazards.\n\nAs part of the development of the Stephenville WWTP program, process hazard analyses were conducted with key employees to meet the prevention program requirements.  During these sessions, recommendations were made for the purpose of improving safety and preventing accidental chemical releases.  Each recommendation has been or will be considered for implementation.  Though not all recommendations may be implemented, all will be considered.  The exercise has provided all affected employees with a heightened awareness of safety issues related to the covered process."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 18167,
      "SummaryText": "Stephenville Wastewater Treatment Plant\n\nRMP Plan Executive Summary\n\nExecutive Summary\n\nThis executive summary provides a brief overview of the Risk Management Program (RMP) and the associated policies at the Stephenville Wastewater Treatment Plant (Stephenville WWTP), owned by the City of Stephenville and operated by Operations Management International, Inc. (OMI).\n\nPrevention and Response Policies\n\nOMI believes that it is important to provide a safe workplace to its employees and minimize the impact of its operations on the surrounding community and the environment.  Accordingly, OMI has developed proactive safety and environmental programs, which are reliant upon active employee participation and management leadership and support.  This same proactive philosophy was employed in the development and implementation of the Stephenville WWTP RMP for the chlorine system.  OMI has determined that the OSHA Process Safety Management standard also applies to the personnel at the Stephenville WWTP and therefore has prepared this RMP to comply with the RMP Program 3 requirements.  By doing so, OMI affirms its proactive safety and environmental philosophy and acknowledges the inherent value of full RMP compliance.\n\nThe RMP prevention program is arguably the most important element of the rule.  Its program elements require the active participation of facility employees and management in conducting activities aimed at preventing accidental releases of regulated chemicals.  If prevention activities could be completely successful, there would be no need for emergency response activities, since no releases would occur.  \nAccordingly, a well-developed and properly-implemented prevention program will lower the possibility of an accidental release and minimize the consequences of a release should one occur.\nOMI takes an active role in preventing accidental releases at all of the facilities it operates by ensuring that its employees are well-informed regarding the hazards associated w"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18167,
      "SummaryText": "ith the regulated processes (e.g., chlorine at the Stephenville WWTP) and actively participated in comprehensive process hazard analyses.  The employees that work on the chlorine system are properly trained in the safe operation of the covered processes and the safe handling of treatment chemicals.  They are aided in this work by complete, understandable system operating procedures.\n\nOMI management understands its duty to provide a safe working environment and to take measures to prevent accidents that may have an effect on the surrounding community.  This understanding is reflected in procedures described and referenced in the Stephenville WWTP RMP procedures and policies.\n\nAs for emergency response, OMI has established and maintained procedures for emergency notification and response.  These are reviewed with employees on a periodic basis and revised to accommodate changes in staffing when they occur.\n\nStationary Source and Regulated Substances\n\nThe Stephenville WWTP is located at RR No. 3, Box 96R, Erath County, Texas.  The Stephenville WWTP treats wastewater through a series of physical and chemical treatment operations.  This wastewater treatment facility is an activated sludge, oxidation ditch aeration plant with both primary and secondary anaerobic digesters.  The process equipment also includes vacuum filters. The plant has an average design flow of 3.0 MGD.\n\nThe Stephenville WWTP utilizes chlorine as a biocide in the treatment of wastewater.  The chlorine is stored in one-ton containers with a maximum intended inventory of two containers (4,000 pounds) on site.  Therefore, the Stephenville WWTP is regulated under the RMP rule due to the volume of chlorine stored and used at the facility.\n\nRelease Scenarios\n\nWorst-case and alternative release scenarios have been determined after careful review of the regulation and consideration of the storage vessel configuration at the facility.  For the worst-case release scenario, the regulation is clear.  The assumption"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18167,
      "SummaryText": "is that a full one-ton container of chemical is released over a ten-minute period.  No active mitigation may be considered.  Worst-case meteorological conditions as specified in the RMP regulation are also assumed to be present.  The release is also assumed to occur outdoors.\n\nFor the alternative release scenario, the facility reviewed the consequences of a valve breaking off at the container connector during hookups in the storage area.  No active mitigation was considered.\nResults of the off-site consequence analyses are described in Sections 2 and 3 of the RMP*Submit plan for the Stephenville WWTP.\n\nPrevention Steps for Chlorine\n\nThe prevention program and chemical-specific prevention steps are described in detail in the Stephenville WWTP RMP manual.  The prevention program includes the following elements:\n\n7 Process safety information, which includes information pertaining to the hazards of chlorine in the process, process technology, and process equipment\n\n7 Process hazard analysis (PHA), which includes a systematic evaluation (by an employee team) of:  the hazards of the chlorine process, identification of previous process incidents, engineering and administrative controls, consequences of failure of the engineering and administrative controls, facility siting, human factors, and possible safety and health effects of failure of controls\n\n7 Operating procedures, which include steps for each operating phase, operating limits, safety and health considerations, and safety systems and their functions\n\n7 Training for each Stephenville WWTP employee involved in operating the chlorine system\n\n7 Mechanical integrity procedures to maintain the on-going integrity of the chlorine process equipment\n\n7 Management of change procedures to manage changes (other than \"replacements in kind\") to the chlorine system\n\n7 Pre-startup safety review for additions or significant modifications to the chlorine process, or any new regulated chemical process\n\n7 Compliance audits at least e"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 18167,
      "SummaryText": "very three years from 1999 to evaluate Stephenville WWTP RMP compliance\n\n7 Incident investigation, to be conducted and documented for each incident that resulted in, or could have reasonably resulted in, a catastrophic release of chlorine from the Stephenville WWTP\n\n7 Employee participation in the development and implementation of the Stephenville WWTP RMP, and employee access to RMP information\n\n7 Hot work prohibition policy on or near the chlorine system when chlorine is present in the affected section of the process\n\n7 Contractor management program, to ensure appropriate evaluation and selection of qualified contractors for work on or near the chlorine system, proper notification of contractors regarding known chlorine system hazards and the Stephenville WWTP emergency evacuation plan, limited access to the chlorine process, and evaluation of contractor performance\n\nIn addition to these elements, the chlorine storage area at the Stephenville WWTP is equipped with a chlorine leak detection device that continuously monitors the air for chlorine gas.  If the chlorine sensor detects a specified level, audio and visual alarms will be activated.  The alarm system is maintained and tested on a regular basis to ensure proper operation should there be a chlorine release.  Management of Change procedures will be used for the upgrades to the chlorine system.\n\nAccident History\n\nWithin the five-year period prior to the submittal of this RMP, there were no accidental releases of chlorine meeting the requirements of 40 CFR 68.42.\n\nEmergency Response Program\n\nThis facility has established and maintains an emergency response program that is coordinated with local response agencies, including the Stephenville Fire Department.  The program is described in detail in the Stephenville WWTP RMP manual and meets the requirements of 40 CFR 68.95, which include facility notification of emergency responders and evacuation.  The goals of the program are to protect onsite employees from the"
    }
  ]
}