{
  "FacilityID": 18334,
  "FacilityName": "Formosa Plastics Corporation, Delaware",
  "FacilityStr1": "780 Schoolhouse Road",
  "FacilityStr2": null,
  "FacilityCity": "Delaware City",
  "FacilityState": "DE",
  "FacilityZipCode": "19706",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "10003",
  "LEPC": "New Castle LEPC",
  "FacilityLatDecDegs": "39.587361",
  "FacilityLongDecDegs": "-75.65075",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.fpcusa.com",
  "FacilityEmailAddress": "kklinger@fpcusa.fdde.com",
  "FacilityDUNS": 106238223,
  "ParentCompanyName": "Formosa Plastics Corporation, U.S.A.",
  "Company2Name": null,
  "CompanyDUNS": 39444004,
  "Company2DUNS": null,
  "OperatorName": "B.D. Chou",
  "OperatorStr1": "P.O. Box 320",
  "OperatorStr2": "780 Schoolhouse Road",
  "OperatorCity": "Delaware City",
  "OperatorStateFIPS": "DE",
  "OperatorZipCode": "19706",
  "OperatorZipCodeExt": null,
  "FTE": 109,
  "OtherEPAFacilityID": "19706frmspschoo",
  "EPAFacilityID": "100000127631",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-03-31 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-10-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2018-12-10 00:00:00",
  "DeRegistrationEffectiveDate": "2017-09-30 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.586111,
  "FRS_Long": -75.649439,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 25843,
      "AltID": null,
      "FacilityID": 18334,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 33587,
          "ProcessID": 25843,
          "ChemicalID": 101,
          "Quantity": 425000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 33588,
          "ProcessID": 25843,
          "ChemicalID": 29,
          "Quantity": 240000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 26509,
          "ProcessID": 25843,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 14247,
              "Process_NAICS_ID": 26509,
              "SafetyReviewDate": "1998-07-27 00:00:00",
              "PHA_Date": "1998-05-14 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-04-17 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-18 00:00:00",
              "TrainingReviewDate": "1999-06-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-29 00:00:00",
              "EquipmentInspectionDate": "1999-06-03 00:00:00",
              "EquipmentTested": "DC-302B",
              "ChangeMgmtDate": "1999-05-21 00:00:00",
              "ChangeMgmtReviewDate": "1998-11-11 00:00:00",
              "PreStartupReviewDate": "1998-08-03 00:00:00",
              "ComplianceAuditDate": "1997-08-01 00:00:00",
              "AuditCompletionDate": "1999-09-30 00:00:00",
              "IncidentInvestigationDate": "1996-01-22 00:00:00",
              "InvestigationChangeDate": "1996-02-29 00:00:00",
              "ParticipationPlansReviewDate": "1998-05-15 00:00:00",
              "HotWorkPermitReviewDate": "1999-01-05 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-10 00:00:00",
              "ContractorSafetyEvalDate": "1998-07-08 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 20597,
                  "PreventionProgram3ID": 14247,
                  "ProcessChemicalID": 33587
                },
                {
                  "PrimaryKey": 20598,
                  "PreventionProgram3ID": 14247,
                  "ProcessChemicalID": 33588
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 18334,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-11-10 00:00:00",
    "ERTrainingDate": "1998-12-31 00:00:00",
    "CoordinatingAgencyName": "Delaware City Fire Department",
    "CoordinatingAgencyPhone": "3028349336",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18334,
      "SummaryText": "A. Accidental Release Prevention and Emergency Response Policies\n\nAt Formosa Plastics Corporation, Delaware we are committed to providing a safe and healthy work environment to our employees.  In an effort to accomplish this goal the facility has implemented policies and procedures to ensure the safe use of chemicals at the facility.\n\nAll new chemicals introduced into the process and any changes to the operating conditions must go through a Management of Change approval process.  This process requires a review of the potential impact upon the operation of the facility by the Safety Department, Environmental Department, Production Department, Maintenance Department, Technical Department, Technical Service Department, PSM Coordinator and General Manager's Office. \n\nIn addition to the approval for use through the Management of Change process it is necessary for the Chemical Approval Procedure to be followed if a new chemical is to be purchased or if a change is to occur in the existing storage arrangements of a chemical. This review is conducted by the Safety Department and the Environmental Department to ensure the integrity of the product and the safety of employees and the community as it pertains to the storage and handling of chemicals.\n\nOnce approval to purchase and use a chemical has been obtained the Department in which the chemical is to be used is responsible for providing the necessary training on the safe use and handling of the chemical.  Information that is covered during this training includes; Hazard Communication information, PPE requirements, the details of the SOP for handling the chemical.\n\nAs a final step to ensuring the safety to our employees and to the surrounding community, routine compliance audits are conducted by the Safety Department, Environmental Department, Shift Supervisors and Hourly Employees.  These audits are designed to ensure that the procedures are effective at controlling potential hazards and ensuring that the procedures are be"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18334,
      "SummaryText": "ing properly followed.\n\nIn the event that an emergency condition were to develop the site shift supervisor would act as the incident commander until he would be relived by the local fire chief.  At this point the fire chief would serve as the incident commander with extensive consultation being made with the site shift supervisor.  Through this team effort the emergency would be controlled quickly and safely.\n\nB. Facility Description and Regulated Substances Handled \n\nFACILITY DESCRIPTION\n\nThe first sections of the Delaware City PVC plant were built in 1966 by Stauffer Chemical Co. The facility was acquired in 1981 by the Formosa Plastics Group.  The current plant property line covers 112 acres of which approximately 30 acres is leased as farmland.  The site employs 110 full-time employees.  The major components of the facility involve two PVC Polymerization units, two dryer units, an automatic bagging plant, waste water treatment plant, and the finished goods warehouse.  The plant production capability is 180 tons of PVC Resin per day. \n\nPRIMARY ACTIVITIES:\n\nThe primary activities carried out at the facility involve polymerization of Vinyl Chloride and Vinyl Chloride / Vinyl Acetate Copolymers, drying of Poly Vinyl Chloride, Packaging of Poly Vinyl Chloride, Storage and Shipping of Poly Vinyl Chloride, and treatment of process waste water.\n\nREGULATED SUBSTANCES:\n\nVinyl Chloride - Three 425,000 pound storage tanks\n\nVinyl Acetate - One 240,000 pound storage tank\n\nPRODUCTION PROCESS:\n\nThe facility production process involves converting Vinyl Chloride to Poly Vinyl Chloride Dispersion Resins and Specialty Resins.  In order to produce Poly Vinyl Chloride, Vinyl Chloride is received from rail car and unloaded into storage tanks.  From the storage tanks the Vinyl Chloride is then transferred into reactors.  Under controlled temperature and pressure conditions in a water medium, the Vinyl Chloride molecules are linked together to form long chains.  These long chains are ca"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18334,
      "SummaryText": "lled polymerized vinyl chloride or Poly Vinyl Chloride.\n\nIn order to produce Specialty Resins, an additional raw material, vinyl acetate is used at the facility.  The use of this raw material allows the production of co-polymers with vinyl chloride.  These products provide improved fusion rate properties which allow users to process the resin at lower operating temperatures.  Typical applications are flooring, laminating, adhesives, automotive sealants and various coatings.\n\nAfter the Poly Vinyl Chloride is created it is then dried through a natural gas fired dryer.  The dried material is then deagglomerated and transferred into storage silos.  From the storage silos the final product is packaged into 50 pound bags and placed on pallets through an automatic bagging and palletizing line.  The final product is stored in our finished goods warehouse from where it is transported via tractor trailer throughout the U.S and Canada.\n\nAs part of the reaction process a large volume of water is required.  All remaining water is treated through the facility's waste water treatment plant prior to final discharge to the plant outfall (Delaware River).\n\nFinal products produced at the Delaware City plant are used for medical examination gloves, adhesives, carpet backing, floor covering, automotive sealants and upholstery, bottle cap seals, traffic safety cones, automotive air filter gaskets and many other useful finished products.\n\nC. Worst-Case Release and Alternate Case Scenarios\n\nWORST CASE RELEASE SCENARIO:\n\nFLAMMABLE WORST CASE:\n\nThe worst case flammable incident that could occur at the facility involves the release of Vinyl Chloride.  The scenario that was chosen was to consider the impact on the community if one of the storage tanks were to develop a leak and explode.  In this scenario, 425,000 pounds of vinyl chloride would be released within 10 minutes and the resulting vapor cloud would then exploded as the result of an ignition source.  Using EPA's RMP*COMP modeling prog"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 18334,
      "SummaryText": "ram it was determined that the impact of this scenario would be felt 0.4 miles away from the point of the leak.  In the impact zone no residences would be impacted but a neighboring industrial facility would be impacted.\n\nAs part of conducting the evaluation of the impact of this scenario an administrative control was considered which limits the amount of vinyl chloride stored in the bullets to 70% of the total storage capacity of the tank.  Thus the reduction of the quantity of material released would be 182143 pounds.  The reasoning behind documenting this scenario as the worst case flammable release was based upon the fact that the amount of material stored in one location is largest at the storage bullets and the location of the storage tanks is closest to the facility's boundary line.\n\nTOXIC WORST CASE:\n\nThe worst case toxic incident that could occur at the facility involves the release of Vinyl Acetate.  The scenario that was chosen was to consider the impact on the community if a the storage tank were to rupture and spill the entire contents of the tank.  In this scenario, 240,000 pounds of vinyl acetate would be released within 10 minutes and the resulting pool of chemical then vaporized.  Using EPA's RMP*COMP modeling program it was determined that the impact of this scenario would be felt 0.7 miles away from the point of the spill.  In the impact zone it has been estimated that 60  residences, and neighboring industrial facilities would be impacted.\n\nAs part of conducting the evaluation of the impact of this scenario a passive mitigation system 40' x 41' x 3' dike surrounding the storage tank was considered to limit the impact of the release.  The reasoning behind documenting this scenario as the worst case toxic release was based upon the fact that all Vinyl Acetate is stored in this tank.\n\nALTERNATIVE CASE RELEASE SCENARIO:\n\nFLAMMABLE ALTERNATIVE CASE:\n\nThe alternative case flammable incident that could occur at the facility involves the release of Vinyl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 18334,
      "SummaryText": "Chloride.  The scenario that was chosen was to consider the impact on the community if one of the supply pipelines were to be severed and the resulting leak created an explosion.  In this scenario, 28,700 pounds of vinyl chloride would be released within 1 minute and the resulting vapor cloud then exploded as the result of an ignition source.  Using EPA's RMP*COMP modeling program it was determined that the impact of this scenario would be felt 0.1 miles away from the point of the leak.  In the impact zone no residences would be impacted nor would any neighboring industrial facility would be impacted.\n\nThe passive mitigation considered in this scenario involves the fact that an excess flow valve is installed on the supply line.  This valve is designed to shut off the flow of vinyl chloride immediately when a flow rate of 500 gallons per minute is detected.\n\nTOXIC ALTERNATIVE CASE:\n\nThe alternative case toxic incident that could occur at the facility involves the release of Vinyl Acetate.  The scenario that was chosen was to consider the impact on the community if a pipeline was severed during the charging of a batch.  The result would be a pool of material spilled to the ground or floor.  In this scenario, 1,080 pounds of vinyl acetate would be released within over a 7 minute period and the resulting pool of chemical then vaporized.  Using EPA's RMP*COMP modeling program it was determined that the impact of this scenario would be felt 0.1 miles away from the point of the spill.  In the impact zone no residences would be impacted but a neighboring industrial facility would be impacted.\n\nThe active mitigation system considered in this scenario involves an administrative control.  The facility has established a procedure that requires only 1080 pounds of vinyl acetate to be charged into a reactor at a time.\n\nD. General Accidental Release Prevention Program\n\nOSHA PSM\n\nDue to the fact that the facility uses stores and handles Vinyl Chloride and Vinyl Acetate, and the fa"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 18334,
      "SummaryText": "ct that the quantities are greater than 10,000 pounds the facility must comply with OSHA's Process Safety Management Standard 29 CFR 1910.119.  This regulation requires that several conditions must be met such as; ensuring that Hot Work Permits and issued for welding and cutting operations, conducting routine compliance audits to ensure compliance, mechanical integrity to ensure the equipment is properly maintained and conducting process hazard analyses.  Each of these requirements ensure that employees are provided with a safe working environment and in turn ensure that the community are adequately protected.\n\nNESHAP\n\nVinyl Chloride is a regulated substance under the EPA NESHAP Standard.  The regulations requires extensive monitoring of all valves and flanges to ensure that leaks of Vinyl Chloride are not occurring.  To further ensure the integrity of the facility FPC-DE has included Vinyl Acetate valves and flanges into the leak detection program.  The end result of this program is the ability to quickly respond to potential leaks at concentration that is well below levels that would either impact our employees health and safety or the health and safety of the community. \n\nContinuous Emissions Monitoring Program (ARCAS)\n\nIn an effort to respond quickly to potential hazardous conditions a Continuous Emissions Monitoring Program has been implemented.  This program enables employees to monitor the atmosphere of critical process areas on a 24 hour basis.  The program is comprised of 4 Gas Chromatopgraphs each with the capability to collect atmospheric samples from 20 monitoring points.  The monitors are tied into audible and visual alarms that are set to go off at 1 ppm (part per million).  This allows employees  to be informed quickly so that immediate action can be taken to possible leaks. \n\n5 - 50 PPM Emission Investigation Program\n\nThe 5 - 50 ppm emission investigation program was voluntarily instituted to pro-actively determine the date, time, cause, equipment, s"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 18334,
      "SummaryText": "hift, location and probable cause of potential VCM emissions.  When the ARCAS CEM's detect a concentration of VCM in the facility greater than or equal to 5 ppm, the area operators contact their supervisor immediately and investigate the source of the VCM.  Once the source is identified the necessary corrective actions are immediately implemented.  Once the situation has been corrected, a more thorough investigation is conducted to determine the root cause of the incident and to implement preventive measures to prevent recurrence of the situation.\n\nEarly Relief Vent\n\nThe early relief venting system is designed to relieve Vinyl Chloride from vessels at a pressure below the pressure relief valve (PRV) rating.  This system prevents the release of Vinyl Chloride gas to the atmosphere by utilizing containment vessels, vacuum pumps and compressors.  The ERV system is used routinely as a Vinyl Chloride recovery system and is a reliable, ready and Operator-familiar containment system.\n\nISO 9002 and ISO 14001\n\nIn 1994 the facility achieved ISO 9002 Registration and in 1996 the facility achieved ISO 14001 Registration.  As part of the registration process, program audits are conducted by a third party on a semi-annual basis to ensure compliance.  The facility has maintained registration under these standards on a semi-annual basis by demonstrating that a strong quality assurance program and environmental management system program are in place and that these programs are effective.\n\nE. Five-Year Accident History\n\nIn the past five years of conducting business we have not experienced a release of vinyl chloride or vinyl acetate that meets the EPA's criteria for an accidental release.\n\nF. Emergency Response Program\n\nFormosa Plastics Corporation, Delaware has prepared a written emergency response plan that addresses the action to be taken in the event that one of the following conditions occur; fire, explosion, gas release, natural disaster, bomb threat, utility failure, medical e"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 18334,
      "SummaryText": "mergency, transportation incident, emergency at neighboring facility, chemical spill.  Drills are conducted internally at least once every year to ensure that all employees can safely shut down all operating units and then evacuate the facility.\n\nIn addition to the site specific emergency procedures, the facility is involved in the Delaware City Community Awareness and Emergency Response (DC-CAER) group.  This is a mutual aid effort which allows the facility to be prepared to assist with an emergency at a neighboring facility and to elicit the help of neighboring plants if warranted.  This includes working with the DC-CAER during annual emergency drills and meetings to discuss necessary improvement plans.\n\nIn the event that an emergency occurs at the facility that would impact the community, notification to affected individuals would be made through the DC-CAER Radio Systems which is a 24 hour manned radio established to provide neighboring plants with instant communication of emergencies.  Additional members of the community would be alerted to an emergency through the Emergency Broadcast System.  In addition, roadways would be blocked utilizing plant personnel through the DC-CAER Plan.\n\nG. Planned Changes to Improve Safety\n\nIn an effort to enhance safety to both the employees and the community, a scope of work is currently being prepared which involves the up-grading of both the facility's sprinkler systems and facility alarm system.  This up-grade will allow improved early warning communication among plant employees and improve the alerting to employees if evacuation is required.\n\nH. Final Comments\n\nIn the Registration section of this plan two blanks will be found.  These blanks pertain to The Title V Air Operating Permit ID and the EPA Facility Identifier.  At the date that this plan was published a Title V application had been submitted to the Delaware Department of Natural Resources.  DNREC has assigned a number but has not issued that number to the facility."
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 18334,
      "SummaryText": "The second blank pertains to the EPA Facility Identifier.  The facility does have an EPA Facility Identifier which is DED002336394.  The reason for the blank in the registration section is that the software would not accept an alpha-numeric number."
    }
  ]
}