{
  "FacilityID": 18458,
  "FacilityName": "Rockfish Creek Water Reclamation",
  "FacilityStr1": "SR 2218",
  "FacilityStr2": null,
  "FacilityCity": "Fayetteville",
  "FacilityState": "NC",
  "FacilityZipCode": "28302",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37051",
  "LEPC": "Cumberland County LEPC",
  "FacilityLatDecDegs": "34.964167",
  "FacilityLongDecDegs": "-78.833056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "OT",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 80887367,
  "ParentCompanyName": "Public Works Commission City of Fayetteville,, NC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Dickie Vinent",
  "OperatorStr1": "P.O. Box 1089",
  "OperatorStr2": null,
  "OperatorCity": "Fayetteville",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28302",
  "OperatorZipCodeExt": null,
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000163262",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-01-29 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-11-08 00:00:00",
  "ErrorReportDate": "1999-11-08 00:00:00",
  "ReceiptDate": "1999-11-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-10-29 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": "2000-08-28 00:00:00",
  "DeRegistrationEffectiveDate": "2000-05-16 00:00:00",
  "AnniversaryDate": "2004-10-29 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.964167,
  "FRS_Long": -78.833056,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 25990,
      "AltID": "disinfectant",
      "FacilityID": 18458,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 33750,
          "ProcessID": 25990,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 26659,
          "ProcessID": 25990,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 14316,
              "Process_NAICS_ID": 26659,
              "SafetyReviewDate": null,
              "PHA_Date": "1999-09-08 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-07-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-01-15 00:00:00",
              "TrainingReviewDate": "1999-04-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": null,
              "EquipmentInspectionDate": "1999-09-04 00:00:00",
              "EquipmentTested": "chlorinator/chlorine sensors",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": null,
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1998-06-23 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": null,
              "HotWorkPermitReviewDate": null,
              "ContractorSafetyReviewDate": "1999-08-30 00:00:00",
              "ContractorSafetyEvalDate": "1999-08-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 20673,
                  "PreventionProgram3ID": 14316,
                  "ProcessChemicalID": 33750
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 18458,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-02-01 00:00:00",
    "ERTrainingDate": "1999-02-01 00:00:00",
    "CoordinatingAgencyName": "Local Fire Department (HAZMAT)",
    "CoordinatingAgencyPhone": "9104331777",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "29CFR1910.119",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 18458,
      "SummaryText": "loyees and business operations are susceptible to emergencies such as natural disaster, severe weather, and man-made hazards.  The (CEMP), in conjunction with the Risk Management Program and other regulatory aids, help in managing potential emergency situations.\n\nThe facility maintains an aggressive training program for all members of its facility personnel.  In addition to the initial training programs for all staff members , various annual refresher training is provided along with periodic drills and exercises.  Emergency response equipment is maintained in prime condition and includes SCBA's for protection during evacuations.  During emergencies the Wastewater Facilitiy Supervisor will serve as the Emergency Coordinator, until the area respondents take charge of the incident.\n\nA windsock is placed near the chemical building and will be used to determine the wind direction and the plume flow of the chlorine in case of a release.\n\nIncidental releases of chlorine may occur when the following operations are executed on the system:\n  \n(1)  When changing out cylinders for usage minor leakage may occur\n  \nAll other releases constitute an \"abnormal release\" and the response to them is handled in two levels of severity.\n\nAWARENESS LEVEL\n\n  (1)  No offsite resources needed\n\nMAJOR EMERGENCY LEVEL\n\n  (1)  Requires sounding of emergency alarm and evacuating the site including the main office building.  A full-scale response effort will be launched to protect employees and the community.\n\n  (2)  Outside reponse teams will be called when authorized by the Wastewater Facility Supervisor.    These teams must have fully trained personnel at the Hazardous Materials Technicians level.  Periodic escorted visits of these teams to the pertinent building area will allow familiarity with the premises to promote effective response to emergencies.  A building plan showing the location of chlorine will be filed with the Cumberland County Fire Department.  The Risk Manager or his/her designe"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 18458,
      "SummaryText": "EXECUTIVE SUMMARY\n\nRISK MANAGEMENT PROGRAM\nFOR\nROCKFISH CREEK WATER RECLAMATION FACILITY PLANT\n\nIn an effort to protect PWC personnel, the surrounding community, and the environment.  PWC is currently converting the use of gaseous chlorine for disinfection to a less hazardous alternative, sodium hypochlorite.  This substitution will take effect by July of 2000.\n\n\nThis executive summary for the Risk Management Program for the Rockfish Creek Water Reclamation Facility (RCWRF) conforms to section 68.155 through 68.185.  Referenced documents, such as the PWC Comprehensive Emergency Management Plan (CEMP), Emergency Action Plan (EAP), Spill prevention, Containment and Control Countermeasures (SPCC) and Oil Pollution Plan (OPA 90) all plans are available for inspection by authorized individuals.\n\nPREVENTION AND EMERGENCY RESPONSE POLICIES\n\nIt is the policy of RCWRF to prevent accidental releases through the use of preventative programs, testing, calibrations, routine maintenance, inspections, and replacement of equipment if necessary and properly training personnel.  A work order system is in place for employees to formerly report deficiencies and track until rectified.\n\nRCWRF overall policy is to provide a safe environment for all employees, contractors, visitors, and neighbors.  This extends to the design, training, and implementation of a program, which will result in saving lives and reducing property damage during an emergency.\n\nIt is also RCWRF policy to operate in an environmentally responsible manner consistent with environmental regulations, policies, and procedures, and are in the best interest of PWC employees, the surrounding community, and the company.  RCWRF is designed and operated to cause the least amount of impact the environment of the surrounding area.\n\nEmployees at RCWRF make every attempt to prevent emergencies from occurring at the facility.  However, should an event ever occur, the immediate goal is to keep the emergency and it's effect to within t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18458,
      "SummaryText": "he facility boundaries and not allow it to present a threat to the health and safety of the general public.\n\nPreserving life is the prime consideration, so all procedures will be carried out in a manner to minimize risk to employees, emergency response personnel, and the surrounding community.  Rescue and medical activities have priority over all other actions.\n\nIt is the emergency response policy of RCWRF to immediately notify Cumberland County Emergency Management Agency (CEMA), (LEPC), and the (SERC) of any regulated substances in excess of the reportable quantity.\n\nPWC employees are only trained at the awareness level within the HAZOP system.  If possible, employees are allowed to eliminate the release source (i.e. closing valves, shutting down pumps, etc.) or contain the release.  In the event that a situation arises that cannot be contained by PWC employees, RCWRF relies on the Fayetteville HazMat Team to respond to these emergencies.\n\nThe RCWRF facility diligently attempts to comply with the various emergency related regulations.  Additionally, the use of Safety and Operating Procedures provide a system to avert accidental releases by focusing on specific components of each shipment.  The safety and operating procedures consist of safety procedures uniquely designed for specific job tasks. The manual is reviewed annually and revised as necessary to address any changes.  Each inbound shipment receives a detailed pre-unloading inspection, inspection during unloading, and post unloading inspection by the loading technician.  The chief technician for quality assurance performs a final inspection.  Employees and contractors are trained to insure proficiency in all phases of operation.\n\nRCWRF follows company-wide Comprehensive Emergency Management Plan (CEMP) designed to address prevention, preparation, response and recovery from a wide variety of potential emergencies, including accidental releases of any regulated substance at the facility.  The facility, its emp"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 18458,
      "SummaryText": "e shall write a critique of each necessary emergency response actions or drills.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe following items are planned changes to improve safety and reduce the likelihood of a chlorine release at RCWRF.\n\n  (1)  SUBSTITUTE RMP REGULATED CHEMICAL BY THE SUMMER OF 2000!!\n\nCOMMUNICATING RISK TO THE COMMUNITY\n\nCommunity warning in the event of a significant chlorine release is a critical concern.  The (LEPC) has a plan for warning people of an emergency through the use of police vehicles broadcasting warnings over speaker systems.  Through the use of (CEMA) notification system and out internal procedures, we feel confident that public notifications will be communicated in a timely expeditious manner.\n\nRCWRF will incorporate educating the public and surrounding community on RMP and the specific risks and non-risks posed by it's facility through Water Week activities, the Safewatch Program, and tour of it's facility.  In addition, we routinely give public tours to explain our process and safety precautions.\n\nDESCRIPTION OF THE FACILITY\n\nRCWRF is located on State Road 2218.  The facility is located approximately two (2) miles southeast of the intersection of old highway 87 and (Wilmington Highway) and Interstate 95, along a service road, which turns east off of old Highway 87.  Rockfish Creek (a large tributary of the Cape Fear River) is located approximately 100 yards from the facility, the Cape Fear River is also within 700 yards.   \n\nCHEMICAL STORAGE\n\nRCWRF uses chlorine in its process.  The RMP regulated chemical is stored in the chemical storage/process building.  The chlorine room is enclosed in walls made from thick cinder blocks covered with brick providing mitigation in the case of a release.  In addition, this room contains chemical sensors to alert the operations control center in the event of a release.  The sensors are checked monthly for proper working order, and calibration.\n\nChlorine is the primary disinfectant chemical used in"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 18458,
      "SummaryText": "the water treatment process.  Chlorine is classified as an oxidizer that is also corrosive and toxic.  There are 4 cylinders weighing 2,000 pounds each with 2 on the process line at a time and 2 on standby. Chlorine is kept in a gaseous state.  Our process requires two cylinders be kept in the process at all times.\n\nMISCELLANEOUS FACILITY INFORMATION\n\nRCWRF employs 14 full time people.  They rely on the PWC medical staff as well as the local medical professionals to assist with emergency and non-emergency incidents.\n\nThe worst case scenario is defined as the rapid and complete release of the largest container used in the process wether it is intr-connected to another vessel in the system or not.  A worst case scenario is highly unlikely to occur due to :\n\n-  All process cylinders are all not full at one time\n\n-  All the cylinders are not in the process at one time\n\n-  There is no heavy movable equipment working in the process storage building (i.e., forklifts).  The process cylinders are not all full at one time, and the chlorine cylinders are loaded and off loaded inside the building by an indoor crane.\n\n-  The cylinder valves are protected by the structure of the cylinder\n\n-  The process controls that are in place in the system such as alarms, sensors\n\n-  The simplistic system design for operation\n\n-  The Standard Operating Procedures that are in place to minimize the chance of a leak\n\n-  The system is a vacuum system\n\n\nWORST CASE SCENARIO # 1\n\nMaterial identification -  Chlorine\nQuantity relased -  2000\nRelease rate - 110 lbs/min\nProcess/Storage -  Conditions Gas\nTopography -  Rural\nToxic Endpoint -  0.09\nMeteorological Conditions Wind -  1.5 mph\nAtmospheric Stability Class - F\nAdministrative Limitations - yes  \nPublic and Environmental Receptors - NO\nAmbient Temperature 77F\nRelease Duration -  10 minutes\n\n\n\nThis scenario was developed using the EPA's OCA Guidance Reference Tables or Equations.\n\nGiven the unrealistic guidelines of the worst-case scenario, a more"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 18458,
      "SummaryText": "realistic planning scenario, or alternative release scenario, was, also developed to more closely simulate a real world event.  This scenario involves a smaller release that allow safety systems to be included in the calculations.  The alternative release scenario will be useful to local government and industry to prepare emergency response plans. \n\n\nALTERNATIVE SCENARIO # 1\n\nMaterial identification - Chlorine\nQuantity released-  1000\nQuantity release rate - 100 lbs./min. \nRelease duration - 10 lbs/min\nProcess/Storage -  Gas\nTopography -  Rural\nToxic Endpoint -  0.02 miles\nMeteorological Conditions Wind -  3.5 mph\nAtmospheric Stability Class - D\nAmbient Temperature -  77mph\nRelease Duration -  10 minutes\nPublic and Environmental Receptors - 0\n\nACCIDENT HISTORY\n\nRCWRF has been in operation since May of 1985.  Since it's inception to the present time there have been no accidental releases.  \n\n1994      1995      1996      1997      1998      1999\nNone     None     None     None      None     None        \n\nIn the case of an accident involving an accidental release chlorine, an incident investigation will take place. \n\nRCWRF follows the company wide Comprehensive Emergency Management Plan (CEMP) which is designed to address prevention, preparation, response, and recovery from a wide variety of potential emergencies, including accidental releases of any regulated substances at the facility.  The facility, its employees and business operations are susceptible to emergencies such as natural disasters, severe weather, and man-made hazards.  The (CEMP), in conjunction with the Risk Management Program and other regulatory aids, help in managing potential emergency situations.\n\nThe facility maintains an aggressive training program for all members of the facility personnel.  In addition to the initial training programs for all emergency response team members, annual refresher training is provided along with periodic drills and exercises.  Emergency response equipment is maintai"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 18458,
      "SummaryText": "ned in prime condition and includes SCBA for protection during evacuations.  During emergencies the Wastewater Facility Supervisor will serve as the Emergency Coordinator, until the area respondents take charge of the incident.\n\nA windsock is placed near the chemical building and will be used to determine the wind direction and the plume flow of the chlorine in the event of a release.\nIncidental releases of chlorine may occur when the following operations are executed on the system.\n\n* When changing out cylinders for usage minor leakage may occur.\n\nTHERE IS NO HOT WORK PERFORMED AT THIS FACILITY BY PWC PERSONNEL.  FOR THIS REASON  THERE  ARE NO STANDARD OPERATING PROCEDURES FOR THIS TYPE OF WORK.  THEREFORE, SECTION 7.13 IS LEFT BLANK ON THIS QUESTION.\n\n\nAll other releases constitute an \"abnormal release\" and the response is handled as determined by its severity."
    }
  ]
}