{
  "FacilityID": 18450,
  "FacilityName": "Kanto Corporation",
  "FacilityStr1": "13424 N. Woodrush Way",
  "FacilityStr2": null,
  "FacilityCity": "Portland",
  "FacilityState": "OR",
  "FacilityZipCode": "97203",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41051",
  "LEPC": "Oregon Statewide LEPC",
  "FacilityLatDecDegs": "45.618333",
  "FacilityLongDecDegs": "-122.765278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.kantocorp.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Kanto Chemical Company, Inc., Tokyo, Japan",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Kanto Corporation",
  "OperatorStr1": "13424 N. Woodrush Way",
  "OperatorStr2": null,
  "OperatorCity": "Portland",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97203",
  "OperatorZipCodeExt": null,
  "FTE": 48,
  "OtherEPAFacilityID": "ORQ000009423",
  "EPAFacilityID": "100000100785",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-23 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-11-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-11-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-11-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-11-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 45.6198,
  "FRS_Long": -122.7664,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 25980,
      "AltID": "Chemical Warehousing",
      "FacilityID": 18450,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 33740,
          "ProcessID": 25980,
          "ChemicalID": 57,
          "Quantity": 25000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 26649,
          "ProcessID": 25980,
          "NAICSCode": "42269",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 25981,
      "AltID": "Ammonia Water Manufacture",
      "FacilityID": 18450,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 33741,
          "ProcessID": 25981,
          "ChemicalID": 56,
          "Quantity": 42240.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 26650,
          "ProcessID": 25981,
          "NAICSCode": "32518",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 14312,
              "Process_NAICS_ID": 26650,
              "SafetyReviewDate": "1999-10-22 00:00:00",
              "PHA_Date": "1999-08-31 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "redundant computer monitored controls",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-11-15 00:00:00",
              "TrainingReviewDate": "1999-11-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-11-15 00:00:00",
              "EquipmentInspectionDate": "1999-10-26 00:00:00",
              "EquipmentTested": "Entire process system and piping.",
              "ChangeMgmtDate": "1999-10-27 00:00:00",
              "ChangeMgmtReviewDate": "1999-10-27 00:00:00",
              "PreStartupReviewDate": "1999-10-26 00:00:00",
              "ComplianceAuditDate": "1999-10-26 00:00:00",
              "AuditCompletionDate": "1999-11-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-10-26 00:00:00",
              "HotWorkPermitReviewDate": "1998-08-06 00:00:00",
              "ContractorSafetyReviewDate": "1999-10-15 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 20669,
                  "PreventionProgram3ID": 14312,
                  "ProcessChemicalID": 33741
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 18450,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-10-29 00:00:00",
    "ERTrainingDate": "1999-10-29 00:00:00",
    "CoordinatingAgencyName": "Portland Fire Bureau",
    "CoordinatingAgencyPhone": "5038233700",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18450,
      "SummaryText": "COMPANY AND PROCESS DESCRIPTIONS\n\nKanto Chemical Company, established in 1990 as a wholly owned subsidiary of Kanto Chemical Company, Ltd. of Japan.  Kanto Corporation has been in business for over 40 years as a manufacturer of high purity chemicals and chemical handling equipment and facilities. As a leading supplier of high purity process chemicals we are dedicated to leading the US semiconductor industry as the most advanced supplier of process chemicals and related services.  Through research expenditures we seek to continue to be the industry roadmap supplier in terms of process chemicals.  We design, engineer, manufacture, and install systems for demanding applications in a safe and environmentally sound manner. High purity is essential to our business.  This demand by industry for high purity drives safe and redundant operating systems.  To meet these requirements our process sytems are fully contained or closed chemical systems, all in a state-of-the-art manufacturing facility.  \n\nKanto Corporation's Portland Manufacturing Facility (KC-PMF) is located in the Rivergate Industrial District of Portland. Oregon.   KC-PMF began production in 1996, and includes both manufacturing/packaging and chemical warehousing capabilities.  Designed with state-of-the-art environmental and safety systems, KC-PMF has operated since start-up with no industrial violations.   \nOur employees provide leadership to our vendors to insure safety, quality, and customer satisfaction.  Our employees are trained in safety, hazardous materials, chemical handling, emergency response, etc.\n\nThe processes covered by EPA's Risk Management Planning requirements are the manufacturing and then storage of ammonium hydroxide.  This process requires bulk storage of anhydrous ammonia on site, and the necessary process equipment to safely, and with high quality, mix the product.  The purity of our chemical requires any open containers to be handled inside our clean room, which is 100% exhausted through"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18450,
      "SummaryText": "air scrubbers to remove contaminants.\n\nOnce the ammonium hydroxide solution is made, it is then placed in an on-site storage tank and subsequently repackaged into bottles, drums, totes, or bulk containers, as desired by our customers.  In order to maintain a consistent supply for our customer needs, we maintain an inventory of chemicals in our warehouse, one of which is ammonium hydroxide.  Since this storage is at another location on the facility grounds, it is considered a separate process for the purposes of the risk management regulation.  The warehouse operations does not result in any open chemical containers; it only consists of the storage and truck loading of finished product.\n\nCONSEQUENCES OF FAILURE TO CONTROL HAZARDS\n\nOur worst case release scenario, as specified by the EPA, would be a total failure of the anhydrous ammonia bulk storage tank assuming a total loss of all contents within 10 minutes.  Additional presumptions include the poorest weather conditions relative to a release and no allowance for engineered active safety systems.  The modeled worst case release for a release of ammonia would travel offsite and have a potential impact on the neighboring community.\n\nAlternative scenarios were developed for each of the two processes covered by the regulation.  These scenarios are more realistic than the worst case prescribed, and allow for active safety systems.  A more likely (although still not probable) release of anhydrous ammonia would be from a transfer hose failure from the delivery truck to the bulk tank.  This release would be similar to a hose failure, or disconnection of the hose from the piping system.  This release could potentially impact the immediate industrial neighborhood, with no residential impact.\n\nSimilarly, a spill of the largest ammonium hydroxide container (1000 liter tote) inside the storage warehouse, as modeled taking into account containment within the warehouse, does not result in a release of ammonia vapors off-site of"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18450,
      "SummaryText": "the facility.\n\nEXPLANATION OF HOW RELEASES ARE PREVENTED\n\nTo prevent an accident related to the storage of any chemical, Kanto Corporation has instituted a comprehensive safety and health program, which includes top management commitment, written programs, training, auditing, and accountability.  All personnel that transport or handle containers of chemicals have been trained in chemical safety and handling.  The fork lift operators that transport the chemical are all certified with Kanto's own internal fork lift certification program, with instructors certified by the National Safety Council fork lift trainer program.\n\nThe anhydrous ammonia system is new and has been designed to the latest standards and incorporates several layers of engineered protection.  Examples of the engineered systems are:\n\n- Fully scrubbed exhaust (no direct release to atmosphere without treatment)\n- Excess flow control (automatic shutoff of chemical in event of leak)\n- Computer controlled and monitored process with uninterrupted power supply\n- Gas detection systems\n- Continuously attended when in operation\n- Containment interior and exterior to the building\n- Pressure relief valves to prevent over pressurization of tank and piping (vented to scrubbed exhaust)\n\nThe operations of the facility ensure the safe day-to-day operation of the processes.  Operators are trained on written safe operating procedures, and any change to the process requires a thorough review and training prior to implementation, along with the pre-start up safety reviews.  Mechanical integrity and preventative maintenance programs ensure equipment continues to operate as designed, and a contractor safety program reviews qualifications in safety prior to contractors working on-site.\n\nACCIDENT HISTORY\n\nKanto Corporation has an excellent safety record and to date, there have been no incidents in the 4 year history of the facility that have resulted a chemical spill or release requiring special hazardous materials response c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 18450,
      "SummaryText": "apabilities or offsite impacts.\n\nSTEPS TAKEN TO ADDRESS HAZARDS\n\nAll exhaust anhydrous ammonia, including that resulting from activation of a pressure relief valve is routed through an air scrubber system, which removes ammonia from the exhaust to levels half the OSHA 8-hr exposure limit for ammonia.  If a leak or rupture occurs in process piping, excess flow control instrumentation will sense the decreased pressure and increased flow of chemical and automatically shut down chemical flow.  Gas detection is located in the general production area, including process exhaust, to detect any releases of ammonia and alert the operator continuously monitoring the process.  High detection levels will automatically shutdown the system.  Operating procedures ensure two operators are present during the process operations and delivery of anhydrous ammonia.  Emergency shutoffs are located in the control room, and process area for operators to automatically shutdown the process, remotely, in the event of an emergency.\n\nThe storage warehouse was built in 1998 and includes several safety features included in the modern design.  The warehouse is separated by chemical type to eliminate reactive chemicals from coming in contact with each other.  Each storage area has independent spill containment that will contain chemical spills should they occur.  The building is completely protected by an automatic fire suppression system, and the flammable storage area includes a foam fire suppression system throughout the room and in the storage racks.  The ventilation system has enough capacity to adequately ventilate the entire warehouse to prevent the accumulation of hazardous levels of vapors during storage of chemicals.  All chemical handling areas (indoors and outdoors) are fully contained to prevent any spill or leak from entering ground or water.\n\nOnly Kanto certified forklift drivers are permitted to transport chemical product.  Only experienced drivers are hired into Kanto, and then rece"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 18450,
      "SummaryText": "ive additional training via Kanto's forklift safety training program.  The drivers then practice with simulated loads until the trainer is confident in their ability prior to final certification.  This level of forklift training and awareness ensures only the best drivers are moving chemical materials.\n\n\nRESPONSE ACTION IN EVENT OF A RELEASE\n\nAll Kanto Corporation employees involved with chemical handling have received training on hazard communication, chemical specific safety and hazards, small spill control techniques, and protective equipment.  Although the facility does not maintain an on-site hazardous materials response team, the level of training provided employees who work in the chemical handling areas allows them to clean up small spills and leaks that may occur.  \n\nAmmonia system operators are specially trained to take limited emergency actions to prevent a release from escalating (such as shut a valve or stop the process), prior to evacuation.  With the engineered automatic shutdowns, and ability for limited operator actions, a sustained and on-going ammonia release is highly unlikely.\n\nFor large, uncontrolled, spills or releases the facility relies on response from the Portland Fire Bureau hazardous materials team and hazardous materials response contractors (already pre-selected).  While these services have never been necessary, the partnership and preplans with the fire bureau and contractors are in place should the services be required.  The emergency plans at the facility have been developed with the input from the outside responders to ensure a smooth, coordinated response and mitigation to an emergency should one occur."
    }
  ]
}