{
  "FacilityID": 18481,
  "FacilityName": "CAMDEN COGEN, LP",
  "FacilityStr1": "570 CHELTON",
  "FacilityStr2": null,
  "FacilityCity": "CAMDEN",
  "FacilityState": "NJ",
  "FacilityZipCode": "08104",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34007",
  "LEPC": null,
  "FacilityLatDecDegs": "38.917278",
  "FacilityLongDecDegs": "-75.119611",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I1",
  "LatLongDescription": "AS",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 785018995,
  "ParentCompanyName": "EAST COAST POWER LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "CAMDEN COGEN, LP",
  "OperatorStr1": "570 CHELTON",
  "OperatorStr2": null,
  "OperatorCity": "CAMDEN",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08104",
  "OperatorZipCodeExt": null,
  "FTE": 27,
  "OtherEPAFacilityID": "NJD981555667",
  "EPAFacilityID": "100000064262",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "Not issued",
  "SafetyInspectionDate": "1999-03-04 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-11-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-11-05 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-11-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2002-07-23 00:00:00",
  "DeRegistrationEffectiveDate": "2002-07-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.918221,
  "FRS_Long": -75.11814,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 26032,
      "AltID": "AQUEOUS AMMONIA SYSTEM",
      "FacilityID": 18481,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 33839,
          "ProcessID": 26032,
          "ChemicalID": 57,
          "Quantity": 112000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 26701,
          "ProcessID": 26032,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 10051,
              "Process_NAICS_ID": 26701,
              "SafetyReviewDate": "1999-06-16 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "API",
              "FR_Comments": null,
              "HazardReviewDate": "1998-06-15 00:00:00",
              "ChangeCompletionDate": "1999-09-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Tank within a tank; water cannon",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Daily and Weekly Operator Inspections",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Modify SOPs, Preventative Maintenance, install protective barriers",
              "OpProceduresReviewDate": "1999-06-15 00:00:00",
              "TrainingReviewDate": "1998-01-16 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "DRILLS",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-16 00:00:00",
              "EquipmentInspectionDate": "1997-05-31 00:00:00",
              "EquipmentTested": "The date provided in 8.7.b references the internal inspection date of the ammonia storage tank. Ancillary piping, valves, and relief valves undergo daily/weekly inspections and annual tests as needed.",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 10524,
                  "PreventionProgram2ID": 10051,
                  "ProcessChemicalID": 33839
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 18481,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-01-05 00:00:00",
    "ERTrainingDate": "1999-03-31 00:00:00",
    "CoordinatingAgencyName": "Camden Emer. Response Planning Comm",
    "CoordinatingAgencyPhone": "6095414217",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "NJ TCPA (NJAC 7:31); NJ DPCC (NJAC 7:1E)",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18481,
      "SummaryText": "Camden Cogen LP\nProgram 2 Executive Summary\n\nSystem Description\n\nCamden Cogen LP (Cogen) owns a 145 megawatt (MW) cogeneration (cogen) plant in Camden, Camden County, New Jersey.  GE Contractual Services has been contracted by Cogen to operate the facility.  This facility has been in operation since 1993.  The land use immediately surrounding the facility is mixed residential, commercial, and industrial.\n\nCogen's facility combusts natural gas in one GE Frame 7 combustion turbine to generate electricity.  The combustion turbine is equipped with a heat recovery steam generator (HRSG) that utilizes waste heat from the exhaust to convert water to steam.  The steam from the HRSG is combined to drive a steam turbine.  Electricity is generated at the gas turbine and the steam turbine.  Steam is also piped to offsite industrial facilities.  A State mandated selective catalytic reduction (SCR) system is located within the HRSG to reduce nitrogen oxide (NOx) emissions from the combustion turbine exhaust gas.  The SCR consists of a catalyst and injection grid within the HRSG.  Ammonia gas is injected through the grid upstream of the catalyst.  The ammonia mixes with the exhaust gas, and as the exhaust/ammonia mixture passes through the catalyst, NOx emissions are reduced to nitrogen and water.\n\nThe ammonia injected into the HRSG is stored as 27.5% aqueous ammonia in a 15,000 gallon vertical storage tank.  No more than 15,000 gallons of aqueous ammonia is stored on site at any time.  The aqueous ammonia is pumped from the storage tank to an ammonia skid.  The aqueous ammonia is vaporized in an electric heater at the skid.  Subsequent to vaporization, the ammonia is mixed with air and then blown to the injection grid.  The grid is a simple pipe system with outlets inside the HRSG.\n\nExisting Risk Management Activities\n\nThe ammonia system has been regulated under New Jersey's Discharge Prevention regulations (NJAC 7:1E) since 1993.  These regulations have required the development"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18481,
      "SummaryText": "of plans and procedures to reduce the risks of releases of hazardous substances.  The elements of these programs include standard operating procedures, training, maintenance, and emergency response.\n\nCogen has also implemented environmental programs and procedures to ensure compliance with all environmental regulations.  These programs and procedures, maintained in manuals at the plant, are kept up to date and available to all plant personnel.  The program consists of the environmental permits and plans required to operate the facility.  In addition to these programs, GE also maintains an EHS program.  Elements of the GE program include hazard work permits, employee training, and general safety procedures.  GE is also ISO 9000 certified.\n\nIn summary, Cogen and GE have developed, implemented, and maintained several environmental programs to ensure that risks associated with all plant operations are minimized and employees, nearby populations, and the environment are protected.\n\nRisk Management Program Summary\n\nThe plant manager has overall responsibility for maintaining the risk management program.  Responsibilities for specific program elements are shared among Cogen, GE, and East Coast Power LLC (Cogen's parent company).  \n\nSafety information is maintained at the facility.  As there have been no changes to the ammonia system since plant start up, modifications to the safety information have been minimal.  Operating procedures have been implemented at the facility and address the possible operating conditions of the ammonia system.  A maintenance program is in place and consists of maintenance procedures, testing and inspection schedules, and a work order system that initiates and tracks work and inspections performed on the ammonia system.  Hot works procedures along with other hazard permits (general work permit, lockout/tagout, etc.) exist at the plant and are applicable to all plant work.  Contractors working on the ammonia system or any plant equipment/system a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18481,
      "SummaryText": "re required to comply with the facility's contractor safety program. \n\nAll facility personnel must complete initial and refresher training on procedures applicable to their position.  All operators and maintenance personnel undergo a qualification process which addresses ammonia system operating procedures and/or maintenance procedures along with emergency response training.  Administrative personnel must undergo emergency response training.\n\nCompliance audits will be conducted on a triennial basis.  These audits will consist of a risk management program audit and a safety review of the ammonia system.  The program audit will review the risk management program and procedures to ensure the program is being implemented.  The ammonia system safety review will consist of an audit of the ammonia system and operating procedures and interviews with plant personnel to ensure that the ammonia system is designed and operated in accordance with the appropriate safety information.  \n\nEmployee participation has always been implemented at the facility.  Employees are included in hazard reviews and incident investigations even though it is not a requirement of the RMP regulations.  In addition, employees conduct self-assessments (plant audits conducted by employees), hold weekly safety meetings, conduct annual drills and participate in safety committees.  Incident investigation procedures have been implemented at the facility since start up.  \n\nA hazard review was conducted in 1998.  The hazard review identified the hazards associated with the process, opportunities for equipment malfunctions or human errors that could cause an accidental release, safeguards used or needed to control the hazards or prevent equipment malfunctions or human error, and steps used or needed to detect or monitor releases.  Once the hazard review was completed, a list of recommendations was developed and reviewed by plant personnel and management.  The recommendations are in the process of being implemen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 18481,
      "SummaryText": "ted at the site to further reduce the risk associated with the aqueous ammonia system.\n\nHazard Assessment\n\nA hazard assessment has been completed to comply with the RMP regulations.  The hazard assessment consists of analyzing the effects of a worst case release scenario and an alternate release scenario.  The worst case release scenario is modeled as being an instantaneous release of aqueous ammonia from an ammonia header line from the tank to the ammonia skid.  The EPA RMP-Comp model was utilized to determine the endpoint distance.  This model estimated that the distance to the endpoint is 0.1 miles from the source.  Residences are located within this endpoint range.  Cogen submits that this scenario is unlikely to occur as the piping undergoes daily inspections and is included in the facility's PM program.  This scenario does not consider the mitigating actions that the emergency response teams will have on the release.\n\nAn alternate release scenario was also analyzed.  The alternate release scenario was developed to consist of a 0.25 inch diameter hole in an ammonia line which lasts for one hour.  This scenario may also represent a leak from a delivery hose or a crack in a valve.  The same model was used to determine offsite impacts.  The results of the modeling estimates that the endpoint distance will be 0.1 miles and have an impact on residences.  This scenario takes into account that it will take 60 minutes to respond and stop the release.  The one hour release duration is a reasonable maximum time period as determined by the fire department's response time confirmed by drills that have been conducted with the Camden Fire Department.  \n\nThere have been no accidents or releases from the ammonia system within the last five years.\n\nEmergency Response\n\nAn emergency response program has been implemented at the facility since the plant's construction.  The emergency response program includes an emergency response plan and coordination of emergency information and"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 18481,
      "SummaryText": "activities with the Camden Fire Department.  The emergency response plan contains the information and procedures necessary to respond to a release of any hazardous material at the site.  Emergency information includes a list of emergency response personnel, notification requirements, evacuation procedures, and health/first aid data.  Cogen has confirmed with the Camden Fire Department that personnel and equipment necessary to respond to a release of a hazardous substance at the site will be provided.  Coordination has included providing the department a copy of the emergency response plan.  The fire department has taken part in plant emergency response drills and drill critiques.  Cogen also contributes emergency equipment to the fire department.  In addition to emergency drills, the fire department tours the facility to familiarize its personnel with plant operations and the locations of potential hazards.  In addition, plant personnel are trained in the procedures necessary to respond to emergency releases."
    }
  ]
}