{
  "FacilityID": 18512,
  "FacilityName": "Chem Quip Inc.",
  "FacilityStr1": "4755 E. Commerce Ave",
  "FacilityStr2": null,
  "FacilityCity": "Fresno",
  "FacilityState": "CA",
  "FacilityZipCode": "93725",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": null,
  "FacilityLatDecDegs": "36.698639",
  "FacilityLongDecDegs": "-119.738028",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.chemquip.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 98864887,
  "ParentCompanyName": "Chem Quip Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Terry W. Ables",
  "OperatorStr1": "4755 E. Commerce Ave",
  "OperatorStr2": null,
  "OperatorCity": "Fresno",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93725",
  "OperatorZipCodeExt": null,
  "RMPContact": "Terry W. Ables",
  "RMPTitle": "Branch Mgr.",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000163431",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-24 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-11-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-11-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-11-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-01-09 00:00:00",
  "DeRegistrationEffectiveDate": "2017-12-26 00:00:00",
  "AnniversaryDate": "2004-11-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 36.69855,
  "FRS_Long": -119.73865,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 26078,
      "AltID": "Storage",
      "FacilityID": 18512,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 26748,
          "ProcessID": 26078,
          "NAICSCode": "42269",
          "_desc": {
            "NAICS_CODE": "42269",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 33888,
          "ProcessID": 26078,
          "ChemicalID": 62,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 533888,
          "ProcessID": 26078,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18512,
      "SummaryText": "The Fresno Facility of Chem Quip Inc. Accidental Release Prevention and Emergency Response Policy\n\n  The Chem Quip Fresno facility stores and distributes swiming pool equipment and supplies along with water treating chemicals for all associated industries. The facility is located at 4755 E. Commerce Ave. in Fresno CA. 93725. The facility also operates the building located at 4753 E. Commerce Ave. where all hazardous substances are maintained. The surrounding area is predominately industrial and is sparsely populated. The facility has an Emergency Response Plan to insure that all regulated hazardous chemical substances are stored and transported in accordance with all applicable laws and regulations.\n   \n  Through the Emergency Response Plan, Chem Quip Fresno has assessed the potential affects of an accidental release of a hazardous substance. The assessment includes performing an off site consequence analysis. This analysis includes a worst case scenerio and one alternative scenerio.\n\n  The Chem Quip Fresno facility has established a prevention program to prevent the accidental release of regulated substance. This program includes safety precautions, maintenance, inspections, and employee training.\n\n  A response program has also been established that requires specific actions to be taken in the event of an emergency. These actions include procedures for notifying public and local agencies responsible for responding to accidental releases, information on emergency health care, and employee response training measures.\n\nDiscription of Facility and Regulated Substances Handeled\n\n  The Chem Quip Fresno Facility handles one regulated substance in it's distribution operation. The substance is chlorine which is used for water disinfection. The chlorine is stored in 150# cylinders in a sprinklered warehouse at 4753 E. Commerce Ave. As many as 100 cylinders may be in storage.\n\nWorst Case Scenerio\n\n  The worst case scenerio could be caused by a cylinder being dropped causing t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18512,
      "SummaryText": "he valve to be broken entirely off. Under this scenerio, the release of chlorine through the 1 inch valve opening could take 10 minutes to empty the container. Chlorine expands 450 times it's volumne when exposed  to atmosphere. The release rate would be 15 pounds per minute and the toxic endpoint would be 0.3 miles from the source and could affect surrounding businesses in the industrial area.\n\nAlternative Release Scenerio\n\n  The alternative release scenerio would involve the failure of the fusable plug by either heat or overpressure. Under this scenerio, the release rate through the .25 inch diameter fuse plug would be 2.5 pounds per minute and take 60 minutes to empty the container. The resulting toxic endpoint would be 0.1 miles from the source and could affect the surrounding businesses in the industrial area.  \n\nGeneral Accident Release Prevention Program and Chemical Specific Prevention Steps\n\n  Specific prevention steps that Chem Quip Fresno has taken include CSTI Certified Training for Emergency Responders. Currently there is one CSTI Incident Commander and one CSTI Tech Level Responder on site. There is one Chlorine Recovery Vessel ( coffin ) on site for DOT approved transport of contained leaking cylinders to the manufacturer. SCBA and level B suits are also maintained on site. Inspections are performed daily, inventories are maintained at a minimum, and stock is rotated on a \"first in- first out\" basis.\n\nFive Year Acident History\n\nThis facility has operated for over 20 years without an incident.\n\nEmergency Response Program\n\nThe Fresno Facility of Chem Quip Inc. has trained its personnel to respond to an emergency chlorine gas release and take the necessary steps to stop or contain the release. The facility has coordinated with the Fresno and Clovis Fire Depts. and has trained with these agencies on numerous occasions.\n\nPlanned Changes to improve Safety\n\n  The Chem Quip Fresno facility plans to focus on training in the future to become fully Emergency Res"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18512,
      "SummaryText": "ponse self sufficient. Training is planned when the candidates are selected. Actual release scenerios will then be practiced with the training demo cylinders and safety equipment maintained on site."
    }
  ]
}