{
  "FacilityID": 18522,
  "FacilityName": "Edward P. Decher Secondary Wastewater Trmt. Plant",
  "FacilityStr1": "500 South First Street",
  "FacilityStr2": null,
  "FacilityCity": "Elizabeth",
  "FacilityState": "NJ",
  "FacilityZipCode": "07202",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34039",
  "LEPC": "Elizabeth City OEM",
  "FacilityLatDecDegs": "40.645",
  "FacilityLongDecDegs": "-74.222222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "jbonjmeuc@aol.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Joint Meeting of Essex and Union Counties",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Joseph F. Bonaccorso",
  "OperatorStr1": "500 South First Street",
  "OperatorStr2": null,
  "OperatorCity": "Elizabeth",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07202",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bryan Christiansen",
  "RMPTitle": "Executive Director",
  "FTE": 104,
  "OtherEPAFacilityID": "NJD087277661",
  "EPAFacilityID": "100000027277",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "40474",
  "SafetyInspectionDate": "1998-05-05 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "USEPA",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-11-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2003-04-14 00:00:00",
  "DeRegistrationEffectiveDate": "2003-03-10 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.64201,
  "FRS_Long": -74.19824,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 26088,
      "AltID": "Chlorine",
      "FacilityID": 18522,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 26758,
          "ProcessID": 26088,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 33899,
          "ProcessID": 26088,
          "ChemicalID": 62,
          "Quantity": 260000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 533899,
          "ProcessID": 26088,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 26089,
      "AltID": "Methane",
      "FacilityID": 18522,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 26759,
          "ProcessID": 26089,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 33900,
          "ProcessID": 26089,
          "ChemicalID": 93,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 93,
            "ChemicalName": "Methane",
            "CASNumber": "74-82-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 533900,
          "ProcessID": 26089,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18522,
      "SummaryText": "1.  Facility Description\n\nThe Edward P. Decher Secondary Wastewater Treatment Plant is a wastewater treatment plant operated by the Joint Meeting of Essex and Union Counties (Joint Meeting).  The facility utilizes chlorine for disinfecting of the wastewater and generates and utilizes methane gas during anaerobic digestion of sludge.  Liquid chlorine is stored in a rail tanker car and the methane gas stored in six (6) above ground sludge storage and/or digester tanks.  The maximum quantity of liquid chlorine that located on site is 135 tons and the maximum amount methane gas that could be stored at the site is approximately 20 tons.\n\n2.  Accidental Release Prevention and Emergency Response Policies\n\nThe facility is a state-of-the-art wastewater treatment plant that is committed to plant safety and protection of the surrounding community.  Personnel that operate and maintain the chlorine and methane process equipment are fully trained in all aspects of their particular process operation.  The Joint Meeting maintains and practices strict Standard Operating Procedures (SOPs), a preventative maintenance program, and safety audit procedures for the chlorine and methane processes to ensure that equipment is operated, maintained, upgraded, and repaired as needed.\n\nThe process equipment also has numerous built-in safety features to ensure that facility personnel and the surrounding community are protected.  These safety features include state of the art leak detection equipment, and automated and manual process shut down capabilities.\n\nThe facility and City of Elizabeth Office of Emergency Management (OEM) maintain written emergency response programs and perform emergency response drills to ensure quick, efficient response to any suspected/reported release chlorine or methane.\n\n3.  Worst-Case and Alternative Release Scenarios\n\nAir modeling of various chlorine and methane release scenarios was performed in accordance with the USEPA protocols utilizing the United States Enviro"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18522,
      "SummaryText": "nmental Protection (USEPA) RMPComp program.  The following is a summary and discussion of the various scenarios that were modeled:\n\n4.  Chlorine - Worst Case\n\nThe worst case scenario for a chlorine release would be a catastrophically failed rail tanker car (i.e. ruptured tank).  This is an extremely unlikely, almost improbable, release scenario.  If such a release occurred the quantity of chlorine released would be 180,000 lbs., of flashing liquid and the distance to toxic end point would be 14 miles.  \n\nFacility controls that prevent such a release from ever occurring are:  (1) written and practiced SOPs; (2) initial and refresher training for facility personnel; (3) an emergency action/response program; (4) preventative maintenance and audit program; (5) utilization of tank cars that are designed to withstand a severe impact; (6) use of a reputable vendor who utilizes proper quality control procedures to prevent overfilling and performs necessary hydrostatic testing, and inspects relief valves for proper operation; (7) use of an insulated tank car; (8) limited access and 24 hr. security to the tank car storage area; and, (9) 24 hr. closed circuit television monitoring of the tan car storage area.\n\n5.  Chlorine - Alternate Case\n\nThe alternate release scenario chosen is a release resulting from a rupture disk in combination with a relief valve failure within the Evaporator Building.  Based upon discussion with facility personnel this was determined to be the most likely alternate source of a release.  \n\nThe resulting release (10 minutes) is estimated to be 6,920 lbs. of chlorine inside the evaporator building with a toxic endpoint of 0.40 miles.\n\nDuring this release scenario, release controls include passive mitigation (i.e. release would occur within the confines of the Evaporator Building).  Facility controls include continuous monitoring of evaporator equipment pressure and temperature and the facility controls listed above. \n\n6.  Methane - Worst Case\n\nThe worst "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18522,
      "SummaryText": "case scenario would be catastrophic failure of single sludge digester tank resulting in a release of a potentially explosive vapor cloud.  If this occurred the quantity of material released would be 9,000 lbs. and the distance the modeled endpoint of on overpressure of 1 psi would be 0.20 miles.\n\nFacility controls that would prevent such a release include:  (1) written and practiced SOPs; (2) properly trained personnel; (3) an emergency response program; (4) preventative maintenance and audit program; (5) tank pressure/vacuum relief alarms and valves, (6) waste gas burners; (7) overfill alarms; (8) limited access and 24 hr. security to the tank area. \n \n7.  Methane - Alternate Case\n\nThe alternate release scenario is vapor cloud explosion associated with a 10-minute release from the accumulator/extractor located in the Digester Control Building.  Based upon discussion with facility personnel this was chosen as the most likely alternate source of a release. \n\nDuring this release scenario the estimated distance to an overpressure of 1 psi would be 0.02 miles.  Facility safety controls include those listed for the worst case release scenario.\n\n8.  Five Year Accident History\n\nThe facility has not had any reportable releases of chlorine or methane in the last five years.\n\n9.  Emergency Response Program\n\nThe facility maintains a written and practiced emergency action/response program for responding to releases of chlorine and methane.  The plan is maintained and implemented by the emergency response committee which includes; Management/Public Relations - Bryan Christiansen (Executive Director); Operations - Joseph Bonaccorso (Plant Superintendent) and Alex Durand (Operations Manager); and Terrence Cole-Kelly (Safety and Health Officer).  The plan includes all necessary procedures for response to suspected/reported chlorine and methane releases.  \n\nIncorporated into the emergency response plan are requirements for notification and coordination with State (NJDEP) and local e"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 18522,
      "SummaryText": "mergency response personnel (City of Elizabeth Office of Emergency Management (OEM)).  As described in the emergency response plan, the emergency response plan responsibilities are closely coordinated with, and also performed by the Elizabeth OEM.  As on site fire-fighting capabilities are limited to fire extinguishers, the emergency action program for a methane release is closely coordinated with the Elizabeth OEM.  As the plan indicates, the OEM will respond to all releases where on site emergency response personnel determine that assistance is required and/or a potentially explosive atmosphere is encountered. \n\nInternally, the facility has an Emergency Response Coordinator (ERC) and a fully trained emergency response team that will assess the release, identify severity, identify hazards, determine magnitude of the problem, determine resources threatened, evaluate off-site impact, determine if facility evacuation is necessary, determine injuries, and take appropriate release mitigation actions. \n\n10.  Planned Changes to Improve Safety\n\nNo immediate changes are planned."
    }
  ]
}