{
  "FacilityID": 18918,
  "FacilityName": "Townsends Inc.",
  "FacilityStr1": "Rt 24 East",
  "FacilityStr2": null,
  "FacilityCity": "Millsboro",
  "FacilityState": "DE",
  "FacilityZipCode": "19966",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "10005",
  "LEPC": "Sussex LEPC",
  "FacilityLatDecDegs": "38.6",
  "FacilityLongDecDegs": "75.25",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "S1",
  "LatLongDescription": "PC",
  "FacilityURL": "www.townsends.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6918676,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Townsends, Inc. - c/o Bryan Zulaica",
  "OperatorStr1": "Rt 24 East",
  "OperatorStr2": "P.O. Box 468",
  "OperatorCity": "Millsboro",
  "OperatorStateFIPS": "DE",
  "OperatorZipCode": "19966",
  "OperatorZipCodeExt": null,
  "FTE": 1800,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000097968",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "AQM-005/00004",
  "SafetyInspectionDate": "1998-07-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-11-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.60119,
  "FRS_Long": -75.25952,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 26626,
      "AltID": "ammonia refrigeration",
      "FacilityID": 18918,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 34622,
          "ProcessID": 26626,
          "ChemicalID": 56,
          "Quantity": 40000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 27309,
          "ProcessID": 26626,
          "NAICSCode": "311615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 14642,
              "Process_NAICS_ID": 27309,
              "SafetyReviewDate": "1999-03-11 00:00:00",
              "PHA_Date": "2003-02-27 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-02-27 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-11 00:00:00",
              "TrainingReviewDate": "1999-03-11 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-11 00:00:00",
              "EquipmentInspectionDate": "1999-03-11 00:00:00",
              "EquipmentTested": "Receiver",
              "ChangeMgmtDate": "1999-02-20 00:00:00",
              "ChangeMgmtReviewDate": "1999-03-11 00:00:00",
              "PreStartupReviewDate": "1999-02-20 00:00:00",
              "ComplianceAuditDate": "1997-01-17 00:00:00",
              "AuditCompletionDate": "1998-01-17 00:00:00",
              "IncidentInvestigationDate": "1994-10-17 00:00:00",
              "InvestigationChangeDate": "1994-11-17 00:00:00",
              "ParticipationPlansReviewDate": "1999-03-11 00:00:00",
              "HotWorkPermitReviewDate": "1999-03-11 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-14 00:00:00",
              "ContractorSafetyEvalDate": "1999-03-11 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 21152,
                  "PreventionProgram3ID": 14642,
                  "ProcessChemicalID": 34622
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 18918,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-02-20 00:00:00",
    "ERTrainingDate": "1999-06-09 00:00:00",
    "CoordinatingAgencyName": "Millsboro Fire Company",
    "CoordinatingAgencyPhone": "3029348359",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18918,
      "SummaryText": "EXECUTIVE SUMMARY FOR TOWNSENDS, INC - MILLSBORO PLANT\n                                \n1.  Accidental Release Prevention and Emergency Response Policies\n\n    We at Townsends, Inc., Millsboro facility,  are strongly committed to employee, public and\nenvironmental safety. This commitment is inherent to a comprehensive accidental release\nprevention program in place that covers areas such as design, installation, operating procedures,\nmaintenance, and employee training associated with the processes at our facility.  It is our policy\nto implement appropriate controls to prevent possible releases of regulated substances. \nUnforeseeably, if such a release does occur, our highly trained emergency response personnel are\nat hand to control and mitigate the effects of the release.\n\n2.  The Stationary Source and Regulated Substance Handled\n\n    Out facility's primary activities encompass Poultry Processing.  We have one (1) regulated\nsubstance present at our facility.  This substance is anhydrous ammonia.  The regulated substance\nat this facility has a singular use: refrigeration.  Our ammonia refrigeration system is separated\ninto\ntwo (2)  systems containing approximately 20,000 lbs. of ammonia each.  \n\n3.  The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), \n    including administrative controls and mitigation measures to limit the     \n    distances for each reported scenario\n\n    To perform the required offsite consequence analysis for our facility, we have used RMP\nCOMP for the worst case scenario and ALOHA(R) for the alternate release scenario.  The\nfollowing\nparagraphs provide details of the chosen scenarios:\n\n                                 Worst Case Scenario:     A failure or puncture of the high pressure receiver\n\t\t\tof either system\twould release the greatest quantity of ammonia for our facility. \n                        About 20,000 pounds of ammonia would be released as a liquid\n                        which would then vaporize. It is"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 18918,
      "SummaryText": "ards related to the contractor's work and the processes. \nContractors are also informed of all the procedures for emergency response should an accidental\nrelease of a regulated substance occur.   \n\n5.  Five-year Accident History\n\nTownsends Millsboro facility has had an excellent record of preventing accidental releases over\nthe\nlast 5 years. Due to our stringent release prevention policies, there has been no accidental release\nduring this period that have resulted in offsite impacts or injuries.\n\n6.  Emergency Response Plan\n\nTownsends Millsboro facility carries a written emergency response plan to deal with accidental\nreleases of hazardous materials.  The plan includes all aspects of emergency response including\nadequate first aid and medical treatment, evacuations, notification of local emergency response\nincluding adequate first aid and medical treatment, evacuations, notification of local emergency\nresponse agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and\nserviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place\nwithin our processes that would require a modified emergency response.\n\n7.  Planned Changes to Improve Safety\n\nSome developments and findings have resulted from the implementation of the various elements\nof our accidental release prevention program along with the continuous development happening\nunder our Process Safety Program.  At the forefront of any improvements are advancements made\nin the area of employee awareness.  Any step forward in accident prevention must include the \nparticipation  and intimate involvement of our employees. The continued efforts to refine our\nmechanical integrity program and improve upon a sound, well run inspection, test and\npreventative\nmaintenance program is essential to preventing equipment failures that could result in a release."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18918,
      "SummaryText": "t these analyses is\nWhat-if.  The studies are undertaken by a team of qualified personnel with experience in\nengineering and process operations and are revalidated at a regular interval of five (5) years.  Any\nfindings related to the hazard analysis are addressed in a timely manner.  \n\nOperating Procedures\nFor the purpose of safely conducting activities within our covered processes, Townsends\nMillsboro\nfacility maintains written operating procedures.  These procedures address various modes of\noperations such as initial startup, normal operations, temporary operations, emergency shutdown,\nemergency operations, normal shutdown and startup after a turnaround.  The information is\nregularly reviewed and is readily accessible to operators involved in the process.\n\nTraining\nTownsends Millsboro  facility has a training program in place to ensure that employees who are\noperating processes are competent in the operating procedures associated with these processes. \nRefresher training is provided at least every three (3) years and more frequently as needed.\n\n\nMechanical Integrity\nTownsends Millsboro facility carries out highly documented maintenance checks on process\nequipment to ensure proper operations.  Process equipment examined by these checks includes\namong others;  pressure vessels, storage tanks, piping systems, relief and vent systems, emergency\nshutdown systems, controls and pumps.  Maintenance operations are carried out by qualified\npersonnel with previous training in maintenance practices.  Furthermore, these personnel are\noffered\nspecialized training as needed.  Any equipment deficiencies identified by the maintenance checks\nare corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Townsends Millsboro facility to manage changes in process\nchemicals, technology, equipment and procedures.  Process operators, maintenance personnel or\nany\nother employee whose job tasks are affected by a modification in process conditions are"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 18918,
      "SummaryText": "promptly\nmade aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-startup safety reviews related to new processes and to modifications in established  processes\nare conducted as a regular practice at Townsends Millsboro facility.  These reviews are conducted\nto confirm that construction, equipment, operating and maintenance procedures are suitable for\nsafe\nstartup prior to placing equipment into operation.\n\nCompliance Audits\nTownsends Millsboro facility conducts audits on a regular basis to determine whether the\nprovisions\nset out under the RMP rule are being implemented.  These audits are carried out at least every\nthree\nyears (3) and any corrective actions required as a result of the audits are undertaken in a safe and\nprompt manner. \n\nIncident Investigation\nTownsends Millsboro facility promptly investigates any incident that has resulted in, or could\nreasonably result in a catastrophic release of a regulated substance.  These investigations are\nundertaken to identify the situation leading to the incident as well as any corrective actions to\nprevent the release from reoccurring.  All reports are retained for a minimum of five years.\n\nEmployee Participation\nTownsends Millsboro facility truly believes that process safety management and accident\nprevention\nis a team effort.  Company employees are strongly encouraged to express their views concerning\naccident prevention issues and to recommend improvements.  In addition, our employees have\naccess to all information created as a part of the facility's implementation of the RMP rule,\nincluding information resulting from process hazard analysis in particular.\n\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction\nactivities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the\ncontractor is carried out.  Townsends Millsboro facility has a strict policy of informing the\ncontractors of known potential haz"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18918,
      "SummaryText": "assumed that the entire contents are\n                        released as a liquid, which vaporizes and spreads out from the plant\n                        as a vapor cloud.\n\n                        The distance to the toxic endpoint of 0.14mg/L (Basis ERPG-2) is 2.2\n                   \tmiles.  The distance extends beyond the facility boundary,\n                   \tencompasses several businesses and residences, schools, and an adult\n                   \tcare facility .\n\n                        Alternative Scenario:    A leak from a short pipe or valve in a horizontal\n\t\t\tcylindrical tank would release 1,789 lbs. over a three minute release duration and\n                        would reach an offsite receptor.  \n\n                        The distance to the endpoint of 0.14mg/L is 0.3 miles.  The distance\n                   \tis beyond the facility boundaries and encompasses only one offsite\n                   \tpublic receptor, a private residence 0.3 miles offsite.   \n\n4.  The General Accidental Release Prevention Program and the                       \n    Chemical-Specific Prevention Steps \n\n    Our facility has taken all of the necessary steps to comply with the accidental release\nprevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and\nconstructed in accordance with NEPA-58 Standard, 1967 Edition.  The ammonia refrigeration\nprocess at this facility is subject to the OSHA PSM standard under 29 CFR 1910.119.  The\nfollowing\nsections briefly describe the elements of the release prevention program that is in place at our\nstationary source.\n\nProcess Safety Information\nTownsends, Inc. maintains a detailed record of safety information that describes the chemical\nhazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes\nare identified and controlled efficiently.  The methodology used to carry ou"
    }
  ]
}