{
  "FacilityID": 18921,
  "FacilityName": "Agrium U.S Inc.  Homestead Nitrogen Operations",
  "FacilityStr1": "22292 Southwest 89 Road",
  "FacilityStr2": null,
  "FacilityCity": "Beatrice",
  "FacilityState": "NE",
  "FacilityZipCode": "68310",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31067",
  "LEPC": null,
  "FacilityLatDecDegs": "40.310417",
  "FacilityLongDecDegs": "-96.840167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9423963,
  "ParentCompanyName": "Agrium U.S Inc.",
  "Company2Name": null,
  "CompanyDUNS": 808957229,
  "Company2DUNS": 0,
  "OperatorName": "Agrium U.S Inc.",
  "OperatorStr1": "4582 South Ulster Street",
  "OperatorStr2": "Suite 1400",
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80237",
  "OperatorZipCodeExt": null,
  "RMPContact": "James Creglow",
  "RMPTitle": "Evironmental and Shipping Supt.",
  "FTE": 62,
  "OtherEPAFacilityID": "68310CMNCFROUTE",
  "EPAFacilityID": "100000099261",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0960 00002",
  "SafetyInspectionDate": "1998-03-10 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-11-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.31042,
  "FRS_Long": -96.84017,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 26629,
      "AltID": "Ammonia (Anhydrous)",
      "FacilityID": 18921,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 27312,
          "ProcessID": 26629,
          "NAICSCode": "325311",
          "_desc": {
            "NAICS_CODE": "325311",
            "NAICS_DESCRIPTION": "Nitrogenous Fertilizer Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 34625,
          "ProcessID": 26629,
          "ChemicalID": 56,
          "Quantity": 40400000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 534625,
          "ProcessID": 26629,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18921,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\nBACKGROUND\n\nAgrium U.S. Inc. Homestead Plant stores liquid anhydrous ammonia in an aboveground storage tank (AST) within its facility.  The liquid anhydrous ammonia is refrigerated under atmospheric pressure.  The maximum amount of anhydrous ammonia which can be stored in the AST is 20,000 tons.  The anhydrous ammonia is used as raw material to produce nitric acid.  The nitric acid is in turn used to produce granular ammonia nitrate.  The Homestead Plant also dispenses anhydrous ammonia to tank cars and tank trucks for fertilizer application via ammonia transfer pumps.\n\n\nRATIONALE FOR RISK MANAGEMENT PROGRAM DEVELOPMENT AND IMPLEMENTATION\n\nThe 1990 Amendments to the Clean Air Act (CAA) require the Environmental Protection Agency (EPA) to issue a rule specifying the type of actions to be taken by facilities to prevent accidental releases of substances into the atmosphere and reduce their potential impact on the public and the environment.  As a result of the 1990 Amendments, EPA issued the \"Chemical Accident Prevention Provisions\" (part 68 of Title 40 of the Code of Federal Regulations (CFR)) that requires affected facilities to develop and implement a risk management program.  The affected facilities include any facilities that handle, manufacture, store, or use above the specified threshold quantities of toxic substances in a process, including ammonia.  The threshold quantity for ammonia to trigger the development and implementation of a risk management program is 10,000 pounds.\n\nThe risk management program is designed to prevent accidental releases of substances than can cause serious harm to the public and the environment from short-term exposures and to mitigate the severity of releases that do occur.  Since Agrium is handling more than 10,000 pounds of ammonia, it is required to develop and implement a risk management program.  The Agrium's risk management program includes an offsite consequence analysis of a potential accidental release, a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18921,
      "SummaryText": " five year accident history, a release prevention program, and an emergency response program.\n\n\nOFFSITE CONSEQUENCE ANALYSIS\n\nUnder the risk management program, an offsite consequence analysis is required for an accidental release of a regulated source.  In Agrium's case, anhydrous ammonia is the regulated source.  Modeling of the worst-case scenario and at least one alternative release scenario is required for offsite consequence analysis program.\n\nEPA has defined a worst-case release as the release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to a specified endpoint.  The largest quantity is determined taking into account administrative controls that limit the quantity of a substance that can be stored or processed in a vessel or pipe at any one time, or alternatively, procedures that occasionally allow the vessel or pipe to store greater than usual quantities.  EPA defined alternative release scenarios to be any release that is more likely to occur than the worst-case scenarios and that reaches an endpoint offsite.\n\nFor offsite consequence analysis, the movement and dispersion of a regulated source release to the atmosphere is predicted using a computer model.  The model selected for this purpose is PHAST Model 520.  PHAST Model 520 predicts pollutant concentration downwind from the source, taking into consideration the physical characteristics of the pollutant, the physical characteristics of the site, weather conditions, and the circumstance of the release.\n\n\n\nWORST-CASE RELEASE SCENARIO ANALYSIS\n\nThe worst-case scenario for Agrium was determined to be a failure of the 200 ton ammonia pressure vessel.  The release of this anhydrous ammonia vapor could cause offsite consequences.\n\n\nALTERNATIVE RELEASE SCENARIO ANALYSIS\n\nSeveral scenarios involving the discharge of ammonia through a rupture in an ammonia loading hose were evaluated for the alternative release scenario analysis.  The P"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18921,
      "SummaryText": "HAST Model 520 was used to predict the vulnerable zone when the ammonia is released to the atmosphere through an opening in the loading hose.\n\n\nFIVE -YEAR ACCIDENT HISTORY\n\nThe five-year accident history involves an examination of the effects of any accidental releases of anhydrous ammonia in the five years prior to the submission of a risk management program.  The five-year accident history covers:\n\n - The release of ammonia from Agrium's facility.\n - The release that caused at least one of the following:\n        On site deaths, injuries, or significant property damage (40 CFR part 68.42(a)); or\n        Known offsite deaths, injuries, property damage, environmental damage,\n        evacuations, or sheltering in place (40 CFR Part 68.42(a)).\n\nDuring the last five years, Agrium has had several episodes of anhydrous ammonia releases but none of the releases have offsite impacts.  None of the releases caused death, injuries, property damage, or environmental damage either on or off site.  All of the releases were reported to the local emergency planning committee, Nebraska Department of Environmental Quality, and EPA.\n\nRELEASE PREVENTION PROGRAM\n\nAgrium has a Release Prevention Program (RPP) in place to prevent accidental releases of hazardous materials at this facility.  The RPP includes:\n\nProcess Safety Information (PSI)\nAgrium has developed and is keeping current working copies of the PSI including information pertaining to the hazards of the process, the technology of the process, and equipment of the process.  All employees are trained in the area where they will perform work and all contractors are given training before entry into the plant is allowed.  The PSI will enable the employees and contractors of Agrium to identify and understand the hazards posed by the process involving anhydrous ammonia.\n\nProcess Hazard Analysis (PHA)\nAgrium is committed to performing PHA to identify, evaluate, and control hazard associated with Agrium's processes.  The PHA is to analy"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 18921,
      "SummaryText": "ze the potential mishaps, identify the mishaps that could occur, analyze the likelihood that mishaps will occur, evaluate the consequence of these mishaps, and analyze the likelihood that safety systems, mitigation systems, and emergency systems will function properly to eliminate or reduce the consequences of a mishap.\n\nThe PHA will be updated at least every (5) years to assure that the PHA is consistent with the current process.\n\n\nOperating Procedures (OPs)\nAgrium is committed to the development of OPs to assure safe work practices are maintained.  The OPs are reviewed after an unsafe work practice occurs.  The unsafe work practice is investigated and the OPs will be revised to reflect the unsafe practices.  The OPs are updated annually.\n\nTraining\nAgrium is committed to provide its employees comprehensive training to assure that the work force can perform their duties safely, efficiently, and effectively.\n\nMechanical Integrity (MI)\nAgrium has developed a written program of maintaining of the MI of process equipment at the Agrium facility.  The MI program includes pressure vessels and storage tanks, piping systems and ancillary equipment, relief and vent systems and devices, emergency shutdown systems, controls, and pumps.\n\nIncident Investigation\nAgrium has communicated to all of its employees that is every employee's responsibility to report incidents and near misses to their immediate supervisor.  After an incident is reported, an incident investigation team which includes the employees involved in the incident will initiate an incident investigation.  The leader of the incident investigation team is knowledgeable of the plant and trained at the Process Safety Institute in incident investigation.\n\nCompliance Audit\nA compliance audit of the Agrium facility will be conducted at least every three (3) years to evaluate compliance of Agrium's process with the release prevention program (RPP).  The audit team will include one person knowledgeable in audit skills and te"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 18921,
      "SummaryText": "chniques and team members with appropriate technical expertise.  The audit team will meet every 60 days to assess the status of the corrective actions resulting from the compliance audit.\n\nManagement of  Change (MOC)\nAgrium's MOC system was developed to ensure that changes at Agrium will not result in undetected unsafe situations and employees will be aware of all changes and their implications.  Agrium's MOC system includes the following considerations before any changes take place:\n- the authorization requirement for the change.\n- the technical basis for the proposed change.\n- the impact of the change on health and safety.\n\nAfter changes are made, all affected employees will be informed about the change and training will be provided to the affected employees prior to startup of the modified process.  In addition, the PSI and OP will be updated to reflect the changes made.\n\nPre-Startup Review (PSR)\nWhen change to the process is significant enough to require a change in safety information under the MOC, Agrium will conduct a PSR.  The PSR Team Leader will develop a checklist and assemble a team of key personnel to go over every element on the checklist during the PSR.  All PSR members will be knowledgeable about the process and trained in the area of change.\n\nContractors\nAgrium has developed and implemented safe work practices to control the entrance, presence and exit of contract employees in covered process areas.  It is Agrium's policy to select safe contractors, provide appropriate safety related information to contractors, develop safe work practices related to contractors and periodically evaluate contractors.\n\nAgrium will inform contractors of the known potential fire, explosion, or toxic release hazards related to the contractors work and the process.  Agrium will also explain to the contractors the applicable provisions of Agrium's emergency response plan.\n\nEmployee Participation\nAgrium is committed to involving employees and their representatives on the co"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 18921,
      "SummaryText": "nduct and development of a PHA and on the development of the other elements of plant safety, process safety management, and risk management planning.  Agrium encourages employees to read, review and provide comments on all PSM/RMP documents.\n\nHot Work Permits\nHot work is defined as work that could generate a flame, intense heat, or sparks as a result of electric or gas welding, cutting, blazing, abrasions or similar operations.  A permit is required when hot work is to be conducted on or near Agrium's process.\n\nAgrium is committed to the implementation of the RPP to ensure safe operations of its plant and to prevent accidents.\n\nEMERGENCY RESPONSE PROGRAM\n\nAgrium has an Emergency Response Program (ERP) in place to respond to releases of hazardous material at this facility.  All Agrium employees, who meet the physical requirements, are part of the emergency response team and have received 24 hours training at the Hazardous Materials Technician level and continue to receive 8-hour update training class annually.  They are trained in emergency response procedures, first aid and CPR.  They will be responsible for responding to all releases and performing first aid duties at the immediate scene of a release.\n\nAgrium is working closely with the local Fire Department in responding to emergencies.  The local Fire Department tours the Agrium facility at least once a year to determine what hazardous materials are present, the location of the materials, and the best responding procedures.  Agrium also keeps the Fire Department informed of any new hazardous materials that are introduced into the workplace.  The other outside agencies that will be involved in responding to emergencies at Agrium include the County Sheriff, Highway Patrol, local hospital, and outside contractors that are needed for such operations as containment, cleanup, material handling, etc.\n\nAll reportable releases of hazardous material will be reported immediately to the National Response Center, State Emerge"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 18921,
      "SummaryText": "ncy Response Commission, and the Local Emergency Planning Committee.\n\n"
    }
  ]
}