{
  "FacilityID": 18939,
  "FacilityName": "Denton Gas Plant",
  "FacilityStr1": "10 mi NE of Lovington, NM on HWY 82",
  "FacilityStr2": null,
  "FacilityCity": "Lovington",
  "FacilityState": "NM",
  "FacilityZipCode": "88260",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "35025",
  "LEPC": "Lea LEPC",
  "FacilityLatDecDegs": "33.037722",
  "FacilityLongDecDegs": "-103.214056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Davis Gas Plant",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Davis Gas Processing",
  "OperatorStr1": "2449 S. Willis, Ste. 204",
  "OperatorStr2": null,
  "OperatorCity": "Abilene",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79605",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000111309",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-09-16 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-11-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2021-12-20 00:00:00",
  "DeRegistrationEffectiveDate": "2021-12-01 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.043869,
  "FRS_Long": -103.169989,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 26651,
      "AltID": "Propane",
      "FacilityID": 18939,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 34649,
          "ProcessID": 26651,
          "ChemicalID": 98,
          "Quantity": 45000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 27336,
          "ProcessID": 26651,
          "NAICSCode": "32411",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 26652,
      "AltID": "Natural gas liquids",
      "FacilityID": 18939,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 34650,
          "ProcessID": 26652,
          "ChemicalID": 155,
          "Quantity": 78400.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 25856,
              "ProcessChemicalID": 34650,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 25857,
              "ProcessChemicalID": 34650,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 25858,
              "ProcessChemicalID": 34650,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 25859,
              "ProcessChemicalID": 34650,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 27337,
          "ProcessID": 26652,
          "NAICSCode": "32411",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 18939,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-08-25 00:00:00",
    "ERTrainingDate": "1999-03-25 00:00:00",
    "CoordinatingAgencyName": "Lea County LEPC",
    "CoordinatingAgencyPhone": "5053979231",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18939,
      "SummaryText": "SAFETY POLICY STATEMENT\nIt is the policy of Davis Gas Processing that accident prevention shall be considered of primary importance in all phases of operation and administration. It is the intention of Davis Gas Processing management to provide safe and healthy working conditions and to establish and insist upon safe practices at all times by all employees. The prevention of accidents is an objective affecting all levels of our company and its operations. It is, therefore, a basic requirement that each supervisor make the safety of all employees an integral part of his or her regular management function. It is equally the duty of each employee to accept and follow established safety regulations and procedures. Every effort will be made to provide adequate training to employees. Employees are expected to assist management in accident prevention activities. Unsafe conditions must be reported immediately. Safety is everyone\u0012s business.\n\nSITE DESCRIPTION\nThe Denton DGP Plant is located about 8 miles northeast of Lovington, NM. On Highway 82.\nThere is a Product Propane Storage Tank, which is a 255 barrel painted, welded steel, above ground, horizontal pressure vessel. The  tank operates up to 200 psig and is protected by a pressure relief valve. Liquid flow into this tank is determined by the process operations. Liquid flow out of this tank goes to tank truck loading and is manually controlled. Operating personnel on a daily basis visually inspect this tank. If a spill occurred at this tank, the contents are so volatile that they would evaporate before penetrating the ground to any significant degree. The ground would freeze and contain the propane as it evaporated.\nThere is also a Natural Gas Liquids Storage Tank, that is a 555 barrel, painted, welded steel, above ground, horizontal pressure vessel. The tank may operate up to 75 psig and is protected by a pressure relief valve. Liquid flow into this tank is determined by the process operation. Liquid flow out of the tan"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18939,
      "SummaryText": "k goes to tank truck loading and is manually controlled. Operating personnel on a daily basis visually inspect this tank. An earthen containment dike surrounds this tank; however, if a spill occurred at these tanks, the highly volatile contents would extensively evaporate before penetrating the ground to any significant degree.\n\nPURPOSE AND GOALS FOR THE DENTON DGP PLANT\nEMERGENCY RESPONSE AND ACTION PLAN\nEmergency Response And Action Plans (ERAP) were developed by Davis Gas Processing  for its Denton DGP Plant located in Lea County, New Mexico.  The ERAP was developed to assist the Denton DGP Plant Foreman in his responsibility to provide skilled and compliant emergency leadership in the event of emergency situations.\nThe ultimate goals of the Denton DGP Plant ERAP are as follows:\n\t1.\tTo provide Denton DGP Plant employees with emergency prevention training that will allow them to avoid process emergencies by predicting and recognizing potentially hazardous situations.\n\t2.\tTo provide Denton DGP Plant employees with emergency prevention training that will allow them to recognize and assess the consequences of personal actions when working  with equipment containing pressurized,  very cold, highly volatile,  and flammable substances.\n\t3.\tTo assure that Denton DGP Plant  employees will respond in a safe, prompt, and compliant fashion in the event of unintentional releases of hazardous chemicals in and from the Denton DGP Plant.\n\t4.\tTo guarantee that all Denton DGP Plant visitors  will be effectively warned to recognize, avoid, and to escape hazardous situations and guarantee that they will be accounted for and removed from the Denton DGP Plant in the event of a site emergency.\n\t5.\tTo document that Denton DGP Plant emergency response efforts were effective,  prompt,  and  professional.\n\t6.\tTo document that Denton DGP Plant emergency response training is provided periodically and in a clear and consistent manner, and to ensure  Denton DGP Plant  employees have a basic wo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18939,
      "SummaryText": "rking knowledge of Denton DGP Plant emergency response procedures.\n\t7.\tTo document that Denton DGP Plant  employees have a clear understanding of the recommended responses for various possible emergency scenarios.\nThe Emergency Response Program that we have in place details emergency escape procedures and route assignments that have been posted in work area, and all employees have been trained by supervisors in the correct procedures to follow. New and change in status employees have been trained when assigned to perform any duties that involve the handling of hazardous chemicals.  This facility has an Emergency Shut-Down Procedure that describes the steps to be taken in order for normal operations to be stopped and utility service to be cut off as personnel evacuate the premises during emergency situations.  The Foreman is responsible for accounting for all employees, personally or through a designee, by having all employees report to predetermined, designated rally point and conducting  a head count. Rescue and medical duties will be performed by EMS personnel from the Lovington, New Mexico Fire Department. The employees of the facility will be notified by verbal notification if  an evacuation is necessary.  All personnel have been trained in the safe and orderly emergency evacuation of the premises. The training includes, but is not limited to, the Emergency Shut-Down Procedures, escape routes, exits, and rally points. Training was and/or will be provided for employees when:\n1.  The plan was initiated\n2.  Responsibilities change\n3.  Employees are hired or transferred.\n\nWORST-CASE RELEASE SCENARIO \n The worst-case scenario would involve some sort of mechanical object (e.g. plane, vehicle) to hit or rupture the  Propane Storage Tank or the Natural Gas Liquids Tank.\nThe Propane Storage Tanks contains 45,000 lbs. of flammable substance with a worst-case scenario radius of exposure of  1,584 feet. There are no houses or public facilities in the radius of exposure. \nTh"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 18939,
      "SummaryText": "e Natural Gas Liquids Tank contains 98,000 lbs. of flammable substance with a worst-case scenario radius of exposure of  2,112 feet. There is also no houses or public facilities in the exposed radius.\n\nThis facility  has  had no accidents in the last 5 years involving a regulated chemical, that has involved death, injury, or emergency response. Our facility has procedures coordinated with the local response agencies encase of  an accidental release.\n\nThis facility follows the rules and regulations of  Occupational Safety and Health Administration (OSHA), Department of Transportation (DOT), Environmental Protection Agency(EPA),  and the New Mexico State OSHA. This facility has labeled all their storage tanks with identifying signs and NFPA labels which enable the fire department easy identification of the products health, flammability, and reactivity.  By following these rules and regulation we are involved in an extensive training program for our employees. This facility  has an ongoing safety training program for their personnel. This program involves all the regulated training programs plus any on the job situations that our employees might encounter."
    }
  ]
}