{
  "FacilityID": 18951,
  "FacilityName": "Chamberlain Facility, Station #36",
  "FacilityStr1": "Off Interstate I-90 exit 265",
  "FacilityStr2": null,
  "FacilityCity": "Chamberlain",
  "FacilityState": "SD",
  "FacilityZipCode": "57325",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "46015",
  "LEPC": "Brule County LEPC",
  "FacilityLatDecDegs": "43.77",
  "FacilityLongDecDegs": "-99.315",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.sdwg.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 58789017,
  "ParentCompanyName": "South Dakota Wheat Growers Association",
  "Company2Name": null,
  "CompanyDUNS": 7920267,
  "Company2DUNS": 0,
  "OperatorName": "Bob Fluke",
  "OperatorStr1": "RR1 - Box 4C",
  "OperatorStr2": null,
  "OperatorCity": "Chamberlain",
  "OperatorStateFIPS": "SD",
  "OperatorZipCode": "57325",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bob Fluke",
  "RMPTitle": "Manager",
  "FTE": 11,
  "OtherEPAFacilityID": "47290-SD-003",
  "EPAFacilityID": "100000117713",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-04-01 00:00:00",
  "SafetyInspectionBy": "South Dakota Department of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-11-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-09-10 00:00:00",
  "DeRegistrationEffectiveDate": "2012-08-23 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 43.77,
  "FRS_Long": -99.315,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 26665,
      "AltID": "Anhydrous Distribution",
      "FacilityID": 18951,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 27350,
          "ProcessID": 26665,
          "NAICSCode": "11511",
          "_desc": {
            "NAICS_CODE": "11511",
            "NAICS_DESCRIPTION": "Support Activities for Crop Production"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 34663,
          "ProcessID": 26665,
          "ChemicalID": 56,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 534663,
          "ProcessID": 26665,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18951,
      "SummaryText": "The following executive summary was prepared in accordance with 68.155 by the owner/operator of the South Dakota Wheat Growers Association - Chamberlain, SD  Facility #35.   (a)  The accidental release prevention and emergency response policies at the stationary source.  The South Dakota Wheat Growers Association management and employees of the Chamberlain, SD facility have implemented a variety of standard operating procedures, safe work pracitices, training programs and maintenance procedures designed to protect people,  property, and the environment and property,  The facility complies with Occupational Safety and Health Administration (OSHA) 29 CFR 1910.111 Storage and Handling of Anhydrous Ammonia and it is our policy to adhere to all applicable federal, state and local laws.  In the event of an emergency accidental release, it is the policy of the management of the Chamberlain, SD facility to notify the City of Chamberlain Fire Department and request that they respond to the emergency situation.  (b) The stationary source and regulated substances handled. The South Dakota Wheat Growers Association Chamberlain, SD facility stores and handles a variety of products and commodities associated with the production of crops.  Anhydrous ammonia is a product regulated by Part 68 of the CAA and are in use at this facility at regulated quantities.  Anhydrous ammonia, for retail sales, is stored in one above ground storage tank (AST) on a concrete cradle.   The facility also has 19 nurse trailers that allow farmers to supply nitrogen to the field.       (c) The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario.     In our emergency planning we have considered two scenarios, one involving a worst case release scenario and one involving a more likely but still uncommon alternate scenario.  The worst case scenario involves the release of the entir"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18951,
      "SummaryText": "e contents of the largest tank.  The alternative scenario involves a nurse tank hose rupturing.  This planning was aided by RMPComp, a program designed by the EPA that provides conservative results. The population within a radius supplied by each scenario could be effected in the remote chance of a release occuring.      (d) The general accidental release prevention program and chemical-specific prevention steps.      The South Dakota Wheat Growers Association Chamberlain, SD facility's anhydrous accidental release prevention program complies with the Environmental Protection Agency accident prevention rule and all applicable state and local codes and regulations.  The anhydrous ammonia system is designed, installed, and maintained in accordance with Occupational Safety and Health Adminsitration (OSHA) 29 CFR 1910.111 Storage and Handling of Anhydrous Ammonia,  American Society of Testing Materials (ASTM), American National Standards Institute (ANSI), and American Society of Mechanical Engineers (ASME) standards and regulations.      (e) The five year accident history.     The South Dakota Wheat Growers Association Chamberlain, SD facility has never had an accident involving anhydrous ammonia that caused deaths, injuries, property or environmental damage, evacuations, or sheltering in place.   (f) The emergency response program.    The South Dakota Wheat Growers Association Chamberlain, SD facility emergency response program complies with OSHA 1910.138.  In the event of an emergency involving the anhydrous ammonia systems, it is our policy to notify Chamberlain Fire Department and request that they respond to the emergency.   The management of this facility has discussed this policy with the fire department and members of our anhydrous ammonia storage and transport systems.  In addition, it is our policy to contact Wayne Falor, Brule County Emergency Manager.     (g)  Planned changes to improve safety.     The management and employees of the South Dakota Wheat Growe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18951,
      "SummaryText": "rs Association Chamberlain, SD facility periodically review procedures, policies, and safety program elements to evaluate improvements. We are continually looking for ways to improve the safety and health of our employees and minimize risk to the surrounding community and environment.  As new equipment and procedures develop, they are evaluated and implemented so that we can continue to safely provide this effective crop aid to our customers."
    }
  ]
}