{
  "FacilityID": 19121,
  "FacilityName": "CVC Specialty Chemicals, Inc. - Maple Shade Plant",
  "FacilityStr1": "2980 Route 73 North",
  "FacilityStr2": null,
  "FacilityCity": "Maple Shade",
  "FacilityState": "NJ",
  "FacilityZipCode": "08052",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34005",
  "LEPC": "Maple Shade Township OEM",
  "FacilityLatDecDegs": "39.958889",
  "FacilityLongDecDegs": "74.991111",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 68310150,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "CVC specialty Chemicals, Inc.",
  "OperatorStr1": "2980 Rt 73 North",
  "OperatorStr2": null,
  "OperatorCity": "Maple Shade",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08052",
  "OperatorZipCodeExt": null,
  "FTE": 27,
  "OtherEPAFacilityID": "NJR000004010",
  "EPAFacilityID": "100000151444",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-20 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-11-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.9591,
  "FRS_Long": -74.9879,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 26879,
      "AltID": "Specialty Epoxy Prod.",
      "FacilityID": 19121,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 34908,
          "ProcessID": 26879,
          "ChemicalID": 21,
          "Quantity": 160000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 27572,
          "ProcessID": 26879,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 14744,
              "Process_NAICS_ID": 27572,
              "SafetyReviewDate": "1999-06-01 00:00:00",
              "PHA_Date": "1995-07-10 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "1.  emergency relief catch tank; 2.  overflow catch tank",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-17 00:00:00",
              "TrainingReviewDate": "1998-12-23 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-09 00:00:00",
              "EquipmentInspectionDate": "1999-06-14 00:00:00",
              "EquipmentTested": "1. agitator gear box ;  2.  steam control valve;  3. mass flow meter control system; and  4. receiver transfer pump seal.",
              "ChangeMgmtDate": "1998-05-21 00:00:00",
              "ChangeMgmtReviewDate": "1995-11-06 00:00:00",
              "PreStartupReviewDate": "1999-04-09 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1999-03-15 00:00:00",
              "InvestigationChangeDate": "1999-03-15 00:00:00",
              "ParticipationPlansReviewDate": "1999-05-17 00:00:00",
              "HotWorkPermitReviewDate": "1995-11-14 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 21273,
                  "PreventionProgram3ID": 14744,
                  "ProcessChemicalID": 34908
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 19121,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1997-04-18 00:00:00",
    "ERTrainingDate": "1998-10-28 00:00:00",
    "CoordinatingAgencyName": "Maple Shade Township Fire Company",
    "CoordinatingAgencyPhone": "8567791335",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19121,
      "SummaryText": "II. General Information and Regulated Substances Handled\n\nCVC Specialty Chemicals, Inc. (CVC) purchased the Maple Shade, New Jersey facility from Akzo-Nobel Chemicals, Inc. in June 1995.  Full occupancy of the site took place in November 1995 after completion of construction activities to upgrade and convert the site for research and development and small scale manufacturing of specialty epoxy monomers and resins based on epichlorohydrin chemistry.\n\nThe Maple Shade, New Jersey site is the Corporate Headquarters for CVC and serves as the principle site for scale-up, semi-works and small scale manufacturing of epoxy resins and monomers.  CVC handles only one of the listed EPA RMP or NJDEP TCPA listed chemicals above threshold quantities - epichlorohydrin.  Epichlorohydrin is the basic building blocks chemical used in epoxy manufacturing and provides the basis for the site risks management and accident prevention plans.\n\nEpichlorohydrin is handled on site in bulk in quantities that do not exceed 160,000 lb.  Storage facilities include one 10,000-gallon aboveground storage tank for fresh epichlorohydrin storage and one 6,000-gallon storage tank for recycle epichlorohydrin storage.  Process equipment includes two reactors that are 1,200-gallons and 2,000-gallons in capacity.\n\nThe epoxy resins and monomers (modifiers) produced by CVC are used primarily in the specialty coatings industry.  Applications include civil engineering coatings such as floor coatings, tank and secondary containment linings, and structural steel primers.  Other common uses include adhesives, and specialty automotive and aviation coatings and composites.\nII. Worst Case and Alternative Release Scenario\n\nThe Worst Case Release Scenario would occur from the 10,000-gallon above ground epichlorohydrin storage tank located in the west tank farm.  The release would be caused by a catastrophic rupture of the storage tank and resultant leak of up to 10,000-gallons of epichlorohydrin to the full surface area"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19121,
      "SummaryText": "of the tank farm.  Emissions would result from continuous evaporation of epichlorohydrin from the tank farm to atmosphere under ambient conditions.\n\n\nThe Worst Case Release Scenario was modeled using the Environmental Protection Agency's (EPA's) computer model, RMP Comp.  EPA default values of 1.5 meters per second, stability class F and 250C were used for windspeed, atmospheric stability, and temperature, respectively.  The release rate to the outside air was determined to be 21 pounds per minute and the spill was determined to completely evaporate within 4670 minutes of the release.  Air concentrations of epichlorohydrin were determined to reach the toxic endpoint concentration of 0.076 milligrams per liter at a distance of 0.7 miles from the facility.  A survey of the area surrounding the facility determined that the topography was basically urban.  Public receptors within the toxic endpoint include schools, residences, recreational areas, commercial, office or industrial areas and churches. The residential population within the toxic endpoint was estimated to be 14,100.  The only environmental receptor was determined to be the Pensauken Creek\n\n\nAlternative Release Scenario - The alternative release scenario involves an epichlorohydrin leak from a pressurized transfer line from the storage tanks to the reactor processing area.  The transfer line is assumed to be under normal discharge pump pressure and the leaks occurring at a flange connection.  The leak would be stopped within five minutes by operating personnel resulting in an epichlorohydrin spill of 1225 pounds inside the main processing building.  Based on the release volume it was determined that the surface area of a one-centimeter thick pool would be smaller than the floor area of the Building, thus the Building would not restrict the size of the pool.\n\n\nThe Alternative Case Release Scenario was also modeled using EPA's computer model, RMP Comp.  EPA default values of 3 meters per second, stability class"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19121,
      "SummaryText": "D and 250C were used for windspeed, atmospheric stability, and temperature, respectively.  The release rate to the outside air was determined to be 0.2 pounds per minute and the spill was determined to completely evaporate within 4960 minutes of the release.  Air concentrations of epichlorohydrin were determined to reach the toxic endpoint concentration of 0.076 milligrams per liter at a distance of 0.1 miles from the facility.  A survey of the area surrounding the facility determined that the topography was basically urban.  Public receptors within the toxic endpoint include industrial facilities. There is no residential population within the toxic endpoint. The only environmental receptor was determined to be the Pensauken Creek.\n\nIII. Accidental Release Prevention and Emergency Response Policies\n\nThe Maple Shade facility is designed and operated to minimize the potential for on-site or off-site safety and environmental impact to employees and the surrounding community.  In 1985, the facility was upgraded with the help of a major engineering/construction firm to provide state of the art engineering controls for manufacturing specialty epoxies.\n\nThe company management has demonstrated its commitment to safety and environmental compliance by involving the expertise of employees and consulting engineers in the principals of Process Safety Management.  Since the June start-up in 1996, the company has not had an accidental release involving any hazardous chemical.  There have been no incidents to date of an on-site or off-site injury or illness due to epichlorohydrin handling or exposure.\n\nAccidental Release Prevention is managed by CVC using methodology encouraged by OSHA PSM and the New Jersey Toxic Catastrophic Prevention Act (TCPA).  The CVC Maple Shade Facility is operated as an RMP Program 3 facility.  Engineering and operational protocols include:\n\nProcess Safety Information - Process, equipment and chemical safety reviews were conducted prior to start-up and a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 19121,
      "SummaryText": "s an on-going policy for refresher training and any process changes.\n\nProcess Hazard Analysis - Hazard and operability studies (HAZOP) are used for all facility hazard analysis.  Action plans are documented and implemented for all risk reduction items.\n\nStandard Operating Procedures - SOP's are documented and updated on a continuous basis and include start up, shut down and normal operating procedures for manufacturing epoxy resins.\n\nTraining - A training schedule for all operating personnel is planned, executed and documented on an annual basis.  Training includes required regulatory training for hazard communications, hazardous waste, emergency response and process training.  Refresher training is conducted annually as required.\n\nMechanical Integrity - Preventive maintenance (PM) procedures are in place to assure continuing safe operation of process equipment.  A work order and PM system is utilized to monitor equipment integrity and reliability.\n\nIncident Investigation - CVC actively utilizes an incident investigation procedure to document and follow-up are all near-miss and full scale safety, operating and environmental related accidents.\n\nMaintenance - Safe work permits including Line Entry, Hot Work, Electrical Lockout and Confined Space are in place.  Contractor safety procedures and orientation requirements are enforced for all contact project work.\n\nManagement of Change and Pre-Start-up Review - CVC has in place a Process Change Authorization (PCA) procedure that requires a full safety, environmental and operating review and approval prior to implementation of any material or procedural process change.  Pre-Start-Up safety reviews are conducted prior to any new process start-up.\n\nEmergency Response - CVC has a full Emergency Response (ER) and Discharge Prevention, Containment and Countermeasure (DPCC) Plan in place.  ER and DPCC manuals were established in 1997.  Emergency drill exercises with the Township's Fire Company and LEPC officials, NJDEP and county"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 19121,
      "SummaryText": "residents are planned in 1999.  Internal Company emergency response and evacuation exercises are on-going and documented as part of the safety program.\n\nCompliance Audit - Annual internal compliance audits for EPA RMP and NJDEP will be developed and implemented in 1999.  Site performance will be measured against required RMP elements and a report with remedial actions issued on an annual basis.\n\nIV. Planned Safety Improvements\n\nCVC, as a new operating company, plans to continuously enhance existing procedures and solidify the company philosophy and prevention program elements required by EPA, RMP and NJDEP TCPA.  The specific items planned in the near future include:\n\n\nHazard and Operability Study (HAZOP) - A second, more comprehensive HAZOP of the epoxy manufacturing unit is planned in 1999 to take advantage of the three years of operating experience accumulated since 1996.  Procedural and engineering control improvements are expected to further safeguard a proven production plant.\n\nEmergency Response Drills are planned and will involve the local fire and rescue squad, LEPC and NJDEP.  New emergency response and safety equipment and gear will be added to expand and improve response capabilities.\n\nSecondary containment improvements to the process area and tank farm are planned in 1999."
    }
  ]
}