{
  "FacilityID": 1919,
  "FacilityName": "Zeon Chemicals L.P. - Mississippi Plant",
  "FacilityStr1": "1301 W.7th Street",
  "FacilityStr2": null,
  "FacilityCity": "Hattiesburg",
  "FacilityState": "MS",
  "FacilityZipCode": "39401",
  "Facility4DigitZipExt": "2800",
  "FacilityCountyFIPS": "28035",
  "LEPC": "Forrest County / Hattiesburg",
  "FacilityLatDecDegs": "31.34",
  "FacilityLongDecDegs": "-89.314833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 605475011,
  "ParentCompanyName": "Zeon Chemicals L.P.",
  "Company2Name": null,
  "CompanyDUNS": 605443340,
  "Company2DUNS": 0,
  "OperatorName": "Zeon Chemicals L.P.",
  "OperatorStr1": "1301 W.7th Street",
  "OperatorStr2": null,
  "OperatorCity": "Hattiesburg",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39401",
  "OperatorZipCodeExt": "2800",
  "RMPContact": "David McDonald",
  "RMPTitle": "Process Engineer",
  "FTE": 72,
  "OtherEPAFacilityID": "AFS: 280350006",
  "EPAFacilityID": "100000025849",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0800-00006",
  "SafetyInspectionDate": "1999-02-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Synthetic Rubber Manufacturing",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-05-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-05-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-05-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 31.33546,
  "FRS_Long": -89.31499,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2093,
      "AltID": "Ethylene Oxide",
      "FacilityID": 1919,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2134,
          "ProcessID": 2093,
          "NAICSCode": "325212",
          "_desc": {
            "NAICS_CODE": "325212",
            "NAICS_DESCRIPTION": "Synthetic Rubber Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 2231,
          "ProcessID": 2093,
          "ChemicalID": 9,
          "Quantity": 196000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 9,
            "ChemicalName": "Ethylene oxide  [Oxirane]",
            "CASNumber": "75-21-8",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502231,
          "ProcessID": 2093,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 2094,
      "AltID": "Epichlorohydrin",
      "FacilityID": 1919,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2135,
          "ProcessID": 2094,
          "NAICSCode": "325212",
          "_desc": {
            "NAICS_CODE": "325212",
            "NAICS_DESCRIPTION": "Synthetic Rubber Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 2232,
          "ProcessID": 2094,
          "ChemicalID": 21,
          "Quantity": 584000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 21,
            "ChemicalName": "Epichlorohydrin  [Oxirane, (chloromethyl)-]",
            "CASNumber": "106-89-8",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502232,
          "ProcessID": 2094,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 2095,
      "AltID": "Ether",
      "FacilityID": 1919,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2136,
          "ProcessID": 2095,
          "NAICSCode": "325212",
          "_desc": {
            "NAICS_CODE": "325212",
            "NAICS_DESCRIPTION": "Synthetic Rubber Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 2233,
          "ProcessID": 2095,
          "ChemicalID": 92,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 92,
            "ChemicalName": "Ethyl ether  [Ethane, 1,1'-oxybis-]",
            "CASNumber": "60-29-7",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502233,
          "ProcessID": 2095,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1919,
      "SummaryText": "1) It is the policy of Zeon Chemicals L.P. to prevent the accidental release of all hazardous chemicals used or stored on this site to protect our employees, people in our community, and the environment.  The facility will maintain a current Emergency Action Plan and work closely with the Local Emergency Planning Committee and emergency response agencies (police, fire department, etc.) in planning for and coordinating response to emergencies involving releases of hazardous chemicals.  The Risk Management Plan submitted for this facility represents programs, policies and procedures for managing risk that have been developed and used by Zeon Chemicals since the company purchased the facility.  Most of the elements of risk management under OSHA's Process Safety Management standard were in place long before 29 CFR 1910.119 was promulgated.  Zeon Chemicals is committed to minimizing risk from the operation of this facility as part of the community.\n\n2) This facility manufactures synthetic rubber.  Synthetic rubber is made as a polymer from chemicals known as monomers.  Two of the monomers used at this plant, ethylene oxide and epichlorohydrin, are regulated substances.  A third regulated substance, ethyl ether, is used in the formulation of catalyst.  Catalyst is used to facilitate the polymerization process.\n\n  a) Ethylene oxide is received by railcar and stored in two pressurized storage tanks.  The largest ethylene oxide storage tank has a capacity of 30,000 gallons.  Company policy limits the maximum filling of this tank to 90% of its full capacity.  The maximum amount of ethylene oxide that would be stored in the largest tank is 196,000 pounds.\n\n  b) Epichlorohydrin is received by railcar and stored in a single atmospheric storage tank.  This storage tank has a capacity of 66,000 gallons.  Company policy limits the maximum filling of this tank to 90% of its full capacity.  The maximum amount of epichlorohydrin that would be stored in this facility is 584,000 pounds."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1919,
      "SummaryText": "\n\n  c) Ethyl ether is received by railcar and stored in a single pressurized storage tank with a capacity of 15,000 gallons.  Railcars received on site have a capacity 20,000 gallons.  The maximum amount of ethyl ether that would be stored on site is 120,000 pounds, the equivalent of a full railcar.\n\n3) Release scenarios that predict potential off-site effects have been developed.  Both worst case, as well as alternative, scenarios were developed.  Alternative scenarios are generally more likely with respect to the highly unlikely worst case scenarios.  However, it should be noted that even the alternative scenarios have a low probability of occurring.  The lack of an incident in the ten year history of Zeon's operation of the facility even remotely approaching the scale of the alternative scenarios coupled with Zeon's ongoing prevention program and emergency preparedness supports this view.  Scenarios were developed for the toxic hazard of ethylene oxide and epichlorohydrin and the flammability hazard of ethyl ether.  The scenarios are summarized as follows:\n\n  a) Toxic Worst Case Release Scenarios\n\n    i) Ethylene Oxide:  Catastrophic failure of the largest storage tank filled to the maximum level allowed (90%) would result in the release of 196,000 pounds of  ethylene oxide.  The entire amount is released as a dense gas within 10 minutes.  The distance to the toxic endpoint for this scenario is 10.7 miles.\n\n    ii) Epichlorohydrin:  Catastrophic failure of the largest storage tank filled to the maximum level allowed (90%) would result in the release of 584,000 pounds of epichlorohydrin.  The release instantaneously results in an unconfined liquid pool that subsequently evaporates into a dense gas over 60 minutes.  The distance to the toxic endpoint for this scenario is 6.8 miles.\n\n  b) Toxic Alternative Release Scenarios\n\n    i) Ethylene Oxide:  Leak at a flange or pipe-fitting from an opening approximately 0.25 inches in diameter discovered and stopped within 60"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1919,
      "SummaryText": " minutes.  The leak is located at or near the process pumps.  The leak rate is 5.0 lb/min resulting in a total of 300 pounds released.  The material is released as a dense gas.  The distance to the toxic endpoint for this scenario is 0.22 miles.\n\n    ii) Epichlorohydrin:  A 0.5 inch hole at the bottom of the storage tank leaks for 60 minutes before it is discovered and plugged.  The leak results in an unconfined liquid pool which subsequently evaporates into a dense gas at 37.1 lb/min over 60 minutes.  The distance to the toxic endpoint for this scenario is 0.18 miles.\n\n  c) Flammable Worst Case Release Scenario\n\n    i) Ethyl Ether:  Catastrophic failure of a 20,000 gallon railcar resulting in the release of 120,000 pounds of ether as a flammable mass which, in turn, results in a vapor cloud explosion.  The distance to an overpressure of at least 1.0 psi for this scenario is 0.36 miles.\n\n  d) Flammable Alternative Release Scenario\n\n    i) Ethyl Ether:  A leak on a flange connection near the discharge of pump P-11.  The leak rate is 30 gallons per minute (pump capacity) and remains undiscovered for 3 hours.  The release results in a flammable mass of 6,270 pounds of ether gas.  The distance to an overpressure of at least 1.0 psi for this scenario is 0.12 miles.\n\n4) This facility complies with EPA's Accidental Release Prevention Rule and OSHA's Process Safety Management  Standard.  New equipment is purchased and installed per applicable codes (NFPA, etc).  A Hazard and Operability  review and Pre-startup Safety review are performed prior to operating any new equipment.  The facility's Mechanical Integrity program ensures equipment remains in good condition.  Operators and maintenance personnel use operating, maintenance and safety procedures that are constantly reviewed and updated.  Operators and maintenance personnel receive initial and periodic refresher training and must demonstrate competency before being certified or re-certified.  Accidents are investigated.  I"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1919,
      "SummaryText": "nvestigation results are reviewed with employees and corrective action tracked to completion.  Process control is redundant with a distributed computer control system including alarms and interlocks.  Contractor safety is monitored and documented.\n\n5) There has not been a reportable release of a substance covered by EPA's Accidental Release Prevention Rule from this facility in the last five years.\n\n6) The emergency response program for the facility includes an emergency action plan, employee training, drills, and coordination with the Local Emergency Planning Committee and local emergency response agencies.  The emergency action plan includes elements outlined in OSHA's HAZWOPER standard and EPA regulations (RCRA, Storm Water, etc.).  The latest revision has been provided to emergency response agencies.  Employees responsible for emergency response are trained at the local fire and police training academy for responding to fires and chemical releases.  About two-thirds of all employees are trained to the HAZMAT Tech level of the HAZWOPER standard.  All employees are trained regarding their roles during emergencies on site and participate in drills.  Fire department personnel participate with employees in fire demonstrations and plant walkthroughs for emergency response planning.\n\n7) Planned changes to improve safety include:\n\n  a) Upgrading secondary containment.\n  b) More intense emergency response training.\n  c) Additional gas detectors at the rail car unloading area.\n  d) An additional fire water monitor at the ethylene oxide storage tanks.\n  e) Capability of remotely activating the ethylene oxide sprinkler system from the control room.\n  f) Support, including funding, for a new computer system for the police department to automatically call residents and others in a designated area with a pre-recorded message.  This would dramatically help with evacuation efforts, but can also be used for a variety of public service announcements.\n  g) Draft and distribute a co"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1919,
      "SummaryText": "lor brochure to increase public awareness of the cooperative efforts of industry, the LEPC, emergency response agencies and local government in managing chemical risks including planning for and responding to emergencies."
    }
  ]
}