{
  "FacilityID": 19323,
  "FacilityName": "Point Loma Wastewater Treatment Plant",
  "FacilityStr1": "1902 GATCHELL ROAD",
  "FacilityStr2": null,
  "FacilityCity": "San Diego",
  "FacilityState": "CA",
  "FacilityZipCode": "92106",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06073",
  "LEPC": null,
  "FacilityLatDecDegs": "32.679167",
  "FacilityLongDecDegs": "-117.245833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.sannet.gov/mwwd/",
  "FacilityEmailAddress": "j3p@mwmaint.sannet.gov",
  "FacilityDUNS": 0,
  "ParentCompanyName": "CITY OF SAN DIEGO",
  "Company2Name": "METROPOLITAN WASTEWATER DEPARTMENT",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "CITY OF SAN DIEGO",
  "OperatorStr1": "4077 N. HARBOR DRIVE",
  "OperatorStr2": null,
  "OperatorCity": "SAN DIEGO",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92101",
  "OperatorZipCodeExt": null,
  "RMPContact": "JESSE PAGLIARO",
  "RMPTitle": "PLANT SUPERINTENDENT",
  "FTE": 73,
  "OtherEPAFacilityID": "CAD981390883",
  "EPAFacilityID": "100000090313",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "961008",
  "SafetyInspectionDate": "1999-02-18 00:00:00",
  "SafetyInspectionBy": "County of San Diego HMD",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-12-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-12-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-12-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2000-08-28 00:00:00",
  "DeRegistrationEffectiveDate": "2000-03-13 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.68,
  "FRS_Long": -117.24555,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 27172,
      "AltID": "DIGESTER GAS",
      "FacilityID": 19323,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 27870,
          "ProcessID": 27172,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 35456,
          "ProcessID": 27172,
          "ChemicalID": 93,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 93,
            "ChemicalName": "Methane",
            "CASNumber": "74-82-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 535456,
          "ProcessID": 27172,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19323,
      "SummaryText": "The City of San Diego Metropolitan Wastewater Department (MWWD) has developed a Risk Management Plan (RMP) for management and prevention of risks associated with the storage and processing of methane, a regulated flammable substance, at the Point Loma Wastewater Treatment Plant (PLWWTP).\nThis RMP was prepared in compliance with 40 CFR Part 68, CCR Title 19 Sections 2735 through 2785, and Clean Air Act Section 112 (r)(1).  Process Safety Management (PSM) elements of the RMP were prepared in compliance with 29 CFR Part 1910.119 and CCR Title 8 Section 5189.\n\nAccidental Release Prevention and Emergency Response Policies\n\nIt is the MWWD's policy to comply with applicable Federal and California rules.  The anaerobic digestion process at the PLWWTP produces methane which is considered a hazardous flammable substance by EPA and OSHA.  Due to the flammable characteristics of methane, the MWWD observes various safety\nprecautions in the storage, conveyance and combustion of methane.  The safety precautions are necessary to protect employees, contractors, and visitors at the PLWWTP and the immediately surrounding areas.  Safety precautions include written procedures and safety equipment to minimize the potential for accidental release, as well as a written emergency response program to respond to fires or other emergencies.  Safety equipment (such as vacuum and pressure relief valves, flame arrestors, flame trap assemblies, pressure switches, and flares) are used within the digester gas system to minimize potential for uncontrolled release of digester gas.  Fire extinguishers and fire hydrants are available for response\nto potential  fires.  Combustible gas detectors are used to detect digester gas leaks.\n\nThe Stationary Source and Regulated Substances Handled\n\nThe PLWWTP provides treatment for up to 240 million gallons per day of wastewater collected from sewers throughout the City of San Diego and surrounding communities.  Organic waste, or sludge, that is a byproduct of the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19323,
      "SummaryText": " wastewater treatment process is treated in large covered tanks (anaerobic\ndigesters).  In the anaerobic digesters, bacteria break down the organic waste producing digester gas.  Digester gas is a mixture of methane (about 65% vol.) and carbon dioxide (about 35% vol.).  Gas piping collects the digester gas and distributes it to boilers and engines, where it is used as fuel to produce hot\nwater and electricity for the plant.  Digester gas is also compressed and recirculated through the anaerobic digesters to provide mixing of the organic waste.  Excess digester gas is burned in enclosed flares.\n\nThe regulated substance handled at the PLWWTP is methane.  The total inventory of methane may be 15,361 pounds at any given time. \n\nWorst-case and Alternative Release Scenarios\n\nThe worst-case release scenario was determined following the EPA's \"Risk Management Program Guidance for Wastewater Treatment Plants (40 CFR Part 68).\"   The worst-case release scenario is a vapor cloud explosion of the methane contained in Digester 8, the largest digester at the PLWWTP.  This maximum distance from the center of Digester 8 to the explosion endpoint (an overpressure of 1 psi) is 0.134 miles (706 feet or 215 meters).\n\nThe following are known to be located within 0.134 miles of Digester 8:  Public parking at the south entrance to PLWWTP (located within Cabrillo National Monument); and Navy complex located uphill and east of PLWWTP.\n\nA berm located south of Digester 8 and the terrain (bluff) located east of Digester 8 act as passive mitigation to limit the impacts of a potential vapor cloud explosion in the southern (public parking) and eastern (Navy complex) directions.  There are no residences within 0.134 miles of Digester 8.\n \nThe alternative release scenario was determined following the EPA's \"Risk Management Program Guidance for Wastewater Treatment Plants (40 CFR Part 68).\"   The alternative release scenario is a vapor cloud explosion of the methane contained in Digester N1, the se"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19323,
      "SummaryText": "cond largest digester at the PLWWTP.  The\nmaximum distance from the center of Digester N1 to the explosion endpoint (an overpressure of 1 psi) is 0.123 miles (650 feet or 198 meters).\n\nThe following are known to be located within 0.123 miles of Digester N1:  Fort Rosecrans National Cemetery located uphill and northeast of PLWWTP; and Navy complex located uphill and east of PLWWTP.\n\nThe terrain (bluff) located north of Digester 8 acts as passive mitigation to limit the impacts of a potential vapor cloud explosion in the northern direction.  There are no residences within 0.123 miles of Digester N1.  \n\nGeneral Accidental Release Prevention Program and Chemical-specific Prevention Steps\n\nThe PLWWTP complies with EPA's Accidental Release Prevention rule and OSHA's Process Safety Management rule, as well as related California codes and regulations.  Operators, maintenance staff and contractors are informed of digester gas hazards.  Standard operating and maintenance procedures have been developed, and employees who work with the digester gas process are provided training.\n\nEmergency Response Program\n\nThe PLWWTP has an emergency response program that has been approved by the County of San Diego Hazardous Materials Division as part of the PLWWTP business plan.  The emergency response program is coordinated with the Fire Department and the City of San Diego Public Works Station 38.\n\nFive-year Accident History\n\nWithin the past five years there have been no accidental releases of digester gas resulting in deaths, injuries, or significant property damage on site; or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage. \n\nPlanned Changes to Improve Safety\n\nMWWD has used a Process Hazard Assessment (PHA) to identify and recommend changes to ensure a high level of safety.  Issues identified through the PHA are addressed in the PLWWTP's Prevention Program.  Recommendations from the most recent PHA include improvements to leak d"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 19323,
      "SummaryText": "etection, improvements to traffic control, and improvements to fire prevention planning.  An audit of the RMP and\nPSM programs will be conducted within three years to verify the effectiveness of the programs."
    }
  ]
}