{
  "FacilityID": 19363,
  "FacilityName": "Tip H. Allen Water Treatment Plant",
  "FacilityStr1": "225 North Hargon Street",
  "FacilityStr2": null,
  "FacilityCity": "Canton",
  "FacilityState": "MS",
  "FacilityZipCode": "39046",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28089",
  "LEPC": "Madison Co. Emer. Mgmt. Agency",
  "FacilityLatDecDegs": "32.615611",
  "FacilityLongDecDegs": "90.016528",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "SE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Canton Municipal Utilities",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Canton Municipal Utilities",
  "OperatorStr1": "P.O Box 114",
  "OperatorStr2": null,
  "OperatorCity": "Canton",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39046",
  "OperatorZipCodeExt": null,
  "FTE": 48,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000164788",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-08 00:00:00",
  "SafetyInspectionBy": "Mississippi Dept. of Health",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-12-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-12-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-12-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-12-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.62333,
  "FRS_Long": -90.68056,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 27218,
      "AltID": "Water Treatment",
      "FacilityID": 19363,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 35509,
          "ProcessID": 27218,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 27917,
          "ProcessID": 27218,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 10564,
              "Process_NAICS_ID": 27917,
              "SafetyReviewDate": "1999-07-16 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Mississippi Department of Health",
              "FR_Comments": null,
              "HazardReviewDate": "1999-08-10 00:00:00",
              "ChangeCompletionDate": "1999-12-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Need for Notification of a Chlorine Release via chlorine alarm.  Also need Outside Perimeter Monitoring/detection devices such as emergency phone dail-out.",
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Capitol Control cylinder mounted chlorine vacuum regulator feed system.  Will prevent/limit release of chlorine from the cylinder if the feed line fails.",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": "To be installed as part of process hazard analysis",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 1,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Detection  systems and monitoring devices are in the process of being installed.",
              "OpProceduresReviewDate": "1999-08-06 00:00:00",
              "TrainingReviewDate": "1999-06-14 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-08-10 00:00:00",
              "EquipmentInspectionDate": "1999-08-10 00:00:00",
              "EquipmentTested": "All componenets of the chlorine system such as cylinders, feed lines, regulators, valves, etc. are visually inspected daily, and when cylinders are changed-out approximatley every 20 days.",
              "ComplianceAuditDate": "1999-05-27 00:00:00",
              "AuditCompletionDate": "1999-06-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-08-10 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Tip H. Allen Water Treatment Plant is a municipal facility owned by the Canton Municipal Utilities (City of Canton).  This facility falls under the NAICS Code 22131.  The last review and/or update of the safety information was completed on July 16, 1999.  We are subject to the handling codes of the National Fire Protection Association for compressed gas cylinder storage, American National Standards Institute, and American Society o fMechanical Engineers.  These standards along with applicable (though not required) OSHA Standards have been implemented through written manuals.  Even though this is a municipal facility, and is not governed by OSHA, Tip H. Allen Water Treatment Plant has decided to use Process Safety Management as the prevention program (level 3).  To prevent/limit releases, this facility operates the chlorine feed system on an automatic vacuum feed system, manual shutoff valves, and delayed manual fan operation to control/limit the release to offsite receptors.  The vacuum feed regulators are cylinder mounted, therefore, the system will shut off the chlorine feed from the cylinders if there is a feed line leak anywhere from the chlorine tank valve to the injector.  Employees at the water treatment plant conduct maintenance checks on all systems involved with the chlorine on a daily basis.  These checks involve checking chlorine cylinder weights, inspecting sylinders, feed lines, etc.  Employees at the water treatment plant practice safe handling of chlorine, and follow manufacturer's recommendation for operational and maintenance procedures.  All employees who work on or with the chlorine system are trained in the maintenance and operating procedures at this facility when they are hired, and throughout their employment.  The operating and training procedures were last reviewed and/or updated on August 6, 1999.  The employees at the Tip H. Allen Water Treatment Plant are trained by on-the-job training, and are tested by observation and demonstration.  The last review of maintenance procedures was August 10, 1999.  There have been no accidents or releases in the past five years.  The last hazard review was conducted on August 10, 1999 by use of a fault tree analysis.  The results of the hazard analysis were the need for a chlorine alarm with chlrine (toxic) gas detection sensors in the chlorine cylinder room, and the chlorine feed room.  Also needed is perimeter monitoring.  This will be acomplished by installing an automatic emergency phone dial-out to indicate a release during off-duty hours.  These changes resulting from the process hazard analysis should be completed by December 30, 1999.  The Prevention Program for this facility is required to be a Level 2, however, a Level 3 PSM Prevention Program has been added for implementation to allow for a more effective release prevention program.",
              "_chemicals": [
                {
                  "PrimaryKey": 11062,
                  "PreventionProgram2ID": 10564,
                  "ProcessChemicalID": 35509
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 19363,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Harcross Chemical Company, Inc.",
    "CoordinatingAgencyPhone": "6019693177",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19363,
      "SummaryText": "In this water treatment plant facility (Tip H. Allen Water Treatment Plant) we handle chlorine which is considered hazardous by EPA, OSHA, etc.  The same properties that makes chlorine valuable as a water treatment chemical, also makes it necessary to observe certain precautions in handling chlorine.  Overall, the prevention of unnecessary human exposures, reducing the threat to our own personnal health as well as our co-workers, and reducing the threat to nearby members of the communtiy is the main goal of incorporating this Risk Management Plan into our daily operations.  It is our policy to adhere to all applicable federal and state rules and regulations.  Safety depends upon the manner in which we handle and use chlorine, combined with the safety devices inherent in the design of this facility, with the safe handling procedures that we utilize, along with the training of our personnel.\n\nThe primary purpose of this facility is to treat the water supply by utilizing chemicals such as chlorine.  Chlorine is received by individual one ton cylinders and stored until needed.  Chlorine is fed into the water system by automatic vacuum operated feeders.  The vacuum system will help prevent the continual operation of the chlorine feed from the cylinder if there is an increase or decrease in pressure on the feed lines (if a feed line is cut or split).  Access to the site is restricted to authorized facility employees, authorized management personnel, and authorized contractors.  The maximum amount of chlorine at this Tip H. Allen  Water Treatment Plant is 4,000 pounds.\n\nOur employees conduct proper cylinder change-out procedures when cylinders are changed out.  These procedures are based on the Manufacturer's recommendations.  Employees also review operating procedures and maintenance tasks daily or as need per manufacturer's recommendations.  The prevention program for this facility is a Level 2.  Lockout/Tagout procedures are used to help prevent an accidental release of"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19363,
      "SummaryText": " chlorine.  When maintenance is conducted on the chlorination system, the Water Operator (Eddie Mauldin) approves the proper installation of materials, and complete installation with final approval of achnges in the system by the Mississippi State Health Department.  Any change in maintenance procedures is reviewed and approved by the same operator.  All operators at this facility are knowledgeable in the proper start-up and shut-down procedures for the water treatment operations.  All components of the chlorination system are visually inspected at least once every day.\n\nOur emergency response (action) plan was developed with the assistance of Environmental Data Services, Inc., Harcross Chemical Chlorine Response Team, the Canton Fire Department, and the Madison County Emergency Management Agency.  If a chlorine release occurs at the 225 Hargon St. location, the public announcement system will be used to notify plant personnel of a release.  Safety Director (Bill Davenport) will get personel organized for an emergency action, and if necessary, response and evacuation.  On-duty personnel have SCBA equipment that they will use to enter the confined space (due to toxic atmosphere) and determine extent of release.  They can perform an emergency action by manual shutdown of the chlorine cylinder valve.  If the release cannot be controlled by the manual valve shutdown, then evacuation procedures will then be followed.  A head count will be made of employees and the Harcross Chemical Chlroine Response Team (Hazmat Responders) will be notified, then the 911 call will be made to notify the Canton Fire Department (HazMat Responders), Madison County Emergency Management Agency, the Madison County Sheriff's Office, and the Canton Police Department of the release.  Personnel at the 225 Hargon Street location, the Harcross Chlorine Response Team, the Canton Fire Department, and Madison County Emergency Management Agency will help organize the Emergency Response activities, and wi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19363,
      "SummaryText": "ll start the evacuation of the affected population.  The release could be slowed by employees not starting the manual vent system in the chlorine room until notification to 911 system is made, and evacuation activities begin.  This will not prevent chlorine from releasing, but will allow for some time to respond.\n\nThe worst case scenario for this facility is a one ton cylinder failure, which would be a release of 2,000 pounds of chlorine gas into the atmosphere.  Active mitigation has been considered for this scenario consisting of manual shutoffs, and automatic vacuum feed chlorine system.  Passive mitigation has also been considered for this release scenario, which would be a release into an enclosed space with little contact with outsisde air.  It is assumed that the entire contents of the cylinder are released as vapor.  The distance to endpoint of 0.087 mg/l for the worst case scenario is 2.2 miles.  The area surrounding the facility is considered to be rural due to the relatively flat ground, and thin vegetation.  The worst case scenarion would impact approximately 8,600 persons in approximately 3,600 households.\n\nAn alternate release scenario was determined for the 225 Hargon Street location, the Camden Well site, the Way Road Well site, the Levi Well site, the Lake Caroline North Well site, and the Lake Caroline South site.  The chlorine cylinders operate on an automatic vacuum fedd system, so the amount of chlorine released at these locations would be minimal (approximately 10 pounds).  This release of chlorine would have a distance to toxic endpoint of less than 0.1 miles.  All sites are considered rural, and would have off-site impacts of the following numbers.  At all these locations, the number off affected population would be approximately 12 persons in 5 households  All populations were based on Landview Software.\n\nThere have been no accidents or accidental releases of chlorine from this facility in the past five years.  The automatic vacuum feed syst"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 19363,
      "SummaryText": "em helps prevent/limit releases of chlorine that could escape during operational periods.  Operators of the chlorination system are required to check instruments, cylinders, feed lines, etc. on a daily basis to aid in the prevention of accidental releases.  Even though this is a Level 2 Prevention Program, Canton Municipal Utilities has chosen to utilize Level 3 Process Safety Management Program to furthur emphasize their efforts in preventing accidental releases of chlorine.\n\nThis water treatment facility complies with EPA's Accidental Release Prevention Rule, and with all applicable state/federal regulations."
    }
  ]
}