{
  "FacilityID": 19391,
  "FacilityName": "Hoeganaes Corporation",
  "FacilityStr1": "River Road and Taylors Lane",
  "FacilityStr2": "P.O. Box 271",
  "FacilityCity": "Riverton",
  "FacilityState": "NJ",
  "FacilityZipCode": "08077",
  "Facility4DigitZipExt": "2017",
  "FacilityCountyFIPS": "34005",
  "LEPC": "Cinnaminson Township OEM",
  "FacilityLatDecDegs": "40.022222",
  "FacilityLongDecDegs": "-74.986111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1519107,
  "ParentCompanyName": "Interlake Corporation",
  "Company2Name": "GKN plc",
  "CompanyDUNS": 151760105,
  "Company2DUNS": 0,
  "OperatorName": "Hoeganaes Corporation",
  "OperatorStr1": "1001 Taylors Lane",
  "OperatorStr2": null,
  "OperatorCity": "Cinnaminson",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08077",
  "OperatorZipCodeExt": "2017",
  "RMPContact": "Stanley C. Carver",
  "RMPTitle": "Dir Engineering and Riverton Oper.",
  "FTE": 262,
  "OtherEPAFacilityID": "08077HGNSCRIVER",
  "EPAFacilityID": "100000164895",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-14 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-12-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-12-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-12-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-10-05 00:00:00",
  "DeRegistrationEffectiveDate": "2008-09-04 00:00:00",
  "AnniversaryDate": "2004-12-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.02442,
  "FRS_Long": -74.98419,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 27258,
      "AltID": "Propane System",
      "FacilityID": 19391,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 27957,
          "ProcessID": 27258,
          "NAICSCode": "331111",
          "_desc": {
            "NAICS_CODE": "331111",
            "NAICS_DESCRIPTION": "Iron and Steel Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 35551,
          "ProcessID": 27258,
          "ChemicalID": 98,
          "Quantity": 110000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 535551,
          "ProcessID": 27258,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19391,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nHoeganaes Corporation (Hoeganaes) strives to surpass the expectations of our customers as well as provide employees with a safe working environment.  Health, safety, and the environment are areas to which we dedicate considerable resources.  We work to play our part to safeguard the environment and to contribute positively to the communities in which we operate.  Best practices in safety depend on the commitment of all employees, good systems, and the sharing of information and ideas.  Good management, excellent communication and consultation, effective training programs, and learning from the analysis of accidents are all important. \n\nThe prime targets of our health and safety activities include:\n\n1)  Zero accidents\n2)  Preventive safety measures and training\n3)  Continuous reduction of risk\n4)  Active integration of our employees in industrial safety\n\nThe prime targets for our environmental activities include:\n\n1)  Carefully dealing with resources\n2)  Development of environmentally friendly products and processes\n3)  Housekeeping maintained at the highest possible level\n4)  Continuous improvement in all environmental aspects\n\nWith the submission of this Risk Management Plan (RMP), Hoeganaes continues to show our commitment to operate the facility and all its processes in a safe, environmentally responsible manner. Emergency response planning and an accidental release prevention program are in place to ensure a safe working environment and with it, protection of the public and the environment outside of the property lines.\n\nFACILITY DESCRIPTION AND SUBSTANCES HANDLED\n\nHoeganaes owns and operates a powdered metals manufacturing facility located at River Road and Taylors Lane in Riverton, New Jersey.  The plant manufactures sponge iron, ferrous metal powders, atomized steel and atomized high alloy processes.  The plant is located on a site of approximately 97 acres in an area that has a few heavy industri"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19391,
      "SummaryText": "al facilities, some moderate to light industrial facilities, and a variety of commercial complexes.    \n\nOut of the 140 substances regulated under the Risk Management Program, propane is the only one that can be found at the plant over the threshold quantity; the facility has approximately 110,000 pounds of propane in regulated process onsite.  This Risk Management Plan was developed for the propane system. The 30,000-gallon propane storage tank is located south of the propane filling station.\n\nWORST-CASE RELEASE SCENARIO AND ALTERNATE RELEASE SCENARIOS\n\nThe U.S. Environmental Protection Agency (EPA) has defined worst-case accidental release of a flammable substance (propane) as the release of the greatest amount of propane in a storage tank, which then vaporizes, resulting in a vapor cloud explosion.  The endpoint of this explosion is the area with an overpressure of 1 psi, which is enough to break windows, possibly causing injuries because of flying debris.\n\nFollowing the procedures outlined in EPA's RMP Offsite Consequence Analysis Guidance (May 24, 1996) and Risk Management Program Guidance for Propane Storage Facilities (40 CFR Part 68) (October 1998), it has been determined that the worst-case release quantity would be a release from the storage tank filled to 88 percent capacity (110,000 pounds).  There are no schools, hospitals, prisons or public recreational areas or environmental receptors within the impacted area. \n\nThe likelihood of the worst-case release is remote.  The tank system and related equipment is designed, built, and operated according to stringent industry standards, such as National Fire Protection Association codes.  Therefore, several other possible releases were evaluated as alternate release scenarios to the worst-case release scenario.  The alternate release scenarios that were evaluated include a 10-minute release due to a break in a 1-inch diameter pipe.  Even this release is very conservative.  A more realistic release would be a rel"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19391,
      "SummaryText": "ease due to a filling hose coming loose during filling, or a small leak at a valve.  However, such releases would not result in an off-site impact.  EPA requires that the selected alternate release scenarios have an off-site impact; therefore, only the alternate release scenarios that show an off-site impact are included in the RMP.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe propane system at Hoeganaes is subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management Rule (PSM Rule).  The management system developed based on this regulation together with elements of the Risk Management Program results in a comprehensive prevention program.  Hoeganaes is committed to maintain this system. \n\nThe elements of the prevention program include: an employee training program, Standard Operating Procedures (SOPs) for numerous operations, a maintenance program, a system to manage changes at the plant to ensure that safety and employee training issues are addressed, a hot work permit program, a program for ensuring that contractors are trained and informed of hazards, and a system to review new or modified sources before start-up to ensure safety.\n\nAdditionally, there are a number of industry standards that Hoeganaes recognizes as generally acceptable good engineering practices that it may use as the basis for design, construction, and selection of materials including: American National Standards Institute, American Society for Testing and Materials, American Welding Society, American Society of Mechanical Engineers, Institute of Electrical and Electronic Engineers, National Electrical Manufacturers Association, National Fire Protection Agency, Instrument Society of America, National Electrical Code (Class I, Division 2, Group F), International Electrical Testing Associations, Factory Mutual Approvals, and local building codes. \n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe propane system subject to RMP at Hoegana"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 19391,
      "SummaryText": "es has had no accidents. \n\nTHE EMERGENCY RESPONSE PROGRAM\n\nHoeganaes has developed and maintains an Emergency Action Plan.  This plan identifies the trained emergency personnel at the facility as well as the off-site response contractors.  The plan also gives instructions on contacting governmental and community responders.  An annual emergency response drill is held at the plant.\n\nHoeganaes has assigned roles for its Site Emergency Coordinator and alternate, and Emergency Response Coordinator and alternates.  These personnel are responsible for emergency actions as well as coordination with state and local agencies on a 24-hour basis.  The Site Emergency Coordinator functions as the leader of the emergency response team and initiates the appropriate telephone calls notifying plant personnel and emergency services and also implements immediate steps to contain or eliminate the hazardous condition.  The Emergency Response Coordinator initiates response notification to the National Response Center and the state and monitors the release area.  The Emergency Response Team provides additional support.\n\nAs needed, off-site emergency response contractors trained to clean up hazardous materials spills are also on call 24-hours per day, 7 days a week.  \n\nHoeganaes has coordinated services with a number of government and community agencies who would respond to an emergency, such as the state and local police or fire departments, the ambulance squad, state and county emergency response officials, and an area hospital.  \n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nHoeganaes is committed to maintaining a safe and efficient facility.  Part of this commitment is maintaining and operating the system in accordance with the principles and requirements of the RMP plan.  We will continue to implement changes to improve safety as needed.\n\nMISCELLANEOUS ISSUES\n\nHoeganaes has applied to the New Jersey Department of Environmental Protection for a Clean Air Act Title V Operating Permit; however, as"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 19391,
      "SummaryText": " of the date of the submittal of this RMP it has not been issued."
    }
  ]
}