{
  "FacilityID": 19442,
  "FacilityName": "Rowlett Creek Regional  WWTP",
  "FacilityStr1": "1400 Los Rios Blvd",
  "FacilityStr2": null,
  "FacilityCity": "Plano",
  "FacilityState": "TX",
  "FacilityZipCode": "75074",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48085",
  "LEPC": "Collin County LEPC",
  "FacilityLatDecDegs": "33.0175",
  "FacilityLongDecDegs": "-96.646944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": "ntmwd@airmail.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "North Texas Municipal Water",
  "OperatorStr1": "P.O. Box 2408",
  "OperatorStr2": null,
  "OperatorCity": "Wylie",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75098",
  "OperatorZipCodeExt": null,
  "FTE": 13,
  "OtherEPAFacilityID": "TX0047911",
  "EPAFacilityID": "100000147094",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-01-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-01-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-12-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 33.01383,
  "FRS_Long": -96.65467,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 27343,
      "AltID": "Chlorination\\De-Chlorinat",
      "FacilityID": 19442,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 35657,
          "ProcessID": 27343,
          "ChemicalID": 49,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 35658,
          "ProcessID": 27343,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 28044,
          "ProcessID": 27343,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 10612,
              "Process_NAICS_ID": 28044,
              "SafetyReviewDate": "1999-12-15 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Chlorine Institute",
              "FR_Comments": "Many of the process controls under Section 8.4d are N/A to the chorination / dechlorination process.",
              "HazardReviewDate": "1998-12-15 00:00:00",
              "ChangeCompletionDate": "1999-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "A scrubber is scheduled for construction beginning in 1999.",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": " There are no flammable materials used at this facility.",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Area Detectors should be provided by 2/29/2000.",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-12-15 00:00:00",
              "TrainingReviewDate": "1999-12-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-12-15 00:00:00",
              "EquipmentInspectionDate": "1999-04-15 00:00:00",
              "EquipmentTested": "SCBA, Repair Kits",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "Safety Standards",
              "_chemicals": [
                {
                  "PrimaryKey": 11113,
                  "PreventionProgram2ID": 10612,
                  "ProcessChemicalID": 35657
                },
                {
                  "PrimaryKey": 11114,
                  "PreventionProgram2ID": 10612,
                  "ProcessChemicalID": 35658
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "ProcessID": 27344,
      "AltID": "Chlorination",
      "FacilityID": 19442,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 35659,
          "ProcessID": 27344,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 28045,
          "ProcessID": 27344,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 19442,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-12-15 00:00:00",
    "ERTrainingDate": "1999-12-15 00:00:00",
    "CoordinatingAgencyName": "City of Plano Fire Department",
    "CoordinatingAgencyPhone": "9729417159",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": "EPCRA"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19442,
      "SummaryText": "\nNTMWD ROWLETT CREEK REGIONAL WASTEWATER TREATMENT PLANT RISK MANAGEMENT PLAN\n \nExecutive Summary\n\nFacility Description - The Rowlett Creek Regional Wastewater Treatment Plant is located in Plano, Texas at 1400 Los Rios Blvd. The facility is owned and operated by the North Texas Municipal Water District (NTMWD). This facility is a conventional wastewater treatment plant and uses chlorine and sulfur dioxide as part of the treatment process. Currently, a maximum of 24,000 pounds of chlorine and 12,000 pounds of sulfur dioxide are maintained on the site. No other toxic or flammable substances, as listed in 40 CFR 68 are stored or utilized at the facility at thresh-hold levels.\n\nSafety Policies - The NTMWD is fully committed to safety at the Rowlett Creek Plant and has long emphasized the importance of safety in storing and using regulated toxic substances. NTMWD has used the 40 CFR 68 requirements as an opportunity to further refine its safety program and strengthen its emergency response procedures. NTMWD is developing the capability to respond to accidental releases of chlorine or sulfur dioxide, should a release occur.\n\nFive Year Accident History -  NTMWD's commitment to managing risks associated with chlorine and sulfur dioxide is demonstrated by its excellent track record with these substances. The Rowlett Creek Plant has not experienced an accident related to chlorine or sulfur dioxide within the past five years.\n\nSection 4 and 5, referencing flammable liquids and gases, do not apply to this facility.  \n\nProgram 3 requirements do not apply to this facility.\n\nProgram 3 requirements do not apply to this facility.\n\nOffsite Consequence Analysis - For the facility's worst-case offsite consequence analysis, chlorine and sulfur dioxide were established as having identical radii of impact.  Chlorine wasused for the worst-case scenario. Public receptors do exist within this radius, including residences, educational facilities, parks, major commercial / office buildings, a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19442,
      "SummaryText": "nd prisons. As required by the risk management regulations, the offsite consequence analysis also required development of alternative-release scenarios for both chlorine and sulfur dioxide. Realistic potential alternatives were modeled, with consideration toward actual conditions at the site. The resulting radii of impact are therefore useful tools for emergency response teams in planning for and responding to emergency situations.\n\nPrevention Program Description - The prevention program represents the core of the day-to-day means by which accidental releases of regulated substances into the air will be minimized. This component will be used primarily by plant personnel responsible for the operation and maintenance of regulated processes at the facility. The prevention program will also become a useful tool in ongoing training of plant personnel.\n\nThe Program 2 Prevention Program includes seven primary components:\n\nSafety Information: Up-to-date safety information has been compiled relating to regulated substances, processes, and equipment. Safety information will also be updated any time a major change occurs that would make the safety information inaccurate.\n\nHazard Review: Regulated processes at the facility have been reviewed to identify potential hazards. The results have been documented in a hazard review report. Problems identified by the hazard review are being resolved in a timely manner.\n\nOperating Procedures: Written operating procedures have been prepared providing instructions for safely conducting activities associated with regulated processes. These procedures will also be updated should a major change in the handling or storage of regulated substances occur.\n\nTraining: Plant personnel responsible for operating regulated processes receive training in the processes. Periodic refresher training is required.\n\nMaintenance: Procedures have been implemented to ensure that the mechanical integrity of the process equipment is maintained. Ongoing training of p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19442,
      "SummaryText": "ersonnel responsible for maintenance is also required. Inspection and testing of regulated process equipment is a requirement as well.\n\nCompliance Audits: The prevention program will be audited at least once every three years to evaluate compliance with the risk management rules. The results of the audit will be documented, and deficiencies corrected.\n\nIncident Investigation: Should an incident involving a release, or near release, of a regulated substance occur, it will be investigated promptly. The findings of any such incident investigation will be used to improve the safety of the process.\n\nEmergency Response Program\n\nNTMWD has determined that the Rowlett Creek Regional Wastewater Treatment Plant will assume a responder status with respect to accidental releases of chlorine or sulfur dioxide. NTMWD has developed its own emergency response plan and will develop emergency response capabilities, essentially to ensure its ability to act as a first responder in the event of a release. The plan also calls for close coordination with area fire departments and other emergency response personnel.\n\nThe facility's employees also have a significant role in the event of a release of chlorine or sulfur dioxide. Should a release occur or be suspected when employees are at the facility, employees responsible for working with chlorine and sulfur dioxide will follow procedures for assessing the situation and attempting to safely stop the release using normal shutdown procedures. Facility personnel will receive ongoing training in identification of potential releases, and in how to determine when NTMWD emergency response personnel should be involved.\n\nNTMWD will work closely with community emergency response personnel to ensure that emergency response, should it become necessary, is efficiently and safely carried out. Coordination may include: \n\nPeriodic meetings between operators, NTMWD emergency response personnel, and area fire department emergency responders to discuss emergen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 19442,
      "SummaryText": "cy response measures.\n\nPeriodic review of the facility by NTMWD emergency response personnel and area fire department emergency responders to ensure their familiarity with routes to the facility, ingress and egress routes at the facility, and layout of the chlorine and sulfur dioxide process areas.\n\nPeriodic practice drills utilizing operators and emergency response personnel.\n\nEmployees at the facility responsible for working with chlorine and sulfur dioxide will receive periodic training.\n\nImproving Safety\n\nThe Rowlett Creek Regional Wastewater Treatment Plant is currently undergoing a major expansion which is planned for completion by early next year. This expansion included reconstruction of chlorine and sulfur dioxide storage and feed systems. Both chlorine and sulfur dioxide will be housed in buildings intended to substantially mitigate the effects of any release of these substances. Once the expansion is complete the Risk Management Program and this Risk Management Plan will be modified to reflect the improved conditions.\n\nNTMWD will continue to improve its risk management program for the wastewater treatment plant by responding to the recommended changes outlined in the Hazard Review, by ongoing training of personnel, and by continued coordination with emergency response officials. As the wastewater treatment plant grows to meet the growing demands of the area served by the facility, future plant expansions will consider further improvements in the treatment process to manage risks associated with these regulated substances."
    }
  ]
}