{
  "FacilityID": 19509,
  "FacilityName": "Cebro Frozen Foods (Rev 12-99)",
  "FacilityStr1": "2100 Orestimba Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Newman",
  "FacilityState": "CA",
  "FacilityZipCode": "95360",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06099",
  "LEPC": null,
  "FacilityLatDecDegs": "37.317778",
  "FacilityLongDecDegs": "-121.0575",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 808969125,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Skip Cerruti",
  "OperatorStr1": "2100 Orestimba Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Newman",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95360",
  "OperatorZipCodeExt": null,
  "FTE": 17,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000123902",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-01-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-01-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-01-04 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-01-04 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.4",
  "FRS_Lat": 37.317716,
  "FRS_Long": -121.05854,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 27417,
      "AltID": null,
      "FacilityID": 19509,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 35745,
          "ProcessID": 27417,
          "ChemicalID": 56,
          "Quantity": 17000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 28118,
          "ProcessID": 27417,
          "NAICSCode": "311411",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 15020,
              "Process_NAICS_ID": 28118,
              "SafetyReviewDate": "1999-06-21 00:00:00",
              "PHA_Date": "1999-01-26 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-01-28 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Fire Diffusion System",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fire Diffusion system",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-21 00:00:00",
              "TrainingReviewDate": "1999-06-21 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-21 00:00:00",
              "EquipmentTested": "Compressors",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-06-21 00:00:00",
              "AuditCompletionDate": "2001-06-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-21 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 21823,
                  "PreventionProgram3ID": 15020,
                  "ProcessChemicalID": 35745
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 19509,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-01 00:00:00",
    "ERTrainingDate": "1999-06-01 00:00:00",
    "CoordinatingAgencyName": "Newman fire Department",
    "CoordinatingAgencyPhone": "8002734911",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19509,
      "SummaryText": "CEBRO FROZEN FOODS\nRISK MANAGEMENT PROGRAM (CalARP)\nAND PROCESS SAFETY MANAGEMENT PROGRAM\n\nAnhydrous Ammonia Refrigeration System\n\nRevised December 1999\n\n\nEXECUTIVE SUMMARY\n\n\n\nCebro Frozen Foods (Cebro) prepared a chemical risk management program and Process Safety Management Program (RMP/PSM) in general accordance with state and federal regulations. The state risk management regulations, also referred to as the California Accidental Release Prevention (CalARP) program, are codified in California Code of Regulations (CCR), Title 19, Section 2745, et. Seq. The Environmental Protection Agency (EPA) also regulates facilities with certain toxic and flammable substances. The federal regulations are codified in the Code of Federal Regulations (CFR), Title 40, Section 68. Finally, both the California Occupational Safety and Health Administration (CalOSHA) and the Occupational Safety and Health Administration (OSHA) regulate facilities with certain acutely hazardous materials under the PSM standards as defined in CCR, Title 8, Section 5189 and CFR Title 29, Part 1910, Section 1910, respectively.\n\nCebro prepared the RMP/PSM program to satisfy regulatory requirements and to demonstrate a commitment to evaluate and improve anhydrous ammonia handling systems and practices at the facility. Many state-of-the-art safety features were incorporated into the ammonia refrigeration system at the facility as part of the original system construction. In the unlikely event that a chemical release does occur at the facility, Cebro personnel are trained in the appropriate response measures, relying on emergency services provided by the local fire department and the Stanislaus County Hazardous Materials Response team. Cebro will continue to improve ammonia-handling safety through the implementation of the prevention program elements of the RMP/PSM program.\n\nCebro is located at 2100 Orestimba Road in Newman, California. The facility is approximately 2 miles west of Highway 33, which runs nort"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19509,
      "SummaryText": "h and south through Newman. The area is zoned for agricultural and industrial use. Cebro is a family owned business that produces frozen vegetables. Cebro constructed the facility in 1993 with all new refrigeration system components. \n\nAnhydrous ammonia is used in the facility's refrigeration system. The refrigeration system, which is a closed system, contains approximately 17,000 pounds of anhydrous ammonia. The system provides cooling to the cold storage rooms, a quick freezer, and a plate chiller. The cold rooms are used to store fresh and frozen vegetables. The quick freezer is used for initial vegetable freezing. The plate chiller provides cold water for cleaning and cooling the fresh vegetables. \n\nThe RMP regulations require facilities to identify and evaluate chemical release scenarios resulting from potential failures of the chemical handling systems covered by the RMP. Program 3 requirements of the RMP apply to the Cebro facility due to the quantity of ammonia used. Program 3 facilities are required to evaluate a worst-case release scenario (release parameters are defined by the regulations) and an alternative release scenario. The regulations define a worst-case release scenario as \"\u0005the greatest amount held in a single vessel\u0005released as a gas over 10 minutes.\"  An alternative release scenario is identified as a release that is more likely to occur at the facility.\n\nCebro's largest ammonia vessel, the high-pressure receiver, has a capacity of 18,280 pounds of ammonia. The estimated maximum quantity of ammonia used in the system is only 17,000 pounds, therefore, the worst-case release scenario for the facility is a release of 17,000 pounds of ammonia in 10 minutes. Catastrophic failure of the high-pressure receiver is required for this scenario to occur. As required by the RMP regulations, pessimistic atmospheric conditions, very conservative chemical dispersion characteristics, and a toxic endpoint of 200 parts per million (ppm) ammonia vapor were assumed"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19509,
      "SummaryText": ". The predicted distance to the toxic endpoint for the worst-case release scenario is approximately 1.32 miles using the SLAB atmospheric dispersion model. The SALB model was used to allow use of atmospheric data more representative of the site. SLAB was first developed by Lawrence Livermore National Laboratory under contract with the U.S. Department of Energy. SLAB has been revised and updated by the USAF Engineering and Services Center and the American Petroleum Institute. SLAB is commonly used to simulate the atmospheric dispersion of denser-than-air releases.\n\nCebro used the alternative release scenario described in the EPA's Model Risk Management Program and Plan for Ammonia Refrigeration, November 1998. The release scenario is described as a <-inch effective diameter orifice leaking liquid ammonia and resulting in an airborne release, representative of a pipe connection leak or a gasket rupture. The evaluation used a release rate of 79.7 pounds per minute and average weather conditions. The predicted distance to the toxic endpoint for the alternative release scenario is approximately 0.11 mile. The SLAB Model was used also for modeling the alternative release scenario.\n\nThe RMP/PSM regulations require a review of the accidental release prevention program and chemical specific prevention steps used by the facility. Cebro has incorporated many safety features in the ammonia refrigeration system to prevent system failures and to mitigate potential releases. The predominant safety concern with closed-loop ammonia systems is an inadvertent buildup of pressure exceeding pressure ratings or capacities of equipment due to ammonia expansion. The Cebro ammonia system is continuously monitored by automated control systems that shut down components if deviations from normal operating conditions occur. Further, the system is equipped with pressure relief valves on all pressure vessels and most, if not all, additional locations within the ammonia system where ammonia could"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 19509,
      "SummaryText": "become trapped.\n\nOther safety features at the facility include: \n7 emergency shutdown systems\n7 component specific safety shutdowns\n7 an ammonia leak detection system in all process areas that contain ammonia equipment\n7 an ammonia fire dump system that can be used to relieve pressure in vessels\n7 ammonia pipes are color-coded\n7 Cebro reported that their ammonia related computer systems are Y2K compliant\n\nIn addition to the physical features of the ammonia refrigeration system at the facility, Cebro has extensive administrative controls in place to maintain safe operation of the system. Administrative controls include, but are not limited to, formal training programs for system operators and mechanics, emergency training, a hot work permit program, a lockout/tagout program, a contractor safety program, incident investigation program, mechanical integrity program, management of change program, pre start-up safety review program and an RMP/PSM auditing and inspection program. Written standard operating procedures (SOPs) have been prepared for the ammonia system at the facility. The SOPs will provide a basis for site specific operator training and a ready reference for operating and trouble-shooting the systems.\n\nCebro is committed to maintaining the mechanical integrity of the ammonia refrigeration system. A preventive maintenance system is utilized to manage the maintenance of the refrigeration system. Preventive maintenance at the facility includes shift, daily, weekly, and periodic inspection; calibration; testing; and overhaul of ammonia system equipment. The system is used to track equipment performance and to create reports that are used by maintenance personnel to monitor the frequency of repairs and deviations from normal operating parameters.\n\nThe RMP/PSM regulations require a review of the five-year accident history at the regulated facility. Cebro reported no accidental release of ammonia during the past five years.\n\nChanges to improve safety at the facilit"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 19509,
      "SummaryText": "y are ongoing. Many of the mitigation measures suggested by the process hazard analysis team have already been implemented. Others will be implemented during the next several months. The status of significant mitigation measures is as follows:\n7 the review of SOPs is nearly completed\n7 valve tagging is completed\n7 security fencing of the compressor and ammonia vessel pad area is completed\n7 spring return valves are now used for all oil draining\n7 preventive maintenance and inspection recommendations have been implemented\n7 catwalks and guard rails for inspection and maintenance of condensers have been installed\n7 Cebro will be installing roof access ladders\n7 Cebro has developed coil cleaning procedures\n\nCebro will respond to all suggested mitigation measures promptly. Cebro has established completion schedules for proposed actions. Management responses and support will be consistent with Cebro's commitment to safe and environmentally responsible operations.\n\nCebro recognizes that the RMP/PSM is a continuous process for evaluating, monitoring, and improving anhydrous ammonia handling operations at its facility. As such, this document and related attachments and program elements will evolve as Cebro continues their ongoing focus and dedication of risk minimization and safety improvement for their employees and surrounding community. Cebro will submit revised information if a change occurs that is considered significant and requires resubmission under the regulations. However, minor improvements/modifications to the RMP/PSM, related attachments, and program elements will be incorporated consistent with Cebro's internal review practices, and Cebro will maintain the most current versions on site. Thus, the most current version RMP/PSM and related documents and elements maintained on site may vary slightly from the information in submittals made to EPA and other regulatory agencies."
    }
  ]
}