{
  "FacilityID": 1951,
  "FacilityName": "Aldrich Chemical Company-Emmber",
  "FacilityStr1": "230 South Emmber Lane",
  "FacilityStr2": null,
  "FacilityCity": "Milwaukee",
  "FacilityState": "WI",
  "FacilityZipCode": "53233",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55079",
  "LEPC": "Milwaukee County LEPC",
  "FacilityLatDecDegs": "43.03",
  "FacilityLongDecDegs": "-87.929167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "UN",
  "FacilityURL": "https://www.sigma-aldrich.com",
  "FacilityEmailAddress": "kterbeek@sial.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Aldrich Chemical Company",
  "Company2Name": null,
  "CompanyDUNS": 79928354,
  "Company2DUNS": 0,
  "OperatorName": "Aldrich Chemical Company",
  "OperatorStr1": "230 South Emmber Lane",
  "OperatorStr2": null,
  "OperatorCity": "Milwaukee",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53233",
  "OperatorZipCodeExt": null,
  "FTE": 60,
  "OtherEPAFacilityID": "53233LDRCH230SO",
  "EPAFacilityID": "100000023609",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1995-02-06 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-06-21 00:00:00",
  "DeRegistrationEffectiveDate": "2004-06-17 00:00:00",
  "AnniversaryDate": "2004-06-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 43.03304,
  "FRS_Long": -87.92906,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2147,
      "AltID": "Storage",
      "FacilityID": 1951,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 2283,
          "ProcessID": 2147,
          "ChemicalID": 92,
          "Quantity": 12040.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 2188,
          "ProcessID": 2147,
          "NAICSCode": "325199",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1951,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-04-15 00:00:00",
    "ERTrainingDate": "1999-02-01 00:00:00",
    "CoordinatingAgencyName": "Milwaukee Fire Department",
    "CoordinatingAgencyPhone": "4142868943",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1951,
      "SummaryText": "Aldrich Chemical Company-Emmber Site\nRisk Management Program (RMP) Plan Executive Summary\n\nSite and Process Description\n\n    Aldrich Chemical is a batch manufacturer and repackager of fine organic chemicals for use in research and industry.  The Emmber facility serves three purposes 1) storage and distribution of bulk raw materials, 2) chemical packaging and 3) synthesis of stains and dyes and various research chemicals.   Chemicals stored at the site are in containers of up to 55 gallons. \n\nThe Emmber facility consists of a series of a five story masonry structure encompassing 100,000 square feet of manufacturing, packaging and warehouse space.  Utilities are provided for the handling of ventilation, water, sanitation and other essential services.  The various departments are equipped with heated, ambient and cooled areas for material storage and manufacturing as needed.\n\nSummary of Major Hazards\n\nUnder RMP Aldrich Chemical has identified a process which poses potentially major hazards.  Analysis of the worst-case release scenario for this process shows no offsite consequences as defined under RMP.  A brief description of this processes is given below.   \n\n16) Ethyl ether is stored in containers of up to 55 gallons in a sprinklered area dedicated to the storage of flammables.\n\nConsequences of Failure to Control the Hazards\n\nAnalyses have been made for ethyl ether of the worst-case release scenario in which the entire contents of a 55 gallon drum are spilled.   The hazard zone was contained onsite.  Aldrich employees could be affected if a worse-case release scenario occurs.   The effects of any release onsite will be minimized by several factors including: 1) Emmber spill team, 2) Aldrich Milwaukee HazMat team 3) Site wide alarm & PA system and 4) Employee training (ie. evacuation drills, safety training, contingency plan training).  These factors are elaborated upon in the Emergency Response Plan.  \n\nPrevention of Releases\n\n    Aldrich has put in place several measures "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1951,
      "SummaryText": "improve operations, improve safety and reduce the risk of a release.  The ethyl ether is stored in a sprinklered area dedicated to storage of flammables.  There is an active safety committee at the Emmber site which conducts safety inspections.\n\n    Measures which Aldrich takes to reduce the probability of a release include:\n\n1) Training of operators in HM-181 concerning the handling and transportation of dangerous goods\n2) Regular review of operating procedures\n3) Regular training of operators\n4) Training and licensing of all forklift drivers  \n\nSteps Taken to Address Hazards\n\n    Several steps are being taken by Aldrich to continually improve safety at the Emmber site and reduce the risk of a release.  A site safety committee performs safety inspections.   \n\nAldrich has an incident investigation system in place.  Lessons learned from incidents are passes along to the other operating departments.  Each department has a set of standard operating procedures (SOPs) written by operators which are reviewed and approved by department management and the safety department.   The SOPs are routinely reviewed to ensure they are current and account for any new hazards.\n\nResponse Action in the Event of a Release\n\n    A spill team is present during working hours at Emmber to respond to, assess and clean up spills.  The spill team is capable of level B entries.  If a spill is beyond the capabilities of the spill team or a spill occurs after working hours Aldrich has a HazMat team, which will respond.  The HazMat team is capable of level A entries and is staffed on all three shifts.  Meetings are held six times a year for training in response procedures.  The response team has equipment housed in a trailer for use anywhere onsite.  Extra equipment is kept at the Emmber site.\n\n    A site emergency response plan details the actions of the Spill team, the HazMat team, other employees, and visitors during a release.  The plan provides phone numbers for contacting outside response agencies.  Aldri"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1951,
      "SummaryText": "ch has coordinated its emergency response procedures by providing the outside response agencies with copies of the contingency plan and by escorting the Milwaukee Fire Department through the site on several occasions."
    }
  ]
}