{
  "FacilityID": 19581,
  "FacilityName": "Pender Grain, Inc. - Pender",
  "FacilityStr1": "3rd and Willis",
  "FacilityStr2": null,
  "FacilityCity": "Pender",
  "FacilityState": "NE",
  "FacilityZipCode": "68047",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31173",
  "LEPC": null,
  "FacilityLatDecDegs": "42.1",
  "FacilityLongDecDegs": "-96.705806",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 35160449,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "D. Scott Darling",
  "OperatorStr1": "112 North Fourth Str.",
  "OperatorStr2": "P.O. Box 28",
  "OperatorCity": "Pender",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68047",
  "OperatorZipCodeExt": "0028",
  "RMPContact": "D Scott Darling",
  "RMPTitle": "Owner",
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000165705",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Tri-State Insurance Co.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "PRM-1999-1-000681-4",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-01-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-01-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Paper",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-01-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-01-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 42.1,
  "FRS_Long": -96.70581,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 27514,
      "AltID": null,
      "FacilityID": 19581,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 28215,
          "ProcessID": 27514,
          "NAICSCode": "42291",
          "_desc": {
            "NAICS_CODE": "42291",
            "NAICS_DESCRIPTION": "Farm Supplies Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 35854,
          "ProcessID": 27514,
          "ChemicalID": 56,
          "Quantity": 76000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 535854,
          "ProcessID": 27514,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19581,
      "SummaryText": "1. The Facility Policy\n\nWe at Pender Grain, Inc. are committed to the prevention of any accidental release of Anhydrous Ammonia at our fertilizer facility in Pender, Nebraska. If an accidental release should occur, the facility is prepared to work with the local fire department, or other authorities, to mitigate any release and minimize the impact of the release to people and the environment.\n\n2. Facility Information.\n\nAs owner, I attend annual meetings pertaining to the safe handling and disposing of all agricultural chemicals and fertilizers, including--Anhydrous Ammonia. I am a member of the Nebraska Fertilizer Institute, who keeps me informed on all issues pertaining to pesticides and fertilizers.\n\nPender Grain, Inc. holds annual employee safety meetings prior to the start of each fertilizer season, as a refresher course for current employees, as well as any new or seasonal employees, which we might have. Our business is diversified, and we have three employees staffed for Anhydrous Ammonia for the short spring and fall season. For the rest of the year, they are in other areas.\n\nPender Grain, Inc. receives and stores Anhydrous Ammonia for direct land injection as a crop production nutrient.\n\nThe maximum quantity stored would be 76,000 pounds in our one 18,000 gallon storage tank.\n\n3. The worst-case release scenario and the alternative release scenario.\n\na. Our Anhydrous Ammonia storage tank has been fitted with a remote cable operated \"emergency shut off value\". In a worse case scenario, if any hose or piping were to rupture while receiving a truck tanker load of anhydrous Ammonia, it would be possible to release the maximum quantity of 76,000 pounds of Anhydrous Ammonia over 10 minutes to the endpoint (point of dispersion to 200 ppm) distance of .83 miles. This accidental release can be prevented if the operator simply pulls the cable located at either end of the tank, which will close the main value, stopping the flow of Anhydrous Ammonia.\n\nOur employees and l"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19581,
      "SummaryText": "ocal fire officials have been instructed as to the use of this value in case of an emergency.\n\nb. The potential of an alternative release has been safe guarded against, by the installation of \"break away'' values on our transfer hoses between the Anhydrous Ammonia storage tank and \"Anhydrous Ammonia Nurse tanks\". The potential release without his safeguard might release 2901 pounds of Anhydrous Ammonia in two minutes to the endpoint (point of dispersion to 200 ppm) distance of .22 miles.\n\n4. The accidental release prevention program.\n\nAll piping, hoses, valves and emergency shut down values, back check values, as well as excess flow valves have met the provision of \"Safety Requirements for the Storage and Handling of Anhydrous Ammonia, K-61.1\", published by the American National Standards Institute, Inc., and the standards of the U.S.Occupational Safety and Health Administration (OSHA), 29 CFR 1910.111, \"Storage and handling of anhydrous ammonia\".\n\n5. The Five-year Accident History\n\nSince the installation of our Anhydrous Ammonia facility, which is more than five years, we have not experienced any accidental release of Anhydrous Ammonia, nor have we experienced any injury, deaths or property damage nor to our knowledge, have resulted in offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n6. The emergency response program.\n\nPender Grain, Inc. has implemented a written emergency response program in accordance with OSHA standards 29 CFR 1910.38, provided state and local authorities the emergency planning and community right-to know information as required under SARA Title III (EPCRA), as well as our Local fire and sheriff departments. Also a written emergency response program, in accordance with OSHA standard, 29 CRF 1910.120, including pre-emergency planning and employee training. We will constantly implement any improvements or safety equipment necessary to protect the environment, our neighbors and our employees.\n\n7"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19581,
      "SummaryText": ". Planned changes to improve safety.\n\nThe Installation of the \"Cable Operated Emergency Shut Down Value\" and \"Break Away Couplers\" on the fill hoses will drastically reduce the amount of an accidental release from thousands of pounds to a mere pound or two of Anhydrous Ammonia. These devices are currently installed on our Anhydrous ammonia Storage Tanks. Safety improvement is an on-going process at the facility. Periodic evaluations are performed to assess the maintenance of safe conditions. There are no additional specific anhydrous ammonia safety recommendations for implementation at this time."
    }
  ]
}