{
  "FacilityID": 19716,
  "FacilityName": "Prillaman Chemical Corporation - Startex, SC",
  "FacilityStr1": "#2 Tucapau Road",
  "FacilityStr2": null,
  "FacilityCity": "Startex",
  "FacilityState": "SC",
  "FacilityZipCode": "29377",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45083",
  "LEPC": "Spartanburg County LEPC",
  "FacilityLatDecDegs": "34.944944",
  "FacilityLongDecDegs": "-82.098417",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.elliseverard.com",
  "FacilityEmailAddress": "gkelley@elliseverard.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Prillaman Chemical Corporation - Martinsville, VA",
  "Company2Name": "Ellis & Everard Us Holdings, Inc.",
  "CompanyDUNS": 23801202,
  "Company2DUNS": 187240676,
  "OperatorName": "Prillaman Chemical Corporation",
  "OperatorStr1": "P.O. Box 727",
  "OperatorStr2": null,
  "OperatorCity": "Lyman",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29365",
  "OperatorZipCodeExt": null,
  "RMPContact": "Greg Kelley",
  "RMPTitle": "Director of Operations",
  "FTE": 12,
  "OtherEPAFacilityID": "SCD987584786",
  "EPAFacilityID": "100000038345",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-10-07 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-01-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-01-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-01-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2001-11-02 00:00:00",
  "DeRegistrationEffectiveDate": "2001-10-29 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.94494,
  "FRS_Long": -82.09842,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 27661,
      "AltID": "Storage",
      "FacilityID": 19716,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 28365,
          "ProcessID": 27661,
          "NAICSCode": "42269",
          "_desc": {
            "NAICS_CODE": "42269",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 36032,
          "ProcessID": 27661,
          "ChemicalID": 55,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 536032,
          "ProcessID": 27661,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19716,
      "SummaryText": "Policy Statement:\nPrillaman Chemical Corporation, a wholly owned subsidiary of Ellis and Everard, was originally founded in 1939.  Prillaman Chemical is an industrial chemical distributor that provides products in support of industries, ranging from food and water treatment to textiles and furniture.  Activities include warehousing, packaging, bulk transfer and formulation of many common industrial chemicals.  We serve Virginia, North Carolina, South Carolina and Tennessee.\n\nWe are members of the National Association of Chemical Distributors (NACD) and as members, we pledge to manage our business according to the principles of the NACD's Responsible Distribution Process.  This process provides a system that promotes continuous improvement in the health, safety and environmental performance of our company and is designed to be sensitive and responsive to community needs and public concerns.  In addition, Prillaman Chemical has a Quality Improvement process that makes safety and environmental concerns an on-going priority.\n\nWe as team members of Prillaman Chemical and as members of our communities are committed to the safe handling of the products that we distribute as well as the safe operation of our facilities, but we also recognize that emergencies relating to those activities can occur.  It is our policy to ensure that emergency response units and and the public will have adequate information to allow them to react properly to emergencies, which could result from our activities.  Accordingly, we have written procedures and plans, which we will utilize to minimize the effects of such events.\n\nFacility Information:\nThe Prillaman Chemical Corporation, Startex facility, is located approximatel eight miles south of downtown Spartanbug.  The facility occupies a two acre site that consists of a combined warehouse and office building and a concteted tank farm and drumming area.  The Startex facility is an in transit storage location for the materials regulated under the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19716,
      "SummaryText": "EPA's Risk Management Program (RMP), 40 CFR Part 68.\n\nThis site has safely stored for over five years the EPA's RMP regulated material of 55 gallon drums of Hydrofluoric Acid 70%.  \n\nRelease Senarios:\nThe release senario was modeled utilizing the EPA's RMP Comp version 1.06.  The worst case senario for \nHydrofluoric Acid 70% was run and the results were 500 pounds of a liquid being released at a rate of 0.3 pounds per minute for one thousand six hundred and sixty seven minutes.  This senario assumed a wind speed of 1.5 meters per second with an \"F\" atmospheric stability class in an urban area.  This senario could affect an area up to three tenths (0.30) of a mile surrounding the facility.  Within that radius the public receptors are residences, there are no schools, hospitals, recreational areas, major commercial, office, or industrial, prison/correctional facilities or environmental receptors within the distance to the endpoint.\n\nThe alternate release senario also modeled utilizing the EPA's RMP Comp version 1.06.  The results were Hydrofluoric Acid 70% being released at a rate of 0.1 pounds per minute for five thousand minutes.  This senario assumed a wind speed of 1.5 meters per second with an \"F\" atmospheric stability class in an urban area.  This senario could affect an area up to one tenth (0.10) of a mile surrounding the facility.   Within that radius the public receptors are residences, there are no schools, hospitals, recreational areas, major commercial, office, or industrial, prison/correctional facilities or environmental receptors within the distance to the endpoint.  \n\nRelease Prevention Programs:\nThe Prillaman Chemical, Startex facility, stores and distributes the RMP regulated material Hydrofluoric Acid 70%, the material is not consumed on site.  The containers of Hydofluoric Acid 70% are stored and handled in accordance with our standard operating procedures.  All of our personnel are throughly trained, tested and observed to ensure compliace with a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19716,
      "SummaryText": "ll procedures, as well as, all of our other safety programs and requirements.\n\nFive-year Accident History:\nThere has been no releases from the material regulated by the EPA's RMP 40 CFR Part 68 that has resulted in on-site deaths, injuries, significate property damage or off-site deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\n\nEmergency Response Program:\nThe Prillaman Chemical, Startex facility, has a very comprehensive emergency response plan for on-site as well as off-site technical assistance and hazardous materials response.  All on-site personnel receive annual training for handling, storage, transportation and emergency procedures.  We also have employee's that receive specialized training and are equiped to meet OSHA's CFR 1910.120 regulation for hazardous materials response.  The facilities emergency response plan is reviewed, tested and updated annually and employee's are trained on any resulting changes.  The plan is also distributed to the Spartanburg County LEPC and emergency response agency. \n\nSafety Improvements:\nPrillaman Chemical Corpoation is constantly searching for improvements in all areas of safety training and environmental protection and procedural improvement.  We continnually evaluate new training programs and methods, as well as the latest industry technology for environmental protection.  We frequently review all of our standard operating procedures in an effort to ensure continuous improvment.  We are dedicated in our resolve to protect our employee's and our community."
    }
  ]
}