{
  "FacilityID": 19729,
  "FacilityName": "Bush River Wastewater Treatment Plant",
  "FacilityStr1": "5982 Highway 34 and Highway 21",
  "FacilityStr2": null,
  "FacilityCity": "Newberry",
  "FacilityState": "SC",
  "FacilityZipCode": "29108",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45071",
  "LEPC": null,
  "FacilityLatDecDegs": "34.241833",
  "FacilityLongDecDegs": "-81.645778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Newberry",
  "OperatorStr1": "P.O. Box 538",
  "OperatorStr2": null,
  "OperatorCity": "Newberry",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29108",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mr. Tim Cogdell",
  "RMPTitle": "Wastewater Plant Superintendent",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000153166",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-07-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-01-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-01-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-01-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-07-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.24183,
  "FRS_Long": -81.64578,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 27675,
      "AltID": "Wastewater Treatment",
      "FacilityID": 19729,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 28379,
          "ProcessID": 27675,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 36053,
          "ProcessID": 27675,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 536053,
          "ProcessID": 27675,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19729,
      "SummaryText": "EXECUTIVE SUMMARY\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe Bush River Wastewater Treatment Plant located at 5982 Hwy 34 and Hwy 121 in Newberry, South Carolina, provides preliminary and secondary treatment of wastewater prior to the disinfection of the final effluent before being discharged to the Bush River.  The RMP regulations cover the chlorination process at this facility.  The chlorination system provides destruction of pathogenic microorganisms in the wastewater effluent.\n\nIt is the Bush River Wastewater Treatment Plant's policy to adhere to all applicable federal and state rules and regulations.  Safety depends on the manner in which we handle chlorine, the safety devices inherent in the design of this facility, the safe handling procedures that we use, and the training of our personnel. \n\nThe Stationary Source and Regulated Substances Handled\n\nAn evaluation of the chemical usage, accident history, and worst-case release scenario at the Bush River Wastewater Treatment Plant indicates that Program 3 requirements of the Risk Management Program (RMP) apply to this plant.  The Bush River Wastewater Treatment Plant has the potential to maintain up to 6,000 pounds of chlorine, CAS Number 7782-50-5, at the plant at one time.  This is in excess of the threshold value for RMP applicability.  The threshold value for chlorine is 2,000 pounds.  The Bush River Wastewater Treatment Plant maintains no other regulated substances above the threshold value for RMP applicability.\n\nThe Worst-Case Release Scenario and the Alternative Release Scenario, Including Administrative Controls and Mitigation Measures to Limit the Distances for Each Reported Scenario\n\nWorst-Case Scenario -  The worst-case release scenario would be the loss of the entire contents of a 1-ton cylinder of chlorine over a period of 10 minutes.  A total of 1,650 pounds of chlorine is assumed to be released into the atmosphere.  The distance to the end point for worst case scenario is "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19729,
      "SummaryText": "2.8 miles.  However, this scenario is highly unlikely and is reported here only as required by provisions of the RMP regulations.  A much more realistic scenario is presented as the alternative release scenario.\n\nAlternative Release Scenario -  The alternative release scenario is based on a vapor release of chlorine as a result of shearing off a valve at the top of the tank.  A total of 1,650 pounds of chlorine is assumed to be released into the atmosphere, but over 11 minutes.  The distance to the end point for the alternative release scenario is only 1.6 miles.\n\nThe General Accidental Release Prevention Program and Specific Prevention Steps\n\nThe Bush River Wastewater Treatment Plant has in place a prevention program encompassing elements consistent with the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard for Highly Hazardous Chemicals (29 CFR 1910.119).  Chlorine is also regulated under the U.S. EPA Clean Air Act 112(r)(7) Accidental Release Prevention Requirements, Risk Management Programs (RMP) (40 CFR Part 68).\n\nThe Wastewater Treatment Facility, which is covered under the PSM and RMP standards, has implemented the following:\n\n1.  Process Hazard Analysis (PHA) is conducted to identify and analyze the potential hazards associated with the processing or handling of highly hazardous chemicals.\n\n2.  Operating procedures that describe tasks to be performed, operating conditions to be maintained, data to be recorded, and safety precautions to be taken, have been prepared.\n\n3.   For new processes, a pre-startup review is conducted to ensure a safe transition into the normal operating mode.\n\n4.  A mechanical integrity program is in place to ensure the integrity of process equipment.  It mandates that all maintenance personnel are trained and that the equipment is tested and inspected as recommended.\n\n5.  A hot work permit system is in place to manage all hot work operations conducted on or near a covered process.\n\n6.  To pr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19729,
      "SummaryText": "operly manage changes involving processes, chemicals, technology, equipment or facilities, a management of change system has been implemented.\n\n7.  An emergency response program is in place for the entire facility in the event of a chemical release.\n\n8.  A comprehensive Process Safety Information program, has been implemented to ensure complete and accurate written information concerning process chemicals, process technology, and process equipment.  This information is included in the employee training programs. \n\n9.  The Wastewater Treatment Plant has established employee training programs to ensure that all employees, including maintenance and contractor employees involved with chemicals, fully understand the potential hazards of each chemical.  \n\n10.  Contractors are thoroughly evaluated to ensure that they have the appropriate job skills, knowledge, and certifications to perform the job safely.\n\n11.  An Employee Participation policy has been implemented to regularly consult with employees regarding the development and implementation of PSM/RMP elements and hazard assessments.\n\n12.  Compliance audits are performed to review all relevant documentation, verify process safety information, inspect the physical facilities and conduct interviews with representative plant personnel.\n\nFive Year Accident History\n\nDuring the past five years the Bush River Wastewater Treatment Plant has had no chemical releases which created an emergency situation outside the plant boundaries nor resulted in any deaths, injuries, or significant property damage onsite or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\nThe Emergency Response Program\n\nThe Bush River Wastewater Treatment Plant has \"Emergency Procedures\" in place to inform the employee how to communicate with local agencies and how to respond to an accidental release.  Plant personnel are trained in emergency procedures and emergency notifications.  Trained personnel r"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 19729,
      "SummaryText": "espond to emergencies in their area with the local fire department as a back-up.  We have discussed this program with the county Local Emergency Planning Committee (LEPC) and the City fire department to ensure good communication and operational effectiveness.\n\nPlanned Changes to Improve Safety\n\nThe Bush River Wastewater Treatment Plant plans to continue to evaluate the regulated process as required under the PSM/RMP standards to ensure safe operations."
    }
  ]
}