{
  "FacilityID": 19738,
  "FacilityName": "Cumberland Utility District Water Treatment Plant",
  "FacilityStr1": "136 Jacksonian Drive",
  "FacilityStr2": null,
  "FacilityCity": "Hermitage",
  "FacilityState": "TN",
  "FacilityZipCode": "37076",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47037",
  "LEPC": null,
  "FacilityLatDecDegs": "36.206806",
  "FacilityLongDecDegs": "-86.637833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 65839656,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "First Suburban Utility",
  "OperatorStr1": "6020 Panama Drive",
  "OperatorStr2": null,
  "OperatorCity": "Hermitage",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37076",
  "OperatorZipCodeExt": null,
  "RMPContact": "Doug Summers",
  "RMPTitle": "Plant Manager",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000088068",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-01-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-12-22 00:00:00",
  "DeRegistrationEffectiveDate": "2004-10-15 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 36.20675,
  "FRS_Long": -86.63828,
  "FRS_Description": null,
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 27688,
      "AltID": null,
      "FacilityID": 19738,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 28392,
          "ProcessID": 27688,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 36070,
          "ProcessID": 27688,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 536070,
          "ProcessID": 27688,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19738,
      "SummaryText": "EXECUTIVE SUMMARY\n\n    The Cumberland Utility District Water Treatment Plant is located in Davidson County at 136 Jacksonian Drive, Hermitage, Tennessee 37076.  The Cumberland Utility District Water Treatment Plant treats water from the Cumberland River for distribution to the public as potable water.  The Cumberland Utility District Water Treatment Plant adds chlorine to the water as an oxidizing agent and a disinfectant.  As an oxidizing agent it is used for taste and odor control and color removal.  Chlorine is stored in the Chlorine Room in ton containers, each with a capacity of 2,000 pounds of chlorine.  The chlorine exists in the ton containers both as a gas and as a pressurized liquid.  Chlorine gas is withdrawn from the ton containers and mixed with a stream of potable water by the chlorinators, which are also located in the Chlorine Room.  The chlorine/water solution is then piped to the application points, which include the raw river water entering the treatment plant and the treated water exiting the treatment plant for distribution to the public. \n\n    Chorine is on the list of regulated toxic substances located in Part 68 of Title 40 of the Code of Federal Regulations (40 CFR 68).  Also, the Cumberland Utility District Water Treatment Plant stores up to 12,000 pounds of chlorine on-site, which is more than the threshold quantity of chlorine in 40 CFR 68 of 2,500 pounds.  Therefore, the Cumberland Utility District Water Treatment Plant has implemented a Risk Management Program for the chlorine process.  The objective of the Risk Management Program is to identify the hazards that may result from accidental releases of chlorine, to ensure that the facility is designed and operated in a safe manner to prevent accidental releases of chlorine, and to minimize the consequences of any accidental releases which do occur.  The Risk Management Program has been implemented in accordance with the regulations located in 40 CFR 68.  \n\nHAZARD ASSESSMENT\n\nWorst-Case Release "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19738,
      "SummaryText": "Scenario\n\n    The Cumberland Utility District Water Treatment Plant has evaluated a worst-case release scenario in accordance with the requirements of 40 CFR 68.  The largest single storage vessel for chlorine at the Cumberland Utility District Water Treatment Plant is 2,000 gallons.  For the worst-case release scenario, it is assumed that the maximum single storage capacity of 2,000 gallons of chlorine is released.  The chlorine is assumed to be released over a 10-minute time period.  The distance to the endpoint of the impact area for this release is estimated to be 1.3 miles.  The population within the worst-case release scenario impact area is estimated to be 3,575 persons.  Additionally, it is noted that schools, residences, recreational areas, commercial areas, office buildings, and industrial areas are located within the impact area.  There are no environmental receptors located within the impact area.  \n\n\n\nAlternative Release Scenario\n\n    The Cumberland Utility District Water Treatment Plant has also evaluated an alternative release scenario in accordance with the requirements of 40 CFR 68.  The alternative release scenario selected is a gas valve (5/16 inches) left open on a ton container.  The alternative release scenario is more likely to occur than the worst-case release scenario.  However, written operating procedures are in place for the safe operation of the ton containers, and the probability of this type of release is still very low.  An employee is assumed to detect the release and stop the release (by closing the valve) in one hour.  The release rate to the Chlorine Room is estimated to be 15 pounds per minute.  This would result in total quantity of 900 pounds of chlorine released.  Since the chlorine gas is released inside the Chlorine Room and the building should have a mitigating effect on the release rate, it is assumed that the release rate to the atmosphere will be less than 15 pounds per minute.  It has been assumed that the release rate to the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19738,
      "SummaryText": " atmosphere will be 55 percent of the release rate inside the building.  This results in a release rate to the atmosphere of 8.25 pounds per minute.  The distance to the toxic endpoint is estimated to be 0.1 miles.  The population within the alternative release scenario impact area is estimated to be 18 persons.  It is also noted that residences and recreational areas are located within the impact area.  There are no environmental receptors located within the impact area.\n\nFive-Year Accident History\n\nThroughout the life of the chlorine process at the Cumberland Utility District Water Treatment Plant, there have been no accidental releases of chlorine that resulted in on-site deaths, injuries, or significant property damage.  Also, there have been no accidental releases of chlorine at the facility that have resulted in off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage. \n\nPREVENTION PROGRAM\n\n    The Cumberland Utility District Water Treatment Plant has implemented a prevention program in accordance with 40 CFR 68 and the Occupational Safety and Health Administration's (OSHA's) Process Safety Management Standard located in 29 CFR 1910.119.  The Cumberland Utility District Water Treatment Plant has completed the following tasks for the prevention program:\n\n( Compilation of process safety information including information pertaining to the hazards associated with chlorine, information pertaining to the technology of the chlorine process, and information pertaining to the equipment in the chlorine process;\n( Completion of a process hazard analysis to identify, evaluate, and control the hazards associated with the chlorine process;\n( Development and implementation of written operating procedures for the safe operation of the chlorine process;\n( Development and implementation of written training procedures to ensure that employees adhere to the written operating procedures;\n( Development and implementation of a mechanical int"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 19738,
      "SummaryText": "egrity program to ensure that process equipment is maintained in proper working condition;\n( Development and implementation of written procedures to safely manage changes to the chlorine process and to ensure that the appropriate steps have been taken prior to the startup of any new processes involving hazardous substances;\n( Development and implementation of written procedures to investigate incidents associated with the chlorine process and to take the appropriate corrective actions;\n( Development and implementation of safe work practices such as restricting access to the chlorine process, issuance of hot work permits, and utilization of lockout/tagout procedures.\n( Development and implementation of procedures to select the appropriate contractors to perform work on or near the chlorine process and to monitor and evaluate the safe work habits of hired contractors;\n( Development and implementation of procedures to involve employees in the development and conduct of the prevention program; and\n( Development and implementation of procedures for the periodic evaluation of the prevention program to ensure its adequacy and compliance with the regulations.\n\nThe chlorine system at the Cumberland Utility District Water Treatment Plant is designed and operated in accordance with applicable Federal and state regulations and the information and requirements published by the following organizations:\n\n( The Chlorine Institute, Inc.;\n( Compressed Gas Association, Inc.;\n( American Society of Mechanical Engineers (ASME); and\n( National Electric Code.\n\nEMERGENCY RESPONSE\n\n    The Cumberland Utility District Water Treatment Plant has developed and implemented an Emergency Response Plan for the purpose of protecting its employees, public health, and the environment.  The Emergency Response Plan describes the emergency response procedures to be followed during various potential emergency situations, including specific procedures for responses to releases of chlorine.  The Cumberland Util"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 19738,
      "SummaryText": "ity District Water Treatment Plant has coordinated its Emergency Response Plan with the Nashville Metro Fire Department and the Davidson County Local Emergency Planning Committee (LEPC) to ensure that emergency responders and the public are aware of the potential hazards associated with the chlorine process.\n\nCHANGES TO IMPROVE SAFETY\n\n    Although no significant accidental releases of chlorine have occurred at the facility, it is the policy of the Cumberland Utility District Water Treatment Plant to continue to look for opportunities to improve on the safe handling and use of chlorine to minimize the risk to its employees and the community.  Implementation of a Risk Management Program (in accordance with 40 CFR 68) and a Process Safety Management Program (in accordance with 29 CFR 1910.119) are two steps that the Cumberland Utility District Water Treatment Plant have taken to ensure safe operation of the chlorine process."
    }
  ]
}