{
  "FacilityID": 19748,
  "FacilityName": "Taft Acrolein Packaging Plant",
  "FacilityStr1": "19815 South Lake Road",
  "FacilityStr2": null,
  "FacilityCity": "Taft",
  "FacilityState": "CA",
  "FacilityZipCode": "93268",
  "Facility4DigitZipExt": "1192",
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.123611",
  "FacilityLongDecDegs": "-119.356944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.bakerhughes.com/bapt",
  "FacilityEmailAddress": "Ralphgonzales@BakerPetrolite.com",
  "FacilityDUNS": 617641055,
  "ParentCompanyName": "Baker Hughes, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 174987909,
  "Company2DUNS": 0,
  "OperatorName": "Baker Petrolite Corporation",
  "OperatorStr1": "P.O.Box 11192",
  "OperatorStr2": null,
  "OperatorCity": "Bakerfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93389",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ralph S. Gonzales",
  "RMPTitle": "Plant Operation Manager",
  "FTE": 7,
  "OtherEPAFacilityID": "CAD98116778",
  "EPAFacilityID": "100000099298",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-05-01 00:00:00",
  "SafetyInspectionBy": "Kern County Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-01-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 35.13664,
  "FRS_Long": -119.44851,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 27698,
      "AltID": "Acrolein",
      "FacilityID": 19748,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 28403,
          "ProcessID": 27698,
          "NAICSCode": "32532",
          "_desc": {
            "NAICS_CODE": "32532",
            "NAICS_DESCRIPTION": "Pesticide and Other Agricultural Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 36080,
          "ProcessID": 27698,
          "ChemicalID": 22,
          "Quantity": 183000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 22,
            "ChemicalName": "Acrolein  [2-Propenal]",
            "CASNumber": "107-02-8",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 536080,
          "ProcessID": 27698,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19748,
      "SummaryText": "EXECUTIVE SUMMARY\n\n1. Accidental Release Prevention and Emergency Response Facilities\n\nWe at Baker Petrolite Corporation Taft Acrolein Packaging Plant are strongly committed to employee, public, and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances. If such a release does occur, our highly trained emergency response personnel are at hand to control and mitigate the effects of the release.\n\n2. The Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities encompass transfer of Acrolein, a chemical used in oilfield and agricultural applications from bulk containers into transfer and shipping/dispenser containers, with attendant rework and service of the containers.\n\nThe regulated substance is used as a pesticide and algaecide. \n\n3. The Worst Case Release Scenarios and the Alternative Release Scenarios, including administrative controls and mitigation measures to limit the distances for each reported scenario\n\nTo evaluate the worst case scenario, we have used the look-up tables and equations provided by the EPA in the Risk Management Program Guidance for Offsite Consequence Analysis. The Alternative Release Scenario was prepared based on the Safer System Trace Model.  Both of the scenarios used urban site topography.\n\nThe worst case scenario submitted for toxic substances as a class involves a catastrophic release of Acrolein.  The scenario involves the release of 35,000 pounds of Acrolein in a liquid spill/vapor release form over 10 minutes.  Passive mitigation controls such as dikes were not used, as this feature would be ineffective for the gas release.  At Class \"F\" atmospheric stability and 1.5 meters/sec windspeed, the distance to the toxic endpoint of 0.011 m"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19748,
      "SummaryText": "g/l is 25 miles according to Reference Table 7 of the OCA Guidance Document.\n\nOne alternative release scenario will be submitted for Acrolein.\n\nThe alternative release scenario for Acrolein involves a release from a skid unprotected by a deluge system arising from puncture of the skid by the blade of a forklift.  This scenario involves the release of 2,450 pounds at the rate of 40.8 pounds per minute over a time period of 60 minutes.  (The Maximum Net Weight of a skid's contents is 2450 pounds, but allowance is made for flucuation in actual contents, polymerization of contents upon release to an ambient atmosphere,etc.) Passive mitigation controls such as dikes were not used as such controls would not apply to a gas release.  At\" D\"atmospheric stability and 3.0 meters / Sec. windspeed, the projected distance to the toxic endpoint of 0.011 mg/l is 6.3 miles.  This assessment was based on a model developed using Safer System Trace Model.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n4.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA as well as the requirements of Ca. Code of Regulations , Title 19, Public Safety, Div. 2, Off. Of Emerg. Ser., Chapter 4.5 Ca. Accidental Release Prevention (CalARP) Program. A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119.  Our facility is also subject to EPCRA Section 302 notification requirements.  The following sections briefly describe the elements of the release  prevention program that is in place at our stationary source.\n\n\n\n\nProcess Safety Information - Baker Petrolite Corporation maintains a detailed record of safety information that describes chemical hazards, operating parameters, and equipment designs associated with all processes.\n\nProcess Hazard Analyses - Our facility conducts comprehensive studies to ensure that "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19748,
      "SummaryText": "hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is the HAZOP method.  The studies are undertaken by a team of qualified personnel with expertise in engineering, plant operations, and/or maintenance.  Employees get to make suggestions to improve the safety and environmental operation of their work environment.  The analyses are reviewed and revalidated at least every five years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures - For the purposes of safely conducting activities within our covered processes, Baker Petrolite Corporation maintains written operating procedures.  These procedures address normal operations, including startup, shutdown, and emergency operations.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining - Baker Petrolite Corporation has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. \n\nMechanical Integrity - Baker Petrolite Corporation carries out well documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps.  Baker Petrolite Corporation also participates in a quarterly leak detection and repair program.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are provided specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change - Written procedures are in place at Baker Petrolite Corporation to manage changes in process chemicals, technology, equipment,"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 19748,
      "SummaryText": " and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and provided training to deal with the modification.\n\n\n\n\n\n\n\n\nPre-startup Safety Reviews - Pre-startup safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Baker Petrolite Corporation sites.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.  There have been no significant changes to our operating processes such as addition of new technologies, increased transfer equipment or other increases in capacity or changes in methodology since 1985 since our activity\nconsists of transferring Acrolein from bulk containers to shipping or use containers.\n\nCompliance Audits - Baker Petrolite Corporation conducts internal audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits of RMP covered processes are conducted at least every three years and any corrective actions required as a result of the audits are initiated in a safe and prompt manner.\n\nIncident Investigation - Baker Petrolite Corporation promptly investigates any incident that has resulted in, or could have reasonably resulted in, a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation - Baker Petrolite Corporation truly believes that process safety management and accident prevention requires a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, o"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 19748,
      "SummaryText": "ur employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses.\n\nContractors - On occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Baker Petrolite Corporation has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are  informed of all the procedures for emergency response should an accidental release of a regulated substance occur . Concurrently, contractors are required to provide full information including MSDS for any hazardous chemicals, processes or procedures they use to which our employees may be exposed\n\nIn addition to the activities outlined above, we recognize the hazard to operations represented to many operations in California by earthquakes by conducting daily and monthly documented structural integrity inspections of equipment used in Acrolien storage and transfer as well as all other piping systems on site.  In addition, an independent contractor, Furmanite F.E.I.P. conducts quarterly documented inspections of all site piping, couplings, and valves.  Handling and transfer of acrolein is conducted externally.  All piping and transfer systems were constructed in compliance state and federal codes and are so maintained.  The facility was constructed in 1985 in compliance with the Uniform Building Code for Kern County.  All related permits and inspection documentation is on file with the Kern County Building Permitting Dept.\n\n5.    Five-year Accident History\nBaker Petrolite Corporation Taft Acrolein Packaging Plant has had an excellent record of preventing accidental releases over the last five years.  Due to our stringent release prevention policies, there have been no accidental releases of the RMP"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 19748,
      "SummaryText": " regulated substance over this period which resulted in a recordable injury to persons, or damage to property or the environment.\n\n\n\n\n\n\n\n\n\n\n\n\n\n6.   Emergency Response Plan\n\nBaker Petrolite Corporation Taft Acrolein Packaging Plant maintains a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n7.   Planned Changes to Improve Safety\n\nAs a result of loss control audits conducted by our site personnel in conjunction with the Safety & Health Manager for our site and the Baker Petrolite Corporation Environmental, Safety & Health / Quality Assurance & Regulatory Affairs Department, we have enhanced the engineered safety controls for our railcar/bulk container unloading stations ( 1998 - 1999 ) and are in the process of reviewing the engineering requirements of a deluge system for the acrolien skid transfer area ( as of May 1999 ).\nThe effect of installing such a system would be to reduce the endpoint for the alternative release system from 6.3 miles to .66 miles.  Excess flow prevention controls are scheduled to be installed on each of the two unloading platforms on/or before 12/31/99.\n."
    }
  ]
}