{
  "FacilityID": 19760,
  "FacilityName": "The Vons Companies, Meat Service Center",
  "FacilityStr1": "4300 Shirley Avenue",
  "FacilityStr2": null,
  "FacilityCity": "El Monte",
  "FacilityState": "CA",
  "FacilityZipCode": "91731",
  "Facility4DigitZipExt": "1128",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.085111",
  "FacilityLongDecDegs": "-118.049306",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Safeway Corporation",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Errol Briggerman",
  "OperatorStr1": "12801 Excelfior Drive",
  "OperatorStr2": null,
  "OperatorCity": "SantaFa Springs",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90670",
  "OperatorZipCodeExt": null,
  "FTE": 165,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000110248",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-06 00:00:00",
  "SafetyInspectionBy": "L.A. County Fire Dept.",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-01-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2018-05-08 00:00:00",
  "DeRegistrationEffectiveDate": "2017-12-01 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.4",
  "FRS_Lat": 34.085325,
  "FRS_Long": -118.049402,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 27710,
      "AltID": "Meat Service Center",
      "FacilityID": 19760,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 36093,
          "ProcessID": 27710,
          "ChemicalID": 56,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 28415,
          "ProcessID": 27710,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 15154,
              "Process_NAICS_ID": 28415,
              "SafetyReviewDate": "1999-05-12 00:00:00",
              "PHA_Date": "1999-05-12 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Equipment removed",
              "OpProceduresReviewDate": "1999-05-12 00:00:00",
              "TrainingReviewDate": "1999-05-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-12 00:00:00",
              "EquipmentInspectionDate": "1999-06-11 00:00:00",
              "EquipmentTested": "700 HP Screw Compressors at MSC Compressor Room",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-05-12 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-12 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-12 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-05-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 21988,
                  "PreventionProgram3ID": 15154,
                  "ProcessChemicalID": 36093
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 27711,
      "AltID": "Deli Kitchen & By-Product",
      "FacilityID": 19760,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 36094,
          "ProcessID": 27711,
          "ChemicalID": 56,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 28416,
          "ProcessID": 27711,
          "NAICSCode": "49312",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 19760,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-12 00:00:00",
    "ERTrainingDate": "1999-06-09 00:00:00",
    "CoordinatingAgencyName": "L.A. County Fire Dept. Station 42",
    "CoordinatingAgencyPhone": "6262862417",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 19760,
      "SummaryText": "distance to 200 ppm was determined using Exhibit 4-5 from the EPA Risk Management Program Guidance for Ammonia Refrigeration, November 1998.  The release reaches off-site and may affect population receptors.  No environmental receptors are affected by this potential scenario.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe facility operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines and standards including the following:\n\n\u0015 IIAR Bulletin 107, Suggested Safety and Operating Procedures When Making Ammonia Refrigeration Tie-ins\n\u0015 IIAR Bulletin 109, Minimum Safety Criteria for a Safe Ammonia Refrigeration System\n\u0015 IIAR Bulletin 110, Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems\n\u0015 IIAR Publication R-1, A Guide to Good Practices for the Operation of an Ammonia Refrigeration System\n\nIn addition, Vons has implemented a Process Safety Management program for compliance with the Cal-OSHA 5189 regulation since June 1995.\n\nFIVE YEAR ACCIDENT HISTORY\n\nBetween June 1994 and June 1999, there have been no releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds. In addition, there have been no injuries resulting from an ammonia release.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe Vons facility has two Emergency Response Teams to respond to potential ammonia alarms or releases.  Race Engineering Refrigeration Co. has an Emergency Response Team which works in conjunction with the Emergency Response Team at Vons.  The in-house Vons Team, comprised of operators,  has completed the OSHA 24 Hour Technician Level Training program and participates in 8 hour annual refresher training classes.  In addition, the Team dons the emergency response equipment once   per year.\n\nThe Vons facility has several locations which are occupied by personnel during operational hours.  If an ammonia release occurred, some or all of these employees may need to be evacuated.  Additiona"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19760,
      "SummaryText": "ompressors is transferred through an oil separator, to dissociate the oil build-up in the compressed vapor, and then sent to two condensers.  The high pressure vapor is condensed and transferred back to the receiver.  \n\nThe facility uses approximately 16,000 pounds of ammonia as a refrigerant within a closed system for the MS and approximately 4000 pounds of ammonia in the DK/BP.  \n\nAmmonia is used as the refrigerant in the refrigeration process.\n\nThe total ammonia inventory is 20,000 pounds.  \n\n\nHAZARD ASSESSMENT SUMMARY\n\nWorst Case Release Result Summary\n\nThe worst case release for this facility was that of the maximum quantity of ammonia that can be stored in a vessel.  The largest vessel is the high pressure receiver which is located inside the engine room.  This vessel can hold the entire system charge of 16,000 pounds of ammonia.  This quantity was released in 10 minutes.  This vessel is located inside a building; therefore, the enclosure was used as a passive mitigation measure. The most pessimistic meteorological conditions were used: 1.5 meters/second wind speed, and F stability.  The facility is located in an urban setting.  The downwind distance to 200 ppm was determined using Exhibit 4-4 from the EPA Risk Management Program Guidance for Ammonia Refrigeration, November 1998.  The release reaches off-site and may affect population receptors.  No environmental receptors are affected by this potential scenario.\n\nAlternative Release Result Summary\n\nThe alternative release scenario was that of a 0.25 inch diameter leak of high pressure gas ammonia for one hour.  This scenario was chosen because the facility has high pressure gas lines external to the facility and a 0.25 inch leak could be caused by a flange seal leak or a valve packing leak.  The quantity of ammonia released in one hour at this rate is 7,560 pounds.  The meteorological conditions used were 3 meters/second wind speed, and D stability. The facility is located in an urban setting.  The downwind"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 19760,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Vons facility  abides by the emergency response procedures and policies detailed in the Vons Emergency Response Plan manual.  This Plan was designed to meet the following objectives:\n\n1.) To save lives.\n2.) To minimize and avoid injuries.\n3.) To protect the environment.\n4.) To minimize property damage.\n\nVons maintains an emergency response committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate any facility changes. \n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Vons Meat Service Center facility uses ammonia to provide refrigeration for several refrigerated warehouses.  There are two ammonia systems that operate independently and are located in separate buildings on the property; Meat Service Process (MS) and Deli Kitchen/By-Products (DK/BP). Each area has several evaporators used to keep various rooms cold.  Liquid ammonia is transferred from a high pressure receiver to a low pressure accumulator where the pressure (temperature) of the ammonia is reduced.  (Low pressure is achieved in the accumulators by allowing the high pressure liquid from the receiver to expand through an expansion valve.)  The resulting low pressure liquid is pumped to several evaporating units, to provide cooling capabilities for the refrigerated warehouses.  The liquid/vapor return from the evaporators is recycled back to the low pressure accumulator.  Compressors remove the refrigerant vapor from the accumulator and compress it to high pressure vapor.  Compressed vapor from the c"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 19760,
      "SummaryText": "conditions and wind direction are not as vital as they are for an ammonia release, but it is necessary to know what equipment is in the fire location which could rupture or break, causing more danger to employees.  With this information the IC will make the evacuation decisions.  The designated assembly areas are the same for all emergencies at Vons. \n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nBelow is a summary of the recommendations resulting from the Process Hazard Analysis Revalidation study performed on May 12, 1999 at the Vons Meat Service Distribution Center.\n\nREV01: Review the IIAR maintenance practices and schedules outlined in the Mechanical Integrity program and adopt where appropriate.  In addition, identify in this section the responsible party for each scheduled procedure (i.e. Race Engineering or Vons).\n\nREV02: Update delivery procedures.\n\nREV03: Review and update all operating procedures. Include an annual certification policy.  Also, identify critical valves and label as appropriate.  \n\nREV04: Review the oil draining procedures included in the existing operating procedures.\n\nREV05: Develop a table that outlines the compressor alarms/indicators and what action should be taken when the alarm/indicator is showing at the compressor panel.  This table should be incorporated into operator refresher training.\n\nREV06: Verify that the compressor oil level is included on the Dairy Round Sheet.  If not, include this item on the Dairy Round Sheet.\n\nREV07: Include this procedure in the PSM Operating Procedures.\n\nREV08: Ensure that recommendations from the initial study are addressed as indicated in Table 2 (R12, R13, R26, R27, R28).\n\nREV09: It is recommended that the piping diagrams for the remaining equipment be examined to ensure a correct and accurate schematic is provided.\n\nThe Warehouse Facilities Manager will be responsible to ensure that all recommendations are completed on or before June 1, 2000."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 19760,
      "SummaryText": "l evacuation instructions  are posted inside each building for employee viewing which show locations of all emergency exits and also indicate where to assemble outside each facility for a roll call.\n\nOne roll call method employed by Vons is to print out the number of personnel in the warehouse from the time-in attendance system, and post the count by the time clock.  The number of non-hourly individuals and the person counting heads are also added to the total number.  The total is then posted at the time clock for removal by a supervisor at the time of a drill or an emergency evacuation.  Supervisors will track employees who leave the facility.\n\nIf an ammonia release occurs, the employees will immediately notify their supervisor.  The supervisor will use the intercom system and/or telephone to inform the other employees and the Incident Commander.  With all of the information provided by the employees and supervisors the Incident Commander will decide which employees need to be evacuated and which employees should stay sheltered within their building.  Also, the Incident Commander will decide which of the designated assembly areas will be the safest to use for the evacuation.  If employee evacuation is necessary in certain locations, the supervisors will be told the designated assembly area over their portable radios or over the intercom system.  An evacuation will require the use of the intercom in that location along with assistance from all nearby supervisors.  The supervisors and intercom will inform the employees of the assembly location chosen.  To insure all employees are familiar with evacuation procedures, evacuation drills are performed twice a year at Vons. \n\nIf there is a fire at the Vons facility, a procedure similar to an ammonia release will be followed.  The employees will inform their supervisor of the emergency and the supervisor will use the intercom system and/or telephone to inform other employees and the Incident Commander.  The meteorological"
    }
  ]
}