{
  "FacilityID": 19896,
  "FacilityName": "Commonwealth Aluminum Lewisport, Inc.",
  "FacilityStr1": "1372 State Road 1957",
  "FacilityStr2": "PO Box 480",
  "FacilityCity": "Lewisport",
  "FacilityState": "KY",
  "FacilityZipCode": "42351",
  "Facility4DigitZipExt": "0480",
  "FacilityCountyFIPS": "21091",
  "LEPC": "Hancock County LEPC",
  "FacilityLatDecDegs": "37.936611",
  "FacilityLongDecDegs": "-86.858861",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "UN",
  "FacilityURL": "www.cacky.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 8286577,
  "ParentCompanyName": "Commonwealth Industries, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 8286577,
  "Company2DUNS": 0,
  "OperatorName": "Commonwealth Industries, Inc.",
  "OperatorStr1": "P.O.Box 480",
  "OperatorStr2": null,
  "OperatorCity": "Louisville",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "42351",
  "OperatorZipCodeExt": "0480",
  "RMPContact": "Damon R. Smith",
  "RMPTitle": "Manager, Environmental",
  "FTE": 1100,
  "OtherEPAFacilityID": "KYD058691031",
  "EPAFacilityID": "100000042606",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "07715800010",
  "SafetyInspectionDate": "1999-01-14 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-02-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 37.94917,
  "FRS_Long": -86.84694,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 27900,
      "AltID": "Chlorine System - Casting",
      "FacilityID": 19896,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 28608,
          "ProcessID": 27900,
          "NAICSCode": "331314",
          "_desc": {
            "NAICS_CODE": "331314",
            "NAICS_DESCRIPTION": "Secondary Smelting and Alloying of Aluminum"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 36400,
          "ProcessID": 27900,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 536400,
          "ProcessID": 27900,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19896,
      "SummaryText": "1.    Accidental Release Prevention and Emergency Response Policies\nCommonwealth Aluminum Lewisport, Incorporated is strongly committed to employee, public and environmental safety.  This commitment is illustrated through the implementation of a comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  Commonwealth Aluminum Lewisport, Inc. is continually establishing and revising corporate policies to implement appropriate controls to prevent possible releases of regulated substances into the surrounding communities and natural environments.  highly trained emergency response personnel are at hand to control and mitigate the effects of the release.  \n\n2.    The Stationary Source and the Regulated Substances Handled\nCommonwealth Aluminum Lewisport, Inc. is classified as a secondary aluminum smelter whose primary activities encompass the melting and refining of scrap aluminum to produce aluminum ingot via direct chill methods; rolling ingots into aluminum rolls/products, and; performing coil coating processes on aluminum rolls.  This facility has one (1) regulated substance, chlorine, present above the specified threshold quantities as stipulated in 40 CFR 68. This regulated substance is utilized in the degassing and refining processes of molten aluminum in the Casting Mutual Recoginition Units (MRU).\n\nThe maximum inventory of Chlorine (four one ton cylinders - 8,000 pounds) that can be affected at Commonwealth Aluminum Lewisport, Inc. resides in a remote location found in the South Casting MRU.\n\n3.    The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\nTo perform the required offsite consequence analysis for our facility, we have used the look-up tables and equations provided by the EPA in the RMP Offs"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19896,
      "SummaryText": "ite Consequence Analysis Guidance.  The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for Program 2 and 3 toxic substances as a class involves a catastrophic release from the South Casting MRU Chlorine Storage and Delivery System.  The scenario involves the release of 8000 pounds of Chlorine in a gaseous form over 10 minutes.  Passive mitigation controls such as enclosures are also taken into account to calculate the scenario.  At Class F atmospheric stability and 1.5 meters per second (m/s) wind speed, the maximum distance of 9.9 miles is obtained corresponding to a toxic endpoint of 0.0087 milligrams per liter (mg/l).\n\nOne alternative release scenario has been submitted for each toxic substance present in Program 2 and Program 3 processes cumulatively.  \n\nThe alternative release scenario for Chlorine involves a release from the Chlorine Storage and Delivery System of the South Cast House.  The scenario involves the release of 450.00 pounds of Chlorine in a gaseous form over a period of thirty minutes.  Passive mitigation controls such as enclosures are taken into account to calculate the scenario.  In addition, the release is assumed to be controlled by an active mitigation measure, which include sprinkler system(s).  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.0087 mg/L of Chlorine is 0.38 miles.\n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nCommonwealth Aluminum Lewisport, Inc. has taken all the necessary steps to comply with the accidental release prevention requirements set forth in 40 CFR part 68, which are also governed under the Occupational Safety and Health Administration (OSHA) Process Safety Management Program (PSMP) as delineated by 29 CFR 1910.119.  Our facility is also subject to the notification requirements of the Emergency Planning and Community Right to Know Act under Section 302.    The following sec"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19896,
      "SummaryText": "tions briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nCommonwealth Aluminum Lewisport, Incorporated maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses include \"what-if,\" \"check-lists,\" and a combination thereof.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of three years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Commonwealth Aluminum Lewisport, Incorporated maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after an outage.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nCommonwealth Aluminum Lewisport, Incorporated has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every two years and more frequently as needed.\n\nMechanical Integrity\nCommonwealth Aluminum Lewisport, Incorporated carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, e"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 19896,
      "SummaryText": "mergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Commonwealth Aluminum Lewisport, Incorporated to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Commonwealth Aluminum Lewisport, Incorporated.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nCommonwealth Aluminum Lewisport, Incorporated conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nCommonwealth Aluminum Lewisport, Incorporated promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nCommonwealth Aluminum Lewisport, Incorporated truly believes that process safety management"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 19896,
      "SummaryText": " and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nContractors, who conduct specialized maintenance and construction activities at the facility, are required to undergo a thorough evaluation of safety performance guidelines as stipulated in the General Contractor Safety Program.  Commonwealth Aluminum Lewisport, Incorporated has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n5.    Five-year Accident History\nCommonwealth Aluminum Lewisport, Incorporated has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no reportable release during this period.\n\n6.    Emergency Response Plan\nCommonwealth Aluminum Lewisport, Incorporated carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within any processes that would require a modified emergency response.\n\n7.    Planned Changes to Improve Safety\nSafety audits and employee interactions are continually observed at Commonwealth Aluminu"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 19896,
      "SummaryText": "m Lewisport, Inc. to provide the safest available working environment achievable.  Based upon the previous upgrades to the pertinent Chlorine Storage and Delivery System (i.e., construction of remote enclosure with automated atmospheric monitoring technologies installed in and around the perimeter), there are currently no safety improvements deemed necessary during the time that this executive summary is prepared."
    }
  ]
}