{
  "FacilityID": 19993,
  "FacilityName": "Apio, Inc",
  "FacilityStr1": "41646 Road 62",
  "FacilityStr2": null,
  "FacilityCity": "Reedley",
  "FacilityState": "CA",
  "FacilityZipCode": "93654",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.552889",
  "FacilityLongDecDegs": "-119.436139",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "C2",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 964905897,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Apio, Inc",
  "OperatorStr1": "41646 Road 62",
  "OperatorStr2": null,
  "OperatorCity": "Reedley",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93654",
  "OperatorZipCodeExt": null,
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000155976",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "GOOD",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-01-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-07-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-07-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-07-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.4",
  "FRS_Lat": 36.54687,
  "FRS_Long": -119.43496,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 28007,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 19993,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 36512,
          "ProcessID": 28007,
          "ChemicalID": 56,
          "Quantity": 26000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 28715,
          "ProcessID": 28007,
          "NAICSCode": "111339",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 15283,
              "Process_NAICS_ID": 28715,
              "SafetyReviewDate": "1999-06-10 00:00:00",
              "PHA_Date": "1995-12-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-10-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-24 00:00:00",
              "TrainingReviewDate": "1999-04-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": "RETA",
              "MaintenanceReviewDate": "1998-03-02 00:00:00",
              "EquipmentInspectionDate": "1999-06-14 00:00:00",
              "EquipmentTested": "Solenoid valves",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1995-12-15 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1995-12-15 00:00:00",
              "HotWorkPermitReviewDate": "1995-12-15 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-09-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 22170,
                  "PreventionProgram3ID": 15283,
                  "ProcessChemicalID": 36512
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 19993,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-10 00:00:00",
    "ERTrainingDate": "1998-08-15 00:00:00",
    "CoordinatingAgencyName": "Fire Department",
    "CoordinatingAgencyPhone": "0000000911",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 19993,
      "SummaryText": ", 1999\n\n\n\nWe understand our obligations to consolidate our safety activities in a Risk Management Program under the CalARP regulation.  We are committed to preparing and implementing a Risk & Process Safety Management Program according to the above milestone and timeline chart."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 19993,
      "SummaryText": "Risk & Process Safety Management Program\n\n\n\nExecutive Summary\n\nfor\n\nApio, Inc.\n41646 Road 62\nReedley, CA 93654-9124\n(559) 591-0632\nFAX (559) 595-7755\nJune 21, 1999\n\n\n\n\n\n\n\n\n\n\nPrepared by:\n\nSolutions Environmental Health & Safety, Inc.\n6687 N Blackstone Avenue, Suite 103\nFresno, California 93710\n(559) 435-4244\nFAX (559) 435-8503\nwww.SEHS-Inc.com\n\n\nTable of Contents For Executive Summary\n\n1.  THE APIO, INC - RISK & PROCESS SAFETY MANAGEMENT PROGRAM   1\n2. DESCRIPTION OF AMMONIA SYSTEM   1\n3. AMMONIA RELEASE SCENARIOS   2\n3.1 WORST CASE SCENARIO   2\n3.2 ALTERNATIVE CASE SCENARIO   2\n4. GENERAL ACCIDENT RELEASE & AMMONIA SPECIFIC PREVENTION STEPS    2\n5. FIVE YEAR ACCIDENT HISTORY   3\n6. EMERGENCY ACTION PLAN   3\n7. PLANNED CHANGES TO IMPROVE SAFETY    3\n\n\n1.   THE APIO, INC. FACILITY RISK & PROCESS SAFETY MANAGEMENT PROGRAM\nThis is to inform all interested persons, including employees Apio, Inc. is preparing a unified Risk & Process Safety Management Program to comply with California's Accidental Release Prevention (CalARP) Program (in California CCR Title 19, Chapter 4.5, Program Level 3 Elements, and Federally Title 40 CFR Part 68) and California OSHA's \"Process Safety Management (PSM) of Acutely Hazardous Materials\" standard (in California CCR Title 8, Section 5189, \"Process Safety Management of Acutely Hazardous Materials\" and Federally Title 29 Code of Federal Regulations (CFR) 1910.119).  This program is being prepared to address the risks involved with the presence of anhydrous ammonia in an amount in excess of 10,000 lbs which is contained in our refrigeration system. \n\nOur program will promote overall plant, worker, and public safety. The program will enable our facility to prevent the occurrence, and minimize the consequences, of significant releases of anhydrous ammonia. Overall, the program is designed to prevent accidental fatalities, injuries and illnesses and avoid physical property damage.\n\nOur company has an exemplary safety record, one that we are quit"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19993,
      "SummaryText": "e proud of  Our program incorporates and brings together several existing safety programs which already set forth rules, procedures and practices which help our employees protect themselves and our neighbors.\n\n2. DESCRIPTION OF AMMONIA SYSTEM\nWe operate one commercial packinghouses for deciduous tree fruit - apricots, nectarines, peaches, plums, kiwi and grapes  Our facilities has an ammonia system that provides refrigeration capacity to five cold rooms equipped with forced air cooling for cooling fruit Apio, inc has one ammonia engine room with a total system charge of 26,000 lbs Each of our cold rooms have stored palleted product.  We also operate a freon refrigeration system.  We have a little more than 1,000 pounds of freon at the site at any given time, so it is not subject to this law.\n\nAll of our systems operate in a similar manner.  High pressure liquid from our main receiver is piped to each cold room, where it passes through an expansion valve into a low temperature & pressure accumulator vessel.  Cold liquid ammonia from the accumulator is piped to evaporator coils.  As heat is absorbed from the produce, the liquid in the evaporator coils vaporizes.  Low temperature and pressure gas from the coils is returned to the accumulator vessel.  A suction return line carries the vapor to our engine room, where it passes through a compressor.  The high pressure discharge from the compressor is sent to a water cooled condenser where the high pressure gas ammonia is liquified and returned to our receiver.\n\n3. AMMONIA RELEASE SCENARIOS\n3.1 Worst Case Scenario\nOur worst case scenario is the failure of a high pressure receiver containing 26,000 lbs of ammonia.  The receiver is located outside our engine room.  Therefore, if this release were to take place, the release would not be passively mitigated.  The release would take place over a ten minute period.  Using the EPA program RMP*Comp we estimated the ammonia would travel 2.9 miles (rural conditions) before dispersin"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19993,
      "SummaryText": "g enough to no longer pose a hazard to the public.  A map showing the area that would be affected is attached.\n\nIn our opinion, it is extremely unlikely that the worst-case scenario will ever take place.  Our receiver meets industry standards for manufacture and quality control of pressure vessels; ammonia is not corrosive in this service; pressure safety relief valves limit the operating pressure in this vessel; and our operator is trained in the safe operation of our system. \n\n3.2 Alternative Case Scenario\nOur alternative release scenario is as follows.  A high pressure safety relief valve lifts and fails to reseat.  The rated release rate for our high pressure safety relief valve is 70 lbs/min.  We assume the leak would continue for 10 minutes until the header pipe was switched over to the backup safety relieve valve. Following industry practice, our relief valves are installed in pairs with a switch over valve, and the discharge is piped to a release point that is remote from the valve. Under this scenario 700 lbs of ammonia would be released over a time period of 10 minutes.  Using RMP*Comp we estimate that the ammonia would travel 0.2 miles (rural conditions) before dispersing enough to no longer pose a hazard to the public. \n\n4. GENERAL ACCIDENT RELEASE & AMMONIA SPECIFIC PREVENTION STEPS\nThe ammonia refrigeration system at Apio, Inc. is an integral part of the overall business. It is extremely important that it is maintained and operated in a safe and efficient manner.  Management is committed to making sure that all employees are made aware of the potential danger of an ammonia leak.\n\nThe ammonia refrigeration system/process is constantly being monitored by our refrigeration engineer, Jim Peters.  When unusual circumstances arise, the system/process is checked by an outside refrigeration contractor.  The system/process is controlled by a computer which monitors many process variables, and allows remote control.  In the event of a system upset the computer a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 19993,
      "SummaryText": "ctuates a dialing program that alerts key personnel and responders. \n\nOur ammonia refrigeration system was designed and built by professional refrigeration engineers in accordance with ANSI/IIAR 2-1992 \"Standard for Equipment, Design, and Installation of Ammonia Mechanical Refrigerating Systems\"  It was also built in compliance with the Uniform Building Code and Uniform Mechanical Code applicable at the time of construction.\n\nOur ammonia refrigeration system is equipped with safety relief valves.  These valves limit the operating pressures of the entire system, and prevent failures due to overpressurization.\n\n5. FIVE YEAR ACCIDENT HISTORY\nThe Apio, Inc. facility has not had any reportable accidents within the last five years.\n\n6. EMERGENCY ACTION PLAN\nThis facility's emergency response program is based on the Cal OSHA requirements for Emergency Action Plans (in California CCR Title 8, Section 3220, \"Emergency Action Plans\" and Federally Title 29 CFR 1910.38 and 1910.119) and HAZWOPER (standard (in California CCR Title 8, Section 5192, \"Hazardous Waste Operations and Emergency Response\" and Federally Title 29 CFR 1910.120). \n\nStrategically, we will respond Defensively to a release. Our engineer has received Defensive Training (First Responder, Operations Level) specific for ammonia response and meeting HAZWOPER criteria.  Under this plan our employees will take whatever steps are necessary to bring a release under control. Initial training to the defensive level (First Responder, Operations Level) as defined in the HAZWOPER regulations will take place before the end of the year.  The first priority will be to operate the ammonia system to bring a release under control safely, from a distance, without donning personal protective equipment.  Steps might include stopping the flow of ammonia to a leak point, or using the compressor to suck ammonia away from a leak point. Further response requiring the donning of personal protective equipment would be done in coordination"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 19993,
      "SummaryText": "an outside agency.  All response activities would be coordinated with the local fire department and the Visalia Fire Department Hazardous Materials Response Team.\n\nEvery year at the beginning of the season we review with our employees our evacuation procedures in the event of an emergency, including an ammonia release.  We have 2 windsocks at our facility that employees can use to determine the \"upwind\" side of any point of release.  \n\n7. PLANNED CHANGES TO IMPROVE SAFETY\nAs of July 8th, 1999, the time that this Executive Summary is being submitted, our Risk & Process Safety Management Plan is not complete.  The reason is that in order to do it right a lot of work must be done.  We simply do not have enough qualified employees or resources to meet the initial deadline. Our company operates seasonally and we have found that our ability to allocate managerial and operator resources to prepare this plan depends upon our workload.  In addition, we have found it necessary to obtain help from outside vendors for some critical elements, such as preparing the offsite consequence analysis parameters.  These vendors are attempting to meet the requests of numerous facilities such as ours at the same time, and have the same problem of only a limited number of people qualified to carry out the required tasks.  Thus, these vendors are setting completion dates for plan elements that we cannot entirely control.\n\n\nHowever, we have prepared the following milestones and allotted times for the completion of our plan:\n\nMilestone Allotted Time\n7 Conduct Offsite Consequence Analysis -- Done\n7 Prepare RMP*Submit showing status as of 7/8/99 -- Done\n7 Modify existing PSM Program  60 days - by Sept 1, 1999\n-  Prepare a unified program to meet CalARP RMP Obligations\n-  Integrate program more closely with current business practices\n-  Modify program to better withstand audit\n7 Compile all elements into Risk & Process Safety \nManagement Program, review internally, and submit  30 days - By Oct 1"
    }
  ]
}