{
  "FacilityID": 20011,
  "FacilityName": "Kraft Foods, Inc.",
  "FacilityStr1": "1007 Town Line Road",
  "FacilityStr2": "P. O. Box 8018",
  "FacilityCity": "Wausau",
  "FacilityState": "WI",
  "FacilityZipCode": "54402",
  "Facility4DigitZipExt": "8018",
  "FacilityCountyFIPS": "55073",
  "LEPC": "Marathon County LEPC",
  "FacilityLatDecDegs": "44.925",
  "FacilityLongDecDegs": "-89.625556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 10285997,
  "ParentCompanyName": "Phillip Morris",
  "Company2Name": null,
  "CompanyDUNS": 144628310,
  "Company2DUNS": 0,
  "OperatorName": "Kraft Foods, Inc.",
  "OperatorStr1": "Three Lakes Drive",
  "OperatorStr2": null,
  "OperatorCity": "Northfield",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60093",
  "OperatorZipCodeExt": "2753",
  "RMPContact": "Susan Johnson",
  "RMPTitle": "Engineering Manager",
  "FTE": 232,
  "OtherEPAFacilityID": "WID010285997",
  "EPAFacilityID": "100000035516",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": " 737079750-N02",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-10-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 44.94468,
  "FRS_Long": -89.6141,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 28025,
      "AltID": null,
      "FacilityID": 20011,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 28737,
          "ProcessID": 28025,
          "NAICSCode": "311513",
          "_desc": {
            "NAICS_CODE": "311513",
            "NAICS_DESCRIPTION": "Cheese Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 36530,
          "ProcessID": 28025,
          "ChemicalID": 56,
          "Quantity": 20500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 536530,
          "ProcessID": 28025,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20011,
      "SummaryText": "EXECUTIVE SUMMARY:\n\n1.0    Release Prevention and Emergency Response Policies\n\nThe Kraft Foods facility in Wausau, Wisconsin, has an excellent record in preventing and minimizing releases of anhydrous ammonia (hereafter, anhydrous ammonia will be referred to as ammonia).  This facility has a thorough emergency training program for on-site emergency responders.  This facility has a manual preventive mainten ance system which tracks training and inspection dates and issues reminders to responsible groups.\n\nThe emergency response policies at this facility ensure emergency response coverage, 24 hours - 7 days per week.  There are also adequate provisions for coordination with outside agencies, such as with the Wausau  Fire Department and the Marathon County Emergency Government (LEPC), in the event of an emergency.\n\n2.0    Process Description and Regulated Substances\n\nAt this location, Kraft Foods manufactures processed cheese (Parmesan and Romano) and spray dried process cheese.  The North American Industrial Classification System (NAICS) code for the primary process a this facility is 311513.  Kraft has one regulated substance under 40 CFR 68, ammonia, at the Wausau, Wisconsin plant.  The storage and process areas of the plant are refrigerated by ammonia to keep the products fresh and wholesome.  Ammonia has been widely used as a refrigerant in the food industry for decades.\n\nThe ammonia threshold for triggering applicability to 40 CFR 68 is 10,000 pounds.  The quantity of ammonia stored on-site is approximately  20,500 pounds.\n\n    Ammonia is classified as a Group 2 Refrigerant per ASHRAE Standard 34-1989. Its distinctive, pungent odor is very noticeable to most people, even in small quantities. Ammonia is flammable in a very narrow and high range of concentration with a high ignition temperature.  It is not poisonous, but it can be corrosive to human tissue.  Ammonia is readily absorbed into the moisture of the skin and, at high concentrations, can cause  burns. The potentia"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20011,
      "SummaryText": "l risks to people exposed to an accidental ammonia release include irritation of respiratory tract, burning of skin and other tissue when contacted by ammonia vapor, and freezing of skin and other body tissue when contacted by liquid ammonia\n\n3.0    Worst-Case and Alternative Release Scenario\n\nAlthough there are quality and safety systems in place at Kraft's Wausau plant, a release from the ammonia refrigeration system could potentially affect employees on-site and the general public offsite.   USEPA requires companies to use models for \"worst-case\" and \"alternate\" release scenarios for each regulated chemical.  Given the safety precautions at the plant, both scenarios are unlikely to occur. If a release occurred, however, the alternative scenario would be more likely.  \n\n    The ammonia release scenario was modeled using SLAB (June 1990 version) to obtain the distance to the ERPG-2 endpoint.   The Emergency Response Planning Guideline, Level 2, ERPG-2, was developed by the American Industrial Hygiene Association.  It refers to the level of ammonia that individuals could be exposed to for up to one hour without being subjected to irreversible or other serious health effects that could make it difficult for them to leave the affected area.\n    \n4.0    General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThis facility has developed an OSHA PSM program for its ammonia refrigeration system.  Ammonia falls under the RMP Program 3 prevention program, which is identical to the OSHA PSM program.  EPA has said that if the process is in compliance with OSHA PSM, then it is in compliance with RMP program 3.  Thus, Kraft's ammonia PSM has been reviewed and determined to be completed for the RMP document.\n\nThere are several key aspects of the prevention program:\n\n1.    Most of the ammonia pipe work is located away from employee traffic patterns and machinery to minimize the chance of an ammonia release.\n\n2.    The plant maintains good training, certification and e"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20011,
      "SummaryText": "mployee awareness of operating procedures.\n\n3.    An electronic control monitoring system is in place for monitoring the entire engine room process, which allows for continual alarm status monitoring, and equipment malfunction.\n\n\n5.0    Five-year Accident History\n\nThe review of this facility's accident history includes the following range of dates: June 11, 1994 - June 11, 1999, must be at least 5 years.  To date, there have been no releases at this facility as defined in 40 CFR Part 68.42 (a).\n\n6.0    Emergency Response Program\n\nAs mentioned earlier, this facility has developed an emergency response plan, including, but not limited to, steps to address the following topics:\n\naccidental discharge of hazardous substances and hazardous waste into the environment\n    \nthe measures to be taken to prevent an accident\n    \ncountermeasures to be taken in the event of an emergency, and;\n    \nprocedures for containing and limiting the duration of the emergency measures to be employed for further protection of employees responding to the emergency, as well as other plant personnel\n\nOur comprehensive emergency response plan is designed to protect our employees, environment and the community and, among other things, requires that:\n\nAll nonessential personnel immediately exit the area affected by the release;\n\nKraft immediately notify local officials, requesting their assistance, if necessary;\n"
    }
  ]
}