{
  "FacilityID": 20096,
  "FacilityName": "Chariton Perishable Warehouse",
  "FacilityStr1": "2244 West Curtis Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Chariton",
  "FacilityState": "IA",
  "FacilityZipCode": "50049",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19117",
  "LEPC": "Lucas County LEPC",
  "FacilityLatDecDegs": "41.030278",
  "FacilityLongDecDegs": "-93.335",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "CE",
  "FacilityURL": "Hy-Vee.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6925671,
  "ParentCompanyName": "Hy-Vee Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Hy-Vee Inc.",
  "OperatorStr1": "5820 Westown Parkway",
  "OperatorStr2": null,
  "OperatorCity": "West Des Moines",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50266",
  "OperatorZipCodeExt": null,
  "FTE": 282,
  "OtherEPAFacilityID": "IAD006925671",
  "EPAFacilityID": "100000166161",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1995-08-11 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-02-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-01-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-01-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-01-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 41.02714,
  "FRS_Long": -93.32783,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 28152,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 20096,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 36774,
          "ProcessID": 28152,
          "ChemicalID": 56,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 28868,
          "ProcessID": 28152,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 15364,
              "Process_NAICS_ID": 28868,
              "SafetyReviewDate": "1999-10-15 00:00:00",
              "PHA_Date": "1999-10-12 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-12-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 1,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-10-15 00:00:00",
              "TrainingReviewDate": "1999-10-15 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-10-15 00:00:00",
              "EquipmentInspectionDate": "1999-10-07 00:00:00",
              "EquipmentTested": "Refrigeration Compressor",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-10-15 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-10-15 00:00:00",
              "HotWorkPermitReviewDate": "1999-10-15 00:00:00",
              "ContractorSafetyReviewDate": "1999-10-15 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "The ammonia refrigeration system for the Hy-Vee Inc. Perishable Warehouse located in Chariton, Iowa utilizes anhydrous ammonia to function as the heat transfer medium.  The system contains seven screw compressors and two reciprocating compressors with a total refrigeration capacity of 753.5 tons.  The compressors operate at three different suction temperatures; 0:F, 20:F and 35:F with a discharge pressure of 125 psig.  A thermosyphon system is used for cooling the compressor oil.\n\nThe system contains one evaporative condenser with two cells to convert the high pressure ammonia gas to high pressure liquid.  After the high pressure ammonia gas is condensed, it flows to the Thermosyphon Receiver, TS-1.  \n\nA pre-set level of liquid ammonia is maintained in the Thermosyphon Receiver.  The liquid ammonia flows from the bottom of the Thermosyphon Receiver through an oil cooler on each compressor and back to the top of the Thermosyphon Receiver.  Liquid ammonia overflows from the side of the Thermosyphon Receiver to the Pilot Receiver, PR-1.\n\nA normal level of 30 inches of liquid ammonia is maintained in the Pilot Receiver by a float valve.  Liquid ammonia is transferred from the Pilot Receiver to the Control Pressure Receiver, CPR-1.  \n\nA normal level of 24 inches of liquid ammonia is maintained in the Control Pressure Receiver, CPR-1.  Liquid ammonia is transferred from the Control Pressure Receiver, CPR-1, to the Control Pressure Receiver, CPR-2, and to the Banana Room Evaporators, the Dairy/Deli Evaporators, the Dock Area Zone 1 Evaporators, the Wet Produce Zones 8 & 9 Evaporators, the Dry Produce Zone 10 Surge Drum and Evaporators, the Cheese Cooler Evaporators, the Dock Area Zones 2 & 3 Evaporators, the General Produce Zones 6 & 7 Evaporators, the Cheese Dock Evaporators and the Glycol Exchanger.\n\nThe evaporators are operated in a flooded condition and ammonia liquid and vapor is transferred from the Dairy/Deli Evaporators, the Dock Area Zone 1 Evaporators, the Wet Produce Zones 8 & 9 Evaporators, the Dry Produce Zone 10 Evaporators, the Cheese Cooler Evaporators, the Cheese Dock Evaporators, and the Glycol Exchanger to the Suction Accumulator, ACC-1.\n\nAmmonia liquid and vapor is transferred from the Banana Room Evaporators, the Dock Area Zones 2 & 3 Evaporators, and the General Produce Zones 6 & 7 Evaporators to the Suction Accumulator, ACC-2.\n\n \nA normal level of 28 inches of liquid ammonia is maintained in the Control Pressure Receiver, CPR-2.  Liquid ammonia is transferred from the Control Pressure Receiver, CPR-2, to the Ice Storage Zone 11 Evaporators and to the Ice Drying Belts.\n\nAmmonia liquid and vapor is transferred from the Ice Storage Zone 11 Evaporators and the Ice Drying Belts to the Suction Accumulator, ACC-3.\n\nLiquid Transfer Units, LTU-1 and LTU-2 are utilized to transfer liquid ammonia from the Suction Accumulators, ACC-1 and ACC-2 to the Control Pressure Receiver, CPR-1.  Liquid Transfer Unit, LTU-3 is used to transfer liquid ammonia from the Suction Accumulator, ACC-3 to the Control Pressure Receiver, CPR-2.\n\nAmmonia vapor is drawn out of the Suction Accumulators to the suction side of the Compressors, which completes the refrigeration cycle.\n\nThe compressor operating sequence is computer controlled.  A computer controlled hot gas defrost system is used on all evaporators requiring defrost.  The computer system can be accessed remotely via the telephone system.\n\nThe system contains an emergency relief valve box, from which ammonia vapor can be dumped from the system through a diffuser located above the evaporative condenser on the roof of the building.  Ammonia vapor can also be transferred from vessel to vessel using the emergency relief valve box.",
              "_chemicals": [
                {
                  "PrimaryKey": 22326,
                  "PreventionProgram3ID": 15364,
                  "ProcessChemicalID": 36774
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 20096,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-10-15 00:00:00",
    "ERTrainingDate": "1999-02-01 00:00:00",
    "CoordinatingAgencyName": "Lucas County LEPC",
    "CoordinatingAgencyPhone": "5157745718",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20096,
      "SummaryText": "The Chariton Perishable Warehouse is grocery products storage and distribution facility that contains refrigerated areas.  The refrigerated areas are cooled by an anhydrous ammonia refrigeration system.  Anhydrous ammonia, a substance regulated by EPA, is one of the most economical refrigerants available.  However, the properties of ammonia makes it necessary to observe certain safety precautions while operating the refrigeration system to prevent employee exposure, and to reduce the threat of exposure to nearby members of the community.\n\n    The Chariton Perishable Warehouse chose to follow the EPA's Chemical Accident Prevention Rule, Program Level 3, to prevent a release of ammonia from the refrigeration system.  The amount of ammonia estimated to be contained inside the refrigeration system is 14,000 pounds.\n\n    The Chariton Perishable Warehouse complies with EPA's Accidental Release Prevention Rule, and applicable state codes and regulations to prevent a catastrophic release of ammonia.  The ammonia refrigeration system has been constructed according to the International Institute of Ammonia Refrigeration guidelines (IIAR).  The operators of the systems are required to complete a training and certification program to operate the ammonia refrigeration system.\n\n    The Accidental Release Prevention Program does not guarantee against an accidental release.  An offsite consequence analysis was completed using a computer model to simulate a release of the ammonia from the refrigeration system.  The worst case scenario considered the loss of the total charge of 14,000  pounds of anhydrous ammonia in the refrigeration system over a 10 minute period.  The analysis showed that the ammonia vapor could travel approximately 3520 yards or 2.0 miles.  There are approximately  2152 residents who could be potentially affected in the identified radius.  There are other public receptors (schools, day cares, nursing homes, recreational areas, hospitals, and industrial/commercial buildings"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20096,
      "SummaryText": ") in the potentially affected area.\n\n     The alternative release scenario, which is the most likely scenario, considered a release of ammonia from a broken pipe inside the building.  A release of 500 pounds of ammonia over a 10 minute period was considered.  The computer model showed that the ammonia vapor could travel approximately 179 yards or 537 feet.  There are no public receptors located in the potentially affected area.  No administrative controls or mitigation measures were used to limit the chemical release distances for either scenario.\n\n    The Chariton Perishable Warehouse has an established Emergency Action Plan to respond to emergencies.  The plan was developed in accordance with 29 CFR 1910.38 Emergency Action Plan.  The plan requires employees to exit the facility during a fire or ammonia release to a safe area.  The emergency agencies will be notified of the emergency.  The emergency agencies will notify any potentially affected neighbors.  Maintenance personnel will be available as a resource during an ammonia release emergency.  The plan also addresses natural hazard emergencies, fires, bomb threats, civil disturbances, and utility outages.\n\n    This location has not experienced a reportable ammonia release in the past 5 years.\n        \n    The Chariton Perishable Warehouse wanted to evaluate the potential failures of the refrigeration system, and if the safeguards were sufficient to prevent a catastrophic release of ammonia.  A Process Hazard Analysis was completed on the refrigeration system in October, 1999.  Planned changes to improve safety resulting from this analysis are documented in the Process Hazard Analysis report in the Accidental Chemical Release Prevention Program.  Also, the guidelines from the International Institute of Ammonia Refrigeration (IIAR) will be followed where applicable, to manage the refrigeration system."
    }
  ]
}