{
  "FacilityID": 20191,
  "FacilityName": "Kettle River Operations",
  "FacilityStr1": "363 Fish Hatchery Road",
  "FacilityStr2": null,
  "FacilityCity": "Republic",
  "FacilityState": "WA",
  "FacilityZipCode": "99166",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53019",
  "LEPC": "Ferry County",
  "FacilityLatDecDegs": "48.675",
  "FacilityLongDecDegs": "-118.586667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 200818078,
  "ParentCompanyName": "Echo Bay Minerals Company",
  "Company2Name": null,
  "CompanyDUNS": 601097285,
  "Company2DUNS": null,
  "OperatorName": "Echo Bay Incorporated",
  "OperatorStr1": "6400 South Fiddlers Green Circle",
  "OperatorStr2": "Suite 1000",
  "OperatorCity": "Englewood",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80111",
  "OperatorZipCodeExt": "4957",
  "FTE": 150,
  "OtherEPAFacilityID": "99166KTTLR363FI",
  "EPAFacilityID": "100000166713",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-01-05 00:00:00",
  "SafetyInspectionBy": "Mine Safety and Health Admin.",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-02-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-02-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-01-31 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2020-02-28 00:00:00",
  "DeRegistrationEffectiveDate": "2018-01-01 00:00:00",
  "AnniversaryDate": "2005-01-31 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.4",
  "FRS_Lat": 48.673322,
  "FRS_Long": -118.607776,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility in temporary closure and all regulated sources emptied",
  "_processes": [
    {
      "ProcessID": 28264,
      "AltID": "Sulfur Dioxide Storage",
      "FacilityID": 20191,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 36911,
          "ProcessID": 28264,
          "ChemicalID": 49,
          "Quantity": 150000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 28982,
          "ProcessID": 28264,
          "NAICSCode": "213114",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 11037,
              "Process_NAICS_ID": 28982,
              "SafetyReviewDate": "2000-01-26 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2000-01-26 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Level element & dip tube prevents overfilling",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Tailings dam embankment prevents dense gas release to west & contact with most public receptors",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-01-26 00:00:00",
              "TrainingReviewDate": "2000-01-26 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-01-26 00:00:00",
              "EquipmentInspectionDate": "1999-12-01 00:00:00",
              "EquipmentTested": "Monthly inspection of pressure vessel, SCBA, and HAZWOPER control equipment",
              "ComplianceAuditDate": "1999-10-26 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 11562,
                  "PreventionProgram2ID": 11037,
                  "ProcessChemicalID": 36911
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 20191,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-01-27 00:00:00",
    "ERTrainingDate": "1999-12-01 00:00:00",
    "CoordinatingAgencyName": "Ferry County Sheriff Department",
    "CoordinatingAgencyPhone": "5097753132",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Mine Safety and Health Administration (MSHA) Regulations"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20191,
      "SummaryText": "Echo Bay Kettle River Operation (EBKR) is committed to protection from accidental loss to its employees and property.  In fulfilling this commitment we will provide and maintain a safe and healthy work environment as indicated by acceptable business practices and compliance with legislative requirements and will strive to eliminate any foreseeable hazards that could result in fires, security losses, damage to property and personal injuries or illnesses.  All management functions including business, line and associated management will comply with Kettle River Operations' loss prevention requirements as they apply to the design operation and maintenance of facilities and equipment.  All employees will perform their jobs properly in accordance with established procedures and operating philosophy.\n\nOur facility's primary activity is gold mining, concentrating and refining.  We have one regulated substance, sulfur dioxide, present at our facility above 40 CFR 68 threshold quantities.  Sulfur dioxide is used in a patented process to transform cyanide into various non-toxic nitrogen compounds before the treated mill effluent is stored in a tailings facility.  The maximum inventory of our sulfur dioxide storage process is 150,000 pounds.  \n\nThe EPA guidance document, RMP Offsite Consequence Analysis Guidance, and the EPA-approved dispersion model, DEGADIS, were used to perform the required offsite consequence analyses.  \n\nThe worst case release-scenario was assumed to be a release of 150,000 pounds of sulfur dioxide during a 10-minute release.  Under worst-case weather conditions, the predicted distance to the toxic endpoint of 0.0078 milligrams per liter was 25 miles.  This distance is greater than the distance to the nearest public receptor.  For the worst-case analysis, no mitigation measures were assumed to exist.  However, actual mitigation measures that limit the distance such a release might travel include the location of the tailings dam (a substantial barrier to de"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20191,
      "SummaryText": "operations, temporary operations, emergency shutdowns, normal shutdowns, startup following a normal or emergency shutdown, consequences of deviations and steps to correct or avoid deviations, and equipment inspections.  We also provide training and competency testing for all employees assigned to these processes.  Our written maintenance procedures are designed to ensure the ongoing mechanical integrity of the SO2 process equipment, and maintenance personnel are provided with training in the hazards of the process and how to avoid or correct unsafe conditions.  The process equipment is inspected and tested in accordance with the manufacturer's specifications.  We also conduct regular compliance audits to ensure EBKR remains in compliance with the RMP Rule prevention program requirements.\n\nDue to our stringent release prevention policies, there has been no accidental release during the past five years.\n\nKettle River's emergency response plan deals with accidental releases of hazardous materials, as well as other concerns such as first aid and emergency medical treatment, evacuations, and notification of local emergency response agencies.  Procedures for the use and inspection of emergency response equipment are outlined  by various state and federal agencies such as the Mine Safety and Health Administration (MSHA).  MSHA also requires training for all employees in emergency response procedures and other safety issues.   Echo Bay Kettle River holds weekly or monthly safety meetings for all employees plus an additional 40 minutes of area-specific safety training for their supervisors.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the response plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nTo improve safety, EBKR will continue to meet and exceed applicable MSHA safety standards, evaluate standard operating"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20191,
      "SummaryText": "procedures, hold safety meetings monthly or more frequently, and conduct emergency response training at various levels for all mine employees.  These actions will ensure the safe use of sulfur dioxide."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20191,
      "SummaryText": "nse gas moving in a westerly direction), and operating, maintenance, inspection and training procedures designed to prevent accidental releases.  Administrative controls include a safety-based tank-level restriction such that the tank is not to be filled beyond 87 percent of its total capacity.\n\nBecause the worst-case analysis resulted in a toxic endpoint distance greater than the distance to the nearest public receptor, this process is regulated under Program 2 of the RMP regulation.  Program 2 requires analysis of an alternative release scenario as part of the offsite consequence analysis.  Failure of a product transfer line during tank-filling was selected as a likely alternative release scenario for the SO2 storage process.  Based on a release of 56 pounds of SO2 over a 2-minute period, the DEGADIS model predicted the distance to the toxic endpoint to be 0.58 miles.  This distance is greater than the distance to the nearest fenceline, however, no residences are located within this radius from the process.  Administrative controls and mitigation measures that limit the extent of such a release include tank-filling procedures and training, pressure vessel inspections, automatic shutoff valves, release monitors and alarms, transfer-line handling procedures, and tank-level and pressure restrictions.\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention and emergency response requirements set out under 40 CFR 68.  A hazard review was conducted to identify hazards associated with SO2 storage and handling, opportunities for equipment malfunction or human error that could cause an accidental release, safeguards used or needed to control the hazards or prevent equipment malfunction or human error, and any steps needed to detect or monitor releases.   Our facility uses standard operating procedures that provide clear instructions for safely conducting activities associated with the SO2 processes, including initial startup, normal"
    }
  ]
}