{
  "FacilityID": 20413,
  "FacilityName": "Baker Petrolite Corp.. Bowman",
  "FacilityStr1": "Hyway 12 West",
  "FacilityStr2": null,
  "FacilityCity": "Bowman",
  "FacilityState": "ND",
  "FacilityZipCode": "58623",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38011",
  "LEPC": "Bowman County LEPC",
  "FacilityLatDecDegs": "46.181056",
  "FacilityLongDecDegs": "-103.423694",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.bakerhughes.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 77915291,
  "ParentCompanyName": "Baker Hughes Inc.",
  "Company2Name": null,
  "CompanyDUNS": 174987909,
  "Company2DUNS": null,
  "OperatorName": "Baker Petrolite Corp.",
  "OperatorStr1": "P.O.Box 316",
  "OperatorStr2": null,
  "OperatorCity": "Bowman",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58623",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000172751",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-11-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-10-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-10-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-07-10 00:00:00",
  "DeRegistrationEffectiveDate": "2009-07-06 00:00:00",
  "AnniversaryDate": "2005-10-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 46.18,
  "FRS_Long": -103.417778,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 28623,
      "AltID": "Acrolein Storage",
      "FacilityID": 20413,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 37328,
          "ProcessID": 28623,
          "ChemicalID": 22,
          "Quantity": 11000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 29349,
          "ProcessID": 28623,
          "NAICSCode": "213112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 15623,
              "Process_NAICS_ID": 29349,
              "SafetyReviewDate": "2000-03-13 00:00:00",
              "PHA_Date": "2000-11-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-03-13 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-03-13 00:00:00",
              "TrainingReviewDate": "2000-03-13 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-03-13 00:00:00",
              "EquipmentInspectionDate": "2000-03-13 00:00:00",
              "EquipmentTested": "Forklifts and Trucks",
              "ChangeMgmtDate": "2000-03-13 00:00:00",
              "ChangeMgmtReviewDate": "2000-03-13 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2000-07-17 00:00:00",
              "AuditCompletionDate": "2000-07-17 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-03-13 00:00:00",
              "HotWorkPermitReviewDate": "2000-03-13 00:00:00",
              "ContractorSafetyReviewDate": "2000-03-13 00:00:00",
              "ContractorSafetyEvalDate": "2000-03-13 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 22630,
                  "PreventionProgram3ID": 15623,
                  "ProcessChemicalID": 37328
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 20413,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-01-25 00:00:00",
    "ERTrainingDate": "2000-03-29 00:00:00",
    "CoordinatingAgencyName": "Bowman Fire Department",
    "CoordinatingAgencyPhone": "7015235672",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 20413,
      "SummaryText": "scenario involves the release of 370 pounds of acrolein [2-propenal].  Toxic liquid is assumed to be immediately released to form a pool of height 1centimeter, from which evaporation takes place.  The entire pool is estimated to have evaporated over 32 minutes.  Under worst case weather conditions, namely Class F atmospheric stability and 1.5 m/s wind speed, the maximum distance of  2.8 miles is obtained corresponding to a toxic endpoint of .0011 mg/L.\n\nOne alternate release scenario has been submitted for acrolein [2-propenal], which considers the most likely scenario.  The alternate release scenario for acrolein involves a release from a tank in the acrolein storage process.  The scenario involves the release of 370 pounds of acrolein [2-propenal]  via a punctured cylinder.  Toxic liquid is assumed to be immediately released to form a pool of height of 1 centimeter, from which evaporation takes place.  The entire pool is estimated to have evaporated over 39 minutes.  Under neutral weather conditions, the maximum distance to the toxic endpoint of .0011 mg/L is .63 miles.\n\n4. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility in Bowman, North Dakota has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68. Our acrolein [2-propenal]  storage process at our facility is subject to the OSHA PSM standard under 29 CFR 1910.119. \nThe following sections briefly describe the elements of our release prevention program that are in place at our facility.\n\nProcess Safety Information\nBaker Petrolite in Bowman, North Dakota maintains a detailed records of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with acrolein [2-propenal].\n\nProcess Hazard Analysis\nBaker Petrolite's Bowman, North Dakota facility conducts comprehensive studies to ensure that hazards associated with our processes are ide"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 20413,
      "SummaryText": "GENERAL EXECUTIVE SUMMARY for Baker Petrolite Corporation Bowman, ND\n\n1. Accidental Release Prevention and Emergency Response Policies\nWe at Baker Petrolite Bowman, North Dakota are strongly committed to employee, public and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances. If such an unforeseeable release were to occur, we would coordinate our efforts with the Bowman Fire Department to help control and mitigate the effects of the release.\n\n2. The Stationary Source and the Regulated Substances Handled\nOur facility is primarily in the storage and distribution of our products to our oil field customers. We have one (1) regulated substance present at our facility.  This substance is acrolein [2-propenal].  The regulated substance at our facility is stored and distributed to our oil field customers. Acrolein is stored in a pressurized vessel to minimize emissions during storage.  There is no material handling of acrolein except moving of containers.\n\nThe maximum possible inventory of acrolein [2-propenal] at our facility is 11,000 lbs. The daily average is usually much less.\n\n3.The Worst Case Release Scenario(s) and the Alternate Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\nTo perform the required offsite consequence analysis for our facility, we have used the ALOHA model purchased from the National Safety Council. Local emergency planners, including LEPC's and fire departments use this program.  The following paragraphs provide details of the chosen scenarios.  \n\nThe worst case release scenario submitted  involves a catastrophic release from acrolein storage.  The"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20413,
      "SummaryText": "ntified and controlled efficiently.  The methodology used to carry out these analyses is HAZOP.  The studies are undertaken by a team of qualified personnel with knowledge in engineering and process operations, and are revalidated at a regular interval of at least 5 years or anytime there is a change in the process. Any changes in the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Baker Petrolite in Bowman, North Dakota maintains written operating procedures.  These procedures address various modes of operation such as transportation, storage and emergency operations.  The information is regularly reviewed and is readily accessible to operators involved with the processes.  \n\nTraining\nBaker Petrolite in Bowman, North Dakota has a comprehensive training program in place to ensure that employees that are operating processes are completely competent in the operating procedures associated with this process.  New employees receive basic training in operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided at least every 3 years and more frequently as needed.\n\nMechanical Integrity\nBaker Petrolite in Bowman, North Dakota carries out highly documented maintenance checks on process equipment to ensure proper operations.  Equipment examined by these checks includes among others; pressure vessels, relief and vent systems, and any piping.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe timely manner.\n\nManagement of Change\nWritten procedures are in place at Baker Petrolite in Bowman, North Dakota to manage changes in technology, equipment and procedures.  Process operators, mainte"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20413,
      "SummaryText": "nance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.   \n\nPre-startup Reviews\nPre-startup safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Baker Petrolite in Bowman, North Dakota.  These reviews are conducted to confirm that construction, equipment, operating, and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nBaker Petrolite in Bowman, North Dakota conduct audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nBaker Petrolite in Bowman, North Dakota promptly investigates any incident(s) that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the releases from reoccurring.  All reports are retained for a minimum of five (5) years.\n\nEmployee Participation\nBaker Petrolite in Bowman, North Dakota truly believes that process safety management and accident prevention is a team effort. Employees at the employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's  implementation to the RMP rule in particular information resulting form process hazard analysis.\n\nContractors\nThere is a possibility that our company would hire contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor involving"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 20413,
      "SummaryText": "a covered process, a thorough evaluation of safety performance of the contractor would carried out. Baker Petrolite Corporation has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors would also be informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n5. Five-year Accident History\nBaker Petrolite Corporation in Bowman, North Dakota has had an excellent record of preventing accidental releases of a regulated substance over the past five (5) years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n6. Emergency Response Plan\nBaker Petrolite Corporation in Bowman, North Dakota carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to  reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n7. Planned Changes to Improve Safety\nBaker Petrolite Corporation in Bowman, North Dakota has reviewed many of our processes to ensure compliance with this regulation.  During this process, our Bowman, North Dakota facility has identified several steps to improve the safety of our operations.  These steps have included, and continue to include, providing concrete containment and lockable security for our acrolein [2-propenal]. We have also increased the amount of neutralizer on site, and have increased the amount of training our employee's receive in emergency response and emergency response coordination with outside agencies, as well as training and coordination"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 20413,
      "SummaryText": "with local emergency responders and our neighbors. Some of these issues have been completed, and will be reviewed for further improvements as needed"
    }
  ]
}