{
  "FacilityID": 20422,
  "FacilityName": "High Plains Ethanol Inc.",
  "FacilityStr1": "1827 S Industrial Dr.",
  "FacilityStr2": null,
  "FacilityCity": "Portales",
  "FacilityState": "NM",
  "FacilityZipCode": "88130",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "35041",
  "LEPC": "Roosevelt LEPC",
  "FacilityLatDecDegs": "34.168056",
  "FacilityLongDecDegs": "-103.369722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.highplainscorp.com",
  "FacilityEmailAddress": "ethanol@pdrpip.com",
  "FacilityDUNS": 782991970,
  "ParentCompanyName": "High Plains Corporation",
  "Company2Name": null,
  "CompanyDUNS": 21366125,
  "Company2DUNS": 0,
  "OperatorName": "High Plains Corporation",
  "OperatorStr1": "200 W. Douglas, Suite 820",
  "OperatorStr2": null,
  "OperatorCity": "Wichita",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "67202",
  "OperatorZipCodeExt": null,
  "RMPContact": "Fletcher Aldrich",
  "RMPTitle": "Safety Director",
  "FTE": 42,
  "OtherEPAFacilityID": "88130HGHPL1827S",
  "EPAFacilityID": "100000030566",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "566-M-4",
  "SafetyInspectionDate": "2000-04-26 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-11-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-11-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-11-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-07-07 00:00:00",
  "DeRegistrationEffectiveDate": "2011-12-27 00:00:00",
  "AnniversaryDate": "2004-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 34.17048,
  "FRS_Long": -103.36972,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 28638,
      "AltID": "Denaturing",
      "FacilityID": 20422,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 29364,
          "ProcessID": 28638,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 37344,
          "ProcessID": 28638,
          "ChemicalID": 155,
          "Quantity": 65880.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 27608,
              "ProcessChemicalID": 37344,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 27609,
              "ProcessChemicalID": 37344,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 27610,
              "ProcessChemicalID": 37344,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 537344,
          "ProcessID": 28638,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20422,
      "SummaryText": "Process Safety Management/Risk Management Plan\nExecutive Summary in Compliance with 29 CFR 1910.119 and 40 CFR 68.130\n\nPurpose:  \n\nThe major objective of this Process Safety Management (PSM) and Risk Management Plan (RMP) of highly hazardous chemicals program is to prevent unwanted releases of hazardous chemicals especially into locations that could expose employees and the surrounding communities to serious hazards.  To be an effective program it requires a systematic approach to evaluate the whole chemical process.  Using this approach, the process design, process technology, process changes, operational and maintenance activities and procedures, non-routine activities and procedures, emergency plans and procedures, training programs, and other elements that effect the process are all considered in this evaluation.  Through this evaluation we intend to prevent or minimize the consequences of catastrophic releases of toxic chemicals as these releases could result in toxic hazards and cause harm to persons or the environment.\n\nApplication:\n\n This RMP pertains to the High Plains Corporation's Ethanol Facility located in Roosevelt County, Portales, New Mexico.  The Facility processes Milo grain to produce fuel grade ethanol alcohol and high protein cattle feed.  Natural gasoline is used in the process to \"denature\" the ethanol alcohol product by mixing 95% alcohol with 5% natural gasoline. Denaturing makes the alcohol unsuitable for drinking and is required to maintain tax exempt status and compliance with the Bureau of Alcohol, Tobacco and Firearms. Natural Gasoline is stored at the facility in quantities no greater than 65,880 lbs (12,000 gallons). The precise chemical composition of the denaturant (Natural Gasoline) can vary depending on the supplier. A change in denaturant supplier resulted in a denaturant now with a NFPA Fire Hazard Rating of 4 and also containing three chemicals that qualify for Process Safety  Management:\n\nFLAMMABLE MIXTURES (Natural Gasoline)?"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20422,
      "SummaryText": "????OVER 10,000 POUNDS      \nChemical               CAS #               Pounds\n-- Butane              106-97-8           3,294\n-- Isopentane        78-78-4            19,764\n-- Pentane            109-66-0           23,058\n\nThis program is the proactive identification, evaluation and mitigation or prevention of chemical releases that could occur as the result of failures in processes or equipment.\n\nTo control these types of hazards we have developed and will continue to review, the necessary expertise, experience, judgement, and initiative within the work force to properly implement and maintain an effective process safety management program as envisioned in the OSHA and EPA standards.  There shall be employee representatives on the PSM/RMP Team.\n\nDefinition of Terms:\n\nUncontrolled release: A major uncontrolled emission, fire, or, explosion, involving a hazardous chemical, that presents serious danger to employees in the workplace.\n\nFacility:  The buildings, containers or equipment that contain a process.\n\nHighly Hazardous Chemical: A substance possessing toxic, reactive, flammable, or explosive properties.  Over 10,000 pounds of a flammable liquid or gas, and/or listed in 29 CFR 1910.199 appendix \"A\" or 40 CFR 68.130 appendix \"A\".\n\nProcess:  Any activity involving a highly hazardous chemical including any use, storage, manufacturing, handling, or the on-site movement of such chemicals, or combination of these activities.  For purposes of this definition, any group of vessels that are interconnected and separate vessels that are located such that a highly hazardous chemical could be involved in a potential release shall be considered a single process.\n\nEmployee Participation:\n\nIt is our desire to assure full participation in the process safety management and risk management program.  This involvement will lead to a better understanding by all of the hazards, operating procedures, safety systems, start-up procedures, shut-down procedures, training, contractor involvem"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20422,
      "SummaryText": "ent, maintenance, emergency planning and emergency response necessary to implement a full and complete program.  Employees shall be consulted during hazard communication training, emergency evacuation training and respiratory protection training.\n\nHazards of Flammable Mixtures in the Process:\n\n1. Natural gasoline is a clear, colorless, liquid with a distinct hydrocarbon odor.\n2. NFPA ratings are:\nHealth - 1 (Slightly Hazardous)\nFlammability - 4 (Very Flammable)\nReactivity - 0 (Normally Stable)\n3. Composition is a combination of complex hydrocarbons consisting predominately of saturated     \n    aliphatic hydrocarbons in the range of C5-C8. Material Data Safety Sheets reflect No Data for \n    Exposure Limits/Health Hazards for Natural Gas, CAS# 68425-31-0.\n4. The specific gravity is .0.65 - 0.67, 5.49 lbs per gallon, and is slightly water soluble.\n5. Boiling Point is 58 - 198F (14 - 92C). Flash point is -45F (-43C), Cleveland Open Cup.\n6. Flammability limits in air by volume:\n          Lower, 1.4%\n          Upper, 7.6%\n7. Combustion may produce CO, NOx, SOx, and reactive hydrocarbons.\n8. Natural gasoline is incompatible with oxidizing agents.\n\nInformation Pertaining to the Technology of the Process: The below listed information is the minimum amount of information we have acquired:\n\n? A block flow diagram or simplified process flow diagram\n? Process chemistry\n? Maximum intended inventory\n? Safe upper and lower limits for such items as temperatures and pressures.\n? An evaluation of the consequences of deviations, including those affecting the safety and health of employees, and the affect on the surrounding communities.\n\nInformation Pertaining to the Equipment in the Process: The below listed information is the minimum amount of information we have acquired:\n\n? Materials of construction\n? Piping and instrument diagrams (P&ID)\n? Relief system design and design basis\n? Design codes and standards employed\n? Material and energy balances\n\nProcess Hazard Analysis:\n\nThe proc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20422,
      "SummaryText": "ess hazard analysis (PHA) is designed to analyze the possible causes and consequences of fires, explosions, releases of toxic chemicals, and major spills of hazardous chemicals.  We shall focus on the equipment, instrumentation, utilities, human actions (routine and non-routine), and external factors that might effect the process.\n\nThe team conducting the process hazard analysis will understand the methodology that is being used.  Team members will be picked based on their knowledge of the area being analyzed.  The team leader of each process hazard analysis will be knowledgeable in the methodology being used and be impartial in the evaluation.  The other full or part-time team members need to provide the team with expertise in areas such as process technology; process design; operating procedures and practices; alarms; emergency procedures; instrumentation; maintenance procedures, both routine and non-routine tasks, including how the tasks are authorized; procurement of parts and supplies; safety and health; current standards, codes, specifications, and regulations; and any other relevant subjects.\n\nFor all Process Hazard Analyses we use one or more of the following methodologies as appropriate:\n? What-If\n? Checklist\n? What-If Checklist\n? Hazard and operability study\n? Failure mode and effects analysis\n? Fault tree analysis\n\nThis Process Hazard Analysis addresses at least the following:\n? The hazards of the process\n? The identification of any and all previous incidents which has a likely potential for catastrophic consequences in the workplace or off-site input.\n? Engineering and administrative controls applicable to the hazards and their interrelationships such as appropriate application of detection methodologies to provide early warning of releases\n? Consequences of failure of engineering and administrative controls\n? Human factors\n\n\nAt least every three years after the completion of the initial process hazard analysis, the process hazard analysis shall be updat"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 20422,
      "SummaryText": "ed and revalidated by a team meeting the qualifications as prescribed by this program, to assure that the process hazard analysis is consistent with the current process.\n\nHigh Plains Corp. shall be responsible to retain process hazard analysis program and updates or revalidation for each process covered by this program, as well as the documented resolution of recommendations described in this program for the life of the process.\n\nOperating Procedures:\n\nTraining:\n\nEach employee presently involved in operating the process and all employees before being involved in operating a newly assigned process, is trained in an overview of the process and in the operating procedures as mentioned earlier in this policy.  Our training includes emphasis on the specific safety and health hazards, emergency operations including shutdown, and safe work practices applicable to the employee's job tasks. Hazard communication training is the beginning of our training program for all employees.  We continue with training programs that inform employees of standard operating procedures, safe work practices, emergency evacuation, safety procedures, routine and non-routine work authorization activities, confined space entry, lockout/tagout, and many other areas as necessary to protect the employee and process. \n\nOur training uses many aspects of current training techniques: these include hands-on, classroom, on-the-job, video programs, written materials and any other technique necessary to provide clear and effective training to our employees.  Employees are fully informed as to the goals and objectives of the training and what is considered acceptable performance for duties they are to perform.  All employees are tested or quizzed to assure their competence and knowledge in each area of training.\n\nSpecific training in the operating procedures, control, precautions, pre-startup, mechanical integrity, inspection, testing, quality assurance, hot work permits, management of change, and emergency p"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 20422,
      "SummaryText": "lanning and response is provided for all employees working and involved with highly hazardous chemicals at our facility.  The highly hazardous chemicals found to be at our facility, at or above the threshold quantities listed in 29 CFR 1910.119 Appendix \"A\" and/or 40 CFR 68.130 Appendix \"A\", are as follows; flammable mixtures.\n\nRefresher training shall be provided as determined.  We shall assure that the employee involved understands and adheres to the current operating procedures of the process.  Once training has been completed and the employee in \"on the job\" there will be an evaluation of the employee's performance, if this evaluation is below acceptable performance levels we will further train the employee to provide the described results and resolve any deficiency.  This training shall be provided as often as necessary but in no case will it be less than once a year and may be combined with Haz Comm training.\n\nHigh Plains is keeping records of all training to ascertain that each employee involved in operating a process has received and understood the training.  This record contains the identity of the employee, the dates of training, and the means used to verify that the employee understood the training.\nApplication of this Program to Contractors:\n\nThis section applies to contractors performing maintenance or repair, turn-around, major renovation, replacement, or specialty work on or adjacent to one of our covered processes.\n\nHigh Plains Responsibilities:\n\nHigh Plains Corp. accepts the responsibility to obtain and evaluate information regarding the contract employer's safety performance and programs, when selecting a contractor.  This may include information on injury and illness rates, experience rates, and contractor references.  We may also obtain information to ensure that the contractor has the appropriate job skills, knowledge, and certifications (e.g., for pressure vessels welders, etc.)  Contractor work methods and experience is also evaluated.\n\nWe res"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 20422,
      "SummaryText": "olve to inform contract employers of the known potential fire, explosion, or toxic release hazards related to the contractor's work and the process.  We inform and explain to all contractor employees the applicable areas of the emergency action plan necessary for the protection of their employees.\n\nHigh Plains Corp. will periodically evaluate the performance of contractor employers to assure the fulfillment of contractor's obligations.\n\n\nContract Employers Responsibilities:\n\nContract employers shall assure and document that each contract employee is trained in the safe work practices necessary to safely perform his/her job.  Listed below are the minimum training requirements for contract employer's to train their employees and provide documentation to High Plains Corp.\n? Each contract employee shall be instructed in the known potential fire, explosion, or toxic release hazards related to their job and the process, this training shall include all applicable provisions of the emergency action plan.\n? Documentation that each contract employee has received and understood the training required shall be performed.  This documentation shall include the identity of the contract employee, the date of training and the instructors name.\n? The contract employer shall assure that each contract employee follows the safety rules of the facility, including the safe work practices as required by this document.\n? The contract employer shall advise High Plains Corp. of any unique hazards presented by the contract employer's work, or of any hazards found during the course of the contract employer's work.\n\nPre-Startup Safety Review:\n\nHigh Plains Corp. will provide a pre-startup safety review whenever a modification is significant enough to require a change in the process safety information (PSI) and for all new facilities built.  We will use the process hazard analysis recommendations to enhance our review.  All startup procedures and normal operating procedures will be fully evaluated "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 20422,
      "SummaryText": "as part of the pre-startup review to ensure a safe transfer into the normal operating mode.\n\nPrior to introduction of highly hazardous chemicals into the process a pre-startup review shall confirm that:\n1. Construction and equipment is in accordance with design specifications.\n2. Safety, operating, maintenance, and emergency procedures are in place and are adequate.\n3. A process hazard analysis has been performed and recommendations have been resolved or implemented before startup.\n4. Training of each employee involved in operating a process has been completed.\n\nFor all existing processes that are shutdown for turnaround or modification, we will ensure that any changes other than \"replacement in kind\" made to the process during shutdown go through the management of change procedures.  P& ID's will be updated, as necessary, as well as operating procedures and instructions.  If the changes made during shutdown are significant and effect the training program, then all operating personnel as well as employees engaged in routine and non-routine work in the process area will receive refresher or additional training.  Incident investigation recommendations, compliance audits, and process hazard analysis recommendations will be reviewed to see what affect they may have on the process before beginning startup.\n\nMechanical Integrity:\n\nThis section applies to the following process equipment:\n? Pressure vessels and storage tanks\n? Piping systems (including piping components such as valves)\n? Relief devices\n? Emergency shutdown systems\n? Controls (including monitoring devices and sensors, alarms, and interlocks)\n\nOur first line of defense against a major catastrophic event is to operate and maintain the process as designed and to contain the chemicals.\n\nInspections and tests are performed on process equipment.  Inspection and testing procedures follow recognized and generally accepted good engineering practices.  All inspections and tests are performed consistent with applicable"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 20422,
      "SummaryText": " manufacture's recommendations and good engineering practices.  More frequently if determined to be necessary by prior operating experience.\n\nEach inspection and test that is performed on process equipment is documented.  This documentation includes the date of the inspection or test, the name of the person who performed the inspection or test, the serial number or other identifier of the equipment on which the inspection or test was performed, a description of the inspection or test performed, the results of the inspection or test, criteria for acceptable test results.\n\nAll deficiencies in equipment that are outside acceptable limits will be corrected in a safe and timely manner to assure safe operation.\n\nIn the construction of new facilities and changes in current equipment, we will assure that equipment as it is fabricated is suitable for the process application for which it will be used.  Appropriate checks and inspections will be performed to insure that equipment is installed properly and consistent with design specifications and the manufacturer's instructions.  We will also assure that maintenance materials, spare parts, and equipment are suitable for the process application for which they will be used.\n\nEquipment installation jobs in the field will be inspected for the use of proper materials and procedures and to insure that qualified craft workers do the job.  The use of appropriate gaskets, packing, bolts, valves, lubricants, and welding rods will be verified in the field.  Also, procedures for installing safety devices will be verified in the field, such as the torque on the bolts on rupture disc installations and uniform torque on flange bolts.\n\nHot Work Permits:\n\nHot work permits are issued for all hot work operations conducted on or near a covered process.  The permit documents that the fire prevention and protection requirements in 29 CFR 1910.252(a) have been implemented prior to the beginning of hot work operations.\n\nWe will control all non-routin"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 20422,
      "SummaryText": "e work in the process areas.  The hazards identified involving the work to be accomplished will be communicated to those performing the work and to those operating personnel whose work could affect the safety of the process.  This could include, as applicable, lockout/tagout procedures, line breaking, confined space entry procedures, and hot work authorizations.  This procedure will also include clear steps to follow once the job is completed to provide closure for those that need to know the job is now completed and that equipment can be returned to normal.\n\nManagement of Change:\n\nTo properly manage changes to process chemicals, technology, equipment and facilities, High Plains Corp. has developed a management of change procedure.  This procedure is meant to prevent a possible catastrophic event.\n\nTo define change we are including all modifications to equipment, procedures, raw materials, and processing conditions other than \"replacement in kind\"\n\nThese changes will be properly managed by identifying and reviewing them prior to implementing them.  For example, the operating procedures contain the operating parameters (pressure limits, temperature ranges, flow rates, etc.) and the importance of operating within these limits.  While the operator must have flexibility to maintain safe operation within the established parameters, any operation outside of these parameters requires review and approval by a written management of change procedure.\n\nManagement of change also covers changes in process technology and changes to equipment and instrumentation.  A change in process technology can result from changes in raw materials, experimentation, new equipment, new product development, and changes in operating conditions to improve yield or quality.\n\nEquipment changes can be in materials of construction, equipment specifications, piping pre-arrangements, experimental equipment, computer program revisions, and alarms and interlocks.  High Plains Corp. has established means an"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 20422,
      "SummaryText": "d methods to detect both technical and mechanical changes.\n\nTemporary changes must have a time limit imposed, with procedures established and monitored to prevent these changes from becoming permanent.  In addition this will be used to ensure that all temporary changes are returned to their original or designed conditions at the end of the temporary change.  This documentation and review of these changes are invaluable in ensuring that safety and health considerations are incorporated into operating procedures and processes.\n\nHigh Plains Corp. has developed a \"check-list\" document to facilitate the processing of changes through the management of change procedures.  This change form includes; the description and the purpose of the change; the technical basis for the proposed change; impact of change on safety and health; documentation of changes for the operating procedures; maintenance procedures; inspection and testing; P&ID's; electrical classification; training and communications; pre-startup inspections; duration (if change is temporary); approvals, and authorization.  Where the impact of the change is minor and well understood, an abbreviated check-list and procedure, reviewed by an authorized person, with proper communication to others who are affected, may be used.\n\nFor more complex or significant design changes, a hazard evaluation procedure with approvals by operations, maintenance, and the safety department will be used. All changes in documents such as P&ID's, raw materials, operating procedures, mechanical integrity programs, and electrical classifications will be noted so that these revisions can be made permanent when the drawings and procedures manuals are updated.  Copies of process changes are kept in an accessible location to ensure that design changes are available to operating personnel as well as to the process hazard analysis team members when the process hazard analysis is being prepared or being updated.\n\nAll employees involved in operating a"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 20422,
      "SummaryText": " process, all affected maintenance personnel, and contract employees whose job tasks will be affected by a change in process will be informed of, and trained in, the change prior to start-up of the process or affected part of the process.\n\nIncident Investigation:\n\nThe intent of the High Plains Corp. incident investigation is to identify the underlying causes of these incidents and implement steps to prevent similar events from occurring.  We perform these incident investigations to learn from past experiences and thus avoid repeating past mistakes.  Incidents are events that are sometimes referred to as \"near misses,\" meaning that a serious consequence did not occur, but could have.  For this reason we intend to investigate all incidents and especially those which resulted in, or could have resulted in a catastrophic release of a highly hazardous chemical in the workplace.\n\nAll incident investigations will be promptly documented to and shall never be initiated later than 24 hours following the incident.  Time is of the essence when performing an incident investigation so that facts do not become confused with the passage of time.\n\nInitiation of the incident report is the responsibility of the supervisor in charge.\n\nEmployees in the process area where the incident occurs will be consulted and interviewed.  Their knowledge of the events represents a significant set of facts about the incident that occurred.  The cooperation of employees is essential to an investigation.  The focus of our investigation is to obtain facts, and not to place blame.  The investigation process will clearly deal with all involved individuals in a fair, open, and consistent manner.\n\nThe report prepared at the conclusion of the investigation will include the following at a minimum: Date of incident, time and date of investigation began, a complete description of the incident, all factors that contributed to the incident, and all recommendations resulting from the investigation.\n\nAll resolution"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 20422,
      "SummaryText": "s and corrective actions will be documented along with the report findings and recommendations.\n\nThe complete report will be reviewed with all affected personnel whose job tasks are relevant to the incident findings and include contract employees where applicable.\n\nAll incident investigation reports and data will be retained for five years and used when performing process hazard analysis, process hazard analysis updates and management of change reviews.\n\nEmergency Planning and Response:\n\nHigh Plains Corp. has developed an emergency action plan for the facility at York, Nebraska. These plans include emergency evacuation as per current OSHA guidelines (29 CFR 1910.38) All employees are trained regarding their responsibility in this plan when hired and annually thereafter.  Full details of the emergency action plan are maintained in the company safety manual, copies of which are accessible to all employees and contractors.\n\nCompliance Audits:\n\nHigh Plains Corp. will use compliance audits as a technique to gather sufficient facts and information, to verify compliance with current standards.  A team will be used to perform audits of the process safety management system and risk management program.  These audits will be conducted at least every three years to verify that the procedures and practices developed under this program are adequate and are being followed.\n\nAudit team members will be selected on the basis of their experience, knowledge, and training and are familiar with the processes and auditing techniques, practices, and procedures.  Team members will have expertise in process engineering and design; process chemistry; instrumentation and computer controls; electrical hazards and classifications; safety and health disciplines; maintenance; emergency preparedness;  and process safety auditing. The team will compare what is actually done or followed with the written PSM/RMP program.\n\nThe audit will include a review of the relevant documentation and process safety"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 20422,
      "SummaryText": " information, inspection of the physical facilities, and interviews with plant personnel.  The review will evaluate the written training program for adequacy of content, frequency of training, effectiveness of training in terms of its goals and objectives as well as how it fits into meeting the programs requirements.  Through interviews, the team will determine employee's knowledge and awareness of the safety procedures, duties, rules, and emergency response assignments.  During the inspection, the team will observe actual practices such as safety and health policies, procedures and work authorization practices.\n\nThe audit team, through its systematic analysis, will document areas that require corrective action as well as where the process safety management and risk management program system is effective.  This will provide a record of the audit procedures and findings and serves as a baseline of operational data for future audits.\n\nCorrective action includes identifying deficiencies, and planning follow-up, and documenting the corrections.  Corrective action will begin with a management review of the audit Findings.  The purpose of the management review is to determine what actions are appropriate, and to establish priorities, timetables, resource allocations and requirements, and responsibilities.  In some cases, corrective action may involve only a simple change in procedures or a minor maintenance effort to remedy the problem.  Management of change procedures will be used, as appropriate.  While many of these changes may be minor, some may require engineering studies or more detailed review of actual procedures and practices.  All actions taken, including an explanation when no action is taken on a finding will be documented.\n\nIncident History:\n\nHigh Plains Ethanol Inc., has not experienced an incident involving natural gasoline.\n\nRelease Scenarios:\n\nHigh Plains Corporation analyzed the impact of a worst case scenario and an alternative in compliance with the Ri"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 20422,
      "SummaryText": "sk Management Plan. The RPM * Corp modeling program was used.\n\nThe results of the worst-case model indicated a 1 psi endpoint of .3 miles.  This worst case scenario indicates that a catastrophic vapor cloud explosion could impact the City of Portales Hospital and the surrounding four industrial companies.  There are no environmental receptors within the .3 mile radius.\n\nThe results of the alternative scenario indicated a 1 psi endpoint of .1 miles.  There are no population or environmental receptors within the endpoint.  The primary use of the land in the vicinity is agricultural."
    }
  ]
}