{
  "FacilityID": 20427,
  "FacilityName": "SENA - Wisconsin Rapids Paper Mill",
  "FacilityStr1": "231 1st Avenue North",
  "FacilityStr2": null,
  "FacilityCity": "Wisconsin Rapids",
  "FacilityState": "WI",
  "FacilityZipCode": "54495",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55141",
  "LEPC": "Wood County LEPC",
  "FacilityLatDecDegs": "44.393889",
  "FacilityLongDecDegs": "-89.825",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.storaenso.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 149864860,
  "ParentCompanyName": "Stora Enso, Oyj.",
  "Company2Name": null,
  "CompanyDUNS": 6130777,
  "Company2DUNS": 0,
  "OperatorName": "Stora Enso North America Corp.",
  "OperatorStr1": "510 High Street",
  "OperatorStr2": null,
  "OperatorCity": "Wisconsin Rapids",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54495",
  "OperatorZipCodeExt": null,
  "FTE": 1106,
  "OtherEPAFacilityID": "54494CNSLD231FI",
  "EPAFacilityID": "100000059893",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Chlorine",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-11-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-11-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-11-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-05-05 00:00:00",
  "DeRegistrationEffectiveDate": "2003-12-31 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 44.39334,
  "FRS_Long": -89.82623,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 28644,
      "AltID": null,
      "FacilityID": 20427,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 37350,
          "ProcessID": 28644,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 29370,
          "ProcessID": 28644,
          "NAICSCode": "56221",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 15638,
              "Process_NAICS_ID": 29370,
              "SafetyReviewDate": "1999-02-01 00:00:00",
              "PHA_Date": "1999-02-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 1,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1993-06-21 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-02-01 00:00:00",
              "TrainingReviewDate": "1999-02-01 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-01 00:00:00",
              "EquipmentInspectionDate": "1999-04-29 00:00:00",
              "EquipmentTested": "chlorinator and vacuum system",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-02-01 00:00:00",
              "PreStartupReviewDate": "1999-02-01 00:00:00",
              "ComplianceAuditDate": "1999-02-01 00:00:00",
              "AuditCompletionDate": "1999-05-28 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-02-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-02-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-02-01 00:00:00",
              "ContractorSafetyEvalDate": "1999-02-01 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 22645,
                  "PreventionProgram3ID": 15638,
                  "ProcessChemicalID": 37350
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 20427,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-01-01 00:00:00",
    "ERTrainingDate": "1999-03-01 00:00:00",
    "CoordinatingAgencyName": "Wood County LEPC",
    "CoordinatingAgencyPhone": "7154218500",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20427,
      "SummaryText": "Stora Enso North America (SENA) is committed to operating in a manner that is safe for SENA workers, the public, and the environment.  As part of this commitment, SENA has established procedures to help ensure safe operation of the processes at its facilities.  SENA's Wisconsin Rapids Mill (Wisconsin Rapids) has developed a risk management program (RMP) that complies with the requirements of the Environmental Protection Agency's (EPA's) regulation 40 CFR Part 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule) and helps to manage the risks of the covered substances and processes.  One of the requirements of the RMP rule is to submit a risk management plan describing the risk management program at Wisconsin Rapids.  This document is intended to satisfy the risk management plan requirements of the RMP rule.\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nIn April 1967, Consolidated Papers, Inc. adopted a corporate environmental policy that guides the continuous improvement of its environmental performance as it strives to prevent pollution and achieve the objective of operating facilities with minimal environmental impact.  This policy was updated in November 1996.  On August 31, 2000 Consolidated Papers, Inc. was aquired by Stora Enso, Oyj. of Helsinki, Finland. SENA's environmental policy statement is publicly available on the Stora Enso Internet website.  As part of its risk reduction objective, SENA will strive to minimize environmental, health, and safety risks to its employees and the communities in which it operates by employing safe technologies and operating procedures.  SENA will be constantly prepared for emergencies.  SENA will continually inform its employees and public of its progress in safety and environmental issues.  \n\nSENA is one of 26 Wisconsin paper companies voluntarily participating in the Wisconsin Paper Council's Pollution Prevention Partnership with the Wisconsin Department of Natural Resou"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20427,
      "SummaryText": "rces.  As part of this membership, SENA produces an annual report that illustrates SENA and the Wisconsin paper industry's commitment to voluntarily reduce the release of substances that could have adverse environmental impacts.  SENA's Pollution Prevention Partnership Progress Report is available to the public.  \n\nSENA has also pledged to voluntarily align its corporate Environmental Management System to ISO 14001 international standards and to adhere to the American Forest and Paper Association's Environmental Health and Safety Principles.\n\n\nFACILITY DESCRIPTION AND THE REGULATED SUBSTANCES HANDLED\n\nSENA is a leading producer in North America of coated printing papers and a major manufacturer of supercalendered printing papers for the printing and publishing industries.  In addition, SENA is a leading manufacturer of coated specialty papers used in consumer product packaging and labeling.  SENA also produces elemental chlorine-free kraft pulp for its own use from virgin wood fiber and recycled pulp from printed and post-consumer wastepaper.  Other products manufactured by SENA include paperboard and paperboard products.\n\nStora Enso, Oyj. is domiciled in Helsinki, Finland. SENA, a wholly owned subsidiary of Stora Enso, Oyj., is based in Wisconsin Rapids, Wisconsin.  It operates paper and pulp manufacturing facilities in Biron, Kimberly, Appleton, Niagara, Stevens Point, Whiting, and Wisconsin Rapids, Wisconsin, as well as in Duluth, Minnesota.  It also operates wastewater treatment plants in Stevens Point, Niagara, Kimberly, and Wisconsin Rapids, Wisconsin to treat wastewater generated by the pulp and paper manufacturing plants.  Wastewater treatment is also done at the facilities in Duluth, Minnesota.\n\nWisconsin Rapids is a paper mill operated by SENA in Wisconsin Rapids, Wisconsin.  At this facility, heavier-weight groundwood-free coated printing paper, paperboard, and paperboard products are produced.  The coated paper product is used for brochures, advertising "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20427,
      "SummaryText": "inserts, corporate annual reports and brochures, catalogs, magazines, and other printed materials.  The paperboard is manufactured from recycled wastepaper.\n \nChlorine is the only chemical regulated by the RMP rule that is stored or handled at this facility in total quantities greater than or equal to the threshold quantities. The chlorine is stored in five aboveground cylinder tanks, each with a design capacity of one ton.  The total quantity of chlorine stored at this facility is 10,000 lb.  The chlorine tanks are located inside a building.  Chlorine is a toxic gas liquefied by pressure in the storage tank and is used to treat process water.\n\n\nWORST-CASE RELEASE AND ALTERNATIVE RELEASE SCENARIOS\n\nWorst-Case Release Scenario\n\nThe worst-case release scenario involving chlorine is defined as the rupture of one of the five chlorine storage tanks, instantaneously releasing its entire contents into the building.  The building enclosure contains the entire spill and reduces the release rate into the atmosphere.  The release rate from the building is based on the Environmental Protection Agency's (EPA) RMP Offsite Consequence Analysis Guidance document.  This scenario was modeled using the Dense Gas Dispersion (DEGADIS) model to predict the toxic endpoint.  The worst-case release of chlorine is predicted to have offsite impacts on public receptors.\n\nAlternative Release Scenario\n\nSince the worst-case release scenario predicted offsite impacts, an alternative release scenario involving chlorine is reported.  The alternative release scenario is defined as an indoor release of chlorine due to the failure of the tubing connecting the chlorine tank to the water chlorination process.  The total quantity of chlorine released into the building is 88.6 lb.  The building enclosure contains the entire spill and reduces the release rate into the atmosphere.  The release rate from the building is based on the EPA's RMP Offsite Consequence Analysis Guidance document.  This scenario was "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20427,
      "SummaryText": "modeled using the Areal Locations of Hazardous Atmospheres (ALOHA) model to predict the toxic endpoint.  The alternative release of chlorine is predicted to have no offsite impact on public or environmental receptors.\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nAs part of its environmental policy, SENA will continue to protect the environment and the health and well-being of employees and communities by monitoring existing facilities to ensure that they meet all legal requirements through the use of safe technologies and operating procedures.\n\nWisconsin Rapids complies with the prevention and emergency response procedures from all applicable regulations including certain applicable sections of RCRA and the Occupational Safety and Health Administration (OSHA) Emergency Action Plans (29 CFR 1910.38).\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThere have been no accidents at the Wisconsin Rapids Mill in the past five years that resulted in any adverse onsite or offsite impacts.\n\n\nEMERGENCY RESPONSE PROGRAM\n\nWisconsin Rapids' emergency response program includes a written Emergency Response Plan that discusses procedures to be followed in the case of a general emergency and specific procedures for the handling of chlorine spills to prevent and minimize the effects of an emergency involving this chemical. \n\nWisconsin Rapids' current Emergency Response Plan works with the Incident Command System.  The Incident Command System is designed to provide both public and private sector emergency response personnel with a logical building block system for managing hazardous material emergencies.\n\nThe system is designed to begin at the point where emergency response personnel recognize that they are in fact, dealing with a hazardous material emergency, even when the exact hazardous material has not be identified.\n\nThe local fire department is also trained to the Incident Command System and will join with the Wisconsin Rapids team members and co-command"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 20427,
      "SummaryText": " on an incident.\n\nThe Incident Command System identifies a chain of command in response situations.  It also identifies specific responsibilities for the various levels in that chain.  Wisconsin Rapids has trained incident commanders, specialists, and technicians.\n\nAdditionally, SENA has a Spill Reporting Policy that addresses the notification requirements in the event of an accidental release.  The Spill Reporting Policy also identifies contacts and notification responsibilities.\n\n\nPLANNED CHANGES FOR SAFETY IMPROVEMENTS\n\nThis facility will undergo regular scheduled maintenance and update to meet any new or revised applicable regulation and industry standard to continue to operate safely."
    }
  ]
}