{
  "FacilityID": 20574,
  "FacilityName": "Frozen Specialties, Inc.",
  "FacilityStr1": "720 Barre Road",
  "FacilityStr2": null,
  "FacilityCity": "Archbold",
  "FacilityState": "OH",
  "FacilityZipCode": "43502",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39051",
  "LEPC": "Fulton County LEPC",
  "FacilityLatDecDegs": "41.514722",
  "FacilityLongDecDegs": "-84.298056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 606147155,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Steve Dominick",
  "OperatorStr1": "720 Barre Road",
  "OperatorStr2": null,
  "OperatorCity": "Archbold",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43502",
  "OperatorZipCodeExt": null,
  "FTE": 170,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000167259",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-11-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-02-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-02-17 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-02-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-02-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.4",
  "FRS_Lat": 41.514753,
  "FRS_Long": -84.297879,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 28923,
      "AltID": "NH3 Refrigeration System",
      "FacilityID": 20574,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 37668,
          "ProcessID": 28923,
          "ChemicalID": 56,
          "Quantity": 18000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 29668,
          "ProcessID": 28923,
          "NAICSCode": "311412",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 15848,
              "Process_NAICS_ID": 29668,
              "SafetyReviewDate": "1999-11-08 00:00:00",
              "PHA_Date": "1999-11-11 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-01-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-12-29 00:00:00",
              "TrainingReviewDate": "1998-06-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-01-05 00:00:00",
              "EquipmentInspectionDate": "1999-01-05 00:00:00",
              "EquipmentTested": "All refrigeration equipment",
              "ChangeMgmtDate": "1999-03-10 00:00:00",
              "ChangeMgmtReviewDate": "1999-03-10 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-03-04 00:00:00",
              "HotWorkPermitReviewDate": "1998-03-31 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 22860,
                  "PreventionProgram3ID": 15848,
                  "ProcessChemicalID": 37668
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 20574,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-11-05 00:00:00",
    "ERTrainingDate": "1999-11-05 00:00:00",
    "CoordinatingAgencyName": "NONE",
    "CoordinatingAgencyPhone": "0000000000",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 20574,
      "SummaryText": "coil (EV-26), 50( crust storage cooler evaporators (EV-27 and EV-28), 40( cooler evaporators (EV-29 and EV-30), mixing area evaporator (EV-31), production area ventilation evaporator (EV-33), surge drum (V-11) for plate water chiller (EV-34), and shell and tube heat exchanger (EV-35). \n\nAt each evaporator (cheese room evaporator, meat preparation room evaporator, oven cooling coil, 50( crust storage cooler evaporators, 40( cooler, mixing area, and production area ventilation) liquid flows through the coils where it absorbs heat from the air, changing from a liquid to a vapor. High stage suction from these units is returned to the 10( intercooler and then to the high stage compressors.\n\nAt the plate water chiller (EV-34) Liquid ammonia from surge drum (V-11) is circulated through plates in the plate water chiller. Water is cascaded over the plates, and the ammonia absorbs heat, changing from a liquid to a vapor. The vapor rises first to the top of the plates, and then to the top of the surge drum. High stage suction from this unit is returned to the 10( intercooler (V-8) and then to the high stage compressors (HC-1, HC-2, and HC-7).\n\nAt the shell and tube heat exchanger (EV-35), Liquid ammonia is cascaded over coils containing water, the ammonia absorbs heat, changing from a liquid to a vapor. High stage suction from these units is returned to the 10( intercooler and then to the high stage compressors.\n\nHigh pressure liquid is fed from the high pressure receiver to the 10( intercooler. The liquid is fed through a sub-cooling coil at the intercooler. At this point the liquid becomes colder than it normally would be at that pressure. The high pressure sub-cooled liquid is then fed as liquid make-up, to -30( pump recirculator (V-2) and the -45( pump recirculator (V-6). \n\nAt the to -30( pump recirculator (V-2) low temperature recirculated liquid gravity drains to the pumper vessels (V-3 and V-4). They in turn pump the liquid to the; 35( cooler evaporator (EV-6),    -5("
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 20574,
      "SummaryText": "small freezer evaporators (EV-8, EV-9, EV-10, and EV-11), 50( shipping evaporator (EV-12), 35( cooler evaporator (EV-13), and -5( large freezer evaporators (EV-14, EV-15, EV-16, EV-17, EV-18, EV-20, EV-21, EV-22, and EV-23). This is accomplished using high pressure gas from the receiver (V-1) to push the liquid to the evaporators. At each evaporator (EV-6, EV-8, EV-9, EV-10, EV-11, EV-12, EV-13, EV-14, EV-15, EV-16, EV-17, EV-18, EV-20, EV-21, EV-22, and EV-23) liquid flows through the coils where it absorbs heat, changing from a liquid to a vapor/liquid mixture. Low temperature recirculated suction from the evaporators is returned to the -30( pump recirculator. At the -30( pump recirculator, low stage suction (vapor) is returned to the booster compressors (LC-4, LC-8, and LC-9). Booster compressor discharge is fed to the 10( intercooler.\n\nAt the to -45( pump recirculator (V-6) low temperature recirculated liquid is pumped to the West Spiral evaporators (EV-1, EV-2, EV-3, and EV-4) and East Spiral evaporator (EV-32). This is accomplished using mechanical pumps (RP-1 and RP-2). At each evaporator (EV-1, EV-2, EV-3, EV-4, and EV-32) liquid flows through the coils where it absorbs heat, changing from a liquid to a vapor/liquid mixture. Low temperature recirculated suction from the evaporators is returned to the -45( pump recirculator. At the -45( pump recirculator, low stage suction (vapor) is returned to the booster compressors (LC-3 and LC-10). Booster compressor discharge is fed to the 10( intercooler.\n\nAlso of note, the system contains an oil recovery system which recirculates the oil from the separators on compressors (LC-8, LC-9, and LC-10) to a oil recovery vessel (V-10). The oil is then pumped from oil recovery vessel (V-10) back to the compressors (LC-8, LC-9, and LC-10) by means of a mechanical oil pump (MP-1). \nDESCRIPTION OF THE WORST CASE RELEASE SCENARIO\n\nIn the worst case scenario the Receiver is penetrated. The amount of ammonia that can continue to be"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20574,
      "SummaryText": "on the basis of priority (Injuries to personnel). \n\nFrozen Specialties, Inc. also incorporates additional safety items such as tagging of all ammonia system valves and components. \n\nDESCRIPTION OF THE REFRIGERATION SYSTEM\n\nThe Frozen Specialties Inc. Facility in Archbold, Ohio is a Pizza Manufacturing Facility. The facility incorporates an Ammonia Refrigeration System which is a standard Compression and Evaporation Style System.\n\nAmmonia vapor from the 10( intercooler (V-8) is routed to the High Stage Compressors (HC-1, HC-2, and HC-7). The compressed vapor is fed to the evaporative condensers (EC-1, EC-2, and EC-3) and fed to the West Spiral evaporators (EV-1, EV-2, EV-3, and EV-4), Niagara unit (EV-5), 35( cooler evaporator (EV-6), -5( small freezer evaporators (EV-8, EV-9, EV-10, and EV-11), 50( shipping evaporator (EV-12), 35( cooler evaporator (EV-13), -5( large freezer evaporators (EV-14, EV-15, EV-16, EV-17, EV-18, EV-20, EV-21, EV-22, and EV-23), and East Spiral evaporator (EV-32) for hot gas defrost. The compressed vapor is used at the transfer vessel (V-9) to transfer liquid to the receiver. \n\nAt the evaporative condensers, heat is removed from the compressed gas converting it to high pressure liquid.  The high pressure liquid is then collected in the high pressure receiver (V-1).\n\nHigh pressure liquid is fed from the high pressure receiver (V-1) to the auto purger (P-1).  Vapor from the auto purger is then transferred to the 10( intercooler (V-8).  Any non-condensables in the vapor streams are removed periodically by a Hansen automatic gas purger (P-1).  The gas purger separates ammonia from the non-condensables by condensing the ammonia.  The condensed ammonia is sent to the 10( intercooler (V-8), and the non-condensables are piped to the water bubbler to remove any trace quantities of ammonia.\n\nHigh pressure liquid is fed from the high pressure receiver (V-1) to the; cheese room evaporator (EV-24), meat preparation room evaporator (EV-25), oven cooling"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 20574,
      "SummaryText": "expelled is the liquid that can gravity drain from the Evaporative Condensers to the Thermosyphon Vessels to the High Pressure Receiver.  The calculated amount of this release is approximately 2,500 lbs.\n\nThe Receiver is located outside, located inside an enclosed area to protect it from being impacted.  EPA's RMP*COMP (tm) calculated a release rate of 250 lbs. per minute and a release duration of ten minutes.  The Atmospheric Stability Class is F and the wind speed is 1.5 meters per second.  The topography around the facility is urban.\n\nRMP*COMP (tm) calculated a toxic radius of 0.60 miles.  Using LandView III (tm) it was determined that approximately 128 people live within this radius.  Also it was determined by the map generated using LandView III (tm) that there were only residents and industrial area receptors within the radius. The use of active mitigation devices include: Emergency shutdown systems.\n\n\nDESCRIPTION IF THE ALTERNATE RELEASE SCENARIO\n\nIn the alternate case scenario a recirclator package located outside of engine room with dikes (outside building walls 20 feet high on three sides is penetrated. RMP*COMP (tm) calculated the amount of this release to be approximately 3,700 lbs.  EPA's RMP*COMP (tm) also calculated a release rate of 370 lbs. per minute and a release duration of 10 minutes.  The Atmospheric Stability Class is D and the wind speed is 3.0 meters per second.  The topography around the facility is urban.\n\nRMP*COMP (tm) calculated a toxic radius of 0.10 miles.  Using LandView III (tm) it was determined that approximately 15 people within this radius.  Also it was determined by the map generated using LandView III (tm) that there were only industrial receptors are within the radius. The use of active mitigation devices include: Emergency shutdown systems.\n\n\nSUMMARY OF THE FIVE-YEAR ACCIDENT HISTORY\n\nFrozen Specialties, Inc. has had no accident(s) in the past five years involving ammonia.\n\n\nDESCRIPTION OF THE EMERGENCY RESPONSE PLAN\n\nIn the"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 20574,
      "SummaryText": "event that an ammonia leak is detected employees are to notify the onsite Engineer and Emergency Response Facilitator.  The facilitator takes an ammonia level reading using a detection device.  If the facilitator determines that the ammonia level is above 25 ppm an evacuation of the exposure area is ordered.\n\nThe engineer determines if the leak is serious enough that outside assistance is needed.  If outside assistance is needed the local HAZMAT organization is contacted.  Also Frozen Specialties, Inc. Emergency Response Team is contacted.  The engineers then take appropriate procedures, such as Emergency Shutdown Standard Operating Procedures, to control the leak with personal protective devices in place.\n\nOnce the Incident Commander arrives on scene, a report is given and the Incident Commander takes control of the situation.\n\nFrozen Specialties, Inc. is committed to continuous improvement of our policies, procedures, and facility. It is the intention of Frozen Specialties, Inc. to remain an industry leader. New technology, training techniques, and equipment are continuously being added to our system. \n\nAmong the improvements slated for completion in 1999 is an extensive operator training program, policy updates, additional emergency responder training, the addition of more safety equipment, cross training of maintenance and utility personnel, modifications to the ammonia detection system, and a complete Mechanical Integrity Inspection.\n\n\n\n\n\n\n\n1.0\tIntroduction\n\n\n\nFrozen Specialties Executive Summary.txt"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 20574,
      "SummaryText": "RMP Executive Summary\n\n\nFrozen Specialties, Inc. is proud to inform all interested parties that our company is complying with OSHA's Process Safety Management Standard (PSM), Title 29 Code of Federal Regulations 1910.119, and EPA's Risk Management Program regulations (RMP), Title 40 CFR Part 68.  In addition to other state and local codes applicable to our facility and process. We have undertaken this process to deal with the risks involved with the storage, handling, and use of Anhydrous Ammonia in our facility.\n\nOur goal is to promote overall worker, public, and plant safety.\n\nFrozen Specialties, Inc. is located at 720 Barre Road, Archbold, Ohio.  We manufacture and package frozen products.  The facility includes processing tanks, piping, packaging equipment, raw materials warehousing, finished goods refrigerated storage, an Ammonia refrigeration engine room, boilers, and miscellaneous utilities.  Also located at the facility is shipping and receiving docks.\n \nThe refrigeration system required for our production process necessitates the submission of this Risk Management Plan.  The refrigeration system contains 17400 pounds of anhydrous ammonia.  This surpasses the threshold quantity of 10,000 pounds outlined in Process Safety Management and Risk Management Program regulations.\n\nFrozen Specialties, Inc. has implemented numerous policies and procedures to enable our facility to prevent the occurrence, and minimize the consequences of significant releases of Anhydrous Ammonia as well as other hazardous substances, fires, explosions, and other types of catastrophic accidents.  Overall these programs prevent accidental fatalities, injuries, and illnesses and avoid property damage.\n\nOur safety programs prevent accidents because they focus on the rules, procedures, and practices that govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as necessary.  They are also communicated to and accepted by all employees at our fac"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20574,
      "SummaryText": "ility.\n\nFrozen Specialties, Inc. has organized the information and polices pertaining to the process into a complete library consisting of five numbered volumes, some volume numbers are assigned to sets of reference manuals, such as Operation and Maintenance manuals. \n\nVolume I of the PSM/RMP Library incorporates mainly policies, the following policies are included in Volume I:\n\nEmployee Participation Guidelines: This policy outlines the commitment between management and employees to establish a program for a successful (safe) program.\n\nProcess Safety Information: This includes information on the ammonia inventory at the facility, applicable codes, design standards, and information pertaining to the hazards of ammonia (referenced from the IIAR ammonia Data Book).\n\nProcess Hazard Analysis Program: This program outlines a thorough, orderly, systematic approach for identifying, evaluating, and controlling potential hazards within a process involving potentially hazardous chemicals such as ammonia.\n\nContractor Qualification Guidelines: This guideline has been established to verify that the contractors working in the facility are qualified to work on the system, trained in the hazards associated with their work, and made aware of the hazards presented by the facility to the employees of the contractor.\n\nManagement of Change and Pre-Startup Safety Review Programs: These programs have been developed to monitor and provide a checks and balances system to monitor changes in the facility and to verify that changes are safe and consistent with company policy.\n\nMany more specific programs and policies (Hot Work, Confined Space, Lockout / Tagout, Employee training, etc..) have been developed. For information specific to these see the Risk and Reliability Manager.\n\nVolume II incorporates information on the specific system components of the production area equipment. This information is used as a reference source for the operator to positively identify system components. This ma"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20574,
      "SummaryText": "nual also provides a checklist for performing the yearly Mechanical Integrity Inspection.\n\nVolume III incorporates a complete valve list, process and instrumentation diagrams, flow schematics, and other drawing pertinent to the production area equipment. The valve list contains information on the type, port size, identifying number, use, location, model, manufacturer, drawing reference, and normal operating position of each valve in the system. Process and Instrumentation Diagrams are included for the individual system components. Flow schematics are included showing the entire system. A Block flow diagram provides a brief overview of the system. Drawings are included showing symbol and abbreviation descriptions. Plan views are included to allow the operator to physically locate equipment in the building.\n\nVolume IV incorporates a complete set of standard operating procedures for the production area equipment. Describing the proper steps for preparing components for start-up, starting components, monitoring normal operation, shutting down as part of normal operation, restarting equipment as part of normal operation, shutting down equipment for maintenance, restarting equipment after maintenance, shutting down equipment in emergency situations, restarting equipment after an emergency situations shutdown, and pumpout procedures. Also included as a part of each Standard Operating Procedure is the Technical Operating Specifications for the associate system component. This information includes consequences of deviation from standard operating procedures.\n\nVolume V contains Operation and Maintenance Information for the production area equipment including manufactures information, spare parts list, maintenance procedures, and preventative maintenance procedures.\n\nProcess Hazard Analysis was performed in May 1997.  The PHA highlighted some deficiencies in the system. These items were addressed as part of the continuous improvement of the facility. These items were addressed"
    }
  ]
}