{
  "FacilityID": 20647,
  "FacilityName": "Royal Valley Fruit Growers Association",
  "FacilityStr1": "10881 S. Englehart",
  "FacilityStr2": null,
  "FacilityCity": "Reedley",
  "FacilityState": "CA",
  "FacilityZipCode": "93654",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": null,
  "FacilityLatDecDegs": "36.576111",
  "FacilityLongDecDegs": "-119.413611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A6",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Royal Valley Fruit Growers Assoc.",
  "OperatorStr1": "10881 S. Englehart",
  "OperatorStr2": null,
  "OperatorCity": "Reedley",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93654",
  "OperatorZipCodeExt": null,
  "FTE": 28,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000167446",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-15 00:00:00",
  "SafetyInspectionBy": "Mutual Service Insurance Co.",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-02-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-02-28 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP Pro 98",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-02-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-02-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.4",
  "FRS_Lat": 36.57724,
  "FRS_Long": -119.41297,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 29040,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 20647,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 37798,
          "ProcessID": 29040,
          "ChemicalID": 56,
          "Quantity": 17739.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 29786,
          "ProcessID": 29040,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 15919,
              "Process_NAICS_ID": 29786,
              "SafetyReviewDate": "2000-01-06 00:00:00",
              "PHA_Date": "2001-04-19 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-10-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Fork lift traffic impact",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Constant electronic monitoring & control",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Daily inspections",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Activation of pager alarm features, alternate roof isolation valve access",
              "OpProceduresReviewDate": "1999-11-29 00:00:00",
              "TrainingReviewDate": "1999-11-29 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-11-29 00:00:00",
              "EquipmentInspectionDate": "1999-10-04 00:00:00",
              "EquipmentTested": "Vessels, SRV's, piping, controls, evaporative condenser and evaporators.",
              "ChangeMgmtDate": "1999-10-22 00:00:00",
              "ChangeMgmtReviewDate": "1999-10-22 00:00:00",
              "PreStartupReviewDate": "1999-04-01 00:00:00",
              "ComplianceAuditDate": "1999-11-29 00:00:00",
              "AuditCompletionDate": "2001-05-14 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-10-22 00:00:00",
              "HotWorkPermitReviewDate": "1999-10-22 00:00:00",
              "ContractorSafetyReviewDate": "1999-11-29 00:00:00",
              "ContractorSafetyEvalDate": "1999-12-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 22936,
                  "PreventionProgram3ID": 15919,
                  "ProcessChemicalID": 37798
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 20647,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-11-22 00:00:00",
    "ERTrainingDate": "1999-05-14 00:00:00",
    "CoordinatingAgencyName": "Fresno Cnty Fire Protection Dist",
    "CoordinatingAgencyPhone": "5592686488",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 20647,
      "SummaryText": "ation of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected \nand serviced.  In addition, the plan is promptly updated to reflect any pertinent changes \ntaking place within our processes that would require a modified emergency response.\n\n7.\tPlanned Changes to Improve Safety\n\nSeveral developments and findings have resulted from the implementation of the various \nelements of our accidental release prevention program.  Redundant system isolation valve \naccess, valve labeling, more frequent relief valve replacement and daily walkthrough logs \nof important pressures are some of the major steps we want to take to improve safety at \nour facility.  These changes are expected to be implemented by 6/1/2000."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 20647,
      "SummaryText": "Executive Summary for Royal Valley Cold Storage\n\nIntroduction\nThis report and Risk Management Plan was developed to comply with US EPA and Cal \nARP requirements. Royal Valley Growers Association chose Cold Storage Technologies \nto review it¿s existing policy¿s, procedures, documentation and refrigeration system for \ncompliance with new requirements. After the review Royal Valley Growers Association \ndecided to choose to implement an Ammonia industry standard for regulation \ncompliance. The IIAR Guidelines provide Ammonia Refrigeration specific detailed \ntemplates that are customized for a specific facility. Resources used in the process were \nInternational Institute of Ammonia Refrigeration (IIAR) Guidelines and RMP Pro 98 \nOCA Software by Dyadem. \n\nExecutive Summary organization includes; Certification statement, Summary, Detailed \nElements and Map of Potential Impact. A current copy of RMP, PSM and PHA materials \ncan be reviewed at the facility by contacting Ken Suemoto. Since the materials consist of \nseveral 2 binders and facility drawings which are constantly updated as changes are \nimplemented, any reproduction becomes obsolete at the time of printing. \n\nPublication or sharing of OCA portions of RMP materials can be in violation of the \nChemical Safety Information, Site Security and Fuels Regulatory Relief Act (PL106-40). \nThis facility will not make specific RMP or OCA information available to the public until \na final ruling is made. General details only will be discussed at a required public meeting \nscheduled for 1/12/2000. Any accidental or authorized release of information in section \n2-5 by government officials violates Federal Law.\n\n1.\tAccidental Release Prevention and Emergency Response Policies\n\nWe at Royal Valley Fruit Growers Association are strongly committed to employee, \npublic and environmental safety.  This commitment is demonstrated by our use of \nIndustrial Refrigeration Contractors for all maintenance including remote system \nmonitoring in"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20647,
      "SummaryText": "addition to our comprehensive accidental release prevention program that \ncovers areas such as design, installation, operating procedures, maintenance, and \nemployee training associated with the processes at our facility.  It is our policy to \nimplement appropriate controls and perform preventative maintenance to prevent \npossible releases of regulated substances.\n\n2.\tThe Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities are consistent with SIC code 0723. Specific activities \ninclude washing, packing, pre-cooling and cold storage of grapes and tree fruit.  The \nflooded Ammonia refrigeration system provides 3 pre-coolers, 3 storage rooms 1 \nrefrigerated hallway/dock and a hydro-cooler.  Ammonia (anhydrous) refrigerant is the \nonly regulated substance present at our facility above thresholds requiring an RMP.  Total \nsystem NH3 capacity is estimated at 17,700 lbs..  Sulphur Dioxide seasonally used for \nfumigation is also present however quantities are under 300 lbs.\n\n3.\tThe Worst Case Release Scenario(s) and the Alternative Release \nScenario(s), including administrative controls and mitigation measures to \nlimit the distances for each reported scenario\n\nTo perform the required offsite consequence analysis for our facility, we have used the \nEPA's RMP Guidance for Ammonia Refrigeration Reference Tables or Equations. No \nspecific unusual external events were included due to the facilities rural location, remote \nequipment location and recent construction meeting all applicable seismic and safety \ncodes. Potential impacts by forklift or other facility traffic typical to this type of operation \nwere included. Any catastrophic type events would result in the same impacts as \npresented in this OCA or less. The following paragraphs provide details of the chosen \nscenarios. The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for Program 2 and 3 toxic substances as a class \ninvolv"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20647,
      "SummaryText": "es a catastrophic release from Ammonia Refrigeration .  In this scenario 10739 lb. \nof Ammonia (anhydrous) is released.  This is the combined capacity of the interconnected \nHigh Pressure Receivers.  The actual amount used for calculations was 15,000 lbs. since \nit was the closest table value available. The toxic liquid released is assumed to form a 1 \ncm deep pool from which evaporation takes place.  The entire pool is estimated to \nevaporate over 10 minutes.  Evaporation at this rate is required but very unlikely.  The \nreleased quantity has been limited to 61% of the maximum capacity of the source by the \nflooded refrigeration system design characteristics and limited HPR capacity.  At Class F \natmospheric stability and 1.5 m/s windspeed, the maximum distance of 1.42 miles is \nobtained corresponding to a toxic endpoint of 0.14 mg/L. Tree¿s surround the facility \nproviding an urban-like setting. Estimated population within this circle is 195. Population \nimpacted would be approximately 10% or less based on a plume footprint. This scenario \ndoes not represent historical performance of these types of refrigeration systems.\n\nThe alternative release scenario for Ammonia (anhydrous) involves a release from \nAmmonia Refrigeration .  The scenario involves the release of 3000 lb. of Ammonia \n(anhydrous).  Toxic liquid is assumed to be released to form a 1 cm deep pool from \nwhich evaporation takes place.  The entire pool is estimated to have evaporated after 30 \nminutes.  Under neutral weather conditions, an urban setting because of the surrounding \norchards, the maximum distance to the toxic endpoint of 0.14 mg/L of Ammonia \n(anhydrous) is 0.085 miles. Estimated public receptors are 17.. This alternate release \nscenario follows EPA guidelines for Ammonia refrigeration however it does not \nrepresent typical releases from a flooded Ammonia system.\n\n4.\tThe General Accidental Release Prevention Program and the \nChemical-Specific Prevention Steps\n\nOur facility has taken all t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20647,
      "SummaryText": "he necessary steps to comply with the accidental release \nprevention requirements set out under 40 CFR part 68 of the EPA.  This facility was \ndesigned and constructed in accordance with NFPA-58 Standard, 1967 Edition.  The \nfollowing sections briefly describe the elements of the release prevention program that is \nin place at our stationary source.\n\nProcess Safety Information\nRoyal Valley Fruit Growers Association maintains a detailed record of safety information \nthat describes the chemical hazards, operating parameters and equipment designs \nassociated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our \nprocesses are identified and controlled efficiently.  The methodology used to carry out \nthese analyses is What If/Checklist (combined).  The studies are undertaken by a team of \nqualified personnel with expertise in engineering and process operations and are \nrevalidated at a regular interval of 5 years.  Any findings related to the hazard analysis \nare addressed in a timely manner.  The most recent PHA/update was performed on \n10/21/1999.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Royal \nValley Fruit Growers Association maintains written operating procedures.  These \nprocedures address various modes of operation such as initial startup, normal operations, \ntemporary operations, emergency shutdown, emergency operations, normal shutdown \nand startup after a turnaround.  The information is regularly reviewed and is readily \naccessible to operators involved in the processes.\n\nTraining\nRoyal Valley Fruit Growers Association has a comprehensive training program in place \nto ensure that employees who are operating processes are competent in the operating \nprocedures associated with these processes.  Refresher training is provided at least every \n3 years and more frequently as needed.\n\nMechanical Integrity\nRoyal Valley Fruit Growers"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 20647,
      "SummaryText": "Association carries out highly documented maintenance \nchecks on process equipment to ensure proper operations.  Process equipment examined \nby these checks includes among others; pressure vessels, storage tanks, piping systems, \nrelief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance \noperations are carried out by qualified personnel with previous training in maintenance \npractices.  Furthermore, these personnel are offered specialized training as needed.  Any \nequipment deficiencies identified by the maintenance checks are corrected in a safe and \ntimely manner.\n\nManagement of Change\nWritten procedures are in place at Royal Valley Fruit Growers Association to manage \nchanges in process chemicals, technology, equipment and procedures.  The most recent \nreview/revision of maintenance procedures was performed on 11/29/1999.  Process \noperators, maintenance personnel or any other employee whose job tasks are affected by \na modification in process conditions are promptly made aware of and offered training to \ndeal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established \nprocesses are conducted as a regular practice at Royal Valley Fruit Growers Association.  \nThe most recent review was performed on 04/01/1999.  These reviews are conducted to \nconfirm that construction, equipment, operating and maintenance procedures are suitable \nfor safe startup prior to placing equipment into operation.\n\nCompliance Audits\nRoyal Valley Fruit Growers Association conducts audits on a regular basis to determine \nwhether the provisions set out under the RMP rule are being implemented.  The most \nrecent compliance audit was conducted on 11/29/1999.  These audits are carried out at \nleast every 3 years and any corrective actions required as a result of the audits are \nundertaken in a safe and prompt manner.\n\nIncident Investigation\nRoyal Valley Fruit Growers Association promptly investi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 20647,
      "SummaryText": "gates any incident that has \nresulted in, or could reasonably result in a catastrophic release of a regulated substance.  \nThese investigations are undertaken to identify the situation leading to the incident as \nwell as any corrective actions to prevent the release from reoccurring.  All reports are \nretained for a minimum of 5 years.\n\nEmployee Participation\nRoyal Valley Fruit Growers Association truly believes that process safety management \nand accident prevention is a team effort.  Company employees are strongly encouraged to \nexpress their views concerning accident prevention issues and to recommend \nimprovements.  In addition, our employees have access to all information created as part \nof the facility's implementation of the RMP rule, including information resulting from \nprocess hazard analyses in particular.\n\nContractors\nOur company hires contractors to conduct maintenance and construction activities.  Prior \nto selecting a contractor, a thorough evaluation of safety performance of the contractor is \ncarried out.  Royal Valley Fruit Growers Association has a strict policy of informing the \ncontractors of known potential hazards related the contractor's work and the processes.  \nContractors are also informed of all the procedures for emergency response should an \naccidental release of a regulated substance occur.\n\n5.\tFive-year Accident History\n\nRoyal Valley Fruit Growers Association has had an excellent record of preventing \naccidental releases over the last 5 years.  Due to our stringent release prevention policies, \nthere has been no accidental release during this period.\n\n6.\tEmergency Response Plan\n\nRoyal Valley Fruit Growers Association carries a written emergency response plan to \ndeal with accidental releases of hazardous materials.  The plan includes all aspects of \nemergency response including adequate first aid and medical treatment, evacuations, \nnotification of local emergency response agencies and the public, as well as post-incident \ndecontamin"
    }
  ]
}