{
  "FacilityID": 20657,
  "FacilityName": "MILLERS' AMMONIA, INC.",
  "FacilityStr1": "3389 GARDNER BARCLAY RD.",
  "FacilityStr2": null,
  "FacilityCity": "FARMDALE",
  "FacilityState": "OH",
  "FacilityZipCode": "44417",
  "Facility4DigitZipExt": "9738",
  "FacilityCountyFIPS": "39155",
  "LEPC": "Trumbull County LEPC",
  "FacilityLatDecDegs": "41.448333",
  "FacilityLongDecDegs": "-80.687778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "MILLER8088@AOL.COM",
  "FacilityDUNS": 123347049,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "RUSSELL E. MILLER",
  "OperatorStr1": "3389 GARDNER BARCLAY RD.",
  "OperatorStr2": null,
  "OperatorCity": "FARMDALE",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44417",
  "OperatorZipCodeExt": "9738",
  "RMPContact": "RUSSELL E. MILLER",
  "RMPTitle": "PRESIDENT",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000167464",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-19 00:00:00",
  "SafetyInspectionBy": "OHIO DEPARTMENT OF AGRICULTURE",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-03-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-02-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-02-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-02-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 41.44833,
  "FRS_Long": -80.68778,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 29071,
      "AltID": "ANHYDROUS AMMONIA",
      "FacilityID": 20657,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 29817,
          "ProcessID": 29071,
          "NAICSCode": "42291",
          "_desc": {
            "NAICS_CODE": "42291",
            "NAICS_DESCRIPTION": "Farm Supplies Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 37835,
          "ProcessID": 29071,
          "ChemicalID": 56,
          "Quantity": 270000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 537835,
          "ProcessID": 29071,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20657,
      "SummaryText": "                                                        EXECUTIVE SUMMARY\n\nMILLERS' AMMONIA, INC.   3389 Gardner Barclay Rd.   Farmdale, OH  44417\n\nFacility Description\n\nMillers' Ammonia, Inc. is a facility that receives, stores, transfers, and redistributes anhydrous ammonia for use as a fertilizer source for farm use.  Ammonia is received by truck, is handled and stored on site, and is redistributed into 1000 gallon or 1450 gallon tanks and sold to grower customers to be soil applied as a source of nitrogen fertilizer for growing agricultural crops.   The maximum quantity stored at any one time in stationary storage is 265,200 pounds or 51,000 gallons in four locked storage tanks.  \n\n\nAccidental Release Prevention Policy\n\nThe owners and employees of Millers' Ammonia, Inc. are committed to do everything possible to ensure that all business activities are completed with as little risk as possible.  All employees and management receive regular safety training to minimize any potential of a release when handling anhydrous ammonia due to human error.  The facility has implemented it's own written emergency response plan which is reviewed periodically.  We have also implemented any constructive suggestions from the county LEPC and the Ohio Department of Agriculture's Fertilizer Division to improve our safety agenda.\n\n\nWorst Case Release Scenario\n\nThe worst case scenario models the release of all the ammonia from the largest storage tank of 132,600 pounds in 10 minutes(30,000 gal tank @ 85% rated capacity @ 5.2 pounds per gallon).  Using The Fertilizer Institute's DEGADIS model for a rural environment, the distance to the endpoint (point of dispersion to 200 ppm) would have offsite impact.  It should be noted that a release of this nature is extremely unlikely because of routine testing, facility safety systems, daily inspections, and constant monitoring.\n\n \nAlternative Case Release Scenario\n\nThe alternate release scenario is based on a transfer hose failure while unload"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20657,
      "SummaryText": "ing a transport.  Assumptions made include: one half of the load is unloaded before hose failure, active mitigation of backcheck valves and excess flow valves contain all ammonia within the storage tanks, and remainder of load is lost (20,000 lb in 10 minutes).  The distance to the endpoint of 200 ppm in this scenario has the potential for offisite impact, depending on wind direction.  In both cases, the only area affected would be a narrow band downwind.  It should again be noted that a release of this nature is unlikely because of routine testing, facility safety systems, daily inspections, and constant monitoring.\n\n\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nMillers' Ammonia, Inc. has implemented the provisions of \"Safety Requirements of the Storage and Handling of Anhydrous Ammonia, K61.1\" published by the American National Standards Institute, Inc.(ANSI), and  the procedures for the  Storage and Handling of Anhydrous Ammonia as required by OSHA, 29 CFR 1910.111.  Our ammonia system is protected from major releases by internal excess flow valves, check valves, relief valves, and manual shutoff valves.  The load-out risers used for the purpose of filling the nurse tanks are protected by excess flow valves to immediately stop the flow of ammonia if a line or a hose fails.  All main storage tank valves are locked when not in use.\n\n\nFive Year Accident History\n\nThere have been no accidents involving anhydrous ammonia causing any deaths, injuries, property damage, or environmental damage, including evacuations on or offsite, in the past five years.  \n\n\nEmergency Response Program\n\nOur Emergency Response Plan is up to date and all current personnel have been trained in the procedures.  All new employees will receive training as necessary as part of their new employee orientation.  All agencies and emergency care providers have received training in the hazards associated with a release of anhydrous ammonia.\n\n\nPlanned Changes to "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20657,
      "SummaryText": "Improve Safety\n\nMillers' Ammonia, Inc. intends to continue to update training of all employees and local emergency response agencies in the areas of accident prevention and minimization of a loss in the event of a release.  We will continue to conduct self audits, inspections of equipment and procedures, and pre transfer inspections on a regular basis.  Through our inspection process and the insistence of maintaining equipment with Federal, State, and local agencies, the opportunity for accidental releases will have little chance of occurring."
    }
  ]
}