{
  "FacilityID": 20744,
  "FacilityName": "LIG Liquids Co. L.L.C. Gibson Plant",
  "FacilityStr1": "5609 Bayou Black Drive",
  "FacilityStr2": null,
  "FacilityCity": "Gibson",
  "FacilityState": "LA",
  "FacilityZipCode": "70356",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22109",
  "LEPC": "Terrebonne Parish LEPC",
  "FacilityLatDecDegs": "29.641083",
  "FacilityLongDecDegs": "-90.960417",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 799375837,
  "ParentCompanyName": "Louisiana Intrastate Gas Co. L.L.C.",
  "Company2Name": "American Electric Power Company, Inc.",
  "CompanyDUNS": 13881524,
  "Company2DUNS": 6979868,
  "OperatorName": "LIG Liquids L.L.C.",
  "OperatorStr1": "5609 Bayou Black Road",
  "OperatorStr2": null,
  "OperatorCity": "Gibson",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70356",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": "LA0932580",
  "EPAFacilityID": "100000126231",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "2880-00035-V0",
  "SafetyInspectionDate": "1999-11-03 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-03-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-03-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-03-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 29.64343,
  "FRS_Long": -90.96251,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 29182,
      "AltID": "Liquids Extraction",
      "FacilityID": 20744,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 37952,
          "ProcessID": 29182,
          "ChemicalID": 155,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 28995,
              "ProcessChemicalID": 37952,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 28996,
              "ProcessChemicalID": 37952,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 28997,
              "ProcessChemicalID": 37952,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 28998,
              "ProcessChemicalID": 37952,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 28999,
              "ProcessChemicalID": 37952,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 29000,
              "ProcessChemicalID": 37952,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 29001,
              "ProcessChemicalID": 37952,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 29921,
          "ProcessID": 29182,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 20744,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-06-10 00:00:00",
    "ERTrainingDate": "1999-05-10 00:00:00",
    "CoordinatingAgencyName": "Terrebonne Parish LEPC",
    "CoordinatingAgencyPhone": "5048685500",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20744,
      "SummaryText": "The accidental release prevention and emergency response policies at our facility:\n\nIn this gas processing plant, we handle natural gas and a mixture of ethane, propane, butane, and natural gasoline (our product). Because the Company recognizes that these substances are flammable and potentially dangerous, we assign the highest priority to protecting the safety and health of our employees, the community and the environment. Our policies follow the recommendations of the applicable industry recognized Codes and Standards, as well as the regulations of the Louisiana Department of Environmental Quality and the US Environmental Protection Agency. It is our policy to adhere to all applicable Federal and state rules and regulations. Safety depends on the manner in which we handle our products, combined with the safety devices inherent in the design of the facility and the training of our personnel.\n\nOur Process Safety Management Program emphasizes that safety and protection of the environment supercede production goals. The plant is designed with safety features that protect the plant from operational upsets and allow it to be safely shut down if necessary. \nWe have conducted operability studies to insure the safety of the process and manage changes in the process as they become necessary. Monthly safety meetings are held with our employees as well as prior to both planned and unplanned maintenance activities. We also have written procedures for maintenance that insures the isolation of potentially dangerous sources of energy. \n\n \nOur facility and the regulated substances we handle:\n\nThe purpose of this facility is to separate liquifiable hydrocarbons (ethane, propane, butane, and natural gasoline) from natural gas (methane). Our feedstock (natural gas) enters and leaves the plant via pipeline. The plant separates a mixture of these products from the gas stream and immediately transports them off site via a dedicated product pipeline. \n\nThis plant recovers these products "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20744,
      "SummaryText": "using a process known as cryogenic gas processing. The pressure of the gas stream is dropped across a turbo-expander, which removes heat in the form of work thereby lowering the gas temperature sufficiently to liquefy the desired product hydrocarbons. The liquid fraction is then stabilized to remove excess methane, and delivered to the product pipeline. The remaining methane vapor leaves the plant via a gas pipeline. \n\n\nThe maximum quantity of the single product on hand at any time is 1,200 lb.\n\nThe worst-case release scenario:\n\nThe \"worst case scenario\" accident has been established as the release of the entire volume of product at the plant at any one time. It is assumed that this entire quantity is released as a vapor, that it contacts an ignition source, and that 10% of the released quantity participates in the resulting explosion. Under this scenario, the distance to the endpoint of a 1.0-psi pressure wave is calculated to be 0.08 miles. There are no public receptors within this distance from plant. These assumptions and calculations were made using EPA guidelines and the EPA's computer program RMP*Comp which was designed for use in preparing this Risk Management Plan.\n\n\nOur general accidental release prevention program and chemical-specific prevention steps:\n\nOur facility is subject to the provisions of OSHA Regulations (Standards - 29CFR) Standard Number 1910.119, \"Process safety management of highly hazardous chemicals\". Under this Standard, we have invested significant effort in developing, implementing and continually reviewing several programs designed to insure a safe working environment and minimal risk of a release. These programs include a written plan to include employee participation, compilation of written process safety information including information pertaining to the highly hazardous chemicals present, and written operating procedures for normal, temporary and emergency conditions. We also maintain current piping and instrument diagrams and ma"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20744,
      "SummaryText": "intain the integrity of the relief system. We have conducted a process hazards analysis that we review a minimum of every five years and have in place a Management of Change Program and a documented employee training program. We also maintain a Mechanical Integrity Program that tracks the condition of our equipment.\n\nProcedures are in place for incident investigations. We have also developed an emergency response plan that has been coordinated with the Local Emergency Planning Commission.\n\n\nOur five year accident history:\n\nWe have had no accidents or accidental release of hazardous chemicals within the last five years.\n\nOur emergency response program:\n\nWe have written a specific Emergency Action Plan for this facility. This plan is reviewed with our employees on a regular basis. We hold monthly safety meetings that cover current topics as well as regular review of fire extinguisher and respirator use. Safety meetings are also held prior to both planned and unplanned maintenance events. Our plan has been reviewed with the LEPC and the local volunteer fire department.\n\n\nPlanned changes to improve safety:\n\nWe continually monitor our industry for information on how to conduct our business more safely. This includes changes in risk management philosophy as well as improved equipment designs and controls. Continual training of our employees also leads to improved safety."
    }
  ]
}