{
  "FacilityID": 20839,
  "FacilityName": "63rd Street Water Treatment Plant",
  "FacilityStr1": "5605 N. 63rd Street",
  "FacilityStr2": null,
  "FacilityCity": "Boulder",
  "FacilityState": "CO",
  "FacilityZipCode": "80301",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08013",
  "LEPC": "Boulder County LEPC",
  "FacilityLatDecDegs": "40.076667",
  "FacilityLongDecDegs": "-105.208611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Boulder",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Boulder",
  "OperatorStr1": "5605 N. 63rd Street",
  "OperatorStr2": null,
  "OperatorCity": "Boulder",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80301",
  "OperatorZipCodeExt": null,
  "FTE": 19,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000146889",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-10-06 00:00:00",
  "SafetyInspectionBy": "Fire Department (City of Boulder)",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-03-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-03-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-03-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-06-21 00:00:00",
  "DeRegistrationEffectiveDate": "2001-06-01 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.4",
  "FRS_Lat": 40.07686,
  "FRS_Long": -105.20686,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 29339,
      "AltID": "Disinfection",
      "FacilityID": 20839,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 38224,
          "ProcessID": 29339,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 30079,
          "ProcessID": 29339,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 11413,
              "Process_NAICS_ID": 30079,
              "SafetyReviewDate": "1999-06-09 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "Chlorine Institute",
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-09 00:00:00",
              "ChangeCompletionDate": "1999-06-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "None, first PHA",
              "OpProceduresReviewDate": "1999-01-14 00:00:00",
              "TrainingReviewDate": "1999-01-14 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-06 00:00:00",
              "EquipmentInspectionDate": "1999-06-07 00:00:00",
              "EquipmentTested": "Monthly Cl2 system inspection including feed system, monitoring system, scrubbers, SCBA, pigtails, etc.",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 11942,
                  "PreventionProgram2ID": 11413,
                  "ProcessChemicalID": 38224
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 20839,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-09-07 00:00:00",
    "ERTrainingDate": "1999-06-21 00:00:00",
    "CoordinatingAgencyName": "City of Boulder Fire Department",
    "CoordinatingAgencyPhone": "3034413350",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20839,
      "SummaryText": "INTRODUCTION AND OVERVIEW OF THE 63rd Street WTP AND REGULATED SUBSTANCES HANDLED\n\nThe United States Environmental Protection Agency (EPA) Risk Management Program (RMP) regulation, promulgated on June 20, 1996 under the Clean Air Act, requires facilities that have a regulated substance above the listed threshold quantities to develop a formal Risk Management Program (RMProgram) and to register and submit a Risk Management Plan (RMPlan).  The RMP rule regulates 140 chemicals for their toxic or flammable characteristics.  Of the chemicals regulated, one or more of the following typically triggers RMP requirements at water treatment plants (threshold quantities noted in parentheses):  chlorine (2,500 pounds), anhydrous ammonia (10,000 pounds), aqueous ammonia (20,000 pounds) and chlorine dioxide (1,000 pounds).  If any of these chemicals are handled, stored, or used above the threshold quantity, the water treatment plant (WTP) is subject to the RMP rule.  The City of Boulder's 63rd Street WTP uses chlorine above the 2,500 lb. threshold quantity and therefore must prepare a RMProgram.\n\nThe chlorine room is equipped to store ten, one-ton containers.  Eight chlorine cylinders are on scales (four per manifold) and hooked up to feed and the remaining two are on the floor on permanent trunnions.  The maximum chlorine inventory is 20,000 lbs..  Each manifold is equipped with a regulator, chlorine gas filter and a heat-traced trap leg and connected to an automatic switch-over valve.\n \nBelow is a brief summary of the 63rd Street WTP Risk Management Program.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe purpose of the RMP rule is to lesson the number of serious chemical accidents that could affect public health and the environment, and also to improve the response to those accidents that do occur and thereby reduce the severity of the chemical accident.  Operators and management at the 63rd Street WTP have several measures already in place, and have initiat"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20839,
      "SummaryText": "rological conditions:  (1) poor dispersion (worst-case release modeling), with class F air stability and a 1.5 m/s wind speed, and (2) typical dispersion (alternative release modeling) with class D air stability and a 3.0 m/s wind speed.  \n\nAir flow and dispersion conditions are complex in areas of mountainous terrain such as Boulder.  Atmospheric stability, wind speed, and plume trajectories vary rapidly with location and time.  Thus, wind and stability conditions monitored at a single point generally will not be representative of the flow and dispersion of a toxic cloud over its lifetime.\n\nTo address this complexity, historical meteorological records for multiple stations in and around Boulder were examined.  Six atmospheric flow/dispersion regimes were identified as dominant patterns for the area (corresponding initial wind speed used in the CAPERS model for each of these meteorological scenarios are shown in parentheses):\n\n     Stable nighttime downslope flow (3.0 m/s),\n     Unstable daytime upslope flow (2.0 m/s),\n     Stable, near-calm/variable flow (0.0 m/s),\n     High wind (Chinook) flow (18.0 m/s),\n     Morning transition from downslope to upslope flow (1.0 m/s), and\n     Evening transition from upslope to downslope flow (1.0 m/s).\n\nA representative example of each flow regime was chosen from historical meteorological records.  Then, the hypothetical release scenarios were modeled for each flow regime and the resulting concentration patterns evaluated.  Thus, the six flow regimes cover the spectrum of poor to good flow and dispersion conditions expected to occur in the Boulder area.\n\nBased on the results obtained from the CAPERS model, the worst-case release distance to toxic endpoint for chlorine is estimated to be 4.8 miles (evening transition flow).   Residential population within the estimated distance to end point for the plume area was estimated by using recent population density data provided by the City of Boulder that is representative of a rad"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20839,
      "SummaryText": "ed other measures as well,  to minimize the likelihood of an accidental chlorine release.\n\nAll operators at the WTP are trained in operating the chlorine process and follow all appropriate safety procedures.  Both management and staff are committed to ensuring safety at the WTP.  Training and safety meetings are held on a regular basis.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION MEASURES\n\nThe 63rd Street WTP facility follows all recommended safety, design, and operational and maintenance guidelines developed by the Chlorine Institute.  In addition, refresher training is routinely conducted.\n\nThe chlorine containers are stored in an enclosed building that meets 1994 Uniform Fire Code requirements, including the installation of a 1-ton chlorine scrubber.  The scrubber is connected to the chlorine room by a vent through the wall which has an intake approximately 6- to 8-inches off the floor.  The scrubber is activated upon alarm from the chlorine monitors, or can be manually started.  One chlorine monitor is located in the chlorine feed room and the other monitor is located in the 1-ton container storage room.  A third monitor is located in the exhaust stack of the chlorine scrubber to monitor scrubber performance.\n\nWORST-CASE AND ALTERNATIVE RELEASE SCENARIOS\n\nFor the 63rd Street WTP's chlorine process, the worst-case release quantity is 2,000 lbs., i.e. the capacity of a one-ton container.  As defined by the RMP rule, the worst-case release scenario for toxic gases (such as chlorine) to be modeled is:\n\nFor regulated toxic substances that are normally gases at ambient temperature and handled as a gas or as a liquid under pressure, the owner or operator shall assume that the quantity in the vessel or pipe, is released as a gas over 10 minutes.  The release shall be assumed to be the total quantity divided by 10 unless passive mitigation systems are in place.\n\nTherefore, the worst-case release rate for chlorine at the 63rd Street WTP is 20"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20839,
      "SummaryText": "0 lbs per minute.  Although the chlorine vessels are kept indoors, based on recommendations made in RMP guidance manuals, passive mitigation from the building was not included in the worst-case release scenario because the cylinders are unloaded outside the building upon delivery to the site and therefore the cylinders are some times outdoors.  As required, the worst-case scenario release was assumed to take place at ground level.  The toxic endpoint for chlorine for modeling the worst-case release is 0.0087 mg/L (3 ppm).   \n\nA site-specific model, The Computer Assisted Protective Action Recommendation System (CAPERS), was used to estimate the chlorine release distance to toxic endpoint.  The atmosphere in and around the mountainous terrain adjacent to Boulder, Colorado is complex and changeable.  Plume path and impact projections must reflect the non-linear flow and dispersion conditions in the region if they are to be useful in emergency planning and emergency response.  Recognizing the difficulty of this requirement, the Department of Energy (DOE) developed a specialized atmospheric dispersion model for use in areas-such as Boulder-with especially complex airflow patterns.  Called the Terrain-Responsive Atmospheric Code (TRAC), the computer program has been used for emergency plume predictions for more than nine years at the DOE's Rocky Flats Environmental Technology Site (RFETS), a nuclear weapons production facility near Denver, Colorado.  An updated version of the model, called CAPERS, suitable for application to chemical or radiological evaluations at any location has been applied to the City of Boulder's 63rd Street WTP to perform an off-site consequence analysis for chlorine gas.  The CAPARS model provides a variety of plume, weather, hazard, and related information with the accuracy and speed needed to support all levels of emergency management and response.\n\nThe Risk Management Plan Rule requires an evaluation of chemical events for a minimum of two meteo"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 20839,
      "SummaryText": "gency response operations.\n\nWhen an alarm sounds, the operator in charge, within one minute, will notify plant personnel via the P.A. system that he or she is checking on the alarm.  He or she will also specifically designate other plant personnel to call 911 if no follow-up page occurs within five minutes.  The operator in charge will then investigate to verify the alarm condition.  If it is a false alarm, or small controllable leak, the operator in charge will notify plant personnel that the situation is under control.  For this type of non-emergency controllable leak, two trained personnel plus a supervisor, from that point forward, must be present to do the leak repair and investigation.  The plant has written procedures that personnel are to follow for donning personal protection equipment and stopping and repairing the leak.  Under no circumstances will an employee act alone to correct a potentially hazardous chemical leak.  The proper authorities will be notified in the event more than the reportable quantity (2 lbs. Chlorine) is released.  The facility manager will designate an individual to call Local, State, and Federal authorities.\n\nIf the operator in charge discovers that the leak is uncontrollable, or a fire or flood, he or she will inform plant staff to stop work immediately and to assemble in the primary staging area (i.e. the Administration Building Lobby).  The operator in charge will then call a supervisor and 911.  A large (2,000 lb. or more) chlorine leak emergency will require Level A: Response by both the chemical supplier (DPC) and the Boulder County HAZMAT Team.  After the operations and staff/visitors are accounted for in the primary staging area, the on-scene response personnel may evacuate them, if necessary, to a secondary staging area.  The site plan, wind direction, and windsocks will be utilized to evacuate personnel to either a cross-wind or upwind location.\n\nAll personnel involved with an Emergency Response, are required to particip"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 20839,
      "SummaryText": "ate in a debriefing procedure that includes the following steps:  (1) evaluation of the effectiveness of the plan;  (2) the facility manager determining if the proper procedures were carried out;  (3) interviews of responders and follow-up non-responders;  (4) identification of response deficiencies, including items overlooked or non effective;  and (5) assembly of a planning team to review comments and make appropriate revision to the plan.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe primary changes that have been made as a result of implementing a RMProgram are greater staff and management awareness and commitment to safety."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 20839,
      "SummaryText": "ius around the facility of approximately 5 miles.  The population density is estimated at 800 persons per square mile.  Using a worst-case plume area of 1.2 square miles, the estimated residential population within this area is 960 persons.  Public receptors located within the boundary of any of the plume areas modeled (i.e. the 6 meteorological conditions described above), include:  residences, recreational areas, and schools.\n\nAlternative release scenarios are intended to reflect more likely releases than the worst-case release scenario.  Program 2 facilities, such as the 63rd Street WTP, are required to evaluate and present at least one alternative release scenario.  The alternative release scenario developed for the 63rd Street WTP was based on the failure of the 5/16-inch pigtail tubing connected to a single 1-ton chlorine container.  The release rate for chlorine vapor from the 5/16-inch tubing is 15 lbs. per minute (source:  Risk Management Program Guidance for Wastewater Treatment Plants, Exhibit 4-15).  It was assumed that the release would last a maximum of 60 minutes, giving a total chlorine release of 900 lbs.\n\nFor alternative release scenarios, both active and passive mitigation systems can be taken into consideration.  For this analysis, the chlorine scrubber at the 63rd Street WTP was included.  The scrubber has a 2,000 lb. capacity;  therefore, the release to the environmental in anticipated to be minimal and is not anticipated to migrate beyond the boundary of the site.  Thus, for our alternative release scenario, there is no estimated off-site distance to toxic endpoint.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe 63rd Street WTP has had no reportable accidental releases of chlorine in the past five years.\n\nEMERGENCY RESPONSE PLAN\n\nThe 63rd Street WTP has a written Emergency Response Plan that is routinely reviewed and amended.  The plant has a five-member safety committee that meets once per month.  The next few paragraphs provide a brief summary of the emer"
    }
  ]
}