{
  "FacilityID": 20874,
  "FacilityName": "Abbott Foods, Inc.",
  "FacilityStr1": "2400 Harrison Road",
  "FacilityStr2": null,
  "FacilityCity": "Columbus",
  "FacilityState": "OH",
  "FacilityZipCode": "43204",
  "Facility4DigitZipExt": "3508",
  "FacilityCountyFIPS": "39049",
  "LEPC": "Franklin County LEPC",
  "FacilityLatDecDegs": "39.970528",
  "FacilityLongDecDegs": "-83.066861",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.network1000.com/abbottfoodsinc",
  "FacilityEmailAddress": "revans@abbottfoods.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Abbott Foods, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 17892373,
  "Company2DUNS": 17892373,
  "OperatorName": "Abbott Foods, Inc.",
  "OperatorStr1": "2400 Harrison Road",
  "OperatorStr2": null,
  "OperatorCity": "Columbus",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43204",
  "OperatorZipCodeExt": "3508",
  "RMPContact": "Richard Evans",
  "RMPTitle": "Vice President, Operations",
  "FTE": 325,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000168356",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-12-20 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-03-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-03-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-03-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-03-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 39.97004,
  "FRS_Long": -83.065,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 29390,
      "AltID": "Refrigeration System",
      "FacilityID": 20874,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 30132,
          "ProcessID": 29390,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 38283,
          "ProcessID": 29390,
          "ChemicalID": 56,
          "Quantity": 22000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 538283,
          "ProcessID": 29390,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20874,
      "SummaryText": "THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nAbbott Foods is a family-owned business that provides food distribution and storage services for hospitals, schools, restaurants, and other commercial and professional facilities. Our Columbus facility is a cold storage plant located two miles northwest of the downtown business district.\n\nWe have 400 employees with an annual payroll of $17 million, paying about $31,000 in city and state taxes and $479,000 in county taxes annually. Each year, we buy about $15 million in goods and services, mainly from local suppliers, and pay about $460,000 for utilities.\n\nOur plant refrigeration system uses a chemical that brings us under the EPA Risk Management Program (RMP) Rule. This chemical is anhydrous ammonia, a common industrial refrigerant, which is listed as a toxic chemical under the RMP. The types of programs recently required by the RMP to prevent serious accidents and to plan emergency contingencies are not new to us at Abbott Foods. We have long understood the relationship between good safety and good business, as reflected by strong record and absence of significant ammonia releases.  Nevertheless, we welcome the EPA's RMP initiative and see it as an opportunity to continue and refine our safety and environmental programs.\n\nTHE ACCIDENTAL RELEASE PREVENTION PROGRAM AND EMERGENCY RESPONSE POLICIES AT THE STATIONARY SOURCE\n\nIt is the policy of Abbott Foods to meet and sometimes exceed all requirements established by applicable safety, health and environmental regulations promulgated by Federal and state agencies. Our policy is to maintain at a practical minimum the potential for harm to on-site employees and contractors, the public, and the environment, and to have in place contingency actions, coordinated with local responding agencies, for the unlikely event of a serious accidental ammonia release. We also participate in the EPCRA program.\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20874,
      "SummaryText": "PREVENTION STEPS\n\nAbbott Foods has in place a thorough, ongoing program of process safety management (PSM). This program calls for implementation and maintenance of procedural and engineered safeguards at the facility to minimize the likelihood of a significant release of ammonia, and to eliminate or reduce the effects of any release that might occur. We have invested and continue to invest substantial effort and capital in maintaining our strong safety performance.  For example, we have recently committed more than $1 million to updating refrigeration equipment and improving our computer-based control system.\n\nWe are involved in day-to-day safety-focused activities under our program that includes elements such as:\n\n(1) Process Hazard Analyses - we perform and maintain up to date a systematic and thorough study of our operations to identify what could go wrong, identify means of eliminating or reducing design or procedural weaknesses, and implementing improvements.\n\n(2) Process Design - our systems and equipment are designed for safety in accordance with applicable industry standards and best engineering practices. Designs include, as appropriate, automatic emergency shutdown systems, pressure relief devices, ventilation systems, and release sensoring systems. Our refrigeration system is computer-controlled (with operator back-up) which includes internal checks for abnormal conditions, emergency shutdowns, and alarm systems. Our storage vessels, which contain the greatest inventories of ammonia, are located indoors.\n\n(3) Training - our personnel and contractors are trained thoroughly on their job tasks, on safe work practices as they apply to their jobs, and on emergency contingency actions, before they may operate or maintain equipment. They also receive refresher training periodically. Our procedures for operating and maintaining our refrigeration system, general safe work practices, and emergency response, are fully documented and maintained up to date in light o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20874,
      "SummaryText": "f any changes at the facility.\n\n(4) Maintenance - Each item of equipment at our facility that is involved in maintaining safety or in responding to an abnormal situation is inspected, tested and/or maintained on a frequency that reflects its service and condition.\n\n(5) Management of Change - no change to equipment or procedural practices can take place at the facility without a thorough review of the implications of that change to safety. No change must adversely impact the safety built into the design and operations of our refrigeration system.\n\nOur PSM program is tuned to reflect the specific hazards of anhydrous ammonia. For example, our operating, maintenance, safe work, and emergency procedures address personal protective equipment appropriate to ammonia. Also, equipment is selected based on its intended service and chemical exposures, including release detection devices. \n\nTHE FIVE-YEAR ACCIDENT HISTORY\n\nWe have had no events at the Abbott Foods facility that would qualify for inclusion in the RMP 5-year accident history. In fact, we have never had a release of ammonia that was significant enough to be reportable.\n\nTHE EMERGENCY RESPONSE PROGRAM\n\nWe have in place a written emergency response plan that we coordinate with the Franklin County LEPC and the Columbus Fire Department.  New personnel are trained on the plan, we conduct refresher training, and we train on any revisions to the plan. The plan is in compliance with the RMP requirements, as well as applicable OSHA requirements.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nOur safety program is ongoing, involving the identification and implementation of numerous means of incremental safety performance. \n\nTHE WORST-CASE RELEASE SCENARIOS AND THE ALTERNATIVE RELEASE SCENARIOS\n\nUnder the RMP Rule we have considered a worst case scenario (WCS). We believe this WCS to be extremely unlikely to occur. It involves spontaneous, catastrophic failure of our largest storage vessel containing ammonia. Based on use of the EPA Off"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20874,
      "SummaryText": "site Consequence Analysis modeling tools, this scenario is determined to have offsite impact. A more credible scenario, called an alternative release scenario (ARS), was also analyzed.\n\nAs required by the RMP Rule, we chose a hypothetical ARS that is severe enough to have effect beyond our fenceline. The selected ARS is highly unlikely, and guarded against by our Process Safety Management program. In this hypothetical ARS, a portion of piping containing ammonia develops a significant leak. This scenario is guarded against by our mechanical integrity program that involves routine inspections of any piping that would at any time contain ammonia.  We assume very pessimistically that it would take the operator up to 10 minutes to isolate the leakage point. Based on use of the EPA Offsite Consequence Analysis modeling tools, released ammonia vapor is predicted to travel marginally beyond our fenceline before dissipating to concentrations below the RMP threshold of concern.  \n\nThis and similar scenarios will continue to be extremely unlikely because of our strong program of process safety. We have received a Green Buckeye Award from the Bureau of Underground Storage Tanks Registration for our safety/environmental performance."
    }
  ]
}