{
  "FacilityID": 20933,
  "FacilityName": "Buckbee-Mears Cortland",
  "FacilityStr1": "30 Kellogg Road",
  "FacilityStr2": null,
  "FacilityCity": "Cortland",
  "FacilityState": "NY",
  "FacilityZipCode": "13045",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36023",
  "LEPC": "Cortland County LEPC",
  "FacilityLatDecDegs": "42.591667",
  "FacilityLongDecDegs": "-76.161944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6175020,
  "ParentCompanyName": "BMC Industries, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6175020,
  "Company2DUNS": 0,
  "OperatorName": "Buckbee-Mears Cortland",
  "OperatorStr1": "30 Kellogg Road",
  "OperatorStr2": null,
  "OperatorCity": "Cortland",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13045",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jill A. Freidmutter, P.E.",
  "RMPTitle": "E & S Superintendent",
  "FTE": 750,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000136202",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-12-10 00:00:00",
  "SafetyInspectionBy": "U.S. DOT",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-04-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-04-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-04-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-06-14 00:00:00",
  "DeRegistrationEffectiveDate": "2004-06-01 00:00:00",
  "AnniversaryDate": "2005-04-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 42.56808,
  "FRS_Long": -76.12596,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 29467,
      "AltID": "Cl2 storage and supply",
      "FacilityID": 20933,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 30210,
          "ProcessID": 29467,
          "NAICSCode": "332812",
          "_desc": {
            "NAICS_CODE": "332812",
            "NAICS_DESCRIPTION": "Metal Coating, Engraving (except Jewelry and Silverware), and Allied Services to Manufacturers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 38367,
          "ProcessID": 29467,
          "ChemicalID": 62,
          "Quantity": 720000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 538367,
          "ProcessID": 29467,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20933,
      "SummaryText": "\nThis Risk Management Plan (RMP) was prepared for the purpose of demonstrating compliance with the requirements of Section 112(r)(7) of the Clean Air Act (CAA) pursuant to the United States Environmental Protection Agency (USEPA) regulations contained in Part 68 of Code 40 of the Federal Regulations (40 CFR 68), Sections 68.1-68.220, Accidental Release Prevention Provisions.\n\n\n\n40 CFR 68 requires stationary sources with listed substances present in a quantity greater than the corresponding threshold quantity to develop and implement a risk management program that includes a hazard assessment, a management system, a prevention program, and an emergency response program.  At the Buckbee-Mears Cortland (BMC) facility, chlorine, which is a listed substance, is stored in a quantity greater than the threshold quantity of 2,500 pounds (lb).\n\n\n\nThe RMP was prepared in accordance with 40 CFR 68, Subpart G, 68.150-68.190.  In accordance with 40 CFR 68.10(d)(2), since chlorine is subject to the Process Safety Management (PSM) standard (29 CFR 1910), Prevention Program 3 requirements apply to these operations.\n\n\n\nA hazard assessment consisting of one worst-case release scenario and one alternative release scenario for chlorine was completed for BMC.  The hazard assessment was conducted in accordance with 40 CFR 68, as well as guidance provided by USEPA's RMP Offsite Consequence Analysis (OCA) Guidance Document.\n\n\n\nThe Cortland facility manufactures aperture masks that are sold to the television and computer industries.  The chlorine is received in 90-ton railcars.  The chlorine is stored as a liquid under pressure.  From the railcars the chlorine is transferred to chlorine vaporizers, pressure reduction equipment and then to the aperture mask production lines for regeneration of ferric chloride etchant.\n\n\n\nIn accordance with 40 CFR 68.25(a)(2), BMC is required to analyze and report in the RMP the results of one worst-case and one alternative release scenario for the chlorine st"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20933,
      "SummaryText": "orage and supply operations.  In accordance with 40 CFR 68.25(b)(1), the basis for the worst-case release scenario is defined as the release of the greatest amount held in a single vessel.  For the Cortland facility, the single largest chlorine vessel is a 90-ton railcar.  Since chlorine exists as a gas at ambient conditions, it is assumed that the entire contents of the railcar, approximately 180,000 pounds, would be released as a gas over a 10-minute period.  The distance to the toxic endpoint as defined by USEPA would reach offsite endpoints and public receptors.\n\n\n\nThe alternative release scenario for chlorine is defined as the failure of a chlorine transfer hose.  A release such as this would result in the release of the contents of the transfer hose.  The distance to the toxic endpoint as defined by the USEPA would reach offsite endpoints and nearby public receptors.\n\n\n\nThe Chlorine Institute provides the basis of design for BMC's chlorine storage and supply system.  Personnel responsible for operating and maintaining this system have been trained in the hazards of the system, how to avoid or correct unsafe conditions, and in written procedures.  The procedures were prepared in accordance with Process Safety Management requirements and 40 CFR Part 68 requirements.  Refresher training, both in the classroom and on the job, is provided every three years from the date of last training.\n\n\n\nPeriodic inspections of the chlorine storage and supply system are conducted.  The frequency of these inspections is based on the manufacturer's and Chlorine Institute's recommendations, and may be more frequent based on facility experience and schedule.\n\n\n\nNo accidental releases of chlorine resulting in deaths, injuries, or significant property damage on site or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage have occurred at the Cortland facility in its twenty-four year history.\n\n\n\nThe Cortland facility has an existing"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20933,
      "SummaryText": " emergency response plan that incorporates emergency response and coordination procedures for chlorine.  The fire department and local emergency planning committee are included in this contingency plan.  The Cortland facility is also part of the Cortland County Emergency Response Plan.\n\n\n\nBMC is committed to ongoing improvements and implementation of additional safety measures as appropriate and as they become available.\n\n"
    }
  ]
}