{
  "FacilityID": 21183,
  "FacilityName": "A-Carb, LLC",
  "FacilityStr1": "One Carbon Way",
  "FacilityStr2": null,
  "FacilityCity": "Walton",
  "FacilityState": "KY",
  "FacilityZipCode": "41094",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21015",
  "LEPC": "Northern Kentucky LEPC",
  "FacilityLatDecDegs": "38.925",
  "FacilityLongDecDegs": "-84.608333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "WWW.A-CARB.COM",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Messier - Bugatti",
  "Company2Name": "SNECMA",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "A-Carb, LLC",
  "OperatorStr1": "One Carbon Way",
  "OperatorStr2": null,
  "OperatorCity": "Walton",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "41094",
  "OperatorZipCodeExt": null,
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000169051",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-02-01 00:00:00",
  "SafetyInspectionBy": "Fire Dept./State Fire Marshall",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-04-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-04-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-04-24 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-04-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.4",
  "FRS_Lat": 38.922778,
  "FRS_Long": -84.610556,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 29779,
      "AltID": "CVI Process",
      "FacilityID": 21183,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 38704,
          "ProcessID": 29779,
          "ChemicalID": 98,
          "Quantity": 101640.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 30542,
          "ProcessID": 29779,
          "NAICSCode": "336413",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 16309,
              "Process_NAICS_ID": 30542,
              "SafetyReviewDate": "2000-03-30 00:00:00",
              "PHA_Date": "1999-12-17 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-04-30 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-01-28 00:00:00",
              "TrainingReviewDate": "1999-12-17 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-01-28 00:00:00",
              "EquipmentInspectionDate": "2000-03-25 00:00:00",
              "EquipmentTested": "Entire propane system (inspected by propane installation contractor)",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2000-03-31 00:00:00",
              "PreStartupReviewDate": "2000-03-25 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-03-31 00:00:00",
              "HotWorkPermitReviewDate": "2000-03-31 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2000-03-31 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 23439,
                  "PreventionProgram3ID": 16309,
                  "ProcessChemicalID": 38704
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 21183,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-03-31 00:00:00",
    "ERTrainingDate": "1999-11-11 00:00:00",
    "CoordinatingAgencyName": "Walton Fire Department",
    "CoordinatingAgencyPhone": "6064857439",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 21183,
      "SummaryText": "related offsite impacts on businesses, special facilities, and the public from this alternative release scenario.  No residences were identified in the radius.  The following off-site facility is within the 0.155 mile radius:  \n\nDurobag Mfg. Co - to the southwest.\n\nAlternative Release Scenario #2:\n\nIf a driver fails to remove the hoses between the storage tank and the transfer vehicle before moving the vehicle, a pull-away may occur.  This pull-away will most likely cause the hose to rupture.  It will be assumed in this case, that the transfer vehicle will be using an unloading hose 4 inches in diameter and 25 feet long.  In addition, it will be assumed that the active mitigation devices will operate as designed, which will limit the release to the propane held in the hose.  These assumptions is based on the pull-away example in Appendix 2A of EPA's RMP Guidance for Propane Storage Facilities.  The volume of the hose will be calculated to determine the pounds of propane released.  Equation C-1 from EPA's OCA Guidance will then be used to determine the distance exposed to greater than 1 psi overpressure during the potential explosion.\n\nBased on this equation, the greatest distance to endpoint for a pull-away explosion is 0.033 mile or 174.8 feet.  No  residences or off-site facilities were identified in the radius.\n\nThe facility has never experienced a reportable release of propane and has had no need to use the emergency procedures.  Actions taken under the RMP prevention program and implementation of the PSM program are likely to further minimize the potential for a contingency requiring a response."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 21183,
      "SummaryText": "The A-Carb facility in Walton, Kentucky will manufacture aircraft brake pads using carbon vapor infiltration (CVI) for depositing graphite on a prepared carbon fibres substrate.  The facility will begin production in mid-April 2000.  Propane gas is a reactant in the process.  Brake pad blanks are carbonized in furnaces equipped with a thermal oxidizer and a mixture of propane and natural gas circulated to deposit graphite on the substrate.  The remaining natural gas and off-gases are routed to a boiler.\n\nThe propane system at A-Carb includes a 30,000-gallon liquid propane tank, two vaporizers, mixture of propane gas with natural gas (5% propane to 95% natural gas), and injection of the propane/natural gas mixture into CVI furnaces.  \n\nThe propane system at A-Carb includes the following equipment:\n\n·Truck Transport Unloading Station\n·One 30,000-gallon Propane Storage Tank\n·Two LGL 1.25 Propane Pumps\n·Two TF-300 Propane Vaporizers\n·One Control Panel at the Propane Storage Area\n·Piping, Control Valves, Safety Valves, and Instruments\n·Propane Gas Detectors\n·Gas Chromatograph\n\nA-Carb is subject to Process Safety Management (PSM) requirements under 29 CFR 1910.119.  A-Carb has established a program for process safety management of the propane system, including pre-start-up safety reviews, process hazard analyses, contractor safety, operating procedures, incident reporting, training, mechanical integrity and management of change.  Equipment was installed by a certified contractor and was designed/built to National LP Gas Code NFPA 58, ASME and NEC 70 standards.  Liquid propane lines, gas propane lines, the propane storage tank and the vaporizer unit are equipped with safety relief devices.  Process safety information is maintained at the site.  \n\nThe environmental, health and safety policy at A-Carb is to purchase, manufacture, ship and dispose of its materials in a manner to protect the environment and the health and safety of its employees, customers and the public.  A-C"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21183,
      "SummaryText": "arb has established a program for the prevention of accidents and improvements to health and the environment as described in the facility's heath & safety plan, environmental compliance manual and emergency response plan.  A-Carb has coordinated with the local fire department for emergency preparedness and response.  \n\nBased on the amount of propane in storage, A-Carb is also required to comply with the Clean Air Act's Section 112(r) chemical accident prevention and response requirements.  The applicable regulations are promulgated in Title 40 Code of Federal Regulations (CFR) 68 requiring preparation and implementation of a Risk Management Plan (RMP).  The regulations have also been adopted by the Commonwealth of Kentucky by reference under Title 401 Chapter 68 of the Kentucky Administrative Regulations (KAR).  \n\nUnder the RMP requirements, A-Carb has conducted a hazard assessment for a worst-case scenario and an alternate release scenario.  EPA has defined the worst-case scenario as the release of the largest quantity of a regulated substance from a single vessel or process line failure that results in the greatest distance to an endpoint.    Program 3 processes are required to analyze one worst-case scenario that is estimated to create the greatest distance in any direction to an endpoint defined in 68.22(a) resulting from an accidental release of regulated flammable substances from covered processes under worst-case conditions (40 CFR 68.25(a)(2)(ii)).  A concentration of a toxic material or a condition relating to explosion (pressure wave) or fire (radiant heat) from a flammable material release are referred to as endpoints.   \n\nThe worst case release scenario required for flammable substances shall assume  that the quantity of the substance...vaporizes resulting in a vapor cloud explosion.  A yield factor of ten percent of the available energy released in the explosion shall be used to determine the distance to the explosion endpoint if the model used is b"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21183,
      "SummaryText": "ased on TNT- equivalent methods (40 CFR 68.25(f)).  The propane release scenario will assume vapor cloud explosion based upon a 10 percent yield factor of the available energy in the release quantity.  The endpoint for propane used in A-Carb's worst-case scenario will be a 1 pound per square inch (psi) overpressure.  An overpressure of 1 psi may cause partial demolition of houses, which can result in serious injuries to people, and shattering of glass windows, which may cause skin laceration from flying glass. \n\nEPA's OCA Guidance was used to determine the greatest distance to the explosion endpoint.  Reference Table 9 in Section 5.0 of this guidance document provides distances to 1 psi overpressure for a range of quantities.  The distances on this table were estimated using Equation C-1 in Appendix C, Section C.1.  This equation was used directly to calculate the worst-case consequence distance for a propane explosion from this plant.  \n\nThe worst-case scenario of vapor cloud explosion is based on the assumption that only one tank is affected.  The largest capacity of a single tank will be used for the scenario- 30,000 gallons.  The quantity of propane stored in one tank is based on the estimation method described in Chapter 1 of EPA's Risk Management Program Guidance for Propane Storage Facilities.  The guidance uses a multiplier of 3.696 to convert the tank's nominal water capacity in gallons to pounds of commercial propane at 60 degrees Fahrenheit.  The multiplier is based on the density of commercial propane (4.20 pounds per gallon) multiplied by the maximum permitted liquid volume (88% at 60°F).  The maximum capacity, 30,000 gallon, storage tank at A-Carb has a nominal water capacity of 27,500 gallons.  Using the multiplier, the maximum amount of propane stored is 101,640 pounds.  \n\nThe maximum amount of propane stored in one of the propane tanks, a yield factor of 10 percent, and propane's heat of combustion were used in Equation C-1 to determine the wor"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21183,
      "SummaryText": "st-case consequence distance.  Based on this equation, the greatest distance to endpoint for the explosion of the 30,000 gallon tank is 0.377 mile.  This distance is then used to determine the related offsite impacts on businesses and the public.  No residences were identified in the radius.   The following facilities are within the 0.377 mile radius:  \n\nWillamette Industries Warehouse - to the west\nDurobag Mfg. Co - to the southwest.\n\nThe remaining area within the radius is primarily farmland.\n\nThe regulations require that a release scenario which may be more likely, and have less impact than the worst-case be developed for propane.  These additional scenarios are called alternative release scenarios. Some of the types of alternative releases that may be considered include transfer hose spills, valve or pump seal failure, or tank overfilling.  Active and passive mitigation and release controls will be considered.  \n\nA-Carb considered two alternative release scenarios for the propane storage area.   Each of these scenarios will assume a vapor cloud explosion and an overpressure of 1 psi.\n\nAlternative Release Scenario #1:\n\nThe first alternative release scenario is a valve failure resulting in a 1/4 inch stream of propane escaping from one of the pipes located in the propane storage area.  The amount of propane released in pounds per minute is estimated using the equation for process piping breaks in Appendix 2A of EPA's RMP Guidance for Propane Storage Facilities.  Due to process alarms and regular observation of the propane storage area by A-Carb personnel, the release is assumed to last no longer than 60 minutes.  Equation C-1 from EPA's OCA Guidance is then used to determine the distance exposed to greater than 1 psi overpressure during the potential explosion from the propane release.  \n\nBased on this equation, the greatest distance to the endpoint for an explosion caused by this type of propane release is 0.155 mile.  This distance is then used to determine the"
    }
  ]
}