{
  "FacilityID": 2118,
  "FacilityName": "GFC Foam, LLC",
  "FacilityStr1": "25 Jaycee Drive",
  "FacilityStr2": null,
  "FacilityCity": "West Hazleton",
  "FacilityState": "PA",
  "FacilityZipCode": "18201",
  "Facility4DigitZipExt": "0000",
  "FacilityCountyFIPS": "42079",
  "LEPC": "Luzerne County LEPC",
  "FacilityLatDecDegs": "40.9775",
  "FacilityLongDecDegs": "-76.0225",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 942641960,
  "ParentCompanyName": "General Foam Corporation, Inc.",
  "Company2Name": "NA",
  "CompanyDUNS": 942626607,
  "Company2DUNS": 0,
  "OperatorName": "GFC Foam, LLC",
  "OperatorStr1": "25 Jaycee Drive",
  "OperatorStr2": null,
  "OperatorCity": "West Hazleton",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "18201",
  "OperatorZipCodeExt": "0000",
  "RMPContact": "David P. Lichard",
  "RMPTitle": "President",
  "FTE": 200,
  "OtherEPAFacilityID": "PAD003037132",
  "EPAFacilityID": "100000025554",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "TV40-00023",
  "SafetyInspectionDate": "1999-04-22 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-09-28 00:00:00",
  "DeRegistrationEffectiveDate": "2004-07-22 00:00:00",
  "AnniversaryDate": "2004-06-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 40.97681,
  "FRS_Long": -76.02225,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2328,
      "AltID": "Plant #2 FP and RR Unload",
      "FacilityID": 2118,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2378,
          "ProcessID": 2328,
          "NAICSCode": "32615",
          "_desc": {
            "NAICS_CODE": "32615",
            "NAICS_DESCRIPTION": "Urethane and Other Foam Product (except Polystyrene) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 2480,
          "ProcessID": 2328,
          "ChemicalID": 77,
          "Quantity": 639000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 77,
            "ChemicalName": "Toluene diisocyanate (unspecified isomer)  [Benzene, 1,3-diisocyanatomethyl-]",
            "CASNumber": "26471-62-5",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502480,
          "ProcessID": 2328,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 2329,
      "AltID": "Plant #4 FP and Truck Unl",
      "FacilityID": 2118,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2379,
          "ProcessID": 2329,
          "NAICSCode": "32615",
          "_desc": {
            "NAICS_CODE": "32615",
            "NAICS_DESCRIPTION": "Urethane and Other Foam Product (except Polystyrene) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 2481,
          "ProcessID": 2329,
          "ChemicalID": 77,
          "Quantity": 534000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 77,
            "ChemicalName": "Toluene diisocyanate (unspecified isomer)  [Benzene, 1,3-diisocyanatomethyl-]",
            "CASNumber": "26471-62-5",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502481,
          "ProcessID": 2329,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2118,
      "SummaryText": "In accordance with EPA Risk Management Program regulations (40 CFR 68), GFC Foam, LLC-West Hazleton, PA facility has implemented an Accidental Release Prevention program.\n\nThe facility manufactures flexible polyurethane foam by mechanical mixing of polyol resins with TDI along with water, catalysts, surfactants and other chemical constituents. The resultant polymeric network is expanded with carbon dioxide formed from the reaction between the water and TDI.\n\nThe facility stores and uses quantities of Toluene Diisocyanate (mixed isomers) in excess of the threshold quantities specified in 40 CFR 68.115, which is 10,000 pounds. The TDI is stored in bulk storage tanks which are separated into two separate processes. Process one: Plant #2 Foam Production and Railcar Unloading is inventoried for 639,000 pounds in two bulk storage tanks and a railcar completely contained within the facility. Process two: Plant #4 Foam Production is inventoried for 534,000 pounds in five bulk storage tanks completely contained within the facility.\n\nDescriptions of the worst case toxic release scenarios are as follows: Process one (PL2 FP and RR Unloading) is a complete rupture of a 22,560 gallon storage tank to an enclosed, diked area. Toxic chemical endpoint dispersion is calculated at 6.3 feet from the nearest point outside of the building. Process two (PL4 FP) is a complete rupture of a 25,100 gallon storage tank to an enclosed, diked area. Toxic chemical endpoint dispersion is calculated at 5.4 feet from the nearest point outside of the building. All release calculations were performed using ALOHA air dispersion modeling software and EPA's RMP Off-Site Consequence Analysis Guidence document. Other release scenarios were also evaluated. Dispersion modeling has determined that no off-site public receptors (human or property) would be affected.\n\nThe following elements are part of GFC Foams Prevention Program:\nProcess Safety Information which includes toxicity, process flow, process chemist"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2118,
      "SummaryText": "ry and process design information.\nEmployee Training is conducted in accordance with a matrix individualized for each department requirements. Training is assured by on the job observation, written and oral examinations and demonstration of skills.\nProcess Hazard Analysis was conducted to review the hazards associated with the regulated substance, procedures and potential equipment failures/human errors which could possibly result in a release. Results and recommendations are recorded and will be updated per the specifications in 40 CFR 68.50.\nStandard Operating Procedures (SOP's) have been developed to ensure process activities are safely conducted and are consistant with standard safety information. All SOP's are checked and verified for correctness.\nPreventative Maintenance/Mechanical Integrity is delegated to Plant Engineering. The program consists of equipment lists and specifications, instrument lists, pipeline specifications, equipment history of repair/replacement, preventative maintenance procedures and work order procedures. Work orders, hot work permits and lockout/tagout procedures are used in conjunction with this program.\nCompliance Audits are conducted by facility managers and supervisors with the aid of Regulatory Affairs. Deficiencies are documented and scheduled for improvement as needed.\nIncident Investigations follow guidelines for fact determination, root case analysis and resolution for incidents that may have resulted in a catastrophic release.\n\nRelease and chemical specific prevention used at the facility include relief valves, check valves, manual and automatic shutoffs, interlocks, audible and visual alarms, TDI handling SOP's, bypass piping, rupture disks and blowout containers. Mitigation systems include sprinkler systems, diking, sumps, firewalls and chemical neutralization. The process and unloading areas can be monitored by portable TDI detection equipment. Operator and HAZMAT training is conducted annually or on an as need basis.\n\nThe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2118,
      "SummaryText": "re have been no accidental releases of TDI from this facility in the past 5 years that have caused an impact to off-site receptors.\n\nThe GFC Foam facility has in place an Emergency Response Plan that has been coordinated with the Luzerne County EMA, West Hazleton Fire Department and the PA Dept. of Environmental Protection. The plan defines the response organization, coordination with responding authorities, equipment available on-site, response procedures, training and notification procedures. This plan has been written in accordance with EPA, OSHA and PaDEP guidelines. It has also been certified in accordance with good engineering practices by a registered professional engineer. A HAZMAT team is staffed on-site (technician level training) and in the event of a catastrophic release, the facility is contracted with outside environmental contractors.\n\nGFC Foam is committed to the responsible handling of hazardous chemicals in its possession and for our responsibility to protect the environment and the health and safety of our employees and the surrounding community."
    }
  ]
}