{
  "FacilityID": 21233,
  "FacilityName": "CYTEC OLEAN INC",
  "FacilityStr1": "1405 Buffalo Street",
  "FacilityStr2": null,
  "FacilityCity": "Olean",
  "FacilityState": "NY",
  "FacilityZipCode": "14760",
  "Facility4DigitZipExt": "1139",
  "FacilityCountyFIPS": "36009",
  "LEPC": "Cattaraugus County LEPC",
  "FacilityLatDecDegs": "42.084361",
  "FacilityLongDecDegs": "-78.445278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 106812555,
  "ParentCompanyName": "CYTEC INDUSTRIES INC.",
  "Company2Name": null,
  "CompanyDUNS": 809749948,
  "Company2DUNS": 809749948,
  "OperatorName": "Gerret Peters",
  "OperatorStr1": "1405 Buffalo Street",
  "OperatorStr2": null,
  "OperatorCity": "Olean",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14760",
  "OperatorZipCodeExt": "1139",
  "FTE": 76,
  "OtherEPAFacilityID": "NYD096297544",
  "EPAFacilityID": "100000019981",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1993-10-17 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-05-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-05-04 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-05-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-05-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.4",
  "FRS_Lat": 42.08559,
  "FRS_Long": -78.44623,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 29853,
      "AltID": "TDI/TDS Bulk Storage",
      "FacilityID": 21233,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 38785,
          "ProcessID": 29853,
          "ChemicalID": 77,
          "Quantity": 71260.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 38786,
          "ProcessID": 29853,
          "ChemicalID": 44,
          "Quantity": 71260.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 30617,
          "ProcessID": 29853,
          "NAICSCode": "32521",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 21233,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-09-01 00:00:00",
    "ERTrainingDate": "2000-04-01 00:00:00",
    "CoordinatingAgencyName": "Cattaraugus County LEPC",
    "CoordinatingAgencyPhone": "7169389111",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "6NYCRR 373 2.3, 2.4 RCRA PPC Plan; 6NYCRR 598.1(k) Spill Prevention Report",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21233,
      "SummaryText": "CYTEC OLEAN INC\n\n(a) ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nCytec is a leader among chemical manufacturers in its safety, health and environmental programs.  Our commitment to protect our employees and the communities that are home to our operations is an integral part of Cytec's way of doing business.  Cytec has established safety, health, emergency response and environmental policies and standards to meet or exceed all regulatory requirements.  As a member of the Chemical Manufacturers' Association (CMA), Cytec subscribes to the codes established for Responsible Care ®.\n\n(b) THE STATIONARY SOURCE AND THE REGULATED SUBSTANCES HANDLED\n\nOur facility has one process that produces  prepolymers which are used to make polyurethanes.  The regulated substance involved with this batch operation is toluene diisocyanate. \n\n(c) WORST-CASE RELEASE SCENARIO AND ALTERNATIVE RELEASE SCENARIO\n\nThe toxic worst-case scenario is the failure of a storage tank and the release of 71,260 pounds of toluene diisocyanate.   The mitigating effects of a dike, with tertiary liner, and an enclosure were included in the evaluation of the possible consequences.  The cloud formed by the evaporating toluene diisocyanate would not reach off-site endpoints and nearby public and environmental receptors.  [Due to minimal allowable entries in the RMP Submit software, both release rate (section 2.6) and Distance to endpoint (section 2.11) are overstated.  The rate minimum is 1 lb/min, and the actual rate is 0.00559 lb/min.  The endpoint minimum is 0.2 miles, while our endpoint is 105 feet, or 0.0199 miles.]\n\nSince the worst-case scenario has no effect beyond our fenceline and there have been no releases that had off-site effects, the toluene diisocyanate process falls into program level 1.  The regulation does not require the identification of alternative release scenarios for program level 1 processes because they would not have off-site effects.\n\n(d) THE GENERAL ACCIDENTAL RELEAS"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21233,
      "SummaryText": "E PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe regulation does not require program level 1 processes to have an accidental release prevention program.  However, through compliance with the following internal requirements and other regulations, CYTEC OLEAN does have a comprehensive program.\n\n- Cytec Safety, Health, Environmental and Engineering standards\n- New York State \"Preparedness, Prevention, and Contingency (PPC) Plan as defined in 6 New York Code of Rules and Regulations (NYCRR) Part 373-2.3 \"Preparedness and Prevention\" and Part 373-2.4 \"Contingency Plan.\"\n- Federal Environmental Protection Agency's \"Spill Prevention, Control, and Countermeasures (SPCC) Planning requirements pursuant to 40 Code of Federal Regulations (CFR) Part 112 \"Oil Pollution Prevention.\"\n- New York State Chemical Bulk Storage Regulations (6NYCRR) Part 598.1(k) \"Spill Prevention Report.\"\n- Generally recognized & accepted engineering codes and standards, and:\n\nIn February, 2000, CYTEC OLEAN completed a major capital project to replace our TDI/TDS Storage System.  With this new system we added the following specific engineering and administrative controls to improve prevention for a release of toluene diisocyanate.\n\n- New API 650 Stainless Steel Storage Tanks\n- Welded, Flanged Piping, installed per nationally recognized standards \n- Fail-closed valve actuators\n- Control scheme to alert when backup controls fail\n- New containment and enclosure, sized for 110% of largest storage tank\n- Tertiary containment liner\n- Remote TV monitor for leak detection\n- Transfer Station, with built-in containment for 110% of largest tanker compartment\n- Above ground pipe chase with containment \n- Double valving end-of-pipe connections\n- Chemically compatible, coded gaskets/flanges\n- Bar-coded Inventory system with checks on tank inputs/outputs\n- Confirmation of sufficient head-room for the load to be off-loaded \n- Primary and secondary high level and high pressure alarms, with automatic shutd"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21233,
      "SummaryText": "own\n- Daily Inspections for leaks\n- Annual and 5-year Inspections of the complete storage system\n- Preventive Maintenance \n- Off-loading procedures with steps for leak prevention\n\n(e) 5-YEAR ACCIDENT HISTORY\n\nThere have been no incidents at the CYTEC OLEAN Plant that meet the criteria for reporting in the five-year accident history.\n\n(f) EMERGENCY RESPONSE PROGRAM\n\nCYTEC OLEAN has developed a \"Consolidated Spill Prevention and Emergency Response (CSPER)\" Plan as outlined in section 4. This plan is coordinated with local emergency response through the Cattaraugus County Local Emergency Planning Committee.  Copies of the plan are provided to local fire and police departments, as well as privately contracted emergency responders.  \n\nThe plan defines individual responsibilities and tasks during various emergencies.   CYTEC OLEAN provides training appropriate to the level of involvement to all employees.\n\nDuring emergencies involving spills, CYTEC OLEAN employees are asked to report the event, provide key information on the type and extent of the emergency, and follow the Emergency Coordinator's instructions to stabilize processes, control employee access to affected in plant areas, and control immediate access to the facility by visitors, contractors and off-shift employees.  The Emergency Coordinator, or backups, direct this first response, and make timely notifications to local responders and the Emergency Response Contractor.  When local emergency responders arrive, the Emergency Coordinator provides on-site assistance and support.  Spill Response, including all clean-up and remedial operations, is the responsibility of the Emergency Response Contractor.  The Plan defines notifications to Local, State and Federal Agencies, as well as the Public.\n\n(g) PLANNED CHANGES TO IMPROVE SAFETY\n\nCYTEC Industries is constantly striving to upgrade its processes, control technology, employee training, inspection, repair and maintenance of process equipment in order to improve safe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21233,
      "SummaryText": "ty.   We executed a well organized plan ensuring minimum negative impact from Y2K, and will continue to review and upgrade such systems."
    }
  ]
}