{
  "FacilityID": 21366,
  "FacilityName": "GAC Chemical - Indianapolis",
  "FacilityStr1": "1598 South Senate Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Indianapolis",
  "FacilityState": "IN",
  "FacilityZipCode": "46225",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18097",
  "LEPC": "Marion County LEPC",
  "FacilityLatDecDegs": "39.742083",
  "FacilityLongDecDegs": "-86.162972",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A6",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 92014513,
  "ParentCompanyName": "GAC Chemical Corporation",
  "Company2Name": null,
  "CompanyDUNS": 92014513,
  "Company2DUNS": 0,
  "OperatorName": "GAC Chemical Corporation",
  "OperatorStr1": "1598 South Senate Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Indianapolis",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46225",
  "OperatorZipCodeExt": null,
  "RMPContact": "J. Alexander Horth",
  "RMPTitle": "VP Engineering & Envr Affairs",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000169836",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-06-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-05-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-05-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-01-22 00:00:00",
  "DeRegistrationEffectiveDate": "2010-01-14 00:00:00",
  "AnniversaryDate": "2005-05-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 39.74646,
  "FRS_Long": -86.16459,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30110,
      "AltID": "Chlorine Unloading",
      "FacilityID": 21366,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 30879,
          "ProcessID": 30110,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 39131,
          "ProcessID": 30110,
          "ChemicalID": 62,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 539131,
          "ProcessID": 30110,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21366,
      "SummaryText": "POLICIES\n\nGAC Chemical Corporation is committed to the safe and environmentally responsible handling and production of all chemicals and materials at its facility in Indianapolis, Indiana.\n\nChlorine, the substance regulated under the Risk Management Program at this facility, is included in the facility's Process Safety Management Plan.\n\nThe safety program has been very effective in Indianapolis.  There have been no lost-time injuries in over two years of operation at this site.\n\nThe facility is ISO 9002 certified.\n\n\n\nREGULATED SUBSTANCE\n\nGAC Chemical Corporation manufactures inorganic chemicals at its Indianapolis facility.  With regards to 40 CFR Part 68, chlorine is the only listed chemical handled and stored at quantities exceeding the threshold quantities.\n\nChlorine is scheduled to be first used at the site on or about April 13, 2000, with the startup of a Powell Continuous Bleach Plant.  The facility includes no permanent storage for chlorine.  Chlorine will be supplied to the process directly from rail cars. The facility has been designed to accommodate a maximum of two 90 ton rail cars. Only one car will be in service at any time.\n\nChlorine is transferred  to the production unit from the rail car in liquid form.  There are no intermediate storage vessels or vaporizer systems for chlorine.  The chlorine is 100% consumed in the production of sodium hypochlorite bleach solution.  Chlorine is not used in any other processes nor is it repackaged  and shipped from the facility.\n\nThe chlorine is  transferred to the process via a permanent pipeline using dry compressed air.  The pipeline is construction is welded steel with a minimum of flanged joints.  All welds have been x-ray tested to assure the quality of the welded joints.  The maximum pressure in the chlorine system during unloading is 130psig.  The pressure rating for the rail car is 375 psig.  The piping system has a pressure relief system utilizing rupture disks which relieve into expansion tanks.  Every se"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21366,
      "SummaryText": "ction of pipe that can be isolated between two valves is fitted with a rupture disk/expansion tank system.  The tanks have both local pressure indication, as well as pressure switches which will be tied in to the plant-wide control and monitoring system.\n\nThe unloading system incorporates the Powell Unloading Valve Closure System.  Chlorine detectors are located in the vicinity of the rail car and a railcar movement detection system is attached to the car.  All devices are connected to a plant wide monitoring and control system which will issue warnings and/or alarms as appropriate.  For any failure or alarm condition, the Powell Unloading Valve Closure System will activate closing the railcar valves.  The unloading system has been designed to allow for the depressurization and complete purging of the chlorine from the chlorine pipeline via the Powell Provent Scrubber System.\n\nIn the event of a power interruption, a battery backup system will allow for two to five hours of run time for the plant-wide monitoring and control system and appropriate devices.\n\nIn the production of bleach, a controlled flow of chlorine is injected into a recirculating flow of dilute caustic soda/bleach solution.  The chlorine is 100% consumed in the reaction to form the sodium hypochlorite bleach solution.  The bleach plant is scheduled to start production on or about April 13, 2000.\n\nNo regulated waste chlorine or chlorine byproduct is generated by any handling or processing at the Indianapolis facility.\n\n\n\nRELEASE SCENARIOS\n\nOne regulated process exists at the facility.\n\nProcess 1:  Chlorine receiving and handling\n\nAll release scenarios were analyzed using RMP*Comp for the impact radius calculation and Landview III for estimating the effected population within the impacted area.\n\nWORST CASE\n\nProcess 1:  Catastrophic failure of a chlorine rail car containing 180,000 pounds of material.  No containment or passive mitigation was used.   The calculated impact radius is 14 miles.  The estima"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21366,
      "SummaryText": "ted population that may be impacted is 895,348.  A  catastrophic failure is extremely unlikely since it would require a structural failure of the rail car or the impact and penetration of the vessel shell by some object of significant mass and/or velocity.  The rail cars are maintained (inspections, external coatings) by their owners to prevent external corrosion from the weather.  The chlorine shipped to GAC Chemical is dry and is not corrosive to the steel tank interior.\n\nALTERNATES\n\nProcess 1/Alternate 1:  The partial failure of a transfer hose connecting the unloading chlorine rail car and the fixed transfer piping.  The partial transfer hose failure scenario is a 0.5 inch diameter hole due to fatigue of the hose.  The railcar has an excess flow valve installed at the unloading connection.  The calculated impact radius is 0.5 miles.  The estimated population that may be impacted is 2,756. It is the standard operating policy to routinely inspect the hoses prior to and during their use.  Any suspect hose is either tested or replaced.  It is not likely that hose deterioration would progress unnoticed to the point where a breach could occur.  In the event of a breach, chlorine cars are equipped with excess flow valves which seal when flow through the valve and the connected piping is unrestricted.  These devices limit the amount of chlorine that could be released by preventing continuous, unrestricted flow.\n\nProcess 1/Alternate 2:  The complete failure of the 1? inch transfer hose.  The railcar has an excess flow valve installed at the unloading connection.  For the reasons stated above, this scenario is least likely of the alternate cases.  The calculated impact radius is 1.2 miles.  The estimated population that may be impacted is 11,449.\n\nProcess 1/Alternate 3:  The release of chlorine via a faulty valve packing or flange.  A leak path size equivalent to a 0.25 inch diameter opening was assumed.  The release calculation assumes full, unrestricted flow at a pressu"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21366,
      "SummaryText": "re of 130 psig (the normal maximum operating pressure).  The calculated impact radius is 0.3 miles.  The estimated population that may be impacted is 1,284.\n\nNote 1:  In all cases, any leaking chlorine would be detected by the chlorine sensors which would cause the Powell Unloading Valve Closure System to activate.  After closure of the rail car valves, the chlorine transfer line would be immediately purged to the Provent Scrubber.\n\nNote 2:  An emergency \"C\" kit is available for the temporary repair of a leaking flange or valve.\n\n\n\nPREVENTION PROGRAMS\n\nAll aspects of chlorine handling and use at the facility are covered by the facility's Process Safety Management Plan.  The standard operating procedures (SOPs) are reviewed and updated whenever an operation change is made.  If no operational changes are made, the SOPs are reviewed annually and updated as necessary.\n\nThe ISO 9002 program at GAC Chemical requires rigid compliance to SOPs, preventive maintenance procedures, and instrument calibrations.  All procedures must be reviewed annually.  The ISO program is audited internally every year (audit components are distributed throughout the year) and recertified by a third party annually.\n\nMandatory monthly training sessions are attended by all production and maintenance employees.  The subjects include annual training of SOPs, hazards communications, fire safety, electrical safety, and pollution prevention.\n\nGAC Chemical contracts a fully trained and equipped Hazmat Team to address incidents that may occur at the facility.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nChlorine will be handled for the first time at GAC Chemical during startup on or about April 13, 2000..  Therefore, there have been no accidental releases of chlorine (vapor or liquid) in the last five years.\n\n\n\nEMERGENCY RESPONSE PLAN\n\nThe Emergency Response Plan for the facility was first published on March 15, 2000.  The plan covers all the processes and chemicals handled at the facility. Theplan is coordinated with"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21366,
      "SummaryText": " the Marion County Emergency Management Agency and the Marion County LEPC.  Copies have been supplied to the Indiana Emergency Management Agency and the city of Indianapolis.\n\n\n\n\nPLANS FOR IMPROVEMENT\n\nGAC Chemical's safety record in Indianapolis and all of its facilities has been good for many years.  Management continues to place the highest priority on the safety and environmental programs for this and all its facilities.  Improvements in the programs occur through ongoing review and annual updates by employees in all areas of production, maintenance, supervision and management."
    }
  ]
}