{
  "FacilityID": 2136,
  "FacilityName": "Drake Water Reclamation Facility",
  "FacilityStr1": "3036 East Drake Road",
  "FacilityStr2": null,
  "FacilityCity": "Ft. Collins",
  "FacilityState": "CO",
  "FacilityZipCode": "80525",
  "Facility4DigitZipExt": "9761",
  "FacilityCountyFIPS": "08069",
  "LEPC": "Larimer County LEPC",
  "FacilityLatDecDegs": "40.556111",
  "FacilityLongDecDegs": "-105.021667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 846000587,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Fort Collins",
  "OperatorStr1": "3036 East Drake Road",
  "OperatorStr2": null,
  "OperatorCity": "Ft. Collins",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80525",
  "OperatorZipCodeExt": "9761",
  "RMPContact": "Steve Comstock",
  "RMPTitle": "Water Reclamation Department Mgr.",
  "FTE": 61,
  "OtherEPAFacilityID": "CO-0026425",
  "EPAFacilityID": "100000025983",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "93 LR 962",
  "SafetyInspectionDate": "1997-09-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Ft. Collins, CO WWTP",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-09-06 00:00:00",
  "DeRegistrationEffectiveDate": "2018-07-23 00:00:00",
  "AnniversaryDate": "2004-06-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 40.55241,
  "FRS_Long": -105.02169,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2347,
      "AltID": "Wastewater Treatment",
      "FacilityID": 2136,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2397,
          "ProcessID": 2347,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 2499,
          "ProcessID": 2347,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 2500,
          "ProcessID": 2347,
          "ChemicalID": 49,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502499,
          "ProcessID": 2347,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502500,
          "ProcessID": 2347,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2136,
      "SummaryText": "1.  Accidental release prevention and emergency response policies:\n\nAt the Drake Water Reclamation Facility, two chemicals considered hazardous by US EPA, chlorine and sulfur dioxide, are utilized.  The properties of chlorine and sulfur dioxide make them valuable for disinfecting and dechlorinating wastewater treatment plant effluent.  These same properties make it necessary to observe certain safety precautions in handling chlorine and sulfur dioxide to prevent unnecessary human exposure, to reduce the threat to the personal health of the facility employees, and to reduce the threat to nearby members of the community.  It is the policy of the Fort Collins Utilities' to adhere to all applicable Federal and state rules and regulations concerning handling and storage of these materials.  Safety depends upon the safety devices inherent in the design of the facility, combined with the safe handling procedures that we use, and the training of the Utility personnel.\n\nOur emergency response procedures include notification of the local fire authority and notification of any potentially affected neighbors.  In addition, access to the site is restricted to authorized facility employees, management personnel, and contractors.  The chlorine and sulfur dioxide systems are enclosed within a building on City property to help keep them secure.  This building also contains an emergency vapor scrubber that will activate in the event of an emergency.  \n\n2.  The stationary source and regulated substances handled:\n\nThe regulated substances handled at this faciltiy are chlorine and sulfur dioxide.\n\nThe primary purpose of the Drake Water Reclamation Facility (DWRF) is to treat wastewater for the City of Ft. Collins.  Chlorine is used to disinfect treated effluent prior to discharge.  Sulfur dioxide is used to dechlorinate the effluent just before it is released from the facility.  Chlorine and sulfur dioxide vessels are received by truck and are placed inside the chlorine/sulfur dioxide b"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2136,
      "SummaryText": "uilding where they are stored until needed.  The storage capacity of each vessel is 2,000 pounds of chlorine and sulfur dioxide.  The DWRF storage area has a total capacity for six chlorine cylinders, therefore the maximum amount of chlorine that can be stored at the facility is approximately 12,000 pounds.  The total number of sulfur dioxide cylinders that can be kept on site is four, therefore the maximum amount of sulfur dioxide that can be stored at the facility is 8,000 pounds.\n\n\n3.  The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario:\n\nWorst-Case Scenario:  After careful review of potential worst-case scenarios, it was determined that a cylinder unloading accident that causes rupture of the vessel outside of the building is the worst-case.  This could cause the contents of either a chlorine or sulfur dioxide vessel (2000 pounds) to be released outside.\n\nThe distance to the toxic endpoint of 3 ppm for the worst-case scenario is approximately 3.0 miles for chlorine and 3.1 miles for sulfur dioxide.\n\nAlternative Scenario:  A pig tail snapping from either a chlorine or sulfur dioxide vessel causes a flashing liquid release through a small hole approximately 1/4 inch diameter is the alternative release scenario.  The liquid chlorine or sulfur dioxide would flash immediately to vapor and fine liquid droplets and be carried downwind.  The building enclosure would act to reduce the rate of release into the environment but it has been conservatively assumed that the emergency vapor scrubber would fail to activate.  \n\nThe distance to the toxic endpoint of 3 ppm for the alternative release scenario is estimated to be 0.4 miles for chlorine and 0.3 miles for sulfur dioxide.  This release has the possibility of extending beyond the facility boundary, as the RMP rule dictates.  Please note that if the emergency vapor scrubber operates as it is "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2136,
      "SummaryText": "designed, this scenario would not extend beyond the building or off site.\n\n\n4.  The general accidental release prevention program and the specific prevention steps:\n\nThe DWRF complies with EPA's Accidental Release Prevention Rule and with applicable state codes and regulations.  The facility was designed and constructed in accordance with good engineering practices to provide a safe system for employees as well as community members and the environment.  The plant operators and other employees are trained in sagety practices and documentation of safety policies and procedures are available to employees.  The facility has written standard operating procedures that are followed in the day to day operation of the facility.  In addition, the employees receive continuous on the job training as well as special training sessions when new pieces of equipment are installed.  The DWRF maintenance program is well established and documented to insure the proper operation of all equipment.  Furthermore, the facility has set up procedures for compliance audits and incident investigations that will be implemented when necessary.\n\nThe employees responsible for overseeing and assisting in the delivery and transfer of chlorine and sulfur dioxide cylinders are all plant operators who are certified by the Colorado Department of Public Health and Environment.  11 plant operators are certified Class A operators and 2 are certified Class D operators.  In addition, the plant operators are trained in the hazards of chlorine and sulfur dioxide and the steps to be taken in an emergency situation to mitigate the release of these compounds.\n\n5.  Five-year accident history:\n\nDuring the last five years (6/21/94 - 6/21/99)  there have been no accidental releases, injuries, or environmental damage resulting from the chlorine or sulfur dioxide systems. \n \n6.  The emegency response program:\n\nThis facility's emergency response program is based upon the management system, already in place and appropriat"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2136,
      "SummaryText": "e discovery and notification procedures to ensure coordination with local emergency responders.  This program has been discussed with the Poudre Valley Fire Authority.  Mock drills with the Poudre Valley Fire Authority have been performed in the past.  The date of the last inspection by the Poudre Valley Fire Authority was September 15, 1997.\n\n7.  Planned changes to improve safety:\n\nA process hazard analysis (Program Level 2 Hazard Review) of the chlorine and sulfur dioxide systems  was conducted on February 16 abd 17, 1999.  From this review, the recommendations were:\n\n- Develop a standard operating procedure (SOP) for unloading cylinders and train personnel in the procedure\n\n- Develop a way to safely move a cylinder that has rolled from the truck\n\n- Check dome caps prior to unloading\n\n- Checking of the cylinder by the vendor\n\n- Load testing of the hoist\n\n- Specify a visual inspection of the cable and hoist in SOP\n\n- Specify in SOP to check for clearance of the truck bed before lowering cylinder\n\n- Make sure valve is straight up before cylinder sits for 24 hours\n\n- Contact the vendor to warn them if a cylinder is coming back that is not emptyl\n\n- Modify SOP to add checking chlorine/sulfur dioxide sensors for the amount of substance present in room before entering\n\n- Notify vendor if corrosion in the vessel is evident\n\n- Include a procedure for examining and tightening the packing nut if needed in the SOP\n\n- Notify vendor if a tank arrives with a lose packing nut to ensure it doesn't happen in the future\n\n- Add a check of the plugs to the SOP\n\n- Schedule regular on site drills with the fire department\n\n- Refresher training in hook-up procedure\n\n- Lock-out/tag-out training \n\n- Chlorine/sulfur dioxide leak training\n\n- Write SOP to include checking to be sure valve is straight up before cylinder sits for 24 hours\n\n- Write and implement a procedure for cleaning the filter that includes a line breaking procedure\n\n- Preventative visual checks of the system\n\n- Evaluate man"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 2136,
      "SummaryText": "ufacturers preventative maintenance procedures and schedule and possibly implement them\n\n- Encourage plant employees to report strangers on site\n\n- Develop a system for informing vendors or visitors of the alarm and evacuation procedure - possibly hang a sign and light at the entrance gates\n\n- Install remote controls outside the building for manual activation of emergency vapor scrubber (EVS) system\n\n- Add the EVS to the plant supervisory control and data acquisition (SCADA) system\n\n- Add redundant gas sensors\n\n- Install a signal to the SCADA system to alert personnel if the EVS system has been turned off\n\n- Periodic checking and cleaning of dampers in the chlorine/sulfur dioxide building"
    }
  ]
}