{
  "FacilityID": 21410,
  "FacilityName": "U.S. Steel Gary Works No 2 QBOP Propane Facility",
  "FacilityStr1": "One North Broadway",
  "FacilityStr2": null,
  "FacilityCity": "Gary",
  "FacilityState": "IN",
  "FacilityZipCode": "46402",
  "Facility4DigitZipExt": "3911",
  "FacilityCountyFIPS": "18089",
  "LEPC": "Lake County LEPC",
  "FacilityLatDecDegs": "41.6075",
  "FacilityLongDecDegs": "-87.336944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.uss.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 2028801,
  "ParentCompanyName": "United States Steel Group",
  "Company2Name": "USX Corporation",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "U.S. Steel Group-Gary Works",
  "OperatorStr1": "One North Broadway",
  "OperatorStr2": null,
  "OperatorCity": "Gary",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46402",
  "OperatorZipCodeExt": "3911",
  "FTE": 7800,
  "OtherEPAFacilityID": "IND 005444062",
  "EPAFacilityID": "100000169943",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "Pending",
  "SafetyInspectionDate": "2000-05-12 00:00:00",
  "SafetyInspectionBy": "Hartford Insurance",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-06-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-06-06 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-05-31 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-05-31 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 41.6125,
  "FRS_Long": -87.3114,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30190,
      "AltID": "No. 2 Q BOP Propane",
      "FacilityID": 21410,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 39230,
          "ProcessID": 30190,
          "ChemicalID": 98,
          "Quantity": 140000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 30959,
          "ProcessID": 30190,
          "NAICSCode": "331111",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 16618,
              "Process_NAICS_ID": 30959,
              "SafetyReviewDate": "2000-03-01 00:00:00",
              "PHA_Date": "1999-05-05 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-06-06 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-04-26 00:00:00",
              "TrainingReviewDate": "2000-05-03 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-05-17 00:00:00",
              "EquipmentInspectionDate": "2000-04-01 00:00:00",
              "EquipmentTested": "Gas Detectors",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2000-05-17 00:00:00",
              "PreStartupReviewDate": "2000-05-10 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-02-02 00:00:00",
              "HotWorkPermitReviewDate": "2000-04-12 00:00:00",
              "ContractorSafetyReviewDate": "2000-05-19 00:00:00",
              "ContractorSafetyEvalDate": "2000-02-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 23966,
                  "PreventionProgram3ID": 16618,
                  "ProcessChemicalID": 39230
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 21410,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-03-29 00:00:00",
    "ERTrainingDate": "2000-04-17 00:00:00",
    "CoordinatingAgencyName": "Lake County LEPC",
    "CoordinatingAgencyPhone": "2197553512",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "29 CFR 1910.119"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21410,
      "SummaryText": "EXECUTIVE SUMMARY\n\n1. Accident Release Prevention Program and Emergency Response Policy\n\nIt is the policy of U.S. Steel Gary Works management to implement the requirements of this Risk Management Program (RMP) in accordance with the USEPA regulations under 40 CFR Part 68  in conjunction with OSHA Process Safety Management Standard 29 CFR 1910.119. The objective is to minimize the risk of a release of a hazardous material and if a release occurs, to minimize the potential impact to USS employees, the public and the environment.  \n\nThis objective will be accomplished by utilizing good operating procedures, providing appropriate training to all employees, and coordinating response activities, as necessary, with the local emergency response providers.  U.S. Steel's management is committed to providing the resources necessary to implement this policy.  Further, the Gary Works recognizes that it has a duty to protect its employees and neighbors from the effects of all dangerous chemicals.  \n\n2. Facility Description\n\nU.S. Steel operates one of the world's largest integrated steel mills at Gary, IN.  Operations include the production of coke, iron, steel and a multitude of finished and semi-finished products. The Steel Works is bounded on the North by Lake Michigan and on the South by the City of Gary.  A variety of industries (including power plants and chemical companies) are found in the immediate area surrounding the facility.\n\nThe No. 2 Q-BOP facility currently uses natural gas for tuyere cooling purposes. In the future propane gas shall be used as a tuyere coolant on a supplemental basis for selective grades of steel. The propane shall be brought into the plant by transport trucks caryying liquid propane at an elevated pressure. The liquid propane, stored at the tank farm, shall be pumped to the No. 2 Q BOP through a vaporizer.\n\n3.  Worst-Case and Alternative-Release Scenarios\n\nThe RMP regulations require that each facility identify worst-case and alternative case rel"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21410,
      "SummaryText": "injuries, property damage, environmental damage, evacuations or sheltering in place.\n\n7. Emergency Response Program\n\nAn Emergency Response Program is prepared for the propane facility that identifies and establishes proper response procedres in case of an emergency.  Gary Works has personnel trained in emergency response at the facility 24 hours per day, seven days per week.  These personnel receive annual training on emergency procedures and response techniques.  Response activities are coordinated with the local fire department to ensure the appropriate level of response.  USS has also developed and implemented an Integrated Contingency Plan (ICP) that defines the appropriate steps that must be taken to minimize harm to all sensitive receptors (including neighbors, employees and the environment).\n\n8. Planned Changes to Improve Safety\n\nUSS has committed to performing a thorough review and implementation of management of change procedures before any change in the system is authorized.  Any results and recommendations from hazard reviews are discussed with management and implemented as deemed appropriate.  This is one of many methods used by the Gary Works to maintain and improve the safety of associated  systems."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21410,
      "SummaryText": "Identification\n\nThe EPA Risk Management regulation identifies three levels of requirements defined as programs.  EPA recognizes that some regulated processes would not pose an off-site hazard in the event of an accidental release.  Such processes are classified as Program 1.  Program 1 is applicable to any process for which it can be demonstrated that the public would not be adversely affected by a release.  Thus, to qualify for Program 1, a facility with a regulated toxic chemical needs to meet two criteria.\n\n* no release over the most recent 5-year period has resulted in off-stie injury, environmental damage, significant property damage; and \n\n* dispersion modeling demonstrates that a worst-cas release (as defined by the regulation) will not result in concentrations at public receptors that exceed the endpoint.\n\nThe Gary Works has not had an accident or release involving propane in the past 5 years.  However, the worst-case release, as defined by the regulation, results in an overpressure at public receptors that exceeds the flammable substance endpoint.  The RMP for propane is therefore classified as a Level 3 program. \n\n5.  General Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nGary Works is governed by a set of OSHA and USEPA regulations that require planning and facility activities intended to prevent a release of hazardous material, or if a release inadvertently occurs, to minimize the consequences of a release to the employees of the facility, the public and to the environment.  These regulations include:\n\n· 40 CFR Part 68, Accidental Release Prevention\n· 40 CFR Part 112, Spill Prevention, Control and Countermeasure\n· 40 CFR Part 264, Hazardous Waste Contingency Plan\n· 29 CFR Part 119, Process Safety Management\n\nThe key concepts in USS's release prevention program are employee participation, appropriate design and maintenance of equipment, and appropriate training of employees.\n\nEmployee participation in the release preventi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21410,
      "SummaryText": "on program is encouraged and supported by USS management.  Key personnel are responsible for conducting and implementing any findings from the propane system hazards review. USS Gary Works employees are also members of the facility emergency response team.\n\nUSS's policy is to construct all new equipment, systems, and facilities in accordance with the most current building and safety codes.  This ensures the appropriate safety and release prevention systems are included from the beginning of each project. In addition to the above rules and regulations,  USS employs the following regulations, design codes and standards to ensure the safety and health of its employees, neighbors and the environment:\n\n· National Fire Protection Association (NFPA) Standards for fire prevention and protection.\n· National Electrical Code (NEC) Standards for the design standards of electrical systems.\n· American Society of Mechanical Engineering (ASME) Standards for pressure vessel design.\n· Indiana Codes and Standards for pressure vessels\n\nUSS Gary Works is committed to providing appropriate training to all employees regarding safety procedures.  Each new employee is provided comprehensive safety training during his or her initial orientation for the facility.  In addition, USS conducts regularly scheduled safety training for all employees each year.  Additional training is provided to maintenance personnel for the systems that they are responsible for.  Gary Works also maintains a computerized program of maintenance activities to ensure that key systems are maintained appropriately to minimize the risk of a release.  Members of the Gary Works emergency response team receive annual training to ensure that response actions are promptly and safely completed.\n\n6.  Five Year Accident History\n\nUSS has not had an incident in the past five years involving propane at the Gary Works that has caused any of the following:\n\n· On-site deaths, injuries, significant property damage, or \n· Offsite deaths,"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21410,
      "SummaryText": "ease scenarios.  EPA has defined a worst-case release as the instantaneous release of the entire contents of the largest vessel or connected piping that contains a regulated substance.  \nThe release event is then evaluated using modeling techniques and/or reference tables to define the distance to a specified endpoint (concentration or overpressure).  The distance to the endpoint is affected by several factors including molecular weight, volatility, heat of combustion, and physical setting (urban or rural).\n\nThe worst-case release scenario for the propane consists of a release of all of the contents of the tank farm, including the volume stored in transfer piping and a fully loaded transport truck connected to the process at the Tank Transfer Unit. The distance to the endpoint defined by the regulations was calculated and a potential public receptor was indentified as Gary Works private waterway. It is to be noted that the waterway is owned  and operated by USS, hence it is not unrestricted but no physical chekpoint is present for a  wandering boatman.\n\nThe endpoint of 1 psi that has been defined by the regulation is intended to be conservative and protective.  It does not define a level at which severe injuries or death would be commonly expected.  An overpressure of 1 psi is unlikely to have serious direct effects on people however, property damage may occur. \n\nThe selected alternative-release scenario for the propane system assumes that the propane is released from the tank mounted relief valve. The gas accumulates until a source of ignition causes a vapor cloud fire.  \n\nUSS considered that the potential for an explosion to result from such a leak would be remote due to the engineering and administrative controls and atmospheric turbulence that is generally present at the site.  Consequence analysis methods were applied to the alternative release scenario and found that the distance to the endpoint did not go beyond the Gary Works property line.\n\n4. Program Level"
    }
  ]
}