{
  "FacilityID": 21458,
  "FacilityName": "WEPCO Germantown Turbine Inlet Cooling System",
  "FacilityStr1": "N92W19298 County Line Road",
  "FacilityStr2": null,
  "FacilityCity": "Germantown",
  "FacilityState": "WI",
  "FacilityZipCode": "53022",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55131",
  "LEPC": "Washington County LEPC",
  "FacilityLatDecDegs": "43.195",
  "FacilityLongDecDegs": "-88.150556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7947385,
  "ParentCompanyName": "Wisconsin Energy Corporation",
  "Company2Name": null,
  "CompanyDUNS": 7947385,
  "Company2DUNS": 0,
  "OperatorName": "Wisconsin Electric Power Company",
  "OperatorStr1": "231 West Michigan St  PO Box 2046",
  "OperatorStr2": null,
  "OperatorCity": "Milwaukee",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53201",
  "OperatorZipCodeExt": null,
  "RMPContact": "Don Verbsky",
  "RMPTitle": "Team Leader",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000170227",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "99-RV-121",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-06-13 00:00:00",
  "ErrorReportDate": "2000-06-13 00:00:00",
  "ReceiptDate": "2000-06-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-06-07 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2009-12-08 00:00:00",
  "DeRegistrationEffectiveDate": "2009-11-18 00:00:00",
  "AnniversaryDate": "2005-06-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 43.20139,
  "FRS_Long": -88.15,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30292,
      "AltID": "electric power production",
      "FacilityID": 21458,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 31061,
          "ProcessID": 30292,
          "NAICSCode": "221119",
          "_desc": {
            "NAICS_CODE": "221119",
            "NAICS_DESCRIPTION": "Other Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 39385,
          "ProcessID": 30292,
          "ChemicalID": 56,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 539385,
          "ProcessID": 30292,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21458,
      "SummaryText": "The Germantown Power Plant burns natural gas or fuel oil in five combusition turbine units to generate electricity for distribution on the Wisconsin Electric system during times of peak power demand.  The plant is subject to the Risk Management Program because it has a turbine inlet air cooling system which contains anhydrous ammonia in excess of the threshold quantity listed in the U.S. Environmental Protection Agencies RMP regulations.  This system was installed in 2000 to increase electrical generation capacity in the summer months by cooling the turbine inlet air.  The Germantown Power Plant Turbine Inlet Air Cooling System consists of large cooling coils that chill the air going into the combustion turbines.  Cooling the inlet air to a combustion turbine increases its power output.  The air is cooled by cold water circulating inside the cooling coil pipes.  Cold water is supplied by pumps from two large storage tanks at the site.  A refrigeration system makes ice at night and on weekends to keep the water in the storage tanks cold.  Ammonia is used as the working fluid in the refrigeration system.  There are two identical, totally enclosed refrigeration systems designed to current International Institute of Ammonia Refrigeration (IIAR) standards.  A significant release of ammonia to the environment is highly unlikely.  Wisconsin Electric Power Company is a subsidiary of Wisconsin Energy Corporation.  Wisconsin Electric provides electricity, natural gas, and steam services to more than 2.4 million people in southeastern Wisconsin, the Appleton area, The Prairie du Chien area, northern Wiscosin and Michigan's Upper Penninsula.  All employees associated with the use of ammonia are trained in current OSHA, EPA, and IIAR standards to ensure the safe operation of the facility.  Real-time monitoring devices are located in strategic areas to warn of any ammonia release.  This coupled with the most current fabrication and construction methods employed in the system furt"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21458,
      "SummaryText": "her reduce the potential for major releases.  Security measures are also provided by isolating the site with fencing, appropriate lighting, and public enforcement patrols.  The amount of anhydrous ammonia utilized for this operations is roughly 32,000 pounds.  WORST-CASE RELEASE SCENARIO:  Failure of a single low pressure receiver with a capacity of 10,299 pounds of anhydrous ammonia.  Considering an opening 3 inches in length and 0.55 inches in width.  This would result in the release of all of the anhdrous ammonia in the low peressure receiver in 10 minutes.  The atmospheric conditions are dictated by the EPA for this case.  The wind direction should be considered on a case-by-case basis.  The footprint (see case printouts) has included an outside zone which can be used to derive a safety zone outside the direct area of level of concern area.  The maximumthreat zone would have an off-site impact.  GENERAL RELEASE PREVENTION PROGRAM:  This program follows all OSHA, EPA, IIAR standards, and Good Engineering Practices.  As this is a new site all state-of-the art precautions prudent for this site have been included in its construction.   This includes an exhaustive completion of the OSHA Process Safety Management Plan.  EMERGENCY RESPONSE PLANNING:  The emergency response plan can be reviewed at the Corporate Offices of WEPCO.  It was also provided for review by the Local Emergency Response Committee (LEPC) and is updated by the corporate safety/environmental/health staff of WEPCO. FIVE YEAR ACCIDENT HISTORY:  This is a new installation with no accidents.  Reportability will be as prescribed by the EPA.  PLANNED SAFETY CHANGES:  Changes to improve safety are an on-going process within WEPCO and will continue to follow this philosphy at this facility.  All changes in the ammonia system will follow the Management of Change component of the Process Safety Management Plan as prescribed by OSHA."
    }
  ]
}