{
  "FacilityID": 21500,
  "FacilityName": "SYSCO Food Services of San Antonio",
  "FacilityStr1": "5711 FM 78",
  "FacilityStr2": null,
  "FacilityCity": "San Antonio",
  "FacilityState": "TX",
  "FacilityZipCode": "78244",
  "Facility4DigitZipExt": "1005",
  "FacilityCountyFIPS": "48029",
  "LEPC": null,
  "FacilityLatDecDegs": "29.475611",
  "FacilityLongDecDegs": "-98.377",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 99572992,
  "ParentCompanyName": "SYSCO Coporation",
  "Company2Name": null,
  "CompanyDUNS": 51099661,
  "Company2DUNS": 51099661,
  "OperatorName": "SYSCO Food Services of San Antonio",
  "OperatorStr1": "PO Box 18364",
  "OperatorStr2": null,
  "OperatorCity": "San Antonio",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78218",
  "OperatorZipCodeExt": "0364",
  "FTE": 150,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000170502",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-02-01 00:00:00",
  "SafetyInspectionBy": "American Institute of Baking",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-06-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-06-15 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-06-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-06-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 29.475064,
  "FRS_Long": -98.377165,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30355,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 21500,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 39471,
          "ProcessID": 30355,
          "ChemicalID": 56,
          "Quantity": 11790.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 31124,
          "ProcessID": 30355,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 16738,
              "Process_NAICS_ID": 31124,
              "SafetyReviewDate": "2000-03-15 00:00:00",
              "PHA_Date": "2003-07-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-03-03 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "In progress of installing a catwalk and upgrading the ammonia detection system",
              "OpProceduresReviewDate": "2000-03-15 00:00:00",
              "TrainingReviewDate": "2000-05-30 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-03-15 00:00:00",
              "EquipmentInspectionDate": "1999-08-08 00:00:00",
              "EquipmentTested": "Compressors and motors",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2000-03-27 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-03-15 00:00:00",
              "HotWorkPermitReviewDate": "2000-03-15 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2000-03-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 24138,
                  "PreventionProgram3ID": 16738,
                  "ProcessChemicalID": 39471
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 21500,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "San Antonio Fire Department",
    "CoordinatingAgencyPhone": "2102077744",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21500,
      "SummaryText": "Introduction\n\nSYSCO Food Services of San Antonio is located in San Antonio, Texas and is a wholly owned subsidiary of SYSCO Corporation.  The facility stores various food, beverages, and food preparation equipment for distribution.  To maintain product quality and freshness, much of the inventory is kept either refrigerated or frozen.  Cooling is achieved through the use of an ammonia refrigeration system containing a significant quantity of ammonia within the system's boundary.\n\nAmmonia contained within the refrigeration system is a regulated substance under both the EPA and OSHA regulations.  At SYSCO Food Services of San Antonio, the maximum inventory of ammonia exceeds the regulatory threshold of 10,000 pounds.\n\nSYSCO Food Services of San Antonio is committed to protecting the public, its employees, and the environment from any accidental releases of hazardous materials used.  We have implemented safety, environmental protection, and risk management programs to prevent hazardous materials releases. \n\nIf there is an accidental release, we will immediately call for emergency response to minimize the effect of the release and notify the public of any actions necessary to ensure public protection, through the Emergency 911 phone system.\n\nWorst-Case Release Scenario\n\nSYSCO Food Services of San Antonio has conducted an offsite consequence analysis as required by the regulations, including an extremely unlikely, worst-case release scenario (i.e., total release from the single largest container over a ten minute period, assuming worst case meteorological conditions).  Results of this worst-case event indicate that some offsite receptors would be affected. \n\nA release represented by this worst-case scenario is extremely unlikely because of the design of system components (they are designed to withstand pressures well in excess of normal operating conditions) and the rigorous maintenance and prevention programs in place at the SYSCO Food Services of San Antonio facility."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21500,
      "SummaryText": "In fact, EPA release reporting databases and industry experience suggest that the worst-case release scenario as defined in the RMP regulations is so unlikely that it should not be used as the basis for emergency planning.  A more reasonable potential release scenario for emergency planning is presented in The alternative release scenario section below.\n\nAlternative Release Scenario\n\nA credible worst-case scenario, formulated in accordance with USEPA guidance, was selected as the SYSCO Food Services of San Antonio alternative release scenario.  This scenario involves a hole in the piping containing liquefied ammonia under pressure.  This scenario is modeled in the EPA Risk Management Program Guidance for Ammonia through a 1-inch hole from a break in the high pressure liquid line on the roof of the facility.  Results of this credible worst-case event indicate that some offsite receptors would  be affected.  \n\nThe results of the process hazard analysis (PHA) and the facility's operating history suggest that even this credible worst-case is extremely unlikely to occur, but it can serve as the basis for emergency planning. \n\nAccidental Release Prevention Steps\n\nSYSCO Food Services of San Antonio is committed to public safety, personnel safety, continued reliable operation, and regulatory compliance.  Based on this commitment, the Safety Manager has assumed overall responsibility for the development and implementation of the Risk Management Program.  The Safety Manager has also clearly defined accountability and responsibility for each of the prevention program elements to meet both EPA and OSHA Process Safety Management requirements.\n\nTo ensure that a worst-case or alternative release scenario does not occur, SYSCO Food Services maintains a release prevention program with the primary focus of protecting the public and plant employees from the hazards associated with an accident or release involving ammonia.  The multifaceted program includes the use of:\n\n> Ammonia"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21500,
      "SummaryText": "gas detectors and alarms to rapidly alert operators to any problems;\n\n> Process safety information to document the safe process design;\n\n> Process hazards analyses to evaluate the chemical and process hazards;\n\n> Operating procedures to ensure that the system is operated safely;\n\n> Maintenance, inspection and testing to ensure that the system is maintained according to applicable standards and manufacturer's recommendations;\n\n> Training, Hot Work Permits, Contractor Safety, and Employee Participation Programs to ensure that all employees and contractors working on and around the processes are aware of the hazards, can perform their job duties safely and know the actions to be taken in an emergency;\n\n> Management of Change and Pre-startup Safety Reviews to ensure that changes are documented, analyzed, and kept within the design basis;\n\n> Incident Investigation procedure to investigate each incident and near misses to determine root causes and make needed safety improvements; and,\n\n> Periodic Compliance Audits to ensure that our programs are working as they should to protect both the public and employees.\n \nFive-Year Accident History\n\nWithin the past five years, SYSCO Food Services of San Antonio has not had any accidental releases that resulted in injuries or property damage. The plant has maintained an excellent safety record throughout its operating history and has never had a major ammonia release that could have had adverse effects on the public.  \n\nEmergency Response\n\nIn the event that an ammonia release does occur, SYSCO Food Services of San Antonio has an emergency response program that coordinates emergency response with the San Antonio Fire Department and contract responders.  If such a release did occur, plant personnel would contact the San Antonio Fire Department, and contract responders, who would dispatch specially trained personnel to the facility. \n\nMaintaining A Safe Operation\n\nSYSCO Food Services of San Antonio continually works to safely manage t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21500,
      "SummaryText": "he hazards of ammonia to protect the community we serve and the employees working for us.  The Risk Management Program will be maintained to reduce the risk of accidental releases and each year we will conduct training, review procedures, maintain the equipment and follow safe work practices.  Periodically, we will audit our program, review our Process Hazard Analysis and coordinate with the community emergency response organization.  During the recent review and revision of operating procedures for SYSCO Food Services of San Antonio it was determined that this facility would benefit from certain refinements of those procedures.  Accordingly, we are undertaking a comprehensive effort to further upgrade the operating procedures so as to improve processes and work practices and to enhance the ability of plant personnel to assure safe and efficient control and management of the plant."
    }
  ]
}