{
  "FacilityID": 21579,
  "FacilityName": "Pacific Energy / Superior Propane",
  "FacilityStr1": "13625 Townsend-Winona Highway",
  "FacilityStr2": null,
  "FacilityCity": "Flagstaff",
  "FacilityState": "AZ",
  "FacilityZipCode": "86004",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04005",
  "LEPC": "Coconino County LEPC",
  "FacilityLatDecDegs": "35.012",
  "FacilityLongDecDegs": "-111.128",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A3",
  "LatLongDescription": "CE",
  "FacilityURL": "unitedpacificenergy.com",
  "FacilityEmailAddress": "jim@unitedpacificenergy.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Pacific Energy",
  "Company2Name": "Superior Propane",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Pacific Energy",
  "OperatorStr1": "2995 Skyline Blvd suite 207",
  "OperatorStr2": null,
  "OperatorCity": "Reno",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89509",
  "OperatorZipCodeExt": "5163",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000170879",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-03-26 00:00:00",
  "SafetyInspectionBy": "consultant",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-06-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-06-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 35.25055,
  "FRS_Long": -111.51423,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30474,
      "AltID": "Bulk Propane Storage",
      "FacilityID": 21579,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 39650,
          "ProcessID": 30474,
          "ChemicalID": 98,
          "Quantity": 321300.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 31247,
          "ProcessID": 30474,
          "NAICSCode": "454319",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 11834,
              "Process_NAICS_ID": 31247,
              "SafetyReviewDate": "2000-03-26 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "osha(29cfr1910.110)",
              "FR_Comments": null,
              "HazardReviewDate": "2000-03-26 00:00:00",
              "ChangeCompletionDate": "2000-06-01 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": "Not Required",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": "Not Requires",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-03-26 00:00:00",
              "TrainingReviewDate": "2000-03-27 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Hm126f hazmat training",
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-03-26 00:00:00",
              "EquipmentInspectionDate": "2000-03-26 00:00:00",
              "EquipmentTested": "3 inch Blackmer pump and internal shutoffs valves",
              "ComplianceAuditDate": "2000-03-26 00:00:00",
              "AuditCompletionDate": "2000-06-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "Bulk Propane Storage",
              "_chemicals": [
                {
                  "PrimaryKey": 12389,
                  "PreventionProgram2ID": 11834,
                  "ProcessChemicalID": 39650
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 21579,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2000-03-27 00:00:00",
    "ERTrainingDate": "2000-03-28 00:00:00",
    "CoordinatingAgencyName": "Doney Fire Department",
    "CoordinatingAgencyPhone": "5205269537",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21579,
      "SummaryText": "1. Accidental release Prevention and Emergency Responssse Policies\nThe primary function of the Pacific Energy / Superior Propane is to act as a propane distribution facility.  By virtue of the flammable effects associated with propane, it is necessary to observe certain safety precautions in handling propane to prevent unnecessary human exposure, to reduce the threat to our own personal health as well the health of our co-workers, and to reduc the threat to nearby members of the community.  We are strongly commited to employee, public and enviromental ssafety.  Safety at our facility depends upon the manner in which we handle propane as well as on the various safety devices incorporated into the design of our euipment.  Furthrmore, comprehensive training recieved by our employees adds to the inherent safety of our distribution facility.\nOur emergency response program is based upon the NPGA's LP-GAS Safety Handbook/ Guidelines for Davelopment Plant Emergency Procedures/ How to control LP-Gas Leaks and Fires.  In addition to the pressence of appropriate controls to prevent possible releases of propane, if a release does occur, we are completely coordinated with Doney Park Fire Department, which provides highly trained emergency response personnel to control and mitigate the effects of the release.\n2. The Stationary Source and the Regulated Substances Handled\nThe primary purpose of this faciliity is to repackage and distribute propane to both retail and wholesale customers for use as a fuel.  Propane arrives at our facility via rail car and truck and is stored in 3 storage tanks.  This facility has equipment for unloading rail cars and transports and equipment to load transports and containers.  Access to this site is restricted to authorized contractors.\nThe regulated substances handled at this faciity is propane.  The maximum amoount of propane that can be stored at this plant is 321,300 lbs. \nThe Worst Case Release Scenario(s) and the Alternative Release Scenario(s)"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21579,
      "SummaryText": ", including Administrative controls and mitigation measures to limit the distance for each reported scenario.  We have calculated worst case release scenarios based on the RMP offsite consequense guidance.  The following paragraphs provide details of the chosen scenarios.\nThe worst case release scenario submitted for propane involves a catastrophic release of propane.  The scenario involves the release of 110,680 lbs. of propane.  It is assumed that the entire quantity is released as a vapor that finds an ignition source, with 10 percent of the released quantity participaating in a vapor cloud explosion.  Under worst case weather, the maximum distance of .40 miles was obtained corresponding to a flammable endpoint of 1 psi overpressure.\nThe alternative release scenario submitted for program 2 flammable subsance involves a release of propane resulting in a vapor cloud fire.  In this scenario 1400 lbs. of propane is released in 10 minutes.  The release is also controlled by active mitigation measures that include excess flow valves.  Under neutral weather conditions, the maximum distance to the flammable endpoint of 1 psi overpressure is .10 miles.\n4. The general Accidental Release Prevention Program and the Chemical-Specific Prevention Steps.\nOur facility has taken all necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1998 Edition / California title 8.\nThe following sections sections briefly describe the release prevention program that is in place at our stationary source.\nSAFETY INFORMATION\nPacific Energy / Superior Propane maintains a detailed record of written safety information,which describes the chemical hazards, operating parameters and equipment designs associated with all aspects of our distribution facility.\nHAZARD REVIEW\nA checklist mothodology is used to carry out hazard reviews at our facility.  The reviews"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21579,
      "SummaryText": " focus on operating procedures, equipment functions and handling practices to identify possible hazards.  The studies are undertaken by a team of qualified personnel with extensive knowledge of facility operations and are revalidated at a regular interval of 1 year.  Any findings related to the hazard reviews are addressed in a safe and timely manner.\nOPERATING PROCEDURES\nFor the purpose of safely conducting activities within our covered processes, Pacific Energy / Superior Propane maintains written operating procedures.  These procedures address various modes of operations such as inttial startup, normal operations, tempoary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regulary reviewed and is readily accesible to operators involved with the processes.\nTRAINING\nPacific Energy / Superior Propane has a comprehensive training program in place o ensure that employees that are operating processes are completely competent in the operating procedures associated with these processes.  New employees recieve basic training in process operations followed by on-the job supervision until they are deemed competent to work independentely.  Refresher training is provided every year and more frequently as needed.\nMAINTENANCE\nPacific Energy / Superior Propane carries out documented maintenance checks on process equipment to ensure proper functioning.  Maintenance activities are carried ot by qualified personnel with previous training in these practices.  Any equipment deficiences identified by the maintenance checks are corrected in a safe and timely manner.\nCOMPLIANCE AUDITS\nPacific Energy / Superior Propane conducts audits on a regular basis to determine whether the provisions set out under RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\nINCIDENT INVESTIGATION\nPaci"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21579,
      "SummaryText": "fic Energy / Superior Propane promptly investigates any incident that has resulted in, or could reasonably result in, or could reasonably result in, a catastrophic release of propane.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from recurring.  All reports are retained for a minimum of 5 years.\n5. FIVE-YEAR ACCIDENT HISTORY\nPacific Energy / Superior Propane has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n6. EMERGENCY RESPONSE PLAN\nPacific Energy / Superior Propane carries a written emergency response plan to deal with accidental releases of propane.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontmination of affected areas.\nOur facility's emergency response plan is based upon the NPGA's LP-gas Handbook / Guidelines for Developing Plant Emergency Response Procedures / How to Control LP-Gas Leaks and Fires.\nTo ensure proper functioning, our emergency response equipment is regulary inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n7. PLANNED CHANGES TO IMPROVE SAFETY\nSeveral developments and findings have resulted from he implementation of the various elements of our accidental release prevention program.  We are currently in compliance with all local and federal regulations. \n\n\n\n                                                          Certification Letter\n                                \nCertification Statement for Program Level 2 Processes\n\n\nTo the best of the undersigned's knowledge, information, and \nbelief formed after reasonab"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21579,
      "SummaryText": "le inquiry, the information submitted\nis true, accurate, and complete.\n\n\n___________________       James Weaver      \nSignature                               Print Name               \n\nVice President       June 6,2000\nTitle                                   Date"
    }
  ]
}