{
  "FacilityID": 21589,
  "FacilityName": "KCPL - Hawthorn Generating Facility",
  "FacilityStr1": "8700 Hawthorn Road",
  "FacilityStr2": null,
  "FacilityCity": "Kansas City",
  "FacilityState": "MO",
  "FacilityZipCode": "64120",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29095",
  "LEPC": "Mid-America LEPC",
  "FacilityLatDecDegs": "39.128333",
  "FacilityLongDecDegs": "-94.480556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "WWW.KCPL.COM",
  "FacilityEmailAddress": "TLR6164@KCPL.COM",
  "FacilityDUNS": 602751661,
  "ParentCompanyName": "Kansas City Power & Light",
  "Company2Name": null,
  "CompanyDUNS": 877748004,
  "Company2DUNS": null,
  "OperatorName": "Hawthorn Generating Facility",
  "OperatorStr1": "8700 Hawthorn Road",
  "OperatorStr2": "P.O. Box 418679",
  "OperatorCity": "Kansas City",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "64141",
  "OperatorZipCodeExt": "9679",
  "FTE": 140,
  "OtherEPAFacilityID": "64120HWTHR8700H",
  "EPAFacilityID": "100000170913",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "(Pending)",
  "SafetyInspectionDate": "1999-02-17 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-07-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-06-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-06-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-06-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 39.130833,
  "FRS_Long": -94.477778,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30492,
      "AltID": "Ammonia Storage Tanks",
      "FacilityID": 21589,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 39670,
          "ProcessID": 30492,
          "ChemicalID": 56,
          "Quantity": 168000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 31265,
          "ProcessID": 30492,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 16828,
              "Process_NAICS_ID": 31265,
              "SafetyReviewDate": "2000-05-01 00:00:00",
              "PHA_Date": "2001-05-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-05-26 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Emergency Fire Hoses",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Ammonia Sensor and Alarm",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": "Initial PHA",
              "OpProceduresReviewDate": "2000-05-01 00:00:00",
              "TrainingReviewDate": "2000-05-01 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Operator training with engineering consulting firm that performed the HAZOP analysis.",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-05-01 00:00:00",
              "EquipmentInspectionDate": "2000-07-01 00:00:00",
              "EquipmentTested": "Unit #9 entire system will be inspected in 2000 prior to start-up.  Unit #5 equipment will be inspected after installation.",
              "ChangeMgmtDate": "2000-07-01 00:00:00",
              "ChangeMgmtReviewDate": "2000-07-01 00:00:00",
              "PreStartupReviewDate": "2000-05-01 00:00:00",
              "ComplianceAuditDate": "2001-07-01 00:00:00",
              "AuditCompletionDate": "2001-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-05-01 00:00:00",
              "HotWorkPermitReviewDate": "2000-06-01 00:00:00",
              "ContractorSafetyReviewDate": "2000-05-22 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 24397,
                  "PreventionProgram3ID": 16828,
                  "ProcessChemicalID": 39670
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 21589,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-05-01 00:00:00",
    "ERTrainingDate": "2000-06-30 00:00:00",
    "CoordinatingAgencyName": "Jackson County Mid-America LEPC",
    "CoordinatingAgencyPhone": "8164744240",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "CAA"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21589,
      "SummaryText": "Introduction\nThe Kansas City Power & Light (KCPL) Hawthorn Generating Station maintains one substance, anhydrous ammonia, on site in amounts exceeding the RMP rule threshold quantities. The listed RMP rule threshold quantity is 10,000 pounds.  KCPL will store the chemical in one 8,000 gallon tank (37,000 pounds) and one 30,000 gallon tank (140,000 pounds). The storage and management of anhydrous ammonia for both systems is addressed in this RMP plan.\n\nAnhydrous ammonia will be used at the Hawthorn Generating Station as an air pollution control additive, to minimize the formation of nitrogen oxides in boiler flue gas emissions.  There are two boiler units, each equipped with selective catalytic reduction (SCR) devices.  A 30,000 gallon ammonia tank services Unit #5 and an 8,000 gallon tank services Unit #9.  These tanks and associated piping systems are addressed in this Risk Management Plan.  \n\nPlant Description\nThe Hawthorn Generating Station is located in Jackson County, Missouri, at 8700 Hawthorn Road, Kansas City.  The facility is situated east of Interstate I-435 on the south bank of the Missouri River, west of the confluence of the Missouri and Blue Rivers.  The property south and west of the Hawthorn Generating Station is urban and occupied by other industrial entities.  The strip of property directly across the Missouri River from the Hawthorn Generating Station is generally not developed and wooded. \n\nAmmonia System Description\nEach of the ammonia storage tanks is designed to be filled by a tanker truck at a dedicated loading station.  The tanks will be maintained at a pressure of 60-100 psi, by drawing liquid ammonia from the bottom of each, heating it in one of two electric vaporizers and routing the ammonia vapor back to the tank head space.  For the nitrogen oxides control system, ammonia vapors will be drawn from the tanks, regulated for pressure, mixed with air, and injected into the boiler flues within each respective ammonia injection grid.  In comb"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21589,
      "SummaryText": "ination with the catalyst in the selective catalyst reduction unit, nitrogen oxides will be reacted and emissions of the pollutant will be reduced.\n\nThe Worst Case Release Scenario\nThe worst case release scenario for ammonia was calculated as the loss of the larger 30,000-gallon tank in accordance with the definition provided in the Environmental Protection Agency (EPA) guidance for RMP development.  The ammonia would be released as a gas.  As required by the rule, only administrative control systems such as the company policy to fill the tanks to a maximum of 85% liquid by volume, were taken into consideration.  The conditions of the scenario, such as release time and weather status are those specified in the EPA Off-Site Consequence Analysis Guidance.  The area of potential impact was determined using RMP*Comp, modeling software developed by the EPA. \n\nThe results of the Off-Site Consequence Analysis indicated that the ammonia would travel approximately 4.4 miles under the specified weather conditions before dispersing in the atmosphere to the specified toxic endpoint concentration of 0.14 mg/l.  Within this radius from the ammonia tanks, an estimated 160,000 persons could potentially be affected.  Maps of the area and a list of the types of receptors in the potential impact area are provided in the Off-Site Impact Analysis Section.  \n\nThis type of rapid release would occur only if the ammonia tanks were breached.  The likelihood of such an incident occurring is miniscule, anhydrous ammonia tanks are installed with multiple safety systems to prevent the release of an entire tank in a single event.  There have been no incidents of ammonia tank breaches reported in the nationwide EPA - Chemical Emergency Preparedness and Prevention Office database.  \n\nAlso, in the event of a release, it is highly unlikely that the ammonia would disperse in a circular pattern given the weather conditions in Kansas City.  During a release, it is expected that an ammonia plume would di"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21589,
      "SummaryText": "sperse in the direction of the prevailing wind at the time of the event, as opposed to covering the entire area defined by a circle with a radius of 4.4 miles.      \n\nAlternative Release Scenario\nThe alternative release scenario is, by definition, a more likely release scenario than the worst case.  Engineered controls, such as automatic shut-off valves, check valves, relief valves, ammonia vapor leak detection system and alarms and water misting system are considered in the analysis.  \n\nThe type of system failure identified for the alternative release was a loss of ammonia caused by a major leak in the liquid piping network between the tank and vaporizers.  As a conservative estimate, the rate of release was assumed to be the maximum flow that would not cause the ammonia storage tank liquid excess flow valves to automatically shut.  The leak was assumed to continue until the ammonia vapor detector sounds an alarm, alerting an operator to check the ammonia system. The main isolation valve would be closed manually if it is safe to do so.  If the ammonia vapor concentration is unsafe for facility response, the Kansas City Fire Department will be called to respond to the emergency.  The estimated worst case time of leak detection and complete response for the Fire Department in the alternate release scenario is 60 minutes.  \n\nThe results of the Off-Site Consequence Analysis using RMP*Comp, indicated that the ammonia would travel approximately 0.3 miles (1600 feet) under the specified weather conditions before dispersing to the toxic end point concentration.  Within that radius of the ammonia tank storage area, the only receptors include plant personnel and employees of the adjoining industrial facilities.  Maps of the area and a list of the types of receptors in the potential impact area are provided in the Off-Site Impact Analysis Section.\n\nProcess Hazard Assessment\nA process hazard assessment was performed of the ammonia system using a Hazard and Operability Analysis"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21589,
      "SummaryText": "(HAZOP) type safety review.  The ammonia tanks and associated systems were reviewed for compliance with the American National Standards Institute standards for ammonia (ANSI K-61.1 - American National Standard Safety Requirements for the Storage and Handling of Anhydrous Ammonia).  Compliance with code requirements regarding the storage tanks, unloading station, piping system, vaporizers, air dilution equipment and ammonia injection grid as well as operational practices and protocols associated with anhydrous ammonia management were assessed.  A separate HAZOP was performed for each tank system.  A copy of each HAZOP is provided in the Process Hazard Analysis Section.  \n\nDuring the HAZOP analysis the entire system was methodically assessed/evaluated.  Points in the system where ammonia could potentially be released were identified.  Potential failure points, maintenance and inspection concerns, and standard operating procedures were reviewed for each element in the system. Valves that are relied on to respond to an ammonia release were identified as shown on the system engineering diagrams. Comments and recommendations are summarized in the Process Hazard Assessment section.  The Hazard Assessment will be reviewed in detail when the systems installations are complete.\n\nPrevention System\nThe Hawthorn Generating Station will have operation, maintenance and inspection procedures for the anhydrous ammonia system.  There will be Operation and Maintenance manuals for each major piece of equipment, and personnel will receive training before being allowed to work on the systems.\n\nThe ammonia systems will be visually inspected once per shift on a 24-hour per day basis.  Standard operating procedures (SOPs) for startup, shutdown, normal operation and emergency operation of both ammonia storage systems will be in place when operation begins.  The SOPs will be written and posted in appropriate areas.  Personnel will be trained annually on safety concerns and general operation"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21589,
      "SummaryText": "procedures as well as emergency procedures.  \n\nAmmonia sensors with alarms will be installed within the proximity of the largest ammonia tank that will indicate leaks.  The larger ammonia tank at Unit #5 will be equipped with a water sprinkler system on the exterior of the tank to cool the tank and piping.  Both tanks are located outdoors which will better ventilate the areas.  The Unit #5 tank will be equipped with a open-sided sun-cap roof.  \n\nEmergency Response Plan\nThe Plant's Emergency Response Plan was modified to address ammonia incident response.  Plant personnel will be trained to respond to leaks that can be managed by shutting off key emergency valves.  Any response requiring entry into a dangerous atmosphere or situation will be performed by the Kansas City Fire Department (KCFD).  Ammonia response procedures will be discussed during the annual inspection by the KCFD.  A copy of the Hawthorn Station's modified Emergency Action Plan is included.\n\nAccident History\nThe Hawthorn Generating Station has had no ammonia releases in its history, as the two ammonia storage tanks are new to the facility."
    }
  ]
}