{
  "FacilityID": 21619,
  "FacilityName": "Turner Dairy - Covington, Tennessee",
  "FacilityStr1": "653 Turner Lane",
  "FacilityStr2": null,
  "FacilityCity": "Covington",
  "FacilityState": "TN",
  "FacilityZipCode": "38019",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47167",
  "LEPC": "Tipton County LEPC",
  "FacilityLatDecDegs": "35.579556",
  "FacilityLongDecDegs": "-89.661583",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.turnerdairy.com",
  "FacilityEmailAddress": "gingerbeasley@turnerdairy.com",
  "FacilityDUNS": 34612663,
  "ParentCompanyName": "Turner Holdings, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Turner Holdings, LLC",
  "OperatorStr1": "653 Turner Lane",
  "OperatorStr2": null,
  "OperatorCity": "Covington",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "38019",
  "OperatorZipCodeExt": null,
  "FTE": 125,
  "OtherEPAFacilityID": "MRM199920174000",
  "EPAFacilityID": "100000171039",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-07-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-07-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-02-20 00:00:00",
  "DeRegistrationEffectiveDate": "2014-01-01 00:00:00",
  "AnniversaryDate": "2005-07-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 35.568218,
  "FRS_Long": -89.658491,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30562,
      "AltID": "Refrigeration",
      "FacilityID": 21619,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 39853,
          "ProcessID": 30562,
          "ChemicalID": 56,
          "Quantity": 28400.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 31336,
          "ProcessID": 30562,
          "NAICSCode": "31152",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 16884,
              "Process_NAICS_ID": 31336,
              "SafetyReviewDate": "2000-06-01 00:00:00",
              "PHA_Date": "2000-08-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-06-01 00:00:00",
              "TrainingReviewDate": "2000-06-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-06-01 00:00:00",
              "EquipmentInspectionDate": "2000-06-01 00:00:00",
              "EquipmentTested": "Compressors, Recirculating tanks, Condensers, Evaporators, Receiver",
              "ChangeMgmtDate": "2000-06-01 00:00:00",
              "ChangeMgmtReviewDate": "2000-06-01 00:00:00",
              "PreStartupReviewDate": "2000-06-01 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-06-29 00:00:00",
              "HotWorkPermitReviewDate": "2000-06-28 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 24562,
                  "PreventionProgram3ID": 16884,
                  "ProcessChemicalID": 39853
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 21619,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-01-01 00:00:00",
    "ERTrainingDate": "2000-04-01 00:00:00",
    "CoordinatingAgencyName": "Covington Fire Dept North Station",
    "CoordinatingAgencyPhone": "9014762578",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21619,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies at Turner Dairy.\n-The policy of Turner Dairy - Covington, Tennessee is to develop those programs necessary to protect the public and the environment against hazards that may cause sickness, or environmental contamination now or in the future. As the operator of a facility at which substances may be used that in uncontrolled \nsituations could cause harm to the public and damage to the environment, we will strive for environmental excellence with a commitment to continual improvement, pollution prevention and compliance with legislative requirements. The Risk Management Program in conjunction with the Process Safety Management (PSM) program is one of these programs.\n-Each employee in areas where the RMP is applicable will be knowledgeable of the related policies and procedures and the supervisors or a designated person is required to insure that they understand them. Employees and supervisors are required to comply with our policies and that are subject to corrective action in those cases determined to indicate willful violation. A written plan of action regarding the implementation of employee participation in the program has been developed. In accordance with a specific schedule outlined by the standard, as per 29 CFR 1910.119, Turner Dairy has completed a \ncompilation of written process safety information concerning the process and operations involved with Anhydrous Ammonia of these standards of operating procedures. For purposes of defining a process covered under this program, the use of Anhydrous Ammonia as a refrigerant system has been considered a process, whereas a production or usage system/function is considered an \noperation. By identifying each functional operation, the team was better able to ascertain the potential and develop preparation plans in the case of a release. This compilation of information is to enable Turner Dairy and the employees involved in the operations related to Anhydr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21619,
      "SummaryText": "ous Ammonia to identify and \nunderstand the hazards posed by these processes. This process safety information includes information pertaining to the toxicological and physical hazards of the chemical listed.\n-A complete hazard analysis and study of the ammonia system's mechanical integrity has been completed on the ammonia receipt, storage, and utilization operations have been completed. This analysis was completed by safety and health staff, engineering and maintenance personnel, and certain operational \npersonnel. This analyses involved a review of each operation of the processes to address steps for each operating phase, operating limits, safety and health considerations, and safety systems and their functions. The assessment also includes information concerning the emergency action plans related to the \nprocess; development and implementation of safe work practices regarding the control of entrance and exit of personnel in the process areas; pre-startup safety; mechanical integrity of equipment; inspection and testing, correction of deficiencies in equipment, planned or unexpected changes to the process, \nequipment, and procedures to the processes.\n-A system was developed and is maintained to promptly address the team's findings and recommendations. Also, a written schedule of when these actions are to be completed has been developed, indicating by whom and when. The hazard analyses will be updated as needed and at least every five (5) years.\n-Turner Dairy has developed and implemented written operating procedures to provide clear instructions for safely conducting activities involved in the processes at each operation by our employees. These procedures are consistent with the process safety information and to address steps for each handling \nphase, limitations, safety and health considerations, and safety systems and their functions. Other written documentation of standard operating procedures as a part of this program is included in the following documents:\nMe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21619,
      "SummaryText": "chanical Integrity Study of Process Equipment\nPreventive Maintenance Program\nWritten Emergency Response Plan\nEmployee Emergency Action and Evacuation Plan\nEach employee involved in operations within the processes where Anhydrous Ammonia is received, processed, or used at the facility has been trained in an overview of the processes and in the operating procedures as outlined by OSHA regulations. Refresher training is required every three (3) years and more often if necessary. Training includes: Emphasis on the specific safety and health hazards; Emergency operations in the case of a release including shutdown; and Safe work practices applicable to the employee's job tasks. Designated personnel have specific responsibilities related to the use of \ncontractors who perform maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to areas where the Anhydrous Ammonia is received, stored, or processed in the facility. These responsibilities include: specific requirements in selection of contractors regarding the contractor's \nsafety performance and programs; the provision of information concerning the emergency action plans related to the process; development and implementation of safe work practices regarding the control of entrance and exit of contract employers and contract employees in the process areas; periodic evaluation of the contractor related to safety management at the process; maintenance of certain records related to contractor employee injury and illness; development of written procedures for any new processes; and provision of training to employees.\n-Contractors performing work on or adjacent to equipment or processes in which Anhydrous Ammonia is present must have clearance from the Maintenance Supervisor prior to beginning operations. Each contractor will also complete the Turner Dairy Visitor and Contractor Safety Rules form prior to entry into the facility. In those cases where contractors will perform work directly to or o"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21619,
      "SummaryText": "n the process equipment in which the Anhydrous Ammonia is present, the Safety Coordinator and Maintenance Supervisor will provide an orientation session to them prior to beginning operations. This orientation will include an introduction to the Turner Dairy Safety Management Program, information concerning the toxicological and \nphysical hazards of Anhydrous Ammonia, and the emergency response plan in the case of an incident involving a release. Upon completion, the contractor will be issued a permit by the Maintenance Supervisor to begin work.\n-A program has been developed for inspection and testing, correction of deficiencies in equipment, quality assurance, management of changes in the handling of the Anhydrous Ammonia, and procedures to the process, and compliance audits.\n-Equipment Preventive Maintenance and Quality Assurance Program - In an effort to maintain the mechanical integrity and to complete repairs of the equipment in the process, the Maintenance Supervisor oversees a Preventive Maintenance Program.\n-Management of Change - To insure that proper safety precautions are initiated when change in the operations of the process occurs, the PSM committee will meet to discuss the planned changes before authorization is given. The committee will address the following issues prior to approval of a change in the \nprocess: The technical basis for the proposed change; Impact of the change on employee safety and health; Modifications to operating procedures; and, Necessary time period for the change. If changes are decided upon, training for personnel in the operation will be provided. Also, any changes to be made will be evaluated by performing a Hazard Operability Study to identify any hazards and/or actions that must be taken, Additionally, if a change covered by these procedures results in a change in the process safety information, such information will be updated accordingly.\n-Pre-Startup Safety Review - To insure that proper safety precautions are initiated w"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 21619,
      "SummaryText": "the distribution of liquid ammonia through piping (coils) across which air is blown with fans to cool the air. The water chilling process involves the distribution of liquid ammonia through piping (coils) around \nwhich water flows for chilling. The glycol cooling involves the use of liquid ammonia flowing through coils cooling the glycol to a temperature of approximately 25 degrees and is used to cool the product coming from the HTST system.\n-Technology of the Process\nRefrigeration is the control of heat. According to American Heritage Dictionary heat is defined as: The energy associated with the motion of atoms or molecules in solids, which can be transmitted through solid and fluid media by conduction, through fluid media by convection and through empty space by radiation.\nHeat is energy. The amount of motion or excitement of the atoms or molecules determines the amount of energy or heat available. The more excited the molecules, the more energy or heat available. This energy or heat can be moved or transferred. This transfer occurs when there is a difference of temperature. Heat flows from a source of greater energy (higher temperature) to a source of lower energy (lower temperature). The greater the temperature difference, the more rapid the heat flow. There are three types of heat transfer mechanisms: Conduction, Convection and Radiation. The use of liquid ammonia as a refrigerant is the transferring of heat by conduction and convection. In conduction the molecules in a medium coming in contact with each other transfer heat. The warm molecules collide with colder molecules giving them some of the energy (heat). The flow will occur if there is a difference of temperature from one side of the medium to the other. Metals are very good at transferring heat by conduction. By blowing air or moving a liquid such as water or glycol over a material such as \nmetal that has been cooled, heat is transferred by convection. The heat load in a freezer is moved via convectio"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 21619,
      "SummaryText": "n to the coils where conduction takes place in transferring the heat to the refrigerant. The refrigeration process does not produce cold. It simply moves the heat from an area where it is not wanted to a place it can be discharged. \n-Turner Dairy receives Anhydrous Ammonia by wheeled vehicle. The receiver has a maximum of 1,500 gallons, which is filled to 80% capacity. The Anhydrous Ammonia is in a liquid form at receipt. Contract personnel complete the connection to the tank. Liquid ammonia has the ability to absorb very large amounts of heat as it vaporizes. This ability is the basis for mechanical refrigeration systems. These \nmechanical systems utilize both pressure and temperature in the refrigeration cycle. There are five major components in a mechanical refrigeration system. These include 1) Receiver, 2) Metering device/expansion valves, 3) Evaporator, 4) Compressor, and 5) Condenser. From the receiver (Add-In Tank) the liquid flows via the Hot Gas Line to the six evaporators for the Ice Cream Vault; to the eight (8) Frick Air Units in the Milk Vault, and to the dump tank of the Watkins Accumulator. From the Ice Cream \nVault and the Frick Unit the gas enters the Low Pressure Side, and the Recirculating Tank via a High Pressure Line. From the Low-Pressure side the gas goes to the Booster Compressors. Hot gas travels to the condensers. Liquid is received from the condensers to the Liquid Receiver. The level of liquid in the Recirculating Tank is maintained at approximately 78% of its capacity with an audible and visual (lights) alarm if level exceeds this level, and also an additional alarm if the level reaches the 85% level. From the Recirculating Tank, ammonia liquid is pumped to the Shell & Tubes of Evaporator 4, 5, and 6, above the Ice Cream Vault, Evaporators 1, 2 and 3 in the Milk Vaults, Frick Air Units in the Milk Vault, to the HX-6 Heat Exchanger, to Ice Builders #1 and #2,#3 and#4, the Intercooler, to HX-1 Heat Exchanger, and \nCompressors HC-3, HC-4,"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 21619,
      "SummaryText": "and HC-5. From the Recirculating Tank, gas from the top enters into the High Pressure System to the High Side Compressors, then to cool storage tanks. Then the ammonia goes out to the High Pressure Line and is returned to the recirculating tank via the low pressure system, to the evaporator and the Accumulator on the two (2) Shell & Tube Heat Exchangers, to the evaporator in \nMilk Storage out to the High Pressure Line and returned to the recirculating tank via the low pressure system, to the Ice Builder, to the Accumulator on the Shell & Tube, to the Accumulator on the King Air Unit in the Ice Cream Vault, and to the evaporator in the Milk Vault.\n-Description of Monitoring Devices:\nThere are high level and low level alarms. These alarms are both audible and visible. Also, high head cut out alarms are found in the plant which are both audible and visible. \n-Program Review:\nOSHA PSM Applicability - 29 CFR 1910.119 \nAs a part of the process of refrigeration with Anhydrous Ammonia, Turner Dairy uses Ammonia with threshold quantities in assess of 10,000 pounds. As such, the facility is subject to the requirements set forth by the Occupational Safety and Health Administration's (OSHA) standard 29 CFR 1910.119.\n-Program Review Meeting\nA completion of the program elements in accordance with the requirements of 29 CFR 1910.119 was conducted on December 13, 1999. The attendees included:\nRick Slamp, Plant Manager\nGinger Beasley, Safety Coordinator\nKelley Ray, Maintenance Supervisor\nAndy McCullough, I/C Plant Supervisor\nJudy Wilson, HRD\nThe purposes of the meeting included: Review of Five Year History, Review of Changes since PHA, Determination of Worst Case Scenario, and Determination of Alternative Case Scenario.\n-Changes Instituted since the PHA\nThere have been no significant mechanical changes or changes in work practices since the conduction of the Process Hazard Analysis - HAZOPs in June 1999.\n-Worst Case Scenario and Alternative Release Scenario\nTurner Dairy has conducte"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 21619,
      "SummaryText": "d a comprehensive hazard assessment. This proactive program concerns the hazards of ammonia and its effect on our employees and community. The hazard assessment and the RMP has defined the toxic endpoint and determined the populations and public areas within the radius. They have also determined environmental receptors within this radiance that would also be affected by an accidental release.\nThe worst case scenario for Anhydrous Ammonia was decided as the complete rapid loss of 1,500 pounds of Anhydrous Ammonia during a ten-minute time frame. The following information was determined using the RMP*Comp Consequence Analysis model based on the stability class F, 1.5 m/s wind speed, \nand the IDLH level of 150ppm for Anhydrous Ammonia. This resulted in a release rate of 150 lbs./min., and an endpoint of .7 miles from the spill point a temperature of 77 degrees.\n-Alternative Case Scenario\nThe alternative case scenario for Anhydrous Ammonia was decided as the loss of Anhydrous Ammonia resulting from a release through a 1-inch line break. The following information was determined using the RMP*Comp Consequence Analysis model, based on the stability class D, 3 m/s wind speed, and the IDLH \nlevel of 200ppm for Anhydrous Ammonia. This resulted in a release rate of 2 lbs./min., for the duration of 15 minutes, and an endpoint of .1 miles from the spill point. \n-General accidental release prevention program and chemical-specific prevention steps\nPrevention of a release is a core component of the Turner Dairy - Covington, TN plant Risk Management Program. This program is designed to insure proper work practices and an on-going mechanical integrity program. This program also insures compliance with 29 CFR 1910.38, 1910.120, 1910.1200, 40 CFR, Part \n68, Part 112, and Part 260.\n-Turner Dairy has developed and implemented written operating procedures to provide clear instructions for safely conducting activities involved in the processes at each operation by our employees, consistent"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 21619,
      "SummaryText": "with the process safety information and to address steps for each handling phase, limitations, safety and health considerations, and safety systems and their functions. Other written documentation of standard operation procedures as a part of this program is included in the following documents. \nMechanical Integrity Study of Process Equipment\nPreventive Maintenance Program\nWritten Emergency Response Plan\nEmployee Emergency Action and Evacuation Plan\nTraining\nEach employee involved in operations within the process where ammonia is received, processed, or used at the facility has been trained in an overview of the process and in the operation procedures as outlined by 29 CFR 1910.119. Refresher training is provided no less than every three years and more often if \nnecessary. \n-Mechanical Integrity\nEach maintenance person who has responsibilities to perform maintenance on the process components receives training on an as needed basis, but no less than every three years.\nEmergency Response\nOffensive level HAZMAT emergency response support is provided by the local fire station. Their response time for emergencies at the facility is approximately five minutes.\nContractors\nDesignated personnel have specific responsibilities related to the use of contractors who perform maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to areas where the ammonia is received, stored, or processed in the facility. These responsibilities include specific requirements in selection of contractors regarding the contractor's safety performance and \nprogram; the provision of information concerning the emergency action plans related to the process; development and implementation of safety work practices regarding the control of entrance and exit of contract employers and contract employees in the process areas, periodic evaluation of the contractor related to safety management at the process; maintenance of certain records related to contractor employee injury and"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 21619,
      "SummaryText": "illness; development of written procedures for any new processes, and provisions of training to employees.\n-Five Year History\nIn the past five years, there have been no incidents involving the release of ammonia.\n-Emergency Response Program Outline\nWritten Emergency Response Plan\nTrained and equipped Emergency Action Team in accordance with 29 CFR 1910.120\nDevelopment of a written Implementation Plan of Action\nConduction of Hazard Analysis on routine and periodic basis\nDevelopment of and documentation of safe work practices\nInitial and periodic training of employees\nConduction of pre-startup safety reviews\nConduction of Compliance Audits\nConduction of Incident Investigations\nContractor Program Safety Program\nHot Work Permit Program\nProcess Safety Management and Chemical Accidental Release Prevention Committee\nMechanical Integrity and Preventive Maintenance Program\nDetermination and planning for Worst Case and Alternative Case Release Scenarios\nContinual evaluation for methods to improve facility safety - Safety Committee\nMeetings with the Local Emergency Planning Committee and Fire Department\n-Planned Changes to Improve Safety\nIn an attempt to insure a continual improvement in the facility worker protection and release prevention programs, training concerning this safety and environmental program and others is conducted for eight hours each month. This training requires the attendance by all personnel whose job may have any \nrelationship to the ammonia operations."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21619,
      "SummaryText": "hen shutdown and startup of the systems occurs after such things as renovations or major repairs, the PSM Committee will meet to discuss the changes. The committee will decide if the changes are significant enough to require a change in the process safety information. If the modification is significant enough to require such a hange the committee will confirm the following: Construction and equipment are in accordance with design \nspecifications, safety, operating, maintenance, and emergency procedures are in place and are adequate, A process hazard analysis has been performed for new facilities and recommendations have been resolved or implemented before startup, and modified facilities meet the management of change requirements; and, Training of each employee involved in operating the process has been completed.\n-Compliance Audits - Compliance audits will be conducted with these operating procedures at least every three (3) years to verify that the procedures and practices developed are adequate and are being followed. The PSM Committee will certify that they have evaluated compliance with the provisions of the \nprogram. The compliance audit must be conducted by at least one person knowledgeable in the process and a report of the findings will be developed and documented noting any deficiencies that have been corrected. The written report of the two-(2) most recent audit reports will be retained.\nIncident Investigation - A crucial part of the Turner Dairy process safety management program is a thorough investigation of incidents to identify the chain of events and causes so that corrective measures can be developed and implemented. An investigation will be conducted on each incident that resulted in, or could reasonably have resulted in a catastrophic release of the Anhydrous Ammonia in the workplace. Accident Investigations will be conducted by: Plant Manager, Safety Coordinator, Maintenance Supervisor.\n-Emergency Planning and Response - The facility Emergency Re"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 21619,
      "SummaryText": "sponse Plan will be maintained according to the provisions of 29 CFR 1910.38 and 29 CFR 1910.120 and EPA guidelines.\nMaximum Intended Inventory - The maximum inventory onsite is 28,404 pounds. The Maintenance Supervisor will monitor these inventories.\n-Hot Work Permits - In accordance with 29 CFR 1910.252, authorization is required from a designated person before cutting or welding is permitted in areas not specifically designed for such purposes. Based on fire potentials of the plant facility, areas are established for cutting and welding and procedures for a \npermit for other areas. Prior to welding or cutting in other than established areas, any Turner Dairy employee or contract employee must acquire a written permit. \n-The Turner Dairy - Covington, Tennessee Facility and the Ammonia Process\nTurner Dairy provides employment for 125 employees in Covington, Tennessee. \nThis facility is a dairy processing plant owned by Turner Holdings, LLC. As a processor of dairy products its products are sold nationally under its corporate company, Turner Dairies, LLC, 653 Turner Lane, Covington, Tennessee 38019.\nSite Description: \nThe facility is located at 653 Turner Lane, Covington, Tennessee 38019. \nGeography and Weather:\nCovington is located in Tipton County in the Western part of Tennessee, approximately 40 miles from Memphis and 20 miles East of the Mississippi River. The annual average temperature is 60 degrees; summer (July) temperature 80 degrees; winter (January) 40 degrees; average annual rainfall 50; average annual snowfall 5; prevailing winds south-southwest.\nTransportation:\nAir: The Covington airport features a 5,000' runway and a new modern terminal building. Complete services are available to include courtesy cars. The Memphis International airport is 40 minutes away, which serves American, Delta, United, USAir, Northwest and others.\nRail: The mainline of Illinois Central passes directly through Tipton County. Memphis is the largest yard in the IC system. Water"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 21619,
      "SummaryText": ": The Mississippi River borders Tipton County on the west. The port of Memphis is the second largest port on the Mississippi that has five terminals and the Lash Intermodal terminal. \nHighway: US Highway 51 provides direct access to Memphis where Interstate 40 and 55 meet. Main state highways are 59 and 54.\nPopulation and Labor Force:\nThe Greater Covington Area population is 10,000. Tipton County population is 38,500. The total Civilian Labor Force for Tipton County is 20,280.\nGovernment and Law Enforcement:\nThe government type for Covington is Mayor and Aldermen. Covington employs 23 full-time police officers.\nFire Department:\nCovington has a Class 4 fire rating, with 20 full-time firefighters and 18 volunteer firefighters. The department operates 2 fire stations with 3 pumpers, 1 tanker and 1 aerial ladder truck per station. \nSchools:\nFive elementary schools, three middle schools, three high schools, a state technology center, and a community college branch service the county.\nMedical Care:\nBaptist Memorial Hospital-Tipton is a modern, fully accredited facility that handles general medical, surgical, and obstetrical patients. Other medical services include Professional Counseling Services, Tipton County Ambulance Service, Covington Manor Nursing Home, and Tipton County Health Department. The \ncounty has enhanced 911 emergency service.\n-Operation Description:\nThe site process involves the receipt of raw milk with the processing and production into various dairy products for distribution commercially to the public. The raw milk is delivered to the processing site by tanker truck directly from dairy farms. Upon receipt the milk is unloaded in large storage tanks. \nFrom the time of receipt and throughout the processing system, the milk is maintained at a cool temperature by three different refrigeration processes: 1) air-cooling, 2) water chilling, and 3) glycol cooling. The refrigeration of these media is by use of Anhydrous Ammonia. The air cooling process involves"
    }
  ]
}