{
  "FacilityID": 21688,
  "FacilityName": "Lucich Farms Cold Storage",
  "FacilityStr1": "17808 Zerker Road",
  "FacilityStr2": null,
  "FacilityCity": "Bakersfield",
  "FacilityState": "CA",
  "FacilityZipCode": "93308",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.501944",
  "FacilityLongDecDegs": "-119.151944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Stevco Inc./Lucich Farms",
  "Company2Name": null,
  "CompanyDUNS": 70650668,
  "Company2DUNS": null,
  "OperatorName": "Stevco Inc.",
  "OperatorStr1": "P.O. Box 1266",
  "OperatorStr2": null,
  "OperatorCity": "Delano",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93216",
  "OperatorZipCodeExt": null,
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000171262",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-08-01 00:00:00",
  "SafetyInspectionBy": "Kern County Building Dept.",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-08-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-08-01 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-07-31 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-07-31 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 35.506332,
  "FRS_Long": -119.149837,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30703,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 21688,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 40157,
          "ProcessID": 30703,
          "ChemicalID": 56,
          "Quantity": 21000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 31478,
          "ProcessID": 30703,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 16991,
              "Process_NAICS_ID": 31478,
              "SafetyReviewDate": "2000-08-07 00:00:00",
              "PHA_Date": "2000-08-07 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-08-07 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Diffusion tank",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-08-11 00:00:00",
              "TrainingReviewDate": "2000-08-11 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-08-11 00:00:00",
              "EquipmentInspectionDate": "2000-08-11 00:00:00",
              "EquipmentTested": "All ammonia equipment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2000-08-07 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-08-07 00:00:00",
              "HotWorkPermitReviewDate": "2000-08-07 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2000-08-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 24784,
                  "PreventionProgram3ID": 16991,
                  "ProcessChemicalID": 40157
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 21688,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Kern County Environmental Health",
    "CoordinatingAgencyPhone": "6618628700",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21688,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nLucich Farms utilizes anhydrous ammonia in the refrigeration system at their cold \nstorage facility east of Shafter, California.  As it is Lucich Farms' policy to comply \nwith all applicable governmental regulations, the cold storage facility was \ndesigned and constructed in accordance with the Uniform Building and Uniform \nMechanical Codes.  Conformance with these code requirements ensures that the \nbuilding and refrigeration system meet specific design and installation \nrequirements that reduce the risk of accidental releases.  \n\nPersonnel from Lucich Farms monitor the daily operation of the refrigeration \nsystem.  All major service, maintenance, and repairs to the ammonia refrigeration \nsystem are contracted to a qualified licensed refrigeration contractor specializing \nin ammonia refrigeration.  Utilizing an experienced qualified contractor to perform \nmajor service, maintenance, and repairs ensures that the equipment is in \nexcellent operating condition. \n\nWhile it is Lucich Farms' objective to be a responsible citizen of the community in \nall of its business activities, the limited staff at the cold storage facility precludes \nemergency response operations.  As such, an emergency action plan has been \nprepared for Lucich Farms and a chain of command to respond to emergencies \nhas been established.\n\nDescription of the Stationary Source and Regulated Substances \n\nLucich Farms owns and operates a cold storage facility located at 17808 Zerker \nRoad.  Shafter is the closest city to the Lucich Farms Cold Storage facility.  The \ncold storage facility was constructed in 2000 utilizing all new equipment at the \ntime of construction.  \n\nAnhydrous ammonia is used as the refrigerant that provides process cooling for \nthe Lucich Farms Cold Storage facility.  The refrigeration system consists of a \nsuction accumulator with a liquid transfer system, three compressors, two \nevaporative condense"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21688,
      "SummaryText": "rs, a high pressure receiver, a glycol chiller, a large pre-\ncooler room, four cold storage rooms, and the associated hallway, staging and \nshipping areas.  Roof mounted accumulators supply liquid ammonia to the \nflooded evaporators in the pre-cooler room, cold storage rooms, and the hallway, \nstaging and shipping areas.  Refrigerated glycol is circulated from the engine \nroom glycol chiller to the evaporator in the electrical room for space cooling. \n\nDuring normal operation, the anhydrous ammonia is distributed throughout the \nrefrigeration system.  However, during major maintenance activities, the entire \nrefrigeration system can be \"pumped down\" to evacuate the ammonia from the \nsystem and store it in the high pressure receiver.  The maximum quantity of \nammonia that can be stored in the high pressure receiver is approximately \n21,000 pounds. \n\nWorst-Case Release Scenario and Alternative Release Scenario\n\nOffsite consequence analyses are used as tools to assist in emergency response \nplanning.  The RMP regulations require the owner or operator of a stationary \nsource to analyze the offsite impacts due to an accidental release of a regulated \nsubstance.  The offsite consequence analysis for a Program 3 process must \nanalyze the worst-case release scenario and an alternative release scenario.  \nSince Lucich Farms' ammonia-based refrigeration system is considered a \nProgram 3 process, both release scenarios were evaluated in the offsite \nconsequence analysis.\n\nThe offsite consequence analysis must include an estimate of the residential \npopulation within an area potentially affected by the accidental release scenario.  \nThis area is defined as a circle with a radius equivalent to the distance the \nrelease would travel with concentrations at or above the endpoint.  The circle \nalso defines the area in which potential environmental receptors must be \nidentified.  For purposes of the offsite consequence analyses, the RMP \nregulations define the toxic endpoint for anhy"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21688,
      "SummaryText": "drous ammonia as 0.14 mg/l (200 \nppm).\n\nThe worst case release is defined by the U.S. EPA as the total release of the \ncontents of the single largest vessel or pipe within 10 minutes.  For liquefied \ngases stored under pressure, the entire contents of the vessel or pipe are \nassumed to be released as a vapor.  A total vapor release is highly unlikely.  \nHowever, this standardized worst case scenario was developed for emergency \nresponse agencies to use for planning purposes.\n\nAn alternative release scenario is a release that is more likely to occur than the \nworst-case release scenario.  For Lucich Farms, the alternative release scenario \nwas selected based on the results of the Process Hazard Analysis (PHA) for the \nammonia-based refrigeration system.  A credible release event with a high \ndischarge rate would potentially have the greatest offsite impact.  A leak from a \nvalve packing was identified in the PHA as having a medium probability of \noccurrence with a discharge rate high enough to cause an offsite consequence, \nand therefore, was chosen as the alternative release scenario.    \n\nLucich Farms has analyzed the offsite consequences of the worst-case and \nalternative release scenarios.  For the worst-case release scenario, the release \nof 21,000 lbs. of ammonia over a 10 minutes period, the plume would travel 1.7 \nmiles at concentrations at or above the endpoint.  Using 1990 Census data, the \npopulation potentially affected within the worst-case release scenario circle is 96 \npersons.  Due to the rural location of this facility, the population potentially \naffected by this worst case release may be substantially overstated by the 1990 \nCensus data.  There were no environmental receptors within the worst case \nrelease scenario circle.\n\nIn the alternative release scenario, a packing leak from an isolation valve located \noutdoors was modeled as a release of liquefied ammonia stored under pressure.  \nFor a release of 12 lb/min of anhydrous ammonia, the model calc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21688,
      "SummaryText": "ulated that the \nplume would travel less than 0.1 mile at concentrations at or above the endpoint.  \nNo residences are located within the 0.1 mile area around the Lucich Farms \nfacility.  As such, there would be no population impacts from the alternative \nrelease scenario.  There were also no environmental receptors within the \nalternative release scenario circle. \n\nGeneral Accidental Release Prevention Program and Chemical-Specific \nPrevention Steps\n\nA PSM program, which meets the requirements of the general accidental release \nprevention program, has been developed at Lucich Farms to address the \nanhydrous ammonia system.  The PSM program includes the following chemical-\nspecific prevention steps:\n\n¿\tWritten process safety information, including information pertaining to the \nhazards of ammonia, the technology of the process, and the equipment in \nthe process has been compiled.\n\n¿\tAn initial Process Hazard Analysis (PHA) was performed and will be \nupdated and revalidated at least every five years.\n\n¿\tWritten operating procedures have been developed and implemented, and \nare reviewed at least annually.\n\n¿\tSafe work practices, such as lockout/tagout, confined space entry, \nopening process equipment or piping, and control over entrance into the \nfacility have been developed and implemented.\n\n¿\tEach employee involved in operating the ammonia system has received \ninitial training and will receive refresher training at least every three years.\n\n¿\tWritten mechanical integrity procedures have been established and \nimplemented.\n\n¿\tA Management of Change (MOC) program has been developed and \nimplemented to address all proposed changes to the ammonia system.\n\n¿\tPre-startup safety reviews are performed when a modification is made to \nthe ammonia system that is significant enough to require a change in the \nprocess safety information.\n\n¿\tAudits are conducted at least every three years to evaluate compliance \nwith the CalARP regulations.\n\n¿\tIncident investigation procedures hav"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21688,
      "SummaryText": "e been established.\n\n¿\tA written plan of action regarding the implementation of employee \nparticipation has been developed and implemented.\n\n¿\tHot work permits are issued for all hot work operations conducted on or \nnear the ammonia system.\n\n¿\tA Contractor Safety Policy has been developed and implemented.\n\nTo ensure that the general accidental release prevention program and the \nchemical-specific prevention steps are implemented, Lucich Farms has assigned \noverall responsibility for the RMP elements to the Purchasing Manager.  The \nPurchasing Manager has the overall responsibility for the development, \nimplementation, and integration of the RMP elements.\n\nFive-Year Accident History\n\nLucich Farms has not had any accidental releases from the ammonia-based \nrefrigeration system that have resulted in deaths, injuries, or significant property \ndamage on site, or known offsite deaths, injuries, evacuations, sheltering in \nplace, property damage, or environmental damage in the last five years.\n\nEmergency Response Program\n\nLucich Farms has established an emergency action plan and a chain of \ncommand to respond to emergencies and to notify emergency responders when \nthere is a need for a response.  However, an emergency response program does \nnot need to be developed for the facility since Lucich Farms employees will not \nrespond to accidental releases of ammonia, the facility is included in the \ncommunity emergency response plan, and appropriate mechanisms are in place \nto notify emergency responders.\n\nPlanned Changes To Improve Safety\n\nLucich Farms does not currently have any additional changes planned for the \nammonia refrigeration system to improve safety."
    }
  ]
}