{
  "FacilityID": 21744,
  "FacilityName": "Yakima Fruit & Cold Storage Co.",
  "FacilityStr1": "200 Frontage Road",
  "FacilityStr2": null,
  "FacilityCity": "Wapato",
  "FacilityState": "WA",
  "FacilityZipCode": "98951",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53077",
  "LEPC": "Yakima County LEPC",
  "FacilityLatDecDegs": "46.457222",
  "FacilityLongDecDegs": "-120.428333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 910547290,
  "ParentCompanyName": "N/A",
  "Company2Name": "N/A",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Yakima Fruit & Cold Storage Co.",
  "OperatorStr1": "North First Ave. & B Street",
  "OperatorStr2": null,
  "OperatorCity": "Yakima",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98907",
  "OperatorZipCodeExt": null,
  "RMPContact": "William D. Frank",
  "RMPTitle": "General Manager/President",
  "FTE": 150,
  "OtherEPAFacilityID": "N/A",
  "EPAFacilityID": "100000171501",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-06-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-08-15 00:00:00",
  "ErrorReportDate": "2000-08-15 00:00:00",
  "ReceiptDate": "2000-08-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-08-04 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2007-03-12 00:00:00",
  "DeRegistrationEffectiveDate": "2007-02-21 00:00:00",
  "AnniversaryDate": "2005-08-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 46.44268,
  "FRS_Long": -120.43028,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30807,
      "AltID": "Refrigeration",
      "FacilityID": 21744,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 31598,
          "ProcessID": 30807,
          "NAICSCode": "115114",
          "_desc": {
            "NAICS_CODE": "115114",
            "NAICS_DESCRIPTION": "Postharvest Crop Activities (except Cotton Ginning)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 40305,
          "ProcessID": 30807,
          "ChemicalID": 56,
          "Quantity": 35000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 540305,
          "ProcessID": 30807,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21744,
      "SummaryText": "The Yakima Fruit & Cold Storage Co. (YFCS) accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices. All applicable procedures of the U.S. Environmental Protection Agency (EPA) Prevention Program will be followed. The YFCS Emergency Response policy involves the preparation of response plans which are tailored to the individual situation encountered in our plant and to the emergency response services available in the Wapato community, and is in compliance with EPA Emergency Response Program requirements. At the present time, our Process Hazard Analysis is being studied and will be completed and submitted to EPA no later than December 15, 2000.\n\nYFCS operates a cold storage and fruit packing facility in Wapato, Washington. Cold Storage is provided by ammonia refrigeration on a campus of approximately 40 acres. The campus is bordered on the north by Inland-Joseph Fruit Co.; on the west by Highway 97; on the east by railroad tracks owned and operated by Burlington Northern; and to the south by a small three-person office and open field. There are approximately 35,000 lbs. of ammonia on site. The facility is monitored by ammonia detection systems linked to a central computer. This computer is connected by modem to personal computers in the private residences of two refrigeration specialists. In the case of an ammonia leak discernible to the ammonia detectors, an alarm is sent via telephone to the refrigeration specialists. In addition, the computer automatically shuts down the refrigeration system which can only be subsequently restarted manually by a refrigeration specialist. Supervisors visit the facility daily and respond to any trouble alarms which may occur (audible alarms and computer flags).\n\nThe off-site consequence analysis includes consideration of two ammonia release scenarios, identified as \"worst-case\" and \"alternative\". The first scenario as defined by EPA is that the \"greatest amoun"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21744,
      "SummaryText": "t [of ammonia] held in a vessel\" such as \"a storage-vessel or high-pressure receiver\" is released into the atmosphere \"over a period of 10 minutes\". The alternative scenario is defined as \"more likely to occur than the worst-case scenario and...reaches an endpoint off-site...\".\n\nAtmospheric dispersion modeling has to be performed to determine the distance traveled by the ammonia released before its concentration decreases to the \"toxic endpoint\" selected by EPA of 200ppm. This is defined by the American Industrial Hygiene Association (AIHA) as the \"maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\" The residential population within a circle with a radius corresponding to the toxic endpoint distance has to be defined to \"estimate the population potentially affected\".\n\nThe worst-case scenario at the Wapato facility involves a rupture of the largest high-pressure vessel on site with a full charge of ammonia. The off-site consequence analysis was performed utilizing RMP*Comp Version 1.06, a computer modeling tool designed by EPA. This analysis follows conditions pre-defined by EPA, i.e. release of the entire contents of the vessel in 10 minutes, toxic endpoint of .14 mg/L (200ppm) with basis per ERPG-2 and consideration of the population residing within a full circle radius cooresponding to the toxic endpoint distance. EPA-mandated meteorological conditions (wind speed 3.4 miles/hour, stability class F and air temperature 77 degrees F) were used. When atmospheric dispersion modeling for the worst case scenario was performed using these EPA assumptions and computer modeling program, a distance to toxic endpoint of .1 mile and no residential population affected was obtained.\n\nThe alternative release scenario assumes that a one inch liquid ref"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21744,
      "SummaryText": "rigeration line is hit by a lift-truck inside a cold storage/controlled atmosphere room. The amount of ammonia released is 600 gallons at a rate of 10 gallons per minute over one hour. Using EPA-mandated meteorological conditions specific to the alternative scenario (wind speed 6.7 miles/hour, stability class D and air temperature 77 degrees F) the distance traveled to the toxic endpoint was calculated by the EPA computer modelling program to be less than .1 mile but is required to be reported as .1 mile. Within the .1 mile radius there would be a residential population of 21. In addition, neighboring cold storage rooms at Inland-Joseph Fruit Co. lie within the .1 mile radius.\n\nThe general YFCS accidental release prevention program  is based on the following key elements:\n--high level training of refrigeration specialists\n--preventive maintenance program\n--use of state-of-the-art process and safety equipment\n--use of accurate and effective operating procedures as outlined in our Process Safety Management Program\n\nChemical-specific prevention steps include: availability of self-contained breathing apparatus (SCBA) for refrigeration specialists; training and awareness of proper safety procedures when dealing with ammonia; and ammonia level testing instruments. HAZMAT suits are jointly owned by YFCS and the Wapato Fire Department and Yakima County Fire District #5.\n\nNo accidental releases of ammonia have occured at this facility in the past five years.\n\nThe facility has an emergency response program, which is coordinated with the Wapato Fire Department and Yakima County Fire District #5.\n\nRefrigeration specialists completed renewal of emergency response team training during a refresher course held on August 1, 2000."
    }
  ]
}