{
  "FacilityID": 21880,
  "FacilityName": "Delta Deluxe L.L.C., dba Delta Chemical Services",
  "FacilityStr1": "334 Tidal Road",
  "FacilityStr2": null,
  "FacilityCity": "Deer Park",
  "FacilityState": "TX",
  "FacilityZipCode": "77536",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-Deer Park Area L",
  "FacilityLatDecDegs": "29.714444",
  "FacilityLongDecDegs": "-95.111111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "L1",
  "LatLongDescription": "PC",
  "FacilityURL": "www.delta-chemical.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Delta Petroleum Co.",
  "Company2Name": null,
  "CompanyDUNS": 8176364,
  "Company2DUNS": null,
  "OperatorName": "Delta Chemical Services",
  "OperatorStr1": "P.O. Box 1314",
  "OperatorStr2": null,
  "OperatorCity": "Deer Park",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77536",
  "OperatorZipCodeExt": "1314",
  "FTE": 42,
  "OtherEPAFacilityID": "TXR000029199",
  "EPAFacilityID": "100000119267",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-09-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-09-11 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-06-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-06-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 29.71349,
  "FRS_Long": -95.11303,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 31029,
      "AltID": "packaging and warehousing",
      "FacilityID": 21880,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 40588,
          "ProcessID": 31029,
          "ChemicalID": 1,
          "Quantity": 45000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 31826,
          "ProcessID": 31029,
          "NAICSCode": "49319",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 17217,
              "Process_NAICS_ID": 31826,
              "SafetyReviewDate": "2000-06-26 00:00:00",
              "PHA_Date": "2000-04-12 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-06-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-06-26 00:00:00",
              "TrainingReviewDate": "2000-06-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-06-28 00:00:00",
              "EquipmentInspectionDate": "2000-06-28 00:00:00",
              "EquipmentTested": "filler number 4",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2000-06-30 00:00:00",
              "PreStartupReviewDate": "2000-06-28 00:00:00",
              "ComplianceAuditDate": "2000-06-26 00:00:00",
              "AuditCompletionDate": "2000-07-01 00:00:00",
              "IncidentInvestigationDate": "2000-06-30 00:00:00",
              "InvestigationChangeDate": "2000-06-30 00:00:00",
              "ParticipationPlansReviewDate": "2000-04-06 00:00:00",
              "HotWorkPermitReviewDate": "2000-04-26 00:00:00",
              "ContractorSafetyReviewDate": "2000-07-29 00:00:00",
              "ContractorSafetyEvalDate": "2000-06-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 25084,
                  "PreventionProgram3ID": 17217,
                  "ProcessChemicalID": 40588
                }
              ]
            }
          ],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 31827,
          "ProcessID": 31029,
          "NAICSCode": "56191",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 21880,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-10-29 00:00:00",
    "ERTrainingDate": "2000-05-17 00:00:00",
    "CoordinatingAgencyName": "Deer Park LEPC",
    "CoordinatingAgencyPhone": "2814787248",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21880,
      "SummaryText": "RISK MANAGEMENT PLAN\r\n\r\nEXECUTIVE SUMMARY\r\n\r\n1. SITE INFORMATION\r\n\r\nDelta Deluxe, L.L.C., dba Delta Chemical Services, purchased approximately 9 acres of land from the Lubrizol Corp. in 1997 to construct a chemical packaging, warehousing, and logistics facility in Deer Park, Texas.   The facility was completed in late 1998, and chemical packaging operations began in October, 1998.  The facility is located at 334 Tidal Road, Deer Park, TX.  The mailing address is:\r\n\tDelta Chemical Services\r\n\tP.O. Box 1314\r\n\tDeer Park, TX  77536\r\n\r\n2. FACILITY OPERATIONS\r\n\r\nDelta Chemical Services provides custom packaging, warehousing and logistics services to a wide variety of customers.  Customers are typically large chemical or oil companies that manufacture product in bulk quantities.  The bulk product is shipped to DCS in rail cars or tank trucks, and repackaged into drums, intermediate bulk containers (totes) or other packages.  The repackaged material is then stored in specially-designed chemical storage warehouses and shipped out as directed by the customer.   Delta Chemical Services does not manufacture any materials, nor does the company own the material handled or stored on site\r\n\r\n3. FACILITY SAFETY FEATURES\r\n\r\nThe primary objective in designing the DCS facility was to create a safe and healthy workplace for the employees that has minimal impact on the community and the environment.  To this end, the company installed a number of physical safety features in the facility.  These include:\r\nA. 43,000 gallon concrete catch basin under the rail track in the facility;\r\nB. Six inch concrete curbing around the tank truck unloading area;\r\nC. Dry disconnect hoses with fail-close valves to prevent product from flowing from the bulk container in case of a power outage or equipment failure;\r\nD. Six inch concrete curbing around the entire perimeter of the warehouse;\r\nE. Concrete and asphalt roads and parking areas to prevent possible spills from contacting the ground\r\nF. Three v"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21880,
      "SummaryText": "ehicle access gates on Tidal Road to prevent unauthorized individuals from entering the site;\r\nG. Closed-captioned TV cameras located throughout the facility to remotely monitor process operations and other sensitive areas;\r\nH. Emergency valve to prevent storm water, fire water or product released in an emergency situation from leaving the site;\r\nI. High-volume water and foam fire fighting system in the product unloading area to put out fires and prevent vapors from travelling off site;\r\nJ. Foam-water fire fighting system in the product transfer and warehouse areas designed to approximately two times the required standard;\r\nK. High efficiency thermal destruction of vapors generated from packaging of certain hazardous materials;\r\nL. 100% enclosed booths for repackaging material into drums, etc.;\r\nM. Separate laboratory and office ventilation systems to prevent lab exhaust from entering the office or production areas; and\r\nN. Emergency alarm system monitored 24 hours per day, 7 days per week by neighboring company.\r\nIn addition to physical facility elements to protect employees and the community, the company has implemented a variety of management systems to train employees and ensure the community is protected.  Some of these include:\r\nA. Pre-employment testing of employee;\r\nB. Random drug and alcohol testing;\r\nC. In-depth pre-employment safety and operations training program;\r\nD. Continuing safety and environmental awareness training conducted both on computer and by instructors;\r\nE. Incident investigation system which identifies near-miss mishaps and root causes of each incident;\r\nF. Continuous Improvement Process for identifying potential areas for improvement throughout the facility;\r\nG. Management involvement in community affairs, including the Local Emergency Planning Committee, East Harris County Manufacturers' Association, and the Deer Park Citizens Advisory Committee; and\r\nH. Coordination of emergency response planning with neighboring facilities.  \r\n\r\n4. RE"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21880,
      "SummaryText": "GULATED SUBSTANCES HANDLED ON SITE\r\n\r\nDelta Chemical Services currently handles one regulated substance: toluene diisocyanate (mixed isomers).  We will be handling formaldehyde in July.\r\n\r\nFormaldehyde will enter the facility in tank truck quantities of 40,000 pounds.  The trailers will be spotted in the unloading area on the concrete containment and the product will be off-loaded into drums.  Those drums will be transferred directly to waiting van trailers and shipped to the customer.\r\n \r\nFormaldehyde is a colorless liquid with a moderate flash point that does not vaporize easily.  The material is used to make other chemicals, building materials, household products, and in embalming.  The material is typically shipped in tank trucks and drums; and is seldom, if ever, transported by pipeline  In low concentrations, TDI could cause nose, throat, lung and skin irritation which could result in discomfort.  Medical attention is rarely required for low concentrations.  In higher concentrations and with prolonged exposure, formaldehyde can cause severe irritation of the nose, throat, lungs, eyes and skin.  The material is a suspect human carcinogen.  In higher concentrations, medical attention may be recommended.  \r\n\r\n5. RELEASE HISTORY\r\n\r\nThere have been no reportable chemical releases on site since the facility began operations.\r\n\r\n6. RMP PROGRAM LEVEL\r\n\r\nDelta Chemical Services is an RMP Program Level Three facility for formaldehyde because the product is a regulated by OSHA in the 1910.119 Process Safety Management standard. \r\n\r\n7. WORST-CASE RELEASE SCENARIO\r\n\r\nUsing guidance provided in the EPA's RMP*Comp software, DCS determined that a worst-case release of formaldehyde, according to RMP guidelines, would be the release of the entire contents of a tank truck of the material.  This would result in the loss of approximately 45,000 pounds of formaldehyde into the concrete rail car containment basin.  Again using EPA guidance, the calculated area of release would be ap"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21880,
      "SummaryText": "proximately 0.2 miles.  A release to that distance would not reach only our industrial neighbors, the Lubrizol Corporation, in an area of the plant not normally inhabited by plant personnel.\r\n\r\nAlthough the release scenario utilized for the RM Plan involves the release of the entire contents of a tank truck, this scenario is extremely unrealistic.  There are numerous safety features in the facility that would prevent an incident such as this from occurring.  These include:\r\n* Dry disconnect connections between transfer hose and bulk container which prevent material from escaping, even if the valves on either side fail;\r\n* Fail-close valves directly behind the dry disconnect connections which prevent product from entering facility transfer lines in case of a failure of the bulk transport or facility transfer lines;\r\n* Emergency shut down buttons for each transfer pump located at operating stations throughout the unloading area;\r\n* Remote monitoring of the unload area in the office with emergency shut down from the monitoring location;\r\n* Monitoring of unload area and transfer process by trained personnel during the entire product transfer process; and\r\n* Inspection procedure for all incoming bulk transports.\r\n\r\n8. OFF-SITE RECEPTORS\r\n\r\nThe nearest public receptors to the DCS facility are the Lubrizol Fire House to the northwest, the Lubrizol process facility across Tidal Road to the west, and the Lubrizol main office building directly south of DCS.  These are located within the 0.2 mile radius of the potential worst-case scenario.\r\n\r\nThe nearest environmental receptor to the facility is the San Jacinto Monument and park.  This park is located approximately 5 miles northeast of the facility on Battleground Road.\r\n\r\n\r\n9. ALTERNATE RELEASE SCENARIO\r\n\r\nAlthough it was not required by the EPA, DCS performed an analysis of a potential alternate release scenario.  For this scenario, we examined the potential impact of a rupture of the tank truck unloading hose.  EPA guidanc"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21880,
      "SummaryText": "e for Alternate Release Scenarios allows companies to take credit in the modeling process for existing safety systems in their analysis of this scenario.  Using this guideline, DCS assumed that both the active and passive safety systems in the facility worked during the release, and that the operator was able to rapidly isolate the release using the emergency shutdown system (emergency button in the unloading area).  This resulted in a loss of approximately 1912 pounds of TDI through the rupture in the unloading hose with an estimated endpoint of 0.1 miles. \r\n\r\n10. EMERGENCY RESPONSE PROGRAM\r\n\r\nIn addition to a detailed operator training program, Delta Chemical Services has coordinated its emergency response program with neighboring Lubrizol Corp.  Lubrizol owns all adjacent land to DCS, and has a significant amount of emergency response resources.  The facility's fire and ambulance vehicles are stationed on adjoining property and there is no barrier to prevent the immediate access of these vehicles onto the DCS property.  Additionally, DCS and Lubrizol have planned at least annual joint emergency drills to be held at DCS.  Finally, DCS is currently working towards membership in the Channel Industries Mutual Aid organization, which provides mutual emergency response assistance between industries in the Houston Ship Channel area.   The company is also an active member of the Deer Park LEPC, and has communicated its emergency response plan to that organization.\r\n\r\n11. PLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nDCS will soon be implementing a new Behavior Based Safety program known as \"Team Up...Time Out for Safety\".  The program is designed to encourage employee involvement in the facility's safety program and to allow employees to make changes and improvements rapidly and with little intervention.  Additionally, we have instituting a modified Process Hazard Analysis in the new business review cycle.  This PHAs involve operations, safety, engineering, and management staff s"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 21880,
      "SummaryText": "itting down prior to handling any new material and reviewing all steps involved in safely handling that product.  Employee safety procedures and methods are paramount in these discussions, as well as the design of material-specific emergency response procedures for the new products.  Additionally, DCS is in negotiations with Channel Industries Mutual Aid to join that organization for emergency response protection.  Finally, Delta Chemical Services is currently working towards the OSHA VPP Star Worksite certification.  If awarded this certification, DCS would be the first company of its size in the program and would be the only new facility in the program.\r\n\r\n12. SUMMARY\r\n\r\nDelta Chemical Services sees the EPA's Risk Management Program as an opportunity to communicate about our facility with the public.  Delta Petroleum Co., the parent company of Delta Chemical Services, is committed to providing and maintaining a safe and healthy workplace for employees, neighboring facilities, and the community of Deer Park.  To that end, the company has designed and constructed a state of the art facility with multiple layers of protection for employees and the community.  The company has committed to providing the surrounding community with information regarding the company's safety performance and commitment to the environment, and the RM Plan is one way to do this.   \r\n\r\n13. CERTIFICATION\r\n\r\nI certify that, to the best of my knowledge, information, and belief formed after reasonable inquiry, the information submitted is true, accurate, and complete.\r\n\r\nSigned by Terry Wilson*, DCS General Manager, on June 30, 2000.\r\n\r\n*  The Certification with original signature is included with this RMP submittal.\r\nDelta Chemical Services, Deer Park Texas\t                               \tRisk Management Plan\t\t\r\n\r\nDCS Executive Summary\t\tPage 4 of 1"
    }
  ]
}