{
  "FacilityID": 21882,
  "FacilityName": "Carney Gas Plant (Revision 1)",
  "FacilityStr1": "1 mile south,",
  "FacilityStr2": "1 1/2 miles west of Carney",
  "FacilityCity": "Carney",
  "FacilityState": "OK",
  "FacilityZipCode": "73093",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40081",
  "LEPC": null,
  "FacilityLatDecDegs": "35.795278",
  "FacilityLongDecDegs": "-97.043889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Duke Energy Field Services",
  "Company2Name": null,
  "CompanyDUNS": 7118276,
  "Company2DUNS": 0,
  "OperatorName": "Duke Energy Field Services",
  "OperatorStr1": "370 17th Street, Suite 900",
  "OperatorStr2": null,
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80202",
  "OperatorZipCodeExt": null,
  "RMPContact": "Randy Lawson",
  "RMPTitle": "Plant Manager",
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000016564",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "96-355-TV",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Revised 07/08/2000",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-09-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-09-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-09-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-07-27 00:00:00",
  "DeRegistrationEffectiveDate": "2006-07-20 00:00:00",
  "AnniversaryDate": "2004-05-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 35.1379,
  "FRS_Long": -97.4846,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS BLOCK/TRACT-1990-CENTROID",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 31031,
      "AltID": "Carney Gas Plant",
      "FacilityID": 21882,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 31829,
          "ProcessID": 31031,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 40590,
          "ProcessID": 31031,
          "ChemicalID": 98,
          "Quantity": 133000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 40591,
          "ProcessID": 31031,
          "ChemicalID": 155,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 30393,
              "ProcessChemicalID": 40591,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 30394,
              "ProcessChemicalID": 40591,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 30395,
              "ProcessChemicalID": 40591,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 30396,
              "ProcessChemicalID": 40591,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 30397,
              "ProcessChemicalID": 40591,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 30398,
              "ProcessChemicalID": 40591,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 540590,
          "ProcessID": 31031,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 540591,
          "ProcessID": 31031,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21882,
      "SummaryText": "Carney Gas Plant Risk Management Plan: Executive Summary\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES \n\nThe Carney Gas Plant has a long-standing commitment to the safety of the neighboring community as well as employees and contractors on plant property. Duke Energy Field Services, operator of the Carney Gas Plant, is dedicated to safety and environmental stewardship, which are two of the company's core values. \n\nSafety and protection of the environment are an integral part of Duke Energy Field Services' operations and corporate culture. \n\nThe Duke Energy Field Services Carney Gas Plant adheres to all Duke Energy Field Services policies, which can be summarized as follows with regard to safety and environmental stewardship:\n \n* All Safety and Environmental incidents are preventable. \n* The Goal is Zero - Zero Significant Incidents, Period. \n* All employees and contractors are responsible for their personal safety. \n\nDuke Energy Field Services Corporate policies are embodied in the numerous Safety, Health, and Environmental Policies & Procedures which apply globally to Duke Energy Field Services operations. At the Carney Gas Plant, these policies are outlined and implemented via several Plant Safety, Health, and Environmental Manual. These manuals are available to all employees, and all employees have been trained in their specific responsibilities for Safety, Health, and Environmental compliance. In addition, the Carney Gas Plant complies with the Process Safety Management (PSM) Program requirements, which are managed and implemented via the Plant's PSM Program manual. This manual is also available to all employees, and all employees receive specific training on Process Safety Management and their role in the program. The Carney Gas Plant also maintains an Incident Response Plan that details the complete Emergency Response program for the site. \n\nThe Carney Gas Plant's dedication to safety is demonstrated in many ways. The Plant and Duke Energy Field Service"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21882,
      "SummaryText": "s have a safety record that is consistently among the very best in the energy industry in the United States. To help ensure the safety of Duke Energy Field Services operations, the company invests significant resources in accident prevention. Accident prevention includes designing safe plants and operating facilities, conducting and providing safety training for employees and contractors, and developing and implementing safe work practices and procedures for the operation and maintenance of plants, processes, and operations facilities. Duke Energy Field Services' policies and dedication to safety and environmental stewardship help to prevent accidental releases. If, despite our best attempts to prevent such incidents, a release should occur, trained personnel will respond to, control, and contain the release in accordance with the plant's Incident Response Plan.\n \nThis document has been prepared in accordance with the EPA's new Risk Management Program (RMP) regulations (40 CFR Part 68), which were promulgated in the Federal Register on Thursday, June 20, 1996, Vol. 6 1, No. 120. \n\nDESCRIPTION OF THE FACILITY AND THE REGULATED SUBSTANCES HANDLED\n \nThe Carney Gas Plant, located in Lincoln County, Oklahoma, is owned and operated by Duke Energy Field Services. Carney Gas Plant is a cryogenic natural gas processing plant, which extracts hydrocarbon liquids from raw natural gas streams. Two raw natural gas streams (high pressure and low pressure) are delivered via pipeline to the plant. After extraction of the hydrocarbon liquids, residue gas and these liquids are sold as product. The site consists of inlet gas separation, dehydration, cryogenic gas processing, compression, product storage and loading equipment. Products are transported from the facility via pipeline and truck. \n\nIn accordance with the EPA's Risk Management Program (RMP) regulations (40 CFR Part 68), the Carney Gas Plant's inventory of chemicals was evaluated to determine if any regulated flammable or tox"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21882,
      "SummaryText": "ic substances were on the plant site in quantities above the threshold quantities. [Note: The term \"threshold quantity\" is the quantity above which the EPA has decided that the substance will be regulated.] Our evaluation determined that the following listed flammable substances are handled by the plant in quantities above the substance's threshold quantity: condensate, propane, and ethane/ propane/butane/condensate (EPBQ mix. [Note: condensate is exempt from threshold determination based on its National fire Protection Association (NFPA) rating of 3.] There are no toxic substances above the threshold quantity at the plant. Based on worst-case analyses of the regulated substances, the distances to endpoints (i.e. an overpressure of 1 psi) do not exceed the distances to public \nreceptors (i.e., off-site residences, institutions, industrial, commercial and office buildings, parks, or recreational areas, inhabited or occupied by the public). In addition, the Carney Gas Plant has not had an accidental release in the past five years and emergency response procedures have been coordinated with community response organizations. Therefore, the Carney Gas Plant is classified as a Program I process under the Accidental Release Prevention (ARP) Program. \n\nWORST-CASE TOXIC RELEASE SCENARIO \n\nThe Carney Gas Plant does not have any toxic substances above threshold quantity. As the plant does not have any toxic substances, toxic release scenarios were not addressed. \n\nWORST-CASE FLAMMABLE RELEASE SCENARIO \n\nThe RMP regulation requires the operator to model the worst-case release scenario, which the regulations define as the \"release of the largest quantity of a regulated substance from a vessel or process line failure. For flammables, this hypothetical worst case assumes an instantaneous release and a vapor cloud explosion. These assumptions are required without regard to whether a scenario is realistic or improbable. Propane was used in the model for the hypothetical worst-case f"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21882,
      "SummaryText": "lammable scenario. The worst-case scenario was modeled on the assumption of the instantaneous release of all of the propane in the largest propane vessel. Under the stipulated guidelines, this hypothetical release, if ignited, would have an off-site impact, as determined by the use of the OCA Guidance. [Note: The OCA Guidance is EPA's Off-Site Consequence Analysis Guidance document.] \n\nPassive mitigation systems were not applied because of the assumption for the scenario that the entire contents of the vessel be instantaneously released. We believe that a vessel failure such as this is extremely unlikely because the vessels are carefully designed with significant engineering safety factors. In addition, all pressure vessels are carefully inspected and pressure tested before they are placed in service, and the Carney Gas Plant follows a rigorous Mechanical Integrity Program to ensure that all process equipment is properly maintained and inspected, to prevent leakage or failure. \n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM \n\nBased on the criteria in 40 CFR 68. 10, the distance to the specified endpoint for the worst-case accidental release scenario for the following processes is less than the distance to the nearest public receptor: Propane and ethane/propane/butane/condensate (EPBQ mix. Within the past five years, the \nprocesses have had no accidental releases that caused off-site impacts provided in the risk management program rule (40 CFR 68. 1 0(b)(1)). No additional measures are necessary to prevent off-site impacts from accidental releases. In the event of fire, explosion, or a release of a regulated substance from the processes, entry within the distance to the specified endpoints may pose a danger to public emergency responders. Therefore, public emergency responders should not enter this area except as arranged with the emergency contact indicated in the Risk Management Plan. The undersigned certifies that, to the best of my knowledge, information, and bel"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21882,
      "SummaryText": "ief, formed after reasonable inquiry, the information submitted is true, accurate, and complete. \n\nTHE FIVE-YEAR ACCIDENT HISTORY \n\nNo deaths, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage have resulted from any activities or incidents at the Carney Gas Plant for the past five years. \n\nTHE EMERGENCY RESPONSE PROGRAM \n\nThe overall incident response program for the Carney Gas Plant is coordinated with the Carney Fire Department. This coordination includes periodic meetings to review incident response plans and facilitate communications and planning. The Carney Gas Plant has around-the-clock communications capability with the Carney Gas Plant personnel and the fire chief This provides a method for \nnotifying the public in the event of an incident, if necessary, as well as facilitating quick response to an incident. In addition to periodic meetings with the Carney Fire Department, the Carney Gas Plant conducts periodic emergency response drills that involve Carney Fire Department and emergency response organizations."
    }
  ]
}