{
  "FacilityID": 22059,
  "FacilityName": "ALLIED UNIVERSAL CORPORATION",
  "FacilityStr1": "30 NEIL GUNN DRIVE",
  "FacilityStr2": null,
  "FacilityCity": "ELLISVILLE",
  "FacilityState": "MS",
  "FacilityZipCode": "39437",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28067",
  "LEPC": "Civil Defense Office/Jones Cty",
  "FacilityLatDecDegs": "31.5",
  "FacilityLongDecDegs": "-89.235",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.allieduniversal.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 590776285,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "BERNIE EPSTEIN",
  "OperatorStr1": "8350 NW 93RD STREET",
  "OperatorStr2": null,
  "OperatorCity": "MIAMI",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33166",
  "OperatorZipCodeExt": null,
  "RMPContact": "ROBIN J. EDDY",
  "RMPTitle": "REGULATORY COMPLIANCE MANAGER",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000170708",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "ELLISVILLE, MISSISSIPPI",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-11-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-11-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-11-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-11-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 31.5,
  "FRS_Long": -89.235,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-NEAREST INTERSECTION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 31317,
      "AltID": "Cl2 Pkg. & Bleach Mftr.",
      "FacilityID": 22059,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 32129,
          "ProcessID": 31317,
          "NAICSCode": "325181",
          "_desc": {
            "NAICS_CODE": "325181",
            "NAICS_DESCRIPTION": "Alkalies and Chlorine Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 40948,
          "ProcessID": 31317,
          "ChemicalID": 62,
          "Quantity": 360000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 540948,
          "ProcessID": 31317,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 31318,
      "AltID": "Sulfur Dioxide Storage",
      "FacilityID": 22059,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 32130,
          "ProcessID": 31318,
          "NAICSCode": "11114",
          "_desc": {
            "NAICS_CODE": "11114",
            "NAICS_DESCRIPTION": "Wheat Farming"
          }
        },
        {
          "Process_NAICS_ID": 32131,
          "ProcessID": 31318,
          "NAICSCode": "49311",
          "_desc": {
            "NAICS_CODE": "49311",
            "NAICS_DESCRIPTION": "General Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 40949,
          "ProcessID": 31318,
          "ChemicalID": 49,
          "Quantity": 35000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 540949,
          "ProcessID": 31318,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 22059,
      "SummaryText": "RISK MANAGEMENT PLAN\nELLISVILLE, MISSISSIPPI\nExecutive Summary\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAllied Universal Corporation's Ellisville, Mississippi facility is a newly constructed chlorine packaging and sodium hypochlorite manufacturing operation. Allied Universal Corporation's accidental release risk management plan for the Ellisville facility involves a unified approach that integrates technologies, procedures, and maintenance and management practices. The elements of the plan are intended to prevent and minimize the accidental releases of extremely hazardous substances (chlorine and sulfur dioxide) used on site. The Allied facility emergency response program involves the preparation of response plans that are tailored to the facility and the emergency response services available in the community. Allied's emergency response program is in compliance with the EPA and OSHA Emergency Response Program requirements and is modeled after the \"One Plan\".\n\nDESCRIPTION OF THE FACILITY AND REGULATED SUBSTANCES HANDLED\n\nAllied Universal Corporation repackages chlorine into 150-pound cylinders and one ton containers. Chlorine is also utilized by Allied to manufacturer 10.5%-15% (by weight) sodium hypochlorite. The facility includes a sidetrack for unloading 90-ton chlorine railcars. A chlorine production building is used for packaging the cylinders and ton containers and for sodium hypochlorite production. All instrument controls for the chlorine railcar unloading, cylinder and ton container packaging and sodium hypochlorite production are located in the chlorine packaging building.  In addition to chlorine, sulfur dioxide is stored onsite in 150-pound cylinders and one ton containers.  The facility is staffed during all hours of operations.\n\nBased upon the program criteria as set forth in the Risk Management Rule, including EPA's definition of a \"covered process\", the chlorine process at this facility are subject to Program 3 planning.\n\nWORST"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 22059,
      "SummaryText": "-CASE AND ALTERNATIVE RELEASE SCENARIOS\n\nAn offsite consequence analysis was conducted that included consideration of two chlorine and one sulfur dioxide release scenarios, identified as \"worst-case release\" and/or \"alternative scenario\". The worst-case scenario is defined by EPA, which states that the \"owner shall assume that the maximum quantity in the largest vessel is released as a gas over 10 minutes,\" due to an unspecified failure. Because the probability of such a release occurring is very remote, an alternative scenario, defined as \"more likely to occur than the worst-case release scenario\", was also analyzed.\n\nAtmospheric dispersion modeling was performed to determine the distance traveled by the chlorine and sulfur dioxide releases before its concentration decreases to the \"toxic endpoint\" selected by EPA. The American Industrial Hygiene Association defines toxic endpoint as the \"maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action\". \n\nThe worst-case release scenario at Allied's Ellisville facility involves the failure of a 90-ton railcar of chlorine. Although Allied utilizes numerous administrative controls and active mitigation systems to minimize the consequences of such a release, no credit was taken for any mitigating factors in calculating the extent of the release. This is in accordance to the EPA Risk Management Program worst-case scenario requirements (40 CFR ?68.25). \n\nFor chlorine, when atmospheric dispersion modeling for the worst case scenario was performed using the RMP Guidance Program for Wastewater Treatment Plants, the distance to the toxic endpoint of 0.0087 mg/L was estimated at 14 miles. The amount released is ninety (90) tons over a 10-minute period, providing a release rate of 18,000 lb./min. An estimate of "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 22059,
      "SummaryText": "residential population potentially affected of 57,000 was obtained using current census data. \n\nThe alternative release scenario for chlorine involves the rupture of the flexible connections connected to the chlorine railcar, possibly due to human error, overpressurization or split or uncoupling due to equipment failure. The amount of chlorine released is 1250 lb., at an average rate over five minutes (duration of the release) at 240 lb./min (Estimating the Area Affected by a Chlorine Release, ed. 3; Chlorine Institute Pamphlet 74, Chlorine Institute: April, 1998). Using RMP*Comp, the toxic endpoint distance of 0.3 miles was calculated, and an estimate of residential population potentially affected of 0 was obtained using the most recent census data. \n\nThe alternative release scenario for sulfur dioxide involves the rupture of the storage vessel (one ton container), possibly due to human error or upset condition.  The amount of sulfur dioxide released is 581 lb., at an average rate of 60 minutes (duration of the release) at 9.52 lb./min (Compressed Gas Association Pamphlet G-3, 5th Edition, 1995).  Using RMP*Comp, the toxic endpoint distance estimated was 0.2 miles, and an estimate of residential population potentially affected of 0 was obtained using the most recent census data. \n\nA release of sulfur dioxide from a one ton container would be mitigated by the application of the Chlorine Institute Emergency B Kit, with EPDM Gaskets.\n \nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe Allied accidental release prevention program is based on the following key elements:\n\n* Compliance with OSHA's Process Safety Management rule (29CFR ?1910.119) and EPA's Risk Management Plan (40 CFR ?68),\n* Implementation of the National Association of Chemical Distributors Responsible Distribution Process Code,\n* Operator Function Specific and Emergency Response Training,\n* Mechanical Integrity Program,\n* Use of Chlorine Institute and Compressed Gas Assoc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 22059,
      "SummaryText": "iation recommended equipment,\n* Use of effective operating procedures, written with the participation of the operators, facility managers and corporate managers,\n* Performance of a process hazard analysis,\n* Implementation of an internal and external auditing and inspection program.\n\nOperator specific safety steps include availability of self-contained breathing apparatus (SCBA), worn by emergency response personnel during chemical emergencies to stop releases immediately. The operators wear escape respirators and eye protection during connection/disconnection of the chlorine supply. Employees are trained on the hazards and toxic properties of chlorine, presence of the gas detectors, emergency shut-down and scrubber operations, equipment design and specifications and proper and safe handling procedures.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nNo accidental releases of chlorine or sulfur dioxide have occurred at this facility in the past five years. This facility is new, opening July 2000.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe facility has an emergency response plan, which has been reviewed and updated in June of 2000. The plan includes the following elements: \n\n* description of chlorine and sulfur dioxide properties,\n* recommended first aid for chlorine and sulfur dioxide exposures,\n* facility layout and description,\n* emergency response roles and responsibility, as well as procedures for handling various emergencies,\n* a list of all emergency equipment onsite and where such equipment is located, \n* list of onsite and offsite emergency response personnel and contact numbers, \n* detailed description of company personnel, \n* government agencies that must be contacted in the event of a release, \n* procedures for handling the release, \n* evacuation plans,\n* rescue of any personnel overcomed by chlorine or sulfur dioxide.\n\nThe remainder of the emergency response plan describes the training program for onsite emergency response personnel, local emergency planning involvement and the requ"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 22059,
      "SummaryText": "irement for the conducting of emergency drills every year to evaluate training and overall plan effectiveness.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nActuator valves are to be purchased and installed between the flex hose and the angle valves on the chlorine railcar. These valves, when actuated, would prevent a release of chlorine from the railcar at any point in the process.\n\nFacility property is to be enclosed (fence around the facility).\n\nScrubbing system is to be constructed for chlorine cylinder and ton loading and unloading."
    }
  ]
}