{
  "FacilityID": 2220,
  "FacilityName": "Kraft Foods, Inc.",
  "FacilityStr1": "220 Park Center Drive",
  "FacilityStr2": null,
  "FacilityCity": "Winchester",
  "FacilityState": "VA",
  "FacilityZipCode": "22603",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51069",
  "LEPC": "Winchester/Frederick LEPC",
  "FacilityLatDecDegs": "39.208806",
  "FacilityLongDecDegs": "-78.1465",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 847526266,
  "ParentCompanyName": "Philip Morris Companies, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 144628310,
  "Company2DUNS": 0,
  "OperatorName": "Kraft Foods, Inc.",
  "OperatorStr1": "Three Lakes Drive",
  "OperatorStr2": null,
  "OperatorCity": "Northfield",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60093",
  "OperatorZipCodeExt": null,
  "FTE": 450,
  "OtherEPAFacilityID": "VAD988227807",
  "EPAFacilityID": "100000027874",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-04 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-10-27 00:00:00",
  "DeRegistrationEffectiveDate": "2004-10-14 00:00:00",
  "AnniversaryDate": "2004-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 39.20932,
  "FRS_Long": -78.14616,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2437,
      "AltID": null,
      "FacilityID": 2220,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 2592,
          "ProcessID": 2437,
          "ChemicalID": 56,
          "Quantity": 16155.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 2487,
          "ProcessID": 2437,
          "NAICSCode": "311991",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 678,
              "Process_NAICS_ID": 2487,
              "SafetyReviewDate": "1999-04-01 00:00:00",
              "PHA_Date": "1999-03-15 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 1,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-01 00:00:00",
              "TrainingReviewDate": "1999-04-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-01 00:00:00",
              "EquipmentInspectionDate": "1999-04-01 00:00:00",
              "EquipmentTested": "New system -- all procedures are new.",
              "ChangeMgmtDate": "1999-04-01 00:00:00",
              "ChangeMgmtReviewDate": "1999-04-01 00:00:00",
              "PreStartupReviewDate": "1999-04-01 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-02-01 00:00:00",
              "ContractorSafetyReviewDate": "1998-12-04 00:00:00",
              "ContractorSafetyEvalDate": "1999-04-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Perishable prepared food manufacturing. Ready-to-eat meals",
              "_chemicals": [
                {
                  "PrimaryKey": 766,
                  "PreventionProgram3ID": 678,
                  "ProcessChemicalID": 2592
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 2220,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-04-01 00:00:00",
    "ERTrainingDate": "1999-04-01 00:00:00",
    "CoordinatingAgencyName": "Winchester/Frederick County LEPC",
    "CoordinatingAgencyPhone": "5406622298",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2220,
      "SummaryText": "\nEXECUTIVE SUMMARY\n\n1.0    Release Prevention and Emergency Response Policies\n\nThe Kraft Foods facility in Winchester, Virginia has a very good record in preventing and minimizing releases of anhydrous* ammonia.  \n\nRegular rounds are completed by maintenance personnel to inspect the system components to ensure proper operation and detect potential problems.    A preventive maintenance program has been developed and is routinely evaluated and updated for accuracy and completeness.\n\nThe emergency response policies at this facility ensure that there is emergency response coverage, 24 hours - 7 days per week.  There are also adequate provisions for coordination with outside agencies, such as with the Frederick County Fire and Rescue Company and the Winchester/Frederick County LEPC, in the event of an emergency.\n\n*From this point in the Executive Summary, anhydrous ammonia will be synonymous with ammonia.\n\n2.0    Process Description and Regulated Substances\n\nKraft Foods manufactures Ready-to-Drink Beverages and Ready-to-Eat Meal products at the Winchester, VA plant.  The North American Industry Classification System (NAICS) code for these processes are 3121 and 311991.  Kraft has one regulated substance under 40 CFR 68 at the Winchester, VA plant - ammonia.  The storage and process areas of the plant are refrigerated to keep the Ready-to-Eat Meal products fresh and wholesome.  Ammonia has been widely used as a refrigerant in the food industry for decades.\n\nThe ammonia threshold for triggering applicability to 40 CFR 68 is 10,000 pounds. The quantity of ammonia stored on-site is approximately 16,155 pounds. Thus, 40 CFR 68 is  applicable to the Winchester facility.\n \nAmmonia is classified as a Group 2 Refrigerant per ASHRAE Standard 34-1989.  Its distinctive odor is very noticeable to most people, even in small quantities.  Ammonia is flammable in a very narrow and high range of concentration with a high ignition temperature.  It is not poisonous, but it can be corrosive to hum"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2220,
      "SummaryText": "an tissue.  Ammonia is readily absorbed into the moisture of the skin and, at high concentrations, can cause burns.  The potential risks to people exposed to an accidental ammonia release include irritation of respiratory tract, burning of skin and other tissue when contacted by ammonia vapor, and freezing of skin and other body tissue when contacted by liquid ammonia.\n\n \n3.0    Release Scenarios\nAlthough there are quality and safety systems in place at Krafts Winchester, VA plant, a release from the ammonia refrigeration system could potentially affect employees on-site and the general public offsite.  USEPA requires companies to use models for worst-case and alternate release scenarios for each regulated chemical.  Given the safety precautions at the plant, both scenarios are unlikely to occur.  If a release occurred, however, the alternative scenario would be more likely.\n\nThe ammonia release scenario was modeled using SLAB (June 1990 version) to obtain the distance to the ERPG-2 endpoint.  The Emergency Response Planning Guideline, Level 2, ERPG-2, was developed by the American Industrial Hygiene Association.  It refers to the level of ammonia that individuals could be exposed to for up to one hour without being subjected to irreversible or other serious health effects that could make it difficult for them to leave the affected area.\n\n 4.0    General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThis facility is regulated under PSM.  The facility has developed an OSHA PSM program for its ammonia refrigeration system.  Ammonia falls under the RMP Program 3 prevention program, which is identical to the OSHA PSM program.  EPA has said that if the process is in compliance with OSHA PSM, then it is in compliance with RMP Program 3.  Thus, Krafts ammonia PSM has been reviewed and determined to be complete for the RMP document. \n\nThere are several aspects of the prevention program that are key:\n\n1.    The majority of the ammonia process pip"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2220,
      "SummaryText": "ing is installed in areas where there is little or no activity by people and/or machinery.  This reduces the chance of an ammonia release at the plant. \n\n2.    The plant maintains good training, certification and employee awareness of operating procedures.\n\n3.  Ten (10) percent of all welds were X-Rayed during construction for uniformity.\n\n4.  There are over 12 safety controls monitoring the compressors.\n\n5.  All ammonia pipelines are color coded and/or labeled for ease of identification.\n\n6.  All refrigeration pipe flanges have tongue-and-groove joints for stability.\n\n7.  The system operation is monitored by a computer-based control system.\n\n5.0    Five-year Accident History\n\nThe review of this facility's accident history includes the following range of dates: June 22, 1994 - June 21, 1999.  According to 40 CFR Part 68.42(a), there have been no accidental releases of ammonia at the Winchester facility.\n\n6.0    Emergency Response Program \n\nAs mentioned earlier, this facility has developed an emergency response plan, including, but not limited to, steps to address the following topics:\n7 Accidental discharge of hazardous substances and hazardous waste into the environment.\n7 The measures to be taken to prevent an accident\n7 countermeasures  to be taken in the event of an emergency, and;\n7 procedures for containing and limiting the duration of the emergency measures to be employed for further protection of employees responding to the emergency, as well as other plant personnel\n\nOur comprehensive emergency response plan is designed to protect our employees, environment and the community and, among other things, requires that:\n7 All nonessential personnel immediately exit the area affected by the release;\n7 Kraft immediately notify local officials, requesting their assistance, if necessary;\n\nFor a release that leaves the Kraft site, the company would work with local officials to notify neighbors so that appropriate safety precautions could be taken.  If ammonia is in the outside"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2220,
      "SummaryText": " atmosphere, the safest place to be is indoors with windows and doors shut and the ventilation system shut off.\n\n7.0    Planned Changes to Improve Safety \n\nBased on the \"what if/checklist\" Process Hazard Analysis (PHA) completed for ammonia, a list of action items were developed and are being monitored and revised to determine if implementation was accomplished. The following list contains examples of the PHA conducted for ammonia at the Winchester Plant.\n\n1. A concern for the Winchester Plant personnel was the possibility of process piping failure due to corrosion.  The preventative measures developed to combat this scenario are: inspection of process piping, replacement of corroded parts, repaint flaky painted surfaces, install PM for yearly inspection.\n \n2. A PHA was performed for the ammonia compressor.  The scenario for the PHA consisted of the compressor malfunctioning which causes a loss of oil pressure.  The PHA team developed the following preventative measures: yearly inspection of switches, daily inspections of pressure readings, and re-evaluate present settings and modify if necessary.\n \n3. The PHA team was concerned with the possibility of the wrong valve being opened or closed during maintenance procedures.  The PHA team recognized that the following provisions should be made to ensure a safe working environment: create written maintenance procedures, provide training for personnel involved in maintenance of the ammonia system, label valves to be closed, certification of supervisor responsible for closing/opening valves.\n \n4. The Winchester PHA team discussed the manpower required to respond to a reportable release of ammonia.  In order to ensure the health and safety of their employees the facility performs a yearly walk-through and familiarization training with the local fire department."
    }
  ]
}