{
  "FacilityID": 22263,
  "FacilityName": "Delta Distributors, St. Gabriel",
  "FacilityStr1": "7200 Highway 74",
  "FacilityStr2": null,
  "FacilityCity": "St. Gabriel",
  "FacilityState": "LA",
  "FacilityZipCode": "70776",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22047",
  "LEPC": "Iberville Parish LEPC",
  "FacilityLatDecDegs": "30.25",
  "FacilityLongDecDegs": "-91.116667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "CO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 117432992,
  "ParentCompanyName": "Brenntag",
  "Company2Name": null,
  "CompanyDUNS": 92963644,
  "Company2DUNS": 0,
  "OperatorName": "Scott Towns",
  "OperatorStr1": "7200 Highway 74",
  "OperatorStr2": null,
  "OperatorCity": "St. Gabriel",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70776",
  "OperatorZipCodeExt": null,
  "RMPContact": "Allen Reppond",
  "RMPTitle": "Operations Manager",
  "FTE": 17,
  "OtherEPAFacilityID": "LAD980621387",
  "EPAFacilityID": "100000045845",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-26 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-12-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-12-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-12-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-12-08 00:00:00",
  "DeRegistrationEffectiveDate": "2021-11-09 00:00:00",
  "AnniversaryDate": "2004-07-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 30.26023,
  "FRS_Long": -91.07416,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 31749,
      "AltID": "2",
      "FacilityID": 22263,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 32568,
          "ProcessID": 31749,
          "NAICSCode": "42269",
          "_desc": {
            "NAICS_CODE": "42269",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 41535,
          "ProcessID": 31749,
          "ChemicalID": 55,
          "Quantity": 6600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 41536,
          "ProcessID": 31749,
          "ChemicalID": 62,
          "Quantity": 88000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 541535,
          "ProcessID": 31749,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 541536,
          "ProcessID": 31749,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 22263,
      "SummaryText": "Delta Distributors, Inc. is committed to continued excellence, leadership, and stewardship in protecting the environment. Environmental protection is a primary management responsibility, as well as the responsibility of every employee. In keeping with this policy, our objective as a company is to reduce waste and achieve minimal adverse impact on air, water, and land through excellence in environmental control.\n\nWe recognize that the responsibilities for safety, health and the environment are shared:\n1. We accept the responsibility for leadership of the safety & health program, and for its effectiveness and improvement, and for providing the safeguards required to ensure safe conditions.\n2.  Our managers and supervisors are responsible for developing the proper attitudes toward safety, health and the environment in themselves and in those they supervise; and for ensuring that all operations are performed with the utmost regard for the safety and health of all personnel involved, including themselves.\n3  Our employees are responsible for wholehearted, genuine cooperation with all aspects of the safety and health program, including compliance with all rules and regulations, and for continuously practicing safety while performing their duties.\n\nOur environmental guidelines include the following:\n\n1.  Environmental protection is a line responsibility and an important measure of employee performance. In addition, every employee is responsible for environmental protection in the same manner as for safety.\n2.  Reducing or eliminating the generation of waste has been and continues to be a prime consideration in research, process design, and operations; and is viewed by management like safety, yield and loss prevention.\n3.  Source reduction / waste minimization (reuse and recycling) of materials has been and will continue to be given first consideration prior to classification and disposal ofr waste.\n\nOur St. Gabriel, LA chemical distributin facility has tank, tote, bag, cyl"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 22263,
      "SummaryText": "inder  and drum storage. It handles millions of pounds of chemicals / year. We have an Emergency Response Plan that assigns responsibilities for preventing hazardous releases.\n\nThe following chemicals are listed in program 2: Hydrofluoric Acid (70%), Chlorine.\n\nIn regard to Hydrofluoric Acid safety, this material is stored in drums, outside, away from stron acids, strong alkalies, alkali metals, brass, hypochlorites, and other incompatible materials.  We have available self-contained breathing apparatus in case of emergency spill or other release of liquid and vapor. The following considerations are taken in the case of Hydrofluoric Acid.\n\n1a. In a Worst Case Scenario (such as the bursting of a drum and releasing its contents), emergency services (such as the fire department) would be informed. Unnecessary personnel would leave the area to a distance of 1.00 miles. Other facilities would be informed within this distance, and appropriate personal protective equipment (including self-contained breathing apparatus) would be put on trained personnel, the spill would be contained by diking the spill area, and put into a salvage container for disposal. See our document ER 002 (Delta Emergency Response Plan).\n\n1b. In an Alternate Case Scenario (such as a minor leak in a drum, releasing some of its contents), emergency services (such as the fire department) would be informed. Unnecessary personnel would leave the area to a distance of 0.20 miles. Other facilities would be informed within this distance, and appropriate personal protective equipment (including self-contained breathing apparatus) would be put on trained personnel, the spill would be contained by diking the spill area, and put into a salvage container for disposal. See our document ER 002 (Delta Emergency Response Plan).\n\n2.  There have been no accidents involving Hydrofluoric Acid within the last five years.\n\n3.  Delta will respond to all emergency spills involving Hydrofluoric Acid, and emergency services wil"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 22263,
      "SummaryText": "l be informed of the situation.\n\nOther issues involving Hydrofluoric Acid include:\n\n1.  An examination of the hazards associated with the handling and storage of Hydrofluoric Acid. These are covered in our document S&H 017 (The Handling and Storage of Hydrofluoric Acid).  The scales are calibrated every six minoths to make sure they are correct. If any deviation is noticed before six months have passed, the scales are immediately recalibrated.  The calibration schedule is mentioned in our document LAB 015 (Schedule for the Calibration of Laboratory Equipment and Plant Scales).\n\n2.  Training is an ongoing requirement of plant employees.  Regarding RMP Training, it is required of any employee assigned to a new task involving RMP chemicals. Refresher training is required every three years. See our document EPA 004 (Risk Management Plan for Hazardous Substances, Page 13 of 74, Section 6.54 (Training)).\n\n3.  Regarding documentaiton of storage inspections, o0ur document OPD 002 (Supervisors Daily Plant Inspection Procedures) gives the daily inspection procedure and an inspection form to document the inspections. These documents are retained for five years. The startup of the process of unloading, handling, and loading of Hydrofluoric Acid shall require inspection of all equipment involved in the process.\n\n4.  The docment S&H 017 (The Handling and Storage of Hydrofluoric Acid) outlines the process of unloading, handling, storage and loading of Hydrofluoric Acid drums, and the safety precautions which are required.\n\n5.  The document EPA 004 (Risk Management Plan of Hazardous Substances) gives a description of the responsibilitiesof the Operations Manager and other personnel involved in RMP process in general.  The document S&H 017 (The Handling and Storage of Hydrofluoric Acid) gives a description of the Operations Manager and the other personnel involved in the process of unloading, handling, storage, and loading of Hydrofluoric Acid drums.\n\n\nIn regard to Chlorine safety, "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 22263,
      "SummaryText": "this material is stored in 2000 pound and 150 pound cylinders, outside, away from strong acids, strong alkalies, alkali metals, brass, hypochlorites, and other incompatible materials. We have available self-contained breathing apparatus in case of an emergency release of vapors.  The following considerations are taken in the case of Chlorine.\n\n1a.  In a Worst Case Scenario (such as the bursting of a 2000 pound cylinder, releasing its contents), emergency services (such as the fire department) would be informed. Unnecessary personnel would leave the area to a distance of 1.00 miles.  Other facilities would be informed within this distance, and appropriate personal protective equipment (including self-contained breathing apparatus) would be put on trained personnel, the spill would be contained by use of a special rescue cylinder repair kit.\n\nChlorine cylinders are ruggedly designed and DOT approved. A protective cap covers the cylinder valves at all times when the cylinder is not in use. The cylinders are equipped with pressure relief devices to prevent rupture of the cylinder if exposed to heat.\nChlorine cylinders are unloaded, handled, and loaded by special equipment designed specifically for cylinder handling.  Cylinders are visually inspected daily, and are inspected on a routine basis and are approved by the DOT. Employees are trained on the hazards of chlorine. Employees are trained to use special repair kits, provide fittings, and tools to quickly stop a chlorine cylinder leak. An empty, clean chlorine cylinder is used by Delta emergency responders to practice applying the special repair kit and quickly stopping a leak.  Delta Distributors maintains an emergency response team whose members are specially trained and provided with proper personal protection to allow them to respond to a chlorine leak, disperse the vapors, and stop the leak. Response is coordinated with emergency response agencies in the community if a release occurs. Delta has a contract with an"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 22263,
      "SummaryText": " emergency response company if the need arises."
    }
  ]
}