{
  "FacilityID": 22497,
  "FacilityName": "Cordova Energy Company, LLC",
  "FacilityStr1": "24712 - 192nd Avenue N.",
  "FacilityStr2": null,
  "FacilityCity": "Cordova",
  "FacilityState": "IL",
  "FacilityZipCode": "61242",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17161",
  "LEPC": "Rock Island County LEPC",
  "FacilityLatDecDegs": "41.708722",
  "FacilityLongDecDegs": "90.281667",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": "www.midamerican.com",
  "FacilityEmailAddress": "jhansen@midamerican.com",
  "FacilityDUNS": 963008388,
  "ParentCompanyName": "MidAmerican Energy Holdings Company",
  "Company2Name": null,
  "CompanyDUNS": 963008388,
  "Company2DUNS": 963008388,
  "OperatorName": "Cordova Energy Company, LLC",
  "OperatorStr1": "24712 - 192nd Avenue N.",
  "OperatorStr2": null,
  "OperatorCity": "Cordova",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "61242",
  "OperatorZipCodeExt": null,
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000174018",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "161807AAN",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-01-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-01-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-01-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-01-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 41.712682,
  "FRS_Long": -90.279831,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 32110,
      "AltID": "Aqueous Ammonia System",
      "FacilityID": 22497,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 42075,
          "ProcessID": 32110,
          "ChemicalID": 57,
          "Quantity": 360000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 32949,
          "ProcessID": 32110,
          "NAICSCode": "221119",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 22497,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Rock Island County LEPC",
    "CoordinatingAgencyPhone": "3097995166",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 22497,
      "SummaryText": "Executive Summary for Cordova Energy Company Risk Management Plan\n\nAccidental Release Prevention and Emergency Response Policies\n\nCordova Energy Company is strongly committed to employee, public and environmental safety.  The commitment is demonstrated by an accidental release program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with processes at the facility.  It is our policy to implement appropriate controls to prevent potential releases of regulated substances.\n\nThe Facility and Regulated Processes\n\nAt the time of development of this Risk Management Plan (RMP) under the requirements of 40 CFR Part 68, Cordova Energy Company had not begun to operate our facility in Cordova, Illinois.  Therefore, some of the plans and procedures associated with the regulated process (described below) had not yet been implemented.  For example, the Emergency Response Plan is not expected to be fully developed until April 2001.  The following discussion provides the most recent date when an activity has been conducted and a frequency schedule when the activity has not yet been conducted.\n\nCordova Energy Company's primary activity is the generation of electric energy by combustion of natural gas.  Part of that activity involves the use of a system that provides aqueous ammonia for selective catalytic reduction in the heat recovery steam generators.  The aqueous ammonia storage and forwarding system (the process) consists of a storage tank, two forwarding pumps, associated piping, valves, and instrumentation.  Atomized ammonia is sprayed on to the SCR section.  The flue gas entrains the ammonia and as the mixture passes through the SCR, it undergoes a reaction that reduces nitrogen oxides to meet environmental regulatory requirements.\n\nThe maximum inventory of aqueous ammonia in the process is 50,000 gallons (360,000 pounds).  In the storage tank, ammonia is concentrated at 29% in water.\n\nWorst-Case and Alternative"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 22497,
      "SummaryText": "Release Scenarios\n\nTo perform the required off-site consequence analysis for the facility, we used the EPA's Risk Management Program Guidance for Offsite Consequence Analysis, issued April 1999.  The worst-case scenario involved the catastrophic release of aqueous ammonia from the storage tank.  In this scenario, all 50,000 gallons of aqueous ammonia is released into the diked enclosure around the storage tank, forming a pool from which evaporation takes place. At Class F atmospheric stability and 1.5 meters/second wind speed, the maximum distance of 0.5 mile is obtained to a toxic endpoint of 0.14 mg/L.\n\nThe alternative release scenario is one more likely to occur than the worst-case scenario, unless no release occurs.  In this scenario, 50,000 gallons of aqueous ammonia is released from the storage tank into the diked enclosure.  No controls were assumed, even though flow valves may be utilized in an emergency to mitigate releases.  Also, less than 50,000 gallons of aqueous ammonia will be typically present.  Under neutral weather conditions (stability Class D) and wind speed of 3 meters/second, the maximum distance to the toxic endpoint of 0.14 mg/L is 0.2 mile.\n\nWe determined that there are no public receptors within the worst-case or alternative release scenarios.  Also, since the facility is new, there is no history of releases of regulated substances.  Therefore, this process qualifies for Program Level 1.  The facility's responsibilities under Program Level 1 are:\n* Limited hazard assessment requirements, \n* A written description of the worst-case release scenario (including documentation of the estimated quantity of worst-case release, release rate, and duration of release, the methodology used to determine the distance to endpoints, data used to determine that no public receptors would be affected, and information on the coordination with public responders), and\n* Minimal prevention and emergency response requirements.\n\nGeneral Accidental Release Preventi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 22497,
      "SummaryText": "on Program and Chemical-Specific Prevention Steps\n\nThe facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68 for Program Level 1 processes.  The facility was designed and constructed in accordance with appropriate engineering and nationally recognized design standards.  The following sections describe the elements of the release prevention program that is in place.\n\nProcess Safety Information\nIn accordance with 40 CFR 68.48, Cordova Energy Company maintains detailed records of safety information that describes chemical hazards, operating parameters, and equipment designs associated with the regulated process.  Records include\n* material safety data sheets, \n* maximum intended inventory of equipment in which aqueous ammonia is stored, \n* safe upper and lower temperatures, pressures, flows and compositions,\n* equipment specifications, and\n* codes and standards used to design, build, and operate the process.\nThe process has been designed in compliance with recognized and generally accepted good engineering practices.   Safety information will be periodically reviewed to ensure that it is accurate.\n\nProcess Hazard Analysis\nIn accordance with 40 CFR 68.50, Cordova Energy Company has conducted a review of the hazards associated with aqueous ammonia, so that controls can be implemented, as necessary.  The methodology used includes checklists and a planned 5-year review by qualified engineering personnel.  The review identifies\n* any hazards associated with the process and ammonia,\n* opportunities for equipment malfunctions or human errors that could result in an accidental release,\n* safeguards used or needed to control the hazards or prevent equipment malfunction or human error, and\n* steps used or needed to detect or monitor releases.\n\nThe initial hazard review was performed prior to process startup.  The results of future hazard reviews will be documented to ensure that any problems identifi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 22497,
      "SummaryText": "ed are resolved in a timely manner.\n\nOperating Procedures\nFor the purpose of safely conducting activities within the process, Cordova Energy Company maintains written operating procedures in compliance with 40 CFR 68.52.  These procedures address various modes of operation such as startup, normal operations, emergency shutdown, inspections and emergency operations.  The information is regularly reviewed and is readily accessible to operators involved in the process.\n\nTraining\nIn accordance with 40 CFR 68.54, Cordova Energy Company has a comprehensive training program in place to ensure that employees who are operating the process are competent in the operating procedures associated with the process.  The training program provides for refresher training at least every three years and more frequently, as needed.\n\nMaintenance\nIn accordance with 40 CFR 68.56, Cordova Energy Company carries out documented maintenance checks on process equipment to ensure proper operation.  Process equipment examined by these checks includes ammonia forwarding pumps, storage tank, dilution air fans, heaters, ammonia detectors, associated piping and instrumentation.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner. \n\nManagement of Change\nWritten procedures are in place to manage changes in process chemicals, technology and procedures.  Reviews of maintenance procedures are performed routinely and documented in the operating record.  Process operators, maintenance personnel and other employees whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-Startup Reviews\nPre-startup safety reviews related to new processes and to modifications in established proce"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 22497,
      "SummaryText": "sses are conducted as a regular practice. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nIn compliance with 40 CFR 68.58, Cordova Energy Company conducts compliance audits at least every three years to determine whether the provisions set out under the RMP rule are being implemented.  These audits are to be conducted by persons knowledgeable in the process.  Corrective actions required as a result of the audits will be documented to assure that they are undertaken in a safe and prompt manner.  Compliance audit reports will be maintained for a minimum of five years.\n\nIncident Investigation\nIn accordance with 40 CFR 68.60, Cordova Energy Company will promptly investigate any accident that has resulted in, or could reasonably result in, a reportable release of a regulated substance.  These investigations will be undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  Investigation summaries will be maintained for a minimum of five years.\n\nEmployee Participation\nCordova Energy Company believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.   Cordova Energy Company has a strict policy of informing the contractors of potential hazards related to the contractor's work and the"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 22497,
      "SummaryText": "processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur. \n\n\nEmergency Response Plan\n\nCordova Energy Company has planned to develop a written emergency response plan to deal with accidental releases of hazardous materials.  The plan, to be developed by April 2001, will include aspects of emergency response including notifications of local emergency response agencies and the public, first aid and medical treatment, evacuations, and post-incident decontamination of infected areas.  We do not maintain an emergency response capability within the facility for major incidents; the emergency response plan calls for notification of outside assistance in dealing with hazardous materials incidents.\n\nTo insure proper functioning, our release detection, routine monitoring and emergency equipment will be regularly inspected and serviced.  Also, the emergency response plan will be routinely reviewed and updated as necessary to reflect pertinent changes taking place within the processes that would require amended emergency response measures.\n\nThe Rock Island County Emergency Services and Disaster Agency is the Local Emergency Planning Committee (LEPC) with which our emergency plan will be coordinated.  The telephone number of the LEPC is (309) 799-5166.\n\nFive-Year Accident History\n\nBecause the facility is new, there is no history of accidents at the Cordova Energy Company."
    }
  ]
}