{
  "FacilityID": 2254,
  "FacilityName": "Eagle Convex Specialty Glass Company",
  "FacilityStr1": "423 Tuna Street",
  "FacilityStr2": null,
  "FacilityCity": "Clarksburg",
  "FacilityState": "WV",
  "FacilityZipCode": "26302",
  "Facility4DigitZipExt": "1340",
  "FacilityCountyFIPS": "54033",
  "LEPC": "Harrison County LEPC",
  "FacilityLatDecDegs": "39.268889",
  "FacilityLongDecDegs": "-80.300556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "OT",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "eagleconvex@compuserve.com",
  "FacilityDUNS": 4335964,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Thomas D. Hays",
  "OperatorStr1": "PO Box 1340",
  "OperatorStr2": null,
  "OperatorCity": "Clarksburg",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "26302",
  "OperatorZipCodeExt": null,
  "FTE": 60,
  "OtherEPAFacilityID": "26301GLCNV423TU",
  "EPAFacilityID": "100000027204",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "0330040",
  "SafetyInspectionDate": "1998-04-23 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Hydrofluoric Acid 70%",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-11 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 39.272222,
  "FRS_Long": -80.319194,
  "FRS_Description": "PLANT ENTRANCE (PERSONNEL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2472,
      "AltID": "Hydrofluoric Acid",
      "FacilityID": 2254,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 2632,
          "ProcessID": 2472,
          "ChemicalID": 55,
          "Quantity": 8080.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 2522,
          "ProcessID": 2472,
          "NAICSCode": "32721",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 702,
              "Process_NAICS_ID": 2522,
              "SafetyReviewDate": "1999-04-22 00:00:00",
              "PHA_Date": "1999-04-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-04-22 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "distribution of new information to community and employees",
              "OpProceduresReviewDate": "1998-07-01 00:00:00",
              "TrainingReviewDate": "1998-06-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-07-01 00:00:00",
              "EquipmentInspectionDate": "1999-04-29 00:00:00",
              "EquipmentTested": "all process equipment and PPE checked daily",
              "ChangeMgmtDate": "1997-03-01 00:00:00",
              "ChangeMgmtReviewDate": "1998-04-01 00:00:00",
              "PreStartupReviewDate": "1998-07-01 00:00:00",
              "ComplianceAuditDate": "1998-07-01 00:00:00",
              "AuditCompletionDate": "1999-05-30 00:00:00",
              "IncidentInvestigationDate": "1996-03-01 00:00:00",
              "InvestigationChangeDate": "1996-05-24 00:00:00",
              "ParticipationPlansReviewDate": "1998-07-01 00:00:00",
              "HotWorkPermitReviewDate": "1998-07-01 00:00:00",
              "ContractorSafetyReviewDate": "1998-07-01 00:00:00",
              "ContractorSafetyEvalDate": "1998-07-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 794,
                  "PreventionProgram3ID": 702,
                  "ProcessChemicalID": 2632
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 2254,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-22 00:00:00",
    "ERTrainingDate": "1998-06-01 00:00:00",
    "CoordinatingAgencyName": "Annmore Fire Department",
    "CoordinatingAgencyPhone": "3046247461",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2254,
      "SummaryText": "1. Stationary source and regulated substances handled.\n\nEagle Convex is a fabricator of finished plate glass products.  Finished products that are commonly produced at the facility include TV screens, computer screens, appliance templates, and outdoor lighting fixtures.  Cut flat glass is delivered to the facility and the facility then molds, cuts, drills, and finishes the glass in accordance to the client's requirements.  In addition to current operations at the facility, past glass fabrication processes have also included mirror silvering and ink decorating.\n\nPrimary materials used in production include pre-manufactured glass items, product treatment chemicals (hydrofluoric acid, sulfuric acid, ammonium bi-fluoride (ABF) and di-ethylene glycol).  These materials are stored in drums or small containers.  \n\nFor the purposes of the RMP, Hydrofluoric Acid (HF), delivered to the property in a 70% concentration, is the only regulated substance at the facility.  From the calculation shown on page 1-11 in the General Guidance for Risk Management Plans, the adjusted threshold quantity for 70% Hydrofluoric Acid is 1428.57 pounds.  The average on-hand quantity for Eagle Convex is 8080 pounds.\n\n2. The five-year accidental history.\n\nThe majority of the original plant was destroyed by fire in March 1996. Asbestos was the main hazardous material involved in the fire.  The cause of the fire is unknown.  No hydrofluoric acid was released outside the system during the release.  There were no injuries or environmental impacts as a result of the hydrofluoric acid during the incident.  All hydrofluoric acid in process was released into the on-site wastewater treatment facility and diluted for permitted release.\n\n3. The Worst-Case and Alternate Case Scenarios.  RMP*Comp Version 1.05 was used to calculate both the worst-case and alternate-case scenarios.\n\nThe worst-case scenario involves the loss of the contents in the Polish Tank.  The tank is a mixture of 70% hydrofluoric acid, and"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2254,
      "SummaryText": "two additional aqueous materials.  Since the loss would be a mixture of the three materials, the actual percentage of HF is less than 70%. This process was chosen since it has the greatest amount of HF and the increase in the temperature of the material.  The process involving the tank is inside the building, which results in passive mitigation of containment.  Additional mitigation and administrative controls include the draining of any released materials in the process area into the on-site wastewater treatment facility for dilution.  Since any material release would immediately empty into the floor drains and then into the wastewater treatment facility, it is plausible that no material would leave the building causing an incident.  If the wastewater treatment facility were left without electricity, the amount of water in the system would dilute the HF to a point that it would not exceed the endpoint at the site.\n\nThe alternative release scenario involves the loss of the contents of one 55-gallon drum of 70% Hydrofluoric Acid.  The scenario would be due to the faucet from the gravity fed either failing or being accidentally left open.  This could possibly result in the loss of the drum contents.  This process was chosen since it would result in the second largest release of HF.  The loss would be inside the building with the containment passive mitigation.  Any released materials would be drained into the wastewater treatment process.  For the worst-case scenario the process tank material would need to drain across the floor to reach a floor drain.  In the drum storage area, the drums are placed directly above a drain.  Any spillage would result in the contents immediately releasing into the drain system.  As previously mentioned, it would be difficult to pass the toxic endpoint at the site due to the dilution system in place.\n\n4. The accidental release prevention and emergency response policies at the stationary source.\nAccidental release prevention includes cont"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 2254,
      "SummaryText": "notification and response procedures.  \n\nIn addition to the written procedural guidelines, the Emergency Incident Contingency Plan contains several flow charts and lists detailing necessary information for an incident.  It also contains plant maps and evacuation routes.\n\n7. Planned changes to improve safety.\nChanges to improve the safety and the prevention process include:\nWorking with Employers Service Corporation (loss control consultants) to assess corporate management; the facilities management of the safety program; accountability of safety responsibilities; safety programs and procedures, management audits of the safety program; implementation of a facility safety committee, accident investigation; hazard identification through regular inspections; regulatory compliance; medical control; employee and supervisor training; safety and health recordkeeping; emergency preparedness; claims management and the return to work program.  We are continually reviewing our safety procedures and spill prevention and working with the local fire department to improve our programs.\n\nIn the process area a project in the near future will improve the acid addition procedure.  Instead of the necessity of transport buckets of acid from the gravity fed drum to the tank, a system will be set up to directly gravity feed into the processing tank.  This will eliminate the need for the employees to handle the transportation procedure."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2254,
      "SummaryText": "ainment, impervious concrete flooring, and floor drains that lead to the onsite wastewater treatment.\n\nEmergency response policies include both the Emergency Action Plan and Emergency Response Plan.  A separate Fire Prevention Plan address those hazards and policies associated with the possibility of a fire or explosion.  Plans involve the designation of a coordinator and team; escape routes and assembly areas for employees; training necessary for the plans; coordination with external agencies including fire and medical services; state and federal agencies to contact for hazardous spills and releases; natural disaster procedures; and post-incident follow-up procedures.  The plans include policies and procedures for the maintenance of all emergency equipment and procedures for review and updates to the written programs.\n\n5. The general accident release prevention program and chemical-specific prevention steps.\n\nEagle Convex, in compliance with OSHA, has the following written programs in-house:  Lockout/Tagout; Confined Space; Forklift Safety; Hazard Communication, Emergency Incident Contingency Plan and Hearing Conservation.\n\nThe chemical prevention program for HF includes containment and processed dilution through the on-site wastewater treatment facility.   Plans for the prevention and response to spills concerning HF include the capture of any HF released to divert to the wastewater treatment facility for dilution and permitted release.  The Clarksburg Fire Department is familiar with the HF process and is updated with every change in the process.  \n\nThe hydrofluoric acid is stored in a gravity feed system.  Using a gravity fed faucet, employees place the appropriate amount of acid in a covered bucket for transport to the process tanks.  Any spilled material will empty into the floor drains leading to the wastewater treatment facility.  Several fume hoods are in place in the processing area to remove any fumes from the process tanks.  Air quality stack testing is"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2254,
      "SummaryText": "performed under the guidelines of the state air permit.\n\nPersonal Protective Equipment (PPE) for the employees has been recently revised.  Employees working with the hydrofluoric acid wear two-piece impervious suits, full-face splash shields, impervious gloves, and respirators.  Employees check all equipment before each usage for wear and tear.  A clean water dip tank is available to check for holes in gloves.  New equipment is kept in stock for when needed.  Employees receive yearly check-ups with the occupational physician for respirator use.  Training is ongoing and each step in the process is a two-person procedure.  As one employee performs the procedure, another employee double-checks the work for additional safety.  Access to the processing area is limited to trained and PPE wearing employees.  All other facility employees, including the wastewater treatment facility operator and facility management, are trained on the hazards of the HF and the systems in place to prevent spills and overexposure.\n\n6. The emergency response program.\n\nThe Emergency Incident Contingency Plan outlines the procedures for an emergency response at the facility.  Provisions include:\n7 All employees will be trained on the plan prior to their first day's work.  \n7 All Etch Department employees (where the HF process is housed) are to be trained to the level of First Responder, Awareness Level (according to 29 CFR 1910.120(q)(6)(i)A-F).  \n7 The assigned Incident Commander will handle incidents.  A block flow diagram in the plan shows the hierarchy of command and incident assignments.  \n7 The Conference Room will be designated as the Command Center unless that is not possible.  If necessary the center will be moved to the parking lot then to the Fire Department if the parking lot is not possible.\n\nResponsibilities under the plan include:\n7 Product Line Managers are in charge of shutting down production and supervising the evacuation of employees in their departments.\n7 Incident Commander"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 2254,
      "SummaryText": "will be responsible for overall command of the incident.\n7 Safety director will be responsible for consulting with the CEO and COO and notify the proper local, state and federal agencies.  All relevant agencies, contact points, and phone numbers are listed in the plan.\n7 Employees (not involved in the above activities) are to know and understand evacuation routs and procedures; how to recognize and report an emergency; evacuate the plant when deemed necessary; know and go to the location of the safe area; report and remain at the safe area until released.\n\nTraining, Emergency Recognition and Prevention:\nEmployees will be trained under the appropriate OSHA standard (Hazard Communication, HAZWOPER, etc.).  In addition the training will include all applicable written work procedures, locations of eye wash and safety shower stations, fire extinguisher locations, evacuation routes, locations of fire pull alarms and the nearest telephone, the proper use of PPE, and leak detection signs and symptoms.\nThe plan will be evaluated annually and revised as necessary.  New processes, equipment, structural changes, modifications in routes of egress, new or revised regulations, new or changes in emergency prevention technology on-site, and plan efficiency will be included in the evaluation.\n\nVarious scenarios for incidents are outlined and procedures detailed.  These scenarios include fires, toxic material releases and spills and acts of sabotage or catastrophic release.  For a fire, employees are to use the nearest extinguisher if the fire can be contained.  If not, the employee is to notify the front office and the fire department immediately.  This will set the evacuation procedures in motion.  Flow charts outline the personnel to notify and the information to supply to the fire department.  For a release, the employee is to notify the department manager.  For a large spill the employee is to notify other employees in the area then follow the flow chart in the plan outlining the"
    }
  ]
}