{
  "FacilityID": 2257,
  "FacilityName": "City of Palm Bay Water and Wastewater Facilities",
  "FacilityStr1": "1080 Troutman Blvd NE",
  "FacilityStr2": "1101 Troutman Blvd NE",
  "FacilityCity": "Palm Bay",
  "FacilityState": "FL",
  "FacilityZipCode": "32905",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12009",
  "LEPC": "District 6 LEPC",
  "FacilityLatDecDegs": "28.025278",
  "FacilityLongDecDegs": "-80.597778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 45462686,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Palm Bay Utilities",
  "OperatorStr1": "1105 Troutman Blvd NE",
  "OperatorStr2": null,
  "OperatorCity": "Palm Bay",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32905",
  "OperatorZipCodeExt": null,
  "RMPContact": "Richard Nipper",
  "RMPTitle": "Operations Division Manager",
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000032109",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-12-10 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-02-12 00:00:00",
  "DeRegistrationEffectiveDate": "2009-02-02 00:00:00",
  "AnniversaryDate": "2004-06-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 28.02072,
  "FRS_Long": -80.59843,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "conversion of Chlorine Gas to Sodium Hypochlorite",
  "_processes": [
    {
      "ProcessID": 2475,
      "AltID": "Water and Wastewater",
      "FacilityID": 2257,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2525,
          "ProcessID": 2475,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        },
        {
          "Process_NAICS_ID": 2526,
          "ProcessID": 2475,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 2635,
          "ProcessID": 2475,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502635,
          "ProcessID": 2475,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2257,
      "SummaryText": " EXECUTIVE SUMMARY\n\n\n1. Accidental Release Prevention and Emergency Response Policies\n\nThe City of Palm Bay Utilities Water and Wastewater Treatment Facilities are required to provide disinfection to the finished potable water/wastewater plant effluent prior to discharge.  Chlorine gas is used to achieve the level of disinfection required under state and federal regulations.  Chlorine is considered a toxic substance by the Environmental Protection Agency (EPA) and because quantities above the 2,500 pound threshold limit are stored on-site, a Risk Management Plan (RMP) is required.  The same properties that make chlorine valuable as a disinfectant in wastewater and drinking water also make it necessary to observe certain safety precautions in handling chlorine to prevent unnecessary human exposure, to reduce the threat to on-site personnel, and to reduce the threat to nearby members of the community.  It is the policy of the City of Palm Bay to adhere to all applicable federal and state rules and regulations.  Safety depends on the manner in which chlorine is handled, the safety devices inherent in the design of the facilities, safe handling procedures of the operators, and the training of personnel.\n\nThe Brevard County Hazardous Materials Emergency Response Plan is the basis for the  City of Palm Bay's emergency response program. Each facility has procedures for notification of the City of Palm Bay Fire Department and the Brevard County Fire Rescue Specialized Response Team.  \n\n2. The Stationary Source and Regulated Substances Handled\n\nThe primary purposes of the City of Palm Bay's water and wastewater treatment facilities are to provide either a clean, safe, palatable drinking water that meets all the requirements of the Safe Drinking Water Act, and a properly treated and disinfected reclaimed wastewater that meets all federal and state requirements.  The chlorine is received via ground transportation from PB&S Chemical.  Access to these sites is restricted to auth"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2257,
      "SummaryText": "orized facility employees, management personnel, and other authorized personnel.  Chlorine is the only substance at these facilities regulated under 40 CFR Part 68, Chemical Accident Prevention Provisions.  The total combined inventory of chlorine stored at these facilities is 20,000 pounds.  Horizon Gas Co. leases land adjacent to the water treatment plant for propane storage.  Because Horizon Gas Co. operates and maintains the propane facility, it was not included in the City's Risk Management Program.\n\n3. The Worst-Case Release Scenario and the Alternative Release Scenario, Including Administrative Controls and Mitigation Measures to Limit the Distances for Each Reported Scenario. \n\nWorst-Case Scenario - Catastrophic failure of a 1-ton chlorine container due to corrosion, impact, or structural defects.  It is assumed in this scenario that all 2,000 pounds of the chlorine is released as vapor, which is heavier than air, in 10-minutes at a release rate of 200 lbs/min.  The distance to the endpoint of 0.0087 mg/L was determined to be 1.3 miles using to the EPA model RMP*Comp.  The affected area would include four elementary schools, one industrial area and residential areas.  Attachment 5B shows the affected area for the worst case release scenario.\n\nAlternative Release Scenario - Tubing failure, bad connection, or valve failure resulting in the release of chlorine gas through the 5/16-inch diameter valve body opening.  It is assumed in this scenario that a 317 pound total release of chlorine gas occurs with a maximum average sustained release rate of 10.5 pounds per minute for a 60 minute duration.  The distance to endpoint of 0.0087 mg/L was determined to be 0.1 miles using the EPA model RMP*Comp.  The affected area would include residential areas for a total of 47 persons.  Attachment 5C shows the affected area for the alternate release scenario.\n\nPrior to acceptance of the 1-ton chlorine containers, each container is inspected for visual defects that may cause a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2257,
      "SummaryText": "n accidental release.  The chlorination systems operate under vacuum pressure and are monitored continuously and inspected daily. \n\n4. The General Accidental Release Prevention Program and the Specific Prevention Steps.\n\nThese facilities comply with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  These facilities were designed and are operated in accordance with federal and state codes and regulations.\n\n5. Five-Year Accident History\n\nThere have not been any accidental releases of chlorine in the last five years.\n\n 6. The Emergency Response Program\n\nThe Brevard County Hazardous Materials Emergency Response Plan is the basis for the  City of Palm Bay's emergency response program..  Notification and response procedures have been discussed with the City of Palm Bay Fire Department and the Brevard County Fire Rescue Specialized Response Team.\n\n7. Planned Changes to Improve Safety\n\nThe chlorination systems for these facilities were improved in 1991 (water) and 1989 (wastewater) respectively.  Replacement of some wastewater chlorination system equipment is expected later this year.  Additional improvements include replacement of personal protective equipment such as SCBA gear and additional training to plant operators.  All improvements are scheduled to be finished prior to July of 1999.\n"
    }
  ]
}