{
  "FacilityID": 22728,
  "FacilityName": "Saluda Lake Water Treatment Plant",
  "FacilityStr1": "324 Buckskin Road",
  "FacilityStr2": null,
  "FacilityCity": "Easley",
  "FacilityState": "SC",
  "FacilityZipCode": "29640",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45077",
  "LEPC": "Pickens County LEPC",
  "FacilityLatDecDegs": "34.854722",
  "FacilityLongDecDegs": "-82.52",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.easleyutilities.com",
  "FacilityEmailAddress": "hatkins@easleyutilities.com",
  "FacilityDUNS": 70363874,
  "ParentCompanyName": "Easley Combined Utilities",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Easley Combined Utilities",
  "OperatorStr1": "324 Buckskin Road",
  "OperatorStr2": null,
  "OperatorCity": "Easley",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29640",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000026241",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0000",
  "SafetyInspectionDate": "1995-03-12 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-02-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-02-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-02-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-02-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 34.86376,
  "FRS_Long": -82.49125,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 32515,
      "AltID": "Drinking Water Treatment",
      "FacilityID": 22728,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 42759,
          "ProcessID": 32515,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 33355,
          "ProcessID": 32515,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 18240,
              "Process_NAICS_ID": 33355,
              "SafetyReviewDate": "2000-04-16 00:00:00",
              "PHA_Date": "2000-04-16 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-05-15 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Pressure Vac Regulators",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Vacuum Regulator and alarm",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-04-16 00:00:00",
              "TrainingReviewDate": "2000-04-16 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-04-16 00:00:00",
              "EquipmentInspectionDate": "2001-02-06 00:00:00",
              "EquipmentTested": "Wallace & Tiernan V-75VA5-500#Chlorinators, Injectors & Vac System",
              "ChangeMgmtDate": "2000-07-15 00:00:00",
              "ChangeMgmtReviewDate": "2000-07-15 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1998-01-07 00:00:00",
              "AuditCompletionDate": "1998-05-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-04-16 00:00:00",
              "HotWorkPermitReviewDate": "2000-04-16 00:00:00",
              "ContractorSafetyReviewDate": "2000-04-16 00:00:00",
              "ContractorSafetyEvalDate": "2000-04-16 00:00:00",
              "CBI_Flag": 0,
              "Description": "Drinking Water Treatment",
              "_chemicals": [
                {
                  "PrimaryKey": 26714,
                  "PreventionProgram3ID": 18240,
                  "ProcessChemicalID": 42759
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 22728,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2001-09-08 00:00:00",
    "ERTrainingDate": "2001-09-08 00:00:00",
    "CoordinatingAgencyName": "Easley Fire Department",
    "CoordinatingAgencyPhone": "8648598950",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 22728,
      "SummaryText": "The Easley Combined Utilities, South Carolina (ECU) accidental release prevention policy involves a unfifed approach that entegrates technologies, and management practices.  This policy complies with all the applicable requirements of section 112(r) of the Clean Air Act (CAA) and all applicable procedures of the Environmental Protection Agency's Risk Management Program (RMP).  The ECU Risk Management Program involves the preparation of response plans that are tailored to each facility.\n\nThe Saluda Lake Water Treatment Plant and Middlebranch Wastewater Treatment Plant are facilities owned by the ECU that exceed the OSHA Process Safety Management Program (PSM) (29 CFR 1910.119) threshold limit of 1500 pounds of Chlorine (CAS: 007782-50-5).  These facilities are manned and are required by 1910.119 to establish a PSM program.  The ECU has implemented  a PSM program that is unique to each facility.  Presently all the facilities exceed the threshold limit of 1500 pounds of chlorine established by CAA 112r, therefore, each facility has implemented a Risk Management Program based on CAA 112r Program 3 requirements.\n\nEach facility has special characteristics such as number of employees, hours the facility is manned, density of the surrounding population, and public receptors that required the ECU to develop RMP for each of the facilities.  The facilities use many technological and managerial practices that are not unique, in fact, are common in the water and wastewater industry.  Liquid chlorine is delivered to each of the facilities in ton cylinders and placed in a tank storage area.  Gaseous Chlorine, collecting in the top of the tank as a function of temperature, is piped off by a vacuum chlorinating system and injected into potable water to form a solution of hypochlorite.  The solution is piped to contact chambers for the purpose of disinfecting water and wastewater.  The equipment at each facility includes a tank storage area, chlorinator room that contains the chlorin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 22728,
      "SummaryText": "ators, flow recorders, various safety equipment, and diagrams are included in the ECU PSM for each facility.\n\nThe offsite consequence analysis, required by CAA includes consideration of two chlorine release scenarios, identified as \"worst case release\" and \"alternative scenario\".  The first scenario is defined by EPA, which states that \"the owner or operator shall assume that the...maximum quantity in the largest vessel...is released as a gas over 10 minutes,\"due to an unspecified failure.  The alternative scenario is defined as \"more likely to occur than the worst case release scenario\".\n\nAtmospheric dispersion model was performed for each facility based on the RMP COMP VER. 1.06.  The RMP COMP PROGRAM was used to determine the distance traveled by the chlorine released before its concentration decreases to the \"toxic endpoint\" selected by EPA of 3 ppppm or 0.0087 mg/l, which is the Emergency Response Planning Guideline Level 2 (ERPG-2).  This is defined by the American Industrial Hygeine Association (AIHA). as the \"maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's  ability to take protective action\".  The residential population within a circle with a radius corresponding th the toxic endpoint distance is defined, \"to estimate the population potentially affected\".\n\nWORST CASE RELEASE SCENARIO\n\nThe worst case release scenario for Saluda Lake Water Treatment Plant involves a failure of one ton cylinder (a total of 2000 lbs of chlorine).  The conditions for the worst case scenario are predefined by EPA (release of the entire amount of gas in 10 minutes).  The rate of release is equal to the amount in the cylinder divided by the time of the release or 2000 lbs/10 minutes = 200 lbs/minute.  The facility has containment walls so that 0.55 mitigating factor was calculated for "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 22728,
      "SummaryText": "passive mitigation.  The mitigating factor would reduce the rate of release to 110 lbs/min.  This includes the following conditions\" rate of release 110 lbs/minute, urban conditions, f stability, 1.5 meters per second wind speed, 0.0087 toxic endpoint.  When using the RMP COMP analysis the distance to a toxic endpoint is 0.9 miles\n\nWhen the RMP COMP analysis for worst case scenario is used to obtain the distance endpoint of 0.9 miles, an area of concern can be identified in order to obtain an estimate of the population affected.  In addition, other public receptors can be identified including schools, businesses, industries, and recreational facilities.  The receptors identified for the worst case scenario for each of the facilities are as follows: Sauda Lake Water Treatment Plant: population affected 141; schools 0; business and industry 6; parks and recreation 2; environmental 0.\n\nMITIGATION\n\nActuation of the chlorine detector would cause the on duty operator to respond to the alarm.  The response of the operator would take 60 minutes or less  and is an active mitigation measure.  An additional active mitigation system is the remote vacuum type cholorinators.  This system will reduce significantly the amount of chlorine released in the case of a piping rupture.\n\nACCIDENTAL RELEASE PRIVENTION PROGRAM\n\nThe Accidental Release Prevention Program at all the ECU facilities is based on the elements of the OSHA PSM Program.  The PSM program is a comprehensive and detailed toxic chemical management program that is available for inspection at each of the ECU facilities.  The program includes the following accidental release prevention elements:\n\nHigh level and continuous traninig of the operators\nPreventive maintenance program\nThe use of accurate and effective operating procedures, written with the participation of the operators\nThe use of state of the art process and safety equpment\nPerformance of a hazard assessment of equipment and procedures\nImplementation of an auditin"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 22728,
      "SummaryText": "g and inspection program\nContinuous review of process information including study  of Material Safety Data Sheet which includes information on the hazardous and toxic properties of chlorine\nChemical-specific steps include the availability of full face respirators and self contained breathing apparatus\n(SCBA), worn by the operators during tank change outs and alarm response\nChlorine detectors at all storage areas\n\nACCIDENTAL RELEASES\n\nNo accidental releases of chlorine occurred at this facility in the past five years.\n\nEMERGENCY RESPONSE PROGRAM\n\nThis facility has an emergency response program, which is a requirement of the PSM program, which is a complete and comprehensive program.  The program includes clearly defined prioritized emergency actions and notifications.  Emergency drills are conducted on an annual basis and are coordinated with the local Emergency Preparedness Division.  The complete detailed plan is located at the water plant.\n\nHAZARD ANALYSIS\n\nRecent improvements to this faiclity include installation of windsocks, vacuum system, pipe and instrumentation diagrams and yard alarms, all of which were identified in the hazard analysis as needed improvements.  The initial Process Hazard Analys was conducted for this facility as required by the Process Safety Management Program and can be found in the PHA  section of the program."
    }
  ]
}