{
  "FacilityID": 22786,
  "FacilityName": "Shalersville Water Treatment Plant",
  "FacilityStr1": "9750 Coit Road",
  "FacilityStr2": "P.O. Box 1217",
  "FacilityCity": "Ravenna",
  "FacilityState": "OH",
  "FacilityZipCode": "44266",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39133",
  "LEPC": null,
  "FacilityLatDecDegs": "41.257222",
  "FacilityLongDecDegs": "-81.268056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "PCWRLAB@apk.net",
  "FacilityDUNS": null,
  "ParentCompanyName": "Portage County Water Resources Department",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Portage County Water Resources Dept",
  "OperatorStr1": "P.O.Box 1217",
  "OperatorStr2": null,
  "OperatorCity": "Ravenna",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44266",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": "PSW 6702812",
  "EPAFacilityID": "100000036695",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-02-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-02-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-02-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2012-04-09 00:00:00",
  "DeRegistrationEffectiveDate": "2012-04-04 00:00:00",
  "AnniversaryDate": "2006-02-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 41.257222,
  "FRS_Long": -81.268056,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 32587,
      "AltID": null,
      "FacilityID": 22786,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 42837,
          "ProcessID": 32587,
          "ChemicalID": 62,
          "Quantity": 6250.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 33427,
          "ProcessID": 32587,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 18281,
              "Process_NAICS_ID": 33427,
              "SafetyReviewDate": "2001-01-24 00:00:00",
              "PHA_Date": "2001-02-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-01-24 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2001-01-24 00:00:00",
              "TrainingReviewDate": "2001-01-25 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-01-23 00:00:00",
              "EquipmentInspectionDate": "2001-01-23 00:00:00",
              "EquipmentTested": "Chlorine Gas Detector",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2001-01-17 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2001-01-17 00:00:00",
              "AuditCompletionDate": "2001-01-29 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-01-24 00:00:00",
              "HotWorkPermitReviewDate": "2001-01-24 00:00:00",
              "ContractorSafetyReviewDate": "2001-01-25 00:00:00",
              "ContractorSafetyEvalDate": "2001-01-25 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 26764,
                  "PreventionProgram3ID": 18281,
                  "ProcessChemicalID": 42837
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 22786,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-03-14 00:00:00",
    "ERTrainingDate": "2000-03-21 00:00:00",
    "CoordinatingAgencyName": "Portage County EMA",
    "CoordinatingAgencyPhone": "3302973607",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "Ohio OSHA Process Safety Management Standard 29 CFR 1910.119"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 22786,
      "SummaryText": ", working on the feed system, calibrating analyzers, or performing other routine tasks on the chlorination system.  This information is kept at the plant site in the operation and maintenance manual, as well as the emergency response plans, and now within this RMP.\n\nTraining is performed using several different methods.  Each operator, at the water plant, has been certified by the State of Ohio EPA in water treatment.  As part of this certification program, each receives extensive training on chlorine safety and general SOP's for gas chlorination feed systems.  In addition to this training, on-the-job training is provided by the PCWR supervisory personnel and senior operators specific to the equipment and processes used at the plant.  Training is done both when the employee is oriented after being hired, and each year before start-up of the system.\n\nC. Maintenance\nProper maintenance of the chlorine feed equipment is critical to the integrity of the system.  Each operator is trained and responsible for daily inspection of the equipment.  When problems are identified, written SOP's are in place and used to shut down the system and complete the necessary repairs. The equipment is inspected and rebuilt, replaced or repaired as needed.\n\nD. Compliance Audit\nAs mentioned above, the goal of the PCWR is to eliminate the use of gas chlorine within the next five to ten years.  Therefore, a subsequent compliance audit, for gaseous chlorine processes, will depend on the progress of this conversion.  However, a program will be designed to evaluate the liquid system, to maintain the reliability and integrity of the system performance.\n\nE. Incident Investigation\nThe PCWR has in place an accident/incident investigation policy and procedure.  Each incident is investigated and documented, on the standard County accident form provided to each employee.  All of the necessary information is included on this form: date of the incident; date of the investigation; description of the inciden"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 22786,
      "SummaryText": "t; contributing factors; recommended actions; personal or property injury/damage; and name and addresses of witnesses.\n\nEmergency Response Plan\nA written Emergency Response Plan (ERP) is available at each site operated by the PCWR that utilizes gaseous chlorine.  Each ERP contains the SOP's for responding to a chlorine release, as well as other types of accidents, spills, and natural disasters.\n\nFortunately, since the PCWR is a County organization, it is closely associated with the Local Emergency Planning Committee (LEPC), County Emergency Management Agency (EMA), and several local fire departments.  As a result, the LEPC and EMA are aware of, and have provided the County's Hazardous Materials Response Team (HAZMAT) with\nemergency response training at PCWR sites.\n\nAll PCWR operators have been trained in the SOP's for responding to a chlorine leak.  Cylinder repair kits are available at each facility in the event of a leak, as is all the proper personnel protective equipment needed, to enter the chlorine storage and feed rooms, to provide emergency evacuation of operating personnel.  PCWR personnel have the responsibility of evaluating the severity of a gas leak and either initiating repairs or evacuating the plant site and calling for assistance from the County HAZMAT team.\n\nEmergency phone numbers and chain of command phone lists are maintained at the plant and are posted next to the telephone.  In the event of a leak, that will affect areas outside of the plant property, the operator will call the emergency response phone number (911) and describe the existing conditions.  Subsequently, PCWR supervisory personnel will be called (if not already on site), as will the Portage County Emergency Management Agency (EMA) director.  Once the HAZMAT team is on-site, the local Fire Chief is given control of the site.  PCWR personnel will remain on-site to assist in coordination  of the leak repair and clean up efforts.\n\nIn the event more than ten pounds of chlorine is relea"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 22786,
      "SummaryText": "sed, and in addition to contacting the HAZMAT team, PCWR supervisory personnel will contact the LEPC and the Ohio EPA.\nThe LEPC will then contact the State Emergency Response Commission and the National Response Center.\n\nPublic Education and Communication\nThis RMP will be made available and part of the County's LEPC program.  In addition, the local police and fire departments will be given copies for their own use and information purposes.."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 22786,
      "SummaryText": "Portage County Water Resources\nRisk Management Plan - Executive Summary\nShalersville Water Treatment Facility\n\nIntroduction\nIn accordance with the U.S. Environmental Protection Agency (EPA) Risk Management Plan (RMP) regulations, the Portage County Water Resources Department (PCWR) has developed an RMP for this facility.  This RMP is designed to provide a plan to follow in the event of an accidental release of chlorine gas, which is used as a disinfectant for the treated water, to mitigate the impacts of a release, to both the public and local environment.\n\nThe Shalersville Water Treatment Plant (WTP) is a publicly owned and operated treatment works located in Shalersville Township, Ohio.  Chlorine disinfection is utilized as a step in the treatment process and is stored, on site, in one ton cylinders.  There are never more than two full containers on the site at one time. This RMP addresses the potential for an accidental release of the entire contents of gaseous chlorine from a full cylinder, as a worst case and, as the alternative scenario, a slower leak from a partially full container.\n\nHazard Assessment\nIn the twenty-five years the plant has been in operation, no releases of chlorine have been recorded.  However, in the event of a catastrophic failure of a full cylinder, the impacts to the public could be devastating.   This facility is located in a relatively rural and sparsely populated section of Portage County, however, the area affected could include one very vulnerable population of residents at the Hattie Larlham Foundation.  As a result, the potential impacts of a chlorine release when the wind is out of the east, would be the worst.  Within the approximately twenty one square mile Distance to Toxic Endpoints (DTEP) zone, as defined in the Worst Case Scenario, approximately twelve linear miles of the Ohio Turnpike, Red Fox and Bolingbrook housing developments, and the edge of Mantua Village.   Also within the worst case DTEP area is the Cuyahoga River."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 22786,
      "SummaryText": "In the Alternate Release Scenario, a nearly one square mile area could be involved.  However, no schools, residential housing, public recreation areas, or emergency response agencies would be affected.  \n\nThe chlorine cylinders and feed equipment are contained, on the plant site, within a brick building, in separate rooms, each having only one door to the outside.  At the present time, this is the only passive mitigation that is being employed.  There is no active mitigation equipment (such as scrubbers, sprinklers, automatic shut-off valves, etc.) employed, nor is there any planned.\n\nSince the use of gas chlorine has the potential to impact a large population and sensitive environmental receptors, the PCWR department is studing the possibility of eliminating the use of gaseous chlorine in the next plant expansion.  Replacement of the gaseous feed equipment would be with the installation of a liquid feed system for sodium hypochlorite (liquid chlorine) for disinfection. \n\nPrevention Program\nA. Program Management\nUnder this program, the Water Division Manager has primary responsibility for the RMP development and implementation, while the Water  Superintendent is the alternate program manger.\n\nB. Training\nSafety training, is of course, one the most important aspects of the program.  Unless the supervisors and operators understand and follow the standard operating procedures and safety regulations, the risks of accidental releases are great.  It is imperative, therefore, that the employees be sufficiently trained on the operation, maintenance, and safe handling of this material.  Each employee has been issued a safety manual and is required to attend training on chlorine safety, respirator use, and personal protective equipment use, as well as other pertinent safety and operations training programs.\n\nStandard operating procedures (SOP's) have been written using clear, concise language which enables the operator to understand the steps required when changing cylinders"
    }
  ]
}