{
  "FacilityID": 22826,
  "FacilityName": "Civic Center Properties",
  "FacilityStr1": "3840 N. Civic Center Drive",
  "FacilityStr2": null,
  "FacilityCity": "North Las Vegas",
  "FacilityState": "NV",
  "FacilityZipCode": "89030",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "32003",
  "LEPC": "Clark County LEPC",
  "FacilityLatDecDegs": "36.230778",
  "FacilityLongDecDegs": "-115.11225",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.icecoldstorage.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Martin Evanson",
  "OperatorStr1": "3840 N. Civic Center Drive",
  "OperatorStr2": null,
  "OperatorCity": "North Las Vegas",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89030",
  "OperatorZipCodeExt": null,
  "FTE": 60,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000174526",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-02-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-02-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-02-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-02-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 36.229209,
  "FRS_Long": -115.111821,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 32642,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 22826,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 42919,
          "ProcessID": 32642,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 33481,
          "ProcessID": 32642,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 18306,
              "Process_NAICS_ID": 33481,
              "SafetyReviewDate": "2000-11-03 00:00:00",
              "PHA_Date": "2002-02-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-08-24 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "revision of maintenance and emergency response procedures",
              "OpProceduresReviewDate": "2001-02-12 00:00:00",
              "TrainingReviewDate": "2000-09-11 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-01-04 00:00:00",
              "EquipmentInspectionDate": "2001-01-26 00:00:00",
              "EquipmentTested": "refrigeration system pressure tested",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2001-01-29 00:00:00",
              "PreStartupReviewDate": "2001-01-30 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-08-31 00:00:00",
              "HotWorkPermitReviewDate": "2000-09-11 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2000-08-31 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 26814,
                  "PreventionProgram3ID": 18306,
                  "ProcessChemicalID": 42919
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 22826,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "North Las Vegas Fire Department",
    "CoordinatingAgencyPhone": "7026331102",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 22826,
      "SummaryText": "t the Civic Center Properties facility located at 3840 N. Civic Center Drive in North Las Vegas, Nevada.  Many of the recommendations are complete and implemented as of the system startup date.  All recommendations are scheduled to be complete by September 1, 2001.\n\n*   Process Hazard Analysis\n\nR01    Install visual and audible alarms at the dock area and at both man doors to the engine room that are activated at the sensor alarm level (100 ppm).\n\nR02    Investigate and document which personnel will be alerted upon reaching the alarm level (100 ppm) ammonia concentration in the engine room.  Also document how they will be alerted.\n\nR03    Investigate the feasibility of having a qualified operator come on site to perform a manual restart in case of system shut down.\n\nR04    Establish a procedure to replace all relief valves in the system every five years or whenever one is used.\n\nR05    Ensure that the piping to the outside safety shower/eye wash station is insulated from the ambient temperature.\n\nR06    Investigate and document which gas masks and respirators will be purchased and used at the facility.  Ensure that all potential users are properly trained and fitted.\n\nR07    Ensure that all employees/tenants at the facility are aware of the presence of and the potential hazards associated with ammonia.\n\nR08    Install wind direction indicators (i.e. flags, wind socks) at the engine room and near the primary evacuation location.\n\nR09    Investigate the feasibility of installing a control box outside the engine room.\n\nR10    Establish a procedure for periodic manual testing of the high level shut down switches on both recirculator vessels.\n\nR11    Establish a procedure to follow manufacturer's recommendations regarding all ammonia equipment including compressors, condensers, and ammonia sensors.\n\nR12    Establish programs for condenser maintenance and condenser water treatment.\n\nR13    Ensure that operators alert somebody of expected return time when performing activi"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 22826,
      "SummaryText": "ties on the roof.\n\nR14    Ensure that operators have immediate access to an eye wash station when performing maintenance activities on the roof.  This could include a portable eye wash bottle.\n\n\n*   Pre-Startup Safety Walkthrough\n\nPSSW-01    All employees and tenants must have the following information: 1) how to report an ammonia release, 2) where to go when they are told to evacuate.\n\nPSSW-02    Include a periodic test and calibration of the ammonia detectors in the facility's maintenance program.\n\nPSSW-03    Coordinate emergency response procedures and policies with the building tenants (Farm Fresh), the local fire department (or other responders), and the refrigeration contractor on a periodic and ongoing basis.\n\nPSSW-04    Require a Civic Center Properties employee to perform and document a daily walkthrough of the engine room on a log sheet.\n\nPSSW-05    Ensure that all piping is labeled as to the contents and the flow direction.\n\nPSSW-06    Install ammonia safety placards on all doors to the ammonia engine room.\n\nPSSW-07    Ensure that (at least) annual evacuation drills are held (and documented) at the facility including all personnel on all shifts."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 22826,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Civic Center Properties facility has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document which is maintained at the facility.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nCivic Center Properties maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM, RMP, and Nevada's Chemical Accident Prevention Program (CAPP) regulations.\n\nCivic Center Properties has coordinated emergency response efforts with the local fire department and with the contracted refrigeration operation and maintenance firm.  In the case of an ammonia-related emergency, it is the policy of Civic Center Properties to evacuate all employees (including employees of warehouse tenants) and to allow the fire department/HazMat Team to respond to the emergency.  The refrigeration contractor will be available 24 hours per day for guidance and assistance.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nConstruction of the ammonia refrigeration system at Civic Center Properties was completed in February 2001.  The facility is new and operations are scheduled to commence once the refrigeration system is fully functional.  The facility provides cold storage warehouse space for distribution and for private tenants.  The facility is located at 3840 N. Civic Center Drive in North Las Vegas, Nev"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 22826,
      "SummaryText": "ada bordering the Interstate 15 freeway, south of Craig Road.  The immediate area is primarily light commercial and industrial. The ammonia system was constructed in accordance with all applicable federal, state, and local regulations including the Uniform Fire and Mechanical Codes.\n\nThe ammonia refrigeration system uses approximately 15,000 pounds of ammonia for warehouse cold storage and food processing.  The majority of the system is located in the machine room including vessels, compressors, and associated piping.  The condensers are mounted on the engine room roof, and all of the evaporators are located in their respective cold storage rooms/areas.\n\nThe refrigeration cycle begins with the transfer of high pressure liquid ammonia from the Thermosyphon Receiver (TS-1) to the High Pressure Receiver (HPR-1).  TS-1 is a reservoir used mainly as a liquid ammonia supply for cooling compressor oil.  HPR-1 serves as the main storage vessel for the system with the ability to store the entire Phase I inventory of 15,000 pounds of ammonia.  It supplies liquid ammonia to the High Temperature Recirculator (LR-1) which pumps the cold liquid to the dock and cooler evaporators (13). The liquid ammonia expands as it enters the various evaporator coils, reducing the temperature.  These evaporators are used to maintain low air temperatures for cooler rooms, the loading dock, packing, and curing areas. As the air is chilled by the evaporators, the ammonia is partially vaporized and returned to LR-1, which maintains a liquid/vapor mixture of ammonia at 33 psig.\n\nLR-1 also routes ammonia liquid to the Low Temperature Recirculator (LR-2), which maintains a further reduced pressure (and hence temperature) of 3.6 psig.  LR-2 supplies cold pumped liquid ammonia to the Blast Freezers, the -10°F Freezer, and the Dual Temperature Room and collects the resulting two-phased ammonia (suction).  As liquid ammonia collects in LR-2, it is drained into a transfer drum (LTD-1) (which is pressurized"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 22826,
      "SummaryText": "with hot gas) that pumps the liquid back to the Thermosyphon Supply pipeline.\n\nThe Low Stage Compressors (LS-1 and LS-2) and the High Stage Compressors (HS-1 and HS-2) pull this low pressure ammonia vapor from LR-2 and LR-1, respectively.  The compressors discharge high pressure vapor (150-160 psig) to the condensers via a single stage discharge header.  The condensers (EC-1 and EC-2) convert compressor discharge (hot gas) into high pressure liquid using a combination of fans and a water spray, and recycle it to the Thermosyphon Receiver.  Hot gas is also used for defrosting the evaporators on a timed cycle.\n\nThe system is also equipped with a dilution tank (DT-1) and an Emergency Control Box.  All of the relief valves are set to vent at 250 psig and discharge into a common header that vents into the bottom of the dilution tank, which is kept full of water.  In addition, the pressure in the system can be reduced manually by the valving located inside the Emergency Control Box located outside the Engine Room door. This control box allows the Fire Department to transfer ammonia from one vessel to another or vent the ammonia into the water dilution tank.\n\n\nHAZARD ASSESSMENT SUMMARY\n\n*  Worst Case Release Result Summary\n\n      Scenario Description:  Release of the maximum quantity of ammonia that can be stored in a vessel - 15,000 pounds in 10 minutes.  (The capacity of the High Pressure Receiver is approximately 30,000 pounds of ammonia, so the entire ammonia charge is released.) The most pessimistic meteorological conditions were used: 1.5 meters per second wind speed, and F stability.  Reference tables in the EPA-approved Risk Management Program Guidance for Ammonia Refrigeration were used to determine the maximum distance to the toxic endpoint of 200 ppm in urban conditions.  This release reaches off site and may impact population receptors.  No environmental receptors were affected by this potential release.\n\n*  Alternative Release Result Summary\n\n     Scenario De"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 22826,
      "SummaryText": "scription: A release of ammonia from resulting from a 1/4 inch diameter hole in a pipe.  The release rate of ammonia due to the pressure of the tank is 122 pounds per minute.  The meteorological conditions used were 3 meters per second wind speed, and D stability.  Reference tables in the Risk Management Program Guidance for Ammonia Refrigeration were used to determine the maximum distance to the toxic endpoint of 200 ppm in urban conditions.  This release reaches off site and may impact population receptors.  No environmental receptors were affected by this potential release.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe Civic Center Properties ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the Civic Center Properties facility operates in accordance with OSHA's Process Safety Management regulation, and Nevada's Chemical Accident Prevention Program (CAPP).  Refrigeration contractors, experts in the ammonia refrigeration industry, are contracted at the facility to maintain the system and perform any repairs.\n\nThe Civic Center Properties facility including the ammonia system was designed and constructed in accordance with the Uniform Mechanical Code which specifically outlines requirements for the safe operation of an ammonia refrigeration system.  These safety features include a water diffusion tank, ammonia sensors in the machine room as well as sensors in the cold storage areas, and automatic shut down systems that prevent equipment damage and ammonia releases.  In addition, the majority of the ammonia inventory is maintained inside the machine room and just outside of the machine room (condensers).  All pressure vessels are equipped with pressure relief valves that automatically engage in case of a high pressure situation and vent through a common header to a water diffusion tank.\n\nIn addi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 22826,
      "SummaryText": "tion to the Uniform Mechanical Code, the facility will operate in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines.  In particular, the IIAR Bulletin 110, Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems.\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nThis facility including the ammonia refrigeration system is new as of February 2001.  There have been no ammonia-related accidents at the facility.\n\n\nEMERGENCY RESPONSE PROGRAM\n\nCivic Center Properties has an emergency action plan in effect at the facility.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP document.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nCivic Center Properties maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM, RMP, and CAPP regulations.\n\nIn case of an ammonia release emergency, Civic Center Properties plans to evacuate all employees (and to alert all tenants) stationed in the cold storage warehouse and alert the local emergency responders (fire department).  The emergency response efforts will be coordinated with the managers of the warehouse tenants.  Civic Center Properties plans to coordinate emergency response efforts with the fire department on a periodic and ongoing basis.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazard Analysis and the Pre-Startup Safety Walkthrough provided mitigation measures to improve safety a"
    }
  ]
}