{
  "FacilityID": 22836,
  "FacilityName": "Cedar Creek Pump Station",
  "FacilityStr1": "6613 Ashby Lane",
  "FacilityStr2": null,
  "FacilityCity": "Trinidad",
  "FacilityState": "TX",
  "FacilityZipCode": "75163",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48213",
  "LEPC": null,
  "FacilityLatDecDegs": "32.243056",
  "FacilityLongDecDegs": "-96.143722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Tarrant Regional Water District",
  "OperatorStr1": "Route 1, Box 175",
  "OperatorStr2": null,
  "OperatorCity": "Trinidad",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75163",
  "OperatorZipCodeExt": null,
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000132545",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-07-01 00:00:00",
  "SafetyInspectionBy": "TWCA Risk Management Fund",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-02-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-02-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-02-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2022-03-01 00:00:00",
  "DeRegistrationEffectiveDate": "2022-02-25 00:00:00",
  "AnniversaryDate": "2006-02-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 32.243056,
  "FRS_Long": -96.143722,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 32660,
      "AltID": null,
      "FacilityID": 22836,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 42942,
          "ProcessID": 32660,
          "ChemicalID": 62,
          "Quantity": 40000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 33499,
          "ProcessID": 32660,
          "NAICSCode": "92411",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 12504,
              "Process_NAICS_ID": 33499,
              "SafetyReviewDate": "1999-05-27 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "Yes",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "NEMA, IEEE, NEC, Chlorine Institute Standards",
              "FR_Comments": null,
              "HazardReviewDate": "2000-11-20 00:00:00",
              "ChangeCompletionDate": "2001-05-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-09-28 00:00:00",
              "TrainingReviewDate": "1999-05-27 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "C-Kit Simulation",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "C-Kit Simulation",
              "MaintenanceReviewDate": "1999-03-01 00:00:00",
              "EquipmentInspectionDate": "1999-01-28 00:00:00",
              "EquipmentTested": "Storage Tank, Piping, Valves, Chlorinators, Instrumentation, Safety Appurtenances",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1998-07-16 00:00:00",
              "InvestigationChangeDate": "1998-08-14 00:00:00",
              "MostRecentChangeDate": "1999-01-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 13114,
                  "PreventionProgram2ID": 12504,
                  "ProcessChemicalID": 42942
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 22836,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-27 00:00:00",
    "ERTrainingDate": "1999-04-14 00:00:00",
    "CoordinatingAgencyName": "Henderson County LEMP",
    "CoordinatingAgencyPhone": "9036756157",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 22836,
      "SummaryText": "Cedar Creek Pump Station\nRisk Management Plan\nExecutive Summary\n\nApproach\nThe safety and health of the Tarrant Regional Water District's (TRWD) employees and facilities, and of the general public is fundamental to the District's operations.  This objective can be achieved by employing safe and healthy work practices and attitudes in and to every job, activity and function performed.  Safety and health objectives will not be compromised or subordinated in achieving overall District goals.\nThe District is committed to the safe and healthy design, construction, and operation of its chemical systems with emphasis on the prevention of releases, accidents, or injuries to personnel, the public, or the environment.  This commitment, within the District's control, is supported by the following principles:\n· accidents, injuries and occupational illnesses are preventable,\n· each manager, supervisor, and employee is responsible for administering and applying the safety and health program and will be evaluated accordingly,\n· every employee has a personal responsibility for job safety and health and for the safety and health of others both on and off the job,\n· safe conduct of operations is a condition of employment,\n· safety and health performance reviews must be a continuing process,\n· training is an essential element for a safe and healthy work environment,\n· injuries, unsafe conditions, and incidents with injury and/or damage potential must be investigated, and\n· prevention of accidents, injuries, and occupational illnesses is good business.\nFacility\nThe TRWD has constructed and operates four surface water reservoirs and is one of the largest providers of raw surface water in Texas. One of their reservoirs, Cedar Creek, is located in TRWD's eastern division. Constructed in the 1960s, Cedar Creek Reservoir has a permitted total annual diversion of 175,000 acre feet. From Cedar Creek Reservoir, water must be pumped approximately 80 miles to reach customers. Water pumped from Ce"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 22836,
      "SummaryText": "dar Creek Reservoir discharges to the Kennedale Balancing Reservoirs and is then gravity-fed to the City of Arlington's Pierce-Burch Water Treatment Plant via Lake Arlington and the City of Fort Worth's Rolling Hills Water Treatment Plant.\nThe lake pump station is situated on the western shore of Cedar Creek Reservoir at a deep water intake and provides the pumping capacity to deliver raw water from the reservoir to The Kennedale Balancing Reservoir. The station includes six vertical turbine pumps, each with an individual capacity of approximately 35 million gallons per day (mgd). The pump station's maximum capacity is approximately 147 mgd with all six pumps in service. Under normal, or low capacity, operating conditions in 1997, the station's production averaged about 65 mgd with two pumps running.\nDuring the warmer months, increased water temperatures promote biological growth, creating a film on the inside walls of the transmission pipeline (biofilm). Uncontrolled biofilm growth can substantially reduce capacity within the pipeline due to a decrease in pipe radius and an increase in frictional resistance, thus increasing the pumping cost. To control biofilm growth, aqueous chlorine in conjunction with ammonia is used to form chloramines. Chloramines are a stable disinfectant that inhibit biofilm growth and provide a persistent residual for transmission system protection.\nCurrently, the Cedar Creek Pump Station stores its chlorine in a single, fixed 20-ton (40,000-pound) chlorine storage tank. The quantity of chlorine stored onsite exceeds the United States Environmental Protection Agency's (USEPA) threshold of 2,500 pounds, thus subjecting Cedar Creek to USEPA's Risk Management Program (RMP) Rule. The RMP primarily consists of the following three elements: Offsite Hazard Assessment, Accident Prevention Program, and an Emergency Response Program.\nOffsite Hazard Assessment\nAn offsite hazard assessment was conducted for the Cedar Creek facility to determine the dis"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 22836,
      "SummaryText": "tance a toxic concentration of chlorine gas would travel in the event of a release. The toxic endpoint concentration for chlorine is three parts per million (ppm). The population within the radius of the release and sensitive receptors such as hospitals, schools, and state parks were identified. Two release scenarios-the Worst Case and an Alternative Case were considered. The Hazard Assessment also includes a five-year accident history of the Cedar Creek Pump Station.\nWorst Case Scenario\nThe worst case scenario assumes the entire contents of the largest single container are released, regardless of how improbable that may be, over a period of ten minutes. Therefore, Cedar Creek must model offsite impacts of a 40,000-pound chlorine release over a duration of 10 minutes. The resulting release rate is 4,000 pounds per minute. The worst case scenario also requires conservative meteorological conditions. A relatively slow wind speed of 1.5 meters per second and a stability class F must be assumed.  Stability classes are categorized by the amount of turbulence in the atmosphere.  Class F is the lowest turbulence classification.  With low wind speed and atmospheric turbulence, the chlorine plume will dilute slowly, causing an increased distance to the toxic endpoint. \nFurthermore, only passive mitigation methods such as buildings or dikes can be considered. Passive mitigation, as defined, requires no mechanical, electrical, or human input. The 20-ton chlorine tank, associated process piping, and chlorine feed equipment are stored in a building at Cedar Creek. The USEPA allows a mitigation factor of 0.55 to be applied to releases of chemicals stored in buildings. This mitigation factor assumes the building housing the chlorine will suppress the release rate by 55 percent. The resulting release rate taking into account building mitigation is 2,200 pounds per minute. \nBecause chlorine is heavier than air, air dispersion modeling of the worst case scenario was performed u"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 22836,
      "SummaryText": "sing the USEPA approved Dense Gas Release Model Breeze HazTM DEGADIS+3.0. The DEGADIS+ model allows a more accurate representation of offsite impacts because it uses site-specific meteorological parameters as opposed to USEPA's Offsite Consequence Guidance look-up tables. \nFor the worst case scenario, the DEGADIS+ model predicted a distance required for the plume of chlorine gas to dilute to 3 ppm of 2.6 miles. Within a 2.6-mile radius an estimated population of 1,400 people would be exposed to chlorine concentrations greater than 3 ppm. \nAlternative Release Scenario\nThe alternative release scenario reflects a type of release that is more likely to occur compared to the worst case scenario. Unlike the worst case scenario, the alternative release scenario may consider active mitigation such as automatic shutoff valves and scrubbers. Active mitigation is defined as requiring mechanical, electrical or human input. Furthermore, the alternative release scenario assumes more realistic regional and seasonal meteorology as compared to the worst case scenario.  Average temperature, wind speed, and a lower stability class (class D) were used. \nThe alternative release scenario modeled for Cedar Creek Pump Station involves a pipe failure between the chlorine storage tank and vacuum regulator. An excess flow valve in the tank that seats when the release rate reaches 7,000 pounds per hour suppresses the leak.  For active mitigation, a newly installed caustic scrubber was considered in addition to the excess flow valve mentioned above.\nDEGADIS+ was used to model the alternative release scenario for the same reasons as the worst case scenario. The pipe failure results in a 0.03-mile migration of chlorine gas until it reaches a toxic endpoint of 3 ppm. Within a 0.03-mile radius, no persons off-site would be impacted.\nFive-year Accident History\nUnder the RMP Rule, a five-year accident release history must be reported for regulated substances exceeding the threshold quantity. The"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 22836,
      "SummaryText": "release must have caused at least one of the following: on-site or off-site death(s), injuries or significant property damage, off-site environmental damage, evacuations, or sheltering in place. There were no reportable accidents at Cedar Creek Pump Station in the last five years.\nPrevention Program\nThe Prevention Program is comprised of Safety Information, Hazard Review, Operating Procedures, Training, Maintenance, Incident Investigation, and Compliance Audit procedures. The procedures are designed to prevent an accidental release from occurring. Presently, Cedar Creek Pump Station is in compliance with most of the procedures listed below since the facility is also regulated under OSHA Process Safety Management (PSM) rules.\nSafety Information\nInformation regarding process chemicals, process technology, and process equipment is compiled and included in the Prevention Program as a resource to emergency response planners and to develop training programs and operating procedures. Within the Safety Information section, one can find comprehensive chemical data including action thresholds, health hazards, chemical exposure limitations, and physical properties. Also, details such as maximum intended inventory and safe upper and lower operating limits can be found.\nHazard Review\nThe hazard review (HR) provides information that will assist Cedar Creek staff in making decisions for improving safety and reducing the consequences of hazardous accidental releases. An HR is a systematic effort to evaluate potential causes and consequences of accidental releases. The HR focuses on equipment, instrumentation, utilities, human actions, and external factors that might affect the process. \nOperating Procedures\nA copy of the Cedar Creek operating procedures is included in the RMP. These procedures are designed to ensure continuous, efficient, and safe operation of the facility. The operating procedures are also used to train new employees and to provide refresher training for existing"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 22836,
      "SummaryText": "staff.\nTraining\nThe USEPA requires that a training program be included as part of the RMP. An effective training program can significantly reduce the number and severity of accidental release incidents. The Cedar Creek RMP includes guidelines for conducting regular and structured plant training. Training record forms are included with the program for documentation purposes. Elements of the program include training in safety information, operating procedures, maintenance, and emergency response procedures.\nMaintenance\nMaintenance ensures equipment used to process, store, or handle chlorine is functioning properly and installed to minimize the risk of releases. An effective maintenance program is one of the primary lines of defense against a release and addresses equipment testing and inspection, preventive maintenance schedules, and personnel training. When implemented, a regular maintenance program ensures that process equipment performs properly and that documentation exists to support reliable, safe, operation and maintenance of the process.\nIncident Investigation\nAn incident investigation program has been developed which outlines the investigation team, investigation process, and implementation of changes. Ultimately, it is desired that the plant staff learn from incidents and take action to prevent similar incidents in the future. Necessary forms for documentation are included and must be maintained for a minimum of five years after each incident. \nCompliance Audit\nProcedures were developed to complete a compliance audit for the Cedar Creek Pump Station. A compliance audit is a self-evaluation of the effectiveness of the RMP program that identifies deficiencies, assures corrective action, and increases safety awareness among plant staff. The compliance audit methodology for the Cedar Creek facility was modeled after OSHA'S guidelines for conducting regulatory Process Safety Management compliance audits. These guidelines have been modified to include the Hazard A"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 22836,
      "SummaryText": "ssessment and Emergency Response requirements of the RMP rule. To ensure compliance with the program, the RMP includes a check list that the Cedar Creek staff must complete at least once every three years.\nEmergency Response Program\nThe Emergency Response Program develops a plan for dealing with a release. The USEPA RMP regulation 40 CFR 68 Subpart E require that an Accidental Release Emergency Response Plan be prepared. The plan must be prepared in accordance with the provisions of an overlapping OSHA regulation-Employee Emergency Plans (29 CFR 1910.38(a)). In addition, provisions of the OSHA hazardous waste and emergency response standard, 29 CFR 1910.120 (q), must also be considered. The Emergency Planning and Response Plan described in this section complies with the requirements of 40 CFR 68.95, 29 CFR 1910.38(a), and 29 CFR 1910.120(q). \nThe Emergency Response Program consists of HAZMAT response policy and procedures developed by TRWD. The program is part of a larger Emergency Action Plan, also developed by TRWD, which provides a framework for the District to plan and respond appropriately during a disaster or any other emergency. The Emergency Response Program provides specific emergency response procedures for accidental releases of hazardous materials. The emergency response procedures cover a release from the initial alarm stage through HAZMAT assistance. As part of the emergency response procedures there are plans for victim rescue, leak investigation, communication with additional support agencies, and procedures for informing the public in the event of a release. \nPlanned Changes to Improve Safety\nSince the initial hazard review most recommended changes have been implemented. Most significanlty, the process has a new caustic scrubbing system capable of neutralizing the entire 20-ton chlorine tank. An improvement still required is capping off or installing valves on drain lines leading from the chlorine facility to the lake. This improvement will be imp"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 22836,
      "SummaryText": "lemented within approximately 6-months."
    }
  ]
}