{
  "FacilityID": 22913,
  "FacilityName": "PMD Group, Inc.- Henry Plant",
  "FacilityStr1": "1550 County Road, 1450 North",
  "FacilityStr2": null,
  "FacilityCity": "HENRY",
  "FacilityState": "IL",
  "FacilityZipCode": "61537",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17123",
  "LEPC": "Marshall County LEPC",
  "FacilityLatDecDegs": "41.134417",
  "FacilityLongDecDegs": "-89.340556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G3",
  "LatLongDescription": "AB",
  "FacilityURL": "http://www.cs.bfg.com/BFGHOME.HTM",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 47024468,
  "ParentCompanyName": "PMD Group, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 4467452,
  "Company2DUNS": 0,
  "OperatorName": "JEFF CAMPBELL",
  "OperatorStr1": "1550 County Road, 1450 North",
  "OperatorStr2": null,
  "OperatorCity": "HENRY",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "61537",
  "OperatorZipCodeExt": null,
  "FTE": 100,
  "OtherEPAFacilityID": "61537BFGDRRR1BO",
  "EPAFacilityID": "100000152372",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "123803AAD",
  "SafetyInspectionDate": "1999-03-30 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-03-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-03-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-03-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-03-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 41.13442,
  "FRS_Long": -89.34056,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 32748,
      "AltID": "Tank Farm Storage",
      "FacilityID": 22913,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 43036,
          "ProcessID": 32748,
          "ChemicalID": 62,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 43037,
          "ProcessID": 32748,
          "ChemicalID": 59,
          "Quantity": 76000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 43038,
          "ProcessID": 32748,
          "ChemicalID": 8,
          "Quantity": 252202.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 43039,
          "ProcessID": 32748,
          "ChemicalID": 131,
          "Quantity": 88000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 33588,
          "ProcessID": 32748,
          "NAICSCode": "32519",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 18395,
              "Process_NAICS_ID": 33588,
              "SafetyReviewDate": "1997-09-16 00:00:00",
              "PHA_Date": "1997-09-16 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-03-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 1,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Water covering inside enclosure tank.",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-30 00:00:00",
              "TrainingReviewDate": "1999-06-08 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-28 00:00:00",
              "EquipmentInspectionDate": "1999-06-07 00:00:00",
              "EquipmentTested": "hoses, gaskets, valves every railcar, alarms every Monday morning",
              "ChangeMgmtDate": "1999-06-15 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-15 00:00:00",
              "PreStartupReviewDate": "1999-06-15 00:00:00",
              "ComplianceAuditDate": "1998-08-06 00:00:00",
              "AuditCompletionDate": "1999-06-01 00:00:00",
              "IncidentInvestigationDate": "1998-08-12 00:00:00",
              "InvestigationChangeDate": "1999-02-01 00:00:00",
              "ParticipationPlansReviewDate": "1999-01-07 00:00:00",
              "HotWorkPermitReviewDate": "1998-12-03 00:00:00",
              "ContractorSafetyReviewDate": "1999-01-07 00:00:00",
              "ContractorSafetyEvalDate": "1998-11-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Tank Farm Prevention Program,  For Section 7.f., only the PCl3 tank has a scrubber and the CS2 tank is contained inside another tank with a water blanket.  For 7.g, perimeter monitors apply only to the chlorine and isobutylene tanks.",
              "_chemicals": [
                {
                  "PrimaryKey": 26916,
                  "PreventionProgram3ID": 18395,
                  "ProcessChemicalID": 43036
                },
                {
                  "PrimaryKey": 26917,
                  "PreventionProgram3ID": 18395,
                  "ProcessChemicalID": 43037
                },
                {
                  "PrimaryKey": 26918,
                  "PreventionProgram3ID": 18395,
                  "ProcessChemicalID": 43038
                },
                {
                  "PrimaryKey": 26919,
                  "PreventionProgram3ID": 18395,
                  "ProcessChemicalID": 43039
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 22913,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-01-19 00:00:00",
    "ERTrainingDate": "1999-06-15 00:00:00",
    "CoordinatingAgencyName": "Henry Fire Department",
    "CoordinatingAgencyPhone": "3093643520",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 22913,
      "SummaryText": "\n\n\nHENRY PLANT\n\nRISK\n\nMANAGEMENT\n\nPLAN\n\n(CFR 40 Part 68)\n            \n\n\n\n\n\n\n\n\n\n\n                                PMD Group, Inc.\n                                Henry, Illinois\n                                June 16, 1999\n                                \n RMP Executive Summary:  PMD Group Inc. - Henry Plant\n\nI. Health, Safety and Environmental Policies: The Henry Plant is governed by a commitment to excellence as it pertains to Health, Safety, and Environmental performance.  This is exemplified by the following excerpts from the PMD Group's Health, Safety & Environmental Policies: \n\n\"PMD Group Inc. conducts its worldwide operations and business activities in a manner that protects our employees, our communities and the environment.  PMD Group Inc. is committed to compliance with the requirements of all applicable laws and regulations, the implementation of the CMA principles of Responsible Care ? and to the continuous improvement of its health, safety, and environmental performance.  All employees of PMD Group, Inc. are aware of this policy and are responsible for carrying out its principles.\"    \n        \nI.    Stationary Source and Regulated Substances Handled: The Henry Plant is located approximately two miles northeast of the City of Henry, Illinois.  It is located on a 250-acre tract adjacent to The Poly One Company and the City Of Henry Waste Treatment Facility.  The plant manufactures industrial organic chemicals used primarily to support the manufacturing of tires and synthetic plastics and the stabilization of products such as jet fuels.  The plant employs approximately 100 employees with a payroll of $8 million annually.  Annual taxes paid by the plant typically exceed $500,000.  Local annual purchases have been estimated to be in excess of $3 million annually and plant utilities exceed $2 million annually.  \n\nAt this location the toxic chemicals subject to the threshold quantity of the RMP regulation include:  (1) Phosphorus Tri-chloride, (2) Carbon Disulfide, and Chlorine.  The flammable chemical subject to the threshold quantity of the RMP regulation is Isobutylene. A"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 22913,
      "SummaryText": "s reflected in the above HSE Company policy, the company has ongoing procedures and activities that address the overall RMP regulation to prevent serious accidents and to plan emergency contingencies.  In addition the relationship of good safety and environmental activities and performance are reflected in the number of HSE awards received by the Henry Plant.  Nevertheless, we welcome the EPA's RMP initiative and see it as an opportunity to continue and expand these activities and to insure our good performance.\n\nII. The Accidental Release Prevention Program and Emergency Response Policies at the Stationary source\nThe Henry Plant's policy has been to meet or exceed requirements established by applicable safety, health and environmental regulations promulgated by Federal and State agencies.  Our safety policies and practices have historically preceded the regulation of such practices under, for example, the OSHA Process Safety Management Standard and the EPA Risk Management Program Rule.  Our policy is to strive for zero OSHA Recordable injuries, Lost Time Injuries, Serious Operational Incidents and Releases to the Environment.  These measurements are tracked on a continuous basis.  The plant also works with on site employees, contractors, suppliers, local emergency responders and the general public to maintain contingency plans and systems to minimize or mitigate an accidental chemical release.\n\nIn addition to the above programs, the plant has participated in a company wide initiative to ensure that Y2K issues associated with our processes, suppliers and critical equipment will not have a negative impact on our current systems.\n\nAnother safety-related program in which we participate is Responsible Care? under the Chemical Manufacturer's Association, and we are certified under the ISO-9000 international quality standard.\n\nIII. The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\nThe plant has an ongoing program of process safety ma"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 22913,
      "SummaryText": "nagement (PSM). This program calls for implementation and maintenance of procedural and engineered safeguards to minimize the occurrence of a significant release of a hazardous chemical, and to eliminate or reduce the effects of such releases.  Substantial effort and capital have been invested to maintain and improve these programs.  Most recent installations include:\n? Installation of a New Carbon Disulfide Storage Tank Facility incorporating a special secondary containment system (Cost: $400,000)\n? Special Emergency Cut-off Valves on our Chlorine railcar angle valves that can be closed remotely in the event of a hose breakage (Cost: $30,000)\n\nOther day to day activities include the following:\n(1) Process Hazard Analyses:   All Process Safety Management Processes (119) have been evaluated at least one time and most two times for process hazards using either the HAZOP or WHAT-IF protocol.  PCSA-57 Process Hazard Analyses is an established procedure outlining the overall plant program.\n\n(2) Process Design:  All process equipment and systems are designed for safety in accordance with applicable Industry Standards and Best Engineering Practices.  Designs include, where applicable, automatic emergency shutdown systems, pressure relief devices, ventilation systems, release monitoring systems, and appropriate electrical classifications. Many processes are computer-controlled with operator backup including internal limits and checks for abnormal conditions, emergency shutdowns and alarms.  All storage vessels containing hazardous/flammable chemicals are contained in concrete dikes or protected with similar secondary methods of containment. These systems are maintained through special procedures identified in PCSA-53 Mechanical Integrity.\n\n(3) Training:  Plant operating personnel are thoroughly trained on their specific job tasks,  procedures, and processes  initially and continuously.   Also, contractors working in the plant are initially and annually evaluated for safety "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 22913,
      "SummaryText": "performance and receive annual Safety and Hazard Communications Training.  PCADM-02 and PCSA-02 are established procedures defining the overall plant program.  All procedures in the plant are specifically controlled and maintained to insure accuracy and proper authorization.  PCADM-01 and PCADM-03 are established procedures defining this program.\n\n(4) Maintenance:  The plant has a corrective maintenance, a preventive maintenance, and a predictive maintenance program along with a maintenance training program to insure that process system integrity is maintained.  This program is identified in PCSA-49 Mechanical Integrity procedure.\n\n(5) Management of Change: A management of change program has been established for the plant incorporating procedural changes, equipment changes, personnel changes or chemical changes.  Changes to Safety Critical Equipment can not be performed without proper authorization and review.  This program is identified in PCSA-54 Management of Change procedure.    \n    \nIV.    The Five Year Accident History\nThe plant has not had any events at the  Henry plant that would qualify for inclusion in the RMP 5-year accident history.\n\nV. The Emergency Response Program\nThe plant has a series of procedures dealing with emergency response within the facility.  Additionally, it has an Integrated Emergency Plan (PCSA- 62) that incorporates all of the individual procedures.  The plant maintains an active Fire Brigade of 30+ individuals who are trained for fighting interior structural fires, confined space rescue and spill activities.  Periodic training is provided for this brigade throughout the year including quarterly training exercises, in depth fire training at either Texas A&M Fire School or Joliet Mobil Fire School and annual community drills.  This program is identified in PCSA-53.\n\nVI. Planned Changes to Improve Safety\nThe plant safety program is ongoing through periodic auditing functions conducted by Plant, Segment and Corporate Auditing protocols (See PCSA-5"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 22913,
      "SummaryText": "7).  Through these mechanisms, improvements are identified and implemented.  Additionally, the plant works closely with the community to provide equipment and training for emergency organizations.  The plant is currently helping the City of Henry to identify and install a more effective emergency notification system.  Funding by the company is part of this activity.\n   \n\nVII. The Worst-Case Release Scenario and Alternative Release Scenarios:\nThe worst-case and alternative release scenarios, including a discussion of administrative and engineering measures used to minimize the affects of the release are described below.   One toxic worst case scenario (Chlorine) is provided for the Plant, i.e. the scenario with the farthest endpoint.  One alternative release scenario (more likely scenario) is provided for each toxic chemical (Chlorine, Phosphorus Tri-chloride and Carbon Disulfide).  One flammable worst case scenario (Isobutylene) is provided in addition to one alternative scenario for the same flammable is provided. \n\nA. Toxic Worst Case Scenario: The worst-case scenario for the Plant involves the complete failure of a 90 ton chlorine car which is used to deliver and store chlorine on site.  The distance to the release endpoint would impact beyond our fence line, reaching our industrial neighbors and having the potential of reaching many public receptors.\n\nB. Flammable Worst Case Scenario: The worst-case scenario for the plant involves the complete failure of the isobutylene storage tank containing 88,000 pounds of isobutylene.  The distance to the release endpoint would impact beyond our fence line and potentially reach our immediate industrial neighbors, however, it would not reach any residences.\n\n        \nC. Alternative Release Scenarios(ARS):  ARS's for the Henry Plant include the following.  These releases although unlikely are considered to be more probable than the WCS's listed above.\n\n1. Chlorine (Cl2): A connection hose between the rail car and the process del"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 22913,
      "SummaryText": "ivery lines ruptures while chlorine is in use.  The leak is just under the flow rate required to lift the excess flow valve that all chlorine cars possess.  The leak occurs for a 3 minute period at a 200 #/minute discharge rate.  The leak would be terminated by the automatic closing of emergency actuated valves that are installed on top of the railcars for this type of specific event.  Safeguards:   Safeguards include the excess flow valve on the railcar that actuates whenever the chlorine flow exceeds 250 lbs/minute; Chlorine monitors located around the railcar to notify process personnel in the event of a chlorine leak; TV monitoring system that provides 24 hour surveillance of the car; a trained Hazwoper team that can mitigate the leak using Level A PPE and emergency actuated valves located on top of the chlorine car that automatically close within 6 seconds when a certain chlorine concentration is detected.   Impact Area: The release is calculated to extend beyond our fence line, but would not affect any residential areas.\n\n2. Isobutylene (IB): A connection between the IB truck and the tank farm delivery line leaks when IB is being unloaded.  The leak is just below the actuation flow rate of the excess flow valve located on the truck.  The leak occurs for a five minute period at a 500  lbs/minute rate.  The vapor cloud is ignited as a result of the leak.  The leak is terminated by closing remote actuated valves on the truck unloading line.        Safeguards: The following safeguards are employed: an excess flow valve on the truck which will actuate if flow exceeds  500 lbs/minute; check valve on liquid unloading line preventing liquid from back flowing; remote emergency shutoffs of unloading line; TV monitoring system that provides surveillance of the truck while unloading, a tank farm operator that is assigned to the immediate area of the tank farm during the unloading activity; grounding system to reduce generation of static electricity; and an onsite Fire bri"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 22913,
      "SummaryText": "gade trained for interior structural fires as well as spill events.  Impact Area: The release is calculated to extend beyond our fence line, but would not affect any residential area.                            \n  \n3. Phosphorus Tri-Chloride (PCl3): The PCL3 unloading hose develops a leak while unloading PCL3 to the storage tank.  Approximately, 25 gallons discharge to the pad area.  The pad area drains to the PCl3 dike area.  Safeguards:  Safeguards include periodic change out of the transfer hose; two automatic shutoffs on the truck; unloading is always attended by tank farm operator and truck driver; procedure for unloading; suction is used to unload the truck; pump will automatically stop if no flow; check valves located in unloading line to prevent back flow and trained Hazwoper team along with foam application system for reducing vapor emissions.  Impact Area: The release is calculated to extend beyond the property line but would not affect any residential area. \n\n4. Carbon Disulfide (CS2): The process line from the pump leaks beyond the immediate area of the storage tank while MBT-C process is activating the pump.  The release would not be contained and the leakage would be in the pipe rack located between the tank farm and the process building.  The rate of the leak is estimated at 25 gallons/minute for a period of  15 minutes.  Safeguards: Safeguards include an operator in attendance when pumping carbon disulfide; monitoring of Tank Farm pipe racks twice a day for SPCC check; a trained Hazwoper team; and process procedure established to stop pumping at a specified time and investigate cause of excessive fill time and lined, slightly diked pipe racks.  Impact Area: The release is calculated to extend beyond the property line but would not affect any residential or industrial areas.\n\nData entry point 1.2 for facility ID will not accept the BF Goodrich TRI Facility ID Number.  The BF Goodrich facility ID number is therefore entered into data entry point 1.3 as"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 22913,
      "SummaryText": " per the BF Goodrich TRI Report."
    }
  ]
}