{
  "FacilityID": 22992,
  "FacilityName": "Whiteford Foods",
  "FacilityStr1": "770 North Center Street",
  "FacilityStr2": null,
  "FacilityCity": "Versailles",
  "FacilityState": "OH",
  "FacilityZipCode": "45380",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39037",
  "LEPC": "Darke County LEPC",
  "FacilityLatDecDegs": "40.23",
  "FacilityLongDecDegs": "84.485",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "A4",
  "LatLongDescription": "AV",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "N/A",
  "Company2Name": "N/A",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Albert D. Greenaway",
  "OperatorStr1": "770 North Center Street",
  "OperatorStr2": null,
  "OperatorCity": "Versailles",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45380",
  "OperatorZipCodeExt": null,
  "FTE": 152,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000018349",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-05-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-03-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-03-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-03-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2013-02-21 00:00:00",
  "DeRegistrationEffectiveDate": "2013-02-06 00:00:00",
  "AnniversaryDate": "2004-05-27 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 40.229686,
  "FRS_Long": -84.484134,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 32873,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 22992,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 43195,
          "ProcessID": 32873,
          "ChemicalID": 56,
          "Quantity": 17500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 33713,
          "ProcessID": 32873,
          "NAICSCode": "311612",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 18484,
              "Process_NAICS_ID": 33713,
              "SafetyReviewDate": "2001-03-13 00:00:00",
              "PHA_Date": "1998-06-25 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2001-01-24 00:00:00",
              "TrainingReviewDate": "2000-12-20 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Hands on Drill",
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-11-20 00:00:00",
              "EquipmentInspectionDate": "1998-11-15 00:00:00",
              "EquipmentTested": "All refrigeration equipment due to be done 04-01-01",
              "ChangeMgmtDate": "2000-11-20 00:00:00",
              "ChangeMgmtReviewDate": "2000-11-20 00:00:00",
              "PreStartupReviewDate": "1999-04-12 00:00:00",
              "ComplianceAuditDate": "2001-01-24 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-01-02 00:00:00",
              "HotWorkPermitReviewDate": "1997-07-18 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 27038,
                  "PreventionProgram3ID": 18484,
                  "ProcessChemicalID": 43195
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 22992,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2001-01-08 00:00:00",
    "ERTrainingDate": "2001-01-08 00:00:00",
    "CoordinatingAgencyName": "Darke County LEPC",
    "CoordinatingAgencyPhone": "9375481444",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 9,
      "FacilityID": 22992,
      "SummaryText": "A liquid ammonia and oil combination, gravity drains from the -150F Medium Temperature Accumulator (MTA-3) into the oil pot (OP-3).  In the oil pot (OP-3) the ammonia boils and the ammonia vapor travels back up the equalization line and enters above the liquid level in a -150F Medium Temperature Accumulator (MTA-3).  The oil remains in the oil pot (OP-1) and gradually accumulates. The oil is then removed via drain valve.  \r\n\r\n-150F Low Temperature Recirculated Liquid from the discharge of the refrigerant pumps (LP-1 & LP-2) is pumped through a filter assembly (FA-3).  At the filter assembly (FA-3) contaminants are removed.  The -150F Temperature Recirculated Liquid (LTRL) from the -150F Medium Temperature Accumulator (MTA-3) is circulated to several evaporators: -00F freezer (UC-3 & UC-3A), -200F freezer (UC-4), and blast freezer (UC-12, UC-13, & UC-14).  \r\n\r\nThe evaporators (UC-3, UC-3A, UC-4, UC-12, UC-13, & UC-14) are all arranged for recirculated liquid feed with hot gas defrost.  The -150F Low Temperature Recirculated Liquid (LTRL) flows through the coils where it absorbs heat from the air and changes from a liquid (LTRL) to a liquid/vapor combination (LTRS).  The liquid/vapor combination (LTRS) from these units is returned to the -150F Medium Temperature Accumulator (MTA-3), where the liquid is separated from the vapor.  The hot gas defrost loop on these evaporators involves heating the coil with hot ammonia vapor (HSD) to allow frost/ice to be removed from the coil.  Defrost condensate is returned to the High Temperature Recirculated Suction Main (HTRS) where it is returned to the +200F High Temperature Accumulator (HTA-1).  As the low temperature recirculated suction (LTRS) is returned to the Medium Temperature Accumulator (MTA-3), the liquid is separated from the vapor.  The liquid is recirculated through the liquid pumps (LP-1 & LP-2).  The vapor (LSS) is drawn off the top of the vessel to the inlet of the        -150F Low Stage Compressor (LSC-3), or +20"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 22992,
      "SummaryText": "(F High Stage Compressor (HSC-1) when it is operating as -15 (F swing duty.\r\n\r\nThe -150F Dry Suction (LSS) from the Medium Temperature Accumulator (MTA-3) is compressed in the -150F Low Stage Compressor (LSC-3).  The compressed vapor from the -150F Low Stage Compressor (LSC-3) is discharged into the common low stage discharge main, where it is returned to the inlet of the High Temperature Accumulator (HTA-1).  \r\n\r\nWhen High Stage Compressor (HSC-1) is operating as -15 (F swing duty, the -15 (F dry suction (LSS) is drawn from medium temperature accumulator (MTA-3) and is compressed in the high stage compressor (HSC-1).  The compressed vapor from the High Stage Compressor (HSC-1) is discharged into the common High Stage discharge main to the evaporative condenser (EC-1) & (EC-2).  When High Stage Compressor (HSC-1) is operating on pumpdown for the -60 (F low temperature accumulator, dry suction (LSS) is drawn from low temperature accumulator (LTA-2) and is compressed in the high stage compressor (HSC-1).  The compressed vapor from the High Stage Compressor (HSC-1) is discharged into the common High Stage discharge main to the evaporative condenser (EC-1) & (EC-2).\r\n\r\n\r\n+200F High Pressure Liquid from the +200F High Temperature Accumulator (HTA-1) or -150F High Pressure Liquid from the -150F Medium Temperature Accumulator (MTA-3) is used for liquid makeup to the -600F Low Temperature Accumulator (LTA-2).  Liquid from the -600F Low Temperature Accumulator (LTA-2) is provided by ammonia pumps (LP-3 & LP-4).  The -600F Low Temperature Recirculated Liquid (LTRL) from the refrigerant pumps (LP-3 & LP-4) is pumped to the -600F Tunnels (Evaporators UC-20 through UC-35).  \r\n\r\nAt the Freezing Tunnels, (Evaporators UC-20 through UC-35), the low temperature recirculated liquid is fed through an expansion valve to each individual evaporator.  At each Freezing Tunnel Evaporator,   -600F Low Temperature Liquid (LTRL) is fed through the coils where it absorbs heat changing from a liq"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 22992,
      "SummaryText": "eturned to the High Temperature Accumulator (HTA-1).  The heat transfer fluid cooled in  heat exchanger 2 (HX-2) is used to cool the microwave circuit of the Process Meat Tempering Tunnel.  \r\n\r\nDefrost condensate from the 00F freezer evaporators (UC-3 and UC-3A) and the 280F freezer evaporators (UC-4) is also returned to the High Temperature Recirculated Suction Main.\r\n\r\n+200F High Pressure Liquid (HPL) is fed from High Temperature Accumulator (HTA-1) through a solenoid valve and a hand expansion valve to the Medium Temperature Accumulator (MTA-3).  As the +200F High Pressure Liquid (HPL) High Pressure Liquid passes through the expansion valve it undergoes a deliberate change in pressure.  The liquid is now at -150F.  The liquid is used to maintain an operating level in the -150F Medium Temperature Accumulator (MTA-3).  The liquid from the -150F Medium Temperature Accumulator (MTA-3) is pumped by refrigerant pumps (LP-1 & LP-2).  The -150F Medium Temperature Accumulator (MTA-3) is also equipped with a level column.  The level column contains a liquid level probe which has a low level shutdown to shutoff the liquid pumps (LP-1 & LP-2) in case of a low liquid level.  This is to prevent cavitation in the pumps.  The level probe in the column is also equipped with a high level alarm in case of a high liquid level in the vessel.  It is also equipped with an operating level which will energize the liquid supply solenoid to maintain the liquid level in the vessel.  The float column also contains a high level shutdown float switch.  The float switch will power down the -150F Low Stage Compressor (LSC-3), this is to prevent liquid ammonia being pulled into the compression chamber.  HSC1 when running -15 single stage, and also during pumpdown prior to start -60, operating as swing should also be included in this safety loop.\r\n\r\nThe -150F Medium Temperature Accumulator (MTA-3) is also equipped with an oil pot (OP-3).  The oil pot (OP-3) is used to remove oil from the system."
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 22992,
      "SummaryText": "as had no accident(s) in the past five years involving ammonia.\r\n\r\n\r\nDESCRIPTION OF THE EMERGENCY RESPONSE PLAN\r\n\r\nIn the event that an ammonia leak is detected employees are to notify the Plant Supervisor. The Supervisor notifies the Maintenance Personnel.  The facilitator takes an ammonia level reading using a detection device.  If the facilitator determines that the ammonia level is above 25 ppm an evacuation of the exposure area is ordered.\r\n\r\nThe Supervisor determines if the leak is serious enough that outside assistance is needed.  If outside assistance is needed the local fire department is contacted.   If the incident is very serious the HAZMAT Darke County LEPC will be contacted. Also Whiteford Foods Emergency Response Team is contacted.  The engineers then take appropriate procedures, such as Emergency Shutdown Standard Operating Procedures, to control the leak with personal protective devices in place.\r\n\r\nOnce the Incident Commander arrives on scene, a report is given and the Incident Commander takes control of the situation.\r\n\r\nWhiteford Foods is committed to continuous improvement of our policies, procedures, and facility safety. It is the intention of Whiteford Foods to remain an industry leader. New technology, training techniques, and equipment are continuously being added to our system. \r\n\r\nAmong the ongoing  improvements are, training programs, policy updates, the addition of more safety equipment, cross training of maintenance and utility personnel, active safety committee and a complete Mechanical Integrity Inspection. All programs are aimed at Whiteford Foods objective to maintain a safe working environment for its employees and neighboring community."
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 22992,
      "SummaryText": "F Low Stage Compressors (LSC-1 & LSC-2), the vapor is compressed.  The discharge of the compressors (LSD) is returned to a common low stage discharge header.  The low stage discharge header returns to +20 (F High Temperature Accumulator (HT-1) via a connection to the +200F High Temperature Recirculated Suction Main (HTRS).  \r\n\r\nThere are several other systems of note in the refrigeration system.  High Stage Discharge (HSD) from the High Stage Compressors (HSC-1 & HSC-2) is discharged to the condensers.  Prior to entering the condensers there is a tap which feeds high stage discharge (HSD) to heat exchanger HX-1.  At HX-1 high stage discharge is fed through a hand valve and an electric shutoff valve into the shell of a heat exchanger HX-1.  A glycol solution is fed through the tubes of heat exchanger HX-1 where it absorbs heat from the high stage discharge (High pressure/high temperature vapor) this warms the glycol solution which is in turn is fed back through an under floor heating system to deter frost and heaving of the freezer floors.  In the heat exchanger as the ammonia rejects heat, it condenses into a liquid.  The liquid is gravity fed from the bottom of the heat exchanger shell into a liquid drainer.  The liquid is then returned via the High Temperature Recirculated Suction Header (HTRS) to the +200F High Temperature Accumulator (HTA-1) where it is separated.  \r\n\r\nHigh Stage Discharge is also fed as a hot gas assist to the shutoff valves in the Low Stage Compressors (LSC-1, LSC-2, LSC-3).  \r\n\r\n-600F Low Stage Suction is temporarily re-directed to the High Stage Compressor (HSC-1) during start up of the -600F Low Temperature Accumulator.  There are also provisions to warm the -60 System. This includes both the vessel and the cooling tunnels to allow for proper oil drainage.  During periods when the -60 (F Low Temperature Accumulator (LTA-2) is not in operation, the pressure in the -60 (F Low Temperature Accumulator (LTA-2) is automatically maintained through"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 22992,
      "SummaryText": "an automatic crossover to +20 (F Suction Header (HSS).\r\n\r\n\r\nDESCRIPTION OF THE WORST CASE RELEASE SCENARIO\r\n\r\nIn the worst case scenario the Receiver HPR-1 is penetrated. The amount of ammonia that can continue to be expelled is the liquid that can gravity drain from the Evaporative Condensers to the High Pressure Receiver.  The calculated amount of this release is approximately 3,200 lbs.\r\n\r\nThe Receiver is located outside, located inside an enclosed area to protect it from being impacted.  EPA's RMP*COMP (tm) calculated a release rate of 320 lbs. per minute and a release duration of ten minutes.  The Atmospheric Stability Class is F and the wind speed is 1.5 meters per second.  The topography around the facility is urban.\r\n\r\nRMP*COMP (tm) calculated a toxic radius of 0.30 miles.  Using LandView III (tm) it was determined that approximately 123 people live within this radius.  Also it was determined by the map generated using LandView III (tm) that there were only residential receptors within the radius. The use of active mitigation devices include: Emergency shutdown systems.\r\n\r\n\r\nDESCRIPTION IF THE ALTERNATE RELEASE SCENARIO\r\n\r\nIn the alternate case scenario a recirculator package HTA-1 located inside of engine room . RMP*COMP (tm) calculated the amount of this release to be approximately 2,000 lbs.  EPA's RMP*COMP (tm) also calculated a release rate of 200 lbs. per minute and a release duration of 10 minutes.  The Atmospheric Stability Class is D and the wind speed is 3.0 meters per second.  The topography around the facility is urban.\r\n\r\nRMP*COMP (tm) calculated a toxic radius of 0.10 miles.  Using LandView III (tm) it was determined that approximately 103 people within this radius.  Also it was determined by the map generated using LandView III (tm) that there were only a few residential receptors are within the radius. The use of active mitigation devices include: Emergency shutdown systems.\r\n\r\n\r\nSUMMARY OF THE FIVE-YEAR ACCIDENT HISTORY\r\n\r\nWhiteford Foods h"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 22992,
      "SummaryText": "uid  (LTRL) to a liquid/vapor combination (LTRS).  The Low Temperature Recirculated Suction (LTRS) from the evaporators and Tunnel A (UC-32 through UC-35) and Tunnel B (UC-28 through UC-31) is fed to a transfer vessel (TD-2).  At the transfer vessel the liquid and vapor separate.  The vapor returns to the -600F Low Temperature Recirculated Suction Main via a pipe from the top of the transfer vessel (TD-2).  The liquid from the transfer vessel (TD-2) is pumped via liquid pump (LP-8) through the roof to the top of the -600F Low Temperature Recirculated Suction Main where it is returned to the -600F Low Temperature Accumulator (LTA-2).  \r\n\r\nAt the Freezing Tunnels, (Evaporators UC-24 through UC-27), the low temperature recirculated liquid is fed through an expansion valve to each individual evaporator.  At each Freezing cooling tunnel evaporator, -600F Low Temperature Liquid (LTRL) is fed through the coils where it absorbs heat changing from a liquid  (LTRL) to liquid/vapor combination (LTRS).  The Low Temperature Recirculated Suction (LTRS) from the evaporators and Tunnel C (UC-20 through UC-23) and Tunnel D (UC-28 through UC-31) is fed to a transfer vessel (TD-1).  At the transfer vessel the liquid and vapor separate.  The vapor returns to the -600F Low Temperature Recirculated Suction Main via a pipe from the top of the transfer vessel (TD-1).  The liquid from the transfer vessel (TD-1) is pumped via liquid pump (LP-7) through the roof to the top of the -600F Low Temperature Recirculated Suction Main where it is returned to the -600F Low Temperature Accumulator (LTA-2).  \r\n\r\nAs the liquid vapor combination (LTRS) returns from the tunnels (UC-20 through UC-35) it is returned to the top of the -600F Low Temperature Accumulator (LTA-2).  This liquid vapor combination (LTRS) is separated.  The liquid is pumped back out to the tunnels via liquid pumps (LP-3 & LP-4).  The vapor is drawn to the suction of the -600F Low Stage Compressors (LSC-1 & LSC-2).  At the        -600"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 22992,
      "SummaryText": "(HTA-1).  \r\n\r\nThe High Pressure Liquid from the receiver (HPL) which is fed to the +200F High Temperature Accumulator (HTA-1) through electric shutoff valves and their accompanying hand expansion valves.  The Hand Expansion Valves cause the ammonia liquid (HPL) to undergo a deliberate change in \r\n\r\n\r\npressure.  Part of the liquid expands and evaporates into a vapor.  The remainder turns into a cooled liquid.  Liquid at this point is at +200F.  This liquid is used to maintain a level in the +200F High Temperature Accumulator (HTA-1).  The liquid from the +200F High Temperature Accumulator (HTA-1) is pumped by refrigerant pumps (LP-5 and LP-6).  The +200F High Temperature Accumulator (HTA-1) is also equipped with a level column.  The level column contains a liquid level probe which has a low level shutdown to shutoff the liquid pump (LP-5 and LP-6) in case of a low liquid level.  This is to prevent cavitation on the pumps.  The level probe in the column is also equipped with a high level alarm, in case of a high liquid level in the vessel.  It is also equipped with an operating level which will energize the liquid supply solenoid to the maintain the liquid level in the vessel.  The float column also contains a high level shutdown float switch.  This float switch will power down the High Stage Compressors (HSC & HSC-2).  This is to prevent liquid ammonia being pulled into the compression chamber.  \r\n\r\nThe +200F High Temperature Accumulator (HTA-1) is also equipped with an oil pot (OP-1).  The oil pot (OP-1) is used to remove oil from the system.  A liquid ammonia and oil combination gravity drains from the +200F High Temperature Accumulator (HTA-1) into the oil pot (OP-1).  In the oil (OP-1) the ammonia boils and ammonia vapor travels back up an equalizer line and enters above the liquid level in the +200F High Temperature Accumulator (HTA-1).  The oil remains in the oil pot (OP-1) and gradually accumulates.  The oil is then removed by a drain valve.  \r\n\r\nThe High Temp"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 22992,
      "SummaryText": "erature Recirculated Liquid (HTRL) from the +200F High Temperature Accumulator (HTA-1) is pumped through a filter assembly (FA2).  At the filter assembly (FA2), contaminants are removed.  The +20 (F High Temperature Recirculated Liquid (HTRL) from the +20 (F High Temperature Accumulator (HTA-1) is pumped to evaporators in the receiving dock (UC-1 and UC-2),  tempering area (UC-5 and UC-6), palletizing area (UC-7), grinding room (UC-8, UC-9) and  500F processing (UC-11 and UC-10). The evaporators fed with High Temperature Recirculated Liquid (HTRL) are arranged for a Recirculated liquid feed.  The High Temperature Recirculated Liquid (HTRL) flows through coils where is absorbs heat from the air and changes from a liquid (HTRL) to a liquid vapor (HTRS).  The liquid vapor combination (HTRS) from these units is returned to the +200F High Temperature Accumulator (HTA-1) where the liquid is separated from the vapor.  The Receiving Dock Units (UC-1 and UC-2) also have a hot gas defrost loop.  This hot gas defrost loop involves heating the coil with hot ammonia vapor (HSD) to allow frost to be removed from the coil.  Defrost condensate is returned to the High Temperature Recirculated Suction Main (HTRS) where it is returned to the +200F High Temperature Accumulator (HTA-1).  \r\n\r\nHigh Temperature Recirculated Liquid (HTRL) is also used to cool heat exchanger 2 (EX-2).  At this unit the high temperature Recirculated liquid (HTRL) passes through a hand shutoff valve and an electrically operated shutoff valve, then through a hand expansion valve, where the liquid undergoes a deliberate change of pressure resulting in a change of temperature.  Part of the ammonia liquid is expanded and evaporates, the remaining is cooled.  The liquid passes through the outside shell of the heat exchanger where absorbs heat from the heat transfer fluid inside of the heat exchanger.  As the liquid absorbs heat it boils to a liquid vapor combination (HTRS).  The liquid vapor combination (HTRS) is r"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 22992,
      "SummaryText": "ger (AP-1).  The Purge Gas (PUR) is separated by the Automatic Gas Purger (AP-1).  It separates ammonia from non-condensables by condensing the ammonia into a liquid.  Any non-condensables are piped to a water bubbler to remove any traces of ammonia.  Condensed vapor (LSS) is piped back to the -150F Low Temp Recirculated Suction Main (LTRS) and thus back to the -150F Medium Temp Accumulator (MTA-3).\r\n\r\nEach ammonia compressor in the Engine Room is equipped with dual safety relief valves which are piped to the Common Relief System.  Each Thermosyphon Oil Cooler in the Compressor Room is piped with a single relief valve from the shell side (oil side) of the unit to the Common \r\nRelief System.  Each thermosyphon oil cooler is protected on the tube side (refrigerant side) of the unit with a single safety relief valve located in thermosyphon return pipe (TSR) above the roof and vents directly to atmosphere.  Each of the accumulators in the Engine Room HTA-1, MTA-3, & LTA-2) is equipped with dual relief valves which are also piped into the Common Relief System.  Each oil pot in the Engine Room (OP-1, OP-2,, OP-3) is equipped with single safety relief valves and these are also piped into the Common Relief System in the Engine Room.  \r\n\r\nThe High Pressure Liquid (HPL), which is fed to the Direct Expansion Evaporators (Process Room 2) (UC-15), 400F Cooler (UC-16, UC-17) and Packoff Evaporative (UC-18), passes through a thermal expansion valve at each unit.  As the High Pressure Liquid passes through the thermal expansion valve it undergoes a deliberate change in pressure which acts to expand part of the liquid to a vapor and sub-cools the remainder of the liquid.  As the liquid passes through the coils it absorbs heat from the air, changing from a liquid (HPL) to a vapor (HSS).  The vapor (HSS) from these evaporators (UC-15, UC-16, UC-17, & UC-18) is piped back into the High Temperature Recirculated Suction (HTRS) main and thus back to the +200F High Temperature Accumulator"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 22992,
      "SummaryText": "se items were addressed on the basis of priority (Injuries to personnel). \r\n\r\nWhiteford Foods also incorporates additional safety items such as tagging of all ammonia system valves and components. \r\n\r\n\r\n\r\nDESCRIPTION OF THE REFRIGERATION SYSTEM\r\n\r\nThe Whiteford Foods' Facility in Versailles, Ohio is a Meat Processing/Packing Facility. The Facility incorporates a standard Evaporation and Compression Style Ammonia Refrigeration System. Ammonia Vapor, High Stage Suction, (HSS) from the +200F High Temperature Accumulator (HT-1) is routed to the Suction (Inlet) of two High Stage Screw Compressors.   At the High Stage Compressors (HSC-1 & HSC-2), Ammonia Vapor (HSS) is compressed to a Superheated Vapor (HSD).  The Superheated Vapor (HSD) from the High Stage Compressors (HSC-1 & HSC-2) is routed from the Engine Room to the roof.  One the roof it is fed to two Evaporative Condensers (EC-1 & EC-2).  At the Condensers the Superheated Vapor (HSD) rejects heat and converts to a High Pressure Condensed Liquid Drain (CLD).  The Condensers accomplish this by using a combination of air and water flow across the ammonia coils.  The condensers are equipped with the safety relief valves, which vent directly to atmosphere.  \r\n\r\nThe Condensed Liquid Drain (CLD) from the Evaporative Condensers' Gravity Drains to the High Pressure Receiver (HPR-1).  The High Pressure Receiver (HPR-1) is used as a storage vessel for ammonia liquid (HPL).  As ammonia liquid (HPL) is needed in the system, it is fed (via pressure) from the High Pressure Receiver (HPR-1) through a Liquid Filter Assembly (FA1).  The High Pressure Liquid from the Filter Assembly (FA-1) is fed to several High Pressure Liquid Lines.  The first Tee on the High Pressure Liquid Main feeds Evaporators UC-15, UC-16, UC-17, and UC-18.  The High Pressure Liquid Main continues through an Electric Shutoff Valve (King Solenoid Valve).  The Liquid Main feeds high pressure liquid to the Auto Purger (HP-1) and  Liquid Makeup to the +200F High"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 22992,
      "SummaryText": "Temperature Accumulator (HTA-1).  The High Pressure Receiver (HPR1) is also equipped with a Level Column.  The Level Column contains a Hansen Level Probe which is used for level sensing.  The High Pressure Receiver (HPR-1) is also constructed to include Thermosyphon Taps and has a reserve liquid capacity for thermosyphon oil cooling.  \r\n\r\nHigh Pressure Liquid (TSS) is fed (by Pressure) from the High Pressure Receiver (HPR-1) to the Thermosyphon Oil Coolers on each Compressor (HSC-1, HSC-2, LSC-1, LSC-2, & LSC-3).\r\n\r\nAt the Thermosyphon Oil Coolers on the Compressors (HSC-1, HSC-2, LSC-1, LSC-2, & LSC-3) High Pressure Liquid (TSS) is fed through the Thermosyphon Oil Cooler Heat Exchanger where it absorbs heat from the oil which is pumped from the Compressor through the Thermosyphon Oil Cooler.  As the Ammonia Liquid absorbs heat from the oil it converts to a liquid/vapor combination (TSR).  The High Pressure Liquid /Vapor Combination (TSR) is returned to the top of the High Pressure Receiver (HPR-1).  In the High Pressure Receiver (HPR-1) the Liquid/Vapor Combination (TSR) is separated.  The liquid is fed back out of the Receiver into the Liquid Loop.  The vapor is fed back to the Evaporative Condensers (EC-1 and EC-2) via the Equalizer Line.  The vapor that is returned to the Evaporative Condensers (EC-1 and EC-2) is re-condensed into a liquid (CLD) where it returns to the High Pressure Receiver (HPR-1).  \r\n\r\nHigh Pressure Liquid (HPL) is also fed to the Auto Purger (HP-1).  Purged Gas (PUR) is piped from the purge points to the purger (AP-1).  There are five purge points in the system.  Each Evaporative Condenser (EC-1 and EC2) has 2 purge points on the condensed liquid drain outlets.  The High Pressure Receiver (HPR-1) also has a purge point which is connected at the relief piping.  Each purge point consists of a solenoid valve with shutoff valves either side for isolation.  Any non-condensables in the vapor stream are removed periodically by the Automatic Gas Pur"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 22992,
      "SummaryText": "his manual also provides a checklist for performing the yearly Mechanical Integrity Inspection.\r\n\r\nVolume III incorporates a complete valve list, process and instrumentation diagrams, flow schematics, and other drawing pertinent to the production area equipment. The valve list contains information on the type, port size, identifying number, use, location, model, manufacturer, drawing reference, and normal operating position of each valve in the system. Process and Instrumentation Diagrams are included for the individual system components. Flow schematics are included showing the entire system. A Block flow diagram provides a brief overview of the system. Drawings are included showing symbol and abbreviation descriptions. Plan views are included to allow the operator to physically locate equipment in the building.\r\n\r\nVolume IV incorporates a complete set of standard operating procedures for the production area equipment. Describing the proper steps for preparing components for start-up, starting components, monitoring normal operation, shutting down as part of normal operation, restarting equipment as part of normal operation, shutting down equipment for maintenance, restarting equipment after maintenance, shutting down equipment in emergency situations, restarting equipment after an emergency situations shutdown, and pumpout procedures. Also included as a part of each Standard Operating Procedure is the Technical Operating Specifications for the associate system component. This information includes consequences of deviation from standard operating procedures.\r\n\r\nVolume V contains Operation and Maintenance Information for the production area equipment including manufactures information, spare parts list, maintenance procedures, and preventative maintenance procedures.\r\n\r\nProcess Hazard Analysis was performed in November 15, 1998.  The PHA highlighted some deficiencies in the system. These items were addressed as part of the continuous improvement of the facility. The"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 22992,
      "SummaryText": "RMP Executive Summary\r\n\r\n\r\nWhiteford Foods is proud to inform all interested parties that our company is complying with OSHA's Process Safety Management Standard (PSM), Title 29 Code of Federal Regulations 1910.119, and EPA's Risk Management Program regulations (RMP), Title 40 CFR Part 68.  In addition to other state and local codes applicable to our facility and process. We have undertaken this process to deal with the risks involved with the storage, handling, and use of Anhydrous Ammonia in our facility.\r\n\r\nOur goal is to promote overall worker, public, and plant safety.\r\n\r\nWhiteford Foods is located at 770 N. Center St., Versailles, OH. 45380.  We are a Meat Processing/Packing Facility.  The facility includes processing tanks, piping, packaging equipment, raw materials warehousing, finished goods refrigerated storage, an Ammonia refrigeration engine room, boilers, and miscellaneous utilities.  Also located at the facility is shipping and receiving docks.\r\n \r\nThe refrigeration system required for our production process necessitates the submission of this Risk Management Plan.  The refrigeration system contains 17,500 pounds of anhydrous ammonia.  This surpasses the threshold quantity of 10,000 pounds outlined in Process Safety Management and Risk Management Program regulations.\r\n\r\nWhiteford Foods has implemented numerous policies and procedures to enable our facility to prevent the occurrence, and minimize the consequences of significant releases of Anhydrous Ammonia as well as other hazardous substances, fires, explosions, and other types of catastrophic accidents.  Overall these programs prevent accidental fatalities, injuries, and illnesses and avoid property damage.\r\n\r\nOur safety programs prevent accidents because they focus on the rules, procedures, and practices that govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as necessary.  They are also communicated to and accepted by all employees at our facili"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 22992,
      "SummaryText": "ty.\r\n\r\nWhiteford Foods has organized the information and polices pertaining to the process into a complete library consisting of five numbered volumes, some volume numbers are assigned to sets of reference manuals, such as Operation and Maintenance manuals. \r\n\r\nVolume I of the PSM/RMP Library incorporates mainly policies, the following policies are included in Volume I:\r\n\r\nEmployee Participation Guidelines: This policy outlines the commitment between management and employees to establish a program for a successful (safe) program.\r\n\r\nProcess Safety Information: This includes information on the ammonia inventory at the facility, applicable codes, design standards, and information pertaining to the hazards of ammonia (referenced from the IIAR ammonia Data Book).\r\n\r\nProcess Hazard Analysis Program: This program outlines a thorough, orderly, systematic approach for identifying, evaluating, and controlling potential hazards within a process involving potentially hazardous chemicals such as ammonia.\r\n\r\nContractor Qualification Guidelines: This guideline has been established to verify that the contractors working in the facility are qualified to work on the system, trained in the hazards associated with their work, and made aware of the hazards presented by the facility to the employees of the contractor.\r\n\r\nManagement of Change and Pre-Startup Safety Review Programs: These programs have been developed to monitor and provide a checks and balances system to monitor changes in the facility and to verify that changes are safe and consistent with company policy.\r\n\r\nMany more specific programs and policies (Hot Work, Confined Space, Lockout / Tagout, Employee training, etc..) have been developed. For information specific to these see the Risk and Reliability Manager.\r\n\r\nVolume II incorporates information on the specific system components of the production area equipment. This information is used as a reference source for the operator to positively identify system components. T"
    }
  ]
}