{
  "FacilityID": 23047,
  "FacilityName": "J. B. Latham Regional Plant",
  "FacilityStr1": "34156 Del Obispo",
  "FacilityStr2": null,
  "FacilityCity": "Dana Point",
  "FacilityState": "CA",
  "FacilityZipCode": "92629",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06059",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.466111",
  "FacilityLongDecDegs": "-117.685278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "South East Regional Reclamation Authority",
  "Company2Name": null,
  "CompanyDUNS": 872669841,
  "Company2DUNS": 0,
  "OperatorName": "South East Region Reclam Authority",
  "OperatorStr1": "34156 Del Obispo",
  "OperatorStr2": null,
  "OperatorCity": "Dana Point",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92629",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael J. Wilson",
  "RMPTitle": "Director or Operations",
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000057225",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-03-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-03-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-03-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-02-05 00:00:00",
  "DeRegistrationEffectiveDate": "2009-01-09 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 33.46679,
  "FRS_Long": -117.68574,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 32923,
      "AltID": "Chlorination",
      "FacilityID": 23047,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 33762,
          "ProcessID": 32923,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 43267,
          "ProcessID": 32923,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 543267,
          "ProcessID": 32923,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23047,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAliso Water Management Agency/South East Regional Reclamation Authority (AWMA/SERRA) has an emergency response plan in effect.  The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP document.  This Plan was designed to meet the following objectives:\n\n1.) To save lives.\n2.) To minimize and avoid injuries.\n3.) To protect the environment.\n4.) To minimize property damage.\n\nAWMA/SERRA maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, chlorine health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM, RMP, and CalARP regulations, and to ensure that the plan is kept current.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe J. B. Latham Regional Plant of South East Regional Reclamation Authority (SERRA) is located at 34156 Del Obispo Street in Dana Point.  The facility is situated west of the Del Obispo Street near Villager Road.  Pacific Coast Highway lies approximately 0.10 kilometers (0.16 miles) south and Interstate 5 lies approximately 1.2 kilometers (0.72 miles) east of the facility.  The immediate area is primarily commercial and residential areas.\n\nThe chlorine system at the J. B. Latham Regional Plant is used for wastewater treatment.  The wastewater treatment system uses chlorine for odor control, filamentous control, or disinfection for the various stages of the treatment processes:  1) influents, 2)  return activated sludge (RAS), and 3) plant process water.  Chlorination of the wastewater controls filamentous bacteria growth in the mixed liquor tanks and kills the germs that cause disease"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23047,
      "SummaryText": "s.  Chlorine is delivered to the facility in one ton containers.  Chlorine gas leaving the one ton container passes through a vacuum regulator to the chlorinators.  From the chlorinators it is pulled into injectors and mixed with water from the treatment process.  The injectors send the chlorine solution into each of the reclamation treatment processes.\n\nA maximum of 3 one ton chlorine containers (6,000 lbs) is maintained in the chlorine room of the chlorine building.  This building is located on the west side of the property.\n\nHAZARD ASSESSMENT SUMMARY\n\nWorst Case Release Result Summary\n\n Scenario Description: Release of the maximum quantity of chlorine that can be stored in a vessel - 2,000 pounds in 10 minutes.  Although, the one-ton containers are stored enclosed in a building at the J. B. Latham Regional Plant, the containers are unloaded from the delivery truck outside before storing inside the building during a delivery of chlorine.  This creates the potential for operator error or equipment failure that would result in an unmitigated release, therefore, passive mitigation measures were not used.  The most pessimistic meteorological conditions were used: 1.5 meters/second wind speed, and F stability.  Reference table from the EPA's RMP Guidance for Wastewater Treatment Plants was used to determine the distance for the toxic point of 3 ppm.  This release reaches off-site and may affect population and environmental receptors.\n\nAlternative Release Result Summary\n\n Scenario Description: A release of chlorine gas from 5/16 inch diameter leak.  The release rate of chlorine due to the pressure of the tank is 5.2 pounds per minute.  However, passive mitigation measures were incorporated since the chlorine system is located inside an enclosed building at the J. B. Latham Regional Plant.  Consequently, the release rate after the passive measure was calculated to be 2.8 pounds per minute.  The meteorological conditions used were 3 meters per second wind speed, and D sta"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23047,
      "SummaryText": "bility.  Reference table from the EPA's RMP Guidance for Wastewater Treatment Plants was used to determine the distance for the toxic point of 3 ppm.  This release reaches off-site and may affect population receptors.  No Environmental receptors were affected by the potential release scenario.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe chlorine system at the J. B. Latham Regional Plant has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the AWMA/SERRA treatment processes operate in accordance with OSHA's Process Safety Management regulation and the California Accidental Release Prevention (CalARP) Program.\n\nIn the event that the primary engineering or administration controls at the J. B. Latham Regional Plant fail and cause a release of chlorine, there are several mechanisms in the plant to minimize the impact:  1) chlorine sensors / detectors, 2) alarms, and 3) emergency vapor scrubber system.  The chlorine sensors that trigger audible and visual alarms are located in the chlorinator room and the chlorine storage room.  Once a chlorine leak of 0.2 ppm is detected by the sensors, the ventilation system that continuously circulates the air in the chlorine building will be shut off by the emergency vapor scrubber system.  The chlorine scrubber system then will absorb and will eliminate chlorine.\n\nThe emergency chlorine scrubber system at the J. B. Latham Regional Plant is designed and built by RJ Environmental Incorporated.  The scrubber system consists three stage chemical absorption system:  one horizontal crossflow spray scrubber followed by two horizontal crossflow packed bed sections.  The released chlorine gas is absorbed and reacted with caustic solution. The system is designed with the ventilation rate of 3000 acfm and the maximum discharge chlorine concentration of 5 ppm.  The scrubber has the capability of neutrali"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23047,
      "SummaryText": "zing 2,000 pounds of chlorine with a 99%+ rate of effectiveness.\n\nIn addition, common industry standards, policies, and procedures are utilized to ensure safe practices are being performed.  This includes common practices recommended by the Chlorine Institute.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThe accident history researched back five years to June 1994 shows that the AWMA/SERRA's facility has not had an accidental release or \"near miss\" of chlorine.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe AWMA/SERRA has an emergency response plan in effect at the facility.  The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document.  This Plan was designed to meet the following objectives: \n\n1.) To save lives.\n2.) To minimize and avoid injuries.\n3.) To protect the environment.\n4.) To minimize property damage.\n\nThe AWMA/SERRA maintains a safety committee whose members include the emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility. \n\nThe Plan also includes the Emergency training for all AWMA/SERRA employees. The AWMA/SERRA performs periodic emergency evacuation drills every 90 days to enhance the emergency response skills of its personnel.\n\nThe Emergency Response Plan is reviewed and updated by the AWMA/SERRA J. B. Regional Plant responsible person, Mr. Michael Wilson at least once a year.  This Plan will be review and updated to ensure compliance with the PSM, RMP, and CalARP regulations, and to ensure that the plan is kept current.\n\nThe AWMA/SERRA has coordinated emergency response efforts withe the local fire department,  Orange County Fire Department.  In the case of a chlorine-related emergency, its is the policy of AWMA/SERRA to evacuate the employees and to allow the fire department to respond to the emergency (potentiall"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 23047,
      "SummaryText": "y with the assistance of trained facility personnel).\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazard Analysis (PHA) provided the mitigation measures outlined below to improve safety at the J. B. Latham Regional Plant of AWMA/SERRA.  The PHA was comprised of one session that included a HAZOP study, a Plant Walkthrough, a \"What-if\" analysis, and a series of checklists.  The changes will be completed by December 1, 1999.\n\nR04 Examine the applicable code requirements to determine the proper application for the exhaust fans during normal/daily operation (i.e. temperature controlled, always on, etc.).\n\nR05 Develop operating procedure for evacuating chlorine from the pipe line for maintenance service.\n\nR09 Post floor plans and/or work place maps with evacuation instructions.\n\nR10 Consider formal emergency response training for the operators that is at a minimum the Hazardous Materials First Responder Operations level.  (See Section 6)\n\nSeismic Assessment \n\n1.The missing nut on one of the unused trunnions should be replaced prior to use."
    }
  ]
}