{
  "FacilityID": 23212,
  "FacilityName": "Rhodia Inc.",
  "FacilityStr1": "3440 Fairfield Road",
  "FacilityStr2": null,
  "FacilityCity": "Baltimore",
  "FacilityState": "MD",
  "FacilityZipCode": "21226",
  "Facility4DigitZipExt": "1512",
  "FacilityCountyFIPS": "24510",
  "LEPC": "Baltimore City LEPC",
  "FacilityLatDecDegs": "39.234472",
  "FacilityLongDecDegs": "76.578278",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": "http://www.us.rhodia.com",
  "FacilityEmailAddress": "rhodiac@us.rhodia.com",
  "FacilityDUNS": 608380580,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Rhodia Inc.",
  "OperatorStr1": "3440 Fairfield Road",
  "OperatorStr2": null,
  "OperatorCity": "Baltimore",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21226",
  "OperatorZipCodeExt": "1512",
  "RMPContact": "Jerry McGinnis",
  "RMPTitle": "Plant Manager",
  "FTE": 77,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000044917",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-03 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-04-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-01-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-01-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2001-11-15 00:00:00",
  "DeRegistrationEffectiveDate": "2001-11-06 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 39.23596,
  "FRS_Long": -76.57819,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 33122,
      "AltID": "Sulfation",
      "FacilityID": 23212,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 33962,
          "ProcessID": 33122,
          "NAICSCode": "325613",
          "_desc": {
            "NAICS_CODE": "325613",
            "NAICS_DESCRIPTION": "Surface Active Agent Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 33963,
          "ProcessID": 33122,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 43466,
          "ProcessID": 33122,
          "ChemicalID": 57,
          "Quantity": 80000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 543466,
          "ProcessID": 33122,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23212,
      "SummaryText": "Executive Summary\n^^^^^^^^^^^^^^^^^^^\nThe Rhodia Inc., Baltimore, Maryland manufacturing facility is committed to conduct business in a manner that protects the safety and health of employees, contractors, its customers, and the environment.  Furthermore, it is committed to conduct business in a manner that is compatible with the environmental needs of the community in which it operates.  This commitment requires compliance with all applicable laws and regulations.  The facility is designed and operated to high standards, with systematic identification and management of safety, health and environmental risks.\n\nIn keeping with this commitment, the Rhodia Inc. Baltimore Plant has established a comprehensive Safety Management System that strives to identify and eliminate all potential exposures that include, but are not limited to, personal injury/illness, property damage, fires, process incidents, and breaches of security.  The employees at Rhodia, Baltimore are dedicated to developing, implementing, and operating sound process safety programs, maintaining compliance with both internal Rhodia and external requirements, improving process safety performance using a risk-benefit approach, and addressing process safety and risk management issues and concerns in a timely manner.\n\nThe Safety Management System embodies and employs the spirit and intent of the concepts found in the CMA Responsible Care Initiative, the OSHA Process Safety Management Standard, all other applicable regulatory standards, and the Rhodia Inc. Corporate Engineering, Safety and Industrial Hygiene Policies and Strategies.  Rhodia Baltimore is fully committed to the CMA Responsible Care initiatives:  Process Safety, Employee Safety and Health, Distribution, Pollution Prevention, Community Awareness and Emergency Response (CAER), and Product Stewardship.  Rhodia Baltimore achieves compliance with Responsible Care codes through workplace health and safety programs as well as release and waste generation "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23212,
      "SummaryText": "reduction programs.  These programs ensure that Rhodia Baltimore is operated in a manner that protects the environment and the health and safety of personnel and the public.\n\nHealth, Safety and Environmental Philosophy\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\nThe Safety Management System includes the following Health, Safety and Environmental Philosophy:\n\n\"It is the goal of the Baltimore Plant to supply our customer's, both internal and external, with goods and services that meet or exceed their expectations.\n\nCritical to this effort is having no adverse impact on our employees, our neighbors, or the environment.\n\nIn pursuit of our goals, we must recognize the following:\n\n?  All incidents can be prevented.\n\n?  Each member of our plant team has a hand in our success.  As such, everyone is responsible for preventing incidents.\n\n?  Training is essential.  The more knowledgeable we are, the fewer mistakes we make.\n\n?  It is not possible to meet our business goals withour meeting health, safety and environmental goals. \"\n\nDescription of Plant Process Covered under 40 CFR Part 68\n\nThe Rhodia Inc. Baltimore Plant is engaged in the manufacture of surfactants and specialty chemicals.  The specialty chemicals are primarily reactive monomers.  \n\nThe sole process covered under the 40 CFR Part 68 (Risk Management Plans) is the Sulfation Process which utilizes 30% aqueous ammonia for the neutralization of sulfated alcohols in the manufacture of surfactants (for example: detergents)\n\nWorst Case Scenario - Toxic\n^^^^^^^^^^^^^^^^^^^^^^^^^^^\nThe worst case release scenario selected for the Sulfation Process is the complete loss of the contents of one full ammonium hydroxide trailer within 10 minutes.  The distance to the toxic endpoint (0.14mg/L) is 0.2 miles.  There is no residential population within a circle of 0.2 miles from the unloading location ( the circle of influence).  Public receptors within the circle of influence include only industrial or heavy commercial businesses"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23212,
      "SummaryText": ".  There are no environmental receptors in this circle of influence.  Environmental receptors include national or state parks, forests, or monuments, and wildlife sanctuaries, preserves, or refuges.\n\n Worst Case Scenarios - Flammables\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^"
    }
  ]
}