{
  "FacilityID": 23289,
  "FacilityName": "Cross Creek Water Reclamation Facility",
  "FacilityStr1": "601 North Eastern Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Fayetteville",
  "FacilityState": "NC",
  "FacilityZipCode": "28302",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37051",
  "LEPC": "Cumberland County LEPC",
  "FacilityLatDecDegs": "35.061944",
  "FacilityLongDecDegs": "-78.856111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A5",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "www.faypwc.com",
  "FacilityDUNS": 80887367,
  "ParentCompanyName": "Public Works Commisssion City of Fayetteville, NC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Public Works Commission",
  "OperatorStr1": "P.O. Box 1089",
  "OperatorStr2": null,
  "OperatorCity": "Fayetteville",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28302",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ike Copeland",
  "RMPTitle": "Risk Manager",
  "FTE": 27,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000129014",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-09-19 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-04-17 00:00:00",
  "ErrorReportDate": "2001-04-17 00:00:00",
  "ReceiptDate": "1999-11-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-10-29 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2000-08-28 00:00:00",
  "DeRegistrationEffectiveDate": "2000-01-03 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 35.05917,
  "FRS_Long": -78.86111,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 33199,
      "AltID": "disinfectant",
      "FacilityID": 23289,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 34038,
          "ProcessID": 33199,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 43543,
          "ProcessID": 33199,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 43544,
          "ProcessID": 33199,
          "ChemicalID": 49,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 543543,
          "ProcessID": 33199,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 543544,
          "ProcessID": 33199,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23289,
      "SummaryText": "EXECUTIVE SUMMARY\n\nRISK MANAGEMENT PROGRAM\nFOR\nCROSS CREEK RECLAMATION FACILITY PLANT\n\nIn an effort to protect PWC personnel, the surrounding community, and the environment, PWC will be changing their current wastewater treatment process that will eliminate the use chlorine and sulfur dioxide (anhydrous).  This substitution will take effect by July of 2000.\n\n\nThis executive summary for the Risk Management Program for the Cross Creek Water Reclamation Facility (CCWRF) conforms to section 68.155 through 68.185.  Referenced documents, such as the PWC Comprehensive Emergency Management Plan (CEMP), Emergency Action Plan (EAP), Spill prevention, Containment and Control Countermeasures (SPCC) and Oil Pollution Plan (OPA 90) all plans are available for inspection by authorized individuals.\n\nPREVENTION AND EMERGENCY RESPONSE POLICIES\n\nIt is the policy of CCWRF to prevent accidental releases through the use of preventative programs, testing, calibrations, routine maintenance, inspections, and replacement of equipment if necessary and properly training personnel.  A work order system is in place for employees to formerly report deficiencies and track until rectified.\n\nCCWRF's overall policy is to provide a safe environment for all employees, contractors, visitors, and neighbors.  This extends to the design, training, and implementation of a program, which will result in saving lives and reducing property damage during an emergency.\n\nIt is also CCWRF's policy to operate in an environmentally responsible manner consistent with environmental regulations, policies, and procedures, and are in the best interest of PWC employees, the surrounding community, and the company.  CCWRF is designed and operated to cause the least amount of impact the environment of the surrounding area.\n\nEmployees at CCWRF make every attempt to prevent emergencies from occurring at the facility.  However, should an event ever occur, the immediate goal is to keep the emergency and it's effect to within the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23289,
      "SummaryText": "facility boundaries and not allow it to present a threat to the health and safety of the general public.\n\nPreserving life is the prime consideration, so all procedures will be carried out in a manner to minimize risk to employees, emergency response personnel, and the surrounding community.  Rescue and medical activities have priority over all other actions.\n\nIt is the emergency response policy of CCWRF to immediately notify the Cumberland Emergency Management Agency (CEMA), (LEPC), and the (SERC) of any regulated substances in excess of the reportable quantity.\n\nPWC employees are only trained at the awareness level within the HAZOP system.  If possible, employees are allowed to eliminate the release source (i.e. closing valves, shutting down pumps, etc.) or contain the release.  In the event that a situation arises that cannot be contained by PWC employees, CCWRF relies on the Fayetteville HazMat Team to respond to these emergencies.\n\nThe CCWRF facility diligently attempts to comply with the various emergency related regulations.  Additionally, the use of Safety and Operating Procedures provide a system to avert accidental releases by focusing on specific components of each shipment.  The safety and operating procedures consist of safety procedures uniquely designed for specific job tasks. The manual is reviewed annually and revised as necessary to address any changes.  Each inbound shipment receives a detailed pre-unloading inspection, inspection during unloading, and post unloading inspection by the loading technician.  The chief technician for quality assurance performs a final inspection.  Employees and contractors are trained to insure proficiency in all phases of operation.\n\nCCWRF follows company-wide Comprehensive Emergency Management Plan (CEMP) which is designed to address prevention, preparation, response and recovery from a wide variety of potential emergencies, including accidental releases of any regulated substance at the facility.  The facility, its "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23289,
      "SummaryText": "employees and business operations are susceptible to emergencies such as natural disasters, severe weather, and man-made hazards.  The CEMP, in conjunction with the Risk Management Program and other regulatory aids, help in managing potential emergency situations.\n\nThe facility maintains an aggressive training program for all members of the facility personnel.  In addition to the initial training programs for all staff members, various annual refresher training is provided along with periodic drills and exercises.  Emergency response equipment is maintained in prime condition and includes SCBAs for protection during evacuations.  During emergencies the WR Wastewater Facilitiy Manager will serve as the Emergency Coordinator, until the area respondents take charge of the incident.\n\nA windsock is placed near the chemical building and will be used to determine the wind direction and the plume flow of the chlorine or sulfur dioxide(anhydrous), in the event of a release.\n\nIncidental releases of chlorine or sulfur dioxide (anhydrous) may occur when the following operations are executed on the system:\n  (1)  Changing cylinders out for usage minor leaks may occur\n  (2)  Minor leakage may occur when a valve packing nut is loosened a half turn to open or close the valve.\n\nAll other releases constitute an \"abnormal release\" and the response to them is handled in two levels of severity.\n\nAWARENESS LEVEL\n\n  (1)  No offsite resources needed\n\nMAJOR EMERGENCY LEVEL\n\n  (1)  Requires sounding of emergency alarm and evacuating the site including the main office building.  A full-scale response effort will be launched to protect employees and the community.\n\n  (2)  Outside reponse teams will be called when authorized by the WR Wastewater Facility Manager.  These teams must have fully trained personnel at the Hazardous Materials Technicians level.  Periodic escorted visits of these teams to the pertinent building area will allow familiarity with the premises to promote effective response"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23289,
      "SummaryText": " to emergencies.  A building plan showing the location of chlorine and sulfur dioxide (anhydrous) will be filed with the City of Fayetteville Fire Department.  The Risk Manager or his/her designee shall write a critique of each necessary emergency response actions or drills.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe following items are planned changes to improve safety and reduce the likelihood a chlorine or sulfur dioxide (anhydrous) release at CCWRF.\n\n  (1)  SUBSTITUTE RMP REGULATED CHEMICALS BY THE SUMMER OF 2000!\n\nCOMMUNICATING RISK TO THE COMMUNITY\n\nCommunity warning in the event of a significant chlorine or sulfur dioxide (anhydrous) release is a critical concern.  The LEPC has a plan for warning people of an emergency through the use of police vehicles broadcasting warnings over speaker systems.  Through the use of CEMA's notification system and our internal procedures, we feel confident that public notifications will be communicated in a timely expeditious manner.\n\nCCWRF will incorporate educating the public and surrounding community on the RMP and the specific risks and non-risks posed by it's facility through Water Week activities, the Safewatch Program, and tours of it's facility.  In addition, we routinely give public tours to explain our process and safety precautions.\n\nDESCRIPTION OF THE FACILITY\n\nCCWRF is located at 601 North Eastern Blvd.  The facility is located on an access road that runs parallel to interstate 95.  Cape Fear River runs approximately 1500 ft. behind CCWRF. \n\nCHEMICAL STORAGE\n\nCCWRF uses chlorine and sulfur dioxide (anhydrous) in its process.  The RMP regulated chemicals are stored in the same building but in separate rooms divided by a thick cinder block wall.  These areas are enclosed with  cinder block walls covered by brick.  The walls are equipped with automatic ventilation fans to which provide mitigated containment for these substances.  Each room contains chemical sensors to alert our operations control center in the event of "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 23289,
      "SummaryText": "a release.  The ventilation fans are checked periodically for proper working order, as well as, calibration of the sensors.\n\nChlorine is the primary disinfectant chemical used in the water treatment process.  Chlorine is classified as an oxidizer that is also corrosive and toxic.  There are 4 cylinders weighing 2,000 pounds each with 2 on the process line at a time and 2 on standby. Chlorine is kept in a gaseous state.  Our process requires two cylinders be kept in the process at all times.\n\nCCWRF also uses sulfur dioxide (anhydrous) in its process.  Sulfur dioxide (anhydrous) is classified as a toxic and corrosive.  There are 4 cylinders that weigh 2,000 pounds each 2 online and 2 on standby.  Sulfur dioxide (anhydrous) is also kept in a gaseous state and is used to dechlorinate the treated water before it is discharged back into the Cape Fear River.\n\nMISCELLANEOUS FACILITY INFORMATION\n\nCCWRF employs 27 full time people.  They rely on the PWC medical staff as well as the local medical professionals to assist with emergency and non-emergency incidents.\n\nThe worst case scenario is defined as the rapid and complete release of the largest container used in the process whether it is inter-connected to other vessels in the system or not.  A worst case scenario is highly unlikely to occur due to:\n\n-  All process cylinders are all not full at one time\n\n-  All the cylinders are not in the process at one time\n\n-  There  is no heavy movable equipment working inside the process/storage buildings (i.e.,forklifts).  The chlorine and sulfur dioxide (anhydrous) cylinders are not all full at one time, and the cylinders are loaded and off loaded inside the building by an indoor crane.\n\n-  The cylinder valves are protected by the structure of the cylinder\n\n-  The procees controls that are in place in the system such as alarms, sensors\n\n-  The simplistic designed for operation\n\n-  The Standard Operating Procedures that are in place to minimize the chance of a leak\n\n\nWORST CASE SCENARI"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 23289,
      "SummaryText": "O # 1\n\nMaterial identification - Chlorine\nQuantity released -  2000\nQuantity release rate - 110 lbs./min\nProcess/Storage - Conditions Gas\nTopography - Rural\nToxic Endpoint - 0.09\nMeteorological Conditions Wind - 1.5 mph\nAdministrative Limitations - yes  \nPublic and Environmental Receptors - no\nAmbient Temperature 77F\nAtmospheric Stability Class - F\nRelease Duration - 10 minutes\nPopulation Efected - 0\n\nWORST CASE SCENARIO #2\n\nMaterial identification - Sulfur Dioxide (anhydrous)\nQuantity released - 2000\nQuantity release rate - 110 lbs./min\nProcess/Storage - Gas\nTopography - Rural\nToxic Endpoint - 0.09 miles\nMeteorological Conditions - 1.5 mph\nAdministrative Limitations - yes\nPublic and Environmental Receptors - No\nAmbient Temperature - 77F\nAtmospheric Stability Class - F\nRelease Duration - 10 minutes\nPopulation Effected: 0\n\nBoth scenarios were developed using the EPA's OCA Guidance Reference Tables or Equations.\n\nGiven the unrealistic guidelines of the worst-case scenario, more realistic planning scenarios, or alternative release scenarios, were, also developed to more closely simulate a real world event.  These scenarios involve smaller releases and allow safety systems to be included in the calculations.  The alternative release scenarios will be useful to local government and industry to prepare emergency response plans. \n\nALTERNATIVE SCENARIO # 1\n\nMaterial Sulfur Dioxide (anhydrous)\nQuantity released - 1000 pounds\nQuantity release rate - 100 lbs./min\nProcess/Storage Conditions - Gas\nTopography - Rural\nToxic Endpoint - 0.002\nMeteorological Conditions Wind - 3.5 mph\nAtmospheric Stability Class - D\nAmbient Temperature - 77F\nPublic and Environmental Receptors - NO\nRelease Duration - 10 minutes\nPopulation Efected - 0\n\nALTERNATIVE SCENARIO # 2\n\nMaterial Chlorine\nQuantity released - 1000\nQuantity release rate - 100 lbs./min.\nProcess/Storage - Gas\nTopography - Rural\nToxic Endpoint - 0.02 miles\nMeteorological Conditions Wind - 1.5 mph\nAmbient Temperature - 77mph\nAtmospheri"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 23289,
      "SummaryText": "c Stability Class - D\nRelease Duration - 10 minutes\nPopulation Effected - 0\n\n\nACCIDENT HISTORY\n\nCCWRF has been in operation since 1959.  Since it's inception to the present time there have been no accidental releases.  \n\n1994      1995      1996      1997      1998      1999\nNone     None     None     None      None     None        \n\nIn the case of an accident involving an accidental release of chlorine or sulfur dioxide (anhydrous), an incident investigation will take place. \n\nCCWRF follows the company wide Comprehensive Emergency Management Plan (CEMP) which is designed to address prevention, preparation, response, and recovery from a wide variety of potential emergencies, including accidental releases of any regulated substances at the facility.  The facility, its employees and business operations are susceptible to emergencies such as natural disasters, severe weather, and man-made hazards.  The (CEMP), in conjunction with the Risk Management Program and other regulatory aids, help in managing potential emergency situations.\n\nThe facility maintains an aggressive training program for all of the facility personnel.  In addition to the initial training programs for all facility personnel, annual refresher training is provided along with periodic drills and exercises.  Emergency response equipment is maintained in prime condition and includes SCBAs for protection during evacuations.  During emergencies the WR Wastewater Facility Manager will serve as the Emergency Coordinator, until the area respondents take charge of the incident.\n\nA windsock is placed near the chemical building and will be used to determine the wind direction and the plume flow of the chemical release.\n\nIncidental releases of chlorine or sulfur dioxide (anhydrous) may occur when the following operations are executed on the system.\n\nDuring the process of changing cylinders out for usage minor leakage may occur when a valve-packing nut is half turned to open or close the valve.\n\nTHERE IS NO HOT WORK"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 23289,
      "SummaryText": " PERFORMED AT THIS FACILITY BY PWC PERSONNEL.  FOR THIS REASON THERE IS NO STANDARD OPERATING PROCEDURES FOR THIS TYPE OF WORK.  THEREFORE, SECTION 7.13 IS LEFT BLANK.\n\n\n\n\n\n\nAll other releases constitute an \"abnormal release\" and the response is handled as determined by its severity."
    }
  ]
}