{
  "FacilityID": 23337,
  "FacilityName": "Inland Cold Storage",
  "FacilityStr1": "2356 Fleetwood Drive",
  "FacilityStr2": null,
  "FacilityCity": "Riverside",
  "FacilityState": "CA",
  "FacilityZipCode": "92509",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06065",
  "LEPC": null,
  "FacilityLatDecDegs": "34.015722",
  "FacilityLongDecDegs": "-117.367306",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.inlandcold.com",
  "FacilityEmailAddress": "ken.hudson@inlandcold.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Inland Cold Storage",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Mac McNamara",
  "OperatorStr1": "2356 Fleetwood Drive",
  "OperatorStr2": null,
  "OperatorCity": "Riverside",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92509",
  "OperatorZipCodeExt": null,
  "FTE": 68,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000175295",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-04-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-04-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-04-24 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-04-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 34.01392,
  "FRS_Long": -117.38117,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 33257,
      "AltID": "Cold Storage",
      "FacilityID": 23337,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 43605,
          "ProcessID": 33257,
          "ChemicalID": 56,
          "Quantity": 14000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 34097,
          "ProcessID": 33257,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 18695,
              "Process_NAICS_ID": 34097,
              "SafetyReviewDate": "2001-01-23 00:00:00",
              "PHA_Date": "2001-01-23 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-01-23 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": "new facility",
              "OpProceduresReviewDate": "2001-03-05 00:00:00",
              "TrainingReviewDate": "2000-11-29 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-01-30 00:00:00",
              "EquipmentInspectionDate": "2001-02-26 00:00:00",
              "EquipmentTested": "Dry nitrogen pressure test of entire ammonia system.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2001-01-08 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-11-13 00:00:00",
              "HotWorkPermitReviewDate": "2000-11-28 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2000-11-29 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 27272,
                  "PreventionProgram3ID": 18695,
                  "ProcessChemicalID": 43605
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 23337,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Cnty of Riverside Environ Health",
    "CoordinatingAgencyPhone": "9097666524",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23337,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Inland Cold Storage facility has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document which is maintained at the facility.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nInland Cold Storage maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nConstruction of the ammonia refrigeration system at Inland Cold Storage was completed in April 2001.  The facility is located at 2356 Fleetwood Drive, Riverside, California,  92509.  The system was constructed in accordance with all applicable federal, state, and local regulations including the Uniform Fire and Mechanical Codes.\n\nThe ammonia refrigeration system uses 14,000 pounds of ammonia for storage freezers and dock operations.  The majority of the system is located in the machine room including vessels and compressors.  The condensers are mounted on the roof, and all of the evaporators are located in their respective cold areas or rooftop penthouses.\n\n\nHAZARD ASSESSMENT SUMMARY\n\n*  Worst Case Release Result Summary\n\n      Scenario Description:  Release of the maximum quantity of ammonia that can be stored in a vessel - 14,000 pounds in 10 minutes.  The most pessimistic meteorological condi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23337,
      "SummaryText": "tions were used: 1.5 meters per second wind speed, and F stability.  The Risk Management Program Guidance for Ammonia Refrigeration reference tables were used to determine the maximum distance to the toxic endpoint of 200 ppm in urban conditions.  This release reaches off site and may impact population receptors.  No environmental receptors were affected by this potential release.\n\n*  Alternative Release Result Summary\n\n     Scenario Description: A release of ammonia from resulting from a 1/4 inch diameter hole in a pipe.  The release rate of ammonia due to the pressure of the tank is 122 pounds per minute.  The meteorological conditions used were 3.0 meters per second wind speed, and D stability.  The Risk Management Program Guidance for Ammonia Refrigeration reference tables were used to determine the maximum distance to the toxic endpoint of 200 ppm in urban conditions.  This release reaches off site and may impact other commercial/industrial neighbors.  No environmental receptors were affected by this potential release. \n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe Inland Cold Storage ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the Inland Cold Storage facility operates in accordance with Cal/OSHA's Process Safety Management regulation. \n\nThe Inland Cold Storage facility including each ammonia system was designed and constructed in accordance with the 1997 Uniform Mechanical Code which specifically outlines requirements for the safe operation of the ammonia refrigeration system.  These safety features include a water diffusion tank, ammonia sensors in the machine room as well as sensors near the evaporators, and automatic shut down systems.  In addition, the majority of the ammonia is maintained inside the machine room and just outside of the machine room (high pressure receiver and co"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23337,
      "SummaryText": "ndensers).  All pressure vessels are equipped with pressure relief valves that are commonly piped to the water diffusion tank.\n\nIn addition to the 1997 Uniform Mechanical Code, the facility will operate in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines. \n\n\nFIVE YEAR ACCIDENT HISTORY\n\nBecause this is a new facility completed in April 2001, there is no ammonia accident history.  However, Inland Cold Storage currently operates two other ammonia refrigerated warehouses and neither have had an accidental release of ammonia in the last five years (February 1996 - February 2001).\n\n\nEMERGENCY RESPONSE PROGRAM\n\nThe Inland Cold Storage has an emergency action plan in effect at the facility.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP document.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nInland Cold Storage maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes due to the renovation of the facility.\n\nIn case of an ammonia emergency, Inland Cold Storage plans to evacuate all employees in the facility and alert the local emergency responders (fire department).  Inland Cold Storage plans to coordinate emergency response efforts with the fire department on a periodic and ongoing basis.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazard Analysis, Se"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23337,
      "SummaryText": "ismic Assessment, and Hazard Assessment (Off-Site Consequence Analysis) provided mitigation measures to improve safety at the Inland Cold Storage facility located at 2356 Fleetwood Drive, Riverside, California.  All recommendations will be completed prior to start up.\n\nR01: Conduct an awareness training program that includes informing all employees of the following: 1) the presence of and the hazards associated with ammonia at the facility, 2) how to recognize the odor, 3) what to do if they observe an ammonia leak, and 4) where to go when they are told to evacuate.\n\nR02: Coordinate emergency response activities with the local emergency responders (i.e., fire department) on a periodic and ongoing basis.\n\nR03: Implement a preventive maintenance program to replace/retest relief valves every five years (as per industry standard).  Automatically replace any relief valves that unseat.\n\nR04: Implement and document maintenance procedures per IIAR Bulletin 110 as well as establish a procedure to have operators complete a daily log sheet of refrigeration equipment.\n\nR05: Conduct monthly testing of eyewash station and showers.\n\nR06: Conduct annual evacuation drills to ensure that all employees understand how to evacuate and where to meet.  Consider having the local Fire Department team participate in the drills.\n\nR07: Develop a checklist of safety items to include in the new employee orientation with a signature of understanding.\n\nR08:  Consider obtaining a hand-held ammonia detector to use in the event of a release to determine if the ammonia concentration exceeds the IDLH (300 ppm).  Concentrations should be documented and maintained as part of the incident investigation documentation.\n \nR09: On an annual basis, verify that the level shown by the computer can be verified by the level column reading.  Also, test the high and low level alarms/switches annually.  \n\nR10: Following training of new employees on draining oil, ensure that they and the trainer certify that training"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 23337,
      "SummaryText": "has occurred and was understood.\n\nR11: Ensure that all evaporator coils are periodically maintained by cleaning the pans and coils per IIAR Bulletin 110 Guidelines (include criteria in maintenance program).\n\nR12:  Inspect the freezer pans frequently during startup to ensure that there is no ice build up in the pan. \n\nR13:  Determine the need for lighting on the roof whether it be portable lighting or permanent lighting on the penthouses, etc.  \n\nR14: Include in the written maintenance program an annual test to verify compressor safety shut down safeties are functioning properly.\n\nR15: Include the water treatment program and other condenser maintenance in written program and ensure it is in compliance with IIAR Bulletin 110 Guidelines."
    }
  ]
}