{
  "FacilityID": 23490,
  "FacilityName": "Foremost Farms USA",
  "FacilityStr1": "501 South Pine Street",
  "FacilityStr2": null,
  "FacilityCity": "Reedsburg",
  "FacilityState": "WI",
  "FacilityZipCode": "53959",
  "Facility4DigitZipExt": "2127",
  "FacilityCountyFIPS": "55111",
  "LEPC": "Sauk County LEPC",
  "FacilityLatDecDegs": "43.527583",
  "FacilityLongDecDegs": "-90.003778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": "www.foremostfarms.com",
  "FacilityEmailAddress": "jim.wittenberger@foremostfarms.com",
  "FacilityDUNS": 877549923,
  "ParentCompanyName": "Foremost Farms USA",
  "Company2Name": null,
  "CompanyDUNS": 877549923,
  "Company2DUNS": 877549923,
  "OperatorName": "Foremost  Farms USA",
  "OperatorStr1": "501 South Pine Street",
  "OperatorStr2": null,
  "OperatorCity": "Reedsburg",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53959",
  "OperatorZipCodeExt": "2127",
  "RMPContact": "Tom Mathews",
  "RMPTitle": "Plant Manager",
  "FTE": 67,
  "OtherEPAFacilityID": "53959WSCNS501SP",
  "EPAFacilityID": "100000175525",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-02-14 00:00:00",
  "SafetyInspectionBy": "Zurich Insurance",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Reedsburg - Propane",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-05-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-05-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-05-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-01-06 00:00:00",
  "DeRegistrationEffectiveDate": "2004-11-30 00:00:00",
  "AnniversaryDate": "2006-05-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 43.52709,
  "FRS_Long": -90.00333,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Previously leased propane vessel to retailer, but agreement now terminated",
  "_processes": [
    {
      "ProcessID": 33481,
      "AltID": "Storage for distribution",
      "FacilityID": 23490,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 34324,
          "ProcessID": 33481,
          "NAICSCode": "454312",
          "_desc": {
            "NAICS_CODE": "454312",
            "NAICS_DESCRIPTION": "Liquefied Petroleum Gas (Bottled Gas) Dealers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 43858,
          "ProcessID": 33481,
          "ChemicalID": 98,
          "Quantity": 100800.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 543858,
          "ProcessID": 33481,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23490,
      "SummaryText": "Foremost Farms USA (Foremost Farms) owns two propane vessels at 501 South Pine Street, Reedsburg, Wisconsin (the Property), an 18,000 gallon tank and a 30,000 gallon tank.  Propane from the 18,000-gallon tank is used as a backup fuel to natural gas for on-site heating, boiler operation, and drying of skim milk and buttermilk at the dairy facility.  Foremost Farms originally completed a Risk Management Program for this process, but then did not file the Risk Management Plan because propane and other flammable fuels were given a temporary stay of the effectiveness of the RMP Rule.  This fuel use then qualified for the \"use as a fuel\" exemption issued under the Chemical Safety Information, Site Security and Fuels Regulatory Relief Act and is not subject to 40 CFR 68.  This exemption is explained in the March 13, 2000 Federal Register.  Therefore, the original RMP was not submitted.\n\nThe other propane tank (30,000-gallon) located at the Property is leased to a propane distributor. The 30,000-gallon propane tank at the Property is used for storage and subsequent distribution to retail customers.  The 30,000 gallon propane vessel is also used for filling propane cylinders for propane-fueled forkliflts at the Foremost Farms dairy plant.  Foremost Farms initially thought this tank qualified for the retail use exemption listed in the March 13, 2000 Federal Register.  A recent safety training session brought it to the attention of a Foremost Farms employee that the tank may indeed be subject to 40 CFR 68.  Foremost Farms in turn took steps to update and submit the previously un-filed Risk Management Plan.\n\nThe Risk Management Program consists of five elements: the management system, hazard assessment, prevention program, emergency response, and the risk management plan (RMP) submittal.  The management system at Foremost Farms includes Mr. Tom Mathews, Plant Manager, as having overall responsibility for implementation of the risk management program at the Property.  \n\nThe haza"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23490,
      "SummaryText": "rd assessment included an off-site consequence analysis (OCA) and a summary of the 5-year accident history.  The OCA worst-case release scenario is the loss of the contents of the 30,000-gallon propane vessel at maximum capacity.  The alternative release scenario is a process pipe failure, which could result from one of the following:  liquid propane pipe failure (liquid expansion due to failure of hydrostatic valve); a pullaway and failure of the breakaway device; collision; or corrosion.  Given the safety precautions at the Property and that the propane system meets current National Fire Protection Association (NFPA) design code and standards for propane facilities (NFPA 58), both releases are unlikely.  If a release occurred, however, the alternative scenario would be more likely.  Both releases were modeled with EPA's RMP Comp software(version 1.04) and Propane Guidances.  Both the worst case and alternative releases result in off-site impacts.  \n\nThere have not been any accidents within the last five years that resulted in deaths, injuries, property damage, or environmental damage.  As mentioned above, releases from the system are unlikely. The prevention program is regulated under the Program 2 requirements of 40 CFR Part 68.  These prevention program elements are safety information, process hazard review, operating procedures, training, maintenance, compliance audits, and incident investigation. \n\nSafety information regarding propane was collected and is maintained in the Risk Management Program Manual.  In 1999 a hazard review was conducted by the lessee who gave several recommendations based on the hazard review which are outlined in the Risk Management Program Manual.  These recommendations and component replacements were subsequently implemented and installed.  The system is in compliance with NFPA 58.  The lessee has corporate standard operating procedures (SOPs) and a training program for the storage vessel loading and unloading activities they conduct "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23490,
      "SummaryText": "at the facility.\n\nForemost Farms has developed an Emergency Response Program and they will coordinate with a local emergency planning and response agency, the Reedsburg Fire Department."
    }
  ]
}