{
  "FacilityID": 23497,
  "FacilityName": "Alliant Foodservice-Denver",
  "FacilityStr1": "11955 E. Peakview Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Englewood",
  "FacilityState": "CO",
  "FacilityZipCode": "80111",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08005",
  "LEPC": "Arapahoe County LEPC",
  "FacilityLatDecDegs": "39.598722",
  "FacilityLongDecDegs": "-104.849556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "FC",
  "FacilityURL": "www.alliantfs.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Alliant Foodservice, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Alliant Foodservice, In.",
  "OperatorStr1": "One Parkway North",
  "OperatorStr2": null,
  "OperatorCity": "Deerfield",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60015",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tim Kelly",
  "RMPTitle": "VP of Logistics",
  "FTE": 500,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000154744",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-28 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-05-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-05-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-05-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-05-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 39.59667,
  "FRS_Long": -104.84931,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 33488,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 23497,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 34331,
          "ProcessID": 33488,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 43865,
          "ProcessID": 33488,
          "ChemicalID": 56,
          "Quantity": 11500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 543865,
          "ProcessID": 33488,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23497,
      "SummaryText": "                         ALLIANT FOODSERVICE, INC.\n\n                          RISK MANAGEMENT PROGRAM\n                                                     EXECUTIVE SUMMARY\n\n1.  General accidental release and prevention policy of Alliant Foodservice.\n\nIn this frozen food distribution center we utilize anhydrous ammonia as a refrigerant.  Anhydrous\nammonia is considered hazardous by the Environmental Protection Agency. The same properties\nthat make ammonia a valuable refrigerant also makes it necessary to observe certain safety\nprecautions during it's use to prevent exposure to our workers, the surrounding community and\nthe environment.  \nIt is our policy at Alliant Foodservice to implement the requirements of the Risk Management\nProgram by managing and operating this facility in full compliance with all applicable federal and\nstate regulations that we are governed by. The objective is to minimize the risk of an accidental\nrelease of hazardous materials. Safety depends directly on our proper handling of ammonia. Our\nplant personnel have been trained on the equipment operating procedures and the various safety\ndevices that are incorporated in our facility to prevent the possibility of accidental releases.\n\n2.  Stationary source and regulated substance handled.\n\nAlliant Foodservice, 11955 E. Peakview Avenue, Englewood, Colorado operates a refrigeration\nsystem utilizing anhydrous ammonia as the primary refrigerant. Mechanical refrigeration is a\nthermodynamic process where the refrigerant, ammonia, is used as a heat exchanging fluid to\nmaintain a desired temperature in an enclosed environment. The refrigeration cycle consists of\nevaporation, compression, condensation and expansion. Evaporation and condensation are\ndesigned to alter the quantity of energy associated with the refrigerant. Compression and\nexpansion are designed to change the availability of the associated energy. The refrigeration cycle\nis a closed loop process. The ammonia cycle utilizes fluid temperature,"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23497,
      "SummaryText": " pressure and latent heat of\nvaporization for cooling. The refrigeration system uses this phenomenon to remove heat from a\ndesired space, and then to discard that heat through condensation, to an area where it is of no\nconsequence.\n\nThe Alliant Foodservice facility uses ammonia refrigeration to maintain storage room\ntemperatures for various types of fresh and frozen food distributed to their customers. The\nrefrigeration system contains the following equipment: Five screw compressors, two evaporative\ncondensers, one high pressure receiver, one low pressure receiver, one intercooler, one\nthermosyphon tank, forty seven cooler/freezer evaporators, a floor warming heat exchanger and a\nsystem purger. The refrigeration system contains 11,500 pounds of aggregate ammonia.\n\nThere are approximately 500 employees at this facility which includes hourly and salary personnel. \nThis distribution facility receives and prepares shipment of frozen and refrigerated food products\nvia tractor trailers approximately 24 hours a day, six days a week.  \n\n\nThe potential hazards that could lead to an accidental release of the ammonia include, but are not\nlimited to, equipment failure, damage to piping, damage to equipment, human error, etc.\n \nAlthough ammonia is a colorless, tasteless liquid, it's dominant characteristic is it's pungent,\ndistinct odor.  Persons exposed to ammonia will not voluntarily stay in areas of even small\nconcentrations, although these levels would not normally result in any health risks. Risks from\naccidental exposure to ammonia in a vapor state are irritations to the eyes, nose and throat. The\nextent of irritation depends on the exposure amount and length of time exposed.  \nAmmonia is classified non-flammable by the Department of Transportation.  Ammonia will burn,\nbut only in a very narrow concentration level when accompanied with a constant ignition source.\n\n3. Worst case  and alternate case release scenarios including administrative and\nengineering controls to limit"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23497,
      "SummaryText": "/ prevent accidental release.\n\nWorst case scenario depicts continuous source leak from the Ammonia Dump Receiver located outside the plant machine room.  This vessels emergency operating level is 9,200 pounds of\nliquid ammonia,  approximately 80% of it's total capacity. Although the  receiver is\ncapable of holding 11,500 pounds, this exceeds engineering controls which limit the liquid level to\na maximum of 80% at any time.  Considering the \"catastrophic\" possibility does exist for this\nvessel to release it's entire contents, engineering controls incorporated into the system would\nnormally prevent such a release.\n\n     \nAlternate release scenario is represented by the release of ammonia liquid from a pipe due to a rupture in the compressor room.\n\n     \n     The following administrative and engineering controls are in place at Alliant\nFoodservice. These controls are designed to eliminate, or reduce the possibilities of an\naccidental release from the refrigeration system.\n    \n         \n     *  High level switches are configured to high and low pressure receivers and the \nintercooler. High level switches will shut down compressor operation during a high level\ncondition.\n\n     * All compressors are configured with critical safety controls (high pressure, low pressure,\nhigh oil temp cut-outs, etc.) to shut down the respective compressor in the event of an abnormal\noperating condition.\n \n     *  Safety Relief Valves are configured to all pressure vessels, condensers and compressor\noil separators to eliminate over pressurization conditions in those associated pieces of equipment.\n\n     *  Emergency \"kill\" buttons are installed by the machine room exit doors to enable system\nshutdown from outside the room in the event of an emergency involving the ammonia system.\n\n     *  Entire facility is configured with a keyed switch for access by the Fire Department only.\nWhen activated by the Fire Department in an emergency situation the switch shuts down the\nentire refrigeration syst"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23497,
      "SummaryText": "em.\n\n     *  Periodic Maintenance Program is contracted through a reputable refrigeration company\nto ensure the refrigeration system and it's components are kept in optimum mechanical and\noperating status. Weekly inspections are conducted by the refrigeration contractor. Daily rounds\nare made by plant personnel to verify proper equipment operation.\n\n\n\n4.  Five-year accident history.\n\nThe Alliant Foodservice, Inc. facility at Denver has had zero accidental releases to report. \n\n5.   Emergency Response Program\n\nThe purpose of the Alliant Foodservice Emergency Action Plan is to:\n\n     1.   Minimize exposure to our employees and the surrounding community in the event of a\n     hazardous material release or spill.\n\n     2.  Assure the safe emergency evacuation of the plant in the instance that it is required.\n\n     3.  Provide for prompt medical attention to any employees who become seriously injured\n     or ill at work.\n\n     4.  Facility management has developed an Emergency Response Plan to ensure a fast and   \n           efficient response in the event of an accidental release of hazardous materials. \n\nOur Emergency Action Plan currently meets requirements as set forth in OSHA 29 CFR 1910.38,\nEmployee Emergency and Fire Prevention Plans.  \n\nPlanned upgrades include the installation of a new ammonia leak detector system."
    }
  ]
}