{
  "FacilityID": 23558,
  "FacilityName": "Wabash Alloys, L.L.C.",
  "FacilityStr1": "1118 Vulcan Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Benton",
  "FacilityState": "AR",
  "FacilityZipCode": "72018",
  "Facility4DigitZipExt": "0909",
  "FacilityCountyFIPS": "05125",
  "LEPC": "Saline County Off. of Emer Svc",
  "FacilityLatDecDegs": "34.515556",
  "FacilityLongDecDegs": "-92.635833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A5",
  "LatLongDescription": "PP",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 2468606,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Wabash Alloys, L.L.C.",
  "OperatorStr1": "P.O. Box 909",
  "OperatorStr2": null,
  "OperatorCity": "Benton",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72018",
  "OperatorZipCodeExt": "0909",
  "RMPContact": "Charles Jones",
  "RMPTitle": "Plant Manager",
  "FTE": 72,
  "OtherEPAFacilityID": "72015WBSHLOFFHW",
  "EPAFacilityID": "100000038684",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "139-AR-2",
  "SafetyInspectionDate": "2001-03-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Wabash Alloys, Benton, AR",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-06-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-05-31 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-05-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-06-07 00:00:00",
  "DeRegistrationEffectiveDate": "2002-12-13 00:00:00",
  "AnniversaryDate": "2006-05-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 34.51562,
  "FRS_Long": -92.62742,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 33580,
      "AltID": "Aluminum demagging",
      "FacilityID": 23558,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 34424,
          "ProcessID": 33580,
          "NAICSCode": "331314",
          "_desc": {
            "NAICS_CODE": "331314",
            "NAICS_DESCRIPTION": "Secondary Smelting and Alloying of Aluminum"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 43969,
          "ProcessID": 33580,
          "ChemicalID": 62,
          "Quantity": 228000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 543969,
          "ProcessID": 33580,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23558,
      "SummaryText": "\nThe accidental release prevention and emergency response policies at our facility:\n\nWabash Alloys, L.L.C. (Wabash) is committed to maintaining a safe work environment for our employees, contractors, visitors, the surrounding public and the environment.  Due to the necessity of a timely response associated with a chlorine release, Wabash has committed the resources necessary to respond offensively at each of our facilities.  Wabash has trained HazMat Teams that are able to assess and mitigate a chlorine release in minutes.  In addition, our facilities regularly meet with outside responders, local fire departments, and local emergency planning committees in order to establish emergency response procedures necessary to protect our surrounding public and the environment.\n\nOur facility and the regulated substances handled:\n\nThe Wabash facility in Benton, Arkansas produces recycled secondary specification aluminum alloys.  The Wabash facility has a Program 3 covered process due to the onsite storage and use of chlorine.  Chlorine is used at the facility to remove magnesium from molten aluminum.\n\nThe worst-case release scenario and the alternative release scenario:\n\nOne worst-case release scenario was modeled for the chlorine covered process using USEPA's offsite consequence analysis guidance document, \"Risk Management Program Guidance for Wastewater Treatment Plants\", dated May 2000.  USEPA requires that the entire contents of the largest vessel be used for the worst-case release scenario.  This scenario is highly unlikely and has never occurred at our facility.  There were no administrative controls or passive mitigation systems that would reduce the quantity released or limit the release rate taken into consideration when modeling this scenario.  The worst-case release scenario for chlorine potentially has an offsite impact.\n\nOne alternative release scenario was modeled for the chlorine covered process using the same guidance document as stated above.  Per USEPA guidan"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23558,
      "SummaryText": "ce, the alternative release scenario is intended to be a more reasonable or likely event than the worst-case release scenario, however, it is still very conservative in nature.  The alternative release scenario modeled was a complete one-inch line or hose break.  The event modeled has never occurred at our facility.  This event was chosen based on the impact distance compared to other postulated scenarios that would have a much smaller impact distance or none at all.  The rail car is equipped with an excess flow valve, which is an active mitigation measure and would limit the flow of chlorine, given a line break.  There were no passive mitigation measures taken into consideration in the alternative release analysis.  The alternative release analysis does have the potential for offsite impacts.\n\nThe general accidental release prevention program and chemical-specific prevention steps:\n\nThis facility is covered by both USEPA's Risk Management Program rule, as well as, OSHA's Process Safety Management Rule for the chlorine covered process.  This facility implements one combined Process Safety and Risk Management Program.  This program consists of a written management system that complies with both USEPA's and OSHA's requirements.  The backbone of the program is the Management of Change Procedure.  This procedure enables the facility to initiate and complete process changes associated with the chlorine system while maintaining the Process Safety and Risk Management Program requirements at the facility.  \n\nBoth the worst-case and alternative release scenarios were modeled based on equipment failure, therefore the mechanical integrity element of the program is key in preventing releases from the chlorine process.  This facility utilizes a computerized maintenance management system (CMMS) to implement the preventative maintenance, testing and inspection of the chlorine system.  The CMMS supports the routine preventative maintenance program, which in combination with Wabash'"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23558,
      "SummaryText": "s employee and contractor training programs provides ongoing assurance that the chlorine system is operated in a safe manner.\n\nThe five year accident history:\n\nThis facility has not experienced any accidental reportable releases of chlorine in the past five years.\n \nThe emergency response program:\n\nOur employees are trained and equipped to offensively respond to releases of chlorine.  The HazMat Team routinely undergoes training and participates in drills with the local fire department.  The plant has coordinated emergency response procedures with the Saline County Emergency Management Agency.  In the event of a release which could result on an offsite impact, the Saline County Emergency Management Agency will be contacted to alert the general public.\n\nPlanned changes to improve safety:\n\nWabash has reviewed employee training programs and operating procedures and has made changes as necessary to increase safety awareness among our employees.  The facility will continue to make improvements as identified through our employee participation and internal auditing programs."
    }
  ]
}