{
  "FacilityID": 23785,
  "FacilityName": "CHEM FLEUR",
  "FacilityStr1": "150 FIRMENICH WAY",
  "FacilityStr2": null,
  "FacilityCity": "NEWARK",
  "FacilityState": "NJ",
  "FacilityZipCode": "07114",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34013",
  "LEPC": "City of Newark LEPC",
  "FacilityLatDecDegs": "40.701222",
  "FacilityLongDecDegs": "-74.128806",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.firmenich.com",
  "FacilityEmailAddress": "charles.decker@firmenich.com",
  "FacilityDUNS": 2144673,
  "ParentCompanyName": "FIRMENICH, INC.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "FIRMENICH, INC.",
  "OperatorStr1": "150 FIRMENICH WAY",
  "OperatorStr2": null,
  "OperatorCity": "NEWARK",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07114",
  "OperatorZipCodeExt": null,
  "FTE": 130,
  "OtherEPAFacilityID": "19787",
  "EPAFacilityID": "100000176052",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-12-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-05-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-05-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-06-22 00:00:00",
  "DeRegistrationEffectiveDate": "2006-05-01 00:00:00",
  "AnniversaryDate": "2006-05-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 40.70009,
  "FRS_Long": -74.13144,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 33930,
      "AltID": "DDD",
      "FacilityID": 23785,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 44407,
          "ProcessID": 33930,
          "ChemicalID": 131,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 34782,
          "ProcessID": 33930,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 19122,
              "Process_NAICS_ID": 34782,
              "SafetyReviewDate": "2001-05-01 00:00:00",
              "PHA_Date": "2000-12-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-12-31 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "LEL Detectors in Sumps",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-12-01 00:00:00",
              "TrainingReviewDate": "2001-04-27 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Process Overview",
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-04-01 00:00:00",
              "EquipmentInspectionDate": "2001-05-18 00:00:00",
              "EquipmentTested": "Reactor Interlocks",
              "ChangeMgmtDate": "2001-04-27 00:00:00",
              "ChangeMgmtReviewDate": "2001-02-01 00:00:00",
              "PreStartupReviewDate": "2001-05-21 00:00:00",
              "ComplianceAuditDate": "2000-07-15 00:00:00",
              "AuditCompletionDate": "2001-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-12-19 00:00:00",
              "HotWorkPermitReviewDate": "2000-09-01 00:00:00",
              "ContractorSafetyReviewDate": "1994-10-01 00:00:00",
              "ContractorSafetyEvalDate": "2001-04-27 00:00:00",
              "CBI_Flag": 0,
              "Description": "Process Safety management for this process is handled under OSHA PSM",
              "_chemicals": [
                {
                  "PrimaryKey": 27787,
                  "PreventionProgram3ID": 19122,
                  "ProcessChemicalID": 44407
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 23785,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2001-05-01 00:00:00",
    "ERTrainingDate": "2000-11-01 00:00:00",
    "CoordinatingAgencyName": "Newark Fire Department",
    "CoordinatingAgencyPhone": "9737337506",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23785,
      "SummaryText": "\n\n\nChem Fleur RMP Executive Summary\n\n\n\nThe Chem Fleur. Firchem Chemical Manufacturing Center is located on an \n\napproximately 18 acre industrial site in a secluded area of Port Newark.  The location is \n\nbounded to the East by Newark Bay, on the South by marshlands and the New Jersey \n\nTurnpike, to the West by an over the road trucking company terminal, and to the North \n\nby a CONRAIL railhead and new car storage facilities.\n\n\n\nThe Firchem Chemical Manufacturing Center produces a variety of specialty chemicals \n\nfor the Flavor & Fragrance industry.  A number of our products are manufactured \n\nthrough chemical processes regulated under the OSHA Process Safety Management rule \n\n(OSHA 1910.119).  One of these processes is also regulated under the EPA Risk \n\nManagement Program.  The facility must also comply with other federal, state, and local \n\nsafety and environmental regulations, as well as internal company standards.  We conduct \n\nour business with the highest priority on the safety and health of our employees, \n\ncustomers, and the general public, as well as on the protection of the environment.  \n\n\n\nThe site is regulated under the USEPA RMP rules for use of one flammable liquified \n\npetroleum gas (LPG) material Isobutylene (2-Methylpropene or [-Propene, 2-methyl-] \n\nCAS #115-11-7).  Isobutylene is used in one process known as \"DDD\".  The isobutylene \n\nis used as a reactant in the DDD manufacturing process.  The isobutylene is purchased \n\nfrom ExxonMobil and received and stored on-site in an industry standard transportation \n\nLPG trailer designed and operated to comply with all US Department of Transportation \n\n(DOT) safety regulations and specifications.  The material is onsite for about 4 weeks or \n\nabout 8% of the year.\n\n\n\nThe storage tank is located in an isolated area of the plant and in plant structures \n\nincluding a 500,000-gallon firewater tank, and three process buildings 55 feet high \n\nprovide a substantial buffer between the storage area and the plant fe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23785,
      "SummaryText": "nceline on three \n\nsides.  To the rear there is approximately one thousand feet of undeveloped land to the \n\nshore of Newark Bay.  Catastrophic failure of the tank due to physical impact or \n\nimpingement by fire are the two primary worst-case loss scenarios.  All chemical \n\nprocessing facilities in the area of the isobutylene tank are protected by automatic \n\nsprinkler or deluge systems, and a high pressure water cannon is in the immediate \n\nvicinity of the isobutylene tank holding area.   The tank is protected by controlling traffic \n\nin the area and by the use of concrete jersey barriers, which are ringed around the tank.\n\n\n\nThe Newark Fire Department is a paid force specializing in industrial facilities.  The \n\ntypical response time for fires in the area is about 5 to 10 minutes.\n\n\n\nThe facility's process safety management program is organized in a manner consistent \n\nwith the OSHA PSM rule.  The accident prevention program requirements of RMP \n\nclosely follow the programs in place to comply with PSM.  These programs help to \n\nensure the safe operation and maintenance of our chemical processes, and prevent and \n\nmitigate potential accidents involving regulated and other hazardous chemicals.  Key \n\nfeatures of the Firchem accident prevention program are described below.\n\n\n\nProcess Safety information of all types is gathered and retained in designated locations.  \n\nExamples include MSDS's, in-house reactivity and stability data, chemical compatibility \n\nmatrices, process chemistry and hazards, P&ID's, electrical classification, equipment \n\ndrawings and specifications, and interlock descriptions.  This information is made \n\navailable for process hazard analyses and for the development of other process safety \n\nelements.  \n\n\n\nProcess hazard analyses (PHA's) are conducted on both PSM regulated and non-\n\nregulated processes, with the level of detail commensurate with the hazards.  PHA's \n\nutilize both HAZOP and What-if techniques.  Multidisciplinary PHA teams are \n\nass"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23785,
      "SummaryText": "embled, including a trained team leader, engineering, research & development, \n\nproduction supervision and production operators.  A tracking system for \n\nrecommendations is used to ensure recommendations are addressed.  Revalidations are \n\ninitiated at intervals of five years or less.\n\n\n\nBatch procedures are used extensively by operators as step-by-step instructions in the \n\nregulated multi-purpose batch processes.  These procedures are carefully developed from \n\npertinent process safety information.  Where possible, sophisticated computer \n\nprogramming is applied to run the operations, which improves process reliability, quality, \n\nand safety.  This allows production personnel to focus on troubleshooting and other \n\nhigher level tasks.\n\n\n\nPersonnel operating chemical processes have been trained in their job tasks and \n\nresponsibilities by working side-by-side with more experienced operators, use of outside \n\ntraining materials, and consultation with supervisory personnel.  Supervision evaluates \n\nthe performance of employees to determine when they are prepared to operate \n\nindependently.  Safe work practices, such as equipment release, lockout/tagout, confined \n\nspace entry, have been developed.  These are occasionally reviewed and updated as \n\nneeded. \n\n\n\nA fully qualified maintenance staff performs repairs and inspections on equipment and \n\ninstrumentation used in regulated chemical processes, using manufacturers' or internal \n\nprocedures.  Where specialized skills or certifications are needed, appropriate outside \n\ncrafts are used.  A system has been developed to define PSM-critical equipment, to \n\nensure designated equipment is maintained at the highest integrity level.  A computerized \n\nmaintenance system has been installed to manage maintenance activities and records \n\nretention.\n\n\n\nFirchem has instituted a management of change procedure to ensure changes to \n\nequipment, procedures, etc. are evaluated for safety implications, properly authorized and \n\ndocumen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23785,
      "SummaryText": "ted.  Affected personnel review  documentation of process changes that affect \n\ntheir work area.  The procedure has mechanisms to ensure that process safety information \n\naffected by a process change is properly updated. \n\n\n\nPre-startup safety reviews are conducted on new and modification projects to ensure that \n\nthese projects are constructed per design and safe to operate.   \n\n\n\nCompliance auditing of Firchem's process safety management programs is performed at \n\nleast every three years.  Recommendations arising from the audit and their resolutions are \n\ndocumented and retained, as specified.\n\n\n\nFirchem has a procedure in place to investigate all accidents resulting in injury and \n\nincidents with serious potential consequences.  Several employees have been trained in \n\nincident investigation, and these people are used as investigation team leaders.  \n\nInvestigations are designed to identify root causes of incidents, and recommendations to \n\nprevent recurrence.  Written reports are prepared and distributed for review by affected \n\npersonnel, and recommendations monitored until completed.\n\n\n\nEmployee participation is addressed in several ways.  First-line production employees are \n\nrequired participants in process hazard analyses of regulated processes, and they are also \n\npresent in most non-regulated PHA's.  Employees are also encouraged to participate in \n\noperator training, safety committee, review of batch operating procedures, and in the \n\ndevelopment of other elements of the process safety program.\n\n\n\nThe facility has established procedures and permits to manage hot work.\n\n\n\nFirchem uses a variety of outside contractors, and selects contractors based on a variety \n\nof characteristics including cost, reliability, quality, and safe work.  Employee contacts \n\ncoordinate contractor training, including potential hazards and emergency evacuation \n\nprocedures.\n\n\n\nOur facility has experienced substantial growth over the last few years, and with that \n\ngrowth has mad"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 23785,
      "SummaryText": "e significant efforts to further enhance the safe manufacture of our \n\nproducts.  Our commitment is to continue to work towards improving our operations and \n\nprograms, to ensure our products continue to be manufactured safely and reliably, and to \n\nprotect our employees, community, and environment.\n\n\n\n"
    }
  ]
}