{
  "FacilityID": 23813,
  "FacilityName": "Noveon, Inc. Pedricktown Plant",
  "FacilityStr1": "76 Porcupine Road",
  "FacilityStr2": null,
  "FacilityCity": "Pedricktown",
  "FacilityState": "NJ",
  "FacilityZipCode": "08067",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34033",
  "LEPC": "Oldmans Township OEM",
  "FacilityLatDecDegs": "39.765278",
  "FacilityLongDecDegs": "-75.421667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 48585269,
  "ParentCompanyName": "Noveon, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 12376732,
  "Company2DUNS": 0,
  "OperatorName": "Noveon, Inc.",
  "OperatorStr1": "76 Porcupine Road",
  "OperatorStr2": null,
  "OperatorCity": "Pedricktown",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08067",
  "OperatorZipCodeExt": null,
  "FTE": 42,
  "OtherEPAFacilityID": "08067THBFGUSROU",
  "EPAFacilityID": "100000132126",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-02-20 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "NJ RMP version, BFG, 6/18/99",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-07-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-07-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-07-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 39.76941,
  "FRS_Long": -75.42145,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 33965,
      "AltID": "Acrylic latex",
      "FacilityID": 23813,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 44453,
          "ProcessID": 33965,
          "ChemicalID": 25,
          "Quantity": 370000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 34819,
          "ProcessID": 33965,
          "NAICSCode": "32599",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 19159,
              "Process_NAICS_ID": 34819,
              "SafetyReviewDate": "1999-04-20 00:00:00",
              "PHA_Date": "1999-04-20 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "thermal oxidizer",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "fire/vapor foam, process computer",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "computerized process parameters",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "auto bottom valve",
              "OpProceduresReviewDate": "2000-09-25 00:00:00",
              "TrainingReviewDate": "2000-02-20 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-01-24 00:00:00",
              "EquipmentInspectionDate": "2001-05-25 00:00:00",
              "EquipmentTested": "Inspect Monomer Unloading Hoses",
              "ChangeMgmtDate": "2000-08-09 00:00:00",
              "ChangeMgmtReviewDate": "1996-04-15 00:00:00",
              "PreStartupReviewDate": "2000-08-09 00:00:00",
              "ComplianceAuditDate": "2001-02-20 00:00:00",
              "AuditCompletionDate": "2002-01-01 00:00:00",
              "IncidentInvestigationDate": "2000-02-08 00:00:00",
              "InvestigationChangeDate": "2000-02-08 00:00:00",
              "ParticipationPlansReviewDate": "1999-02-03 00:00:00",
              "HotWorkPermitReviewDate": "1999-02-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-01 00:00:00",
              "ContractorSafetyEvalDate": "2000-03-06 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 27841,
                  "PreventionProgram3ID": 19159,
                  "ProcessChemicalID": 44453
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 23813,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2001-05-01 00:00:00",
    "ERTrainingDate": "2001-06-28 00:00:00",
    "CoordinatingAgencyName": "Salem County OEM",
    "CoordinatingAgencyPhone": "8567692959",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "NJ TCPA"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23813,
      "SummaryText": "REVISED RMP EXECUTIVE SUMMARY:\nNOVEON PEDRICKTOWN NJ PLANT\n\nThe Stationary Source and Regulated Substances Handled: acrylonitrile\n\nThe Noveon, Inc. Plant in Pedricktown NJ is a specialty chemical manufacturing plant located in Salem County in south western New Jersey, two miles from the center of the rural town of Pedricktown.  It is a 7-acre tract enclosed in a larger chemical facility, developed by BFGoodrich and now shared by Noveon, PolyOne Corp. and Oxy Vinyl LP.  We manufacture more than 60 acrylic latex emulsions.\n\nAcrylic latex emulsion is a non-toxic, water-based dispersion of rubber.  It is used, as a coating or an adhesive, in a wide variety of industries including paper, nonwovens, textiles, and industrial coatings or paints.  In many cases, it has been used to replace a solvent based adhesive or coating, with the net result being a reduction in solvent emissions at our customer's plants\n\nWe have 42 employees with an annual payroll of $2.5 million, paying about $100,000 in taxes annually.  Each year, we buy about $2 million in goods and services, mainly from local suppliers, and pay about $500,000 for utilities and $5 million for freight services.\n\nOur plant uses acrylonitrile as a raw material, which brings us under the EPA Risk Management Program (RMP) Rule. Acrylonitrile is a toxic chemical, listed under the RMP Rule.  The types of programs recently required by the RMP to prevent serious accidents and to plan emergency contingencies have long been in place at the Noveon plant.  We have long understood the relationship between good safety and good business, as reflected by our exemplary and frequently awarded safety performance.  Nevertheless, we welcome the EPA's RMP initiative and see it as an opportunity to continue and expand the dialog with our community.\n\nThe accidental release prevention program and emergency response policies at the stationary source\n\nIt is the policy of the Noveon Pedricktown plant to meet and often exceed requirements establi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23813,
      "SummaryText": "shed by applicable safety, health and environmental regulations promulgated by Federal and state agencies.  Our safety policies and practices have historically preceded the regulation of such practices under, for example, the OSHA Process Safety Management Standard and the EPA Risk Management Program Rule.  In New Jersey, the Toxic Catastrophe Prevention Act (TCPA) has been in place since 1987.  This regulation has mandated most of the requirements of RMP and has included an annual safety audit by the process safety engineers of the New Jersey Department of Environmental Protection.  Our policy is to maintain to a practical minimum the potential for harm to on-site employees and contractors, the public, and the environment, and to have in place contingency actions, coordinated with local responding agencies, for the unlikely event of a serious accidental chemical release.\n\nAnother safety-related program in which we participate is Responsible Care? under the American Chemistry Council, and we are certified under the ISO-9000 international quality standard.\n\nThe general accidental release prevention program and chemical-specific prevention steps\n\nThe Noveon plant has in place a thorough, ongoing program of process safety management (PSM).  This program calls for implementation and maintenance of procedural and engineered safeguards at the plant to minimize the likelihood of a significant release of a hazardous chemical, and to eliminate or reduce the effects of any release that might occur.  We have invested and continue to invest substantial effort and capital in maintaining our strong safety performance.  Some recent examples of our investments include:\n\n\n? Installation of concrete containment dikes around storage tanks, pumps and unloading stations to protect the ground against spills, at a cost of $530,000\n? Storage tank inspections, and upgrades such as remote actuated bottom valves, sensors, etc. at a cost of $164,000\n? Upgrade of chemical fittings and connectio"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23813,
      "SummaryText": "ns to dripless fittings, at a cost of $30,000\n\n\nWe are involved in day-to-day safety-focused activities under our program that includes elements such as:\n\n(1) Process Hazard Analyses - we routinely perform and maintain up to date, systematic and thorough studies of our operations to identify what could go wrong, identify means of eliminating or reducing design or procedural weaknesses, and implementing improvements.\n\n(2) Process Design - our processes and equipment are designed for safety in accordance with applicable industry standards and best engineering practices.  Designs include, as appropriate, automatic emergency shutdown systems, pressure relief devices, ventilation systems, and release sensoring systems.  Most of our process is computer-controlled (with operator back-up) which includes internal checks for abnormal conditions, emergency shutdowns, and alarm systems.  Our storage vessels, which contain the minimum inventory of hazardous chemicals, are all contained in concrete dikes.\n\n(3) Training - our operations and maintenance personnel are trained thoroughly on their job tasks, on safe work practices as they apply to their jobs, and emergency contingency actions, before they may operate or maintain equipment.  They also receive refresher training periodically.  Certified technicians receive annual refresher training on all procedures for acrylonitrile handling and processing.  Our procedures for operating and maintaining processes, general safe work practices, and emergency response, are fully documented and maintained up to date in light of any changes at the plant.  Technicians are tested on their knowledge of the procedures.\n\n(4) Maintenance - each item of equipment at our plant that is involved in maintaining safety or in responding to an abnormal situation is inspected, tested and/or maintained on a frequency that reflects its service and condition.\n\n(5) Management of Change - no change to equipment or procedural practices can take place at the plan"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23813,
      "SummaryText": "t without a thorough review of the implications of that change to safety.  Changes must not adversely impact the safety built into the design and operations of our processes.\n\n\nOur PSM program is tuned to reflect the specific hazards of the chemicals we use.  For example, our operating, maintenance, safe work, and emergency procedures address personal protective equipment appropriate to the chemicals being handled.  Also, equipment is selected based on its intended service and chemical exposures.\n\nThe five-year accident history\n\nWe have had no events at the Noveon Pedricktown plant that would qualify for inclusion in the RMP 5-year accident history.  There has been no offsite impact caused by acrylonitrile in the 30 year history of the facility.\n\nThe emergency response program\n\nWe have in place a written emergency response plan that we coordinate with the Oldmans Township LEPC, the Pedricktown and Auburn Volunteer Fire Departments, and other local responders.  New personnel are trained on the plan.  We conduct refresher training annually, and we train on any revisions to the plan.  The plan is in compliance with the RMP requirements, as well as other applicable EPA and OSHA requirements.  The plant fire brigade is maintained in conjunction with the site's other chemical companies, PolyOne Corp. and Oxy Vinyl LP.\n\n\n\nPlanned changes to improve safety\n\nOur safety program is ongoing, involving constant identification and implementation of incremental safety improvements.  For any accident scenario with potential offsite impact, the TCPA regulation requires that the process be maintained at state-of-the-art.\n\nThe worst-case release scenarios and the alternative release scenarios\n\nThe RMP provides a detailed prescription for what should be considered a worst case scenario (WCS).  The worst case scenario for acrylonitrile is the spontaneous, catastrophic release of all the contents of the 30,000 gallon storage tank.  This spill would be contained in the concrete lined dike"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 23813,
      "SummaryText": " around the storage tank.  Based on use of the EPA Offsite Consequence Analysis Guidance, this scenario calculates to have offsite impacts.  More credible scenarios, called alternative release scenarios (ARSs), were also analyzed.\n\nAlternate release scenarios were first calculated for the Pedricktown plant in 1987 because of the TCPA regulation.  In 1999 additional alternate release scenarios were studied.  As required by the RMP Rule, we chose a hypothetical ARS that is severe enough to have an effect beyond our fenceline.  The selected ARS involves a flange leak within the process building, on the pipeline that charges acrylonitrile to the process.  Partial to complete loss of the gasket was considered.  A loss of 21000 pounds of material was used.  This operation is computer monitored and the building is constantly manned.  When the leak reduces the flowrate below the rate programmed in the computer, the operation is alarmed and shut down.  The floor drains of the building are piped to an enclosed sump that has its airspace evacuated to a thermal oxidizer.  Using the EPA guideline lookup tables, the endpoint would reach the nearest public receptor.  When the process building ventilation is shut off to help contain any vapors, the toxic endpoint is reduced to only on site.\n\nWe expect scenarios such as these ARSs to continue to be highly hypothetical and unlikely due to our ongoing program of process safety.  We take pride in our safety programs and safety performance, which have been recognized by numerous awards including the New Jersey Governors award."
    }
  ]
}