{
  "FacilityID": 23815,
  "FacilityName": "Texon L.P. Propane Terminal",
  "FacilityStr1": "1282 South 8th Street",
  "FacilityStr2": null,
  "FacilityCity": "West Memphis",
  "FacilityState": "AR",
  "FacilityZipCode": "72301",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05035",
  "LEPC": "Crittenden County LEPC",
  "FacilityLatDecDegs": "35.1325",
  "FacilityLongDecDegs": "-90.173333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.texonlp.com",
  "FacilityEmailAddress": "wmemphis@texonlp.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Texon Distributing L.P.",
  "Company2Name": null,
  "CompanyDUNS": 602468969,
  "Company2DUNS": 602468969,
  "OperatorName": "Terry Looper",
  "OperatorStr1": "11757 Katy Freeway",
  "OperatorStr2": "Suite 1400",
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77079",
  "OperatorZipCodeExt": "1726",
  "RMPContact": "Mike Fishel",
  "RMPTitle": "General Manager",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000176196",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-04-12 00:00:00",
  "SafetyInspectionBy": "AR LP Gas Board",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-12-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-12-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-12-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 35.12928,
  "FRS_Long": -90.17348,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 33980,
      "AltID": "Propane Terminal",
      "FacilityID": 23815,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 34834,
          "ProcessID": 33980,
          "NAICSCode": "42271",
          "_desc": {
            "NAICS_CODE": "42271",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 44468,
          "ProcessID": 33980,
          "ChemicalID": 98,
          "Quantity": 10533600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 544468,
          "ProcessID": 33980,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23815,
      "SummaryText": "A. Texon L.P. is committed to the safety of its workers, the public and the environment.  Its accidental release policy is an integrated approach, involving employee participation, management practices, written procedures and training.  Texon has created a comprehensive propane accident prevention program considering all aspects of process operation and maintenance.  It has also developed a written emergency action plan and coordinated these efforts with local emergency responders.  In the event of an emergency Texon will contact the local fire department and CHEMTREC (Chemical Transportation Emergency Center).\n\nB. Texon L.P. operates a propane terminal in West Memphis, AR.  Propane is received from a pipeline and by rail and is distributed by truck. There are 45 propane tanks: twenty-two 30,000-gallon, eleven 90,000-gallon and twelve 100,000-gallon tanks.  There are emergency shutdown systems on all LPG equipment at the site.\n\nC. The offsite consequence analysis considers a worst case and an alternative scenario involving a propane release and subsequent vapor cloud explosion. The RMP Rule says the explosion endpoint is 1 psia overpressure. The Risk Management Program Guidance for Propane Storage Facilities was used to determine distances to explosion endpoint for each scenario.\n\nThe worst-case scenario involves the failure of one of the 100,000-gallon tanks holding approximately 370,000 lb. of propane. It assumes all of the propane is released and ignited. No passive mitigation is considered.  A lookup table in the EPA guidance gives a 0.6-mile distance to explosion endpoint.  This clearly extends offsite and there are public receptors within the distance to the endpoint. Texon has many safeguards in place, which make this scenario very unlikely, including an aggressive maintenance and inspection program.  In the event of a fire, emergency water deluge cannons would be activated to cool storage tanks, thus reducing pressure in the vessel.\n\nThe alternative scenario"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23815,
      "SummaryText": " was chosen since it is commonly used for this type of facility.  It involves a propane release from a Multiport 2.5-inch relief valve over a 5-minute period at a rate 863 pounds per minute.  An excess flow check valve is the active mitigation considered in this scenario.  A total of 4,315 pounds of propane is ignited, resulting in a vapor cloud explosion.  This would generate a pressure wave with a minimum 1-psi overpressure extending 0.1 miles. This distance extends past the facility boundary and there are public receptors within it.\n\nD. Texon complies with the Risk Management Program and OSHA Process Safety Management Rules. Taken together, the components its prevention program are designed to ensure that:\n\n- Process equipment is in proper working order\n- Employees are trained in safety and aware of correct operating procedures\n- Changes to the process or personnel do not result in accidents\n- The hazards of the process are identified and addressed.  \n\nIn addition, Texon follows NFPA-58 (National Fire Protection Association) guidelines regarding liquefied petroleum gases, DOT 49CFR Part 107, and SARA Title III.\n\nE. No significant accidental release of propane has occurred at this facility in the past five years.\n\nF. For the purposes of the RMP Rule emergency response provisions, Texon can be considered a non-responding facility.  Texon has implemented an emergency action plan in accordance with the OSHA's Standard 1910.120 and it includes procedures for evacuation, medical care, reporting, critical equipment operation, alarm systems, severe weather and handling small spills.  In addition, Texon is in contact with its LEPC (Crittenden County LEPC) and is included in the community emergency response plan prepared under EPCRA. Texon has compiled a list of emergency contacts and coordinates emergency planning with the local fire department (including a yearly walk-through and training program), since they would be the emergency responders.  \n\nG. Texon has an ongoing "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23815,
      "SummaryText": "commitment to all elements of it risk management program and is always striving to improve safety at the site.  However, there are additional no activities beyond the safety and prevention program underway at this time."
    }
  ]
}