{
  "FacilityID": 23838,
  "FacilityName": "Betances Water Filter Plant",
  "FacilityStr1": "Km. 13.1  Camino Radi",
  "FacilityStr2": null,
  "FacilityCity": "Barrio Llanos",
  "FacilityState": "PR",
  "FacilityZipCode": "00623",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "72023",
  "LEPC": "Mayaguez",
  "FacilityLatDecDegs": "18.033472",
  "FacilityLongDecDegs": "-67.116917",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G6",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Puerto Rico Aqueduct and Sewer Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Compa?ia de Aguas de Puerto Rico",
  "OperatorStr1": "ave. Barbosa 604",
  "OperatorStr2": "PO Box 7066",
  "OperatorCity": "San Juan",
  "OperatorStateFIPS": "PR",
  "OperatorZipCode": "00916",
  "OperatorZipCodeExt": "9960",
  "RMPContact": "Eng. Lucas Diaz",
  "RMPTitle": "Operation Manager",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000176249",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-07-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-07-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-07-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-09-15 00:00:00",
  "DeRegistrationEffectiveDate": "2020-07-01 00:00:00",
  "AnniversaryDate": "2006-07-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 18.03347,
  "FRS_Long": -67.11692,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) STANDARD POSITION (SA ON)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 34013,
      "AltID": "Chrorine injector/storage",
      "FacilityID": 23838,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 34867,
          "ProcessID": 34013,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 44503,
          "ProcessID": 34013,
          "ChemicalID": 62,
          "Quantity": 3000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 544503,
          "ProcessID": 34013,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23838,
      "SummaryText": "Compania de Aguas de Puerto Rico (CAPR) as operator of the Puerto Rico Aqueduct & Sewer Authority (PRASA) system has developed a Risk Management Plan (RMP) for management and prevention of risk associated with the storage and use of chlorine, as regulated toxic substance, at the Betances Water Filtration Plant. The RMP was prepared in compliance with 40 CFR Part 68 and Clear Air Act (CAA) Section system 112(r )(1). The Prevention Program elements build upon the facility's Process Safety Management (PSM) system prepared in compliance with 29 CFR Part 1910.119\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nIt is CAPR's policy to comply with applicable Federal and Local requirements. The chlorination process system at Vieques Arcadia Pump Station uses chlorine, a hazardous toxic substance regulated by EPA, OSHA and PROSHO. Due to the hazardous chraracteristics of chlorine, the Betances Water Filtration Plant observes various safety precautions, in the storage, conveyance and use of it. The safety precautions are necessary to protect employees, contractors and visitors at the plant and the inmediately sorrounding areas. Safety precautions, include procedures and equipment to minimize the potential of accident release, as well as a written emergency response plan for response to any chlorine release that may occur.\n\nTHE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\nChlorine is delivered to the facility via truck in 2000 pounds containers. The storage has space for up to 6 full containers, a total of 12,000 pounds of chlorine. Chlorine cylinders are connected to vacuum chlorinators. The chlorinators regulate the chlorine use. From chlorinators, chlorine gas is distributed under vacuum to injectors. The injectors combine the gaseous chlorine with water. The chlorinator water is mixed with the water flow for disinfection.\n\nWORST-CASE AND ALTERNATIVE RELEASE SCENARIOS\nThe worst-case release scenario was determined following EPA's Risk Management Program "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23838,
      "SummaryText": "Offsite Consequence Analysis Guidence. The worst-case release scenario is a vapor release ot the content of a 2000 pound container over 10 minutes period (200 pounds of chlorine per minute). Other worst-case assumptions required by EPA include low wind speed (1.5 meters per second), stable atmosphere (class F), rural topography, and no active mitigation of the release. The storage room enclosure would provide passive mitigation of the release.\n\nEPA requires the determination of the area (zone of vulnerability) which may be exposed to a chlorine concentration of 3 ppm or greater. According to the American Industrial Hygiene Association, 3 ppm is the maximum concentration of chlorine in air below which nearly all people could be exposed for one hour without serious health effects. Based on the would-case assumptions, the zone of vulnerability was determinated to extend 3.0 miles from the chlorine storage area.\n\nApproximately 8,000 residents are located within a 3 miles radius. Many of these residents would not actually be imparted in even a worst case release, as the chlorine would travel in the direction of wind. No know environmental reseptors (such as state park or officially designated wildlife preserve) are located within the zone of vulnerability. The conditions and paramenters for the worst-case scenario are specified by EPA.\n\nA more realistic alternative release scenario was examinated, also following EPA's Risk Management Program Offsite Consequence Analysis Guidance. The alternative release scenario is a vapor release of the entire content of a 2000 pounds container through a broken 3/8 inch flexible connector tube. If the container was nor shut off, the content would be release over a 95 minutes period (21 pound of chlorine per minute). More typical weather conditions are used (wind speed of 3.0 meter per second, atmospheric stability Class D). Others conditions remain the same as the worst-case scenario (rural topography, passive mitigation of the release "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23838,
      "SummaryText": "by the storage room enclosure).\n\nThe zone of vulnerability of the alternative release scenario is determinated to extend 0.4 mile from the chlorine storage area.  Approximately 400 residents are located within the 0.4 radius of chlorine storage area. These residents could be impacted, depending on the direction of wind. No know environmental receptors are located within the zone of vulnerability.\n\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\nCAPR complies with PROSHO requirements for Prevention Programs and for Process safety Management. Operators, maintenance staff and contractors are informed of chlorine hazards, and hazards signs are posted in the chlorine storage area. Standard operating and maintenance procedures have been developed, and employees whom work with chlorine has been trained.\n\nEMERGENCY RESPONSE PROGRAM\nCAPR has an emergency response program. Chlorine gas detectors are located within storage area for early detection and warning of any leak.  Leak repair kits are maintained on site, and operators are trained in how to quickly stop any leak that may occur. The emergencyresponse program in coordinated with the local Civil Defense and Fire Department for notification of the public.\n\nCAPR periodically conduct various training programs, including emergency response training. This CAPR/PRASA fecility is scheduled to receive training by september 2001.\n\nFIVE YEAR ACCIDENT HISTORY\nWithin the past five years there been no planned release of chlorine in in excess of 10 pounds resulting in injuries or significant property damage on site; or known offsite injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nCAPR uses Process Hazard Analyses (PHA) to indentify and reconmend changes to ensure a high level of safety. Issues indentified form PHA are then addressed by CAPR's Prevention Program.  Assessments of the chlorine processes were conducted during July 20"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23838,
      "SummaryText": "01.  Documentation of formal PHA for this facility was completed on July 2001.  An audit of the RMP and PSM programs will be conducted within three years to verify the effectiveness of the program."
    }
  ]
}