{
  "FacilityID": 23872,
  "FacilityName": "City of Seaside Water Treatment Plant",
  "FacilityStr1": "85175  Underhill Lane",
  "FacilityStr2": null,
  "FacilityCity": "Seaside",
  "FacilityState": "OR",
  "FacilityZipCode": "97138",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41007",
  "LEPC": null,
  "FacilityLatDecDegs": "45.955",
  "FacilityLongDecDegs": "-123.916167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "cosce@pacifier.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Seaside",
  "OperatorStr1": "85175  Underhill Lane",
  "OperatorStr2": null,
  "OperatorCity": "Seaside",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97138",
  "OperatorZipCodeExt": null,
  "RMPContact": "Chris Davies, P.E.",
  "RMPTitle": "Public Works Director/City Engineer",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000176347",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-05-09 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-07-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-07-31 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-07-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-01-20 00:00:00",
  "DeRegistrationEffectiveDate": "2006-01-01 00:00:00",
  "AnniversaryDate": "2006-07-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 45.955,
  "FRS_Long": -123.91617,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 34077,
      "AltID": " water disinfection",
      "FacilityID": 23872,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 34933,
          "ProcessID": 34077,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 44661,
          "ProcessID": 34077,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 544661,
          "ProcessID": 34077,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23872,
      "SummaryText": "\nEXCUTIVE SUMMARY\n\n?ACCIDENTAL RELEASE PREVETION AND EMERGENCY RESPONSE POLICIES.\n\nAt the facility, personal self-contained breathing apparatuses are available for each needed procedure.  Also application sheets are required to be filed for each chemical providing date, product name, and safety equipment used on each procedure.  The City has a Safety committee with regular scheduled monthly meetings.  From this committee we have regular safety meetings for all the departments.  There is an MSDS program in place, where it is kept current.      \n\n?FACILITY AND THE REGULATED SUBSTANCES HANDLED\n\nThe Water Treatment Plant's Building contains the following:  treatment units, chemical feed systems, process pump station, laboratory, plant control panel, filter control panel, standby generator, and heating and ventilation systems.  \nThe facility is single story masonry / concrete structure; with a tall main structure housing the treatment units and the process pump station.  The lower attached structures house the laboratory / office, blower room, standby generator, storage room and chlorine scrubber room.  The chlorine storage room has two 1-ton cylinders on line with an automatic transfer system for when one cylinder runs out, the other cylinder automatically comes on line.  We store two more full cylinders, that are sealed and secured in the storage room, for use when they are needed.  Next to the chlorine storage room is the chlorine scrubber room.  The scrubber is activated by a gas monitor and has a the capacity to treat 2,300 lbs of chlorine.     \nThe water treatment process is as follows:  The raw water first enters through an automatic strainer that removes any particles larger than 1/16\".  The chlorine and polymers are added to the water at the pre-chemical injection point, which contains an in-line flash mixer.  The flow is then divided into two treatment units, which contain filtration.  Each of these units are capable of processing 1,400 GPM / 2.0 MGD.  At the e"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23872,
      "SummaryText": "nd of this process Fluoride, Liquid Caustic Soda and Zinc-Orthophosphate are injected.  The flow then enters the clear well and is held for detention time, which is required to get the proper disinfection.  The clear well has a volume of 270,000 gallons.  At maximum flow (2800 gpm), a detention time of 48 minutes is necessary for the needed contact time for disinfection.  The effluent then gravities out to the city for consumption and to the 2.5 MG portable storage tank located at the north end of town for future consumption.  \n\n?WORST-CASE RELEASE SCENARIO AND ALTERNATIVE RELEASE SCENARIO\n\nThe worst-case scenario at the Water Treatment Plant, would be a gas release of Chlorine in a vapor state.  The total quantity of Chlorine that would be lost from the vessels is 4,000 lbs.  This release figure amount comes from having 1 ton cylinders hooked up to an automatic transfer regulator system, both being on line.  The release rate would be 200 lbs/minute.  The total release time for the vessel is 20 minutes.  A wind speed of 1.5 meters per second is the value that has been set by EPA.  EPA has also set the atmospheric stability class at  \"F\".  Our local topography is urban, and has many obstacles in the immediate area including forestland, rough terrain, and pasture land.  The distance to the endpoint is 1.9 miles and the estimated population within the circle is 700 residences.  The public receptors within distance to the endpoint are made up of residences and an RV park.  Willamette Industries Forest land makes up the most of the environmental receptors, with some pastureland.  This worst-case scenario would be highly unlikely due to all of the safety steps that are practiced and safety equipment (scrubber) that is located at the facility. \n\nFor the alternative release scenario at the facility the total quantity of Chlorine that could be released would be 1,700 lbs.  This amount was figured by taking the total amount of 4,000 lbs minus 2,300 lbs contained by the scrubb"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23872,
      "SummaryText": "er.  The scenario of a pipe (tubing) leak was selected, because it best describes a release scenario that could possibly take place at the facility with tubing that is used with the chlorine system.  The release rate for a ?\" hole would be 62 lbs/minute and a release duration of 3 minutes.  EPA's model program guidance documents indicate a 3 meter/second wind speed and list a class \"D\" atmospheric stability.  The local topography would still be urban and the distance to the endpoint would be .40 miles.  The estimated residential population within this distance would be about 75 people.  The public and environmental receptors would be made up of limited residences including a RV Park and Willamette Industries Forest land with limited pastureland.  The active mitigation considered would be the scrubber, which is used as a pre-release protection measure.  This case is still unlikely with the support of our safety steps and pre-emergency planning that the City takes very seriously.  \n\n?GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n Located at the facility is a chemical scrubber, which is capable of consuming 2,300 lbs of Chlorine in an incident.  The local emergency response agencies' employees receive training on the hazardous substance (Chlorine) used and stored at the facility, in accordance with the Hazard Communication Standard, 1910.1200 and/or the Hazardous Waste Operations & Emergency Response Standard, 1910.120 (q)(6)iI),.  Regular maintenance is performed on the chlorine system, with yearly overhaul as a step in the chemical prevention program.\n\n?FIVE-YEAR ACCIDENT HISTORY\n\nIn February 1997 the City of Seaside's Water Treatment Plant went on line.  In the last four year this facility has not had any reportable accidents.\n\n?EMERGENCY RESPONSE PROGRAM AND PLAN\n\nThe Water Treatment Response Plan is coordinated with our local emergency responders.  This program has been developed to minimize hazards associated with the chemi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23872,
      "SummaryText": "cals (Chlorine) found at this site towards our employees, the community and the environment.  These responders receive training in accordance with the Hazardous Waste Operations & Emergency Response Standard 1910.120.  At least annually, refresher training will be of sufficient content and duration to maintain emergency responders' competencies or will demonstrate competencies in these areas.  This training will be based on the duties and function to be performed by each emergency responder.  Public notifications and alerts would be done in the hot zone first and then the warm zone, and given by a PA system and responders going door to door.  \n\n?PLANNED CHANGES TO IMPROVE SAFETY\n\nSome planned changes to improve safety at the facility would include improvements to the facility as Budget constraints allow and concentrating on safety refresher courses over the years, while continuing to have regular monthly safety meetings."
    }
  ]
}