{
  "FacilityID": 23959,
  "FacilityName": "Exel Logistics-BASF Northeast Distribution Center",
  "FacilityStr1": "175 Raritan Center Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Edison",
  "FacilityState": "NJ",
  "FacilityZipCode": "08837",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34023",
  "LEPC": "Edison Township OEM",
  "FacilityLatDecDegs": "40.514722",
  "FacilityLongDecDegs": "-74.340833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Exel Logistics",
  "OperatorStr1": "175 Raritan Center Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Edison",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08837",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mr. Russ Jacobs",
  "RMPTitle": "Operations Supervisor",
  "FTE": 60,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000161549",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-27 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-08-22 00:00:00",
  "ErrorReportDate": "2001-08-22 00:00:00",
  "ReceiptDate": "2001-08-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-07-18 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2004-06-08 00:00:00",
  "DeRegistrationEffectiveDate": "2004-06-01 00:00:00",
  "AnniversaryDate": "2005-01-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 40.5144,
  "FRS_Long": -74.33979,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 34206,
      "AltID": "Warehouse",
      "FacilityID": 23959,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 35064,
          "ProcessID": 34206,
          "NAICSCode": "49311",
          "_desc": {
            "NAICS_CODE": "49311",
            "NAICS_DESCRIPTION": "General Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 44810,
          "ProcessID": 34206,
          "ChemicalID": 31,
          "Quantity": 90000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 31,
            "ChemicalName": "Cyclohexylamine  [Cyclohexanamine]",
            "CASNumber": "108-91-8",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 44811,
          "ProcessID": 34206,
          "ChemicalID": 127,
          "Quantity": 95000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 127,
            "ChemicalName": "Vinyl ethyl ether  [Ethene, ethoxy-]",
            "CASNumber": "109-92-2",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 544810,
          "ProcessID": 34206,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 544811,
          "ProcessID": 34206,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23959,
      "SummaryText": "This Risk Management Plan (RMP) applies to Exel-BASF Northeast Distribution Center, Edison New Jersey, and is prepared by Regulatory Compliance Services, Inc. in compliance with the Environmental Protection Agency's Clean Air Act, Section 112(r), and the New Jersey Department of Environmental Protection's Toxic Catastrophe Prevention Act (TCPA), JNAC 7:31.\n\nExel-BASF is a closed container warehouse, situated in an urban setting that stores cyclohexylamine and vinyl ethyl ether at quantities exceeding the threshold limits listed in 40 CFR 68.130 (Tables 1-4).  There have been no accidents at this facility in the previous five years.  This plan meets the requirments of Program 3 due to the fact that Exel Logistics is covered under the Occupational Safety and Health Administration's Process Safety Management (PSM), 29 CFR 1910.119.  Worst and alternative case release scenarios are determined using EPA's RMP Comp(TM).  A Process Hazard Analysis exists to take all deviations of procedure into consideration.\n\nThe worst case scenario for the toxic chemical cyclohexylamine, is the release of 390 pounds in liquid form as a result of an accidental spill and subsquent vaporization.  The release duration of this scenario is 10 minutes at a rate of 0.1 pounds per minute.  Under the atmospheric stability class of F and a wind speed of 1.5 meters per second, the distance traveled before reaching an endpoint is 0.1 miles.  This scenario considers enclosures as a form of passive mitigation.  \n\nThe alternative case scenario for the toxic chemical cyclohexylamine, is the release of 200 pounds of the liquid as a result of a vessel leak, possibly from a punctured vessel.  The duration of the release is 10 minutes at a rate of 0.1 pounds per minute.  At an atmospheric stability class of D and a windspeed of 3 meters per scecond, the distance traveled to reach the endpoint is 0.1 miles.  No mitigation measures are considered in this scenario.\n\nThe worst case scenario for the flammable che"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23959,
      "SummaryText": "mical vinyl ethyl ether, is the release of 340 pounds in the form of a vapor cloud explosion.  With this type of release, using 1 PSI as the endpoint, the distance traveled is 0.05 miles.  In this scenario there is no mitigation considered.\n\nThe alternative case scenario for the flammable liquid vinyl ethyl ether, is the release of 340 pounds as a result of a vapor cloud fire.  Using a lower flammability volume of 50%, for this type of release, the distance traveled is 0.1 miles to the designated endpoint.  No passive mitigation is considered in this scenario.\n\nIn order to prevent an accident  of this type , all employees are properly trained and certified to handle the regulated chemicals.  Upon hiring, and every subsequent year, each employee is given Department of Transportation (DOT) hazardous materials training, OSHA Hazard Communication (HAZCOM) training, and EPA Right-To-Know (RTK) training.  All new employees are given additional training regarding Personal Protective Equipment (PPE) use and maintenance, loading, unloading, handling of materials, forklift operation, emergency response, and evacuation procedures.  Exel has also developed a safety committee.  The safety comittee is comprised of workers and management that meet once a month.  The purpose of the safety committee is to review any incidents that may have occurred and discuss safety related issues in the facility.  Due to the extensive training and considerations to employee safety, this facility has had no recordable accident in the previous five years.\n\nIn the event of an emergency, there are Standard Operating Procedures that state who is to be notified in the event of a hazardous materials spill, what the necessary steps are to remediate the situation, and when to evacuate the warehouse.  Evacuation drills are performed on a regular basis, and logged, in order to ensure that all employees are aware of the evacuation procedures in the event of an emergency.  Employee discovery of a release of a "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23959,
      "SummaryText": "hazardous substance would result in the implementation of the emergency response procedures developed at Exel Logistics.  The first step for an employee would be to notify his or her supervisor.  The supervisor will immediately contact the Primary Emergency Coordinator.  Upon notification of a release, the Primary Coordinator will immediately contact the local fire department, the ploice department, the BASF Hotline, the Community Emergenayc Planning Committee, the New Jersey Department of Environmental Protection (NJDEP) Emergency Hotline, and the outside emergency response contract agency.  Evacuation of the facility, due to a release, will occur whenever directed by an alarm signal, direction from facility management, or by the local response officals.  In following all Standard Operating Procedure in place at this facility, employee safety, in addition to the safety of the surrounding areas of the building, are considered.\n\nThe improvement of employee safety at Exel Logistics is an ongoing procedure that takes all variables into consideration.  Employees handling hazardous materials are properly trained for their duties and are expected to complete refresher courses regularly in order to maintain safe working conditions for themselves and others.  All employees are trained for any modification to procedures that may occur in their area of work at this facility.  Prior to modification implementation, all personnel are trained and aware of the change at hand.  It is in this way that employee and public safety is upheld at Exel-BASF Northeast Distribution Center."
    }
  ]
}