{
  "FacilityID": 2407,
  "FacilityName": "Liberty Water Treatment Plant",
  "FacilityStr1": "1920 Clay Brooke Drive",
  "FacilityStr2": null,
  "FacilityCity": "Liberty",
  "FacilityState": "MO",
  "FacilityZipCode": "64068",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29047",
  "LEPC": null,
  "FacilityLatDecDegs": "39.216111",
  "FacilityLongDecDegs": "-94.409722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "UN",
  "FacilityURL": "www.ci.liberty.mo.us/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Liberty",
  "OperatorStr1": "101 E. Kansas",
  "OperatorStr2": "P.O. Box 159",
  "OperatorCity": "Liberty",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "64068",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Hanson, P.E.",
  "RMPTitle": "Director of Public Works",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000029818",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-07-13 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-08-16 00:00:00",
  "DeRegistrationEffectiveDate": "2005-08-10 00:00:00",
  "AnniversaryDate": "2004-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 39.2166,
  "FRS_Long": -94.40448,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "CHANGED FROM A REGULATED CHEMICAL TO AN UNREGULATED CHEMICAL",
  "_processes": [
    {
      "ProcessID": 2701,
      "AltID": "Water Treatment",
      "FacilityID": 2407,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2761,
          "ProcessID": 2701,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 2888,
          "ProcessID": 2701,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502888,
          "ProcessID": 2701,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2407,
      "SummaryText": "Introduction\nThe City of Liberty operates a 9-million gallon per day, lime-softening plant.  This Risk Management Plan (RMP) covers the Section 112r regulated substances maintained at the Liberty Water Treatment Plant, which will be referred to herein as the Plant.\n\nPlant Description\nThe Plant maintains only one regulated substance on site: chlorine.  Chlorine storage is 8,000 pounds, which exceeds the RMP threshold quantity of 2,500 pounds.  The storage and management of chlorine are addressed in this RMP.  \n\nThe Plant is located at 1920 Clay Brooke Drive, Liberty, Missouri which is in an urban area.  The surrounding area includes commercial and residential property. \n\nThe Worst Case Release Scenario\nThe worst case release scenario for chlorine was calculated as the release of a single one-ton cylinder in accordance with the definition provided in the Environmental Protection Agency guidance for RMP development.  The Plant stores one cylinder outside the chlorine room, so no passive control systems can be considered for the worst-case release, such as the containment provided by a building.  The conditions of the scenario, such as release time and weather status are those provided in the EPA Off-Site Consequence Analysis Guidance. The area of potential impact was determined using RMP*Comp, modeling software developed by the EPA.\n\nThe results of the Off-Site Consequence Analysis indicated that the chlorine would travel approximately 1.3 miles under the specified weather conditions before dispersing in the atmosphere to a harmless concentration.  Within that radius of the Plant, an estimated 2,250 persons could potentially be affected.  Maps of the area and a list of the types of receptors in the potential impact area are provided in the Off-Site Impact Analysis Section.  The list of potential receptors includes:\n\n7 Two recreational areas\n7 One Major Commercial or Industrial area.  \n\nThis type of release would only occur if the cylinder valve was broken off, or the c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2407,
      "SummaryText": "ylinder was breached.  The likelihood of such an incident occurring is minimal.  \n\nAlternative Release Scenario\nThe alternative release scenario is, by definition, a more likely release scenario than the worst case.  Engineered controls, such as the chlorine detection system and alarm, are considered in the analysis.  The type of system failure selected for the alternative release was the loss of chlorine due to a break in the flexible tubing leading from the cylinder to the vacuum regulator.  The chlorine would leak from a 3/8\" opening.  The leak would continue until the chlorine detection alarm sounded and the valve on the cylinder could be closed.  Because chlorine would have leaked into the chlorine room, response would be made by the Liberty Fire Service under their agreement with the Plant.  The time for the response was estimated at 10 minutes.  Once on site, the fire response personnel would enter the room in protective clothing and close the valve on the leaking cylinder.\n\nThe results of the Off-Site Consequence Analysis using RMP*Comp, indicated that the chlorine would travel approximately 0.3 miles under the specified weather conditions in order to disperse in the atmosphere to a harmless concentration.  Within that radius of the Plant, an estimated 700 persons could potentially be affected.  Maps of the area and a list of the types of receptors in the potential impact area are provided in the Off-Site Impact Analysis Section.\n\nProcess Hazard Assessment\nA process hazard assessment was performed of the chlorine system beginning with cylinder unloading and ending with the chlorine in solution.  A checklist and a modified \"What if\" analysis were used.  In the checklist analysis, general questions regarding the storage and use areas, as well as protocols associated with the management of the chlorination system, were answered.  A copy of that checklist is included in this plan.  Following the checklist, each valve, line, and piece of equipment in the system w"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2407,
      "SummaryText": "as assessed from the cylinder to point of chlorine injection using a system flow diagram.  The valves and other points in the system where chlorine could be released are numbered on the flow diagram. The assessment is formatted in accordance with those numbers.  Compliance with code requirements, potential failures, maintenance and inspection concerns, and standard operating procedures were reviewed for each point in the system.  Comments are summarized in the Process Hazard Assessment section.\n\nPrevention System\nThe Plant has an operation, maintenance and inspection system designed to review each element of the chlorination system routinely.  There are Operation and Maintenance manuals for each major piece of equipment, and personnel receive significant training before being allowed to work on the system.\n\nAt the beginning and end of the daily operating period, and as each cylinder is changed, the valves and piping are tested for leaks.  There are standard operating procedures (SOPs) for startup, shutdown, normal operation, and emergency operation.  The SOPs are written and posted in the appropriate areas.  Personnel are trained routinely on safety concerns and general operation procedures as well as emergency procedures.\n\nThe system is equipped with chlorine detectors and alarms that indicate leaks.  Two tanks are stored and used inside the building, and two tanks are stored outside.  Ventilation is provided in the chlorine room only when a worker is present. \n\nEmergency Response Plan\nPlant personnel are allowed and trained to respond to leaks that can be managed by turning off a valve.  Any response requiring entry in a dangerous atmosphere or use of a chlorine repair kit is to be managed by the Liberty Fire Department.  The Plant has an agreement with the Fire Department, which is included in this plan.  A complete copy of the Emergency Response Plan is also included.  \n\nAccident History\nThe Plant has had no chlorine releases in the past five years."
    }
  ]
}