{
  "FacilityID": 24135,
  "FacilityName": "WOODBRIDGE CORPORATION - WHITMORE LAKE PLANT",
  "FacilityStr1": "435 WEST EIGHT MILE ROAD",
  "FacilityStr2": null,
  "FacilityCity": "WHITMORE LAKE",
  "FacilityState": "MI",
  "FacilityZipCode": "48189",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26161",
  "LEPC": "Washtenaw County LEPC",
  "FacilityLatDecDegs": "42.428056",
  "FacilityLongDecDegs": "-83.770833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "SE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 808013920,
  "ParentCompanyName": "WOODBRIDGE HOLDINGS",
  "Company2Name": null,
  "CompanyDUNS": 161659883,
  "Company2DUNS": 161659883,
  "OperatorName": "WOODBRIDGE CORPORATION",
  "OperatorStr1": "435 WEST EIGHT MILE ROAD",
  "OperatorStr2": null,
  "OperatorCity": "WHITMORE LAKE",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48189",
  "OperatorZipCodeExt": null,
  "FTE": 105,
  "OtherEPAFacilityID": "48189JHSN 435W",
  "EPAFacilityID": "100000150249",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-25 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-09-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-09-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-09-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2006-07-07 00:00:00",
  "DeRegistrationEffectiveDate": "2005-11-01 00:00:00",
  "AnniversaryDate": "2006-09-13 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 42.428056,
  "FRS_Long": -83.770833,
  "FRS_Description": "SE CORNER OF LAND PARCEL",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 34486,
      "AltID": "URETHANE FOAM PRODUCTION",
      "FacilityID": 24135,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 45196,
          "ProcessID": 34486,
          "ChemicalID": 77,
          "Quantity": 163200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 35348,
          "ProcessID": 34486,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 24135,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2001-02-01 00:00:00",
    "ERTrainingDate": "2001-06-06 00:00:00",
    "CoordinatingAgencyName": "Northfield Township",
    "CoordinatingAgencyPhone": "7344492385",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24135,
      "SummaryText": "EPA's RISK MANAGEMENT PLAN\nEXECUTIVE SUMMARY\nFOR \nWOODBRIDGE WHITMORE LAKE\n\n1. Accidental release prevention and emergency response policies.\n\nThe Whitmore Lake Plant, as part of the Woodbridge Group of companies, believes the health and safety of its employees and the protection of the natural environment, should be of the utmost concern in the operation of its business.  We are committed to operating and maintaining all of our processes in a safe and responsible manner.\n\nIt is our policy to:\n\nv\tComply with all applicable laws, regulations, and standards.\nv\tReview and assess our operations for the purpose of making health, safety & environmental improvements.\n\nOur complete Heath Safety & Environmental policy statement, signed by our plant manager, is posted in the lobby of our facility. \n\nWe use a combination of prevention programs and emergency response planning, which are described later in this document, to help ensure the safety of our employees and the public as well as protection of the environment. Our Plant Manager has the overall responsibility for ensuring that our facility operates in a safe and reliable manner.  This responsibility includes overseeing the implementation of the elements of our risk management program.  To ensure that our risk management program is appropriately developed and implements, our Plant Manager has assigned the role of RMP coordinator to a staff member with the background, training, and experience necessary to manage the program. The RMP Coordinator, acting with the authority delegated directly from the Plant Manger, is responsible for coordinating the development, implementation and integration of the RMP elements as is required under Section 68.15 of the RMP rule. \n\n2. The stationary source and regulated substances handled.\n\nThe primary purpose of the Whitmore Lake Plant is to produce polyurethane foam seat cushions for the automotive industry. The foam is made by high pressure mixing of chemicals immediately prior to pouring"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24135,
      "SummaryText": "the mixture into a mold that is attached by carrier to a continuously moving line. The mold moves through a curing oven. Upon exiting the oven, the foam pads are removed from the mold, crushed, trimmed and prepared for shipment to customers. Toluene Diisocyanate (TDI), which is regulated by EPA's risk management program rule, is one of the reactants required to manufacture polyurethane foam. TDI is received at the plant by railcar and tanker truck, It is stored in 3 located in the contained bulk storage tank room. The TDI is then transferred to the process utilizing a computer-controlled system. \n\nAccess to the site is restricted to authorized facility employees, management personnel, and contractors. The maximum amount of TDI that can be stored at this facility is 163,200 pounds.\n\n3. Off-site consequence analysis scenarios \n\nEPA's RMP rule requires that we provide information about the worst-case release and alternative release scenario's for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario.  \n\nThe methodology used to determine the distance to the toxic endpoint as established by the RMP rule was the Area Locations of Hazardous Atmospheres (ALOHA) version 5.2.1 for plume modeling.   Meteorological information was obtained from the National Weather Service and from the National Climatic Data Center.  Meteorological conditions of 1.5 mph and 96 degrees F at 72% relative humidity were used.  An urban environment was assumed due to the characteristics of the local terrain.\n\nWorst Case Scenario\nCatastrophic failure of a full tanker truck of TDI at the truck unload site, discharging its entire contents of 60,000 pounds as stipulated in the RMP rule.  It is assumed the maximum temperature the TDI could reach during an unload is 140 degrees F.  With full concrete containment at the truck unload, it is assumed that a pudd"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24135,
      "SummaryText": "le with an area of 1039 square feet and a volume of 6000 gallons forms and evaporates to form a cloud that disperses downwind.  The distance to the endpoint concentration of 0.007 mg/l is 57 feet or 0.0108 miles.  This worst-case scenario will affect no residential population.\n\nAlternative Release Scenario\nCatastrophic failure of storage tank 105, losing 60,000  pounds of TDI.  Storage tank 105 is located inside the building and its contents are contained by diking.  It is assumed that the temperature would be 100 degrees F.  The resulting liquid forms a puddle with an area of 1270 square feet and a volume of 6000 gallons and evaporates to form a cloud that disperses downwind.  The distance to the endpoint concentration of 0.007 mg/l is 63 feet or 0.0119 miles.  This alternate release scenario will not leave the building and will affect no residential population.\n\n\n\n4. The general accidental release prevention program and the specific prevention steps. \n\nWe take a systematic, proactive approach to preventing accidental releases of chemicals. Our management systems for our TDI process address each of the key features of successful prevention programs including: \n\nSafety information \nHazard reviews of our processes\nOperating procedures\nTraining\nEquipment Maintenance Program\nRMP Compliance Audits\nAccident/Incident Investigation\n\nIn addition, we have an established Isocyanate Control Program that outlines the hazards of handling toluene diisocyanate and the controls that are in place to reduce the hazards of isocyanate exposure to the employees, the community and the environment. \n\nThese listed individual elements of our prevention program work together to prevent accidental chemical releases.  Our company and our employees are committed to the standard that these management systems set for the way we conduct business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\n\n\n5. Five year accident"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24135,
      "SummaryText": "history. \n\nWe have not had any TDI releases that qualify for listing in the EPA's required five-year accident history report.  We have had one small release in the past five years.  This release occurred inside the facility building and was contained and controlled as a result of our emergency planning and trained responders.  A thorough and complete investigation of this release  was conducted in accordance with out accident/incident investigation program, root cause was determined, and appropriate corrective action taken.\n\n6. The emergency response program.\n\nWe maintain an integrated contingency plan, which consolidates the various federal, state and local regulatory requirements for emergency response planning.  Our program provided essential planning and training for effectively protecting workers, the public and the environment during emergency situations.  We have coordinated our program with the local emergency planning committee and the fire department. A representative of the fire department routinely visits this plant to discuss how to respond to a release of TDI.  We have also given local hospitals information regarding medical treatment for exposure to TDI.\n\n7. Planned changes to improve safety.\n\nAt this time we are continuing to maintain our current safety management systems.  We also anticipate improving our procedures and training programs in the area of specific maintenance tasks.  In addition, we need to obtain additional information regarding equipment specifications and integrity.  We have also developed or improved our process procedures for several tasks."
    }
  ]
}