{
  "FacilityID": 24225,
  "FacilityName": "AvestaPolarit Pipe Inc",
  "FacilityStr1": "1101 N. Main Street",
  "FacilityStr2": null,
  "FacilityCity": "Wildwood",
  "FacilityState": "FL",
  "FacilityZipCode": "34785",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12119",
  "LEPC": "District 5 LEPC",
  "FacilityLatDecDegs": "28.873889",
  "FacilityLongDecDegs": "-82.039167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.avestapolarit-na.com/avestapolarit-na/home.htm",
  "FacilityEmailAddress": "tom.kern@avestapolarit-na.com",
  "FacilityDUNS": 626131064,
  "ParentCompanyName": "AvestaPolarit Inc.",
  "Company2Name": null,
  "CompanyDUNS": 800130494,
  "Company2DUNS": 0,
  "OperatorName": "AvestaPolarit Inc.",
  "OperatorStr1": "425 N. Martingale Road",
  "OperatorStr2": null,
  "OperatorCity": "Schaumberg",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60173",
  "OperatorZipCodeExt": "2281",
  "FTE": 114,
  "OtherEPAFacilityID": "32785RMCDVHIG",
  "EPAFacilityID": "100000022548",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-11-20 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-10-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-10-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-09-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 28.86959,
  "FRS_Long": -82.03785,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 34609,
      "AltID": "HF Storage",
      "FacilityID": 24225,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 45336,
          "ProcessID": 34609,
          "ChemicalID": 55,
          "Quantity": 41000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 35471,
          "ProcessID": 34609,
          "NAICSCode": "33121",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 13310,
              "Process_NAICS_ID": 35471,
              "SafetyReviewDate": "1999-04-01 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-04-01 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2001-09-24 00:00:00",
              "TrainingReviewDate": "2001-09-24 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-01 00:00:00",
              "EquipmentInspectionDate": "2001-04-06 00:00:00",
              "EquipmentTested": "Tank shell, welds, flanges, valces, saddles, foundation, piping and scrubbers",
              "ComplianceAuditDate": "1999-04-30 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "Everything in this description applies to the hydrofluoric acid above ground storage tank.",
              "_chemicals": [
                {
                  "PrimaryKey": 13956,
                  "PreventionProgram2ID": 13310,
                  "ProcessChemicalID": 45336
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 24225,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2001-09-18 00:00:00",
    "ERTrainingDate": "2000-11-02 00:00:00",
    "CoordinatingAgencyName": "Wildwood Fire Department",
    "CoordinatingAgencyPhone": "3527481851",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24225,
      "SummaryText": "AvestaPolarit Pipe (APP) operates a stainless steel pipe and tube manufacturing facility located on approximaely 76 acres of owned property in Wildwood, Florida. The facility is situated in the northeastern portion of Sumter County. The facility consists of two main manufacturing buildings (south and north plant), which are used for pipe forming and welding activities, A covered and contained acid pickling area and a wastewater treatment plant.\n\nAPP manufactures 0.840\" Outer diameter (OD) to 4.500 OD stainless steel pipe in the south plant and 5.000\" OD to 72.000\" OD stainless steel pipe in the north plant with an average length of 21 feet. The pipe manufacturing process consists of forming a flat piece of stainless steel into the desired diameter, welding the seam, heat treating (annealing), water quenching, straightening, cutting to length, cleaning (acid pickling), inspecting and shipping.\n\nThe acid pickling process uses a substance regulated under section 112(r) of the clean air act. The substance is 70% hydrofluoric acid used to remove oxides from the surface of annealed pipe.At any one time, this substance may be stored a quanity above the threshold quanity listed in 40 CFR 68, subpart F.\n\nThe accidental release program utilized at APP consists of the elements required by the EPA Risk Management Program. APP is commited to preventing accidental releases by providing and maintaining the highest practically achievable standards of safety, occupational health and working environment. APP's goal is to discover, correct and address conditions which may result in personal illness and injury, offsite consequences or property damage. Health, safety and the protection of the working environment and the surrounding property have equal status with other primary business objectives, and are an integral part of planning and implementing every aspect of the companies operations. In addition, APP adheres to all applicable OSHA, DEP and EPA regulations and continually reviews"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24225,
      "SummaryText": " the regulations for any applicable changes or additions to the rules.\n\nHealth, safety and the protection of the working environment and the surroundings are the direct responsibility of APP management. Management and supervision take initiative as a intigral part of their duties to assure that safe working procedures and practices are employed to eliminate the risks of accidents and health hazards. A continual alertness to identify and correct unsafe practices or hazardous working conditions is paramount. Information and training is provided to maintain an awareness of safety and the working environment.\n\nAPP's Emergency Response Plan (ERP) consists of a description of activities , inspection and prevention procedures, emergency notification, site control zones, personal protective equipment, decontamination and clean up, emergency response equipment and communication, potential spill sources and control, evacuation plan, arrangement with local authorities, clean up and post emergency response and emergency response review. All pertinant personnel attend an annual emergency response/hazardous materials training class. The LEPC, SERC, OHM contractor (emergency response contractor) FDEP, Wildwood Fire Department, Sumter County Sheriff's Department, Leesburg Regional Medical Center and Monroe Regional Medical Center all have updated copies of APP's ERP. In addition, The Wildwood Fire Department periodically performs mock training sessions at the APP site. Both the Wildwood Fire Department and the OHM corporation have been onsite to review APP's ERP procedures, and to become visually familiar with the plant surroundings.\n\nThe worst case scenario for HF acid involves the liquid release of the maximum amount of HF acid in inventory into the storage dike area. Using the EPA's RMP* Comp Modeling Program and an urban topography, since many large trees, thick vegetation, and buildings surround the storrage tank, the distance to the endpoint is 0.60 miles. According to Landvi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24225,
      "SummaryText": "ew GIS Software, the estimated residential population within this radius is 57. The only public receptors are residents and there are no environmental receptors. The mitigation system in use include a dike and neutralization capabilities. The dike surrounding the tank has an area of 1400 sq. ft. which equates to a volume of 22,000 gallons of storage volume.  This is more than enough volume to handle the entire contents of the HF tank plus enough hydrated lime to neutralize the acid which will prevent further fuming. Process controls include vents, scrubbers, manual shutoffs and emergency supplied air. It should be noted that the HF acid tank's wall thickness is measured semi-annually to track any wall thickness deterioration. By using ultrasonic testing equipment to survey the entire tanks wall, the corrosion rate of the tank can be tracked. This allows the tank to be taken out of service and replaced well before any leaking hazards arrise. In addition an alternative release involves a punctured HF acid pipe, which releases acid into the diked area. Again using EPA's RMP* Comp. Modeling Program and an urban topography, the distance to the endpoint is 0.20 miles. The estimated residential population within this radius is 6.\n\nIn the last five years APP has had no chemical release incidents to include in this report. APP is proud of this accomplishment and believes that it is a direct result of it's dedication to maintaining a safe working environment.\n\nAPP takes great pride in it's safety, environment, quality and risk management systems. These systems have proven to be effective in the past and will always be in a continuous state of improvement. APP will continue to improve safety by holding all-employee safety meetings, safety committee meetings and inspections, safety project meetings, supervisor/employee training and safety incentives."
    }
  ]
}