{
  "FacilityID": 24255,
  "FacilityName": "El Segundo Generating Station",
  "FacilityStr1": "301 Vista Del Mar",
  "FacilityStr2": null,
  "FacilityCity": "El Segundo",
  "FacilityState": "CA",
  "FacilityZipCode": "90245",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": null,
  "FacilityLatDecDegs": "34.823139",
  "FacilityLongDecDegs": "-117.645611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 197234768,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "El Segundo Power, LLC",
  "OperatorStr1": "301 Vista Del Mar",
  "OperatorStr2": null,
  "OperatorCity": "El Segundo",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90245",
  "OperatorZipCodeExt": null,
  "RMPContact": "Audun Aaberg",
  "RMPTitle": "Regional Plant Manager",
  "FTE": 60,
  "OtherEPAFacilityID": "CAR000036848",
  "EPAFacilityID": "100000102667",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "115663",
  "SafetyInspectionDate": "2001-06-12 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-10-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-10-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-10-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 33.91028,
  "FRS_Long": -118.42389,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 34678,
      "AltID": "Ammonia for SCR system",
      "FacilityID": 24255,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 35540,
          "ProcessID": 34678,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 45432,
          "ProcessID": 34678,
          "ChemicalID": 57,
          "Quantity": 45840.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 545432,
          "ProcessID": 34678,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24255,
      "SummaryText": "\n1.0  EXECUTIVE SUMMARY\n\n\n\nThe following provides a brief summary of the key components of the Risk Management Program for the aqueous ammonia storage and handling system associated with the Selective Catalytic Reduction system at El Segundo Generating Station.\n\n\n\n1.1 Introduction\n\n\n\nPursuant to the requirements contained in Chapter 6.95, Article 2 of the California Health & Safety Code ( 25531 through 25543.3, the Clean Air Act 112r and Title 40 of the Code of Federal Regulations Part 68, this Risk Management Plan (RMP) is submitted on behalf of the El Segundo Generating Station.  The California Accidental Release Prevention (CalARP) Program encompasses the above RMP requirements and ultimately the local Administering Agency (AA) oversees the development of the RMP.  The local agency, the AA, responsible to implement the CalARP program, in most instances is the Certified Unified Program Agency (CUPA).\n\n\n\nThe scope of this RMP is based on discussions with the CUPA, the city of El Segundo Fire Department, to ensure that all issues are resolved and to incorporate state requirements.  With input from the CUPA, the ammonia storage and handling facility was identified as the only process that triggers the RMP/CalARP requirements.  It was determined that this process was covered by Program 2 requirements.  The process hazard review technique was then presented to and approved by the CUPA and the level of detail for this RMP submission agreed upon.\n\n\n\nEl Segundo Generating Station, located in El Segundo, California, is an electric generating station consisting of four units, Units 1 and 2 each rated at 175 MW, and Units 3 and 4 each rated at 335 MW.  These units are capable of combusting either fuel oil or natural gas.  To control emissions of nitrogen oxides (NOx) Selective Catalytic Reduction (SCR) technology was installed on Unit 4 in 1994 and in June of 2001 on Unit 3.  This RMP has been updated to incorporate changes related to the addition of the Unit 3 SCR system.\n\n"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24255,
      "SummaryText": "\n\nSCR is a post-combustion flue gas NOX emission control technology that removes NOX from the flue gas downstream from the combustion process.  A reducing agent is used to reduce NOX emissions, primarily nitric oxide (NO) and nitrogen dioxide (NO2), by oxidation-reduction reactions in the presence of a catalyst.  The most common reducing agent (reagent) used with SCR is ammonia.  Injection of ammonia into the combustion exhaust stream before the catalyst initiates the reactions and achieves the desired removal of NOx emissions upstream from the stack.  In order to minimize the handling of hazardous materials, the El Segundo Generating Station will utilize ammonia in the form of an industrial grade aqueous ammonia solution in water (29.5% ammonia by weight) as the reagent for the SCR reactions.\n\n\n\nThe SCR system in use at the El Segundo Generating Station employs ammonia injection to reduce NOx emissions approximately 80% from uncontrolled levels.  Aqueous ammonia is classified as a toxic chemical subject to the requirements of the California Accidental Release Prevention (CalARP) Program.  The aqueous ammonia used is a 29.5% solution of ammonia in water, ammonium hydroxide (CAS Number 7664-41-7).\n\n\n\nThe ammonia storage and handling system at El Segundo Generating Station is comprised of a single underground storage tank, pumps, and piping which terminate at the vaporizers where the aqueous ammonia is atomized.  The underground storage tank is double-walled, 20,000 gal in volume, and is equipped with pressure relief valves, leak detectors, temperature and pressure reference level indicators.  Approximately 1,200 feet of 2 inch I.D. piping runs from the tank to Unit 4, recently an additional 250 feet of 2 inch I.D. piping was installed to connect to Unit 3.  Other lines from the ammonia tank include a formerly used 1 inch I.D. line to the station water treatment system which is now capped.\n\n\n\nAll other regulated substances onsite are in quantities below state and fede"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24255,
      "SummaryText": "ral RMP thresholds.  A list of hazardous material found at steam generation plants and their Reportable Quantities can be found in the El Segundo Generating Station Emergency Preparedness and Emergency Response Plan.  The locations of all hazardous materials, including the aqueous ammonia, are identified in the El Segundo Power, LLC Hazardous Materials and Hazardous Waste Management Plan.\n\n\n\n1.2 Accidental Release Prevention and Emergency Policies at Facility\n\n\n\nEl Segundo Generating Station will comply with the California Accidental Release Prevention (CalARP) Program.  The emergency procedures are described in the El Segundo Generating Station Emergency Preparedness and Emergency Response Plan.\n\n\n\n1.3 Description of Stationary Source and Regulated Substances Handled\n\n\n\nThe primary activity of the El Segundo Generating Station is generation of electric power.  The only regulated substance used in an amount triggering the CalARP program is aqueous ammonia (29.5% by weight in water solution), which is used as the reagent for the SCR emission control technology retrofitted on El Segundo Generating Station Units 3 and 4.  The maximum quantity of aqueous ammonia to be stored on-site will be 20,000 gallons, in one underground storage tank.\n\n\n\n1.4 Worst-Case and Alternative Release Scenario - Offsite Consequence Analysis\n\n\n\nOne worst-case and one alternative aqueous ammonia release scenario were examined in this RMP.  The worst-case scenario must be the release of the largest quantity of a regulated substance onsite, since the storage tank is double walled and underground, the largest quantity of aqueous ammonia is contained in the piping between the pump and vaporizer.  Thus in the worst-case the entire contents of all piping carrying aqueous ammonia between the pump and vaporizer are released through a failed pipe.  \n\n\n\nIn the alternative scenario the entire contents of the delivery truck's hose carrying aqueous ammonia between the truck shut-off valve and the tank hook"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24255,
      "SummaryText": "-up is released by a failed delivery hose.  Active mitigation consists of the station's fill procedure, which utilizes both the truck operator and the plant operator.    \n\n\n\n1.5 Program 2 Accident Release Prevention Program\n\n\n\nEl Segundo Generating Station is covered by an accidental release prevention program, which includes the following:\n\n* Periodic hazard reviews and updates.\n\n* Periodic audits of the system and its operation.\n\n* Emergency Response Plan that is coordinated with local emergency response agencies.\n\n* Safety information\n\n* Operating and Maintenance procedures\n\n* Training procedures\n\n* External events analysis\n\n* Incident investigation program\n\n\n\n1.6 Five-Year Accident History\n\n\n\nThere have been no accidental releases from the aqueous ammonia storage and handling system at El Segundo Generating Station in the past five years that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  (Statute:  40 CFR 68.42)\n\n\n\n1.7 Summary of the Emergency Response Program\n\n\n\nThe core elements of the emergency response plan for the El Segundo Generating Station include:\n\n* Specific actions to be taken in response to an accidental release of ammonia\n\n* Procedures to notify local and public agencies including the El Segundo Fire Department, the Office of Emergency Services and the National Response Center as necessary\n\n* A list of resources for emergency health care\n\n* Information regarding the training of employees on responses to releases\n\n* A list of other federal and state requirements the facility is subject.\n\n\n\n1.8 Planned Changes to Improve Safety\n\n\n\nThe HAZOP Analysis of the aqueous ammonia storage and handling system at El Segundo Generating Station conducted as part of this Risk Management Program resulted in recommendations to improve the system's safety.  A number of the recommendations have been or will soon be implemented.  "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 24255,
      "SummaryText": "These recommendations are outlined in the Hazardous Analysis report.\n\n"
    }
  ]
}