{
  "FacilityID": 24285,
  "FacilityName": "McCain Foods USA, Inc. - Easton, ME Facility",
  "FacilityStr1": "319 Richardson Road",
  "FacilityStr2": null,
  "FacilityCity": "Easton",
  "FacilityState": "ME",
  "FacilityZipCode": "04740",
  "Facility4DigitZipExt": "0159",
  "FacilityCountyFIPS": "23003",
  "LEPC": null,
  "FacilityLatDecDegs": "46.663056",
  "FacilityLongDecDegs": "-67.904722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 11000532,
  "ParentCompanyName": "McCain USA, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Conrad Caron",
  "OperatorStr1": "P.O. Box 159",
  "OperatorStr2": null,
  "OperatorCity": "Easton",
  "OperatorStateFIPS": "ME",
  "OperatorZipCode": "04740",
  "OperatorZipCodeExt": "0159",
  "RMPContact": null,
  "RMPTitle": "Health & Safety Manager",
  "FTE": 550,
  "OtherEPAFacilityID": "04740mccnfstati",
  "EPAFacilityID": "100000071682",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-05-08 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-10-10 00:00:00",
  "ErrorReportDate": "2001-10-10 00:00:00",
  "ReceiptDate": "2001-10-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-10-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-10-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 46.64935,
  "FRS_Long": -67.89229,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 34717,
      "AltID": "Main Refrigeration System",
      "FacilityID": 24285,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 35579,
          "ProcessID": 34717,
          "NAICSCode": "311411",
          "_desc": {
            "NAICS_CODE": "311411",
            "NAICS_DESCRIPTION": "Frozen Fruit, Juice, and Vegetable Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 45473,
          "ProcessID": 34717,
          "ChemicalID": 56,
          "Quantity": 55000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 545473,
          "ProcessID": 34717,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 34718,
      "AltID": "Cold Storage",
      "FacilityID": 24285,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 35580,
          "ProcessID": 34718,
          "NAICSCode": "311411",
          "_desc": {
            "NAICS_CODE": "311411",
            "NAICS_DESCRIPTION": "Frozen Fruit, Juice, and Vegetable Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 45474,
          "ProcessID": 34718,
          "ChemicalID": 56,
          "Quantity": 26000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 545474,
          "ProcessID": 34718,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24285,
      "SummaryText": "McCain Foods USA, Inc. is committed to being a responsible member of the community by giving top priority to operating in a safe and environmentally sound manner. This commitment is documented in the Easton facility?s accident prevention and emergency response plans, which are available to all employees.\n\nMcCain?s Easton facility is a potato processing plant which produces frozen potato products, such as french fries and tater tots, for the retail and service markets. Ammonia, a regulated toxic substance, is used in the refrigeration system at the facility. The main refrigeration system consists of three single stage systems. The first is a low temperature system, which provides cooling for freezer tunnels and specialty freezers. The second system is the cold storage temperature system, which provides cooling for the cold storage and loading dock areas. A third system is the high temperature system, which provides cooling for the refrigerated precool units of the process tunnels, loading dock, batter room, AC chiller, process chiller, retrograder, and for the flash liquid ammonia cooler. The maximum capacity of the main refrigeration system is approximately 55,000 pounds of ammonia. A more complete description of the refrigeration system is found in the Hazardous Materials Emergency Response Plan and in drawings developed as part of the Process Safety Management program.\n\nThe worst-case release scenario associated with the existing main ammonia refrigeration system at the facility is the release of the total contents of the high pressure receiver, the largest single vessel associated with the process. The capacity of the receiver of 35,850 pounds. However, McCain has written operating procedures that prevent the high pressure receiver from being filled to more than 80 percent capacity, or 28,679 pounds. Because the high pressure receiver is located inside the building, the worst-case release was assumed to occur in an enclosure, but with direct contact with outdoor "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24285,
      "SummaryText": "air via windows and doors. It is extremely unlikely that this worst-case release would occur due to the safety measures instituted by the facility. Numerous alternative release scenarios were considered. An alternative release scenario that might result in an offsite impact was identified as the severing of the hose while a tanker truck is charging the system with ammonia. This ammonia release was assumed to occur outside the building. The USEPA?s Risk Management Program Guidance for Ammonia Refrigeration was used to determine the distance to endpoint for each scenario. In each case, the resulting distance to endpoint extends offsite. However, no residences are located within the distance to endpoint for the alternative release scenario. \n\nA new cold storage area is being added to the ammonia refrigeration system for the facility. The refrigeration system for this new area will be a single stage system with economizer side ports, evaporative condenser, and liquid storage and distribution tanks. The main system for this new cold storage area will provide cooling for cold storage, and will consist of two single stage, rotary screw compressor packages. The economizer system will provide cooling for the dock and for the flash liquid ammonia cooler, and will also consist of two single stage, rotary screw compressor packages. The maximum capacity for the new cold storage area will be 26,000 pounds of ammonia. A more complete description of the new cold storage area can be found in the operating procedures and drawings developed as part of the Process Safety Management program.\n\nBecause of the relatively large distance between the new cold storage area and the existing main refrigeration system, the ammonia refrigeration system associated with the new cold storage area must be considered a separate process under USEPA's Risk Management Program regulations. The two refrigeration systems will not be physically connected, and a release from one system would not cause a releas"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24285,
      "SummaryText": "e from the other system. The new cold storage area is considered a Program 3 process, as it will be subject to OSHA's Process Safety Management rules.\n\nThe off-site consequences of worst-case and alternative releases were evaluated for the new cold storage area. These analyses were conducted to determine whether different public receptors might be affected for an ammonia release from the new cold storage area than those previously determined to be affected by a release from the existing main ammonia  refrigeration system. The worst-case release scenario associated with the new cold storage area is the release of the total contents of the high pressure receiver, the largest single vessel associated with this process. The capacity of the high pressure receiver is 19, 076 pounds. However, McCain has written operating procedures that will prevent the high pressure receiver from being filled to more than 80 percent capacity, or 15,261 pounds. Because the high pressure receiver will be located inside the building, the worst-case release was assumed to occur in an enclosure, but with direct contact with outdoor air via doors. It is extremely unlikely that this worst-case release would occur due to the safety measures instituted by the facility. The impact area of a worst-case release from the new cold storage area was determined to be a subset of the impact area previously determined for a worst-case release from  the main ammonia refrigeration system (discussed above), i.e., different public receptors would not be affected by a release from the cold storage area. Therefore, only the results of the off-site consequence analysis for a worst-case release from the existing main refrigeration system have been included in the updated Risk Management Plan (RMP) now being submitted. Section 2 of the original RMP submittal (Toxics: Worst-Case) is still applicable and appropriate, and thus has not been revised.  Numerous alternative releases were also considered for the new cold st"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24285,
      "SummaryText": "orage area. Again, an alternative relase scenario that might result in an offsite impact was identified as the severing of the hose while a tanker truck is charging the system with ammonia. This ammonia release was assumed to occur outside the building. The USEPA?s Risk Management Program Guidance for Ammonia Refrigeration was used to determine the distance to endpoint for each alternative scenario, as well as for the worst-case scenario. In each case, the resulting distance to endpoint extends offsite. However, no residences are located within the distance to endpoint for the alternative release scenario. As required by the USEPA only one alternative release scenario for ammonia  has been included in the RMP plan, the alternative scenario included in the original RMP submittal.\n\nThe entire ammonia refrigeration system, including the new cold storage area,  has been equipped with safeguards to prevent, detect, and mitigate accidental releases of ammonia. These safety systems are described in detail in the facility?s Hazardous Materials Emergency Response Plan and Process Safety Management program files. Included is ammonia detection equipment installed in the ceiling of the service building, which will trigger an alarm on the computer and in the service building should ammonia concentrations exceed a specified level. The refrigeration department has been automated so that the operator can view most of the refrigeration process using the Man Machine Interface RS View Computer. This system maintains the predetermined set points established by the operator, allowing the equipment to start or stop, load or unload while maintaining safe pressures. Control systems have been designed to maintain operating parameters within acceptable limits. The system is equipped with alarms and monitors to alert personnel when the operating parameters exceed the acceptable limits. The facility also conducts training of personnel to familiarize them with operation of the ammonia refrigera"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 24285,
      "SummaryText": "tion system, safety systems and procedures, and actions to be taken should a release of ammonia occur. \n\nThe facility complies with OSHA?s Process Safety Management regulation and with the USEPA?s Accidental Release Prevention regulations, 40 CFR Part 68, as well as applicable state and local regulations. During the past five years, there have been no accidents involving ammonia at the facility that caused onsite deaths, injuries, or significant property damage or known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\n\nThe facility has developed an emergency response program, which has been revised to include the new cold storage area. The emergency response program has been designed to minimize the effects of any accidental releases of ammonia on employees, the public, and the environment. The facility has a trained emergency response team, appropriate equipment and supplies, and a detailed emergency preparedness plan. During a chemical emergency, the Facility Emergency Coordinator (FEC) coordinates the response within the facility. The FEC is also the primary liaison between the facility and local, State, and Federal emergency responders. In the event of a release of ammonia above 100 pounds and/or a release that could potentially extend beyond the facility?s boundaries, it is the company?s policy to notify the local emergency response agency, the State Police, the Easton fire department, and the National Response Center, as well as key McCain personnel. A mutual aid agreement exists between the facility and the Easton fire department.\n\nAs a result of the new ammonia refrigeration system installed at the facility in 1999 and the new cold storage area, all prevention, safety, and emergency response procedures have been recently reviewed and revised as appropriate. Additional safety improvements are not currently planned.\n\nThis facility does not yet have a Clean Air Operating Permit number."
    }
  ]
}