{
  "FacilityID": 24369,
  "FacilityName": "Lompoc Oil & Gas Plant",
  "FacilityStr1": "3602 Harris Grade Road",
  "FacilityStr2": null,
  "FacilityCity": "Lompoc",
  "FacilityState": "CA",
  "FacilityZipCode": "93456",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06083",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.720833",
  "FacilityLongDecDegs": "-120.425",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 137659471,
  "ParentCompanyName": "Nuevo Energy Companmy",
  "Company2Name": null,
  "CompanyDUNS": 622730711,
  "Company2DUNS": null,
  "OperatorName": "Torch Energy Services Inc.",
  "OperatorStr1": "201 S. Broadway",
  "OperatorStr2": null,
  "OperatorCity": "Orcutt",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93457",
  "OperatorZipCodeExt": null,
  "FTE": 21,
  "OtherEPAFacilityID": "CAO01004837",
  "EPAFacilityID": "100000149476",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "6708",
  "SafetyInspectionDate": "2001-06-18 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-10-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-10-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-10-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-10-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 34.708475,
  "FRS_Long": -120.436583,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 34832,
      "AltID": null,
      "FacilityID": 24369,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 45597,
          "ProcessID": 34832,
          "ChemicalID": 155,
          "Quantity": 160000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 33535,
              "ProcessChemicalID": 45597,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 33536,
              "ProcessChemicalID": 45597,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 33537,
              "ProcessChemicalID": 45597,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 33538,
              "ProcessChemicalID": 45597,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 33539,
              "ProcessChemicalID": 45597,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 33540,
              "ProcessChemicalID": 45597,
              "ChemicalID": 98
            }
          ]
        },
        {
          "ProcessChemicalID": 45598,
          "ProcessID": 34832,
          "ChemicalID": 98,
          "Quantity": 270000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 35694,
          "ProcessID": 34832,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 24369,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-09-01 00:00:00",
    "ERTrainingDate": "2001-10-15 00:00:00",
    "CoordinatingAgencyName": "SBC Fire Department",
    "CoordinatingAgencyPhone": "8056515526",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24369,
      "SummaryText": "1.0  EXECUTIVE SUMMARY\n1.1 Accidental Release Prevention and Emergency Response Policies\n\nNuevo Energy Company (Nuevo) is the owner of the Lompoc Oil and Gas Plant.  Torch Energy Services (Torch) operates the facility for Nuevo.  It is the policy of Nuevo and Torch that its employees, environment, property, and the general public be protected from any off-site impacts that may occur as a result of its operations.  To achieve this end, Torch strives to operate its facilities in compliance with applicable federal, state, and local safety, health, and environmental regulations. Nuevo and Torch have a long-standing commitment to worker and public safety at the Lompoc Oil and Gas Plant.  This commitment is demonstrated by the resources invested in accident prevention (e.g., personnel training, safety consideration in the design, installation, operation, and maintenance of the facility, etc.).  Each company's philosophy is to implement reasonable mitigation measures to eliminate preventable releases of regulated substances as well as non-regulated substances. \n  \nThe company activates its emergency response policies to comply with the overall corporate policy of providing its workers with a safe workplace and of minimizing risk to the public. The safety of emergency and non-affected personnel is the highest priority; therefore, all procedures must be implemented in the appropriate manner (e.g., safely executed rescue and medical activities).  Protection of the environment is also a high priority.  Once the issues of life, safety, and the environmental are addressed, the secondary issues of property conservation and business recovery may be considered.\n\n1.2 Facility Description\n\nThe Lompoc Oil & Gas Plant is located, approximately 12 miles inland from the Pacific Ocean and approximately 1.5 miles northeast of Vandenberg Village.  The nearest public road is Harris Grade Road, approximately ¼ miles to the west.  The facility is relatively remote and bounded by undeveloped pr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24369,
      "SummaryText": "ivate property.  The facility is fenced and assess is control by a locked gate that is manned 24-hours a day.  \nThe Lompoc Oil & Gas Plant is a relatively small industrial operation, occupying approximately 20 acres and consists of a Program 1 process.  The facility receives incoming crude oil and gas from an offshore platform (including some gas from onshore fields) and then utilizes several operations to produce natural gas and natural gas liquids for product.  The incoming oil is processed in the oil treating portion of the facility where water and other contaminates are separated from the crude oil before it is shipped via pipeline to a refinery for further processing.  The incoming gas is treated by removing water, hydrogen sulfide, and other heavy hydrocarbon components.  The hydrocarbon liquids which are separated out are sent to pressure vessels for storage before being trucked offsite to distributors.  The dry natural gas from the process is sold as a product.  \n\n\n1.3 Regulated Substances\n\nRegulated flammable mixtures containing methane, ethane, propane, butane, iso-butane, pentane and iso-pentane are present at the facility.  There are no regulated toxic substances present at the facility in excess of the federal threshold quantities.\n\n1.4  Summary of Offsite Consequence Analysis Results\n1.4.1  Worse-Case Release Scenario- Flammable\n\nThe worse-case release for flammables, as defined in the regulation, is a release of flammable materials resulting in a vapor cloud explosion of the maximum inventory of the largest vessel.  Even though the normal operating inventory for this equipment is often less than the maximum capacity, and this equipment is protected by high level alarms/shutdowns, pressure relief valves, periodic inspections, and routine monitoring by operating personnel, this maximum inventory must be assumed to be released in 10 minutes and ignited at the point of release.  \n\nThe worse-case release scenario modeled for the Lompoc Oil and Gas Plant is"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24369,
      "SummaryText": "a release of the  entire volume of the flammable material stored in one of two butane/propane 30,000 gallon storage vessels.  The worse-case release scenario identified off-site impacts, but the impact area includes minimal public receptors and no residential receptors.  \n\n1.4.2  Flammable Alternative Release Scenario\n\nThe alternative release scenario for flammables is a release of a flammable mixture which results in a vapor cloud fire.  The alternative release scenario could have some off-site impacts, but the impact area includes no residential, environmental, or public receptors.\n\n\n1.5  Summary of Accidental Release Prevention Program \n\nIn addition to being subject to RMP requirements the Lompoc Oil and Gas Plant is subject to the federal Occupational Safety and Health Administration (OSHA) Process Safety Management Program (PSM).  Compliance with PSM's comprehensive program ensures the integrity of the processes which handle flammable materials.  Through compliance with the PSM standard (with minor additions) and based upon the RMP*Comp Version 1.06  Consequence Analysis which show no residential, environmental, or public receptors, Lompoc Oil and Gas Plant fits the criteria of the Program 1  process.  \n\nThe objective of the company's PSM Program is to prevent unwanted releases of hazardous chemicals.   To control these types of hazards, Torch has developed the necessary expertise, experiences, judgement and proactive initiative within their workforce to properly implement and maintain an effective process safety management program.  An effective PSM program requires a systematic approach to evaluating the whole chemical process. Using this approach the following components were considered in the evaluation:  1) the process design; 2) process technology; 3) process changes; 4) operational and maintenance activities and procedures; 5) non-routine activities and procedures; 6) emergency preparedness plans and procedures; 7) training programs; and 8) other elemen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24369,
      "SummaryText": "ts that affect the process.  The various lines of defense that have been incorporated into the design and operation of the process to prevent or mitigate the release of hazardous chemicals have been evaluated and strengthened to assure their effectiveness at each level.  PSM is the proactive identification, evaluation and mitigation or prevention of chemical releases that could occur as a result of failures in process, procedures or equipment. \n\n1.6  Chemical Specific Prevention Steps\n\nIn addition to implementing the PSM elements, the Lompoc Oil and Gas Plant utilizes specific safety features for the prevention, detection and control of releases of regulated (and other) substances.  Control and detection equipment located in and around the facility to minimize the risk of an accident involving hazardous materials at Lompoc Oil and Gas Plant include:\n\n\n· Relief and/or safety valves\n· High temperature alarms and/or shutdowns\n· Flame detectors \n· Combustible Gas Detectors\n· Smoke Detectors\n· Hydrogen Sulfide Monitors\n· Fire Protection System\n· Emergency Shutdown Systems (ESD)\n· Leak Detection System \n\n\n1.7  Five-Year Accident History\n\nThere have been no incidents with off-site impacts involving a regulated substance as defined in the regulation at the Lompoc Oil and Gas Plant in the past five years. \n\n1.8 Emergency Response Program Summary\n\nTorch developed written emergency response procedures to address all elements that may be encountered during planning, response or follow-up of an emergency at the Lompoc Oil and Gas Plant.  These emergency response procedures address releases of regulated substances, including the possibility of fires or explosions.  The procedures address the following issues:  1) various aspects of emergency proper first-aid and medical treatment for exposures; 2) notification of local emergency response agencies; 3) evacuation plans for the Lompoc Oil and Gas Plant and methods of accounting for facility personnel after an evacuation; and 4) post"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 24369,
      "SummaryText": "-incident cleanup/decontamination requirements.  In addition, the Lompoc Oil and Gas Plant follows procedures that address the maintenance, inspection, and testing of emergency response equipment and alarms. \n\nApplication of the emergency response procedures ensures compliance with OSHA Standard 29 CFR 1910.38 (Emergency Action Plans), and the emergency response element of PSM.  The basic concepts of these emergency procedures are to provide a comprehensive approach for managing emergencies.  The four elements of this approach are prevention, preparedness, response, and recovery.\n\n1.9 Planned Changes to Improve Safety\n\nAs a requirement of Santa Barbara County, Torch has performed a Best Available and Safest Technology (BAST) audit of the Lompoc Oil & Gas Plant.  The BAST requirement states that production operations (oil & gas) use the best available and safest technologies wherever failure of equipment would have a significant effect on safety, health, or the environment.  The results of the audit indicate that \"the facility is in compliance with the letter and spirit of the BAST regulation.\"  The audit findings and recommendations are to be reviewed by the Santa Barbara County Systems Safety and Reliability Review Committee for comment.                                                                                                                                                                \n                         \n______________________________________________________________________________________                                                                                                                                                                                                                                                                            \nCalifornia Accidental Release Prevention (CalARP) Program Certification Statement\n\n\nFacility Name: Nuevo Energy Co./Torch Energy Services - Lompoc Oil and Gas Plant\n\n\"Based on the criteria in 40CFR 68"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 24369,
      "SummaryText": ".10, the distance to the specified end point for the worst-case accidental release scenario for the following process is less than the distance to the nearest public receptor: Lompoc Oil and Gas Plant, 3602 Harris Grade Rd., Lompoc, Ca  93436.\n\nWithin the past five years, the process has had no accidental release that caused offsite impacts provided in the risk management program rule (40 CRF 68.10(b)(1)).  No additional measures are necessary to prevent offsite impacts from accidental releases.  In the event of a fire, explosion, or release of a regulated substance from the process, entry within the distance to the specified endpoints may pose a danger to public emergency responders.  Therefore, public emergency responders should not enter this area except as arranged with the emergency contact indicated in the RMP.  The undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate, and complete.\"\n\n\n_____________________                                                           Mr. John Deacon\nSignature                                                                                     Print Name\n\nManager ES & RC                                                                        ___________________\nTitle                                                                                              Date"
    }
  ]
}