{
  "FacilityID": 24384,
  "FacilityName": "Payne Creek Generating Station",
  "FacilityStr1": "6697 County Road 663",
  "FacilityStr2": null,
  "FacilityCity": "Bowling Green",
  "FacilityState": "FL",
  "FacilityZipCode": "33834",
  "Facility4DigitZipExt": "6817",
  "FacilityCountyFIPS": "12049",
  "LEPC": "District 7 LEPC",
  "FacilityLatDecDegs": "27.641667",
  "FacilityLongDecDegs": "-81.9625",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Seminole Electric Cooperative, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 78332657,
  "Company2DUNS": 78332657,
  "OperatorName": "Seminole Electric Cooperative, Inc.",
  "OperatorStr1": "16313 North Dale Mabry Highway",
  "OperatorStr2": null,
  "OperatorCity": "Tampa",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33688",
  "OperatorZipCodeExt": "2000",
  "FTE": 22,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000176891",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "To Be Issued",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-10-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-10-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-10-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-10-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 27.64167,
  "FRS_Long": -81.9625,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 34849,
      "AltID": "Aqueous Ammonia",
      "FacilityID": 24384,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 45617,
          "ProcessID": 34849,
          "ChemicalID": 57,
          "Quantity": 152000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 35711,
          "ProcessID": 34849,
          "NAICSCode": "22111",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 13432,
              "Process_NAICS_ID": 35711,
              "SafetyReviewDate": "2001-10-15 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2001-09-27 00:00:00",
              "ChangeCompletionDate": "2001-01-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2001-05-03 00:00:00",
              "TrainingReviewDate": "2001-10-17 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-05-03 00:00:00",
              "EquipmentInspectionDate": "2001-10-16 00:00:00",
              "EquipmentTested": "All Ammonia System Equipment",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "The process includes one aqueous ammonia storage tank and the SCR process for NOx removal.",
              "_chemicals": [
                {
                  "PrimaryKey": 14079,
                  "PreventionProgram2ID": 13432,
                  "ProcessChemicalID": 45617
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 24384,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2001-10-15 00:00:00",
    "ERTrainingDate": "2001-10-17 00:00:00",
    "CoordinatingAgencyName": "District 7 LEPC",
    "CoordinatingAgencyPhone": "8635347130",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24384,
      "SummaryText": "The Payne Creek Generating Station (PCGS) is a state-of-the-art, natural gas-fired, combined-cycle power generation facility located on a 1,300 acre site at the Polk and Hardee County lines west of County Road 663 in Hardee County, Florida.  The power station uses aqueous ammonia for the selective catalytic reduction (SCR) nitrogen oxides (NOx) emission control system. The ammonia is stored ina 20,000 gallon aboveground storage tank.\n\nSECI recognizes the responsibility in protecting employees and the environment against the hazards of an unintentional release of ammonia.  The safety and health of all employees and the surrounding community is of upmost importance.  The control of accidents associated with ammonia usage at the plant will continue to be a primary responsibility of all PCGS employees.  Employee participation is a primary component in ensuring a successful risk management program.  In the event of an unforeseen release, SECI has coordinated emergency response efforts with the District 7 Local Emergency Planning Committee and the local fire department.  In addition, SECI has retained an emergency response contractor for assistance in the event of an emergency.\n\nOFFSITE CONSEQUENCE ANALYSIS\nThe worst-case release scenario involves the sudden release of the entire contents of a 20,000 gallon tank of aqueous ammonia.  Based on EPA guidance, the worst case scenario involves the complete inventory of the storage tank released over a 10-minute period.  When an averaging time of 60 minutes was used, the Complex Hazardous Air Release Model (CHARM), developed by Radian Corporation, showed that the 1-hour average concentration of 200 ppm traveled a maximum distance of 1,041 feet or 0.2 miles.  \n\nFor the aqueous ammonia tank at PCGS, an alternative scenario would most likely involve a liquid release from pipe failure, tank penetration by external impact, or loading tank pull-away.  The aqueous ammonia system is designed such that all piping downstream of the storag"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24384,
      "SummaryText": "e tank is routed under concrete whenever possible.  Also, the piping is rated for pressures above normal operating range.  Therefore, a piping failure due to impact is not likely.  \n\nPREVENTION PROGRAM\nIn accordance with EPA requirements, a prevention program has been prepared for the aqueous ammonia process at PCGS.  The prevention program was developed for the prevention or minimization of consequences of catastrophic releases of aqueous ammonia.  The following summary addresses each of the prevention program elements and describes the management system in place to implement the program.\n\nSafety Information - SECI maintains a variety of technical documents that are used for reference in maintaining safe operations of the aqueous ammonia process at PCGS.  These documents include information on chemical properties and hazards associated with aqueous ammonia, operating limits, and equipment design and specifications.  Personnel within SECI have been assigned the responsibility of maintaining up-to-date process safety information.\n\nHazard Review - SECI has conducted an evaluation of hazards associated with the aqueous ammonia process using the What-If analysis technique.  The process has been systematically examined to identify hazards and ensure adequate controls are in place to manage the hazards identified during the evaluation.  The analysis was conducted using a team of people who have operation and maintenance experience as well as engineering expertise.  The hazard analysis is updated and revalidated periodically, but not less than every 5 years, as required.\n\nOperating Procedures - SECI maintains written procedures that address various modes of process operations that can be used as a reference by experienced operators and provide a basis for consistent training of new operators.\n\nTraining - SECI has a comprehensive training program for all employees involved in operating the aqueous ammonia process.  In addition to initial training, all operators receive refr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24384,
      "SummaryText": "esher training at least once every 3 years on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.\n\nMaintenance - SECI has established a system of procedures and practices to maintain process equipment and emergency shutdown systems in a safe operating condition.  Maintenance personnel receive training to help ensure that they can perform their work in a safe manner.\n  \nCompliance Audits - SECI periodically conducts audits to determine whether the procedures and practices required by the accident prevention program are being properly implemented.  SECI management will certify that the RMP prevention program has been evaluated at least every 3 years.\n\nIncident Investigation - SECI promptly investigates all incidents that results in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  The investigation is conducted to identify the cause of the incident and develop corrective actions to prevent a recurrence or similar incident.\n\nEmergency Preparedness - SECI has developed a contingency plan that addresses emergency procedures to be used in the unforeseen event of an aqueous ammonia release.  \n\nSAFETY FEATURES\nThe aqueous ammonia tank is supported by saddles and located within a poured concrete secondary containment sized for over 110 percent of tank contents.  The containment has two normally closed drainage valves.  When opened, the first drain allows either leakage or rainwater on the outer truck unloading slab to be drained into the containment.  The second valve allows operators to periodically empty any rainwater situated in the containment.  The tank is protectively coated.  Safety equipment is located at the northeast corner of the containment proximate to the truck unloading area.  An ammonia leakage detector, with control room annunciation, is also present to alarm when ammonia vapor related to a leakage event is detected."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24384,
      "SummaryText": "\n\nACCIDENT HISTORY\nThe aqueous ammonia process at PCGS became operational in October 2001.  No events that qualify as reportable on the 5-year accident history have occurred according to plant personnel and plant records.  \n\nEMEGENCY RESPONSE \nSECI maintains a written emergency response program at PCGS.  The program includes procedures for responding to a release of aqueous ammonia.  In the event of an aqueous ammonia release, employees will activate shutdown procedures, evacuate the plant, and notify local emergency response teams.  The overall emergency response program for PCGS is coordinated with the District 7 Local Emergency Planning Committee (LEPC).  In addition, SECI has made arrangements with an emergency response contractor to provide emergency response services in the event of an unforeseen release.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nSECI expects to improve safety performance by emphasizing employee participation.  SECI management and system operators will be integral in verifying process information, maintaining updated operating procedures, and conducting preventative maintenance inspections.  All recommendations developed during the Hazard Review were designed to improve the safety performance of the aqueous ammonia process.  SECI expects to evaluate each recommendation in a timely manner and implement those recommendations that will reduce the possibility of a release and/or mitigate the consequences of an unintentional release"
    }
  ]
}