{
  "FacilityID": 24466,
  "FacilityName": "Akron Water Supply Plant",
  "FacilityStr1": "1540 Ravenna Road",
  "FacilityStr2": null,
  "FacilityCity": "Kent",
  "FacilityState": "OH",
  "FacilityZipCode": "44240",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39133",
  "LEPC": "Portage County LEPC",
  "FacilityLatDecDegs": "41.18",
  "FacilityLongDecDegs": "-81.336",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": "none",
  "FacilityEmailAddress": "none",
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Akron",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City ofAkron",
  "OperatorStr1": "166 South High Street",
  "OperatorStr2": null,
  "OperatorCity": "Akron",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44309",
  "OperatorZipCodeExt": "3665",
  "FTE": 38,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000102382",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-05-22 00:00:00",
  "SafetyInspectionBy": "OEPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-11-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-11-06 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-11-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-06-10 00:00:00",
  "DeRegistrationEffectiveDate": "2004-05-14 00:00:00",
  "AnniversaryDate": "2006-11-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 41.181572,
  "FRS_Long": -81.339237,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 35025,
      "AltID": "Chlorine",
      "FacilityID": 24466,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 45808,
          "ProcessID": 35025,
          "ChemicalID": 62,
          "Quantity": 200000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 35887,
          "ProcessID": 35025,
          "NAICSCode": "325181",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 19778,
              "Process_NAICS_ID": 35887,
              "SafetyReviewDate": "2001-10-17 00:00:00",
              "PHA_Date": "2001-10-04 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "Yes",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-10-11 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "As of 1/1/01, rail car tank capacity increased from 55 ton to 90 ton.",
              "OpProceduresReviewDate": "2001-10-11 00:00:00",
              "TrainingReviewDate": "2001-10-11 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-10-17 00:00:00",
              "EquipmentInspectionDate": "2001-10-17 00:00:00",
              "EquipmentTested": "Daily inspections of chlorine storage/feed rooms, evaporators and piping performed by WSP operations/maintenance personnel on daily basis.  Entire system reviewed by safety consultant in 2001.",
              "ChangeMgmtDate": "2001-01-01 00:00:00",
              "ChangeMgmtReviewDate": "2001-10-17 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2001-10-18 00:00:00",
              "AuditCompletionDate": "2001-10-18 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-10-17 00:00:00",
              "HotWorkPermitReviewDate": "2001-10-17 00:00:00",
              "ContractorSafetyReviewDate": "2001-10-17 00:00:00",
              "ContractorSafetyEvalDate": "2001-10-17 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 28751,
                  "PreventionProgram3ID": 19778,
                  "ProcessChemicalID": 45808
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 24466,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2001-10-18 00:00:00",
    "ERTrainingDate": "2001-05-22 00:00:00",
    "CoordinatingAgencyName": "City of Kent Fire Department",
    "CoordinatingAgencyPhone": "3306733481",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "Ohio Administrative Code 3745-85-02"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24466,
      "SummaryText": "EXECUTIVE SUMMARY FOR THE CITY OF AKRON\nWATER SUPPLY PLANT RISK MANAGEMENT PLAN\n\nUPDATED OCTOBER, 2001\n\n\nGENERAL\n\nThe Akron Water Supply Plant is a municipally-owned and operated water purification facility.  Chlorine is used in the potable water treatment process for disinfection.  Changes were made to the chlorination system that are reflected by the bold text herein.\n\nThe existing chlorination system utilizes gaseous chlorine and is comprised of equipment in two main locations, the Pretreatment Chemical Building and the Filter Building Head House.  The primary chlorine supply for each location is a single, 90-ton railroad tank car located near the Filter Building Head House.  Liquefied chlorine is supplied from the rail car to each equipment location.  At each location there are two to three, one ton containers of chlorine which are used as back-up to the railroad tank supply.  At the Pretreatment Chemical Building, an additional four, one-ton chlorine containers may be stored.  The total possible quantity of chlorine stored at the Akron WSP is 200,000 pounds.\n\nChlorination equipment at each location includes chlorine container scales, an evaporator and chlorinators.  The average daily chlorine usage at the Akron WSP is approximately 2,000 lbs. per day.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe City of Akron Water Supply Plant's (WSP) approach to chemical safety focuses on training and safety awareness.  Plant operators are annually trained on operational and safety practices associated with chlorine and chlorine feed equipment.  The training program currently utilizes videotape presentations in addition to presentations by local chlorine supply professionals to routinely refresh operators' understanding and knowledge base on the safe handling procedures and accident prevention procedures for chlorine.  The Akron WSP is a secure facility and only authorized plant personnel maintain and handle the chlorine containers and feed equipment."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24466,
      "SummaryText": "Because of the City's commitment to safety and implementation of safe procedures for the chlorine facilities, new policies, procedures and instructional programs have been developed in conjunction with completion of this Risk Management Plan.  A new, updated Emergency Response Plan has been prepared.  The City will continue to coordinate emergency preparedness with the City of Kent Fire Department and the Portage County Local Emergency Planning Committee.  A new management program, training program and Operations and Maintenance Manual have also been developed and will be utilized by the WSP staff to safely manage and operate the chlorine facilities in the near future.\n\nThe City is currently planning to eliminate the use of chlorine by the beginning of 2004.  Disinfection of the finished water will be accomplished by application of liquid sodium hypochlorite upon completion of construction of a new Chemical Building.\n\nWORST-CASE RELEASE SCENARIO\n\nThe Akron WSP uses one 90-ton rail car along with a back-up system utilizing one ton containers.  The one ton containers are used only when switching the rail cars.  The chlorine piping from all sources of chlorine are interconnected, thus making it one source.  The piping conveys liquid chlorine to evaporators which, in turn, feed gas to the chlorine ejectors.\n\nThe worst case scenario assumes the complete release of the 90-ton rail car within the prescribed 10-minute period.  The model used for this scenario is USEPA's RMP Comp.  No passive mitigation factors were used in the RMP Comp model as the rail car is outside when in use.  The outcome of the worst case scenario suggests that an area greater than 14 miles from the WSP may be affected by the complete, instantaneous release of 90-tons of chlorine.  The estimated population affected by this scenario is 411,356 according to the U.S. Department of Commerce, Landview III program, 1997.\n\nALTERNATIVE RELEASE SCENARIO\n\nA Process Hazard Analysis (PHA) was completed by Akron"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24466,
      "SummaryText": "WSP personnel for the chlorination system.  This PHA is included in Appendix C.  Through the PHA process the most likely release scenario was determined to be leakage through valve packing on a 3/4-inch isolation valve.  Model scenarios were not found for this specific scenario.  However, the American Water Works Association Research Foundation Compliance Guidance and Model Risk Management Program for Water Treatment Plants provides useful, similar scenarios in Table 5-5.  Scenario CLA-2 from this Table modeled release of gas through a 1/16-inch diameter hole due to failure of a valve to close.  The release rate of 0.44 pounds per minute from this scenario was applied to the Akron WSP identified alternative case scenario and considered a 10-minute reaction time to address such a leak.  The modeling was completed using RMP Comp and no mitigation factors were used.  The outcome of this alternate case scenario suggests that an area less than 0.1 miles from the WSP may be affected.  The estimated population affected by this scenario is 10 according to the U.S. Department of Commerce, Landview III program, 1997.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\nThe Akron WSP complies with the OSHA Rules and Regulations with respect to the Accidental Release Prevention Program.  Chemical specific prevention steps include compliance with all Ohio EPA requirements , Recommended Standards for Water Works, 1997 (Ten State Standards) and Chlorine Institute Standards and Regulations Concerning Chlorination Equipment and Facilities for Public Water Supplies.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe City of Akron Water Supply Plant has had no accidental releases of chlorine in the past five years.  There have been no accidental chlorine releases in the known history of the plant which resulted in injury to off-site personnel or evacuations.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe key element of the Emergency Response Program is the written Emergency Response Plan"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24466,
      "SummaryText": "on file at the Water Supply Plant and at offices of the City in downtown Akron.  The written Plan includes a Quick Reference Guide which allows an operator to immediately and positively act in case of an observed or detected chlorine leak.  The Portage County Local Emergency Planning Committee is the overall coordinator of emergency response services.  The City will maintain its current approach to first contact the City of Kent Fire Department in case of an emergency as part of the County's current program.  Additional notification procedures are also defined.\n\nThe Emergency Response Plan includes first aid procedures, medical management of chlorine exposure information, emergency response training and pre-emergency coordination guidelines.  A summary of emergency chlorine leak response procedures is also included.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe City of Akron proposes to review and follow guidelines presented in the Emergency Response Plan, Training Program and Management Program for the near future.  However, the City's major plan to improve safety at the Water Supply Plant is to eliminate the use of chlorine.  The City plans to complete construction of a new Chemical Building to support a sodium hypochlorite feed facility.  Within the next two years, the chlorination systems will be abandoned in favor of disinfection by sodium hypochlorite.  The management and safety concerns associated with gaseous chlorine will thereby be eliminated."
    }
  ]
}