{
  "FacilityID": 24522,
  "FacilityName": "Barton Chapel Gas Plant",
  "FacilityStr1": "10 miles west of Perrin/810 Nash Rd",
  "FacilityStr2": "on FM 2210",
  "FacilityCity": "Jacksboro",
  "FacilityState": "TX",
  "FacilityZipCode": "76458",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48237",
  "LEPC": "Jack County LEPC",
  "FacilityLatDecDegs": "33.073333",
  "FacilityLongDecDegs": "-98.187778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.mitchellenergy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 161676952,
  "ParentCompanyName": "Mitchell Gas Services L.P.",
  "Company2Name": null,
  "CompanyDUNS": 5088856,
  "Company2DUNS": null,
  "OperatorName": "Mitchell Gas Services, L.P.",
  "OperatorStr1": "415 CR 3502",
  "OperatorStr2": null,
  "OperatorCity": "Bridgeport",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76426",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000136532",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "O-00734",
  "SafetyInspectionDate": "2000-09-21 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-11-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-11-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-11-06 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-06-10 00:00:00",
  "DeRegistrationEffectiveDate": "2014-06-05 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 33.074243,
  "FRS_Long": -98.190174,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 35091,
      "AltID": "Gas Plant - 1 process",
      "FacilityID": 24522,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 45881,
          "ProcessID": 35091,
          "ChemicalID": 155,
          "Quantity": 280000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 33857,
              "ProcessChemicalID": 45881,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 33858,
              "ProcessChemicalID": 45881,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 33859,
              "ProcessChemicalID": 45881,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 33860,
              "ProcessChemicalID": 45881,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 33861,
              "ProcessChemicalID": 45881,
              "ChemicalID": 107
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 35954,
          "ProcessID": 35091,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 19797,
              "Process_NAICS_ID": 35954,
              "SafetyReviewDate": "1998-02-18 00:00:00",
              "PHA_Date": "1998-07-04 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-03-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-12-20 00:00:00",
              "TrainingReviewDate": "2000-12-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-12-20 00:00:00",
              "EquipmentInspectionDate": "2001-03-15 00:00:00",
              "EquipmentTested": "Glycol Reboiler",
              "ChangeMgmtDate": "2000-12-20 00:00:00",
              "ChangeMgmtReviewDate": "2001-06-22 00:00:00",
              "PreStartupReviewDate": "1998-10-24 00:00:00",
              "ComplianceAuditDate": "2001-03-19 00:00:00",
              "AuditCompletionDate": "2002-03-19 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-01-10 00:00:00",
              "HotWorkPermitReviewDate": "2000-02-16 00:00:00",
              "ContractorSafetyReviewDate": "2001-07-02 00:00:00",
              "ContractorSafetyEvalDate": "2001-07-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 28776,
                  "PreventionProgram3ID": 19797,
                  "ProcessChemicalID": 45881
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 24522,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2001-02-20 00:00:00",
    "ERTrainingDate": "2001-01-10 00:00:00",
    "CoordinatingAgencyName": "Local emerg. planning coord.",
    "CoordinatingAgencyPhone": "9405672324",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 24522,
      "SummaryText": "to ensure\ncontinued safe operation. The following is a description of existing safety features applicable to\nprevention of accidental releases of specific regulated substances in the facility.\n\nThe Barton Chapel gas plant has safety features on many units to help (1) contain/control a\nrelease, (2) quickly detect a release, and (3) reduce the consequences of a release. The following\ntypes of safety features are used in the covered process\n\nRelease Detection\n\n1.    Fire detection systems for the engines.\n\nRelease Containment/Control\n\n1.    Process relief valves to prevent vessel overpressure.\n2.    Valves (both manual and automatic) to permit isolation of the process.\n3.    Automated shutdown systems for specific process parameters (such as high pressure or\n      high level in a vessel).\n4.    Curbing or diking to contain liquid releases.\n\nRelease Mitigation\n\n1.    Fire extinguishing systems. We have numerous fire extinguishers of several sizes\n      throughout the facility. In gas plants such as Barton Chapel gas plant, the control of fire\n      is more dependent on restricting sources of fuel than on putting out the fire.\n\n\nACCIDENT HISTORY\n\nThe Barton Chapel plant has not had an incident over the past five years which has impacted off-site people or structures.\n\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nThe Barton Chapel gas plant maintains a written emergency response program, which is in place\nto protect worker and public safety. The program consists of procedures for responding to a\nrelease, including the possibility of a fire or explosion if a flammable substance is accidentally\nreleased. The procedures address all aspects of emergency response, including proper first-aid and\nmedical treatment for exposures, evacuation plans and accounting for personnel after an\nevacuation, notification of local emergency response agencies and the public if a release occurs. \n\nIn addition, the Barton Chapel gas plant has procedures that address maintenance, inspection and\ntesti"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 24522,
      "SummaryText": "ng of emergency response equipment, as well as instructions that address the use of\nemergency response equipment. Employees receive training in these procedures as necessary to\nperform their specific emergency response duties. The emergency response program is updated\nwhen necessary, based on modifications made to gas plant processes or other plant facilities\n\nThe overall emergency response program for the Barton Chapel gas plant is coordinated with the\nlocal emergency response organizations and the emergency planning committee. This coordination\nprovides a means to notify the public in case of an incident, if necessary, as well as facilitating\nquick response to an incident.\n\nCONCLUSION\n\nThe Barton Chapel gas plant has had very safe operations over its history. However, the facility\ncontinually looks for improvements, both to the process and to safety issues at the facility. Our\ncompany is very active in promoting coordination between the local emergency response agencies\nand our facility personnel. Ongoing communication between our facility and the emergency\nresponders is an integral part of our operations."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 24522,
      "SummaryText": "BARTON CHAPEL RISK MANAGEMENT PLAN\n\n                        EXECUTIVE SUMMARY\n\nThe Barton Chapel gas plant has a long-standing commitment to worker and public safety. This\ncommitment is demonstrated by the resources invested in accident prevention, such as training\npersonnel and considering safety in the design, installation, operation and maintenance of our\nprocesses. Our policy is to implement reasonable controls to prevent foreseeable releases of\nregulated substances. However, if a release does occur, trained personnel will respond to control\nand contain the release.\n\nThe Barton Chapel gas plant, located approximately 10 miles West of Perrin in Jack County,\nTexas, produces natural gas liquids from natural gas. These natural gas liquids are comprised\nprimarily of ethane, propane and butane. Some of the chemicals produced or used include\nmethane, ethane, propane, and butane.\n\nOFFSITE CONSEQUENCE ANALYSIS RESULTS\n\nThere are no toxic chemicals stored at the Barton Chapel gas plant above the EPA Threshold\nQuantity. The threshold quantity is the level set by EPA for each toxic or flammable chemical\nwhich if stored at the site requires compliance with the EPA's Risk Management Program\nregulations. Generally, if the amount of a substance stored on-site is less than the threshold\nquantity, there is little danger to the public.\n\nThere are several flammable substances stored at the site above the 10,000 pound threshold\nquantity for flammables. Examples of flammables at the site include ethane, propane and butane.\nThe worst-case scenario associated with a release of flammable materials is a vapor cloud\nexplosion (VCE) involving the full inventory of a 30,000 gallon storage tank containing natural\ngas liquids. Assuming the material in the tank is primarily propane, the distance away from the\nplant affected in this worst-case scenario would be approximately 0.43 miles, based on EPA\nanalysis. \n\nA more probable release scenario would involve the release of natura"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24522,
      "SummaryText": "l gas condensate from a\ntransfer line during loading. Based on the pump capacity of approximately 150 gallons/minutes\n(9000 gallons in one hour), we would release approximately 1500 gallons in 10 minutes, at which\ntime our operators or the truck driver would detect and isolate the leak. The affected distance\nbased on EPA guidance is approximately 0.15 miles, or approximately 780 feet.\n\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM\n\nThe Barton Chapel gas plant has a very active accident prevention program in place, primarily\nbased on the OSHA Process Safety Management regulations. A summary of some of the accident\nprevention programs that are in place follows.\n\nProcess Safety Information\n\nThe Barton Chapel gas plant keeps a variety of technical documents that are used to help maintain\nsafe operation of the processes. These documents include material safety data sheets for all\nchemicals on-site, up-to-date process and instrumentation drawings, equipment data sheets on all\nvessels and equipment and process parameter safety limits. This information, in combination with\nwritten procedures and trained personnel, provides a basis for establishing inspection and\nmaintenance activities, as well as for evaluating proposed process and facility changes to ensure\nthat safety features in the process are not compromised.\n\n\nProcess Hazard Analysis (PHA)\n\nThe Barton Chapel gas plant has a very comprehensive program to ensure that hazards associated\nwith the various processes are identified and controlled. Each process is systematically examined\nto identify hazards and ensure that adequate controls are in place to manage these hazards. The\nwhat-if/checklist analysis technique is used to perform these evaluations. The analyses are\nconducted using a team of people with operating, maintenance, engineering and safety experience.\nThis team identifies and evaluates hazards of the process, as well as accident prevention and\nmitigation measures, and makes suggestions for additional prevention"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24522,
      "SummaryText": "and/or mitigation measures\nwhen the team believes such measures are necessary. All approved recommendations from the\nPHA team findings are tracked until they are completed. \n\nTo help ensure that the process controls and/or process hazards do not eventually deviate\nsignificantly from the original design and to ensure that new technology is used where\nappropriate, the Barton Chapel gas plant periodically updates and revalidates the hazard analysis\nresults. These periodic reviews will be conducted at least every 5 years.\n\n\nOperating Procedures\n\nThe Barton Chapel gas plant maintains written procedures that address various modes of process\noperations. These procedures are used as reference by experienced operators, and provide a basis\nfor consistent training of new operators. These procedures are periodically reviewed and certified\nas current and accurate.\n\n\nTraining\n\nOur employees at the Barton Chapel plant have an average experience of over 20 years. This level\nof experience provides a great level of expertise throughout the facility. Ongoing training is\naccomplished through routine safety meetings, scheduled training in new processes and refresher\ntraining on operating procedures. \n\n\nContractors\n\nThe Barton Chapel gas plant uses contractors to supplement its workforce during periods of\nincreased maintenance or to assist with specialized projects. Contractors are advised about safety\nand health hazards, emergency response requirements and safe work practices prior to their\nbeginning work. In addition, the company evaluates contractor safety programs and performance\nduring the selection of a contractor. Gas plant personnel routinely monitor contractor\nperformance to ensure that contractors are fulfilling their safety obligations.\n\n\nMechanical Integrity\n\nThe Barton Chapel gas plant has well-established practices and procedures to maintain our\nequipment in a safe operating condition. The basic aspects of this program include inspections,\ntests and corrections of identifie"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24522,
      "SummaryText": "d deficiencies. Inspections and tests are performed to help ensure\nthat equipment functions as intended, and to verify that equipment operates within acceptable\nlimits. If a deficiency is identified, employees will correct the deficiency before placing the\nequipment back in service or they will determine what actions are necessary to ensure safe\noperation of the equipment.\n\n\nSafe Work Practices\n\nThe Barton Chapel gas plant has long-standing safe work practices to help ensure worker and\nprocess safety. Examples of these include lockout/tagout to ensure isolation of energy sources for\nequipment that is being worked on, a permit and procedure for hot work and a permit and\nprocedure for confined space entry. These procedures (and others), along with training of affected\npersonnel, form a system to help ensure that operations and maintenance activities are performed\nsafely.\n\n\nManagement of Change\n\nThe Barton Chapel gas plant has a comprehensive system to manage changes to all covered\nprocesses. This system requires changes to items such as process equipment, chemicals,\ntechnology (including operating conditions), procedures and other facility changes be properly\nreviewed and authorized before being implemented. Changes are reviewed to ensure that adequate\ncontrols are in place to manage any new hazards and to verify that existing controls have not been\ncompromised by the change. Operating and maintenance personnel are provided any necessary\ntraining on the change.\n\n\n\n\nIncident Investigation\n\nThe Barton Chapel gas plant promptly investigates all incidents that resulted in, or reasonably\ncould have resulted in, a fire/explosion, toxic gas release, major property damage, environmental\nloss or personal injury. The goal of each investigation is to determine the facts and develop\ncorrective actions to prevent a recurrence of the incident or a similar incident.\n\n\n\nCHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe processes at the Barton Chapel gas plant have hazards that must be managed"
    }
  ]
}