{
  "FacilityID": 24529,
  "FacilityName": "Firestone Building Products -Salt Lake City",
  "FacilityStr1": "3790 W. 2555 South",
  "FacilityStr2": null,
  "FacilityCity": "West Valley City",
  "FacilityState": "UT",
  "FacilityZipCode": "84120",
  "Facility4DigitZipExt": "7203",
  "FacilityCountyFIPS": "49035",
  "LEPC": "West Valley City LEPC",
  "FacilityLatDecDegs": "40.714167",
  "FacilityLongDecDegs": "111.7125",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Firestone Building Products Company",
  "Company2Name": null,
  "CompanyDUNS": 1288109,
  "Company2DUNS": 1288109,
  "OperatorName": "Firestone Building Products Company",
  "OperatorStr1": "3790 W. 2555 So.",
  "OperatorStr2": null,
  "OperatorCity": "West Valley City",
  "OperatorStateFIPS": "UT",
  "OperatorZipCode": "84120",
  "OperatorZipCodeExt": "7203",
  "RMPContact": "Michael McCrea",
  "RMPTitle": "Plant Manager",
  "FTE": 17,
  "OtherEPAFacilityID": "84120THRML3790W",
  "EPAFacilityID": "100000176908",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "DAQE-193-01",
  "SafetyInspectionDate": "1992-11-06 00:00:00",
  "SafetyInspectionBy": "11/06/92",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-11-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-11-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-11-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-10-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 35098,
      "AltID": "Process uses a RTO for em",
      "FacilityID": 24529,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 35961,
          "ProcessID": 35098,
          "NAICSCode": "32615",
          "_desc": {
            "NAICS_CODE": "32615",
            "NAICS_DESCRIPTION": "Urethane and Other Foam Product (except Polystyrene) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 45896,
          "ProcessID": 35098,
          "ChemicalID": 115,
          "Quantity": 106600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 115,
            "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
            "CASNumber": "78-78-4",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 545896,
          "ProcessID": 35098,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24529,
      "SummaryText": "Firestone is dedicated to protecting its employees, the community, and the environment from highly hazardous incidents through safely operating our facility.\n\nFacility Overview\nThe Firestone Building Products facility in Youngwood, Pennsylvania, uses pentane as the blowing agent to produce foam panels to be used as building insulation.  The facility includes raw material unloading and storage, material blending operations, panel production and cutting, product storage, and loading operations.  Pentane will arrive by truck and will be stored in an 20,000-gallon horizontal fixed roof tank.  The tank will be maintained under pressure and will be vented back to the supply tanker during loading.\n\nChemical Safety Overview\nThe facility's overall approach and commitment to chemical safety is demonstrated by 1) the existing management, training, procedure and maintenance systems already in place at the facility, and 2) the hazard assessment, prevention program and emergency response provisions implemented specifically for pentane in response to the RMP requirements.  The management structure and oversight to ensure safety is documented in the facility's RMP and includes compliance with applicable regulations, codes and standards (OSHA PSM Standard and US EPA 40 CFR 68).\n\nRelease Scenarios\nWorst-case and alternative release scenario assessments were conducted for the facility's single largest vessel based on US EPA's Offsite Consequence Analysis guidance.  The worst-case release scenario for pentane is a vapor cloud explosion of 118000 pounds of pentane and the alternatve release scenario assumes a vapor cloud fire resulting in a release rate of 833.5 pounds per minute of pentane.  Public receptors were determined to be located within the impact zone of both the worst-case and alternative releases.  The resulting worst-case and alternative release impact zones were 0.40 miles and less than 0.1 miles, respectively.\n\nFive-Year Accident History\nThe facility has had no RMP report"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24529,
      "SummaryText": "able accidents/releases of pentane within the preceding five years.\n\nPrevention Program\nThe facility has implemented a Program Level 3 Prevention Program for pentane, as required by the RMP rule, in accordance with the US EPA guidance.  These prevention program provisions are specifically intended to minimize the probability and/or consequence of any accidental pentane release from the facility and include such measures as process hazards analysis, operating procedures, training, contractors, pre-start-up safety, mechanical integrity, hot work permit, management of change, incident investigation, emergency planning and response, and compliance audits.  The facility prevention program is an ongoing system based on periodic training, incident investigations, audits, procedure revisions, and RMP updates as required to reflect facility change and RMP requirements.\n\nEmergency Response Program\nThe facility's Emergency Response Program  has been perfected to produce the maximum effective response in the least amount of time.  The facility has coordinated response with the local fire station and the Local Emergency Planning Committee (LEPC) to ensure that they will respond to any accidental release from the pentane system.  The facility has also established a notification mechanism to ensure the fire station will be properly notified when any response is needed for a pentane release.  Based on this coordination with the local emergency responders, the facility is not required to implement additional RMP emergency response program requirements.\n\nSafety Management and Changes\nThe facility is committed to ensuring its operations are safe and in accordance with all RMP requirements, and has established a senior manager responsible for RMP development, implementation, and compliance.  This manager is committed to maintain the safety of the RMP covered pentane system through active adherence to the appropriate procedures and codes.  To ensure that the appropriate changes occur as"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24529,
      "SummaryText": " necessary to maintain/improve safety, ongoing hazard reviews, training, audits, maintenance and investigations will be conducted as required by RMP.  Updates to the RMP will be completed as necessary in response to these activities.\n\nSummary\nAs documented in this submittal, the RMP for the facility has been completed in accordance with all 40 CFR 68 requirements and the facility has certified compliance.  Firestone takes pride in and is committed to conducting business in strict conformity with all applicable laws in a safe and responsible manner.  The very highest priority is placed on the health and safety of Firestone's associates and the community in which we conduct business."
    }
  ]
}