{
  "FacilityID": 24535,
  "FacilityName": "Bessemer Water Filtration Facility",
  "FacilityStr1": "250 Link Road",
  "FacilityStr2": null,
  "FacilityCity": "Bessemer",
  "FacilityState": "AL",
  "FacilityZipCode": "35023",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01073",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "33.514167",
  "FacilityLongDecDegs": "87.123333",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "A5",
  "LatLongDescription": "LW",
  "FacilityURL": "www.covantaenergy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Covanta Energy Corporation",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Covanta Energy Corporation",
  "OperatorStr1": "40 Lane Road",
  "OperatorStr2": null,
  "OperatorCity": "Fairfield",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07007",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000177104",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Water Disinfection Process",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-11-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-11-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-11-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2019-05-22 00:00:00",
  "DeRegistrationEffectiveDate": "2019-04-24 00:00:00",
  "AnniversaryDate": "2006-11-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 33.515907,
  "FRS_Long": -87.1222,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 35105,
      "AltID": "Water Disinfecting Proces",
      "FacilityID": 24535,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 45903,
          "ProcessID": 35105,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 35972,
          "ProcessID": 35105,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 19807,
              "Process_NAICS_ID": 35972,
              "SafetyReviewDate": "2001-05-02 00:00:00",
              "PHA_Date": "2001-05-02 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-05-02 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2001-10-03 00:00:00",
              "TrainingReviewDate": "2000-09-08 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-10-10 00:00:00",
              "EquipmentInspectionDate": "2001-10-10 00:00:00",
              "EquipmentTested": "10/10/2001",
              "ChangeMgmtDate": "2000-10-01 00:00:00",
              "ChangeMgmtReviewDate": "2001-05-02 00:00:00",
              "PreStartupReviewDate": "2001-10-10 00:00:00",
              "ComplianceAuditDate": "2001-05-02 00:00:00",
              "AuditCompletionDate": "2001-05-02 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-10-10 00:00:00",
              "HotWorkPermitReviewDate": "2001-05-02 00:00:00",
              "ContractorSafetyReviewDate": "2001-05-02 00:00:00",
              "ContractorSafetyEvalDate": "2001-05-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 28786,
                  "PreventionProgram3ID": 19807,
                  "ProcessChemicalID": 45903
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 24535,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2001-10-10 00:00:00",
    "ERTrainingDate": "2001-10-10 00:00:00",
    "CoordinatingAgencyName": "Jefferson Co. LEPC",
    "CoordinatingAgencyPhone": "2052542039",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24535,
      "SummaryText": "1.0 EXECUTIVE SUMMARY\n\n\n1.1 ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICY SUMMARY\n\nThe United States Environmental Protection Agency (EPA) has established a regulatory program to prevent accidental releases of certain regulated substances that may potentially affect public health and the environment. The rule (40 CFR Part 68) requires that some 66,000 facilities across the United States in various industries develop a Risk Management Program (RMP).  The RMP incorporates various required elements into a program designed to prevent accidental releases of regulated substances and establish emergency response preparedness in the event of an accidental release of such regulated substances.  The RMP must be submitted to the EPA by the owner or operator of any facility that has a process containing more than the threshold quantity of any of the regulated substances that is covered under the RMP rule.  Pursuant to the RMP rule, Bessemer Water Filtration Facility (BWFF) has submitted this RMP for chlorine. \n \nChlorine is used at the Bessemer Water Treatment Facility exclusively as a reagent for the water treatment process.  The quantity stored on site exceeds the 2,500-pound threshold for coverage under the RMP program.  Currently, the maximum potential amount of chlorine to be present on site at any time is 16,000 pounds.  Except during delivery, all of the chlorine is stored within an enclosed building.\n\nBWFF operates the water treatment facility located in Bessemer, Alabama in a manner that is protective of the health and safety of BWFF employees, contractor employees, the public and the environment. In addition, BWFF is committed to operating the water treatment facility in full compliance with applicable Occupational Safety and Health Administration (OSHA) requirements, federal regulatory requirements and applicable state and/or local requirements.\n\nBWFF previously developed an OSHA Process Safety Management (PSM) Program for chlorine. The OSHA PSM rule gu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24535,
      "SummaryText": "ides employees in the preventative maintenance, safe management and operation of processes that use regulated substances, and aims to protect employees from accidental releases of these materials on-site. The EPA's RMP regulation builds and expands upon the OSHA PSM program by requiring facilities to evaluate off-site impacts to public and environmental receptors, in the event of an accidental release. Key elements of the OSHA PSM program have been incorporated into the EPA RMP regulation.\n\nAs part of the EPA RMP effort, BWFF has updated the OSHA PSM program for chlorine and the associated Hazard Review Analysis.  Among the other important components of BWFF's RMP are the policies and procedures for operation and maintenance of the facility, and facility-specific Emergency Response Plan (ERP). \n\nBWFF's Facility Manager has the primary responsibility for this RMP and its implementation.\n\n\n1.2 STATIONARY SOURCE DESCRIPTION\n\nThe BWFF is an 18 million-gallon-per-day water treatment and filtration system, operated by Covanta Water Systems for the City of Bessemer, Alabama.  \n\nOne process at the BWFF involves the use of a substance regulated under 40 CFR Part 68, thereby requiring the preparation and implementation of an RMP. This covered process is the water treatment process (discussed in Section 1.1 above) that utilizes chlorine. \n\nChlorine System\n\nA maximum quantity of 16,000 pounds of chlorine is stored at the BWFF in eight one-ton cylinders.  This quantity is cannot be exceeded because no more than eight one-ton cylinders can be stored in the storage room at any one time.\n\nBoth passive and active mitigation measures are used by the BWFF to limit the likelihood and/or severity of an accidental release of chlorine. Passive mitigation systems do not require human, mechanical or energy input, such as the concrete storage building where the chlorine cylinders are stored. Conversely, active mitigation systems do require human, mechanical or energy input for initiation. Le"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24535,
      "SummaryText": "ak detectors and alarms, chlorine scrubber, pressure sensing valves, and emergency shut-off devices are examples of the active mitigation systems in place at the BWFF. \n\n\n1.3 WORST CASE AND ALTERNATIVE CASE ACCIDENTAL RELEASE SCENARIOS\n\nChlorine\n\nWorst Case Accidental Release Scenario\n\nFor each covered process at a facility, 40 CFR 68 requires that a worst case accidental release scenario be developed based on several worst case assumptions, as discussed herein. The most unlikely, worst case accidental release scenario for the BWFF chlorine system as defined by the regulation could only occur as a result of catastrophic failure of the chlorine storage tank(s).  Such an occurrence would only be precipitated by a most unusual event or an unlikely set of conditions.\n\nThe regulation specifies that the worst case, accidental release quantity for the BWFF must be the maximum amount of chlorine held in the largest, single vessel taking into account administrative controls that limit this maximum storage quantity. In the case of the BWFF set-up, four of the eight one-ton cylinders are linked to a manifold at any one time.  Hence, a catastrophic release could include four of the eight cylinders so a total of 8,000 pounds must be considered.  \n\nA release rate of 10-minutes is specified in the regulation for the worst case analysis of substances that are normally gases at ambient temperature and handled as a gas or as a liquid under pressure, such as chlorine. This release rate is based on the EPA's Technical Guidance for Hazards Analysis, which is consistent with other mechanisms used for community emergency planning activities under the Emergency Planning and Community Right-to-Know Act (EPCRA). Furthermore, the regulation stipulates that active mitigation systems (such as excess flow valves and the BWFF alarm system) cannot be considered in defining the worst case scenario, and assumes that all released chlorine would be released to the atmosphere in defining the worst case"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24535,
      "SummaryText": "scenario. On the other hand, the regulation does allow a reduction in the worst case offsite consequence scenario due to the concrete storage building.  Based on these parameters set by the regulation, the storage building was considered in the worst case accidental release scenario.\n\nAdditional conservative assumptions have been specified by the EPA in the analysis of the worst case accidental release scenario. These assumptions are a low wind speed, a highly stable atmosphere and use of the maximum ambient temperature over a three-year period. These worst case assumptions are used to predict a highly conservative distance to a toxic endpoint as defined by the regulations. For chlorine, the toxic endpoint is specified as an airborne concentration of 0.0087 milligrams per liter (mg/L) or 3 parts per million (ppm). This endpoint is based upon the Emergency Response Planning Guideline (ERPG-2) as developed by the American Industrial Hygiene Association (AIHA). This value represents the maximum airborne concentration below which nearly all individuals could be exposed for one-half to one hour without experiencing or developing irreversible or other serious human health effects or symptoms that could impair their ability to take protective action.\n\nFor the BWFF, the worst case accidental release scenario for chlorine, as defined by the EPA, would involve a release of 8,000 pounds of chlorine gas, over a period of ten minutes. The distance to the toxic endpoint for chlorine was determined using the EPA Look-up Tables.\n \nBased upon the worst case assumptions discussed above , the worst case accidental release scenario is projected to reach an off-site endpoint.  Public receptors and one environmental receptor are located within this projected area.  Public receptors are defined by the regulation to include off-site residences; institutions; industrial, commercial and office buildings, and parks or recreational areas inhabited or occupied by the public. Environmental rece"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 24535,
      "SummaryText": "ptors as defined by the regulations include National or State parks, forests or monuments, officially designated wildlife sanctuaries, preserves, refuges, or areas and Federal wilderness areas.\n\nThe worst case accidental release scenario requires that the assumption be made that a gaseous release of chlorine would behave as a dense gas, hanging close to the ground.  Dispersion in any direction from BWFF would be determined by wind direction and speed and impact, realistically, a small area.\n \nAlternative Accidental Release Scenario\n\nA more realistic, alternative accidental release scenario was evaluated for chlorine, in accordance with EPA regulations. The alternative release scenario was chosen based upon the results of a Hazard Risk Analysis and is summarized below.\n\nThe PHA revealed that the most likely alternative scenario would be for the distribution system piping to fail between the cylinders and the chlorinators within the cylinder storage room.  Should this failure occur, the BWFF the chlorine detection system would be activated (active mitigation) and the valves from the cylinders would automatically shut off.  Since the pipes are small and hold much less than the RQ for chlorine (i.e., 10 pounds), the actual amount of chlorine released into the room would be very small.  Additionally, personnel from the BWFF would be alerted by the alarm system that such and event had happened and implement a response to the incident.  Finally, the chlorine scrubbing system, capable of removing 2,000 lbs of chlorine from the air within the room, would prevent any releases to the outside atmosphere.\n\nAssumptions for ambient conditions, including a wind speed, atmospheric stability, and ambient temperature were used for the alternative scenario analysis, based on the EPA's RMP Offsite Consequence Analysis Guidance (OCAG) and EPA Lookup Tables.  Active mitigation systems are considered in the alternative accidental release scenario analysis.\n\nThe alternative accidental relea"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 24535,
      "SummaryText": "se scenario, using the assumptions discussed above, is not projected to reach an offsite endpoint. Consequently, no environmental or public receptors would be impacted.\n\nIn the event of an actual release, all of the active and passive mitigation systems/features that are available on the chlorine system at the BWFF would be used to contain the spread of any accidental release and mitigate potential impacts of the release. The mitigation systems/features include: an 8\" concrete block building where the chlorine cylinders are located and associated equipment, leak detectors and alarms, excess flow valves, pressure sensing valves, emergency shutoff devices and the Sentry 2000 chlorine scrubber system. \n\n\n1.4 ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe BWFF has an accidental release prevention program that is based upon a foundation of employee awareness and proactive system maintenance. This program is documented in the RMP, and meets the requirements of the RMP regulation.\n\nThe BWFF provides process safety information to employees through written materials, such as Material Safety Data Sheets, various operating and maintenance manuals, system descriptions and safety procedures. Employees attend periodic training and contractors are briefed on process hazards prior to working on-site. Preventive maintenance and regular inspections are conducted for maintaining mechanical integrity. Inspections and testing are scheduled through the preventative maintenance program and/or as required by OSHA. Hazard analysis documents are reviewed periodically and updated as required. Compliance audits are used to evaluate the need for revising or updating the procedures related to the processes.\n\n\n1.5 FIVE YEAR ACCIDENT HISTORY\n\nFor the five years prior to the submission of this RMP, there have been no accidental releases as defined in 40 CFR Part 68.42(a) at BWFF that resulted in injuries or death either on-site (i.e., Facility or contractor employees) or off-site (i.e., the public)."
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 24535,
      "SummaryText": "Since there has not been an accidental release, there has not been a need for sheltering in place or evacuation; nor has damage to property or environmental receptors ever occurred as a result of an accidental release. \n\n\n1.6 EMERGENCY RESPONSE PROGRAM\n \nThe BWFF has an Emergency Response Plan (ERP) that defines the sequence of actions to be taken by BWFF employees in the event of an accidental release of chlorine. This ERP has been communicated to the local Fire Department and the Local Emergency Planning Committee (LEPC). Individuals who are likely to witness or discover a release have been trained to initiate an emergency response sequence by notifying the proper authorities.  It is currently BWFF's policy that individuals that have received the requisite training will attempt to secure a release of chlorine if the action can be taken without significant risk of injury or death. The Incident Commander from the local emergency response agency is presently responsible for determining when sheltering-in-place or evacuation of off site areas is necessary, and also for public notification.\n\n\n1.7 PLANNED CHANGES TO IMPROVE SAFETY\n\nThis RMP incorporates a number of procedures and steps to be incorporated into the BWFF procedures, which are designed to improve employee safety awareness and enhance safe operations.  These enhancements were developed as a result of the Process Hazard Analysis for chlorine. Also, key items have been added to the preventive maintenance program for the chlorine. These enhancements ultimately reduce the likelihood of an accidental release. Further, emergency response procedures have been reviewed and coordinated with local response entities to increase the speed and effectiveness of a response should a release occur."
    }
  ]
}