{
  "FacilityID": 24629,
  "FacilityName": "ENNIS-TRACTEBEL POWER COMPANY, LP",
  "FacilityStr1": "4001 West Ennis Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Ennis",
  "FacilityState": "TX",
  "FacilityZipCode": "75119",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48139",
  "LEPC": "Ennis Fire Department",
  "FacilityLatDecDegs": "32.32025",
  "FacilityLongDecDegs": "-96.673917",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "ST",
  "FacilityURL": "www.tractebelusa.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "TRACTEBEL NORTH AMERICA, INC.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "ENNIS-TRACTEBEL POWER COMPANY, LP",
  "OperatorStr1": "4001 West Ennis Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Ennis",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75119",
  "OperatorZipCodeExt": null,
  "FTE": 17,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000177202",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "40363/PSDTX-927",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-11-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-11-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-11-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-11-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 32.32025,
  "FRS_Long": -96.67392,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 35228,
      "AltID": "Aqueous Ammonia System",
      "FacilityID": 24629,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 46062,
          "ProcessID": 35228,
          "ChemicalID": 57,
          "Quantity": 130000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 36095,
          "ProcessID": 35228,
          "NAICSCode": "221122",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 13566,
              "Process_NAICS_ID": 36095,
              "SafetyReviewDate": "2001-09-01 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2001-07-19 00:00:00",
              "ChangeCompletionDate": "2002-03-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2001-07-31 00:00:00",
              "TrainingReviewDate": "2001-09-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-07-31 00:00:00",
              "EquipmentInspectionDate": "2001-09-01 00:00:00",
              "EquipmentTested": "Aqueous ammonia storage tank, pumps, SCR, and piping",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "A Risk Management Program has been developed for the aqueous ammonia process at the facility.  There are no other regulated processes at the facility.",
              "_chemicals": [
                {
                  "PrimaryKey": 14219,
                  "PreventionProgram2ID": 13566,
                  "ProcessChemicalID": 46062
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 24629,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2001-10-01 00:00:00",
    "ERTrainingDate": "2001-11-01 00:00:00",
    "CoordinatingAgencyName": "Ennis Fire Department",
    "CoordinatingAgencyPhone": "9728753473",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24629,
      "SummaryText": "Ennis-Tractebel Power Company, LP operates a 350 megawatt (MW) electrical generation facility in Ennis, Ellis County, Texas.  The facility began commercial operation in September 2001.  The land use immediately surrounding the facility is rural.\n\nThe facility combusts natural gas in one combustion turbine to generate electricity.  The combustion turbine is equipped with a heat recovery steam generator (HRSG) that utilizes waste heat from the exhaust to convert water to steam.  The steam from the HRSG is utilized to drive a steam turbine.  Electricity is generated at the gas turbine and the steam turbine.  A selective catalytic reduction (SCR) system is located within the HRSG to reduce nitrogen oxide (NOx) emissions from the combustion turbine exhaust gas.  The SCR consists of a catalyst and injection grid within the HRSG.  Ammonia is injected through the grid upstream of the catalyst.  The ammonia mixes with the exhaust gas, and as the exhaust/ammonia mixture passes through the catalyst, NOx emissions are reduced to nitrogen and water.\n\nThe ammonia injected into the HRSG is stored as 28 weight percent (wt%) aqueous ammonia in a 20,000-gallon storage tank.  No more than 17,000 gallons (approximately 130,000 lbs.) of aqueous ammonia is stored on-site at any time.  The aqueous ammonia is pumped from the storage tank to an ammonia skid and mixed with high temperature exhaust gas from the HRSG in a packed tower.  Upon being vaporized, the mixture is directed back to the HRSG and injected upstream of the catalyst bed.\n\nAs more than 20,000 lbs. of 28 wt% aqueous ammonia will be on-site, the ammonia system is regulated under 40 CFR Part 68 (Risk Management Program regulations).  These regulations require the development of written programs and procedures to reduce the risk of accidental release of aqueous ammonia.  The elements of these programs and procedures include standard operating procedures, employee training, preventative maintenance, and emergency response.\n\nThe f"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24629,
      "SummaryText": "acility has implemented environmental programs and procedures to ensure compliance with environmental regulations.  It is the intent of Ennis-Tractebel Power Company, LP to ensure that risks associated with plant operations are minimized, and plant employees, nearby populations, and the environment are protected.\n\nThe Plant Manager has overall responsibility for maintaining the Risk Management Program.  Responsibilities for specific program elements are shared among the Plant Manager, the Plant Engineer, and the Operator Technicians.\n\nSafety information is maintained on-site at the facility.  To date, no modifications to the safety information have been made.  Standard operating procedures have been implemented at the facility and address the operating conditions of the aqueous ammonia system.  A preventative maintenance program is in place and consists of maintenance procedures and testing and inspection schedules.  Hot works procedures, along with other hazard permits (general work permit, lockout/tagout, etc.), exist at the facility and are applicable to work conducted on-site.  Contractors working on the ammonia system or other equipment/systems are required to comply with the facility's contractor safety program. \n\nPlant personnel must complete initial and refresher training on procedures applicable to their position.  Operators undergo a qualification process that addresses the aqueous ammonia system standard operating procedures and preventative maintenance procedures as well as emergency response training.\n\nCompliance audits are to be conducted on a triennial basis.  The audits will focus on the aqueous ammonia system and related standard operating procedures.  Additionally, interviews with plant personnel will be conducted to ensure that the aqueous ammonia system is designed and operated in accordance with the appropriate safety information.  \n\nEmployee participation is a key to safe operation of the facility.  Employees are included in hazard reviews and "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24629,
      "SummaryText": "incident investigations.  In addition, employees hold safety meetings and participate in periodic emergency response drills.\n\nThe initial hazard review was conducted in July 2001 before plant startup.  The hazard review identified the hazards associated with the process, opportunities for equipment malfunctions or human errors that could cause an accidental release, safeguards used or needed to control the hazards or prevent equipment malfunctions or human error, and steps used or needed to detect or monitor releases.  Once the hazard review was completed, a list of recommendations was developed and reviewed by plant personnel and management.  The recommendations are in the process of being implemented at the site to further reduce the risk associated with the aqueous ammonia system.\n\nA hazard assessment was completed to comply with the Risk Management Program regulations. The hazard assessment consisted of analyzing the effects of a worst-case release scenario and an alternative case release scenario.  The U.S. Environmental Protection Agency (EPA) in 40 CFR 68.3 defines the worst-case release as \"the release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to an endpoint.\"  This definition gives no consideration to actual probability; therefore, the worst-case release scenario was analyzed as being a complete failure of the aqueous ammonia storage tank and release of the entire contents to form an evaporation pool.  The surface area of the pool was limited by the dimensions of the secondary containment that was designed to hold the maximum storage volume of the tank.  The EPA Risk Management Program Guidance for Offsite Consequence Analysis (OCA) was utilized to determine off-site impacts and the endpoint distance.\n \nAn alternative case release scenario was also analyzed.  The alternative case release scenario was analyzed as the formation of a one-half inch diameter hole in the transfer l"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24629,
      "SummaryText": "ine between the supply or offloading tank truck and the aqueous ammonia storage tank.  Since the truck is manned during offloading of the aqueous ammonia, it was assumed that the truck-mounted pump could be shut off almost instantaneously, but head pressure from the tank would continue the flow of aqueous ammonia through the hole.  The OCA guidance was again used to determine off-site impacts and the endpoint distance.  This scenario estimates that it will take approximately 60 minutes to respond and mitigate the accidental release.\n\nAs this facility is anticipated to be completing construction and begin initial operation in August 2001, there is no prior operating history and, therefore, no accidents or releases from the aqueous ammonia system within the past five years.\n\nAn emergency response program has been implemented at the facility.  The emergency response program includes an emergency response plan and coordination of emergency information and activities with the City of Ennis Fire Department.  The emergency response plan contains the information and procedures necessary to respond to a release of aqueous ammonia.  Emergency information includes a list of emergency response personnel, notification requirements, evacuation procedures, and health/first aid data.  A copy of the emergency response program has been provided to the City of Ennis Fire Department.  Officials from the City of Ennis Fire Department have toured the facility to familiarize its personnel with plant operations and the locations of potential hazards.  In addition, facility personnel are trained in the procedures necessary to respond to emergency releases."
    }
  ]
}