{
  "FacilityID": 24659,
  "FacilityName": "Minnesota Diverisfied Products, Inc.",
  "FacilityStr1": "9091 County Road 50",
  "FacilityStr2": null,
  "FacilityCity": "Rockford",
  "FacilityState": "MN",
  "FacilityZipCode": "55373",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27053",
  "LEPC": null,
  "FacilityLatDecDegs": "45.083139",
  "FacilityLongDecDegs": "-93.732556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.diversifoam.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6200836,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Mr. Benjamin G. Sachs",
  "OperatorStr1": "9091 County Road 50",
  "OperatorStr2": null,
  "OperatorCity": "Rockford",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55373",
  "OperatorZipCodeExt": null,
  "FTE": 60,
  "OtherEPAFacilityID": "MND982622882",
  "EPAFacilityID": "100000177284",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1995-11-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-12-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-11-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-11-28 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2011-11-21 00:00:00",
  "DeRegistrationEffectiveDate": "2011-06-01 00:00:00",
  "AnniversaryDate": "2006-11-28 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 45.083065,
  "FRS_Long": -93.733042,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 35290,
      "AltID": "Foam Extrusion",
      "FacilityID": 24659,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 46147,
          "ProcessID": 35290,
          "ChemicalID": 5,
          "Quantity": 119230.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 36158,
          "ProcessID": 35290,
          "NAICSCode": "32614",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 19937,
              "Process_NAICS_ID": 36158,
              "SafetyReviewDate": "1999-10-30 00:00:00",
              "PHA_Date": "1999-11-04 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-03-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-11-01 00:00:00",
              "TrainingReviewDate": "1999-11-01 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-11-01 00:00:00",
              "EquipmentInspectionDate": "1999-12-01 00:00:00",
              "EquipmentTested": "Transfer Pumps",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-11-30 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-11-30 00:00:00",
              "HotWorkPermitReviewDate": "1999-11-23 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-11-23 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 28966,
                  "PreventionProgram3ID": 19937,
                  "ProcessChemicalID": 46147
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 24659,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Rockford FIre Department",
    "CoordinatingAgencyPhone": "6124774346",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24659,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThis document was developed for DiversiFoam in an effort to fulfill the criteria of the RMP, as required by section 112(r) of the Clean Air Act, and regulated by 40 CFR, Part 68. DiversiFoam manufactures rigid polystyrene boardstock by both the foam extrusion and molded expandable polystyrene (EPS) bead processes.  DiversiFoam also manufactures custom-molded and custom-cut EPS foam parts.  Other activities include cutting and shaping pre-manufactured urethane, repairing equipment in a machine shop, and lamination of other products onto foam products using hot melt adhesives.  DiversiFoam uses methyl chloride in its foam extrusion process. The quantity of methyl chloride used at the facility is greater than the Threshold Quantity of 10,000 pounds, which is EPA¿s criteria for requiring the development and submittal of information found in this RMP.\n\nMethyl Chloride is considered hazardous by EPA standards.  The toxic properties of this chemical make it necessary to observe certain safety precautions in handling it to prevent unnecessary human exposure and to reduce the impact or threat to nearby members of the community.  Safety depends upon the manner in which we handle the chemical; combined with safety devices inherent in the design of this facility; and the training of our personnel.\n\nAccidental Release Prevention and Emergency Response Policies\n\nIt is this facility¿s intent to uphold industry standards in the operation of the facility and it is our policy to adhere to all applicable federal, state, and local laws.  We have designed and constructed a state-of-the-art facility employing numerous release identification and prevention measures.  If an emergency were to occur, our in-house staff is trained and equipped to perform isolation measures and secure leaking systems.  We have also coordinated with the Rockford Fire Department and requested that they respond to emergencies at our facility.\n\nThe Stationary Source and Regulated Substances Hand"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24659,
      "SummaryText": "led\n\nMethyl Chloride is used as an expansion agent in our foam extrusion process. Methyl Chloride is received by railcar, transferred to our onsite storage tank, and dispensed to the foam extrusion process from there.  DiversiFoam currently uses approximately 3 railcars of methyl chloride every two year.  The maximum amount of methyl chloride that can be stored at this facility is 119,230 lbs.\n\nWorst-Case Release Scenario and the Alternative Release Scenarios\n\nWorst-Case Scenario (WCS) - Release of the entire contents of the largest single container or piping configuration of methyl chloride would be 119,230 pounds.  For WCS, according to EPA¿s RMP Guidance Document criteria (EPA 550-B-98-010), the distance to toxic endpoint for this worst-case scenario is 2.0 miles.  The facility is located in a populated urban area, with an estimated population of 1,542 persons living within the 2.0-mile radius.\n\nAlternative Release Scenario (ARS) for Methyl Chloride - A release of 150 lbs./minute of methyl chloride results in a distance to toxic endpoint of 0.11 miles.  This reaches the nearest public receptor (apartment complex).\n\nThe General Accidental Release Prevention Program and the Specific Prevention Steps\n\nThis facility complies with EPA¿s Accidental Release Prevention Rule and with all applicable state codes and regulations.  DiversiFoam takes a systematic, proactive approach to evaluating chemical processes.  Using this approach, the design, technology, operation and maintenance activities, emergency preparedness plans, training, process changes, and other elements that affect the covered processes are all considered.  Conducting thorough evaluations minimizes consequences of releases and can even prevent releases.\n\nBy fulfilling the required elements of the RMP standard, DiversiFoam intends to prevent releases of hazardous substances and minimize the impacts of accidental releases into locations that could expose employees, the community or the environment to serious"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24659,
      "SummaryText": "hazards.  Our program addresses each of the key features of a successful release prevention program including:\n\n- Maintaining Process Safety Information (PSI): DiversiFoam maintains up-to-date technical information about safe operating limits of the components and the associated hazards of the chemicals involved.\n- Conducting Process Hazard Analysis (PHA): DiversiFoam performs technical analysis of the plant¿s processes in order to anticipate what might go wrong and recommend approaches to minimize the possibilities and affects of such occurrences.\n- Standard Operating Procedures (SOP): We have written technical and administrative procedures used to operate the plant safely.\n- Training:  DiversiFoam provides employees with information necessary to ensure safe operation.\n- Mechanical Integrity: We ensure proper maintenance of the process equipment on an ongoing basis.\n- Management of Change (MOC): DiversiFoam analyzes changes in process equipment, procedures and personnel to understand the impact of those changes in the safe operation of our plant.\n- Pre-Startup Safety Review: We ensure all necessary elements for operating a safe process are in place prior to introducing the hazardous chemical into a ¿new¿ or modified system.\n- Compliance Audits: We conduct periodic evaluation and updating of the process operation to ensure all RMP elements are being applied properly.\n- Incident Investigation: DiversiFoam has procedures for investigating the causes of near miss or accidental releases and developing measures to prevent future similar occurrences.\n- Employee Participation: We maintain a philosophy and approach of incorporating the knowledge and experience of our employees from all facets of operation regarding the covered processes.\n- Hot Work Permit: We have a documented program for controlling the hazards associated with ignition source activities, thereby minimizing potential catastrophic release.\n- Contractors:  DiversiFoam upholds policies and procedures for ensur"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24659,
      "SummaryText": "ing safe work practices of contractors on the facility and a systematic approach of communicating hazards inherent to the covered processes which the contractor may be working on or near.\n\nOur employees are committed to the standards that the RMP regulation sets.  We have specific accountabilities and controls to ensure that we are meeting high standards for accident prevention.  DiversiFoam has also developed a risk management system, which identifies specific job positions and responsibilities to ensure proper management and implementation of this RMP.\n\nThere have been no accidental releases of methyl chloride or other toxic/extremely hazardous chemicals in the past 5 years, which have resulted in off-site consequences such as personal injury, death, or response/restoration activities.\n\nThe Emergency Response Program\n\nDiversifoam has retained the services of Service Response & Remediation Inc. (a state certified emergency response contractor).  In the event of a hazardous materials emergency, Diversifoam employees shall initiate the response system and the contractor shall respond to the incident.  At the conclusion of the response, the contractor shall report findings to the Minnesota Pollution Control Agency and other pertinent regulatory agencies as necessary.\n\nPlanned Charges To Improve Safety\n\nDiversiFoam intends to incorporate updated maintenance and inspection procedures of the process equipment to ensure the mechanical integrity and the continued safe operation of this system."
    }
  ]
}