{
  "FacilityID": 24828,
  "FacilityName": "Koch Isomerization Plant",
  "FacilityStr1": "462  US Hwy 56",
  "FacilityStr2": null,
  "FacilityCity": "McPherson",
  "FacilityState": "KS",
  "FacilityZipCode": "67460",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20113",
  "LEPC": "Mcpherson County LEPC",
  "FacilityLatDecDegs": "38.378333",
  "FacilityLongDecDegs": "-97.835",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Koch Hydrocarbon, LP",
  "Company2Name": null,
  "CompanyDUNS": 6944334,
  "Company2DUNS": 0,
  "OperatorName": "Koch Hydrocarbon, LP",
  "OperatorStr1": "4111 E. 37th St. North",
  "OperatorStr2": null,
  "OperatorCity": "Wichita",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "67220",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": "KSD985017086",
  "EPAFacilityID": "100000101524",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-05-20 00:00:00",
  "SafetyInspectionBy": "Internal Inspection",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-01-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-01-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-01-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 38.37704,
  "FRS_Long": -97.83131,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 35530,
      "AltID": "Gas Fractionation",
      "FacilityID": 24828,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 46547,
          "ProcessID": 35530,
          "ChemicalID": 98,
          "Quantity": 300000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 46548,
          "ProcessID": 35530,
          "ChemicalID": 118,
          "Quantity": 1600000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 46549,
          "ProcessID": 35530,
          "ChemicalID": 107,
          "Quantity": 900000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 46550,
          "ProcessID": 35530,
          "ChemicalID": 149,
          "Quantity": 72000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 36409,
          "ProcessID": 35530,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 20076,
              "Process_NAICS_ID": 36409,
              "SafetyReviewDate": "1998-11-01 00:00:00",
              "PHA_Date": "1999-03-22 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-07-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "High Winds",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 1,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-19 00:00:00",
              "TrainingReviewDate": "1999-05-19 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-15 00:00:00",
              "EquipmentInspectionDate": "1998-11-15 00:00:00",
              "EquipmentTested": "Vessels",
              "ChangeMgmtDate": "1998-11-15 00:00:00",
              "ChangeMgmtReviewDate": "1998-10-29 00:00:00",
              "PreStartupReviewDate": "1998-07-21 00:00:00",
              "ComplianceAuditDate": "1998-02-16 00:00:00",
              "AuditCompletionDate": "1999-06-30 00:00:00",
              "IncidentInvestigationDate": "1999-05-17 00:00:00",
              "InvestigationChangeDate": "1999-07-17 00:00:00",
              "ParticipationPlansReviewDate": "1997-12-18 00:00:00",
              "HotWorkPermitReviewDate": "1997-12-17 00:00:00",
              "ContractorSafetyReviewDate": "1999-01-08 00:00:00",
              "ContractorSafetyEvalDate": "1995-07-10 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 29254,
                  "PreventionProgram3ID": 20076,
                  "ProcessChemicalID": 46547
                },
                {
                  "PrimaryKey": 29255,
                  "PreventionProgram3ID": 20076,
                  "ProcessChemicalID": 46548
                },
                {
                  "PrimaryKey": 29256,
                  "PreventionProgram3ID": 20076,
                  "ProcessChemicalID": 46549
                },
                {
                  "PrimaryKey": 29257,
                  "PreventionProgram3ID": 20076,
                  "ProcessChemicalID": 46550
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 24828,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-05-14 00:00:00",
    "ERTrainingDate": "1999-05-27 00:00:00",
    "CoordinatingAgencyName": "Windom Rural Fire Department",
    "CoordinatingAgencyPhone": "0000000911",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24828,
      "SummaryText": "KOCH HYDROCARBON, LP\nIsomerization Plant, McPherson, Kansas\n\nEXECUTIVE SUMMARY\nFOR \nTHE RISK MANAGEMENT PLAN (RMPlan)\n\n\nIntroduction and Policies\n\nAt Koch Hydrocarbon, LP (Koch Hydrocarbon), we are committed to being associated with unmatched environmental performance as measured by our employees, customers, regulators, and the public.  Our management philosophy goals are achieved by the personal commitments of our employees and contractors, and by open communication with our employees, customers, neighbors, and with regulators. The accidental release prevention and emergency response programs we have at our facilities are part of the high standards we strive for at Koch Hydrocarbon.  Our high standards are achieved by operating in compliance with all required environmental permits and regulations, by operating and maintaining our assets in such a manner that any unpermitted release will be unintentional and acknowledged as unacceptable, by remedying any shortcomings found during regular audits of our facilities, and by reporting promptly to regulators any shortcomings found during the course of our audits as required by law.\n\nThe Isomerization Plant is one of many hydrocarbon processing facilities operated by Koch Hydrocarbon.  At the Isomerization Plant, we receive n-butane by pipeline and convert it into iso-butane.  The iso-butane is shipped out by pipeline as well as by rail and truck.  We also receive propane by rail and truck.  We purify the propane in molecular sieves.  The purified propane is shipped out of the facility by rail and truck.  Propane, n-butane, iso-butane, and hydrogen are the flammable substances regulated under the Risk Management Program (RMP) that are present at the facility.  The facility is classified as Program Level 3 under the regulation.  The purpose of this Risk Management Plan (RMPlan) is to provide information about our operations at the facility, our programs to prevent accidental chemical releases, our emergency response plans i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24828,
      "SummaryText": "n case an accidental release should occur, our 5 year accident history, and our planned changes to improve safety at the facility.\n\n\nWorst Case and Alternative Release Scenarios\n\nAs specified by the U. S. Environmental Protection Agency (EPA) RMP Regulations, our worst case release scenario for flammables would be the loss of all of the butane or iso-butane in our largest vessel causing a vapor cloud explosion.  In the case of the Isomerization Plant, this would involve our 42,000- iso-butane bullet.  Such a scenario is highly unlikely, however, at an overpressure of 1 psi, which is EPA's threshold for measurable impacts from a vapor cloud explosion, public receptors would be affected if this event were to occur.  Although we have numerous controls to prevent such releases (high level alarms, emergency shutdown, etc.) and to manage their consequences, no credit for any controls or mitigation measures was taken into account when evaluating this scenario.  \n\nThe alternative release scenario, characterized as a more likely scenario which would involve offsite impacts, is based on the failure of a 2\" relief valve on the propane bullet.  When modeling this alternative release scenario, no credit for any controls or mitigation measures was taken into account.  However, we have several mitigation measures in place to greatly reduce the chance that such an event could ever occur.  These measures include the following:  1) We conduct periodic inspection and testing of all the relief valves;  2) We keep the operating pressure of the bullet at well below the set pressure of the relief valve;  3) We monitor the liquid level in the bullet;  4) We provided a percentage gauge on the bullet for visual observation of the liquid level; and  5) We provided an automatic emergency shutdown switch to completely shutdown the product movement in case the liquid level in the bullet gets too high.  The presence of these mitigation measures serves to either prevent this scenario from occurrin"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24828,
      "SummaryText": "g or minimize its impact if it does occur.\n\nWe have discussed these potential hydrocarbon releases with our employees and with local emergency response officials in McPherson County, thereby further reducing the possibility of any impact on the public.  \n\n\nPrevention Program\n\nThe Isomerization Plant has been operating under the strict guidelines of the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program since 1992.  At the Isomerization Plant, we emphasize continual analysis of the potential hazards of our process, annual training of our employees, and on-going safety.  Part of this program has also involved identifying and taking steps to avoid potential accidental chemical releases.  A few examples of the additional prevention features implemented at this facility include:\n\n?We have installed infrared monitors throughout the plant to detect flames\n\n?We have installed fire water monitors throughout the plant for fire fighting.\n\n?We monitor all the storage tanks and vessels for pressure, temperature, and liquid level.  We provided high and low level alarms, high pressure alarms, and high temperature alarms on all the storage tanks and process vessels. \n\n?We provided a siren system for plant evacuation during emergency situations.\n\n?We provided uninterrupted power supply for all high level alarms in the control room.\n\n?We provided emergency shutdown buttons at various locations within the facility in order to safely shutdown the facility during emergency situations.\n\n?We provided high level, high pressure, and high temperature shutdown capabilities for all our critical process equipment.\n\nThese safeguards as well as the vigilance of our trained employees have helped us operate safely at this facility since we acquired it in 1989.\n\n\nFive Year Accident History\n\nNo incident resulting in onsite or offsite impacts from a hydrocarbon release has occurred at the Isomerization Plant within the last five years.  Although we take pride "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24828,
      "SummaryText": "in that record, we also place daily emphasis on our prevention and safety programs to ensure this record continues.\n\n\nEmergency Response Program\n\nWe will continue to conduct emergency response preparedness activities and coordinate any emergency response actions necessary for the Isomerization Plant with the Windom Rural Volunteer Fire District and the McPherson County Sheriff.  Also involved in emergency response for the facility would be the McPherson County LEPC.  The Isomerization Plant Manager is responsible for coordinating all emergency actions.  A specific Emergency Response Plan for the facility is in place, and that plan has been coordinated with local officials, along with evacuation procedures, regular drilling, and training.  Our Emergency Response Program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.\n\nPlanned Changes to Improve Safety\n\nDiligent compliance with our RMP Prevention Program forms the framework on which we will continue to improve the level of safety at the Isomerization Plant.  Some of the key components of the safety improvements we expect to achieve are as follows:\n\n?The Management of Change provisions ensure that we consider the potential safety and health impacts of any change we make to process chemicals, technology, equipment or procedures.\n?The Process Hazard Analysis (PHA) provisions serve as a tool to ensure continual evaluation of potential hazards, thereby leading to continual improvements in our safety standards.\n?The Mechanical Integrity provisions ensure that process equipment and instrumentation are designed, constructed, installed and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of our safety program.\n?Compliance audits will ensure we maintain and increase our level of safety protection.\n?Communication with the McPherson County Emergency Management Director or his designate will ensur"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 24828,
      "SummaryText": "e a constant state of readiness to respond to any potential emergencies, as well as a means to implement improvements as the need develops.  In this way, we shall bolster our strong commitment to the safety of our workers and the community.  \n\nWe encourage all interested citizens or community organizations to contact the McPherson County Emergency Management Director for the latest information on emergency response for the county.  We plan to diligently integrate our response capabilities and personnel with those of the county on an ongoing basis."
    }
  ]
}