{
  "FacilityID": 24955,
  "FacilityName": "Carolina Brand Foods, LLC",
  "FacilityStr1": "1 Bacon Place",
  "FacilityStr2": null,
  "FacilityCity": "Holly Ridge",
  "FacilityState": "NC",
  "FacilityZipCode": "28445",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37133",
  "LEPC": null,
  "FacilityLatDecDegs": "34.494167",
  "FacilityLongDecDegs": "-77.558056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 156052920,
  "ParentCompanyName": "Tyson Foods, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6903702,
  "Company2DUNS": null,
  "OperatorName": "Carolina Brand Foods, LLC",
  "OperatorStr1": "P.O. Box 38",
  "OperatorStr2": null,
  "OperatorCity": "Holly Ridge",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28445",
  "OperatorZipCodeExt": null,
  "FTE": 490,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000000429",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Holly Ridge, NC",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2002-01-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-01-28 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2002-01-24 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2002-07-10 00:00:00",
  "DeRegistrationEffectiveDate": "2002-06-21 00:00:00",
  "AnniversaryDate": "2007-01-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 34.49512,
  "FRS_Long": -77.55838,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 35686,
      "AltID": "Ammonia System",
      "FacilityID": 24955,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 46776,
          "ProcessID": 35686,
          "ChemicalID": 56,
          "Quantity": 10000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 36570,
          "ProcessID": 35686,
          "NAICSCode": "311612",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 20142,
              "Process_NAICS_ID": 36570,
              "SafetyReviewDate": "1998-08-15 00:00:00",
              "PHA_Date": "1998-12-15 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-12-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-08-01 00:00:00",
              "TrainingReviewDate": "1998-08-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-08-01 00:00:00",
              "EquipmentInspectionDate": "2001-12-01 00:00:00",
              "EquipmentTested": "compressors, liquid pumps, suction accumulators, high pressure receivers, condensers, air handlers, chiller coils, and oil pots",
              "ChangeMgmtDate": "1998-02-01 00:00:00",
              "ChangeMgmtReviewDate": "1998-08-01 00:00:00",
              "PreStartupReviewDate": "1998-08-01 00:00:00",
              "ComplianceAuditDate": "1998-08-01 00:00:00",
              "AuditCompletionDate": "1999-01-01 00:00:00",
              "IncidentInvestigationDate": "1999-12-07 00:00:00",
              "InvestigationChangeDate": "1999-12-09 00:00:00",
              "ParticipationPlansReviewDate": "1998-08-01 00:00:00",
              "HotWorkPermitReviewDate": "1998-08-01 00:00:00",
              "ContractorSafetyReviewDate": "1998-08-01 00:00:00",
              "ContractorSafetyEvalDate": "1998-08-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 29381,
                  "PreventionProgram3ID": 20142,
                  "ProcessChemicalID": 46776
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 24955,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-02-01 00:00:00",
    "ERTrainingDate": "1999-02-01 00:00:00",
    "CoordinatingAgencyName": "Local Emergency Planning Commission",
    "CoordinatingAgencyPhone": "9103474270",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24955,
      "SummaryText": "EXECUTIVE SUMMARY\r\nAccident Release Prevention Program and Emergency Response Policy\r\nIt is the policy of the Carolina Brand Foods, L.L.C. Holly Ridge, North Carolina facility management to implement the requirements of this Risk Management Program (RMP) in accordance with the USEPA regulations under 40 CFR Part 68 and with the corresponding regulations under OSHA's Process Safety Management (PSM) program.  The objective is to minimize the risk of a release of a hazardous material and if a release occurs, to minimize the potential impact to Carolina Brand Foods, L.L.C. employees, the public and the environment.  This objective will be accomplished by utilizing general good operating procedures, providing appropriate training to all employees, and coordinating response activities, as necessary, with the local emergency response providers.  This plan covers all Carolina Brand Foods, L.L.C. owned activities at this facility.\r\nCarolina Brand Foods, L.L.C. management is committed to providing the resources necessary to implement this policy.\r\nFacility Description\r\nCarolina Brand Foods, L.L.C. operates a bacon processing facility at this location.  Pork bellies are trucked to the facility, processed, smoked, packaged, and shipped.  Support operations include a wastewater treatment system, truck repair facilities, cold storage, an analytical laboratory, and administrative offices.\r\nOne chemical is utilized at the facility in sufficient quantities to be subject to the requirements of 40 CFR Part 68.  This chemical is ammonia and is used as a refrigerant throughout the facility.\r\nWorst-Case and Alternative-Release Scenarios\r\nRMP regulations require that each facility identify worst-case and alternative case release scenarios.  EPA has defined a worst-case release as the release of the entire contents of the largest vessel that contains a regulated substance in a 10-minute period.  This release rate is then evaluated using modeling techniques and/or reference tables to defin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24955,
      "SummaryText": "e the distance to a specified endpoint (concentration or overpressure).  The distance to the endpoint is affected by several factors including molecular weight, volatility, heat of combustion, and physical setting (urban or rural).\r\nThe alternative release scenario must be one that is more likely to occur than the worst-case scenario and that reaches an endpoint offsite, unless no such scenario exists.  The alternative release scenario is also evaluated to define the distance to the specified endpoint.\r\nUnder 40 CFR 68 Subpart B §68.22(e), the RMP rule identifies surface roughness as a parameter to be used in the hazard assessment to determine the physical setting of the site, urban or rural.  Urban means there are many obstacles in the immediate area; obstacles include buildings or trees.  Rural means there are no buildings in the immediate area and the terrain is generally flat and unobstructed.\r\nDue to the presence of trees, hills, and/or other structures in the immediate vicinity of the Holly Ridge, North Carolina facility, an urban dispersion environment was assumed.\r\nAmmonia\r\nThe data provided in the document Model Risk Management Program and Plan for Ammonia Refrigeration (May 1996) was used to estimate the toxic endpoint distance for the worst-case and alternative ammonia release scenarios.  The EPA's RMP Off-site Consequence Analysis Guidance (May 1996) was not used to determine the toxic endpoint since it classifies ammonia as a neutrally buoyant gas.  Since the worst-case ammonia release would involve liquid and would come from a pressurized system containing liquid, the released gas should be classified as a dense gas (a result of evaporative cooling).  The ammonia refrigeration document provides calculated endpoint distances for typical meteorological conditions.\r\nThe worst-case release scenario for an anhydrous ammonia release included a release of all the contents of the R-2 Recirculator in a 10-minute period (per EPA guidelines).  This release"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24955,
      "SummaryText": "translates to a release of 7,760 pounds of ammonia in 10 minutes or 776 lbs/min.  Other assumptions included in the worst-case assessment are: the ammonia is a liquefied gas; the R-2 Recirculator is not diked; the release does not take place indoors; the nearfield dispersion environment is characterized as urban; 10-minute averaging period; the wind speed is 1.5 meters/sec and the atmospheric stability is classified as F (stable).  The results of the worst-case assessment for ammonia show that the plume must travel 1.04 miles (1.68 kilometers) before dispersing to the endpoint concentration of 201 ppm.\r\nThe selected alternative-release scenario for the ammonia systems is a release from a relief valve due to overpressure of a compressor unit.  The largest relief valve in the system was used in this scenario.  The largest relief valve has a relief rate of 148.5 pounds of air per minute.  As a matter of convention, the specified release rate of any relief valve is always in pounds of air per minute.  The release rate of 148.5 pounds of air per minute correlates to a release rate of 106.5 pounds of ammonia vapor per minute.\r\nThe ammonia refrigeration document provides calculated endpoint distances for typical meteorological conditions (3 m/s wind speed, D atmospheric stability, 50% relative humidity).  It has been determined, through a review of Carolina Brand Foods, L.L.C. operational history, that the total release would likely be 500 pounds of ammonia.  Based on the release rate of 106.5 lbs/min, the duration for a 500-pound release is 4.7 minutes.  Other assumptions include that no active or passive mitigation measures are currently in place and an urban dispersion environment in the nearfield.  The results of the alternative-release scenario for an ammonia release indicates that the endpoint concentration of 201 ppm is reached at 0.088 miles (141 meters) from the release point.\r\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\r\nT"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24955,
      "SummaryText": "he Holly Ridge, North Carolina facility is governed by a set of OSHA and USEPA regulations that require planning and facility activities intended to prevent a release of hazardous material, or if a release inadvertently occurs, to minimize the consequences of a release to the employees of the facility, the public and to the environment.  These regulations include:\r\n* 40 CFR Part 68, Accidental Release Prevention\r\n* 40 CFR Part 112, Spill Prevention, Control and Countermeasure\r\n* 29 CFR Part 119, Process Safety Management\r\n* 40 CFR Part 302, Emergency Planning and Community Right-to-Know Act (EPCRA)\r\nThe key concepts in Carolina Brand Foods, L.L.C.' release prevention program are employee participation, appropriate design and maintenance of equipment, and appropriate training of all employees. Carolina Brand Foods, L.L.C. has developed and documented these elements in their process safety management plan (PSM).  The PSM plan is incorporated with this document by reference.\r\nEmployee participation in the release prevention program is encouraged and supported by Carolina Brand Foods, L.L.C. management.  Key personnel are responsible for conducting and implementing the findings from the Process Hazard Analysis (PHA) for the ammonia systems.  Carolina Brand Foods, L.L.C. employees are also members of the facility emergency response team.\r\nCarolina Brand Foods, L.L.C. policy is to construct all new equipment, systems, and facilities to ensure the appropriate safety and release prevention systems are included from the beginning of each project.  Carolina Brand Foods, L.L.C. maintains a computerized program of maintenance activities to ensure that key systems are maintained appropriately to minimize the risk of a release.\r\nCarolina Brand Foods, L.L.C. is committed to providing appropriate training to all employees regarding safety procedures.  Each new employee is provided comprehensive safety training during their initial orientation for the facility.  In addition, Carolin"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 24955,
      "SummaryText": "a Brand Foods, L.L.C. conducts regularly scheduled safety training for all employees each year.  Additional training is provided to maintenance personnel for the systems they are responsible for.  Members of Carolina Brand Foods, L.L.C. emergency response team receive annual training to ensure that response actions are promptly and safely completed.\r\nFive Year Accident History\r\nCarolina Brand Foods, L.L.C. has not had a release of ammonia from the Holly Ridge, North Carolina facility that has affected the public or the environment.\r\nEmergency Response Program\r\nCarolina Brand Foods, L.L.C. has personnel trained in emergency response at the facility 24 hours per day, seven days per week.  These personnel receive annual training on emergency procedures and response techniques.\r\nPlanned Changes to Improve Safety\r\nCarolina Brand Foods, L.L.C. completes a thorough review of the ammonia systems each time a design change is implemented.  Carolina Brand Foods, L.L.C. is committed to using these methods to identify and implement ways to improve the safety of these systems."
    }
  ]
}