{
  "FacilityID": 25080,
  "FacilityName": "Pittsburg Power Plant",
  "FacilityStr1": "696 West 10th Street",
  "FacilityStr2": null,
  "FacilityCity": "Pittsburg",
  "FacilityState": "CA",
  "FacilityZipCode": "94565",
  "Facility4DigitZipExt": "1806",
  "FacilityCountyFIPS": "06013",
  "LEPC": null,
  "FacilityLatDecDegs": "38.035278",
  "FacilityLongDecDegs": "-121.892222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Mirant Delta, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Mirant Delta, LLC",
  "OperatorStr1": "696 West 10th Street",
  "OperatorStr2": null,
  "OperatorCity": "Pittsburg",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94565",
  "OperatorZipCodeExt": "1806",
  "FTE": 144,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000177854",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-02-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-02-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-02-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-07-03 00:00:00",
  "DeRegistrationEffectiveDate": "2017-06-07 00:00:00",
  "AnniversaryDate": "2007-02-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 38.03548,
  "FRS_Long": -121.9176,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 35854,
      "AltID": "29.4% aqueous ammonia SCR",
      "FacilityID": 25080,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 47024,
          "ProcessID": 35854,
          "ChemicalID": 57,
          "Quantity": 150000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 36739,
          "ProcessID": 35854,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 13820,
              "Process_NAICS_ID": 36739,
              "SafetyReviewDate": "2002-01-22 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 1,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2002-01-22 00:00:00",
              "ChangeCompletionDate": "2002-02-15 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "sump",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2001-12-01 00:00:00",
              "TrainingReviewDate": "2001-12-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-12-01 00:00:00",
              "EquipmentInspectionDate": "2002-02-15 00:00:00",
              "EquipmentTested": "entire SCR system associated with aqueous ammonia",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "Aqueous ammonia for SCR systems",
              "_chemicals": [
                {
                  "PrimaryKey": 14491,
                  "PreventionProgram2ID": 13820,
                  "ProcessChemicalID": 47024
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 25080,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2002-02-08 00:00:00",
    "ERTrainingDate": "2001-11-01 00:00:00",
    "CoordinatingAgencyName": "CCC Fire Protection District",
    "CoordinatingAgencyPhone": "9257571303",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 25080,
      "SummaryText": "Please see attached document.\nPITTSBURG POWER PLANT RISK MANAGEMENT PLAN \n\n\n\n1.0 EXECUTIVE SUMMARY\n\n\n\n1.1 BACKGROUND\n\nMirant Delta, LLC (Mirant) owns and operates the Pittsburg Power Plant (PPP), an electric power generating facility located in West Pittsburg, California in Contra Costa County.  There are seven existing units at PPP, all of which are currently operating.  The Boilers for Units 1-6 were manufactured by Babcock and Wilcox and the boiler for Unit 7 was manufactured by Combustion Engineering.  \n\n\n\nMirant will retrofit the existing Units 5, 6, and 7 at PPP with Selective Catalytic Reduction (SCR) systems in order to reduce emissions of nitrogen oxides (NOx), as required to comply with Bay Area Air Quality Management District (BAAQMD) Regulation 9, Rule 11, \"Nitrogen Oxides and Carbon Monoxide from Electric Power Generating Steam Boilers\".  Units 5 and 6 are each rated at 330 MW and unit 7 is rated at 740 MW.  Mirant will complete the retrofit of Unit 6 with an SCR system in February 2002 and will complete retrofit of Unit 5 with an SCR system in June 2002.  Mirant expects to complete retrofit of Unit 7 in June of 2004.  This document addresses the aqueous ammonia systems that will be associated with all three SCR projects.\n\n\n\nThe SCR system utilizes aqueous ammonia to reduce NOx emissions from the generating units.  The concentration of ammonia in the aqueous solution will be 29.4 % by weight.  This substance is listed as a hazardous material under both California and federal regulations.\n\n\n\nIn order to prevent accidental releases of hazardous materials and to reduce their potential impact on the public and the environment, a federal program was established in 1990 as described in Section 112(r) of the Clean Air Act.  The California Office of Emergency Services established the California Accidental Release Prevention (CalARP) Program to prevent accidental releases of regulated substances and to mitigate the severity of releases that do occur.  The CalARP"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 25080,
      "SummaryText": " Program specifies the regulated substances, oversees the federal requirements, and determines the requirements for the preparation of a Risk Management Plan (RMP) and offsite accidental release consequence analysis.  In Contra Costa County, the Administering Agency overseeing the CalARP program is the Contra Costa County Health Services Department (CCCHSD), to whom this RMP will be submitted.\n\n\n\nAfter the addition of the SCR systems, the quantity of aqueous ammonia to be stored and used at the Pittsburg Power Plant (PPP) will be greater than both the Federal and State Threshold Quantities; therefore a RMP is required.  As shown in this RMP, a worst-case release from the PPP aqueous ammonia system will cause the toxic endpoint concentration for ammonia (200 ppmv) to occur offsite, in an area of Suisun Bay to which the public has access.  Therefore, the process cannot be classified as Program 1.  Although, aqueous ammonia is listed as a regulated substance in Section 2770.5 of CalARP regulations, the power generation industry is not specifically required to submit extensive Program 3 RMP requirements, and the CCCHSD has determined that the risk posed by this process does not justify classifying the process as Program 3.  Accordingly, this process qualifies for a Program 2 RMP under both the CalARP and federal regulations.  In order to fulfill the Program 2 requirements, the following actions were completed: \n\n\n\n    - Analyze a worst-case and alternative release scenario and provide offsite consequence analysis\n\n    - Describe the site's accidental release prevention program and chemical specific prevention steps.  Ensure that response actions have been coordinated with local emergency planning and response agencies.\n\n    - Describe the site's safety program.\n\n    - Describe the site's hazard review program.\n\n    - Describe the site's operating procedures.\n\n    - Describe the site's training programs.\n\n    - Describe the site's maintenance program.\n\n    - Describe the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 25080,
      "SummaryText": " site's compliance audit program.\n\n    - Describe the site's incident investigation program.\n\n    - Provide an external event analysis of the SCR systems, including a seismic analysis.\n\n    - Certify the information in this RMP is accurate.  \n\n\n\nTo ensure continued compliance with the CalARP regulations, Mirant will update this RMP within five years of its initial submission or most recent update, before any additional regulated substance is brought onsite, before additional aqueous ammonia storage capacity is installed, or if there is a major change that may alter the offsite consequence analysis.\n\n\n\nThe remainder of this RMP documents these actions.  The organization of the RMP follows that provided in the Contra Costa County CalARP Program Guidance Document.\n\n\n\n1.2 ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nMirant is committed to being a responsible member of the community in which it operates by giving top priority to operating in a safe and environmentally sound manner.  It is the policy of Mirant to conduct business in a manner that protects the environment and the health and safety of the public and its employees by: \n\n\n\n    - Meeting or surpassing all environmental laws, regulations and permit requirements, and verifying this commitment through environmental auditing. \n\n    - Seeking to ensure that environmental laws, regulations and permit requirements are based on sound science and cost-effective technology. \n\n    - Pursuing opportunities to enhance the quality of the environment. \n\n    - Promoting public and employee understanding of environmental issues and the company's environmental activities. \n\n    - Establishing company and organizational environmental goals and implementation plans. \n\n    - Ensuring that employees are aware of their individual roles and responsibilities in implementation of this environmental policy.\n\n\n\nA copy of the Mirant California environmental policy can be found in Appendix A of the RMP.  As it is impossib"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 25080,
      "SummaryText": "le to create a brief description of all of the environmental, health and safety programs at PPP and their manuals, Mirant California's health and safety program manual is provided in Appendix B of the RMP.  To minimize accidental releases, numerous environmental, health and safety programs are implemented at PPP along with on-going personnel training activities that are described in Section 1.7.1 and 1.7.4 respectively of this RMP.  The release prevention programs to be implemented in conjunction with this RMP will strengthen the existing safety and environmental programs at PPP.  \n\n\n\n1.3 STORAGE AND HANDLING OF REGULATED SUBSTANCE\n\nThe only federal and CalARP regulated substance to be stored and handled onsite will be aqueous ammonia, which will be used in the SCR system to reduce NOx emissions from Units 5, 6 and 7.  In the proposed SCR systems, aqueous ammonia is pumped from the storage tanks, to a vaporizer, which produces a uniform distribution of gaseous ammonia that is mixed with the flue gas from the Units and passed over a reducing catalyst to reduce the NOx emissions from the stack exhaust.   \n\n\n\n1.3.1 Ammonia Systems\n\nThe systems that handle aqueous ammonia at PPP are the aqueous ammonia unloading and storage facility, the aqueous ammonia vaporization skid, and the ammonia injection grid/SCR reactor.  \n\n\n\nAqueous Ammonia Unloading and Storage Facility\n\nThe aqueous ammonia unloading and storage facility will consist of a truck unloading station and three aqueous ammonia storage tanks.  The storage facility will be designed and constructed to receive and store aqueous ammonia for the retrofitted Units 5, 6 and 7.  The aqueous ammonia unloading and storage facility will be located near the northern portion of the developed property of the Pittsburg Power Plant, immediately to the west of Unit 7.\n\n\n\nThe storage facility to service the SCRs on Units 5, 6, and 7 will include three 21,200-gallon carbon steel storage tanks.  All tanks will be constructed in compl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 25080,
      "SummaryText": "iance with Uniform Building Code Seismic Zone 4, Uniform Fire Code Article 80, and American Society of Mechanical Engineers Pressure Vessel Code Section VIII, Division 1, Rules for Construction of Pressure Vessels.  The tanks will have maximum design pressure and temperature of 50 pounds per square inch gauge (psig) and 120?F, respectively.\n\n\n\nThe aqueous ammonia tanks will be supported horizontally on concrete foundations within a walled containment basin approximately 65 feet long by 55 feet wide that will slope to a centrally located, covered sump beneath the tanks and running the length of the containment area.  This sump will be 14 feet wide by 55 feet long and 7 feet deep to provide a volume sufficient to hold 145 percent of the contents of the largest ammonia storage tank, plus the maximum rainfall recorded in the Pittsburg area in 24 hours in the past 43 years (3.03 inches, WRCC 1955-1998).  Although the sump has been sized to accommodate rainfall in accordance with the applicable codes, a sump pump will be provided to keep it free of rainwater.  The sump pump will be interlocked with the ammonia monitoring system so that it will not operate if ammonia vapors are detected.\n\n\n\nAqueous ammonia will be delivered to the Pittsburg Power Plant via tanker truck.  Individual tanker trucks can transport up to 6,500 gallons of aqueous ammonia.  The containment area for the unloading area will be sized to contain 105 percent of the volume of a 6,500-gallon tanker truck.  The area will be sloped to quickly drain any accidental releases of aqueous ammonia into the central covered containment sump.  Each storage tank will have an unloading station consisting of an ammonia fill line, where aqueous ammonia is fed from the delivery truck to the tank, and a vapor return line where vapor pressure between the tank and the truck is equalized.  \n\n\n\nAqueous Ammonia Vaporization Skid\n\nAqueous ammonia is pumped from the storage tanks to spray nozzles in the ammonia vaporizer unit on"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 25080,
      "SummaryText": " the injection skids near the SCR reactor.  The spray droplets are then mixed with a hot air diluent stream in the vaporizer to evaporate the ammonia.  The vaporizer produces a uniform distribution of gaseous ammonia in the diluent stream.  The diluent stream is then transported to the injection grid.  \n\n\n\nThe aqueous ammonia will travel through 3/4 inch stainless steel piping from the storage tanks to the SCR injection grid.  All electric forwarding pumps and piping will be located within the tank containment and truck unloading areas.  The piping between the tanks and the nearest edge of the Unit 7 building will be contained in a covered trench located under the road and parking area to protect the piping from vehicular traffic.  The trench under the road that houses the ammonia pipes will drain into the sump under the aqueous ammonia tanks in the storage area.  In addition, the primary piping will be contained within PVC piping for all stretches that are not within the storage facility or in the trench under the road, per the request of the Contra Costa County Fire Protection District (CCCFPD).  Thus, secondary containment will be provided for all sections of piping.\n\n\n\nAmmonia Injection Grid / SCR\n\nThe ammonia injection grid provides additional mixing of the diluent stream and transports it to the SCR.  The SCR reactor converts much of the ammonia and oxides of nitrogen from the flue gas into nitrogen gas and water, which is released from the stack.\n\n\n\nThe injection grid is located upstream of the SCR reactor.  This allows more thorough mixing of the ammonia-laden diluent stream with the turbulent flue gas from the Units.  Although the oxidation-reduction reaction is initiated by the injection of ammonia at the injection grid, all of the reaction is completed in the SCR reactor by passing the mixture over a catalyst composed primarily of titanium and vanadium oxides.  The treated flue gas, containing small amounts of residual NOX and excess ammonia, is discharge"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 25080,
      "SummaryText": "d out the stack.\n\n\n\nThe SCR process is controlled with feed-forward and feedback control loops.  An upstream NOX analyzer will measure the NOX concentration at the SCR reactor inlet.  A downstream analyzer will measure the total NOx concentration downstream of the SCR reactor outlet.  The ammonia demand signal, which regulates the rate at which aqueous ammonia is pumped to the vaporizer, is determined from the readings of both NOx analyzers.\n\n\n\n1.3.2 Aqueous Ammonia Hazards\n\nThe aqueous ammonia solution proposed for the SCR systems at PPP will be 29.4 percent ammonia by weight, with the balance of the weight being water.  Aqueous ammonia is a corrosive material although the degree of danger associated with the substance is considered to be minor.  Ammonia is not a known carcinogen, but it poses acute and chronic non-carcinogenic health hazards to the respiratory system and chronic non-carcinogenic health hazards as skin irritations or other effects.  Acute health hazards are those that occur from short exposures to airborne ammonia vapor, whereas chronic health effects are those that occur as a result of long-term exposures.\n\n\n\nThough there is some insoluble ammonia present in the ammonia solution, the solution has a very low vapor pressure compared to anhydrous ammonia, a more hazardous compound that is also used for SCR systems.  The ammonia present will not readily vaporize if the solution is released to the atmosphere.  If the ammonia evaporates from the solution, the ammonia vapor is irritating at levels above a few parts per million by volume (ppmv) and acutely toxic in high concentrations.  A one-hour average ammonia vapor concentration above 200 ppmv could cause respiratory irritation to exposed individuals.    \n\n\n\nAmmonia vapor is flammable in air at concentrations of 16 percent to 25 percent, but requires a very high temperature source for ignition.  Ammonia concentrations directly above an aqueous ammonia spill never approach these concentrations; therefo"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 25080,
      "SummaryText": "re aqueous ammonia has no explosive flammability potential.\n\n\n\n1.4 WORST-CASE AND ALTERNATIVE RELEASE SCENARIOS\n\nAn offsite consequence analysis was performed to examine the significance of an accidental release of aqueous ammonia in a worst-case scenario and a slightly more realistic alternative scenario (see Section 2).  The hypothetical worst-case release scenario examined the effects of releasing the contents of an entire 21,200 gallon storage tank.  Due to the designed passive mitigation systems, any spill of aqueous ammonia will drain rapidly into a covered sump through drains in the contained storage and unloading areas, leaving only the drain hole areas exposed to the atmosphere where vaporization of ammonia can occur.  \n\n\n\nThe alternative release scenario considered the consequences of releasing the entire contents of the piping carrying aqueous ammonia from the storage tanks to the SCR vaporizer for each Unit, plus 10 minutes of aqueous ammonia pumped at the maximum rate to each Unit, into the trench under the road.  The liquid would drain from the trench into the sump, where it would vaporize to the atmosphere through the drain hole area, like in the worst-case scenario.\n\n\n\nThe U.S. EPA approved air quality dispersion model SCREEN3 was used to predict the spread of aqueous ammonia for the worst-case and alternative release scenarios.  Details of these modeling analyses and the mitigation measures are presented in Section 2.  \n\n\n\nThe distance to the toxic endpoint concentration (200 ppmv) in the worst-case release scenario was calculated to be 466 feet from the center of the aqueous ammonia storage tank area.  The distance to the toxic endpoint in the alternative release scenario was predicted to be 112 feet from the ammonia facility.  The nearest potential public receptor to the aqueous ammonia storage facility, the banks of the Suisun Bay, is 166 feet to the north.  The nearest public receptor where people congregate frequently is the control room in the"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 25080,
      "SummaryText": " PG&E switchyard approximately 800 feet south of the ammonia storage facility, which is beyond the distance of the toxic endpoint for both the worst-case and alternative scenarios. \n\n\n\nSince one public receptor, the banks of Suisun Bay, falls within the distance to the toxic endpoint (466 feet) from the ammonia storage facility, PPP qualifies for a Program 2 RMP under both the CalARP and federal regulations.  The population within the distance to the toxic endpoint in the worst-case scenario is zero, and the distance to the toxic endpoint for the alternative release scenario was predicted to be onsite; therefore, the potential impacts from either release would be less than significant.  \n\n\n\n1.5 MANAGEMENT SYSTEM\n\nMirant is dedicated to reducing any risks associated with the storage and handling of the aqueous ammonia for the SCR system at PPP.  To meet Mirant's strict goal of accident free operation, the Plant Manager is responsible for the development, implementation and integration of the RMP elements.  The PPP will maintain records supporting all aspects of this RMP for at least five years and ensuring that the local CUPA is kept abreast of all changes to the RMP.  The individual aspects of the RMP, such as training, record keeping, etc., are outlined in numerous sections of this RMP.\n\n\n\nTo ensure continued compliance with the CalARP regulations, Mirant will update this RMP within five years of its initial submission or most recent update, before any additional regulated substance is brought onsite, before additional aqueous ammonia storage is installed, or if there is a major change that may alter the offsite consequence analysis.  An organizational chart has been created which outlines the names and titles of those individuals responsible for aspects of the Mirant Delta, LLC production, which includes PPP and the Contra Costa Power Plant (Appendix C).\n\n\n\nThe concentration of aqueous ammonia is not high enough to be regulated by OSHA's Process Safety Management "
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 25080,
      "SummaryText": "(PSM) standard.  \n\n\n\n1.6 CHEMICAL-SPECIFIC PREVENTION STEPS  \n\nSafety was the foremost consideration when designing the aqueous ammonia unloading and storage facility.  The aqueous ammonia storage tanks will be enclosed within a walled containment basin that will slope to a centrally located, covered sump beneath the tanks that will run the length of the containment area.  There will also be a walled containment pad under the tanker truck unloading facility that will drain rapidly into the covered sump under the tanks.\n\n\n\nMany accident prevention safeguards will be implemented with the aqueous ammonia storage area.  For example in the event of a power outage, standby backup power needed for all required electrical systems, such as monitors and alarms, will be provided by an Uninteruptable Power Supply.  Also hot work permits will be required for specific activities that present the potential for fire, and personnel involved in such operations will receive appropriate training.  \n\n\n\nOther safety features of the aqueous ammonia storage and unloading facility include: \n\n    - Ammonia area monitoring system with audible and visible alarms,\n\n    - Eyewash and shower station,\n\n    - Piping and connections for washdown of containment basin with clean water,\n\n    - Permanent lighting,\n\n    - Lightning protection,\n\n    - Truck barrier posts to protect ammonia tanks and delivery lines,\n\n    - Liquid level indication and high-level alarm for each tank, easily visible from the unloading position,\n\n    - Indication of tank level, system pressures, pressure relief valve position and alarm status in the plant control room. \n\n    - Shut-off valves located on the tank fill lines, which will close automatically if the emergency high-level alarm is triggered,\n\n    - Local manual controls for all pumps,\n\n    - Vacuum breaker valves on each tank, and\n\n    - Safety equipment (for two personnel) including:  two full face respiratory devices, two sets of escape respirators, two pairs of am"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 25080,
      "SummaryText": "monia-resistant gloves, two pairs of ammonia-resistant boots, two pairs of ammonia-resistant pants and jacket/slicker, one first aid kit, and one fire extinguisher.  \n\n\n\nThese safeguards will be built as part of the ammonia handling system.  In addition, area sensors will be installed in the ammonia unloading and storage facility and near the ammonia injection skid to monitor ambient ammonia concentrations.  Alarms are designed to annunciate in the control room with local audible alarms for ammonia releases at the facilities.\n\n\n\nTo minimize impacts from accidental releases, workers will be trained in the safe handling of hazardous materials, use of response equipment, procedures for mitigation of a release, and coordination with local emergency response organizations.  To avoid or minimize impacts from an accidental release of hazardous materials, nonhazardous or less hazardous materials will be used, where possible, and engineering controls will be implemented.  For example, aqueous ammonia was selected for the SCR system over anhydrous ammonia, because it is less hazardous.\n\n\n\n1.7 PROGRAM 2 PREVENTION PROGRAMS\n\n1.7.1 Safety Information\n\nThe only toxic chemical addressed in this Risk Management Plan is aqueous ammonia at a concentration of 29.4% by weight in water.  This chemical will be stored and used in the liquid state as a reagent for a required air pollution control system.  The aqueous ammonia will be heated and vaporized prior to injection into the boiler exhaust stream, where it reacts with a catalyst to reduce NOx emissions.  The potential health risks associated with aqueous ammonia are discussed in Section 1.3.\n\n\n\nMirant has developed an extensive safety program to reduce the risks associated with the handling of hazardous materials such as aqueous ammonia. Key aspects of this program are described in the remainder of this section.  Personnel that work with the aqueous ammonia will attend annual safety training classes and will always have access to the"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 25080,
      "SummaryText": " aqueous ammonia facility operating procedures manual, which covers safety practices, via the computer network and the Material Safety Data Sheet (MSDS) for aqueous ammonia (see Appendix D).  \n\n\n\nPPP will comply with recognized and generally accepted good engineering practice by constructing the aqueous ammonia tanks in compliance with Uniform Building Code Seismic Zone 4, Uniform Fire Code Article 80, and American Society of Mechanical Engineers (ASME) Pressure Vessel Code Section VIII, Division 1, Rules for Construction of Pressure Vessels.  The tanks will have maximum design pressure and temperature of 50 pounds per square inch gauge (psig) and 120?F, respectively.  The piping from the aqueous ammonia tanks to the SCR will be constructed to the ANSI/ASME B311 standard.\n\n\n\nAs it is impossible to create a brief description of all of the environmental, health and safety programs and their manuals at PPP, Mirant California's health and safety program manual is provided in Appendix B of the RMP.  Safety information about aqueous ammonia, the SCR system and its ancillary equipment is described in the SCR Training Program Manual, which is maintained at PPP.  Specific environmental, health and safety programs that are implemented to continue to improve the environmental, health and safety performance at PPP, include but are not limited to:\n\n\n\n    - Facility Emergency Plan\n\n    - Spill Prevention Control and Countermeasures Plan\n\n    - Hazardous Materials Business Plan\n\n    - Oil Spill Response Plan\n\n    - Health and Safety Program\n\n    - Hazard Communication Program\n\n    - Fuel Oil Tank Farm Operating Procedures\n\n    - Pittsburg Power Plant Operating Procedures\n\n    - Respiratory Protection Program\n\n    - Hearing Conservation Program\n\n    - Permit Required Confined Space\n\n    - Evacuation Policy\n\n    - Asbestos Policy\n\n    - Bloodborne Pathogens Policy\n\n    - Lead Control Policy\n\n    - Contractor and New Employee Safety Orientation Policy\n\nIn a continuing effort to impro"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 25080,
      "SummaryText": "ve and ensure proper implementation of the environmental, health and safety policies, the following measures are regularly employed:\n\n\n\n    - Facility Working Safety Team Program - The draft charter included in Appendix E of the RMP describes the duties and function of the Team.\n\n    - \n\n    - Daily Safety Tailboard Meetings - Each crew at the PPP conducts a daily safety tailboard meeting, in which safety and health issues and concerns are raised, safety & health training is conducted, or other environmental, health and safety information is communicated.\n\n    - \n\n1.7.2 Hazard Review\n\nOn January 22, 2002, a Hazard Review was completed at the PPP.  The focus of this hazard review was the SCR retrofit and corresponding ammonia systems for Units 5, 6 and 7. \n\n\n\nThe participants that conducted the hazard review of the SCR systems were: Tom Bertolini, Bob Jones, Jeff Bricker, Joe Sutton, Tim Hamilton, and Lynn Christensen from Mirant; Allen Armstrong and Thomas Wright from LaRoche Industries, the ammonia vendor; Don Nixon from the Contra Costa Health Services Department; and Dave Einolf and Leslie Fischbein from URS, the consultant that lead the hazard review.  Richard Ryan of the CCCFPD was also invited to the review, but did not attend.  \n\n\n\nParticipants discussed potential pitfalls of the SCR and ammonia systems by answering questions from a detailed What-If checklist.  The What-If checklist suggested events and conditions that could possibly led to a release of aqueous ammonia from the new systems.  The vast majority of these potential pitfalls were nullified by carefully planned design features of the new systems.  Aspects of the design discussed in the hazard review that minimize the potential for many hazards include: secondary containment for all tanks and piping that hold aqueous ammonia; selection of materials to avoid problems with corrosion or vibration; selection of equipment with few moving parts; the deployment of ammonia detectors at key locations; and re"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 25080,
      "SummaryText": "dundancy in control and safety measures.  Several recommendations were made to further reduce the potential hazards.  These recommendations, listed below, are primarily procedural and will be completed before aqueous ammonia arrives on-site.\n\n\n\n    - Ensure that the standard operating procedures include LaRoche specifications for chocking of delivery truck wheels.\n\n    - Develop standard operating procedures for balancing of tanks. \n\n    - Ensure design basis is included in safety information.\n\n    - Relief valves should have rain caps, and caps are to be included in inspections.\n\n    - Ensure that pre start-up procedure includes review of caps and flanges.\n\n    - Consider a collision barrier where piping exits the underground trench and moves up the wall of Unit 7. \n\n    - Ensure that the removal from service procedure includes provision for inspecting seal caps. \n\n    - Ensure critical valves are labeled prior to startup. \n\n    - Evaluate assembly area locations and Emergency Response plan, if current assembly locations are downwind of the ammonia storage facility.  \n\n    - Establish set routes within the PPP for aqueous ammonia trucks to access tanks. \n\n    - Consider signage prohibiting combustibles near the ammonia storage area.\n\n\n\nAll of the recommended changes will be made before aqueous ammonia is brought onsite at PPP.\n\n\n\nAt this time, no changes have been made to the ammonia systems as described in the corresponding Risk Management Plan.\n\n\n\nA table of recommendations (to be updated as appropriate) and the What-If checklist worksheet are attached.  This hazard review will be maintained on site at the PPP.  \n\n\n\n1.7.3 Operating Procedures\n\nThe PPP Production Supervisor is responsible for the development, implementation, and updating of the operating procedures at PPP.  All operating procedures are maintained on the company network, so that all employees can easily access the procedures from any computer at the plant.  Printed versions of the procedures are al"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 25080,
      "SummaryText": "so kept in the control room.  The operating procedures will be updated as required.  Personnel that work with the SCR system will receive initial training on the applicable operating procedures, or when procedures change.\n\n\n\nThe operating procedures contain a description of the procedures required to startup the entire SCR system, whether this is the initial startup, a startup following a normal or emergency shutdown, or a major change that requires a hazard review.  These procedures also describe the operating limits of the SCR.  Procedures are also in place for system shutdown under both normal and emergency conditions.  Normal operations of the entire SCR system are also described.  Temporary and emergency operations are conducted in the same manner as normal operations.  Other procedures have been developed for the unloading of the aqueous ammonia from a tanker truck to the storage tanks, feed pump operation, sump pump operation, and ammonia detection systems operation.  All of the above procedures are contained in the SCR Training Program Manual, which is maintained at PPP. \n\n\n\nHealth and safety considerations for handling ammonia are discussed in Section 1.7.1 and in the MSDS sheets.  The following systems have been implemented in the ammonia storage facility to ensure safe operations of the ammonia systems.\n\n\n\n1. Shutoff valves on the ammonia feed line, which will close automatically if:\n\n    - The low flue gas flow rate alarm is triggered, or\n\n    - The high ammonia/air volume ratio alarm is triggered, or\n\n    - The flue gas SCR reactor inlet low volume temperature alarm is triggered.\n\n2. Ammonia flow meters on the ammonia feed lines,\n\n3. Liquid level indication and high level alarm for each tank, easily visible from the unloading position,\n\n4. Indication of tank level, system pressures, pressure relief valve position and alarm status in the plant control room,\n\n5. Shutoff valves located on the tank fill lines, which will close automatically if the high-leve"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 25080,
      "SummaryText": "l alarm is triggered,\n\n6. Local manual controls for all pumps,\n\n7. Vacuum breaker valves on each tank,\n\n8. Ammonia area monitoring system with audible and visible alarms,\n\n9. Eyewash and shower stations at the storage facility,\n\n10. Emergency shower and eyewash stations at the ammonia vaporization equipment,\n\n11. Piping and connections for washdown of containment basin with clean water,\n\n12. Permanent lighting,\n\n13. Lightning protection,\n\n14. Truck barrier posts,\n\n15. Safety equipment (for two personnel) including:  two sets of escape respirators, two pairs of ammonia-resistant pants and jacket/slicker, one first aid kit, and one fire extinguisher.\n\n\n\n1.7.4 Training\n\nThe Training Coordinator is responsible for implementing, updating and recording all of the training programs at PPP.  An effective training program is key to safe, efficient operations with hazardous materials such as aqueous ammonia.  Employees must be provided with effective information and training on hazardous chemicals in their work area at the time of their initial assignment, and whenever a new physical or health hazard the employees have not previously been trained about is introduced into their work area.\n\n\n\nInformation and training may be designed to cover categories of hazards (e.g. flammability, carcinogenicity) or specific chemicals.  Chemical-specific information must always be available through labels and MSDSs.  Employees will be informed of any operations in their work area where hazardous chemicals are present, and of the location and availability of the written hazard communication program, including the required list of hazardous chemicals, and the required MSDSs.\n\n\n\nThe SCR Training Program Manual, which resides at PPP, informs employees about the equipment used with the SCR system, the controls and operations involved with the SCR system, how to conduct routine maintenance, how to troubleshoot problems in the system, and how to safely handle the system.\n\n\n\nTraining at PPP includes"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 25080,
      "SummaryText": " at least the following:\n\n    - Methods and observations that may be used to detect the presence or release of a hazardous chemical in the work area\n\n    - The physical and health hazards of the chemicals in the work area\n\n    - The measures employees can take to protect themselves from the hazards, such as appropriate work practices, emergency procedures, and personal protective equipment (PPE) used\n\n    - The hazard communication program, including an explanation of the labeling system and MSDSs, and how employees can obtain and use the appropriate hazard information.\n\n\n\nTraining will be documented through personnel training session sign-in sheets.\n\n\n\nAll Power Plant Technicians (Operations, Electrical & Mechanical Maintenance, Support Services, Technical Services) and Environmental, Health, & Safety personnel will receive annual refresher training, or more frequent training if necessary, about emergency response plans and relevant health and safety issues.  Additional hazardous materials training will be conducted for personnel working directly with the aqueous ammonia systems.  \n\n\n\nTraining will be conducted whenever:\n\n    - The job presents identified hazards\n\n    - Changes in job assignment impact hazard exposures\n\n    - New or previously unidentified hazards are identified as part of the job\n\n    - Work procedures or practices are developed or changed which may produce new hazards\n\n    - New substances, equipment, or tools are introduced that may present a hazard\n\nTo verify competency, written tests will be administered at the end of each training session and will be retained by the Training Coordinator.  On-going personnel training programs at PPP include, but are not limited to the following:\n\n\n\n    - Asbestos Awareness\n\n    - First Responder Awareness\n\n    - Hazard Communication\n\n    - Health and Safety Program\n\n    - Personal Protective Equipment Awareness\n\n    - Hearing Conservation\n\n    - Respiratory Protection Awareness\n\n    - Hazardous Waste Managemen"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 25080,
      "SummaryText": "t\n\n    - Bloodborne Pathogens\n\n    - Spill Prevention Control and Countermeasures Plan\n\n    - Confined Space \n\n    - Ergonomics\n\n    - Cardiopulmonary Resuscitation (CPR)/First Aid\n\n    - Lockout/Tagout\n\n    - Lead Awareness\n\n    - Incipient Fire Response\n\n    - Fall Protection\n\n\n\nTo ensure that contractors that work for Mirant are adequately trained, the following policies are implemented at PPP:\n\n    - As part of the contractual arrangement between any outside contractor and Mirant, the contractor is responsible for complying with OSHA Hazard Communication regulations and the Mirant Hazard Communication Plan.  Contractors are required to make available, upon request, a copy of their current Hazard Communication Plan.\n\n    - Contractors working on Mirant company property must be notified by Mirant of hazardous chemicals to which contractor's employees may be exposed, and appropriate control measures needed to limit such exposure.  Contractors must be notified of the location and contents of the Mirant site hazard communication plan.  Proper controls must be established to ensure that Mirant operations do not expose the contractor's employees to known safety and health hazards.  Contractors must be notified of precautionary measures to protect themselves while on the job and in the event of an emergency (e.g. alarms, evacuation routes, etc.)\n\n    - Copies of MSDSs for all chemicals the contractor's employees may be exposed to will be provided to the contractor upon request.  Likewise, all contractors are required to furnish Mirant with MSDSs for all hazardous chemicals that are planned to be brought on site upon request, prior to bringing the chemicals on site.\n\n\n\n1.7.5 Maintenance\n\nThe plant Production Supervisor is responsible for the ammonia system maintenance program, which includes implementing, recording and updating the program.  All personnel involved with the maintenance of the SCR system will be trained and the Training Coordinator will maintain the record"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 25080,
      "SummaryText": "s of the training.  \n\n\n\nMaintenance of major SCR equipment is performed on vendor-recommended basis and inspections are conducted in a timely manner.  The periodic equipment inspections will be documented in the company computer maintenance tracking system, MAXIMO. \n\n\n\n1.7.6 Compliance Audits\n\nTo ensure that the procedures and practices outlined above are adequate and being followed, a compliance audit shall be conducted at least every three years.  The compliance audit shall be conducted by at least one person knowledgeable in the process.  Mirant will assign this audit to the Environmental Health and Safety Department.  A report shall be created that addresses any deficiencies, along with suggested solutions.  The two most recent compliance audit reports shall be retained onsite, though this does not apply to any compliance audit report that is more than five years old.\n\n\n\nTo ensure that all aspects of the RMP program have been implemented correctly, two different audit programs will be implemented, as described below:\n\n    - Mirant Compliance Audit Program - Mirant's corporate office from Atlanta, GA performs periodic environmental, health and safety audits.  The purpose of these audits is to assess the overall adequacy of the environmental, health and safety management system and to provide reasonable assurance of compliance with all applicable regulations and Company requirements.  Corporate audits involve visual walkdowns of the facility, as well as interviews with management, operations and maintenance personnel.  A compliance review report is prepared with recommendations and resolutions. \n\n    - Facility Management Compliance Walkdown Audits - In-house audits are conducted by walkdowns of the various facilities, noting any hazardous conditions or housekeeping issues.  These audits are performed by plant personnel and health and safety representatives.  Issues are resolved immediately, or work orders are created for longer-term projects.\n\nThe Plant Manager a"
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 25080,
      "SummaryText": "t PPP will ensure the implementation of the recommendations from the audits, or at a minimum, will assess each recommendation to ensure it can be implemented at PPP. \n\n\n\n1.7.7 Incident Investigation\n\nThe Plant Manager at PPP is ultimately responsible for the all aspects of an incident investigation.  Investigations are conducted when injuries or illnesses occur, or when near misses (including any potential catastrophic release of hazardous materials) that could have serious implications occur and any incident that could potentially impact the facility, employees, neighbors, or the environment.  The primary purpose of the incident investigation is to assess the safety and health management systems pertaining to the specific incident, and to provide recommendations to prevent recurrence and improve Mirant's Health and Safety Program.\n\n\n\nAll incidents are reported immediately to the Health & Safety Department.  The supervisor in charge of the injured employee will fill out an incident report.  If the incident involves a recordable incident, or a serious or fatal injury or illness, the Health and Safety Department Representative will also perform an investigation.  The determination as to the seriousness of the incident will be left to the discretion of the Health and Safety Manager.  The incident investigation form is attached to the incident report.  This report includes the date of the incident, the date the investigation began, a description of the incident, factors contributing to the incident, root cause (s) of the incident and recommendations from the investigation and shall be stored on site for a minimum of five years.  A sample incident report form can be found in Appendix F of the RMP.\n\n\n\n    - The Health and Safety Representative will examine the location of the incident, as soon as possible after the incident occurs, and note any abnormalities.  Photos are to be taken, if possible.\n\n    - The Health and Safety Representative will interview each person invol"
    },
    {
      "ESSeqNum": 20,
      "FacilityID": 25080,
      "SummaryText": "ved in the incident and any witnesses, as soon as possible after the incident occurs.\n\n    - The Health and Safety Representative will estimate the causes of the incident, based on information from the incident location and from interviews.\n\n    - The Health and Safety Representative will review OSHA protocols, Operating Procedures, and the Health and Safety Program, and note any variations.\n\n    - The Health and Safety Representative and members of the investigation team will determine root cause(s) and make recommendations to ensure that this type of incident will not be repeated.\n\n    - The Health and Safety Representative will complete an incident report including the incident investigation section.\n\n    - The Health and Safety Representative will note in the incident report if the incident could potentially lead to a catastrophic release of hazardous materials.\n\n\n\nThe Health and Safety Representative, Health and Safety Manager, and Plant Manager will determine what actions are to be taken to prevent future incidents of this type.  The Plant Manager will implement these actions, including informing affected employees and neighbors.\n\n\n\n1.8 FIVE-YEAR ACCIDENT HISTORY\n\nLarge quantities of aqueous ammonia have not been present at PPP in the past.   During the past 5 years at the facility there have been no accidents involving regulated substances or other extremely hazardous substances that have resulted in deaths, injuries or significant property damage onsite, or known offsite deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.\n\n\n\nAccidents at PPP have been avoided by adhering to the safety and environmental programs listed in Section 1.7.1, continually improving the personnel safety training program and adhering to a strict maintenance program for all equipment involved with the storage and handling of hazardous substances.  \n\n\n\n1.9 EMERGENCY RESPONSE PROGRAM\n\nPPP has coordinated emergency response programs with the CCCHSD"
    },
    {
      "ESSeqNum": 21,
      "FacilityID": 25080,
      "SummaryText": " and the CCCFPD.  Periodically, the fire department inspects the facilities that store and handle flammable hazardous materials at PPP to ensure that the applicable Uniform Fire Code requirements are being met.  The CCCFPD visits once per year to practice a simulated emergency at the plant in order to ensure timely, effective, safe response plans.  In 2002 the visit is scheduled for April and the drill will involve rescuing an injured person from a confined space.  \n\n\n\nIn the unlikely event of an accidental release of a hazardous substance, PPP utilizes an alphanumeric paging system as its primary emergency notification system for all onsite personnel.  The system provides written information regarding the emergency.  If the release could result in an offsite public health concern, the emergency coordinator or incident commander shall notify Contra Costa County officials to determine if the community warning system (CWS) should be activated.   All community notifications, whether initiated manually or automatically, will be coordinated with the CCCFPD. \n\n\n\nThe above notification procedures are explained in detail in the Facility Emergency Plan along with procedures for minimizing the impact of an incident, appropriate response activities for each hazardous substance onsite, and the phone numbers to contact both on and offsite emergency response personnel.  The section of the Facility Emergency Plan addressing the aqueous ammonia has been included in Appendix G of the RMP.  The Facility Emergency Plan is updated and employees are retrained as new substances or emergency procedures are implemented at the PPP and an update log is maintained within the Plan. \n\n\n\nPPP personnel that can respond to an incidental release have successfully completed training in respiratory protection, hazard communication, Emergency Action Plan, use of personal protective equipment and decontamination procedures.\n\n\n\n1.10 PLANNED CHANGES TO IMPROVE SAFETY\n\nTo continue operating a safe, accide"
    },
    {
      "ESSeqNum": 22,
      "FacilityID": 25080,
      "SummaryText": "nt-free facility, the safety features described in previous sections of this document are implemented during the construction of the aqueous ammonia storage and handling facilities.  Regular equipment inspections, maintenance and safety reviews will ensure continued safe operations at PPP.  Mirant California's Safety Committee meets at least four times a year to review and develop the safety and health programs for the Delta Power Plants.  The Safety committee's charter, describing the methods used to verify and improve the safety and environmental programs, is provided in Appendix E of the RMP.\n\n\n\nAlso to improve the safety of the aqueous ammonia storage and handling systems at PPP, a Hazard Review was conducted as part of this Risk Management Program, which resulted in several recommendations to improve the system's safety.  The recommendations that have been or will soon be implemented are discussed in Section 1.7.2.  \n\n\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}