{
  "FacilityID": 25175,
  "FacilityName": "Moses Lake Industries, Inc.",
  "FacilityStr1": "8248 Randolph Road N.E.",
  "FacilityStr2": null,
  "FacilityCity": "Moses Lake",
  "FacilityState": "WA",
  "FacilityZipCode": "98837",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53025",
  "LEPC": "Grant County LEPC",
  "FacilityLatDecDegs": "47.203389",
  "FacilityLongDecDegs": "-119.293861",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "UN",
  "FacilityURL": "www.mlindustries.com",
  "FacilityEmailAddress": "jpnoga@mlindustries.com",
  "FacilityDUNS": 144414026,
  "ParentCompanyName": "TAMA Chemicals Co., Ltd.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Moses Lake Industries, Inc",
  "OperatorStr1": "8248 Randolph Road N.E.",
  "OperatorStr2": null,
  "OperatorCity": "Moses Lake",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98837",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jim Jaderholm",
  "RMPTitle": "EH&S Manager",
  "FTE": 61,
  "OtherEPAFacilityID": "WAD144414026",
  "EPAFacilityID": "100000177952",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1993-03-04 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-03-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-03-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-02-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-02-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 47.2072,
  "FRS_Long": -119.28774,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 35962,
      "AltID": "TMAC Production",
      "FacilityID": 25175,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 36850,
          "ProcessID": 35962,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 47138,
          "ProcessID": 35962,
          "ChemicalID": 98,
          "Quantity": 17000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 47139,
          "ProcessID": 35962,
          "ChemicalID": 113,
          "Quantity": 91896.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 113,
            "ChemicalName": "Trimethylamine [Methanamine, N,N-dimethyl-]",
            "CASNumber": "75-50-3",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 547138,
          "ProcessID": 35962,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 547139,
          "ProcessID": 35962,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 25175,
      "SummaryText": "Moses Lake Industries, Inc. Risk Management Plan (RMP) Executive Summary\n\n1. Accidental Release Prevention And Emergency Response Policies\n\nMoses Lake Industries, Inc. (MLI) is committed to employee, public and environmental safety.  Our comprehensive accidental release prevention program covers design, installation, operating procedures, maintenance, hazard analyses and employee training associated with the processes at our Moses Lake, WA facility.  We comply with all applicable federal, state, and local regulations as well as implement appropriate controls to prevent an accidental release of regulated substances.  If such an accidental release were to occur, procedures are in place to mitigate the release.\n\nOur emergency response program includes procedures for notification of the local fire department, notification of any potentially affected neighbors, and notification of local, state and federal agencies.  Safety is an essential part of our operations. Safety devices are built into the design of this facility.  Extensive training in safe work practices is provided to our employees.\n\n2. The Stationary Source And The Regulated Substance Handled\n\nMLI manufactures Tetramethylammonium Hydroxide (TMAH) at our facility in Moses Lake, WA.  The TMAH is produced from the electrolysis of Tetramethylammonium Carbonate (TMAC) solution.  The new proces manufacturing the TMAC is covered by the RMP.\n\nThe RMP regulated substances present at MLI are Trimethylamine (TMA) and Propane.  The maximum intended inventory of TMA in the TMA bulk storage tank (TK-001) is 91,896 pounds.  The maximum intended inventory of Propane in the RMP-covered facility's Propane tank is 17,000 pounds.\n\n3. The Worst-Case Release Scenario And Alternate-Case Release Scenario, Including Administrative Controls And Mitigation Measures To Limit The Endpoint Distances For Each Reported Scenario\n\nTo perform the required off-site consequence analysis for our facility we have utilized EPA's calculation software,"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 25175,
      "SummaryText": " \"RMP Comp.\" \n\nThe Worst-case Release Scenario submitted for the RMP Comp class, \"Program 3 Flammable Substances,\" involves a catastrophic release and explosion from the TMA Bulk Storage Tank TK-001.  The scenario involves releasing the entire contents of the tank in a gaseous form over a ten-minute period.  Such a release would extend beyond the facility boundaries before dropping below a one-pound per square inch (psi) overpressure.  Per CFR 68.25(g), no mitigation factors were considered in calculating this scenario's endpoint.\n\nThe Alternate-case Release Scenario submitted involves the same risks as presented in the Worst-case Release Scenario, except that the scenario results from the complete rupture of a two-inch TMA truck transfer hose.  Line size, routing, driving force, and line appurtenances (any supporting or surrounding piping or instrumentation) were considered in calculating the release quantity and duration.  This scenario would release TMA to the atmosphere over a five-minute period.  This release would travel off-site before reducing below a one-pound per square inch (psi) overpressure. Under the RMP, TMA is regulated by EPA only as a flammable substance.  Per CFR 68.25(g), no mitigation factors were considered in calculating this scenario's endpoint.\n\n4. The Accidental Release Prevention Program And The Chemical Prevention Steps\n\nMLI has taken all of the necessary steps to comply with the Accidental Release Prevention requirements stipulated by the EPA under 40 CFR Part 68 as well as those of OSHA under the PSM standard 29 CFR 1910.119.  MLI has been subject to EPCRA 302 notification requirements.  In addition, with the newly covered RMP process, the facility will be subject to EPCRA 313 notification requirements.  Sections 4a through 4l below briefly describe the elements of the Accidental Release Prevention program that are in place at our facility.\n\na.  Process Safety Information\n\nMLI maintains a detailed compilation of Process Safety Informati"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 25175,
      "SummaryText": "on for the TMAC Facility.  This information describes the chemical hazards, operating parameters and equipment design associated with this new RMP-covered process.\n\nb.  Process Hazard Analysis (PHA)\n\nMLI conducted and will continue to conduct comprehensive studies to ensure that hazards associated with the new RMP-covered process are identified and controlled.  The methodology used to carry out the hazard analysis on the covered process was a combination of the Hazard and Operability (HAZOP) Technique and the What-if/Checklist Technique.  A team of qualified personnel with expertise in engineering and operations undertook and will continue to undertake the PHA evaluations.  The studies are and will be led by personnel with knowledge and expertise in the techniques utilized to conduct this hazard analysis.  The PHA evaluations will be revalidated every five years.  Any findings of the team will be addressed in a timely and efficient manner.\n\nc.  Operating Procedures\n\nMLI maintains written operating procedures for the RMP-covered facility.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, and normal shutdown.  The information is regularly reviewed and is readily available to operators working in the covered processes.\n\nd. Training\n \nMLI has a comprehensive Process Safety Management (PSM) training program in place.  This ensures that employees, whose job tasks are affected by the covered process, are competent in the operating procedures associated with the process.  Refresher PSM training is provided at least every three years and more frequently as needed.\n\ne.  Mechanical Integrity\n\nMLI carries out documented maintenance checks on process equipment within the newly covered RMP process to ensure proper operations.  Process equipment that is examined includes: pressure vessels, storage tanks, piping system and components, relief and vent systems, controls, and"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 25175,
      "SummaryText": " pumps.  Trained and qualified personnel carry out maintenance operations.  Any equipment deficiencies identified are corrected in a safe and timely manner.\n\nf.  Management of Change\n\nWritten procedures are in place at MLI to manage changes to process chemicals, technology, equipment, and procedures within the RMP-covered process.  Process operators, maintenance personnel and any employee whose job task is affected by the change are promptly made aware of and trained on the change.\n\ng.  Pre-startup Safety Reviews\n\nPre-startup safety reviews related to the newly covered RMP processes and to modifications in established covered RMP processes are conducted regularly.  These reviews are conducted to confirm that construction, equipment, and operating and maintenance procedures are suitable for safe startup of the process prior to placing the equipment into service.\n\nh.  Compliance Audits\n\nMLI will conduct audits on a regular basis, as stipulated in 40 CFR Part 68, to determine whether the provisions set out under the RMP regulation are being properly implemented in this newly covered RMP process.  These audits are conducted at least every three years and any corrective actions required as a result will be undertaken in a safe and prompt manner.  Personnel with expertise in auditing will be utilized to complete the audits.\n\ni.  Incident Investigation\n\nIt is MLI's policy to investigate any incident that has resulted in, or could reasonably result in, a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent reoccurrence.  All incident investigation reports are retained for five years.\n\nj.  Employee Participation\n\nMLI believes that Process Safety Management and accident prevention is a team effort.  Employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, MLI employees h"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 25175,
      "SummaryText": "ave access to all information created as part of the facility's implementation of the RMP rule.  This includes information pertaining to the Process Hazard Analysis.\n \n\nk.  Hot Work Permit\n\nMLI has a policy in place to safely conduct cutting, welding, or brazing activities in or adjacent to the covered process.\n\nl.  Contractors\n\nOn occasion, our facility hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is conducted.  With the RMP-covered process, MLI is implementing a strict policy of informing the contractors of known potential hazards related to the contractor's work in the covered area.  Contractors are also informed of the procedures for emergency response.\n\n5. Five-Year Accident History\n\nThe covered process is a new facility on the plant site.  Therefore, there is no history of accidental releases.\n\n6. Emergency Response Plan\n\nMLI maintains a written Emergency Response Plan to deal with potential accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, and notification of local emergency response agencies and the public.\n\nThe emergency response equipment is regularly inspected and serviced.  Mock emergency cleanup drills are conducted.  \n\nThe Grant County Local Emergency Planning Committee is the local emergency response committee with which our Emergency Response Plan has been coordinated.\n\n7. Planned Changes To Improve Safety\n\nIt is MLI policy to continually enhance safety and identify areas of improvement.  The company provides the direction and resources (equipment, training and work environment) such that employees and contractors will perform their jobs safely.  Each supervisor is responsible for a safe work environment and sees that each employee is adequately trained to recognize and comply with established safe work practi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 25175,
      "SummaryText": "ces.  A safety committee, consisting of management and employee representatives, constantly works to improve safety in the workplace.  Each employee is responsible to be alert and accountable for his or her own actions.  Each employee is trained to notify management of unsafe conditions, training needs, compliance issues and to follow safe work practices."
    }
  ]
}