{
  "FacilityID": 252,
  "FacilityName": "United Co-op Agronomy Center",
  "FacilityStr1": "East Idaho St.",
  "FacilityStr2": null,
  "FacilityCity": "Paul",
  "FacilityState": "ID",
  "FacilityZipCode": "83347",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "16067",
  "LEPC": "Minidoka County LEPC",
  "FacilityLatDecDegs": "42.608556",
  "FacilityLongDecDegs": "-113.770583",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "united@cyberhighway.net",
  "FacilityDUNS": null,
  "ParentCompanyName": "United Co-op, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 33999301,
  "Company2DUNS": null,
  "OperatorName": "Steve L. Sanders",
  "OperatorStr1": "P.O. Box 365",
  "OperatorStr2": null,
  "OperatorCity": "Rupert",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83350",
  "OperatorZipCodeExt": null,
  "FTE": 17,
  "OtherEPAFacilityID": "ID0000590026",
  "EPAFacilityID": "100000002294",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-14 00:00:00",
  "SafetyInspectionBy": "USDOT HAZARDOUS MATERIALS DIVISION",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-04-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-04-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-04-07 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-06-17 00:00:00",
  "DeRegistrationEffectiveDate": "2004-06-01 00:00:00",
  "AnniversaryDate": "2004-04-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0.5",
  "FRS_Lat": 42.608384,
  "FRS_Long": -113.771406,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 290,
      "AltID": "NH3",
      "FacilityID": 252,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 349,
          "ProcessID": 290,
          "ChemicalID": 56,
          "Quantity": 410000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 291,
          "ProcessID": 290,
          "NAICSCode": "42291",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 195,
              "Process_NAICS_ID": 291,
              "SafetyReviewDate": "1999-03-11 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "Yes",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "Fertilizer Institute Standards for the Storage and Handling of Anhydrous Ammonia",
              "FR_Comments": null,
              "HazardReviewDate": "1999-03-11 00:00:00",
              "ChangeCompletionDate": "1999-03-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-11 00:00:00",
              "TrainingReviewDate": "1999-03-11 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-11 00:00:00",
              "EquipmentInspectionDate": "1999-03-11 00:00:00",
              "EquipmentTested": "loading and unloading hoses",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-03-11 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 198,
                  "PreventionProgram2ID": 195,
                  "ProcessChemicalID": 349
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 252,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Minidoka County EPC",
    "CoordinatingAgencyPhone": "2084366976",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "49CFR172 Hazardous Materials"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 252,
      "SummaryText": "United Co-op's Agronomy Center is a retail farm fertilizer and chemical facility.  Farm herbicides and pesticides, some of which are classified as hazardous, are received, stored on site, and delivered to farms as they are sold in their original manufactured package or container.  Several herbicides and a fumigant are stored and delivered in bulk including some repackaging.  None of these bulk materials are classified as hazardous to humans.  Dry fertilizer products are warehoused in bulk, blended, and delivered to the farm for application either in rental applicators that the farmer applies product with himself or by our own trucks when we apply with our spreader trucks.  Liquid nitrogen and phosphate fertilizers are stored on site, blended, and delivered to the farm for application.  All bulk liquid fertilizers and chemicals on site are stored in tanks enclosed in concrete containment areas.  Loading pads for liquid products are designed for spill containment.  Anhydrous ammonia is stored in three tanks resting on concrete saddles.  Each tank has a capacity for 135,000 pounds when loaded to prescribed maximum limits.  Anhydrous ammonia is received by rail or truck and stored until delivered to the farm.  Delivery from storage is accomplished by transferring product into 1,000 gallon liquid capacity trailers which are then towed by either our vehicles or the customer's vehicle to the field for application.\n\nOur anhydrous ammonia storage plant was built to comply with industry standards that have been designed to ensure the highest level of safety.  The system is equipped with pressure relief valves, check valves, and excess flow valves that are designed to prevent or minimize a release due to hose or line failure.  Transfer hoses are replaced when they show wear or at the very least within the prescribed limits for the hose type.  Inspections and periodic maintenance are performed to ensure that all equipment is in proper working order.\n\nUniited Co-op's management"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 252,
      "SummaryText": "and Board of Directors are committed to providing a safe working environment for employees, protecting our customers and neighbors from the hazards of products we sell, and being good environmental stewards.  We have written company policies for communication of the hazards in our workplace as well as a comprehensive training program.  The training program for all new employees includes sections on general safety, drug awareness, bloodborne pathogens, fire protection, personal protective equipment, hazardous communication, material safety data sheets, and emergency action plans.  In addition job or department specific training is provided for such things as forklift safety, propane handling, petroleum products handling, hazardous chemicals, and anhydrous ammonia.  For example all, employees who will handle anhydrous ammonia will go through a written comprehensive training program explaining the properties and hazards of anhydrous ammonia and the safe and proper techniques involved in unloading tank cars or trucks into our storage and transferring the product into nurse trailers for shipment to the farm.  This training includes protective equipment to be worn, accident prevention, measures to be used in case of a release, and first aid treatment for injuries.  The anhydrous ammonia training includes oral testing of the trainees at the end of each section.  New employees are then trained on the job by the Plant Supervisor for specific tasks they will perform and work with an experienced employee until they are proficient at the task.  Update safety and training information is provided for petroleum and agronomy employees annually before each new spring season begins.\n\nOur facilities have written emergency action plans.  Each new employee is required to become familiar with the plan during initial training.  It is reviewed and discussed at each annual training update.  The plans give detailed information for such things as notification of employees of a hazardous situa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 252,
      "SummaryText": "tion, evacuation procedures, notification of emergency response units, and duties and responsibilities assigned to specific persons.  The plan also details prevention programs, safety information, training required, maintenance, periodic inspections and the persons responsible.  The written plan for the Agronomy Plant has been revised to provide more specific information for a toxic release of anhydrous ammonia as a result of preparing this risk management plan.  Our local fire departments and emergency responders are well acquainted with our facilities and the potential hazards associated with them.  They have visited our sites and we keep them informed of any changes in our operations.  Annually when we file our SARA reports with them, we update site plans as well as reporting inventory information for hazardous materials on site.\n\nWe have had no accidental releases of anhydrous ammonia in the last five years, in fact to my knowledge we have had no reportable releases in the last ten years.\n\nThe worst case scenario presented in our program is the ten minute release of all the product in one of our storage tanks.  All of our release scenarios were modeled using RMP*Comp version 1.06.  The worst case scenario would release 135,000 pounds of anhydrous ammonia in ten minutes at 77 degrees Fahrenheit with a wind of 3.4 miles per hour and no mitigation measures taken.  The estimated distance to the toxic endpoint would be 4.4 miles.  This scenario would have to be the result of a disaster that ruptured the tank since no line is large enough to accomplish the release in that length of time.\n\nOne alternative scenario is based on the assumption that a two-inch unloading hose would burst while transferring anhydrous ammonia from a rail car to storage, and the assumption that the excess flow valve on the end of the piping the hose is connected to would fail at the same time.  Since two employees are required to be present during unloading we assume that they will manually sh"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 252,
      "SummaryText": "ut down the valves within five minutes even if they have to put on a respirator to accomplish the task.  The release at the end of five minutes would be 44,800 pounds and the estimated distance to the toxic endpoint at 77 degrees Fahrenheit with a 6.7 mile per hour wind would be 0.6 miles.\n\nThe second alternate scenario is based on the assumption that a one inch hose bursts while filling a nurse tank from storage, and the assumption that the excess flow valve behind the hose would fail.  Again since the process is employee controlled, there would be someone present to manually shut off  a valve within five minutes.  The total release would be 11,150 pounds.  At 77 degrees Fahrenheit with a 6.7 mile per hour wind the distance to the toxic endpoint would be 0.3 miles.\n\nAll three scenarios would result in an offsite impact of varying degree depending of course on wind direction.  A north or east wind carrying the release southerly or westerly would create the greatest population impact.  A west or south wind would produce the least effect on the surrounding population.  Prevailing winds are from the west in the area except during the winter months when the wind often comes from the east.\n\nThe effects of the release could be minimized with an overspray of water if accomplished in time.  This overspray could be accomplished by the fire department and/or a spray of ninety gallons per minute that could be delivered from a sandpoint well on our property and adjacent to the anhydrous ammonia plant.\n\nThe best prevention of an offsite toxic release of anhydrous ammonia is a proper inspection and maintenance program that insures all equipment is sound and working properly, and all transfer hoses are inspected for wear and replaced within the prescribed period depending on the type of hose used.  In addition to that, well trained employees who perform their tasks in a proper and safe manner, who understand the properties of anhydrous ammonia, and who are trained for the proper a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 252,
      "SummaryText": "nd safe response to an accidental release will minimize the effect of any such release.  As indicated in this narrative, United Co-op has been and continues to be committed to the safe operation of our facilities through training, inspection, maintenance, communication, and compliance with industry standards for all our facilities in order to provide the safest possible environment for our employees and surrounding neighbors."
    }
  ]
}