{
  "FacilityID": 2546,
  "FacilityName": "City of Columbia Wastewater Treatment Plant",
  "FacilityStr1": "1244 Treatment Plant Road",
  "FacilityStr2": null,
  "FacilityCity": "Columbia",
  "FacilityState": "TN",
  "FacilityZipCode": "38401",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47119",
  "LEPC": null,
  "FacilityLatDecDegs": "35.639444",
  "FacilityLongDecDegs": "-87.118333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "wwtp@edge.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Columbia, Tennessee",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Columbia",
  "OperatorStr1": "1244 Treatment Plant Road",
  "OperatorStr2": null,
  "OperatorCity": "Columbia",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "38401",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael G. Anderson",
  "RMPTitle": "Wastewater Director",
  "FTE": 45,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000030557",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-12-02 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2003-06-09 00:00:00",
  "DeRegistrationEffectiveDate": "2002-04-25 00:00:00",
  "AnniversaryDate": "2004-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 35.64,
  "FRS_Long": -87.08722,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2846,
      "AltID": "Sewage Treatment",
      "FacilityID": 2546,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2907,
          "ProcessID": 2846,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3041,
          "ProcessID": 2846,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503041,
          "ProcessID": 2846,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2546,
      "SummaryText": "COLUMBIA WASTEWATER SYSTEM\n\nEXECUTIVE SUMMARY\n\n1. PURPOSE: This document contains requirements and procedures for preventing or minimizing the consequences of a catastrophic release of toxic chlorine (Cl2) which is maintained and used in the disinfection process at the wastewater treatment plant (WWTP).\n\n2. GENERAL: Chlorine is a highly hazardous chemical which is used from one-ton cylinders at the WWTP. Columbia WWTP employees are normally involved in activities such as storage, use, and on-site movement of the chemical. Since a catastrophic release of this chemical would present serious dangers to employees and the surrounding community; all WWTP employees must be thoroughly familiar with all aspects of this document.\n\n3. MANAGEMENT CONTROLS:\n\nA. Employee Participation: Input from Columbia Wastewater System employees is critical for implementation and maintainance of an effective PSM program. Employees are strongly encouraged to participate in:\n\n1) Gathering process safety information.\n2) Conducting and developing the PSM program elements and hazards assessments, as well as incident investigation findings.\n3) Obtaining access to process hazards analyses and the rest of the PSM program.\n4) Any other participation consistent with improving safety.\n\nB. Process Equipment and Technology: Process flow diagrams are contained in the WWTP blueprints and operation & maintenance manual. Detailed information on process equipment is contained in the WWTP operation & maintenance manual.\n\nC. Process Safety Management Training: Columbia WWTP employees handling one-ton cylinders, performing maintenance on the chlorine system and/or operating the system receive proper training before engaging in any work. This training includes hazards of the chemical, cylinder handling, piping system, relief and vent system, emergency shutdown, and controls. All employees, including maintenance and contractor employees, who are involved with the WWTP disinfection process are required to fully unde"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2546,
      "SummaryText": "rstand the safety and health hazards of chlorine for the protection of themselves, their fellow employees, and the citizens of nearby communities. Training in hazard communication is implemented in order to allow employees to be more knowledgeable about the chemicals they work with, as well as familiarize them with reading and understanding material safety data sheets (MSDS). Additional training is covered in this PSM program in subjects such as operating procedures and safe work practices, emergency evacuation and response, routine and non-routine work authorization activities, and other areas pertinent to process safety and health.\n\nThe WWTP Superintendent is responsible for implementation and documentation of employee training. Employees shall be trained at the time of their initial assignment and undergo refresher training every three (3) years. When a new hazard is introduced, all employees must be retrained. Documentation of training shall include the identity of the employee, the date of training, and the means used to verify the employee understood the training.\n\nD. Standard Operating Procedures (SOP): Standard Operating Procedures (SOP) have been developed and implemented for the Columbia WWTP. Operating procedures describe tasks to be performed, data to be recorded, operating conditions to be maintained, samples to be collected, and safety and health precautions to be taken. Procedures are revised periodically to ensure that they reflect current operations. \n\nE. Contractor Safety: Columbia Wastewater System occasionally uses contractors to perform work in and around the WWTP disinfection process. It is the goal of Columbia Wastewater System to hire contractors who accomplish the desired tasks without compromising the safety and health of employees. Contractors shall be informed of the known potential fire, explosion, or toxic release hazards related to the contractor's work and processes. An explanation and copy of the emergency action plan shall be provid"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2546,
      "SummaryText": "ed to contract employers and a contract employee injury and illness log related to contractor's work in process areas shall be maintained on the bulletin board at the WWTP.\n\nThe WWTP Superintendent shall ensure that the contractor notify Columbia Wastewater System personnel of any unique hazards presented by the contractor's work, or of any hazards found by the contractor.\n\nF. Non-routine work: Non-routine work (i.e., lockout/tagout, line breaking, confined space entry, and hot work) is controlled at the WWTP in a consistent manner. Clear steps to be taken for non-routine tasks are communicated to those doing the work as well as operating personnel. Following are examples of non-routine tasks that may be conducted in the disinfection process area:\n\n7 Welding\n7 Painting\n7 Electrical Repair\n7 Pipe Repair/replacement\n\nAny of the above tasks in the disinfection process area requires the permission of the WWTP Chief Operator. Lockout/tagout, line breaking, confined space entry and hot work procedures are all part of the overall safety plans under current enforcement. All of these tasks require permits or tags.\n\nG. Supporting Guidelines: Additional operating procedures, training requirements, and safety considerations are contained in the WWTP operation & maintenance manual, Columbia Wastewater System procedures, and several portions of the Chemical Hygiene Plan.\n\nH. Inspections and Equipment Testing: The disinfection process equipment, leak control kits, SCBA equipment, and the alarm system shall be inspected for proper availability and operation on a routine basis by each WWTP Operator. Deficiencies will be corrected on the spot (if possible) and noted in plant operations log. \n\nI. Incidents and Investigations: Each incident which resulted in, or could reasonably have resulted in, a catastrophic release of chlorine at the WWTP will be immediately reported to the WWTP Superintendent. The WWTP Superintendent will initiate an investigation no later than 48 hours following "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2546,
      "SummaryText": "the incident.\n\n1) The incident investigation team will consist of a WWTP Operator, the WWTP Superintendent, and the WWTP Chief Operator. After the investigation, the team will prepare a report for the Wastewater Department Director containing the statements from all employees involved in the incident and the following information:\n\na) Date of the incident.\nb) Date investigation began.\nc) Description of the incident.\nd) Factors that contributed to the incident.\ne) Recommendations resulting from the investigation.\n\n2) The Wastewater Department Director will assign required actions to staff members to promptly address and resolve the incident report findings. The incident report will be reviewed and initialed by all employees whose job task are relevant to the incident findings.\n3) The WWTP Superintendent shall file all incident investigation reports and documents on the resolution and corrective actions. Such files shall be maintained for a period of five years.\n\nL. Compliance Audits: WWTP Chief Operator and WWTP Superintendent will conduct an audit every three years to evaluate compliance with procedures and practices related to chlorine. The Wastewater Department Director shall assign staff action to document a response to findings of the compliance audit and document that deficiencies have been corrected. All audit information shall be filed by the WWTP Superintendent who will retain all associated information for the two most recent audits.\n\nM. Management of change procedures: PSM changes include all modifications to equipment, procedures, raw materials, processing conditions other than \"replacement in kind\", and temporary changes.\n\nThe general procedures to manage any changes (except for replacements in kind) to disinfection process chemicals, technology, equipment, procedures and facilities require additional training before operation. The WWTP Superintendent will ensure that employees involved in operating and/or maintaining the disinfection process and contrac"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 2546,
      "SummaryText": "t employees whose job tasks will be affected by a change in the process shall be informed of (and trained in) the change prior to startup of the process or affected part of the process.\n\n4. LEAK DETECTION AND ASSESSMENT PROCEDURES: Initial detection of a chlorine leak will most likely be made by the on-duty WWTP Operator while running the plant checklist or by the remote sensors and alarm system located at the chlorine building.\n\nA. Sensor Detection: The control unit for the leak alarm system is located in the chlorinator room at the chlorine building. The sensor is located in chlorinator room and set to detect levels of 2 ppm or higher and transmit data to the control unit. If the concentration at the sensor is 2 ppm or higher, an audible alarm and flashing visual alarm will be received at the administration building.\n\nB. Operator Detection: The on-duty WWTP Operator may detect a leak upon entry into the chlorine building either during duty hours when assistance is readily available or during after duty hours while they are alone. In order to reduce potential exposure and increase response time the following procedures will be followed by all employees with job task at the chlorine building:\n\n1) Have an operational radio at the building during all visits. Make a visual check of the SCBA for operation and air supply before proceeding with the work.\n2) Make a visual inspection for broken pipes, water spills, green slime on piping, or visible gas clouds before entry. Turn on exhaust fans for at least 30 seconds prior to entry.\n3) If a leak is detected upon entry, make a quick mental evaluation based on physiological signs and visual indications, depart the building, secure a SCBA unit, get assistance, and take the appropriate emergency release action based on the leak assessment.\n4) If a leak is not detected, conduct assigned task as quickly as possible with an attempt to restrict time in the building to 15 minutes or less. Since the chlorine PEL is below the detectab"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 2546,
      "SummaryText": "le odor level and alarm setting, activities inside the building should be restricted to 30 minute average periods repeated no more than four times daily, with one hour between visits.\n\nC. Leak Assessment: The person detecting the leak must make an immediate assessment of the hazard associated with the leak and take positive actions to correct the situation. The procedures listed below shall be followed to establish the severity of the particular leak situation and to determine the appropriate rapid response:\n\n1) Determine the category of the leak based on the following information:\n\nLevel I: Level I is a limited emergency condition. Such situations normally can be controlled by plant personnel due to the small magnitude of the incident and the minimal degree of the hazard. No evacuation is indicated other than the isolation of the immediate incident area. The incident is confined to a small geographic area. This would involve a release of chlorine gas at, or less than 1 ppm. SCBA and Class D protective equipment is adequate for response. Less than 10 pounds of chlorine is released.\n\nLevel II: Level II is a limited emergency condition. Such situations pose a potential threat to life and the environment and require help from outside agencies. This is a more serious situation with a greater quantity or higher degree of chlorine involved. Normally this type of situation may involve a limited evacuation of an area of 1000 feet down wind from the spill. This would involve a release of chlorine at 1 to 10 ppm resulting in serious health effects to affected workers, requiring medical treatment. Release normally exceeding 10 lbs. of chorine.\n\nLevel III: Level III is a large-scale emergency condition. Such situations pose a major threat to life, property, and/or the environment. The incident involves a relatively large quantity of chlorine, and the potential for a large area to be affected. Potentially, many people must be evacuated. This would involve a release of more than "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 2546,
      "SummaryText": "10 ppm of chlorine resulting in a high likelihood of injury or death. Release greatly exceeding 10 lbs. of chorine.\n\n2) Take the appropriate emergency release action for the category in which the leak is assessed.\n\n5. PROCESS HAZARD ANALYSIS OF RELEASE SCENARIOS: Process hazard analysis (PHA) is an organized and systematic effort to identify and analyze the significance of potential hazards associated with the processing or handling of chlorine. PHA is directed toward analyzing potential causes and consequences of fires, explosions, releases and major spills of chlorine. PHA focuses on equipment, instrumentation, utilities, human actions (routine and non-routine), and external factors that might impact the process. These considerations assist in determining the hazards and potential failure points or failure modes in a process. Columbia WWTP processes are relatively uncomplicated, and were reviewed from unloading of cylinders to discharge to environment. At each handling or processing step, \"what if\" questions were formulated and answered to evaluate the effects of component failures or procedural errors on the process.\n\nIt can be expected that certain situations will cause a given leak category to occur as follows:\n\nA. Level I:\n\n1) The pigtail leaks because of a defective or improperly mounted lead gasket, resulting in a minor release of gas inside the scale room.\n2) The chlorine gas lines and/or connections from the scale room thru the chlorinator room are damaged or degraded to the point of causing residual gas up-line in the system to be released.\n3) The rotameter fails, breaks or ruptures because of internal defect, or physical damage, causing a minor leak of gas to the immediate area.\n\nB. Level II:\n\n1) The pigtail leaks because of a defective or improperly mounted lead gasket, resulting in a minor release of gas inside the scale room.\n2) The chlorine gas lines and/or connections from the scale room thru the chlorinator room are damaged or degraded to the point"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 2546,
      "SummaryText": " of causing residual gas up-line in the system to be released.\n3) The rotameter fails, breaks or ruptures because of internal defect, or physical damage, causing a minor leak of gas to the immediate area.\n \nC. Level III:\n\n1) A chlorine cylinder is dropped during loading, unloading, or handling, resulting in the rupturing of the cylinder or valve stem and the uncontrolled release of the contents of the cylinder.\n2) The packing leaks from a defective valve on a chlorine cylinder, resulting in an uncontrolled release of gas, or liquid from a cylinder.\n3) An explosive or incendiary device is planted in the storage room. The resulting fire or explosion damages several cylinders causing uncontrolled release of gas or liquid from the cylinder(s).\n\n6. APPROPRIATE RESPONSE: It is important that only the most qualified personnel who have been trained in leak detection and control respond to a given situation. All assigned WWTP personnel, WWTP maintenance personnel and on-call supervisors will receive basic training at least every three (3) years. Such training shall be conducted by the WWTP Superintendent.\n\nA. Key Personnel: The personnel listed below are shown in the order of expected expertise for the detection and containment of a hazardous chemical leak:\n\n7 Tennessee Emergency Management Agency (TEMA) (800) 262-3300\n7 PB & S Chemical Supply (800) 876-0790\n7 Assigned WWTP Superintendent/Chief Operator/Operators\n7 Assigned WWTP Maintenance Staff\n7 Additional City of Columbia trained personnel, including Fire Department\n\nB. Response Time: The time of response for actual leak containment is critical for any leak. It is expected that Columbia Wastewater System personnel will make the first response to any category of leak with City of Columbia elements as backup personnel. The next soonest response would be from TEMA and then the chemical supplier. TEMA and chemical supplier notification is crucial on all Level III spills, since Columbia Wastewater System does not have the exp"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 2546,
      "SummaryText": "ertise in decontamination, cleanup and disposal.\n\nC. Specific Roles: To minimize the danger of unnecessary exposure and to insure rapid containment, the following specific roles are designated for key players:\n\n1) WWTP Operator - Isolate and Stop Leak - Minimum of 2 personnel working in SCBA equipment at the leak site.\n2) WWTP Operator, Chief Operator or Superintendent - Provide coordination effort from near vicinity of leak area - SCBA equipment and Columbia Wastewater System radio.\n3) Additional on-duty or on-call Columbia Wastewater System personnel - Report to WWTP for backup coordination and support effort.\n4) Columbia Fire Department - Locate in the vicinity of the leak but outside the actual chemical dispersal area. - Provide equipment and SCBA equipped firemen at the leak site on order.\n5) Columbia Police Department - Locate upwind and provide necessary traffic control and public sector notifications as directed.\n6) Maury County Ambulance Service - Locate upwind and prepare to receive chlorine exposed personnel for transport to Maury Regional Hospital.\n7) Contracted Chemical Supplier - Provide fully equipped team for leak isolation and control. Remove chemicals as directed.\n8) Tennessee Emergency Management Agency (TEMA) - Provide fully equipped team for leak control and cleanup. Assume responsibility of overall site control upon arrival.\n\nD. Response Requirements: The level of response to a given leak category will generally depend on the area affected and concentrations within the chemical dispersal area. Shown below are expected response requirements.\n\nCategory-Area Affected-Response Requirements\n\nLevel I-WWTP area only-WWTP personnel\nLevel I-Civilian Area-WWTP personnel, City\nLevel II-WWTP area only-WWTP personnel, City\nLevel II-Civilian Area-WWTP personnel, City, TEMA\nLevel III-Any Area-WWTP personnel, City, TEMA, Supplier\nLevel III-Any Area-WWTP personnel, City, TEMA, Supplier\n\nNOTE: Authorization to call on outside agencies will be based on the leak a"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 2546,
      "SummaryText": "ssessment and maybe initiated by the WWTP Operator without further supervisory authorization.\n\nE. Key Telephone Numbers:\n\n7 Tennessee Emergency Management Agency (TEMA) (800) 262-3300\n7 PBS Chemical Supply (800) 876-0790\n7 Fire, Police, and Ambulance - 911\n7 Wastewater Department Director - Mike Anderson - 380-2839\n7 WWTP Superintendent - Mark Williams - 380-0799\n7 WWTP Chief Operator - Bud Creel - 388-9781\n7 WWTP Operator - Ronnie Pruitt - 381-5211\n7 WWTP Operator - Bill Bullock - speed dial 92 (access via WWTP Operator's phone)\n7 WWTP Operator - Will Rhine - 381-1954\n7 WWTP Operator - Terry Kessinger - 380-1956\n7 WWTP Operator - Jim Thompson - 380-0308\n7 WWTP Operator - John Sajovic - 380-0217\n7 WWTP Operator - Don Allman - 381-2935\n7 WWTP Operator - Kenneth Nance - 388-8425\n7 WWTP Maintenance Foreman - Wayne Pruitt - 381-9630\n\n7. RECOMMENDATIONS FOR PERSONAL PROTECTIVE EQUIPMENT: These recommendations are based in part on the assumption that any responders to a chlorine release may encounter a chlorine concentration at or above that designated by the National Institute for Occupational Safety and Health (NIOSH) as immediately dangerous to life or health (IDLH - 10 ppm). In addition, these recommendations also assume that no other hazardous chemicals requiring more stringent requirements will be encountered by the emergency responders. OSHA has additional specific requirements (29 CFR 1910.156(e) for fire fighting operations.\n\nA. Chlorine Liquid: Emergency responders to a liquid chlorine release can be potentially exposed to liquid chlorine that is capable of causing thermal burns. Emergency responders should adhere to the guidelines for a Level A protection. Level A protection is defined as follows:\n\n1) Positive pressure, full face self-contained breathing apparatus (SCBA).\n\nFour (4) Self-Contained Breathing Apparatus (SCBA) backpack units are available. One SCBA backpack unit is affixed to the dewater building at the door on the lower level. The others are locat"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 2546,
      "SummaryText": "ed in the administration building.\n\n2) Protective clothing including the following items:\na) chemical protective suit, Level A with attached gloves.\nb) footwear or footwear cover of butyl rubber.\nc) undergarments to provide thermal protection for exposure to liquid chlorine.\n\nB. Chlorine Gas: Enhanced Level B protection (chemical resistant clothing) provides appropriate protection to emergency responders for gaseous chlorine, according to the Chlorine Institute. Unless it is designed to be self-sealing, the chemical resistant clothing should be sealed using chlorine compatible tape at the openings for the hands and feet. \n\n8. RESPONSE TO FIRES IN CHLORINE STORAGE AREA: Chlorine will not ignite but may contribute to or support combustion. If fire is present or imminent, chlorine containers and equipment should be moved away from the fire if possible. If a non-leaking container or equipment cannot be moved, it should be kept cool by applying water. Also, the fusible plugs on the cylinders will melt at 158 F. The following procedures should be followed:\n\nA. Anyone within 300 feet of the fire zone should don a SCBA.\n\nB. If possible, keep cylinders below 158 F to prevent melting of the fusible plugs in the cylinders and the resulting uncontrolled release of cylinder contents.\n\nC. If chlorine gas does escape, use a fine mist spray of water to act as a curtain to keep the leaking gas away from the fire. NOTE: Do Not Pour Water Directly On A Leaking Chlorine Container.\n\n9. EVACUATION GUIDELINES: The following guidelines provide direction for evacuation of facility personnel in the event of a chlorine emergency:\n\nA. In case of a chlorine emergency that requires evacuation of WWTP personnel, if possible, the evacuation will be initiated by a warning over the PA system. If the evacuation warning cannot be delivered over the PA system, the WWTP Chief Operator shall be responsible for ensuring that the warning is verbally conveyed to employees.\n\nB. WWTP employees upon hearing th"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 2546,
      "SummaryText": "e warning, smelling of a strong, irritating bleach odor or by direction of the WWTP Chief Operator shall proceed in an upwind or crosswind direction, using the closest route, to the hilltop southeast of the WWTP nitrification tower. In the event that this primary assembly area is located downwind of the leaking gas, or is not located remote enough to prevent exposure to the escaping gas; additional evacuation instructions will be provided by the WWTP Chief Operator.\n\nC. No employee shall attempt to leave the premises or move their vehicle until all personnel have been accounted for. All driveway access lanes must be kept open for the emergency vehicles.\n\nD. The WWTP Chief Operator is responsible for getting a written head count. Contractors, vendors or municipal employees on the plant site should be included.\n\nE. The \"All Clear Signal\" will be hand delivered or verbally conveyed to personnel by the WWTP Chief Operator.\n\n10. PLANNED CHANGES: The WWTP will begin utilizing ultraviolet disinfection near the end of the year 2001 thereby eliminating the need for chlorine."
    }
  ]
}