{
  "FacilityID": 25462,
  "FacilityName": "Armory Well",
  "FacilityStr1": "Cynthia Road",
  "FacilityStr2": null,
  "FacilityCity": "Clinton",
  "FacilityState": "MS",
  "FacilityZipCode": "39056",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28049",
  "LEPC": "Hinds County LEPC",
  "FacilityLatDecDegs": "32.358528",
  "FacilityLongDecDegs": "-90.294972",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Clinton",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Clinton",
  "OperatorStr1": "200 West Leake Street",
  "OperatorStr2": "P.O. Box 156",
  "OperatorCity": "Clinton",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39060",
  "OperatorZipCodeExt": "0156",
  "RMPContact": "Robert Ritchey",
  "RMPTitle": "Utilities Manager",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000178381",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-04-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-04-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-04-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-04-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 32.35853,
  "FRS_Long": -90.29497,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-BLOCK FACE",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 36331,
      "AltID": "Water Treatment",
      "FacilityID": 25462,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 37221,
          "ProcessID": 36331,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 47572,
          "ProcessID": 36331,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 547572,
          "ProcessID": 36331,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 25462,
      "SummaryText": "EXECUTIVE SUMMARY OF RISK MANAGEMENT PLAN FOR CLINTON, MISSISSIPPI ARMORY WELL WATER TREATMENT FACILITY\n\nI.  Introduction\n\nThe water treatment facility located near the Clinton National Guard Armory, known as the ?Armory Well,? provides drinking water for some of the inhabitants and businesses located in the city of Clinton, MS.  The city of Clinton has a population of approximately 25,000 people and a number of businesses, schools, industrial facilities, and recreational areas.\n\nII.  Regulated Substance and Covered Process\n\nIn order to comply with Federal and State regulations concerning water treatment, chlorine is used for the disinfection of drinking water.  There is up to 4,000 lbs. of chlorine connected in process at any given time, therefore, the Armory Well Treatment Plant falls into Level II of the EPA?s Risk Management Program Regulations.\n\nIII.  Emergency Response and Policies\n\nThe City of Clinton Department of Public Works is committed to reliably providing quality drinking water that conforms to all local, state, and federal water quality standards to the inhabitants of Clinton, Mississippi with public safety as a top priority.  The City of Clinton Department of Public Works has coordinated emergency response activities with several emergency response agencies including the local fire department, police department, and the Hinds County Emergency Operations Center.\n\nIV.  Worst Case and Alternative Scenarios\n\nAs required by the EPA?s Risk Management Program regulations, the City of Clinton Department of Public Works has calculated off-site consequences for accidental releases of chlorine from the Armory Water Treatment Facility.  The first analysis is the worst-case analysis.  The EPA?s Risk Management Program regulations define the worst case as the entire loss of the maximum inventory of the largest tank or vessel.  The EPA also mandates that the most conservative weather conditions be used to calculate the distance to toxic endpoint.  The City of Clint"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 25462,
      "SummaryText": "on used the EPA-approved program ALOHA to perform the worst-case analysis.  The worst-case release yielded a distance to toxic endpoint of 2.60 miles affecting approximately 14,191 people in the cities of Clinton and Jackson, Mississippi.  Some schools, hospitals, businesses, and parks are affected as well.\n \nThe City of Clinton also performed a more likely alternative scenario for a chlorine release.  This case included a release due to a tubing failure that allowed a gas release through a circular, 5/16? diameter opening.  This scenario yielded and distance to toxic endpoint of 1.90 miles which affected approximately 7,958 persons.\n V.  Accidental Prevention Program\n\nThe facility?s accident prevention program includes each of the elements required by the Risk Management Program regulations.\n\nVI.  Safety Information\n\nThe City of Clinton Department of Public Works has gathered the necessary documentation of safety information on the covered chlorine process including a chlorine material safety data sheet, maximum intended inventory of equipment in which chlorine is stored or processed, safe upper and lower temperatures, pressures, and flowrates in all of the equipment in which chlorine is stored or processed, equipment specifications, and applicable codes and standards used to design, build, and operate the process.\n\nVII.  Hazard Review\n\nA hazard review was conducted on the covered process to identify all hazards and potential hazards associated with the process.  The results of the review were used to determine the appropriate safeguards needed to prevent or mitigate a release.\n\nVIII.  Operating Procedures\n\nWritten operating procedures have been in place at the City of Clinton Department of Public Works for several years.  These procedures address daily and periodic duties of plant operators as well as emergency situations.\n\nIX.  Maintenance Procedures\n\nWritten maintenance procedures have been in place at the City of Clinton Department of Public Works for several y"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 25462,
      "SummaryText": "ears.  Included in these procedures are inspections, a preventative maintenance schedule, and logs for all of these activities.\n\nX.  Five-year Accident History\n\nNo serious accidents have occurred at this facility within the last five years.\n\nXI.  Changes Planned to Improve Safety\n\nThe City of Clinton feels that there are none needed at this time."
    }
  ]
}