{
  "FacilityID": 2548,
  "FacilityName": "Channel Chemical Corporation",
  "FacilityStr1": "14373 Seaway Road",
  "FacilityStr2": null,
  "FacilityCity": "Gulfport",
  "FacilityState": "MS",
  "FacilityZipCode": "39503",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28047",
  "LEPC": "Harrison County LEPC",
  "FacilityLatDecDegs": "30.433889",
  "FacilityLongDecDegs": "-89.0825",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A3",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Thomas H. Reid",
  "OperatorStr1": "PO Box 669",
  "OperatorStr2": null,
  "OperatorCity": "Northport",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49670",
  "OperatorZipCodeExt": null,
  "RMPContact": "TIMOTHY H. REID",
  "RMPTitle": "GENERAL MANAGER",
  "FTE": 9,
  "OtherEPAFacilityID": "MSD122687064",
  "EPAFacilityID": "100000030959",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-06-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-15 00:00:00",
  "ErrorReportDate": "1999-06-15 00:00:00",
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-10 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 30.4343,
  "FRS_Long": -89.08024,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2848,
      "AltID": "Formadehyde",
      "FacilityID": 2548,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2909,
          "ProcessID": 2848,
          "NAICSCode": "32599",
          "_desc": {
            "NAICS_CODE": "32599",
            "NAICS_DESCRIPTION": "All Other Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3043,
          "ProcessID": 2848,
          "ChemicalID": 1,
          "Quantity": 54000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503043,
          "ProcessID": 2848,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2548,
      "SummaryText": "                                            EXECUTIVE SUMMARY\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nIn the course of manufacturing  products, Channel Chemical receives, stores, and handles more than 60 different chemicals. The safety and health of our employees is our number one priority at the plant. Followed closely by the health and safety of our neighbors and the protection of the environment.\n\nTo minimize any risk to people and environment Channel follows state and federal guidelines in the storage and handling of these chemicals. Channel spill prevention policies include plant inspections every working shift,  securing valves on storage vessels, and continual visual monitoring during the transfer of all chemicals. The company also maintains written emergency response plans in the event that there is a spill or accidental release. The plan includes procedures for notification of the local fire authority and notification of any potentially affected neighbors.                                                                                                                                                                                                                                                                                                                                                 \n \nTHE FACILITY AND REGULATED SUBSTANCES HANDLED\nChannel Chemical Corporation is located in the Bernard Bayou Industrial Park in Harrison County, Mississippi. The company is located on an 11-acre parcel of land stretching between Seaway Road and Bernard Bayou. Approximately 3 acres of Channel's land is leased out to a gasoline distribution facility.\n\n Channel Chemical is a toll manufacturer - which means it manufactures products for its customers, but produces no products of its own. The majority of the 25 different chemical products manufactured at the facility are for the oil field and soluble metals industries. In the process of producing these chemi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2548,
      "SummaryText": "cal products the company receives and ships a variety of chemicals in both 55-gallon drums and tank truck loads.\n\nHowever, Channel handles only one chemical that is considered hazardous according to the List of Regulated Toxic Substances of 40CFR part 68.130. This chemical is Formaldehyde Solution. The facility receives a tank truck of Formaldehyde Solution (5,000 gallons) an average of twice a month. Channel stores a maximum of 6,000 gallons of Formaldehyde Solution on site. This is usually split between two different storage tanks which are located in a outside diked tank farm.\n\nFormaldehyde Solution is used in several products that Channel manufactures. It is pumped through pipes from the storage tanks to a flow meter in the reactor area. From the meter to the reactor the formaldehyde solution flows through chemical hoses to a designated reactor. Access to the site is restricted to authorized personnel.\n\n\n\n\nWORST-CASE RELEASE SCENARIO AND ALTERNATIVE REALEASE SCENARIO.\nWorst-Case Scenario: Failure of Channel's large formaldehyde solution storage tank when it is full would release 5,000 gallons (or 45,600 pounds) of formaldehyde solution. The storage tank is at its fullest level immediately after being filled from a delivery of a tank truck of formaldehyde solution.\n\nIn a complete failure of the storage vessel the entire contents of the tank would empty out into a 40x50-foot concrete dike which would limit the surface area of a pool and thus reduce the release rate of the formaldehyde solution vapors.\n\nThe distance to the endpoint (using the RMP*Comp Model) is 0.20 miles.\n\nAlternative Scenario:  A hose failure during the receiving of a tank truck load of formaldehyde solution.  Based on a normal responsive action of the Channel employee and truck driver unloading of the tank truck, approximately 25 gallons of formaldehyde solution would escape from the hose before emergency valve on the truck could be activated to stop the flow from the truck. Since the storage ta"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2548,
      "SummaryText": "nks are loaded through the top only a small amount of formaldehyde solution would back flow from the two-inch pipe leading to the top of the storage tank.\n\nUnless the hose failure occurred at the connection to the truck, the formaldehyde solution released would be contained in a concrete diked area.\n\nIn this Alternative Scenario, the distance to the endpoint (based on RMP*Comp Model)= .1 mile.                      \n\n\n\nTHE GENERAL  ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\nThis manufacturing facility is in compliance with state and federal laws and programs concerning the prevention of chemical spills including  SWPPP, EPA's Accidental Release Prevention Rule, and OSHA's Process Safety Management rules. In addition, operators are well versed in the proper handling and monitoring of Formaldehyde Solution whenever it is used in a manufacturing process.  All of Channel's employees receive regular training in spill prevention and spill clean up. \n\n                                                                                                                                                                                                                                                                                                                                                             \nFIVE-YEAR ACCIDENT HISTORY\nChannel Chemical has had no accidents in the last five years resulting in the accidental release of formaldehyde solution.\n\n\n                                                                                                                                                                             \nEMERGENCY RESPONSE  PROGRAM\nChannel's Emergency Response Program is based on taking all actions necessary to reduce the threat of exposure to its employees, surrounding neighbors and to the environment. Included in these efforts:\n--Annual updates to local fire department that includes an updated list of chemicals stored on Channel"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2548,
      "SummaryText": "'s site, an updated map of where the chemicals are stored, and a copy of any MSDS's for new chemicals stored on site.\n--Channel also tries to take all the local fire department personnel on tour of the plant whenever practical for the fire department. This allows the department personnel to become familiar with the plant layout and ask questions about the plant and chemicals stored here.  And it also allows Channel to get feedback from the fire department on improvements it might make to make the plant site safer or more accessible to emergency personnel\n--Channel employees go through regular safety training and emergency policies and procedures.  Personnel also go through drills including what to do when an employee is injured and when/how to evacuate the plant in an emergency.\n\n                                                                                                                                                                                                                                                                                                                                                               \nPLANNED CHANGES TO IMPROVE SAFETY\nChannel plans to increase the training time for each employee adding special emphasis on on-site demonstrations and practice drills.\nThe company will also update its emergency alarm system to ensure that the alarm can be at all times to all corners of the plant."
    }
  ]
}