{
  "FacilityID": 25669,
  "FacilityName": "Conectiv - Hay Road Power Complex",
  "FacilityStr1": "198 Hay Road Gate B",
  "FacilityStr2": null,
  "FacilityCity": "Wilmington",
  "FacilityState": "DE",
  "FacilityZipCode": "19809",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "10003",
  "LEPC": "New Castle LEPC",
  "FacilityLatDecDegs": "39.738611",
  "FacilityLongDecDegs": "75.503889",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.conectiv.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Conectiv Delmarva Generation",
  "Company2Name": "Conectiv",
  "CompanyDUNS": 6918882,
  "Company2DUNS": 6918882,
  "OperatorName": "Conectiv Delmarva Generation",
  "OperatorStr1": "198 Hay Road Gate B",
  "OperatorStr2": null,
  "OperatorCity": "Wilmington",
  "OperatorStateFIPS": "DE",
  "OperatorZipCode": "19809",
  "OperatorZipCodeExt": null,
  "FTE": 45,
  "OtherEPAFacilityID": "DER000500173",
  "EPAFacilityID": "100000178639",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "1000300388",
  "SafetyInspectionDate": "1994-08-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-05-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-05-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-05-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-05-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 36620,
      "AltID": "Anhydrous Ammonia System",
      "FacilityID": 25669,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 47915,
          "ProcessID": 36620,
          "ChemicalID": 56,
          "Quantity": 56000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 37517,
          "ProcessID": 36620,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 20522,
              "Process_NAICS_ID": 37517,
              "SafetyReviewDate": "2002-03-01 00:00:00",
              "PHA_Date": "2001-11-06 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-04-02 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "new system - initial PHA",
              "OpProceduresReviewDate": "2002-04-02 00:00:00",
              "TrainingReviewDate": "2002-04-11 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-05-01 00:00:00",
              "EquipmentInspectionDate": "2002-05-01 00:00:00",
              "EquipmentTested": "new system - all equipment",
              "ChangeMgmtDate": "2002-04-25 00:00:00",
              "ChangeMgmtReviewDate": "2002-04-25 00:00:00",
              "PreStartupReviewDate": "2002-04-15 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2002-01-02 00:00:00",
              "HotWorkPermitReviewDate": "2002-01-02 00:00:00",
              "ContractorSafetyReviewDate": "2002-01-02 00:00:00",
              "ContractorSafetyEvalDate": "2002-01-02 00:00:00",
              "CBI_Flag": 0,
              "Description": "Anhydrous Ammonia System",
              "_chemicals": [
                {
                  "PrimaryKey": 29924,
                  "PreventionProgram3ID": 20522,
                  "ProcessChemicalID": 47915
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 25669,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2002-05-01 00:00:00",
    "ERTrainingDate": "2002-04-11 00:00:00",
    "CoordinatingAgencyName": "LEPC of New Castle County",
    "CoordinatingAgencyPhone": "3027611751",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 25669,
      "SummaryText": "RISK MANAGEMENT PLAN\nCONECTIV HAY ROAD POWER COMPLEX\nWILMINGTON, NEW CASTLE COUNTY, DELAWARE\n\n1. Executive Summary \n\nThe Conectiv - Hay Road Power Complex (Conectiv) is committed to operating in a manner that is safe for Conectiv workers, the public, and the environment. As a demonstration of that commitment, Conectiv has developed and implemented Environmental and Workplace Health and Safety Policies to serve as guiding principles for all it's employees and operations.  Conectiv believes that following these policies is the responsibility of every employee. \n\nAs part of this commitment, Conectiv has established a system to help ensure safe operation of the processes at this facility.  One component of this system is a Risk Management Program (RMP) that helps manage the risks at Conectiv and that complies with the requirements of the Environmental Protection Agency's (EPA's) regulation 40 CFR part 68, \"Accidental Release Prevention Requirements: Risk Management Programs\" (the RMP rule) and Delaware's Accidental Release Prevention Regulation.  One of the requirements of the RMP rule is to submit a risk management plan (RMP Plan) describing the risk management program at Conectiv.  This document is intended to satisfy the RMP Plan requirement of the RMP rule and to provide the public with a description of the risk management program at Conectiv.\n\nThe risk management program at Conectiv consists of three elements:\n\n1. A hazard assessment to help understand the potential offsite consequences of hypothetical accidental releases and a history of accidents that have occurred during the last five years associated with the use of substances regulated by the RMP rule (regulated substances) - see topics 1.3 and 1.5\n2. A prevention program to help maintain and safely operate the processes containing more than a threshold quantity of a regulated substance (covered processes) - see topic 1.4\n3. An emergency response program to help respond to accidental releases of regulated subs"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 25669,
      "SummaryText": "tances from covered processes - see topic 1.6\n\nInformation further describing these elements is provided in this RMP Plan.\n\nAlthough the risk management program at Conectiv helps provide assurance that the facility is maintained and operated in a safe manner, it is only one component of the safety program at Conectiv.  In fact, Conectiv has a comprehensive safety program in place establishing various levels of safeguards against release of a hazardous substance and injuries/damage from a release of a hazardous substance.\n\nConectiv limits the use of hazardous substances.  Before using a hazardous substance at Conectiv, less hazardous alternatives are considered. Part of Conectiv's RMP compliance philosophy has been the reduction of the use of hazardous substances covered under this regulation. When a hazardous substance is used, Conectiv considers the potential for this substance to adversely affect Conectiv workers, the public, and the environment and takes steps to prevent any such effects.\n\nConectiv works to prevent releases of the hazardous substances used at the facility.  When a hazardous substance is used at Conectiv, the equipment is designed, built, operated, and maintained to reduce the likelihood of an accidental release.  Industry and government standards are adhered to in the design, construction, operation, and maintenance of the equipment.\n\nConectiv limits damage from a release, if such a release were to occur.  Conectiv trains workers to react quickly in the event of an accidental release, reducing the consequences of a release were to occur.  In addition, Conectiv works with the local fire department and with the local emergency planning committee (LEPC) to help ensure that injuries and/or environmental damage will be minimized if a release does occur.\n\nThe safety program at Conectiv consists of a number of elements, only some of which are required by the RMP rule.  This RMP Plan is primarily intended to describe those parts of the safety program at "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 25669,
      "SummaryText": "Conectiv that are required by the RMP rule.\n\n\n1.1 Accidental Release Prevention and Emergency Response Policies\n\nConectiv is committed to the safety of workers and the public, and the preservation of the environment, through the prevention of accidental releases of hazardous substances.  Conectiv implements reasonable controls to prevent foreseeable releases of hazardous substances.  These controls include training programs for personnel; programs to help ensure safety in the design, installation, operation, and maintenance of processes at Conectiv; and programs to evaluate the hazards at Conectiv.\n\nIn order to effectively implement these policies, Conectiv established a management system headed by the Power Complex's Operations Manager to oversee safety-related activities.\n\n\n1.2 Conectiv and Regulated Substances\n\nThe Hay Road Power Complex is a power generation facility designed to supply power during high electrical demand periods.  In order to support these operations, Conectiv handles regulated substances (Anhydrous Ammonia) in sufficient quantities to be covered by the RMP rule, as shown below.\n\n\nProcess                     Program              Regulated                      Maximum       Largest\n                                  Level                   Substance                     Process        Single\n                                                                                                    Quantity        Vessel\n\nAnhydrous Ammonia          3                Anhydrous Ammonia     56,000 lbs     56,000 lbs\n\n\n1.3 Offsite Consequence Analysis\n\nConectiv performed an analysis of the potential offsite consequence for an accidental release of a regulated substance that could have on the public or the environment. The RMP regulations require that such an analysis include an evaluation of both worst-case release scenarios and alternative release scenarios.  Conectiv does not expect a worst-case release scenario to ever occur. However in accordance with the RM"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 25669,
      "SummaryText": "P requirements, a worst case release analysis was conducted and the results are reported in this document. \n\nThe alternative release scenarios evaluated are intended to represent releases that might occur. The alternative release scenarios were selected to help the local emergency planning committee (LEPC) improve community emergency response plans.  An alternative release scenario represents a release that (1) might occur at a facility like Conectiv's and (2) would result in the greatest potential offsite consequences if the release occurred.  While Conectiv believes that such releases are unlikely to occur at the Hay Road facility, Conectiv has evaluated the offsite impact of the releases in accordance with the regulatory requirements.\n\nConectiv has conducted the offsite consequence analysis for the worst-case release scenario using the EPA's guidance document and RMP*Comp that was developed to provide the highest estimate of the possible offsite consequences of such a release. The main objective of performing the offsite consequence analysis is to determine the distance at which certain effects might occur to the public because of an accidental release (called the endpoint distance).  The model was developed to provide information on the estimated distance to the toxic endpoint for a chemical of concern.\n\nWhile the model provides the required data to meet regulatory requirements, it does not provide detailed information on the travel time or concentration of the chemical in the plume.  Typical information input to the model to characterize a chemical release are:\n\n* Physical State:  gas, liquid, aerosol, and multi-phased\n* Release Type:  continuous, instantaneous, point (stack releases), and area (releases from a pool)\n* Release Condition:  height, substrate type (concrete, soil), area and height of curbing, exit velocity, release diameter, and exit temperature\n* Chemical Properties:  molecular weight, specific gravity, vapor pressure, density, latent heat, and o"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 25669,
      "SummaryText": "ther properties depending upon the model\n\nIn addition to the physical parameters that characterize a release, meteorological data are needed by the model to characterize the ambient release conditions.  Meteorological data are used in dispersion models to calculate the distance that the pollutant plume moves downwind and the concentration of the pollutant at any given time or distance.  The meteorological variables that affect the dispersion of a chemical release are as follows:\n\n* Wind Speed and Direction: The wind speed is used to determine the plume dilution, plume transport, plume rise, evaporation rate, and magnitude of the concentration.  Wind direction defines the direction in which the plume travels.\n* Temperature:  Temperature is used to calculate plume rise and evaporation rates.\n* Atmospheric Pressure: is used to calculate gas and liquid release rates.\n* Atmospheric Stability: Stability is an indication of atmospheric turbulence.  The turbulence is depended upon thermal (heating of the ground) and mechanical (surface roughness and wind speed) effects.  Turbulence also acts to dilute the plume and reduce down wind concentrations.  \n\nFor the RMP modeling performed the following meteorological parameters were used for the two scenarios:\n\nworst case release scenario:\n\n* Wind Speed:  1.5 meters/second\n* Stability:    F\n* Temperature:  77 deg. F.\n* Land use:    Urban\n\nalternate release scenario:\n\n* Wind Speed:  3.0 meters/second\n* Stability:    D\n* Temperature:  77 deg. F.\n* Land use:     Urban\n\nThe main objective of performing the offsite consequence analysis is to determine the distance at which certain potential effects might occur to the public because of an accidental release (called the endpoint distance).  The following potential effects could occur at the endpoint distance.  At distances less than the endpoint distance, the effects would be greater; at distances greater than the endpoint distance, the potential effects would be less.  When considering t"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 25669,
      "SummaryText": "he release of a toxic substance, such as Anhydrous Ammonia, most people at the endpoint distance could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms that could impair an individual's ability to take protective action.  The recommended response to a release is to shelter-in-place and to shut off any air intakes (e.g., air conditioners or fresh air make-up systems).\n\nThe RMP rule includes specific requirements for the worst-case and alternative release scenarios that must be reported by Conectiv.  These requirements are:\n\n* One worst-case release scenario for each Program 1 process (the Hay Road Power Complex does not have any processes meeting the Program 1 definition)\n* One worst-case release scenario for the class of toxic substances in Program 3 processes (i.e., one scenario representing the Anhydrous Ammonia process)  \n* One alternative release scenario for each of the toxic substances in a Program 3 process (i.e. one scenario representing the Anhydrous Ammonia process)\n* One worst-case and one alternative release scenario for the class of flammable substances in Program 2 and Program 3 processes (the Hay Road Power Complex does not have any process chemicals meeting the flammable substance definition)\n\nThe following information summarizes the offsite consequence analysis performed by Conectiv. \n\n1.3.1 Program 3 Processes - Toxic Substances\n\nThe worst-case release scenario for toxic substances is the instantaneous release of the entire contents of a 12,000 gal (56,000 pound at the maximum fill capacity of 85% or 10,200 gal)) Anhydrous Ammonia storage tank in the Anhydrous Ammonia System. The solution evaporates and forms a vapor cloud. The Anhydrous Ammonia would be released to atmosphere over a 10-minute period. The scenario results in off-site impacts to both public and environmental receptors. \n\nThe alternative release scenario for the Anhydrous Ammonia System is a 3-inch hole in the s"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 25669,
      "SummaryText": "torage tank.  Operators would be notified of a release by Ammonia monitors located around the tank and throughout the process area.  The containment area would limit the extent of spread of the liquid Ammonia and the water spray system would limit the vaporization of Ammonia. Conservatively, 56,000 pounds of Ammonia would be released from the time the incident began until it would all vaporize or be captured by the water spray system in an aqueous solution.  The scenario results in off-site impacts to both public and environmental receptors.  The water spray system will become operational contemporaneously with the receipt of ammonia.\n\n\n1.4 Accidental Release Prevention Program and Chemical-specific Prevention \n\nThe Hay Road Power Complex has always focused on ways to prevent accidental releases of hazardous substances.  In 1996, the EPA RMP rule established Program 2 and Program 3 prevention requirements, Conectiv has implemented the Program 3 prevention requirements, which are as follows:\n\nProgram 3  - essentially the same as OSHA PSM, except that the program also focuses on protecting the public and the environment.  Program 3 requires 12 of the 14 elements of the OSHA PSM regulation, and is the most rigorous prevention program. It has been established for the Anhydrous Ammonia System.  The following sections briefly describe the elements of Conectiv's prevention program that address the EPA RMP rule prevention program requirements. \n\n1.4.1  Program 3 Prevention Program\n\nThe Hay Road Power Complex Program 3 prevention program, which applies to the Anhydrous Ammonia System, consists of the following 12 elements:\n\n1.  Process Safety Information: Conectiv maintains a variety of technical documents that are used to help ensure safe operation of the covered process.  These documents address (1) physical properties of hazardous substances handled in the process, (2) operating parameters of the equipment/process (including standard operating procedures (SOPs)) and (3) d"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 25669,
      "SummaryText": "esign basis and configuration of process equipment.  \n\nMaterial safety data sheets (MSDSs) document the properties of hazardous substances handled at Conectiv, including regulated substances in the covered process.  Information on the technology and engineering design of the covered process includes the operating parameters and the design basis and configuration of the process equipment.\n\nMany of the operating parameters are included in the operating procedures to help with the safe operation of the process.  These documents are used (1) to train employees, (2) to perform process hazards analyses, and (3) to help maintain the equipment.\n\n\n2.  Process Hazard Analysis:  The Hay Road Power Complex performs and periodically updates process hazard analyses (PHAs) for the covered process to help identify process hazards and generate recommendations that might improve the safe operation of the process.  A team composed of personnel with engineering, process operating experience, maintenance, and a leader with process hazard analyses experience is assembled to analyze the hazards of the process.  Conectiv primarily uses the hazard and operability (HAZOP) technique, supplemented with checklists, to perform this analysis.  The PHA team prepares a written report describing the results of the analysis, including a list of recommendations.  Responsibility to resolve the recommendations is assigned to area personnel and, when appropriate, changes to enhance the safety of the process are implemented.\n\n\n3.  Operating Procedures: Conectiv operators, process engineers and supervisors work together to develop and maintain operating procedures to define how tasks related to process operations should be safely performed.  The operating procedures (1) are used to train employees and (2) serve as reference guides for appropriate actions to take during both normal operations and emergency operations.\n\nConectiv personnel develop and maintain operating procedures that cover all phases of ope"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 25669,
      "SummaryText": "rations, including initial startup, normal operations, normal shutdown, emergency shutdown, startup following a turnaround or emergency shutdown, and temporary operations.  The operating procedures are used both to help in operating the covered processes and as a training guide for both new and experienced operators.  Operating procedures are updated at least annually to ensure they reflect current operating conditions.\n\n\n4.  Training: The Power Complex trains workers to perform their assigned tasks safely and effectively. The Conectiv training program includes both initial and refresher training that covers (1) a general overview of the process, (2) the properties and hazards of the substances in the process, and (3) a detailed review of the process operating procedures and safe work practices.  Oral reviews and on-the-job training are used to verify that an employee understands the process operation prior to job assignment.\n\nThe operators are consulted annually during operating procedure reviews to evaluate the effectiveness and need for additional training.  Recommendations from the operators are reviewed, and changes to the training program are implemented, as appropriate.\n\n5.  Mechanical Integrity:  Conectiv maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  This is accomplished by: (1) an inspection and testing program to help identify equipment deterioration and damage before the equipment fails, (2) a quality assurance program to help ensure that new and replacement equipment meet the design standards required for service in the covered processes and (3) utilizing personnel who are specially trained to maintain process equipment.  \n\n6.  Management of Change:  The Conectiv management of change program evaluates and approves all proposed changes to chemicals, equipment, and procedures for a covered process to help ensure that the change does not negatively aff"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 25669,
      "SummaryText": "ect safe operations. Process changes that are determined to be a replacement in kind (e.g., replacing a valve with an identical valve) are allowed without completing a management of change form.  All other changes must be reviewed through the full management of change program, to help ensure that inadvertent consequences of process changes are prevented, safety consequences of changes are addressed, affected process safety information and procedures are updated, and affected employees are notified of the changes.\n\n7.  Pre-startup Review:  Conectiv performs a safety review of a new or modified process before the process is placed into service to help ensure that the process is safe to operate.  This review confirms that an employee has completed the requisite training.  The review also confirms that adequate safety, operating, maintenance, and emergency procedures are in place and that construction and equipment are in accordance with design specifications.  A pre-startup review checklist is completed to document the review and to ensure that appropriate issues have been addressed.\n\n8.  Compliance Audit:   Conectiv will audit the covered process to be certain that the Conectiv prevention program is effectively addressing the safety issues for the covered process.  Conectiv will assemble an audit team that includes personnel knowledgeable in the RMP rule and in the process. This team will evaluate whether the prevention program satisfies the requirements of the RMP rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit will be documented, recommendations  will be resolved, and appropriate improvements to the prevention program will be implemented.\n\n9.  Incident Investigation:   Conectiv investigates all incidents that resulted in, or could reasonably have resulted in, a serious injury to personnel, the public, or the environment so that similar incidents can be prevented.  Conectiv trains employees"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 25669,
      "SummaryText": " to identify and report any incident requiring investigation.  An investigation team is assembled, and the investigation is initiated within 48 hours of the incident. The results of the investigation are documented, recommendations are resolved, and appropriate process improvements are implemented.\n\n10.  Employee Participation:  The Hay Road Power Complex developed an employee participation program for covered processes to help ensure that Conectiv workers participate in the development and continuous improvement of these prevention program elements. Employees are consulted on and informed about various aspects of the RMP rule prevention program through the training program.  Topics include the PHAs and operating procedures; as well as access to any support information for the covered processes. \n\n11.  Hot Work Permits:  Conectiv uses a hot work permit program to control spark- or flame-producing activities that could result in fires or explosions at the Hay Road Power Complex. Conectiv reviewed OSHA's fire prevention and protection requirements in 29 CFR 1910.252(a) and created a Hot Work Permit Form to comply with these requirements.  Personnel performing hot work are required to have an approved permit prior to beginning their work.  Training in the use of the Hot Work Permit Form is included in the Conectiv safe work practices orientation.\n\n12.  Contractors:  Conectiv has established Contractor Safety and Health Guidelines to outline expectations related to contractor work at the Hay Road Power Complex including work on the covered process.  The program reviews the safety record of all contractors to help ensure that Conectiv only hires contractors who can safely perform the desired job tasks.  Conectiv explains to the contract supervisors the hazards of the process on which they and their employees will work, Conectiv safe work practices, and Conectiv emergency response procedures.  Conectiv requires that the contractor supervisors also train each of their empl"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 25669,
      "SummaryText": "oyees prior to beginning their work on a covered process.  Conectiv periodically reviews contractors' training documents and work performance to help ensure that safe practices are followed. \n\n\n1.4.2  Program 2 Prevention Program\n\nThe Hay Road Power Complex has no processes that qualify for the Program 2 Prevention Program.\n\n1.4.3 Chemical-specific Prevention Steps\n\nIn addition to the required prevention program elements, Conectiv has implemented safety features specific to the hazardous substances used at the Hay Road Power Complex.  The Anhydrous Ammonia System has been designed to only handle Anhydrous Ammonia.  Conectiv compared potential use of both Anhydrous and Aqueous Ammonia and determined that Anhydrous Ammonia was more appropriate to minimize the potential for serious incident or off-site impact due to the following:\n\n* decrease in the number of deliveries to the site; therefore less trucks traffic;\n* decrease in the number of delivery truck hook-ups and disconnects which historically has been when the majority of all potential  Ammonia releases occur; \n* decrease in the number of failure points (i.e., valves, pumps, flanges, etc.); and \n* decrease in the likelihood of corrosion to the system due to the nature of Anhydrous Ammonia.\n\nIn order to ensure the integrity of the syste, the process is located almost entirely within the containment area, which further reduces the hazard.  The storage tank is engineered specifically for Anhydrous Ammonia service.  The piping is double-contained, wrapped with corrosion protection tape, cathodically protected, and the interstitial space is charge with nitrogen and monitored.  The process uses an advanced control system with emergency shutdowns to ensure safe operation.   Detectors and alarms located around the tank, injection skids, and Heat Recovery Steam Generator provide continuous monitoring for Ammonia in the event of a release, providing early detection and helping to ensure quick response if an incident were t"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 25669,
      "SummaryText": "o occur.\n\n\n1.5 Five-Year Accident History\n\nConectiv is required to complete a review of the covered process for incidents occurring in the five-year period prior to the submittal date for the regulation.  Since the system is new, there have been no incidents involving the regulated processes that have resulted in on-site or off-site impacts.  \n\n\n1.6 Emergency Response Programs\n\nConectiv has established a written emergency response program to help safely respond to accidental releases of hazardous substances.  Conectiv does not have \"First Responder\" capabilities.  Conectiv's response will be to notify the LEPC and other off-site emergency response personnel in the event of serious incident or off-site impact.  The emergency response plan includes procedures for:\n\n* informing the LEPC about accidental releases that could reasonably result in offsite consequences.\n* clear identification of communication, roles and responsibilities during an emergency event.\n* reviewing and updating the emergency response plan.\n \nAll Conectiv personnel are trained in Shelter-in-place and evacuation procedures.  Conectiv periodically coordinates emergency response drills.  The written emergency response plan complies with other federal contingency plan regulations (e.g., the OSHA regulations 29 CFR 1910.38(a), 29 CFR 1910.120(a)) and has been communicated to local emergency response officials and local fire departments.  Conectiv maintains a regular dialogue with the local fire officials and provides response information, as appropriate. \n\n\n1.7 Planned Changes to Improve Safety\n\nThe Hay Road Power Complex constantly strives to improve the safety of the regulated processes by following recommended safe practices, soliciting safety suggestions from employees, conducting hazard analysis studies and investigating process incidents.  The original HAZOP study provided design changes that are being incorporated into the final system design and construction.  Conectiv will continue to review an"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 25669,
      "SummaryText": "d improve the safety of the Anhydrous Ammonia System."
    }
  ]
}