{
  "FacilityID": 2567,
  "FacilityName": "City of Van Buren Main Plant",
  "FacilityStr1": "1401 Port Road",
  "FacilityStr2": null,
  "FacilityCity": "Van Buren",
  "FacilityState": "AR",
  "FacilityZipCode": "72956",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05033",
  "LEPC": "Crawford County LEPC",
  "FacilityLatDecDegs": "35.424444",
  "FacilityLongDecDegs": "-94.334444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "L1",
  "LatLongDescription": "LW",
  "FacilityURL": null,
  "FacilityEmailAddress": "vbfred@aol.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "N/A",
  "Company2Name": "N/A",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Van Buren Municipal Utilities",
  "OperatorStr1": "409 Main Street",
  "OperatorStr2": "P.O. Drawer 1269",
  "OperatorCity": "Van Buren",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72957",
  "OperatorZipCodeExt": "1269",
  "RMPContact": "Harry Short",
  "RMPTitle": "Manager/Superintendent",
  "FTE": 3,
  "OtherEPAFacilityID": "AR0021482",
  "EPAFacilityID": "100000031182",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-03-19 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-05-20 00:00:00",
  "DeRegistrationEffectiveDate": "2009-05-07 00:00:00",
  "AnniversaryDate": "2004-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 35.42444,
  "FRS_Long": -94.33444,
  "FRS_Description": "LIQUID WASTE TREATMENT UNIT",
  "FRS_Method": "LORAN C",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2867,
      "AltID": "1",
      "FacilityID": 2567,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2928,
          "ProcessID": 2867,
          "NAICSCode": "92411",
          "_desc": {
            "NAICS_CODE": "92411",
            "NAICS_DESCRIPTION": "Administration of Air and Water Resource and Solid Waste Management Programs"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3063,
          "ProcessID": 2867,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503063,
          "ProcessID": 2867,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2567,
      "SummaryText": "The Van Buren Municipal Utilities operates three wastewater treatment plants.  The three plants are described and named as being the South Plant, the North Plant, and the Bekaert Plant.  Each of these wastewater treatment plants utilizes gaseous chlorine for the purpose of disinfection of a treated effluent. Only the South Plant inventories chlorine in sufficient quanitities to be regulated under the program rule of part 68 of CFR 68.130.  The Van Buren Main Plant's chlorinating system is located on site at the plant located on the Arkansas River south of I-540 and west of Arkansas Highway 59.  The chlorinating system is housed in a masonary and concrete structure and provisions are made for the storage of three (3) 2000-pound chlorine containers.  Two containers are ordered when withdrawal is begun from the last of the three containers such that it is possible to have two full, 2000-pound chlorine containers and one partially filled container on site at any given time.  The structure housing the chlorine is not gas tight and should be considered to be weather housing only with the potential of being exposed to the atmosphere.  The accidental release prevention program is based on education of staff relative to hazards and emergency response procedures.  The utility has a training program and written maintenance procedures for the chlorinating system at the South Plant.  All procedures are documented with written records and checklists.  Policies regarding operation and incident investigations are established and supported by the Utility management.  By policy, the responsibility for the implementation of the emergency response plan is that of the Van Buren Municipal Utility Department and the Management of that Department.  The response is based on the ranking Department employee on the site coordinating assessment of the event, emergency repair, and emergency notification of affected persons and agencies.  The worst case scenario for accidental release of chlorine"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2567,
      "SummaryText": " from this site is based on the rupture of a 2000-pound chlorine container during delivery or locating the container within the housing structure.  The worst case would occur if the rupture were realized outside the housing.  The structure is located on an embankment with the Arkansas River being to the West and a flood protection levee to the East.  Prevailing winds are from the West to East.  While the River and the flood protection levee yield some mitigation of the travel of released chlorine; the setting is considered to be rural with few natural or man made obstacles to gaseous chlorine.  The worst case scenario has assumed no mitigation devices to restrict release and a rural setting exists that realizes an influenced distance to damaging endpoint concentrations of three miles.  Under a worst case scenario, the efforts toward emergency response notification will be for a distance of three miles.  The alternative scenario considered as being most likely would occur with the blow out of chlorine feed device with a maximum orifice or hole into the container having a diameter of one-inch.  The alternative scenario would have the mitigating effects of being housed inside a structure although the structure is considered to be exposed to the atmosphere.  The accidental release of chlorine through an orifice will slow the rate of discharge, as will the effects of the housing.  The influenced distance to endpoint concentrations is 0.40 miles.  This distance does not consider the potential mitigation offered by earthen levee formed containment east of the site.  The Emergency Response Program for an accidental release consists of the designation of emergency assembly areas for plant employees; the assessment of the nature and extent of the release; the notification of potentially affected persons and agencies; the dissemation of information to news media; and the implementation of sheltering and/or evacuation of persons within the area potentially affected by the relea"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2567,
      "SummaryText": "se.  The accidental release program includes a check list of activities to accomplish in the event of an accidental release.  The Van Buren Municipal Utilities has had no accidental releases of chlorine from the South Plant site in the past five years as of the date of this summary."
    }
  ]
}