{
  "FacilityID": 25754,
  "FacilityName": "Nestle Ice Cream Company, LLC",
  "FacilityStr1": "970 Continental Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Tulare",
  "FacilityState": "CA",
  "FacilityZipCode": "93274",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": "Tulare Co Env Health Services",
  "FacilityLatDecDegs": "36.1875",
  "FacilityLongDecDegs": "-119.336111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 115083131,
  "ParentCompanyName": "Nestle Ice Cream Company, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Nestle Ice Cream Company, LLC",
  "OperatorStr1": "970 Continental Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Tulare",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93274",
  "OperatorZipCodeExt": null,
  "RMPContact": "Eric Borges",
  "RMPTitle": "Plant Engineering Manager",
  "FTE": 330,
  "OtherEPAFacilityID": "CAD982041485",
  "EPAFacilityID": "100000020611",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-23 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Corrected Copy -Nestle Ice Cream - 5/1/02",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-05-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-05-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-05-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 36.18574,
  "FRS_Long": -119.33224,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 36783,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 25754,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 37685,
          "ProcessID": 36783,
          "NAICSCode": "31152",
          "_desc": {
            "NAICS_CODE": "31152",
            "NAICS_DESCRIPTION": "Ice Cream and Frozen Dessert Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 48115,
          "ProcessID": 36783,
          "ChemicalID": 56,
          "Quantity": 86000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 548115,
          "ProcessID": 36783,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 25754,
      "SummaryText": "Executive Summary\n(This facility was previously owned and operated by Ice Cream Partners which was previously a joint venture between Nestle USA and The Pillsbury Co. The company is solely owned by Nestle USA as of  January 2002 and is operating under the name of Nestle Ice Cream Company, LLC.)\n\n\nThe Risk Management Program (RMP) includes an Executive Summary as required by 40CFR 68.155. This Executive Summary includes a discussion of the various Risk Management Program elements as follows:\n\n1. Accidental release prevention and emergency response policies\n2. Stationary source activities\n3. Regulated substances handled\n4. Worst-case and alternative release scenarios\n5. General and chemical-specific accidental release prevention program\n6. Five-year accident history\n7. Emergency response program\n8. Planned changes to improve safety\n9. Summary\n\n\n1.  Accidental Release Prevention and Emergency Response Policies\n\nIt is Ice Cream Partners' policy to comply with all of the requirements of the EPA's Accidental Release Prevention Program regulation as well as all other applicable Federal and State rules and regulations. The Tulare Plant has developed an OSHA Process Safety Management (PSM) Manual  that documents safety and risk management policies pertaining to the prevention of accidental releases and emergency response. In addition to the PSM Manual, the Tulare Plant has developed a Risk Management Program that includes the OSHA PSM elements, a description of the risk management system, the Offsite Consequence Analysis (OCA), and the five-year accident history. \n\n\n2.  Stationary Source Activities\n\nThe Tulare Plant is located in Tulare County, California. The facility produces ice cream products. The products are frozen, packaged and stored in a frozen goods warehouse prior to shipment. Ammonia is used to provide refrigeration for freezing and for frozen finished goods storage. \n\n\n3.  Regulated Substances Handled\n\nThe ammonia for the refrigeration system at the Tulare Plant"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 25754,
      "SummaryText": " is a regulated substance under the EPA's Risk Management Program rule. The ammonia system is a closed loop which recirculates and reuses the same material. Infrequent makeup to the system is only to replace material lost due to maintenance activities and a small intermittent purge. The system consists of compressors, receivers, evaporators and condensers and has a maximum intended inventory of 86,000 pounds of ammonia.\n\n\n\n4.  Worst-Case and Alternative Release Scenarios\n\n\nFor the worst case and alternative release scenarios, the EPA Model Risk Management Program and Plan for Ammonia Refrigeration (May 1996), the International Institute of Ammonia Refrigeration (IIAR) Risk Management Guidelines for Ammonia Refrigeration (1998) and the EPA Risk Management Program Guidance for Ammonia Refrigeration (November 1998) were used for guidance. The Ammonia Guidance tables were used to derive the hazard distances for worst-case and alternative release scenarios. \n\nReleasing the contents of  the High Pressure Receiver which can contain up to 70,000 pounds (87.5% at 62F) of ammonia represents the worst-case scenario. The resulting distance to the endpoint extends offsite, and public receptors are within the distance to the endpoint. The alternative release scenario was chosen as a quarter-inch hole, which would be representative of a pump seal leak or a gasket rupture. The resulting distance to the endpoint also extends offsite, and public receptors immediately adjacent to the facility are within the distance to the endpoint.\n \n\nDiscussion\nThe results included in this analysis indicate that the worst-case release for the ammonia process can extend offsite and reach public receptors. However, it is important to emphasize that a worst-case release is extremely unlikely to occur because of the many safety features inherent in the design and operational systems for the plant. \n\nOn the other hand, the alternative release scenario is based on credible assumptions. The alternative sce"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 25754,
      "SummaryText": "nario was selected from a number of possible scenarios, based on their potential to reach offsite. As mentioned in the Ammonia Model RMP, this scenario would be representative of a gasket leak or a pump seal leak.\n\n\n5.  Prevention Programs\n\n\nFor the Tulare Plant ammonia system, ICP followed the ANSI/IIAR 2-1992 Standard for Equipment, Design, and Installation of Ammonia Mechanical Refrigeration Systems and implemented an RMP Program 3 Prevention Program which is equivalent to the OSHA Process Safety Management (PSM) program. This is one of the most important ways for preventing ammonia releases and for minimizing the impacts of any release that does occur. Some of the key elements of the Prevention Program are summarized below. \n\nProcess Safety Information(PSI) - A comprehensive set of process safety information has been compiled for the ammonia system. The PSI includes data on the chemicals, the equipment and the technology of the process.\n\nProcess Hazards Analysis (PHA)- An initial PHA was conducted to satisfy the PSM requirements in 1994 and revalidated in 1999. Recommendations were made by the PHA team to improve the safety of the systems are being addressed.\n\nOperating Procedures - An Operations and Maintenance Manual provides detailed written operating procedures for the ammonia system and for safe work practices. \n\nTraining - Training is provided to each operator and maintenance person before they are certified to operate the system. \n\nMaintenance - All of the covered ammonia equipment is included in the Tulare preventive maintenance program. Equipment inspections, testing and preventive maintenance activities are performed following a structured schedule according to IIAR Bulletin 109.\n\nManagement of Change (MOC) - An MOC procedure has been developed and is implemented for all changes made to the ammonia system, including the safety systems. \n\nPre-startup Review (PSR)- Pre-startup reviews are conducted whenever a change results in a change to the PSI. Checkl"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 25754,
      "SummaryText": "ists are used to direct the PSR process. The checklists are used to ensure that all essential elements of the prevention program (i.e., engineered systems and documentation) were in place prior to startup. \n\nCompliance Audits - Compliance audits have been conducted, the latest in 1998. Findings from the audit are being addressed.\n\nIncident Investigation - Ice Cream Partners routinely investigates any ammonia related incident or accident that occurs at the Tulare Plant. An Incident Investigation procedure has been developed to help the investigation team determine the root cause of an incident and to help them develop measures to prevent recurrence. \n\nEmployee Participation - An employee participation program (for safety and risk management) is in place and training in PSM has  been conducted for all affected employees. Employee involvement in PHA studies and review of operating procedures is an important way in which employees take and retain ownership of the risk management programs. \n\nHot Work Permit Program - A hot work permit program is being used at the Tulare Plant whenever hot work is conducted in and around the ammonia systems. \n\nContractor Safety - Contractor safety procedures have been developed and implemented.\n\n\n6.  Five-Year Accident History\n\nIn the last five years there have been no releases of ammonia from the Tulare Plant that meet the RMP reporting criteria. \n\n\n7.  Emergency Response Program\n\nThe Tulare Plant has an emergency response program, which is described, in the site Emergency Response Plan (ERP). This plan includes procedures for evacuations, notifying response agencies and adjacent businesses, emergency equipment list with maintenance schedule, and procedures for responding to any release that may occur. The plan also includes first aid procedures for toxic exposures to ammonia. The ERP is coordinated with the Tulare Fire Department and theTulare County Environmental Health Services. \n\nThe facility has conducted risk management plan commun"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 25754,
      "SummaryText": "ication meetings with employees and has notified immediate offsite receptors. A public communications meeting was held on May 4, 1999 in cooperation with the Tulare Fire Department and the Tulare County Environmental Health Services. \n\n8.  Planned Changes to Improve Safety \n\nAll recommendations from previous PHAs, MOCs, and PSRs are being addressed. However, it is ICP's policy to review operating, maintenance and emergency response procedures on a routine basis to ensure they are always applicable. This continuous review process does generate further recommendations for improved safety during the course of operations, but these measures are typically addressed in a very short time frame. \n\n\n9.  Summary\n\nThe design, operation and maintenance of the ammonia system according to IIAR Standards and Guidelines and the implementation of the PSM and RMP programs provide a high level of assurance that the hazards and risks associated with the use of ammonia are being managed in an appropriate manner. The likelihood of a release is minimized through the implementation of these programs. Ice Cream Partners has developed an Emergency Response Plan which is coordinated through the local response agencies and has communicated the information in this Risk Management Plan to the local community."
    }
  ]
}