{
  "FacilityID": 25993,
  "FacilityName": "Wright Distribution Center, Inc.",
  "FacilityStr1": "1000 Hanthorn Road",
  "FacilityStr2": "P.O. Box 817",
  "FacilityCity": "Lima",
  "FacilityState": "OH",
  "FacilityZipCode": "45804",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39003",
  "LEPC": "Allen County LEPC",
  "FacilityLatDecDegs": "40.702028",
  "FacilityLongDecDegs": "-84.089417",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "CE",
  "FacilityURL": "www.wrightdistribution.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 61518361,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Donald E Wright",
  "OperatorStr1": "1000 Hanthorn Road",
  "OperatorStr2": "P.O. Box 817",
  "OperatorCity": "Lima",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45804",
  "OperatorZipCodeExt": null,
  "RMPContact": "Donald E Wright",
  "RMPTitle": "President",
  "FTE": 12,
  "OtherEPAFacilityID": "OHD987053766",
  "EPAFacilityID": "100000179157",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-02-26 00:00:00",
  "SafetyInspectionBy": "DOT, OHDA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": "Warehouse",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-06-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-06-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 40.70235,
  "FRS_Long": -84.08873,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 37125,
      "AltID": "Warehousing",
      "FacilityID": 25993,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 38030,
          "ProcessID": 37125,
          "NAICSCode": "49311",
          "_desc": {
            "NAICS_CODE": "49311",
            "NAICS_DESCRIPTION": "General Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 48548,
          "ProcessID": 37125,
          "ChemicalID": 21,
          "Quantity": 100000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 21,
            "ChemicalName": "Epichlorohydrin  [Oxirane, (chloromethyl)-]",
            "CASNumber": "106-89-8",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 548548,
          "ProcessID": 37125,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 25993,
      "SummaryText": "Wright Distribution Center, Inc is an ISO 9002 certified agricultural chemical warehouse and distribution center, assigned company number 73047 by the Office of Pesticide Programs, U.S. EPA.  Donald E. Wright is the Owner/President of Wright Distribution Center; a family owned business, with over 30 years of experience in chemical distribution.  Wright Distribution warehouses end product herbicides, some pesticides, and automotive compounds, as well as plastic materials and corrugated cardboard.\n\nThe subject site consists of approximately 28.2 acres of land located on the southwest corner of the intersection of State Route 65 and Hanthorn Road at Exit 122 of Interstate 75 in Lima, Ohio.  The north half of the site is occupied by two warehouse buildings and associated outbuildings/sheds.  A borrow-pit pond dug during construction of the Interstate 75 overpass, makes-up the majority of the property?s south half.  Gravel parking areas and drives surround the structures.  A chain-link fence surrounds the Wright Distribution Center property.  Surrounding land use as outlined in the Wright Distribution Center Emergency Response Plan, is primarily commercial and industrial, with residential properties located greater than ?-mi. to the north and west of the subject site.  \n\nWarehouse No.1 consists of a 138,700 square foot open storage area, with a 2,730 square foot office area at the northwest corner of the structure.  Shipping and receiving offices are separated from the warehouse by concrete block walls.  The building was constructed in 1966 on a reinforced concrete floor.  The open storage area is of steel frame construction with steel exterior siding.  The walls are insulated with rolled fiberglass and sodium vapor and fluorescent bulbs provide lighting.  At varying times within the year, several thousand pounds of herbicide, fungicide, insecticide, and related chemicals intended for agricultural use are stored in Warehouse No.1.  Toxic and a limited quantity of flammab"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 25993,
      "SummaryText": "le agricultural chemicals are warehoused throughout the main storage area, with corrosive materials located in the northwest corner.  The chemicals are palletized in boxes, sacks, jugs, drums and similar containers.  An area in the southwest corner of the warehouse is designated for oxidizer storage, although the facility is not currently storing oxidizers.  \n\nWarehouse No.2 is situated east of Warehouse No.1, and is of similar construction.  Warehouse No.2 contains 80,000 square feet designated for the storage of non-hazardous packaging materials.  Both warehouses have interior spill containment systems.\n\nA 3,500 square feet maintenance garage located west of Warehouse No.1 was built in 1989.  Drums of waste oil, compressed gas cylinders and welding equipment, and small quantities of oils, lubricants, and other automotive supplies are stored within the service garage.\n\nFour buildings are situated south of the warehouses: the flammable materials storage building, a storage shed, a pump house, and a scale house.  The pump house is a brick building constructed in the late-1960s.   The structure houses two diesel engine pumps and a diesel fuel aboveground storage tank.  The sprinkler system in both warehouses is supplied by water pumped from the four-acre pond located south of the pump house and main building.  Materials Safety Data Sheets, a copy of the emergency response plan, and sewer blocks used to contain runoff from all four catch basins on site are located in the scale house.  The storage building east of the pump house is of wood frame construction, and was built in the late-1960s.\n\nThe chemical of concern will be stored in a 3750 square foot flammable materials storage building, built in 1998 of steel frame construction with steel siding and roofing. The flammable materials storage building is not equipped with a sprinkler system, but is located greater than 200-feet from the warehouse as required by the state fire code for storage of flammable materials.  Pr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 25993,
      "SummaryText": "imary containment systems within the interior of the building include an internal floor drain reservoir equipped with a spill sump, and elevated loading ramps.  Secondary containment systems include a valved-catch basin in the truck-loading bay at the east end of the structure provides secondary containment, preventing contaminated runoff from the property.  \n\nMr. Donald E. Wright is an active participant in local government organizations and industry associations dealing with safe chemical distribution, including the following member affiliations:\n\n? Allen County Local Emergency Planning Commission\n? International Warehouse Logistics Association (IWLA)\n? The Council of Chemical Logistics Provider \n(A Council of the International Warehouse Logistics Association)\n? Mid America Crop Protection Association (MACPA)\n? Better Business Bureau (BBB)\n\nMr. Russ Decker, Director of the Allen County Emergency Management Agency confirmed that Wright Distribution is included in the county emergency response plan.  The warehouse is regulated by SARA Title III Emergency Planning and Community Right-to-Know laws, and is subject to filing of the Emergency and Hazardous Chemical Inventory Form, listing 59 chemicals under 70 descriptions, including seven extremely hazardous substances.  \n\nWright Distribution personnel receive Technician-Level Emergency Response training designed to meet OSHA Hazard Communication Standard training requirements promulgated in 29 CFR 1910.120.  Personnel also receive Hazardous Materials 126F training specific to the agricultural chemical industry.  The Operations Manager and the Hazardous Materials trainer have participated in OSHA 40-Hour Hazardous Waste Site Worker Training.  Mr. Wright encourages and provides continuing education through private training providers and the Bureau of Workers Compensation.  Manufacturer representatives of the client warehousing the subject material are to provide product specific training commensurate with the storage of "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 25993,
      "SummaryText": "the epichlorohydrin.  \n\nSpill response equipment including absorbents, protective equipment, and empty recovery/salvage drums and hoppers are stored in the northeast corner of Warehouse No.1.   Additional spill response reclamation drums are stored in the storage building east of the pump house along with Materials Safety Data Sheets, a copy of the emergency response plan, and sewer blocks used to contain runoff from all four catch basins on site.  Personal protective equipment (PPE) is located next to the warehouse shipping office.   \n\nThe covered process is the Program Level 1, General Warehousing And Storage of epichlorohydrin, a surfactant used in the manufacture of cosmetics and shampoo.    The product is stored in 55-gallon palletized drums, stacked no greater than two pallets high.  Warehousing quantities are not anticipated to exceed 180 drums, or 100,000 pounds at any given time. Product shipments are delivered in 80-unit lots.  Due to product storage in 55-gallon drums, a worst-case release scenario involving the release of the contents of all drums simultaneously is considered unlikely.  Product specific training by the manufacturing representative, and training in material handling procedures for hazardous materials reduce the potential for either worse-case release scenario or alternative release scenario involving the puncture of a drum.\n\nWright Distribution Center has never experienced an accidental release of hazardous materials.  Mr. Wright has petitioned for annexation of the subject site into the city of Lima, Ohio.  Annexation will provide full time coverage by the Lima Fire Department as opposed to fire protection by the Perry Township Volunteer Fire Department."
    }
  ]
}