{
  "FacilityID": 26002,
  "FacilityName": "Equity Group, Georgia Division",
  "FacilityStr1": "7220 US Hwy 19 N",
  "FacilityStr2": null,
  "FacilityCity": "Camilla",
  "FacilityState": "GA",
  "FacilityZipCode": "31730",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13205",
  "LEPC": "Mtchell County",
  "FacilityLatDecDegs": "31.272778",
  "FacilityLongDecDegs": "-84.18",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "P1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "lbryantala@mindspring.com",
  "FacilityDUNS": 56205648,
  "ParentCompanyName": "Keystone Foods",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Buddy Paracca",
  "OperatorStr1": "7220 US Hwy 19 N",
  "OperatorStr2": null,
  "OperatorCity": "Camilla",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31730",
  "OperatorZipCodeExt": null,
  "RMPContact": "Larry Bryant",
  "RMPTitle": "Safety Manager",
  "FTE": 2600,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000116894",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-03-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-06-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 31.21776,
  "FRS_Long": -84.19646,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 37138,
      "AltID": null,
      "FacilityID": 26002,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 38044,
          "ProcessID": 37138,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 48562,
          "ProcessID": 37138,
          "ChemicalID": 56,
          "Quantity": 100559.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 548562,
          "ProcessID": 37138,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26002,
      "SummaryText": "General accidental release and prevention policy of Equity Group, Georgia Division.\n\nIn this food product manufacturing facility we handle anhydrous ammonia in a liquid and vapor state that is considered hazardous by EPA.  The potentially hazardous chemical used at this facility is anhydrous ammonia.  Due to the hazardous properties of ammonia it is necessary to observe certain safety precautions during use to prevent human exposure, reduce the threat to our workers personal health, the surrounding community and the environment.  It is our policy to adhere to all applicable federal and state regulations that we are governed by.  Safety depends directly on our proper handling of ammonia coupled with the safety devices, control measures and the safe handling procedures that our personnel are trained in.\n\nStationary source and regulated substance handled.\n\nEquity Group, Georgia Division, 7220 Highway 19 N, Camilla, Georgia, is located approximately two miles north of Camilla, Georgia.  We are responsible for the processing of frozen poultry products in varies varieties.  The facility consists on two separate processing centers under one roof using a discrete Anhydrous Ammonia closed loop refrigeration system as a heat removal media for each processing center.  Both plants manufacture product around the clock, (7) seven days a week.  There are 2600 full time employees at the entire facility, which includes hourly and salary personnel.\n\nAs a result of a recognized highly toxic chemical that will be used at the Equity Group, Georgia Division and in accordance with EPA?s Risk Management Program, 40 CFR, Section 68 requirements.  The facility has developed and implemented prevention program # 3.  Additionally the facility has also in place a Process Safety Management program as required by OSHA Standard 1910.119 and further uses this program as a management system per the outlined requirements in 40 CFR 68.15.  \n\nHaving two separate ammonia refrigeration system process, the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26002,
      "SummaryText": " facility modeled four off site consequence analyses.  A worst and alternate case scenario for each process.\n\nDuring establishment of the worst-case and alternate worst-case scenarios mitigation was not a considering factor.\n\nAmmonia worst-case release scenario # 1 criteria for Equity Group, Georgia Division.\n(Anhydrous Ammonia Refrigeration System # 1, Further Processing)\n\nWorst-case scenario depicts continuous source leak from the High Pressure Receiver (HPR) located in the Further Processing engine room.  The vessel?s normal operating level is approximately 50% of its total capacity.  \n\nWithin the hazard radius there is an estimated residence population of 3000, commercial industry, one school, and a hospital. There are no prisons/correction facilities or environmental receptors.\n\nAmmonia alternate case release scenario # 2 criteria for Equity Group, Georgia Division.\n(Anhydrous Ammonia Refrigeration System # 1, Further Processing)\n\nAlternate release scenario is represented by the release of ammonia vapor from a safety relief valve (SRV) due to an over pressurization condition on a vertical vessel located within the Further Processing engine room.  The SRV would be performing exactly as it is designed to do.  Actual venting would take place on the facility roof where the relief vent piping exits to the atmosphere. \n\nWithin the hazard radius there is an estimate population of 12 residences only. There are no other commercial industries, schools, hospitals, recreation areas, prisons/correctional facilities, or environmental receptors.\n\nAmmonia worst-case release scenario # 3 criteria for Equity Group, Georgia Division.\n(Anhydrous Ammonia Refrigeration System # 2, Processing)\n\nWorst-case scenario depicts continuous source leak from the High Pressure Receiver (HPR) located in the Processing engine room.  The vessel?s normal operating level is approximately 50% of its total capacity.  \n\nWithin the hazard radius there is an estimated residence population of 2000, comme"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26002,
      "SummaryText": "rcial industry, one school, and a hospital. There are no prisons/correction facilities or environmental receptors.\n\n\nAmmonia alternate case release scenario # 4 criteria for Equity Group, Georgia Division.\n(Anhydrous Ammonia Refrigeration System # 2, Processing)\n\nAlternate release scenario is represented by the release of ammonia vapor from a safety relief valve (SRV) due to an over pressurization condition on a vertical vessel located within the Processing engine room.  The SRV would be performing exactly as it is designed to do.  Actual venting would take place on the facility roof where the relief vent piping exits to the atmosphere. \n\nWithin the hazard radius there are no residences and there are no other commercial industries, schools, hospitals, recreation areas, prisons/correctional facilities, or environmental receptors.\n\nNote: Footprint was not drawn because effects of near-field patchiness make dispersion predictions unreliable for short distances.\n\n\nThe following administrative and engineering controls are in place at the Equity Group, Georgia Division facility to eliminate or control the release of Anhydrous Ammonia use in its processes.\n\nThe Equity Group, Georgia Division facility has integrated various engineering and administrative control mechanisms to eliminate and/or minimize any possible upsets/releases from this facility including; electronic ammonia detection and alarms located through out the facility, safety devices and interlocks that will shutdown equipment exceeding safe operating limits, safety relief valves are installed on all pressure vessels, condensers, condensers, and oil separators to eliminate the possibility of an over-pressurization condition.   \n\nAs a vital element of the facility?s prevention program, Equity Group, Georgia Division has implemented and is in compliance with OSHA Standard 29 CFR 1910.119 (Process Safety Management). The facility has implemented strict preventive maintenance procedures and an Emergency Action & Re"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26002,
      "SummaryText": "sponse Plan.  Release of ammonia is specially covered in the Emergency Action & Response Plan and contains all required actions in the event of release of ammonia. As part of the facility's accidental release prevention, training is conducted for employees and new hires.  Accidental release prevention, training and awareness is reinforced annually and as the operations at the facility dictates.  Employees have received training in Hazardous Communication, Emergency Response, Spill Prevention, safe operations, maintenance, and emergency actions.  The Equity Group, Georgia Division has specific operational and emergency procedures in place for delivery and handling of ammonia.\n\nThe facility has implemented strict preventive maintenance procedures and an Emergency Response Plan (ERP).  Release of ammonia is specially covered in the Emergency Action Plan and contains all required actions in the event of release of ammonia. As part of the facility's accidental release prevention, training is conducted for employees and new hires.  Accidental release prevention, training and awareness is reinforced annually and as the operations at the Center dictates.  Employees have received training in Hazardous Communication, Emergency Response, Spill Prevention, safe operations, maintenance, and emergency actions.  The Equity Group, Georgia Division facility has specific operational and emergency procedures in place for delivery and handling of ammonia."
    }
  ]
}