{
  "FacilityID": 26003,
  "FacilityName": "TEPPCO Watkins Glen Terminal",
  "FacilityStr1": "SR 14 North",
  "FacilityStr2": null,
  "FacilityCity": "Watkins Glen",
  "FacilityState": "NY",
  "FacilityZipCode": "14891",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36097",
  "LEPC": null,
  "FacilityLatDecDegs": "42.411444",
  "FacilityLongDecDegs": "-76.902083",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": "www.teppco.com",
  "FacilityEmailAddress": "cssripadam@teppco.com",
  "FacilityDUNS": 781768122,
  "ParentCompanyName": "TE Products Pipeline Company, Limited Partnership",
  "Company2Name": null,
  "CompanyDUNS": 781768122,
  "Company2DUNS": 781768122,
  "OperatorName": "TE Products Pipeline Company, L.P.",
  "OperatorStr1": "P.O. Box 2521",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77252",
  "OperatorZipCodeExt": "2521",
  "FTE": 13,
  "OtherEPAFacilityID": "NYD094410446",
  "EPAFacilityID": "100000179184",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2002-06-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2002-06-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-06-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 42.3772,
  "FRS_Long": -76.94903,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 37139,
      "AltID": "Storage/Loading - Propane",
      "FacilityID": 26003,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 48563,
          "ProcessID": 37139,
          "ChemicalID": 98,
          "Quantity": 252600.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 48564,
          "ProcessID": 37139,
          "ChemicalID": 105,
          "Quantity": 17300.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 38045,
          "ProcessID": 37139,
          "NAICSCode": "48691",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 20783,
              "Process_NAICS_ID": 38045,
              "SafetyReviewDate": "2002-03-01 00:00:00",
              "PHA_Date": "2002-03-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-12-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2001-10-01 00:00:00",
              "TrainingReviewDate": "2001-10-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Computer Based Training",
              "MaintenanceReviewDate": "2002-04-16 00:00:00",
              "EquipmentInspectionDate": "2002-03-01 00:00:00",
              "EquipmentTested": "Valves & ESD",
              "ChangeMgmtDate": "2001-11-02 00:00:00",
              "ChangeMgmtReviewDate": "1998-03-31 00:00:00",
              "PreStartupReviewDate": "2001-05-03 00:00:00",
              "ComplianceAuditDate": "2002-04-15 00:00:00",
              "AuditCompletionDate": "2003-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2002-04-15 00:00:00",
              "HotWorkPermitReviewDate": "2002-04-15 00:00:00",
              "ContractorSafetyReviewDate": "2002-04-15 00:00:00",
              "ContractorSafetyEvalDate": "2002-04-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 30280,
                  "PreventionProgram3ID": 20783,
                  "ProcessChemicalID": 48563
                },
                {
                  "PrimaryKey": 30281,
                  "PreventionProgram3ID": 20783,
                  "ProcessChemicalID": 48564
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 26003,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2001-10-01 00:00:00",
    "ERTrainingDate": "2000-01-02 00:00:00",
    "CoordinatingAgencyName": "Watkins Glen Volunteer Fire Dept",
    "CoordinatingAgencyPhone": "6075356642",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26003,
      "SummaryText": "Executive Summary\n\n1. Accidental Release Prevention and Emergency Response Policies\n\nWe at TEPPCO are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  If such a release does occur at the TEPPCO Watkins Glen Terminal, our response activities are coordinated with Watkins Glen Volunteer Fire Department.\n\n\n2. The Stationary Source and the Regulated Substances Handled\n\nThe Watkins Glen Terminal¿s RMP¿regulated activity is the storage and loading of propane [CAS# 74-98-6].  Propane is received by pipeline and stored in pressure vessels.  Propane is stored in two 30,000-gallon ¿bullet¿ tanks.  These tanks provides intermediate storage prior to truck loading of propane.  All loading of LPG products is for purposes of wholesale distribution.  Ethyl mercaptan [CAS# 75-08-1], which is used to odorize LPG products, is stored at the site in one 2500 gallon tank.\n\nPropane and Ethyl Mercaptan are classified as ¿flammable¿ under 40 CFR Part 68.  No other flammable compounds or compounds classified as ¿toxic¿ are stored or used at the facility in amounts above their threshold quantities.\n\nThe maximum on-site quantities of propane and ethyl mercaptan subject to regulation under 40 CFR Part 68 at any one time are estimated to be  252,600 lbs and 17,300 lbs respectively.\n\n3. The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including Administrative Controls and Mitigation Measures to Limit the Distances for Each Reported Scenario:\nTo perform the required offsite consequence analysis for our facility, we have used the look-up tables and equations provided by the EPA in the RMP Offsite Consequence Anal"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26003,
      "SummaryText": "ysis Guidance.  The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for Program 3 flammable substances as a class involves a catastrophic release from tank storage.  The scenario involves the release of 126,300 lbs of propane, which is the maximum quantity that can be contained in any of the two bullet tanks at the facility. It is assumed that the entire quantity is released as a vapor, which finds an ignition source, with 10 percent of the released quantity participating in a vapor cloud explosion. Under worst case weather conditions, the calculated distance of 0.40 mile is obtained corresponding to an endpoint of 1 psi overpressure.  According to the TEPPCO Watkins Glen personnel,  there are about 8 persons located within 0.40 mile from the facility.\n\nThe alternative release scenario submitted for Program 3 flammable substances involves a release of propane due to a rupture of a loading hose at the propane truck rack.  The release is assumed to result in a vapor cloud explosion. The scenario involves the release of 342 lbs of propane over a ten-second period. This scenario is based on the rupture of a 2-inch hose flowing at 2,050 lbs/min and assumes that the flow of propane is halted by an automatic shut-off valves whose operation is triggered by a sudden increase in flow.  Under neutral weather conditions, the maximum distance to the flammable endpoint of 1 psi overpressure is 0.06 mile or 300 feet. According to the TEPPCO Watkins Glen personnel, there are no persons living within this distance of the propane truck rack.\n\n\n4. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Informat"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26003,
      "SummaryText": "ion\nTEPPCO maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The ¿what if¿ methodology is used to carry out these analyses. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of not more than five (5) years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, TEPPCO maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown, and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nTEPPCO has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every three (3) years, and more frequently as needed.\n\nMechanical Integrity\nTEPPCO carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes, among others: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, pumps, valves, gas detectors, flame detectors, and temperature and pressure switches.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  An"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26003,
      "SummaryText": "y equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at TEPPCO to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-Startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at TEPPCO.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nTEPPCO will conduct audits on a regular basis to confirm that the provisions set out under the RMP rule are being properly and adequately implemented.  These audits will be carried out at least every three (3) years and any corrective actions required as a result of the audits will be undertaken in a safe and prompt manner.\n\nIncident Investigation\nTEPPCO promptly investigates any incident that results in, or could reasonably result in, a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of five (5) years.\n\nEmployee Participation\nTEPPCO truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility¿s implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContracto"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 26003,
      "SummaryText": "rs\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  TEPPCO has a strict policy of informing the contractors of known potential hazards related the contractor¿s work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n5. Five-year Accident History\nThe TEPPCO Watkins Glen Terminal has an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there have been no accidental releases of substances regulated under 40 CFR Part 68 during this period which have resulted in deaths, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n\n6. Emergency Response Plan\nTEPPCO maintains a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the emergency response plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n7. Planned Changes to Improve Safety\nAt the present time, there are no plans for significant changes to the facility for purposes of improving safety."
    }
  ]
}