{
  "FacilityID": 2613,
  "FacilityName": "McCain Foods, Othello Plant",
  "FacilityStr1": "100 Lee Street",
  "FacilityStr2": "P.O. Box 607",
  "FacilityCity": "Othello",
  "FacilityState": "WA",
  "FacilityZipCode": "99344",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53001",
  "LEPC": "Adams County LEPC",
  "FacilityLatDecDegs": "46.840556",
  "FacilityLongDecDegs": "-119.173889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "AWGreen@mccain.ca",
  "FacilityDUNS": 1104736,
  "ParentCompanyName": "McCain Foods USA, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1104736,
  "Company2DUNS": null,
  "OperatorName": "David Nicley",
  "OperatorStr1": "100 Lee Street",
  "OperatorStr2": "P.O. Box 607",
  "OperatorCity": "Othello",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "99344",
  "OperatorZipCodeExt": null,
  "FTE": 300,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000032485",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1992-07-04 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 46.839167,
  "FRS_Long": -119.174722,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2920,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 2613,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 3117,
          "ProcessID": 2920,
          "ChemicalID": 56,
          "Quantity": 37200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 2985,
          "ProcessID": 2920,
          "NAICSCode": "31141",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 906,
              "Process_NAICS_ID": 2985,
              "SafetyReviewDate": "1999-05-05 00:00:00",
              "PHA_Date": "1994-07-04 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Gas leak detector",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-05 00:00:00",
              "TrainingReviewDate": "1999-05-05 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-05 00:00:00",
              "EquipmentInspectionDate": "1999-06-20 00:00:00",
              "EquipmentTested": "Daily visual inspection of Mycom compressors",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-05-05 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-05-05 00:00:00",
              "AuditCompletionDate": "1999-06-20 00:00:00",
              "IncidentInvestigationDate": "1997-01-08 00:00:00",
              "InvestigationChangeDate": "1997-01-31 00:00:00",
              "ParticipationPlansReviewDate": "1999-05-05 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-05 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-05 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1028,
                  "PreventionProgram3ID": 906,
                  "ProcessChemicalID": 3117
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 2613,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-05 00:00:00",
    "ERTrainingDate": "1999-04-26 00:00:00",
    "CoordinatingAgencyName": "Othello Fire Department",
    "CoordinatingAgencyPhone": "5094882626",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 2613,
      "SummaryText": "travel far enough to affect some commercial and industrial facilities adjacent to McCain Foods.  Therefore, as described in the section entitled Emergency Response Program, McCain Foods has implemented procedures to facilitate prompt notification of those nearby facilities in the unlikely event of an actual release.\n\nS:\\jimw\\mccain\\rmpexec.doc\t4 of 4"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2613,
      "SummaryText": "e release the facility would contact a telephone call-down list that includes the Adams County LEPC, the Othello Fire Department,  the Othello Police Department, the federal and state environmental agencies, and several nearby industrial facilities that could be affected by downwind ammonia concentrations.\n\n\nHYPOTHETICAL ACCIDENTAL RELEASE SCENARIOS\n\nThe Risk Management Plan must assess the downwind impacts of hypothetical accidental releases.  EPA requires facilities to model the distance that a plume of released gas would travel before it dispersed to an ambient concentration equal to the Toxic Endpoint Concentration.  The Toxic Endpoint Concentration for various compounds were specified by EPA, and are generally concentrations that would cause no permanent harm but could interfere with people's ability to leave the area.  The Toxic Endpoint Concentration for ammonia is 200 parts per million (ppm).   McCain Foods evaluated a wide range of hypothetical accidents that could result in releases of ammonia.  In accordance with EPA's rule, two hypothetical accidental release scenarios were developed:\n\nWorst-Case Scenario - It was assumed that the entire contents of the largest vessel containing ammonia (the high-pressure receiver containing 11,700 pounds of ammonia) is accidentally released inside the refrigeration room in a 10-minute period. This scenario is required to be evaluated for the Risk Management Plan.  McCain Foods knows of no event that could realistically cause such a large release. EPA guidance specifies that 55% of the ammonia released indoors would eventually be emitted to the outside atmosphere;  therefore the outdoor release quantity is 6,440 pounds over a 10-minute period. In accordance with the worst-case scenario it was assumed that the release occurs during a period of exceptionally calm, stagnant conditions (1.5 meter/second wind speed and F stability) that would result in the highest downwind concentrations.   Standard tables from EPA's Model"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 2613,
      "SummaryText": "SECTION 112(r) RISK MANAGEMENT PLAN\nMCCAIN FOODS USA, OTHELLO, WASHINGTON\n\nEXECUTIVE SUMMARY\n\n\n\nFACILITY DESCRIPTION\n\nThe McCain Foods USA facility is located about one mile northwest of the town of Othello, Washington (see Figure 1). McCain Foods USA, is a large producer of frozen potato products.  The Othello facility produces french fry products.  Processing activities include: raw product receiving, sorting, storage, washing, peeling, cutting, blanching, frying, freezing, packaging, and finished product shipment.  Activities are conducted at this site during all months of the year.\n\nThe plant site consists of a main processing plant, cold storage building, raw potato storage buildings, engineering/maintenance building, a primary wastewater treatment facility, and the winter water storage lagoons.\n\nThe facility uses an ammonia refrigeration system to freeze the product before packaging and to cool the cold storage warehouse that is used to store the product before shipment.  The refrigeration system uses anhydrous ammonia as the cooling agent.   The ammonia is stored and used in a variety of areas at the plant.  \n\nMcCAIN FOODS COMMITMENT TO WORKER SAFETY\n\nMcCain Foods strives to ensure that the Othello plant is a safe place to work.  The facility maintains its Plant Emergency Preparedness Team (PEP Team) to constantly evaluate safety issues and to solicit input from all staff. \n\nACCIDENTAL RELEASES DURING PAST 5 YEARS\n\nMcCain Foods has not had any ammonia releases during the past 5 years that resulted in any injuries, off-site evacuations, or property damage.\n\nPROCESS SAFETY MANAGEMENT ACCIDENT PREVENTION PROGRAM\n\nThe McCain Foods Othello plant is subject to OSHA's Process Safety Management (PSM) regulations for all equipment and operations associated with the ammonia refrigeration system.  The PSM rule requires the following stringent activities to minimize the potential for an accidental release:\n\n* Review of the design of all equipment and controls for the amm"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2613,
      "SummaryText": "onia system to ensure they are properly designed and installed.\n  \n* Standard operating procedures for the ammonia system.  All procedures must be reviewed and certified annually.\n \n* Regular inspection of all equipment, monitoring systems and controls for the ammonia system, with stringent documentation of all inspections.\n \n* Prompt corrective action for any non-conforming items identified by the regular inspections.\n \n* Initial safety training and 3-year refresher training for all operators and maintenance staff working on the ammonia system.\n \n* Rigorous safety reviews conducted prior to system startup, if any equipment or operations for the ammonia system are modified.\n \n* Stringent investigation of any incidents that have the potential to have caused ammonia releases.\n \n* Periodic evaluation of the safety records of all outside contractors who work on the ammonia system.\n \n* Development of an effective emergency response program.\n \n* Independent audits of the entire PSM program every three years.\n \n EMERGENCY RESPONSE PROCEDURES\n \n McCain Foods uses its Plant Emergency Preparedness Operations Manual (PEP Manual) as guidance for emergency response in the unlikely event of an accidental release.  The key elements of the emergency preparedness program are as follows:\n \n* All plant staff (including administrative and clerical staff) are trained in the specific elements of the program.\n \n* Several supervisors and operators are trained, certified and equipped for hazardous materials (Hazmat) emergency operations to repair accidental releases in areas of high ammonia concentration.\n \n* The plant uses a combination of audible alarms and a plant 2-way radio system to alert the staff of a potential accident and to conduct in-plant communications.\n \n* All plant staff are trained to phone the Security Gate in the event of an accident.  The Security Gate serves as the point of contact for subsequent on-plant and off-plant emergency communication.\n \n* In the event of a larg"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2613,
      "SummaryText": "RMP for Ammonia Refrigeration were used to estimate the downwind concentrations.  As shown in Figure 1, the Worst-Case Scenario plume was modeled to travel 1.44 miles before it dispersed to a concentration of 200 ppm.  The prevailing wind direction at McCain Foods is toward the northeast, which would normally blow the hypothetical ammonia release into an area of very unpopulated agricultural fields. However, the plume might travel in a direction that could affect homes, schools or businesses.  Therefore, as described in the section entitled Emergency Response Program, McCain Foods has implemented procedures to facilitate prompt notification of the Fire Department and Police Department in the unlikely event of an actual release.\n\nAlternate Release Scenario - McCain Foods conducted a safety review to assess a range of accidents (ranging from forklift accidents to earthquakes) that could cause ammonia releases large enough to affect people beyond the facility boundary.  The review team selected the following hypothetical accident for consideration as the Alternate Release Scenario:  a large earthquake damages a flange on outdoor piping on top of the roof at the refrigeration room.  A 1/4-inch crack in a damaged flange would cause an ammonia release rate of 76 pounds per minute.  The ammonia leak was assumed to continue for one hour before McCain Food's emergency response team could repair the leak.  EPA's SLAB computer model was used to calculate the downwind ammonia concentrations.  As shown in Figure 1 the Alternate Release Scenario plume was modeled to travel 1,200 feet before it dispersed to a concentration of 200 ppm. The prevailing wind direction at McCain Foods is toward the northeast, which would normally blow the hypothetical ammonia release into an area of unpopulated agricultural fields.  Even if the wind was blowing directly toward the nearest residential areas, the plume would disperse to 200 ppm before it reached any houses.  However, the plume might"
    }
  ]
}