{
  "FacilityID": 26386,
  "FacilityName": "Ferro EM, L.P.",
  "FacilityStr1": "3900 South Clinton Avenue",
  "FacilityStr2": null,
  "FacilityCity": "South Plainfield",
  "FacilityState": "NJ",
  "FacilityZipCode": "07080",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34023",
  "LEPC": "South Plainfield LEPC",
  "FacilityLatDecDegs": "40.564444",
  "FacilityLongDecDegs": "-74.429722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Ferro Corporation",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Nancy Lee",
  "OperatorStr1": "3900 South Clinton Avenue",
  "OperatorStr2": null,
  "OperatorCity": "South Plainfield",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07080",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael A. Reid",
  "RMPTitle": "Safety, Health & Environmental Mgr.",
  "FTE": 300,
  "OtherEPAFacilityID": "07080MTZMT3900",
  "EPAFacilityID": "100000031164",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "NJ00010",
  "SafetyInspectionDate": "2002-02-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-08-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-08-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-08-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-02-05 00:00:00",
  "DeRegistrationEffectiveDate": "2009-01-29 00:00:00",
  "AnniversaryDate": "2007-08-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 40.56461,
  "FRS_Long": -74.42964,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 37776,
      "AltID": "Formaldehyde",
      "FacilityID": 26386,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 38689,
          "ProcessID": 37776,
          "NAICSCode": "331492",
          "_desc": {
            "NAICS_CODE": "331492",
            "NAICS_DESCRIPTION": "Secondary Smelting, Refining, and Alloying of Nonferrous Metal (except Copper and Aluminum)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 49464,
          "ProcessID": 37776,
          "ChemicalID": 1,
          "Quantity": 55000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 549464,
          "ProcessID": 37776,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26386,
      "SummaryText": "\nAccidental Release Prevention and Emergency Response Policies\n\nAt the Ferro South Plainfield site, we are committed to operating and maintaining all of our processes in a safe and responsible manner.  We use a combination of release prevention programs and emergency response programs to help ensure the safety of our employees and the public as well as the protection of the environment.  This document provides a brief overview of the risk management activities that we have designed into and implemented including:\nA description of our facility and the use of substances regulated by the Environmental Protection Agency's Risk Management Program rule;\nA summary of results from our assessment of the potential offsite consequences from an accidental chemical release;\nAn overview of our accidental release prevention programs;\nA five-year accident history for accidental releases of chemicals regulated by the Environmental Protection Agency's Risk Management Program rule;\nAn overview of our emergency response program;\nAn overview of planned activities to improve the prevention program at the facility;\nThe certification that the Environmental Protection Agency's Risk Management Program rule requires us to provide; and\nThe detailed information about our risk management program.\n\nThe South Plainfield facility is a producer of precious metal products such as silver solder, pastes, and powders used in the electronics industry.  Formaldehyde solution is used at the facility in the precipitation of metallic silver from precious metal solutions.  These operations are conducted in small batch reactors.\n\nFormaldehyde solution, 37%, is stored at the facility in a nominal 6000-gallon storage tank and distributed to the user equipment in the plant through a piping network.  Formaldehyde solution is delivered by tank truck by several different firms.  Deliveries are scheduled when the storage tank level drops below a predetermined level.\n\nWorst Case Release and Alternative Scenarios\n\nThe "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26386,
      "SummaryText": "primary hazard for storage and handling of formaldehyde solution at this facility is loss of containment resulting in a toxic release.  The \"worst case\" scenario involves the complete failure of the storage tank with the rapid release of the entire tank contents followed by evaporation.  The storage tank is inside a dike with 6\"8 walls to limit the surface area of the liquid pool thereby reducing the evaporation rate.  The release was modeled using the equations and information in the most recent Offsite Consequence Analysis Guidance document.  The \"Worst Case\" conditions followed these conditions established in the rule.  The duration of the release was 10 minutes.  The release temperature was 95F with an urban topography.  The distance to the formaldehyde endpoint is 0.067 miles.\n\nAn alternative release scenario may be the failure of the hose connecting the delivery tank trailer to the unloading transfer pipeline.  This scenario was selected as a more credible failure incident.  The driver unloads the tank trailer under the surveillance of Ferro security personnel. The release rate of 901 lb./min for two minutes was determined.  The driver remains with his vehicle during the unloading operation.  The trailer is parked inside the \"well\" of a nearby loading dock.  Spilled liquid would be trapped inside the \"well\".  The following conditions were used; wind speed 3.0 m/s, Class F stability, and urban topography.  A release rate for evaporation was calculated using the worksheets provided in the Offsite Consequence Analysis Guidance document.  At five times the EPA toxic endpoint, resulted in a distance to the toxic endpoint of 0.018 miles.\n\n\nAccidental Release Prevention Program\n\nThe prevention program used at the facility is the Occupational Safety and Health Administrations Process Safety Management standard.  The standard covers management system elements involving safety information, hazard evaluations, operating procedures, employee training, contractor controls "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26386,
      "SummaryText": "mechanical integrity, pre-startup reviews, incident investigations, safe work practices, and emergency response.\n\nThere are a number of specific measures in place to reduce the likelihood of a release of formaldehyde solution or it's impact.  Two level gauges monitor the tank liquid level.  The two gauges must read within 100 gallons of each other.  Additional material is not ordered until the tank level is below 1500 gallons.  This will allow the total contents of the delivery tank trailer to be safely unloaded into the storage tank.  The storage tank is equipped with high level monitor and alarm that alerts the driver if the tank level is too high.\n\nThe driver and Ferro personnel are on hand throughout the unloading operation and are able to shut down the operation in the event of a leak before a large release has occurs\n\nThe pipe line and storage tank is constructed of welded stainless steel.  This material is compatible with and resistant to corrosion from formaldehyde solution.\n\n\nFive-year Accident History\n\nThere have not been any releases of formaldehyde solution at this facility.\n\n\nEmergency Response Program\n\nEmergencies at the facility are handled according to the sites \"Emergency Preparedness Plan\" which details the actions required to respond to plant emergencies such as chemical spills, medical emergencies, fire, gas leaks, bomb threats, explosions and natural disasters.\n\nDecisions regarding the evacuation of personnel and the notification of outside agencies are made by the Emergency Response Management Team chairperson or Vice Chairperson.  If the emergency plan is activated during the off-hours or weekend, the Shift Supervisor with assistance from security personnel will initiate the plan.\n\nThe Hazardous Entry and Abatement Team will respond to chemical spills.  Team members have been trained in response and mitigation techniques.  The Team conducts annual drills.  Their first response is to stop the release and contain the spread of material.  The for"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26386,
      "SummaryText": "maldehyde storage tank is contained inside a diked area.  The tank is further sheltered on three sides by the production building.  The diked area is designed to hold the entire contents of the storage tank plus a minimum of six inches of rainwater.\n\nDuring unloading the tank trailer is parked inside the \"well\" of the nearby loading dock.  Spills occurring during unloading will be contained inside the \"well\".\n\n\n\n\n\nPlanned Improvement to the Prevention Program\n\nThe prevention program is the facility is the Process Safety Management System required by the Occupational Safety and Health Administration Standard 1910.119.\n\n\nPlease note:  Sect.2.6 and Sect.3.6 should read 0.04 #/min.and 0.1035#/min..\n              RMP*SUBMIT would not accept these and per EPA Hotline 0.2#/min.\n              was entered."
    }
  ]
}