{
  "FacilityID": 26397,
  "FacilityName": "Ducor Cold Storage",
  "FacilityStr1": "5351 Road 236",
  "FacilityStr2": null,
  "FacilityCity": "Ducor",
  "FacilityState": "CA",
  "FacilityZipCode": "93218",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.886389",
  "FacilityLongDecDegs": "-119.045278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Growers Citrus Packing, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ducor Cold Storage",
  "OperatorStr1": "P.O. Box 247",
  "OperatorStr2": null,
  "OperatorCity": "Ducor",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93218",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Rios",
  "RMPTitle": "Plant Manager",
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000063879",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-06-07 00:00:00",
  "SafetyInspectionBy": "Factory Mutual Insurance Company",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-08-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-08-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-08-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-08-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 35.88444,
  "FRS_Long": -119.04583,
  "FRS_Description": "OTHER",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 37787,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 26397,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 38701,
          "ProcessID": 37787,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 49479,
          "ProcessID": 37787,
          "ChemicalID": 56,
          "Quantity": 26426.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 549479,
          "ProcessID": 37787,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26397,
      "SummaryText": "\n\n\nEXECUTIVE SUMMARY\n\n\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nThe Ducor Cold Storage facility has implemented preventative maintenance procedures to ensure that the ammonia based refrigeration system is maintained in good operating condition.  Plant personnel monitor the operation of the refrigeration system on a daily basis.  Periodic preventative maintenance procedures are performed on the refrigeration equipment, including inspecting and testing the equipment to ensure the mechanical integrity of the system.  Properly maintained equipment reduces the risk of an accidental release.\n\n\n\nWhile it is Ducor Cold Storage's objective to be a responsible citizen of the community in all of its business activities, the limited staff at the cold storage facility precludes emergency response operations.  As such, an emergency action plan has been prepared for the Ducor Cold Storage facility and a chain of command to respond to emergencies has been established.\n\n\n\nDescription of the Stationary Source and Regulated Substances \n\n\n\nThe Ducor Cold Storage facility is located at 5351 Road 236.  Ducor is the closest community to the Ducor Cold Storage facility.  \n\n \n\nAnhydrous ammonia is used as the refrigerant that provides cooling for the Ducor Cold Storage facility.  The refrigeration system currently consists of two suction accumulators with liquid transfer systems, six compressors, three evaporative condensers, two high pressure receivers, eight pre-cooler rooms, nine cold storage rooms, and the associated hallway, staging and shipping areas.  Bunker mounted accumulators are utilized to feed the flooded evaporators in the pre-cooler rooms and cold storage rooms.  \n\n\n\nDuring normal operation, the anhydrous ammonia is distributed throughout the refrigeration system.  However, during major maintenance activities, the refrigeration system can be \"pumped down\" to evacuate the ammonia from the system and store it in the high pressure receivers.  The maxim"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26397,
      "SummaryText": "um quantity of ammonia that can be stored in the largest high pressure receiver is 26,426 pounds.  The maximum storage capacity for both high pressure receivers is 40,109 pounds.  \n\n\n\nWorst Case Release Scenario and Alternative Release Scenario\n\n\n\nOffsite consequence analyses are used as tools to assist in emergency response planning.  The RMP regulations require the owner or operator of a stationary source to analyze the offsite impacts due to an accidental release of a regulated substance.  The offsite consequence analysis for a Program 3 process must analyze the worst case release scenario and an alternative release scenario.  Since the ammonia-based refrigeration system at the Ducor Cold Storage facility is considered a Program 3 process, both release scenarios were evaluated in the offsite consequence analysis.\n\n\n\nThe offsite consequence analysis must include an estimate of the residential population within an area potentially affected by the accidental release scenario.  This area is defined as a circle with a radius equivalent to the distance the release would travel with concentrations at or above the toxic endpoint.  The circle also defines the area in which potential environmental receptors must be identified.\n\n\n\nThe worst case release is defined by the U.S. EPA as the total release of the contents of the single largest vessel or pipe within 10 minutes.  For liquefied gases stored under pressure, the entire contents of the vessel or pipe are assumed to be released as a vapor.  A total vapor release is highly unlikely.  However, this standardized worst case scenario was developed for emergency response agencies to use for planning purposes.\n\n\n\nAn alternative release scenario is a release that is more likely to occur than the worst case release scenario.  For the Ducor Cold Storage facility, the alternative release scenario was selected based on the results of the Process Hazard Analysis (PHA) for the ammonia-based refrigeration system.  A credible release e"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26397,
      "SummaryText": "vent with a high discharge rate would potentially have the greatest offsite impact.  A leak from a valve packing was identified in the PHAs as having a medium probability of occurrence with a discharge rate high enough to cause an offsite impact, and therefore, was chosen as the alternative release scenario.\n\n\n\nAn analysis of the offsite consequences for the worst case and alternative release scenarios was completed for the Ducor Cold Storage facility.  For the worst case release scenario, the release of 26,426 pounds of ammonia from the largest outdoor high pressure receiver over a 10 minute period was modeled.  The RMP*Comp model indicated the worst case plume would travel 1.9 miles at concentrations at or above the endpoint.  Using 1990 Census data, the population potentially affected within the worst case release scenario circle is 212 persons.  The public receptors from the worst case release scenario include residences and a few agricultural facilities.  There were no environmental receptors within the worst case release scenario circle.\n\n\n\nIn the alternative release scenario, a packing leak from an isolation valve located on the roof was modeled as a release of liquefied ammonia stored under pressure.  For a release of 11 lb/min of anhydrous ammonia, the model calculated that the plume would travel less than 0.1 mile at concentrations at or above the endpoint.  No residences are located within the 0.1 mile area around the Ducor Cold Storage facility.  As such, there would be no population impacts from the alternative release scenario.  There were also no other public receptors or environmental receptors within the alternative release scenario circle. \n\n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nA PSM program, which meets the requirements of the general accidental release prevention program, has been implemented by the Ducor Cold Storage facility to address the anhydrous ammonia system.  The PSM program includes t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26397,
      "SummaryText": "he following chemical-specific prevention steps:\n\n\n\n    Written process safety information, including information pertaining to the hazards of ammonia, the technology of the process, and the equipment in the process has been compiled.\n\n\n\n    Process Hazard Analyses (PHA) have been completed and will be updated and revalidated at least every five years.\n\n\n\n    Written operating procedures have been developed and will be reviewed at least annually.\n\n\n\n    Safe work practices, such as lockout/tagout, confined space entry, opening process equipment or piping, and control over entrance into the facility are implemented as needed.\n\n\n\n    Each employee involved in operating the ammonia system has received initial training and refresher training at least every three years.\n\n\n\n    Written mechanical integrity procedures have been established and implemented.\n\n\n\n    A Management of Change (MOC) program has been developed and implemented to address all proposed changes to the ammonia system.\n\n\n\n    Pre-startup safety reviews will be performed when a modification is made to the ammonia system that is significant enough to require a change in the process safety information.\n\n\n\n    Audits will be conducted at least every three years to evaluate compliance with the CalARP regulations.\n\n\n\n    Incident investigation procedures have been established.\n\n\n\n    A written plan of action regarding the implementation of employee participation has been developed and implemented.\n\n\n\n    Hot work permits will be issued for all hot work operations conducted on or near the ammonia system, as needed.\n\n\n\n    A Contractor Safety Policy has been developed and implemented.\n\n\n\nTo ensure that the general accidental release prevention program and the chemical-specific prevention steps are implemented, the overall responsibility for the RMP elements has been assigned to the Plant Manager at the Ducor Cold Storage facility.  The Plant Manager has the overall responsibility for the development, implementation, and integration of th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 26397,
      "SummaryText": "e RMP elements.\n\n\n\nFive-Year Accident History\n\n\n\nThe Ducor Cold Storage facility has not had any accidental releases from the ammonia-based refrigeration system that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, property damage, or environmental damage in the last five years.  \n\n\n\nEmergency Response Program\n\n\n\nThe Ducor Cold Storage facility has established an emergency action plan and a chain of command to respond to emergencies and to notify emergency responders when there is a need for a response.  However, an emergency response program does not need to be developed for the facility since the Ducor Cold Storage employees will not respond to accidental releases of ammonia, the facility is included in the community emergency response plan, and appropriate mechanisms are in place to notify emergency responders.  \n\n\n\nPlanned Changes To Improve Safety\n\n\n\nThere are no safety related changes planned for the ammonia refrigeration system at the Ducor Cold Storage facility. \n\n\n\n"
    }
  ]
}