{
  "FacilityID": 26400,
  "FacilityName": "Lone Camp Gas Processing Plant",
  "FacilityStr1": "2290 Ranch Road 3137",
  "FacilityStr2": null,
  "FacilityCity": "Gordon",
  "FacilityState": "TX",
  "FacilityZipCode": "76453",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48363",
  "LEPC": "Palo Pinto  LEPC",
  "FacilityLatDecDegs": "32.67",
  "FacilityLongDecDegs": "-98.283333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.dvn.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 868344060,
  "ParentCompanyName": "Devon Gas Services, L.P.",
  "Company2Name": null,
  "CompanyDUNS": 807094289,
  "Company2DUNS": 0,
  "OperatorName": "Devon Gas Services, L.P.",
  "OperatorStr1": "PO Box 427",
  "OperatorStr2": null,
  "OperatorCity": "Gordon",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76453",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000136998",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-00760",
  "SafetyInspectionDate": "1999-03-22 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-08-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-08-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-08-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-05-24 00:00:00",
  "DeRegistrationEffectiveDate": "2019-01-01 00:00:00",
  "AnniversaryDate": "2007-08-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 32.67,
  "FRS_Long": -98.28333,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 37790,
      "AltID": "Gas Plant - 1 Process",
      "FacilityID": 26400,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 49482,
          "ProcessID": 37790,
          "ChemicalID": 155,
          "Quantity": 630000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 35704,
              "ProcessChemicalID": 49482,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 35705,
              "ProcessChemicalID": 49482,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 35706,
              "ProcessChemicalID": 49482,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 35707,
              "ProcessChemicalID": 49482,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 35708,
              "ProcessChemicalID": 49482,
              "ChemicalID": 107
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 38704,
          "ProcessID": 37790,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 21125,
              "Process_NAICS_ID": 38704,
              "SafetyReviewDate": "2002-06-30 00:00:00",
              "PHA_Date": "2001-02-27 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-12-01 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-01 00:00:00",
              "TrainingReviewDate": "1999-05-06 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-03-26 00:00:00",
              "EquipmentInspectionDate": "2001-08-30 00:00:00",
              "EquipmentTested": "compressor",
              "ChangeMgmtDate": "2002-01-17 00:00:00",
              "ChangeMgmtReviewDate": "2002-05-07 00:00:00",
              "PreStartupReviewDate": "2002-05-07 00:00:00",
              "ComplianceAuditDate": "2001-07-31 00:00:00",
              "AuditCompletionDate": "2001-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-04-10 00:00:00",
              "HotWorkPermitReviewDate": "2001-04-10 00:00:00",
              "ContractorSafetyReviewDate": "2001-04-10 00:00:00",
              "ContractorSafetyEvalDate": "1999-03-17 00:00:00",
              "CBI_Flag": 0,
              "Description": "Gas Processing Plant",
              "_chemicals": [
                {
                  "PrimaryKey": 30860,
                  "PreventionProgram3ID": 21125,
                  "ProcessChemicalID": 49482
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 26400,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2002-02-12 00:00:00",
    "ERTrainingDate": "2002-02-12 00:00:00",
    "CoordinatingAgencyName": "Local Emerg. Planning Coord.",
    "CoordinatingAgencyPhone": "9403250350",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26400,
      "SummaryText": "    LONE CAMP RISK MANAGEMENT PLAN\n\n    EXECUTIVE SUMMARY\n\nThe Lone Camp gas plant has a long-standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation and maintenance of our processes. Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. However, if a release does occur, trained personnel will respond to control and contain the release.\n\nThe Lone Camp gas plant, located 3 miles west of Lone Camp on Highway 3137 (across from the power plant on Lake Palo Pinto) in Palo Pinto County, Texas, produces natural gas liquids from natural gas. These natural gas liquids are comprised primarily of ethane, propane and butane. The plant also treats natural gas liquids to remove CO2. Some of the chemicals produced or used include methane, ethane, propane, butane, ethylene glycol and diethanolamine.\n\nOFFSITE CONSEQUENCE ANALYSIS RESULTS\n\nThere are no toxic chemicals stored at the Lone Camp gas plant above the EPA Threshold Quantity. The threshold quantity is the level set by EPA for each toxic or flammable chemical which if stored at the site requires compliance with the EPA?s Risk Management Program regulations. Generally, if the amount of a substance stored on-site is less than the threshold quantity, there is little danger to the public.\n\nThere are several flammable substances stored at the site above the 10,000 pound threshold quantity for flammables. Examples of flammables at the site include ethane, propane and butane. The worst-case scenario associated with a release of flammable materials is a vapor cloud explosion (VCE) involving the full inventory of a 30,000 gallon storage tank containing natural gas liquids. Assuming the material in the tank is primarily propane, the distance away from the plant affected in this worst-case scenario would be approximately 0.42 miles,"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26400,
      "SummaryText": " based on EPA analysis. \n\nA more probable release scenario would involve the release of natural gas condensate from a transfer line during unloading. Based on the pump capacity of approximately 150 gallons/minutes (9000 gallons in one hour), we would release approximately 1500 gallons in 10 minutes, at which time our operators or the truck driver would detect and isolate the leak. The affected distance based on EPA guidance is approximately 0.15 miles, or approximately 780 feet. \n\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM\n\nThe Lone Camp gas plant has a very active accident prevention program in place, primarily based on the OSHA Process Safety Management regulations. A summary of some of the accident prevention programs that are in place follows.\n\nProcess Safety Information\n\nThe Lone Camp gas plant keeps a variety of technical documents that are used to help maintain safe operation of the processes. These documents include material safety data sheets for all chemicals on-site, up-to-date process and instrumentation drawings, equipment data sheets on all vessels and equipment and process parameter safety limits. This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\n\nProcess Hazard Analysis (PHA)\n\nThe Lone Camp gas plant has a very comprehensive program to ensure that hazards associated with the various processes are identified and controlled. Each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards. The what-if/checklist analysis technique is used to perform these evaluations. The analyses are conducted using a team of people with operating, maintenance, engineering and safety experience. This team identifies and evaluates hazards of the process, as well as accident"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26400,
      "SummaryText": " prevention and mitigation measures, and makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary. All approved recommendations from the PHA team findings are tracked until they are completed. \n\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design and to ensure that new technology is used where appropriate, the Lone Camp gas plant periodically updates and revalidates the hazard analysis results. These periodic reviews will be conducted at least every 5 years.\n\n\nOperating Procedures\n\nThe Lone Camp gas plant maintains written procedures that address various modes of process operations. These procedures are used as reference by experienced operators, and provide a basis for consistent training of new operators. These procedures are periodically reviewed and certified as current and accurate.\n\n\nTraining\n\nOur employees at the Lone Camp plant have an average experience of over 10 years. This level of experience provides a great level of expertise throughout the facility. Ongoing training is accomplished through routine safety meetings, scheduled training in new processes and refresher training on operating procedures. \n\n\nContractors\n\nThe Lone Camp gas plant uses contractors to supplement its workforce during periods of increased maintenance or to assist with specialized projects. Contractors are advised about safety and health hazards, emergency response requirements and safe work practices prior to their beginning work. In addition, the company evaluates contractor safety programs and performance during the selection of a contractor. Gas plant personnel routinely monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\n\n\nMechanical Integrity\n\nThe Lone Camp gas plant has well-established practices and procedures to maintain our equipment in a safe operating condition. The basic aspects of thi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26400,
      "SummaryText": "s program include inspections, tests and corrections of identified deficiencies. Inspections and tests are performed to help ensure that equipment functions as intended, and to verify that equipment operates within acceptable limits. If a deficiency is identified, employees will correct the deficiency before placing the equipment back in service or they will determine what actions are necessary to ensure safe operation of the equipment.\n\n\nSafe Work Practices\n\nThe Lone Camp gas plant has long-standing safe work practices to help ensure worker and process safety. Examples of these include lockout/tagout to ensure isolation of energy sources for equipment that is being worked on, a permit and procedure for hot work and a permit and procedure for confined space entry. These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\n\n\nManagement of Change\n\nThe Lone Camp gas plant has a comprehensive system to manage changes to all covered processes. This system requires changes to items such as process equipment, chemicals, technology (including operating conditions), procedures and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to ensure that adequate controls are in place to manage any new hazards and to verify that existing controls have not been compromised by the change. Operating and maintenance personnel are provided any necessary training on the change.\n\n\n\n\nIncident Investigation\n\nThe Lone Camp gas plant promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss or personal injury. The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident.\n\n\n\nCHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe processes at the Lone "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 26400,
      "SummaryText": "Camp gas plant have hazards that must be managed to ensure continued safe operation. The following is a description of existing safety features applicable to prevention of accidental releases of specific regulated substances in the facility.\n\nThe Lone Camp gas plant has safety features on many units to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of a release. The following types of safety features are used in the covered process\n\nRelease Detection\n\n1.    Hydrocarbon detection sensors located around the facility equipment.\n\nRelease Containment/Control\n\n1.    Process relief valves to prevent vessel overpressure.\n2.    Valves (both manual and automatic) to permit isolation of the process.\n3.    Automated shutdown systems for specific process parameters (such as high pressure or high level in a vessel).\n4.    Curbing or diking to contain liquid releases.\n\n\nRelease Mitigation\n\n1.    Fire extinguishing systems. We have numerous fire extinguishers of several sizes throughout the facility. In gas plants, the control of fire is more dependent on restricting sources of fuel than on putting out the fire.\n\n\nACCIDENT HISTORY\n\nThe Lone Camp plant has not had an incident over the past five years which has impacted off-site people or structures.\n\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nThe Lone Camp gas plant maintains a written emergency response program, which is in place to protect worker and public safety. The program consists of procedures for responding to a release, including the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address all aspects of emergency response, including proper first-aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs. \n\nIn addition, the Lone Camp gas plant has procedures that address maintenance, inspection and testing of"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 26400,
      "SummaryText": " emergency response equipment, as well as instructions that address the use of emergency response equipment. Employees receive training in these procedures as necessary to perform their specific emergency response duties. The emergency response program is updated when necessary, based on modifications made to gas plant processes or other plant facilities\n\nThe overall emergency response program for the Lone Camp gas plant is coordinated with the local emergency response organizations and the emergency planning committee. This coordination provides a means to notify the public in case of an incident, if necessary, as well as facilitating quick response to an incident. The facility recently had a simulated emergency drill with the local emergency planning coordinator of Palo Pinto County and local emergency response agencies. Not only did we learn more about their capability, but they became more familiar with our operations and how to respond in case of an incident.\n\nCONCLUSION\n\nThe Lone Camp gas plant has had very safe operations over its history. However, the facility continually looks for improvements, both to the process and to safety issues at the facility. Our company is very active in promoting coordination between the local emergency response agencies and our facility personnel. Ongoing communication between our facility and the emergency responders is an integral part of our operations."
    }
  ]
}