{
  "FacilityID": 26454,
  "FacilityName": "PET Dairy",
  "FacilityStr1": "610 E. State Street",
  "FacilityStr2": null,
  "FacilityCity": "O'Fallon",
  "FacilityState": "IL",
  "FacilityZipCode": "62269",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17163",
  "LEPC": "St. Clair County LEPC",
  "FacilityLatDecDegs": "38.592028",
  "FacilityLongDecDegs": "-89.897972",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.deanfoods.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Dean Foods Company",
  "Company2Name": null,
  "CompanyDUNS": 929182210,
  "Company2DUNS": 0,
  "OperatorName": "Dean Foods Company",
  "OperatorStr1": "2515 McKinney Avenue",
  "OperatorStr2": "Suite 1200",
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75201",
  "OperatorZipCodeExt": null,
  "RMPContact": "William Schaefer",
  "RMPTitle": "Plant Manager",
  "FTE": 72,
  "OtherEPAFacilityID": "62269LNDSN610ES",
  "EPAFacilityID": "100000179772",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-04-13 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-08-19 00:00:00",
  "ErrorReportDate": "2002-08-19 00:00:00",
  "ReceiptDate": "2002-08-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-08-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-08-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 38.59201,
  "FRS_Long": -89.89797,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 37884,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 26454,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 38800,
          "ProcessID": 37884,
          "NAICSCode": "11212",
          "_desc": {
            "NAICS_CODE": "11212",
            "NAICS_DESCRIPTION": "Dairy Cattle and Milk Production"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 49623,
          "ProcessID": 37884,
          "ChemicalID": 56,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 549623,
          "ProcessID": 37884,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26454,
      "SummaryText": "PET Dairy is committed to promoting a safe operating environment for the facility, its employees and the surrounding community.  PET Dairy is complying with OSHA's Process Safety Management (PSM) standard, and EPA's Risk Management Program rule. The purpose of these regulations is to ensure that covered processes (such as ammonia refrigeration) are designed, operated, and maintained safely. Compliance with these regulations helps prevent ammonia releases from the process. Additionally, these regulations required development of procedures to minimize releases of ammonia in they event that they do occur, and to outline appropriate emergency response steps to take in the event of a release.\n\nPET Dairy has implemented a Process Safety Management program for its ammonia refrigeration process operation and maintenance.  The PSM Program has been incorporated as both policy, and most importantly, procedure in everyday operations and maintenance of the ammonia refrigeration system.\n\nThe PET Dairy \"Facility Emergency Response Plan\" has been developed in concert with the O'Fallon, Illinois Fire Department. The plan addresses fire, explosion, spills or releases of toxics, severe weather, and other criteria. The plan details response actions by the PET Dairy Emergency Response Team for such emergencies, safety and emergency equipment, communication responsibilities, and coordination with off-site responders. The plan includes \"Emergency Response to Anhydrous Ammonia,\" specifically addresssing incidents involving ammonia refrigeration.\n\nPET Dairy utilizes anhydrous ammonia as a refrigerant to maintain the proper temperature of raw materials and finished products. Anhydrous ammonia is an effective refrigerant that has been used for many years by most food processing facilities. Anhydrous ammonia is normally a gas at ambient temperatures and atmospheric pressure, but it is utilized in the refrigeration process as a gas liquefied under pressure.  \n\nPET Dairy operates an ammonia refr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26454,
      "SummaryText": "igeration system to provide product and space cooling.  The refrigeration process is controlled by a Programmable Logic Controller (PLC).  Operation of the process is described below.\n\nThe ammonia refrigeration system is operated as a single-stage system.  A High Pressure Receiver supplies high-pressure ammonia liquid to a distribution manifold.  High-pressure ammonia liquid is piped to Evaporators and Cooling Coils.  In the Evaporators (and cooling coils), high-pressure ammonia liquid flows through a liquid expansion valve where it is converted into a low-pressure, low-temperature gas.  The gas then enters the evaporator / cooling coil where it removes heat from the space or media being cooled.  This heated low-pressure ammonia vapor then flows from the evaporators / cooling coils to the Suction Accumulator via the suction header. Ammonia vapors from the Suction Accumulator are drawn to the suction / inlet side of the six Compressors.  In the Compressors, the pressure of the ammonia vapor is increased to approximately 135 to 150 psig, and the temperature of the ammonia vapor rises.  The high-pressure, high-temperature ammonia vapor flows from the Compressors to the Evaporative Condensers (5).  In the Evaporative Condensers, heat is removed from the ammonia vapor and transferred to the atmosphere, both to recycled cooling water and to the air, turning the ammonia vapor into a high pressure liquid.  The high-pressure liquid ammonia drains from the Evaporative Condensers to the High Pressure Receiver, where the cycle begins anew.\n \nPET Dairy has developed its worst-case release scenario assuming that the largest vessel, the High Pressure Receiver, has  ruptured, releasing 11,700 pounds of ammonia.  This is the maximum (100%) capacity of the High Pressure Receiver, which normally operates at only 40% liquid level.  The release rate of ammonia has been calculated to be 1,170 pounds per minute. This release has a toxic end-point of approximately 1.3  miles. This scenario"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26454,
      "SummaryText": " was developed utilizing EPA's \"Risk Management Program Guidance for Ammonia Refrigeration,\" and the International Institute for Ammonia Refrigeration (IIAR) \"Risk Management Guidelines.\" It should be noted that such a release is highly improbable, as  PET Dairy refrigeration equipment is designed, fabricated, installed and operated consistent with IIAR and ASME specifications and recommednations. Precautions that would make such a scenario unlikely include: ammonia is not corrosive in these service conditions; pressure relief safety valves limit the operating pressures in this vessel; the prevention program in place at the facility includes a mechanical integrity program for regular maintenance, testing and inspection; installed ammonia sensors warn of leaks in the process; and, an emergency response team, plan, and equipment is in place at the facility.  \n\nPET Dairy has developed its alternative release scenario assuming that the a pipe leak has discharged at a rate of 110 pounds per minute for ten minutes. This release has a toxic end-point of 0.1 miles.\n\nThere have been no releases of ammonia from the refrigeration systems during the past five years.\n\nThe PET Dairy emergency response program is based on the OSHA requirements for Emergency Action Plans (29 CFR 1910.38 and 1910.119).  We have trained employees for emergency response and maintain a written response plan. The plan is coordinated with the O'Fallon Fire Department. We conduct periodic drills for implementation of the emergency response plan at the facility, and anticipated increased participation with the LEPC and Fire Department."
    }
  ]
}