{
  "FacilityID": 26465,
  "FacilityName": "NEBRASKA TURKEY GROWERS COOPERATIVE",
  "FacilityStr1": "12 LAWN AVE",
  "FacilityStr2": "P.O. BOX 0640",
  "FacilityCity": "GIBBON",
  "FacilityState": "NE",
  "FacilityZipCode": "68840",
  "Facility4DigitZipExt": "0640",
  "FacilityCountyFIPS": "31019",
  "LEPC": "Gibbon Volunteer Fire Dept.",
  "FacilityLatDecDegs": "40.652139",
  "FacilityLongDecDegs": "-99.42675",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A6",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": "ntg@nctc.net",
  "FacilityDUNS": 7270226,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "NEBRASKA TURKEY GROWERS COOPERATIVE",
  "OperatorStr1": "12 LAWN AVE",
  "OperatorStr2": null,
  "OperatorCity": "GIBBON",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68840",
  "OperatorZipCodeExt": "0640",
  "FTE": 85,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000179807",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-06-03 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2002-08-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-08-19 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2002-08-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-01-06 00:00:00",
  "DeRegistrationEffectiveDate": "2013-11-04 00:00:00",
  "AnniversaryDate": "2007-08-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 40.747468,
  "FRS_Long": -98.850302,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 37897,
      "AltID": "INTERCONNECTED VESSELS",
      "FacilityID": 26465,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 49636,
          "ProcessID": 37897,
          "ChemicalID": 56,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 38813,
          "ProcessID": 37897,
          "NAICSCode": "311615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 21197,
              "Process_NAICS_ID": 38813,
              "SafetyReviewDate": "2002-07-12 00:00:00",
              "PHA_Date": "2002-06-24 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-08-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-07-23 00:00:00",
              "TrainingReviewDate": "2002-05-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-06-12 00:00:00",
              "EquipmentInspectionDate": "2002-06-28 00:00:00",
              "EquipmentTested": "compressors",
              "ChangeMgmtDate": "2002-07-12 00:00:00",
              "ChangeMgmtReviewDate": "2002-07-12 00:00:00",
              "PreStartupReviewDate": "2002-07-12 00:00:00",
              "ComplianceAuditDate": "2002-07-12 00:00:00",
              "AuditCompletionDate": "2002-08-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2002-05-12 00:00:00",
              "HotWorkPermitReviewDate": "2002-07-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2002-03-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 30974,
                  "PreventionProgram3ID": 21197,
                  "ProcessChemicalID": 49636
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 26465,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Gibbon Volunteer Fire Department",
    "CoordinatingAgencyPhone": "3084685556",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26465,
      "SummaryText": "On October of 2001 Nebraska Turkey Growers discovered that their total system for refrigeration exceeded the threshold value of 10,000 lbs. In December of 2001 Nebraska Turkey Growers began working on their PSM and RMP program. These programs have been implemented as each program progressed. Nebraska Turkey Growers is committed in its goals to keep each employee safe and the surrounding community. With the implementation of these programs it should also be known that Nebraska Turkey Growers is just over the threshold level for reporting. With the system holding having the total capacity of approximately 15,000 lbs. .  Nebraska Turkey Growers as stated above is committed to our employees and surrounding community has implemented all areas of Risk Manangement and Process Safety. More importantly Nebraska Turkey Growers will continue to comply with all Government regulations to ensure 100% compliance within the Gibbon community.\n                                                                                                                                                                            Accidental Release Prevention and Emergency Response Protocols:  The owners, management and employees of Nebraska Turkey Growers are committed to providing a safe workplace free of accidental releases of anhydrous ammonia. Health, safety and environmental compliance are a fundamental part of every employee's job. It is facility protocol to adhere to applicable Federal, State and local laws and to implement appropriate controls to prevent accidental releases of anhydrous ammonia. If an accidental release were to occur, the facility would respond in accordance with its Emergency Action Plan and is prepared to work with the local fire department, the Local Emergency Planning Committee and other authorities to control and mitigate the release and minimize the impact of the release to employees, the environment and the general public.\n\nStationary Source and Regulated Substances Ha"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26465,
      "SummaryText": "ndled:  The primary activity at this facility is the use of ammonia for refrigeration. Anhydrous ammonia is received, stored and used to refrigerate product produced by this company. The maximum potential of quantity stored at any given time is 15,000 pounds. This poundage is split between a receiving tank and piping and the system. The system runs at its maximum efficiency at 75%.\n\nWorst Case Release Scenario and Alternate Release Scenario: The worst case scenario would be a release of the total contents of our receiving tank which holds approximatly 9600 pounds which holds 1000 gallons. The distance to the toxic end point is .4 miles. There was one administrative control considered in this scenario; which is the tank is not filled more than 75% full. This measure then states the worst case release would be 7200 pounds. There were no passive mitigation measures considered.\n\nThe alternative release involves the release of ammonia from a break/rupture of a numerous amount of piping and accumulators. The quantity released in a gas form would be approximatly 5000 pounds. The resulting distance to the toxic endpoint is .7 miles. There were no passive mitigation measures to consider this scenario.\n\nGeneral Accidental Release Prevention Program Steps: This facility complies with EPA's accidental release prevention requirements and OSHA's Process Safety Management Program requirements and applicable State and Local codes and regulations. The following sections briefly describe the elements of the release prevention program for the primary activity at this facility. \n\n1) Safety Information:  The facility was designed and constructed in accordance with Federal and State regulations and codes. All plans and procedures maintained at the facility are periodically reviewed by facility management for safety updates and changes. Material Safety Data Sheets, equipment specifications and the codes and standards used to build and operate the anhydrous ammonia equipment are maintained"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26465,
      "SummaryText": "at the facility.\n\n2) Hazard Review:  Facility management conducts reviews of the hazards associated with the handling and storage of ammonia. The reviews identify the opportunity for equipment malfunctions or human errors that could cause an accidental release, the safeguards used to control hazards and prevent releases, and the steps used to detect or monitor releases. The results of the reviews are documented and problems identified  addressed in a timely manner.\n\n3) Operating Procedures: The facility maintains written operating procedures for the use of anhydrous ammonia. The procedures generally follow the provisions of the Occupational Safety and Health Administration standards. The written procedures are reviewed by facility management on a regular basis and revised as necessary.\n\n4) Training: All employees participate in a training program. Initial training for new employees consists of classroom type instruction and on-the-job supervision. Refresher training for all employees is conducted at least once every (1) year. The training program is reviewed by management on a regular basis and revised as necessary.\n\n5) Maintenance: The facility maintains written equipment inspection and maintenance procedures. Storage and process equipment inspections are performed by qualified personnel on an approximate annual basis and are documented. Equipment maintenance procedures follow either instructions furnished by the equipment manufacturer or vendors, Federal or State regulations. The written procedures will be reviewed by management on a regular basis and revised as necessary.\n\n6) Compliance Audits: As required by the RMP rule, compliance audits will be performed at least once every three (3) years. The audit will be conducted and documented by a person knowledgeable in the safe handling of anhydrous ammonia. Corrective actions required as a result of each compliance audit will be performed promptly and documented.\n\n7) Incident Investigation: Facility management will"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26465,
      "SummaryText": "investigate each incident that results in, or could have reasonably resulted in a catastrophic release of anhydrous ammonia. The investigation will be performed to identify the situation leading to the incident as well as corrective actions to prevent the release from recurring. Investigation reports will be retained for a period of 5 years.\n\n8) Process Safety Information: The process equipment was designed and constructed in accordance with applicable Federal and State regulations. All plans and procedures for operating the process equipment are periodically reviewed by management for safety updates and changes. Material Safety Data Sheets, equipment specifications and the codes and standards used to build and operate the process equipment are maintained and updated.\n\n9) Process Hazard Analysis: Management conducts reviews of the hazards associated with the process. The process hazard analysis reviews identify the opportunity for equipment malfunctions or human errors that could cause an accidental release, the safeguards used to control hazards and prevent releases, and the steps used to detect or monitor releases. The results of the process hazard analysis are documented and problems identified are addressed in a timely manner.\n\n10) Operating Procedures: Written operating procedures for the process are readily accessible to workers who operate and maintain the process equipment. The operating procedures are periodically reviewed and revised as necessary so that they reflect current practices and changes to the process or equipment.\n\n11) Training: All operators of the process equipment participate in a training program. Initial training consists of classroom type instuction that covers health and safety hazards, emergency operations and safe work practices. In addition each operator is trained by the supervisor in charge to ensure the knowledge of the employee. Refresher training for all employees is conducted on an annual basis. The training program will be revi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 26465,
      "SummaryText": "ewed by management on a regular basis and revised as necessay.\n\n12) Mechanical Integrity: A written mechanical integrity program is used to maintain the ongoing integrity of the process equipment. Each employee involved in maintaining the ongoing integrity of process equipment is trained in an overview of the process and its hazard and in the procedures applicable to the employee's job tasks so that the employee can perform the tasks in a safe manner. Inspections and tests are performed on process equipment following recognized and generally accepted good engineering practices. The frequency of inspections and tests on process equipment is consistent with applicable good engineering practices. Documentation of each inspection and test on process equipment is maintained in the appropriate format. Appropriate checks and inspections are performed so that equipment is installed properly and consistent with design specifications and manufactors instructions.\n\n13) Management of Change: Written procedures are used to manage changes to process chemicals, technology, equipment and procedures. The written procedures address the following: technical basis of the proposed change; impact of change on safety and health; modifications to operating procedures; necessary time period for change; and, authorization requirements for the proposed change. Employees involved in the operating process and maintenance and contract employees whose job tasks will be affected by a change in the process are trained and informed of the change prior to start-up of the process or affected part of the process. Safety information and operating procedures are updated accordingly.\n\n14) Pre-Startup Review: Written modification to a new stationary source or modified stationary source is significant enough to require a change in process safety information, a review of pre-startup safety is performed. The pre-startup safety review includes the a review of the following: construction and equipment is in acc"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 26465,
      "SummaryText": "ordance with design specifications: safety, operating, maintenance and emergency procedures are in place and are adequate; for a new stationary source, a process hazard analysis has been performed and recommendations have been resolved or implemented for startup; and, training of each employee involved in operating a process has been completed.\n\n15) Compliance Audits: As required by the RMP rule, compliance audits will be performed at least once every three (3) years. In addition Nebraska Turkey Growers will conduct additional audits on an one (1) year basis until it is completely satisfied of total compliance. Audits will be conducted and documented by a person knowledgeable in the process. Corrective actions required will be performed promptly and documented.\n\n16) Employee Participation: A written plan of action regarding employees will be made readily accessible to workers who operate and maintain the process equipment. Employees participate in training programs and have access to information developed under risk management and process safety rules.\n\n17) Hot Work Permits: Hot work permits are issued on an as-needed basis. Hot work permits may be issued for general welding/fabrication purposes and electrical work. Welding/fabrication and electrical work is completed by experienced personnel.\n\n18) Contractors: If a contractor is needed to perform work on or around process equipment, information regarding the safety performance of the contractor is obtained and evaluated. Before access to process equipment is given to a contractor, the protocol is to inform the contractor about potential hazards associated with the process, entrance and exit control and emergency response activities. Additionally, the contractor must act responsibly.\n\nFive-Year Accident History: There have been no accidental releases of anhydrous ammonia in the past five (5) years that have caused deaths, injuries, or significant property damage to our facility, nor, to our knowledge, resulted in of"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 26465,
      "SummaryText": "fsite deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.\n\nEmergency Response Program: In the event of an emergency, it is facility protocol to notify the local fire department and other emergency responders and request that they respond to the emergency. Facility employees will not respond to accidental releases of anhyrdrous ammonia except for those that are small or incidental, that can be controlled at the time of the release by employees in the immediate release area (e.g., shutting a valve) and do not appear to pose an immediate safety or health hazard. This protocol has been discussed with the local fire department and the facility has appropriate measures in place to notify the emergency responders when there is a need for response. The facility is also included in the written community emergency response plan developed under the Emergency Planning and Community Right-to-Know Act (EPCRA).\n\nPlaned Changes to Improve Safety: There are no specific anhydrous ammonia safety changes planned at this time. However, safety improvement is an on-going process at Nebraska Turkey Growers. Periodic evaluations are performed to assess the safety of equipment and procedures.\n\n\n\nCertification Statement for Program Level 2 & 3 Processes:\n\nTo the best of the undersigned's knowledge, information, and belief formed after reasonable inquiry, the information submitted is true, accurate, and complete.\n\n-------------------------------------------                                         ------------------------------------------------\nSignature                                                                                   Print Name\n\n\n-------------------------------------------                                         ------------------------------------------------\nTitle                                                                                            Date"
    }
  ]
}