{
  "FacilityID": 2660,
  "FacilityName": "Granite City Regional Waste Water Treatment Plant",
  "FacilityStr1": "Charles Melvin Price Support Center",
  "FacilityStr2": "IL. Rt. #3 & Niedringhaus Ave.",
  "FacilityCity": "Granite City",
  "FacilityState": "IL",
  "FacilityZipCode": "62040",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17119",
  "LEPC": "Madison County LEPC",
  "FacilityLatDecDegs": "38.655056",
  "FacilityLongDecDegs": "-90.276",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Granite City, IL.",
  "Company2Name": "NA",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Granite City",
  "OperatorStr1": "2000 Edison Ave",
  "OperatorStr2": null,
  "OperatorCity": "Granite City",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62040",
  "OperatorZipCodeExt": null,
  "FTE": 28,
  "OtherEPAFacilityID": "IL0033481",
  "EPAFacilityID": "100000032136",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "119040ACC",
  "SafetyInspectionDate": "1996-05-23 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2006-06-09 00:00:00",
  "DeRegistrationEffectiveDate": "2006-04-04 00:00:00",
  "AnniversaryDate": "2004-06-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 38.6972,
  "FRS_Long": -90.1917,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2975,
      "AltID": "Chlorination, WWTP",
      "FacilityID": 2660,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 3176,
          "ProcessID": 2975,
          "ChemicalID": 62,
          "Quantity": 47000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 3040,
          "ProcessID": 2975,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 936,
              "Process_NAICS_ID": 3040,
              "SafetyReviewDate": "1998-01-27 00:00:00",
              "PHA_Date": "1999-06-30 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-01-27 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Water fog application, (hand lines or monitor)",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "System Control and Data Aquisition System (SCADA)",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-02 00:00:00",
              "TrainingReviewDate": "1998-10-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "On Job Training",
              "MaintenanceReviewDate": "1999-04-15 00:00:00",
              "EquipmentInspectionDate": "1999-03-15 00:00:00",
              "EquipmentTested": "Liquid lines, Vapor ;ines and purge lines.  The emergency shut-off vakves.",
              "ChangeMgmtDate": "1999-03-15 00:00:00",
              "ChangeMgmtReviewDate": "1999-03-12 00:00:00",
              "PreStartupReviewDate": "1999-03-29 00:00:00",
              "ComplianceAuditDate": "1999-01-27 00:00:00",
              "AuditCompletionDate": "1999-06-30 00:00:00",
              "IncidentInvestigationDate": "1992-07-06 00:00:00",
              "InvestigationChangeDate": "1992-07-12 00:00:00",
              "ParticipationPlansReviewDate": "1998-10-13 00:00:00",
              "HotWorkPermitReviewDate": "1998-12-15 00:00:00",
              "ContractorSafetyReviewDate": "1999-01-15 00:00:00",
              "ContractorSafetyEvalDate": "1999-01-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1060,
                  "PreventionProgram3ID": 936,
                  "ProcessChemicalID": 3176
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 2660,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-15 00:00:00",
    "ERTrainingDate": "1998-10-25 00:00:00",
    "CoordinatingAgencyName": "Granite City Fire Dept.",
    "CoordinatingAgencyPhone": "6188776114",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "IL NPDES # IL0033481 &  IL. Incinerator Permit # 76020236  &  Haz Waste Hauling # 0556"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 2660,
      "SummaryText": "ikely and the failure of the piping would immediately be detected by the chlorine leak detection system, resulting in the automatic shutdown of the chlorine line at the source vessel.  Due to the fact that the process utilized on site relies on the vapor lines, which are monitored for automatic shutdown on detection, and not the liquid feed lines, a piping failure on the tank would not allow for a catastrophic release.  The protection provided on this line is as follows.\n1. The automatic shut-off valve is located less than one foot from the point of discharge from the source    vessel.  This keeps the total amount released at less than one pound.\n2. The remaining piping sections are directly connected to the Chlorinator\u0012s \n    suction line, eliminating the opportunity for release to the atmosphere.\n\nThe amount that may be expected to be released in a full tank failure could reach 120 lb./min, for 250 min., amounting to a total of 30,000 lb. only in the event of a total tank failure.  There is no adjacent equipment or processes that could affect the integrity of the tank.  \nThe vapor cloud could reach an end-point of 2.30 miles, but the model utilized takes all factors into consideration and places the bulk of the discharge into an area deemed as having the least population density, compared to the other areas within the end-point range.  The prevailing winds and the land configuration provide a positive, natural method for dissipation of a resulting vapor cloud.  As the model calculations state, the vapor would have to cross an initial levy wall, the Chain of Rocks Canal, a second levy wall, then the Mississippi River before it reaches any populated area.  The configuration of the levies, and contact with the canal and or river alone provide a plus in the control of the vapor.  It should also be noted that if the liquid were released into the sub-grade basement of the Chlorine building, any liquid entering the drain would automatically be re-routed to wet-well #2 an"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2660,
      "SummaryText": "d additional liquid would automatically go back into the treatment process of the plant, resulting in a high dilution rate of the Chlorine within the confines of the plant system.  The vapor would be confined within the building to a point, and escaping vapor would be controlled via the use of two-1 = inch fire hose, equipped with water curtains and or variable gpm fog nozzles.  These lines are positioned so that they may be placed where needed, utilizing the water curtains or handled by the on site Haz Mat team.  The Haz Mat team is made up of all persons assigned to the loading, and unloading of the Chlorine and also the Maintenance department and all management members.  The City Fire Department is also trained in the mitigation and emergency handling of Chlorine, including capping, plugging and control of one ton chlorine vessels.  In addition, a fire apparatus is kept on site so that it can be strategically placed where necessary in order to control the vapor cloud. \nThe probability analysis model utilized was the Automated Resource for Chemical Hazard Incident Evaluation (ARCHIE)  The calculations were completed as directed by the Handbook of Chemical Hazard Analysis Procedures, jointly published by FEMA, DOT, and EPA. \nAlthough this scenario is highly improbable, due to the configuration of the system and the safety features, the scenario is recognized as a possibility.\n\nAlternative Release Scenario:\n\nThe alternative release scenario involves the failure of a 2,00 lb. (1 ton) cylinder.  One ton cylinders are utilized for backup in the event the larger Chlorine tank goes down for repair or runs low on material.\nThe scenario would involve the failure of a rupture disk/relief valve.  This failure would allow for the release of a maximum of 2,000 lb., at a rate of 92.0 lb. Per minute.  The release duration would be approximately 21.6 min. and would travel at approximately 1.5 m/sec.  The end point for this release would be 2.0 miles.  The control of this type o"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 2660,
      "SummaryText": "Executive Summary\n\nAccidental Release Prevention and Emergency Response Policies:\n\nThe Granite City Regional Waste Water Treatment Plant has developed many strategies regarding chemical safety, both within the structure of the City Safety program and the site specific control factors.  The written safety programs utilized at the GCRWWTP that apply to the areas of chemical safety include the following.\n\n1. General Safety Program\n2. Hazard Communications / Employee Right to Know Program\n3. Personal Protective Equipment Program\n4. Respiratory Protection Program\n5. Laboratory Safety Program\n6. Hazard Assessment Program\n7. Process Safety Plan\n8. Emergency Response / Contingency Plan\n9. Lock out / Tag Out (Chlorine line repairs)\n\nSpecialized training provided includes the following:\n\n1. 1910.120 HAZWOPER for site Response Team and all Management members.\n2. Full, on-site release scenario (at least annually), including local fire department, army base response persons, the LEPC and the local hospital.\n3. Respiratory training including SCBA utilization in a full level A suit-up condition.\n4. Fire Extinguisher training.\n5. Utilization of on-site fire apparatus for release control, including chlorine vapor cloud disbursement, total flooding applications, fire fighting and victim decontamination.\n6. Emergency shut-down procedures for release scenario. (at least annually)\n7. First aid and rescue training regarding chlorine exposure for victim removal, treatment and quick response decontamination.\n\n\n\n\nThe management of the Granite City Regional Waste Water Treatment Plant is committed to the application of strong, time-proven strategies regarding chemical safety.  The on-site program is part of the City of Granite City\u0012s overall approach to the protection of its employees and constituents against chemical exposure as well as other hazards.  The GCRWWTP falls within the regulatory scrutiny of the Illinois Department of Labor/OSHA as a public entity, and as such, complies with all"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 2660,
      "SummaryText": "artment.\n4.  The City Fire Department, based on the report received determines the\n     need to contact adjoining departments and or the Madison County Illinois\n     LEPC.\n5.  In addition the Granite City emergency evacuation procedures are \n     activated.  These procedures include a coordinated effort on the part\n     of the City, Police, Fire, Emergency management office of the city and the \n     Madison County Illinois LEPC.  Evacuation notification includes sirens,\n     area notification by officers and firefighters and a priority link to \n     television and radio broadcasts.  In addition, the siren system is equipped \n     with a full speaker system.  This allows for specific directions, warnings\n     and verbal communications to be broadcast to the community.\n6.  The City of Granite City also maintains a city action team made up \n     of primary department management personnel and select trained\n     employees.\n\nAll site employees take part in an annual full dress out drill involving a Chlorine release.  This drill is videotaped and a post drill critique is held in order to review its successes and shortcomings.  Areas identified as needing improvement are addressed by the management members of all entities involved.  The drill also involves the U.S. Army base security department, fire department and safety department.  Granite City entities include the fire department and police department.  \n\nPlanned Changes to Improve Safety:\n\nCurrent specifications for a major site re-build are in process.  Some of the studies in process and considerations being made include the following:\n1. Replacement of the primary bulk tank with a complete one ton process.\n2. Scrubber installation on the existing bulk storage building.\n3. Replacement of the Chlorinating process with an alternative process.\n4. Change of the air exhaust system with a higher exchange rate and\n     a different location.\n5.  New anchoring brackets for the bulk storage tank.\n\nRecent upgrades made on the s"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 2660,
      "SummaryText": "ystem include the following:\n1. New emergency shut off valves on the vapor feed line.\n2. Four new bulk storage valves."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2660,
      "SummaryText": "applicable regulations.  In addition, the LEPC for Madison County Illinois, requires all site plans and MSDS\u0012s to be up to date and  response parameters to be realistic.  This facility also retains a consultant who is responsible for keeping the site up to date on regulations in the areas of safety and environmental issues.\n\nThe Facility and Regulated Substances Handled:\n\nThe Granite City Regional Waste Water Treatment Plant is located on Illinois Route 3 & Niedringhaus Avenue, in Madison County, Illinois.  The physical plant is located within the confines of the Charles Melvin Price Support Center, U.S. Army Base.  The only regulated substance utilized on site in trigger amounts is Chlorine (CAS no. 7782-50-5), in a quantity not exceeding 47,000 pounds.  The material is stored in a sub-grade level tank within a controlled and monitored building.  The tank is an ASTME designed vessel with a design pressure of 300 psig and has a capacity to store 55 tons of chlorine.  Standard inventory is monitored by load cells.  The tank is equipped with a 225 psig Chlorine Institute approved safety valve which discharges to the building exterior.  Peak use during high storm water periods may reach 120,000 lb./yr.; where minimum use may only reach 60,000 lb./yr.  The material is used for chlorinating and treating of the waste water prior to discharge to the Chain of Rocks Canal / Mississippi River.  \nThe layout of the facility provides a positive vehicle for the control of a release due to the fact that it sets in a low-lying area, adjacent to a levy.  This allows for tracking and control of a low hanging vapor cloud, due to the prevailing winds in order to contain the cloud for dissipation and neutralization.  \n\n\n\n\n\nWorst Case Release Scenario:\n\nThe worst case release scenario which could feasibly be encountered would be the total release due to a mechanical piping failure or tank failure of the main storage tank in the Chlorine building.  The failure of the tank is highly unl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 2660,
      "SummaryText": "f release would be handled by the on site Haz Mat team, and or trained members of the city fire department.  A one ton Chlorine response kit is maintained on site and all members of the team are trained in all aspects of the kit usage, at a Level A entry capacity.  As stated in the worst case scenario, the control of this type of release would be well handled and immediate.  The utilization of water fog application is expected to reduce the vapor by at least 50% in concentration.  The application of emergency control devices from the one ton kit would also allow for the control of a leaking cylinder.  Two privately held response teams are readily available for call-out response.  Both teams are within 20 miles of this site.  Countermeasures for vapor travel in other directions will be discussed in proceeding sections of this summary.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps:\n\nThe Granite City Regional Waste Water Treatment Plant is governed by many regulations.  The following is a partial list of those that primarily impact the quality and completeness of our chemical safety provisions.\n1. OSHA 1910.119 PSM\n2. OSHA 1910.120 (HAZWOPER)\n3. Employee Right to Know, Haz. Com.\n4. Emergency Planning and Community Right To Know (EPCRA)\n5. USEPA 40 CFR Part 68, CAA\n\nThe GCRWWTP utilizes many policies, procedures and SOPs in order to maintain a good prevention program.  The following areas make up a partial list of the guidelines followed.\n\nChlorine Tanker Unloading\n\n1.  The Chlorine is ordered by the Assistant plant Superintendent.  He then notifies the U.S. Army base of the delivery time and date.\n2.  The U.S. Army base is notified of the tanker delivery, and a post guard escorts the tanker to the unloading facility.\n3.  Upon arrival of the tanker, the maintenance unloading crew sets up for \n     receiving the Chlorine.  All emergency response equipment is set at a \n     staging area in readiness.  This equipment includes SCBAs,"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 2660,
      "SummaryText": "a one ton \n     repair kit, level A suits and accessible water lines.\n4.  A vacuum is pulled on the system, and all process lines are isolated.\n5.  The liquid lines are hooked to the tanker truck.\n6.  At this point the valves are cracked open on the tanker truck on the liquid\n     side.\n7.  The truck and lines are checked for leaks using a baume ammonia\n      solution.\n8.  Once confirmation is gained on a no leak situation, the liquid lines\n     are opened one full turn.\n9.  The bulk storage tank scale is observed until an equalization is attained.\n10.  At this point, air is supplied to the tanker, which forces the Chlorine\n      into the storage tank.  A back-up compressor is utilized in order to\n      assure that no chlorine is backed up into the air line.\n\n11.  The flow rate of transfer (120 - 140 lb./min) is gauged until off loading is \n       completed.\n12.  After transfer is completed, the bulk storage valves and transfer valves\n      shut down and a vacuum is pulled on the system.\n13.  Once a vacuum is established, the loading lines are disconnected from\n      the tanker and are then capped off. \n\nThe primary practices and installations utilized in the Chlorine process that most impact the safety of the system are as follows.\n1. Written procedures\n2. Closely followed routine.\n3. Weekly inspections of all associated valves, piping and storage vessels.\n4. Detection and monitoring systems that include the chlorinating room and \n     storage basement.  The monitors are read locally at the detection point and \n     at the plant monitoring station in the plant lab area.  These monitoring \n     points include the shut-off valves, tank lines, and chlorinator\u0012s status.\n5.  An on site weather station monitors specific conditions such as wind speed and direction,  temperature, barometric pressure, and rainfall.    \n6.  Operating procedures are reviewed semi-annually in order to keep\n     procedures accurate.  In addition, the procedures are practiced each time\n     Chlo"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 2660,
      "SummaryText": "rine is transferred.\n7.  Low and high pressure is constantly monitored on the tanks, piping and\n     loading lines.\n8.  All liquid and vapor lines have built-in expansion chambers.\n9.  The one ton cylinders on site are positioned so as to supply back up\n     for the primary system.  The switch-over to back-up could be\n     done instantaneously in the event of a primary system failure or problem.\n10. Vapor release direction, because of a liquid release in the basement could \n      be controlled through the utilization of one or both of the exhaust fans in\n      the building.  The controlled vapor could be diluted through applied water\n      fog streams at these points.\n\n11.  The primary storage tank is sonic tested bi-annually.\n\n\n\n\n\n\nFive Year Accident History:  \n\nNo accidents have occurred in the last five years.  The last incident involved a tanker and occurred in 1993.  The release amounted to approximately 10 pounds.  No onsite or off site injuries or exposures resulted from this release.  A check valve was installed in the system in order to keep the same release from occurring.\n\nThe Emergency Response Program:\n\nThe on site emergency response program is designed to supply proactive measures as well as reactive procedures.  All employees involved in the Chlorine process, including maintenance and management are fully trained within OSHA 1910.120 (HAZWOPER), as are the Fire Department and EPC members who may respond.  \nAll detection equipment on site is remotely and locally monitored in order to notify all on site employees.  Upon notification of a release, the location is verified and an immediate inspection is made in order to determine the extent or immediacy of the release.  If the release can not be controlled and migration of the material is eminent, the following notifications are made.\n1. All on-site employees\n2. U.S. Army Base Security and the base fire department.  This activates the \n     base evacuation procedures.\n3.  The City of Granite City Fire Dep"
    }
  ]
}