{
  "FacilityID": 26648,
  "FacilityName": "ConAgra Frozen Prepared  Foods",
  "FacilityStr1": "200 Banquet Drive",
  "FacilityStr2": null,
  "FacilityCity": "Marshall",
  "FacilityState": "MO",
  "FacilityZipCode": "65340",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29195",
  "LEPC": null,
  "FacilityLatDecDegs": "39.097778",
  "FacilityLongDecDegs": "-93.202778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "UN",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7134513,
  "ParentCompanyName": "ConAgra Frozen Foods",
  "Company2Name": null,
  "CompanyDUNS": 7258908,
  "Company2DUNS": null,
  "OperatorName": "Bryan Cooke",
  "OperatorStr1": "200 Banquet Drive",
  "OperatorStr2": null,
  "OperatorCity": "Marshall",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "65340",
  "OperatorZipCodeExt": null,
  "FTE": 700,
  "OtherEPAFacilityID": "MOD985774595",
  "EPAFacilityID": "100000046997",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-01-09 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Marshall, MO",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2002-09-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-09-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2002-09-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-09-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 39.121719,
  "FRS_Long": -93.199928,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 38200,
      "AltID": "Main Plant",
      "FacilityID": 26648,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 50368,
          "ProcessID": 38200,
          "ChemicalID": 56,
          "Quantity": 115000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 39116,
          "ProcessID": 38200,
          "NAICSCode": "311412",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 21406,
              "Process_NAICS_ID": 39116,
              "SafetyReviewDate": "2001-08-30 00:00:00",
              "PHA_Date": "2004-06-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-03-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Ammonia sensors in new blast freezers",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-03-05 00:00:00",
              "TrainingReviewDate": "2001-08-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "offsite",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-05-01 00:00:00",
              "EquipmentInspectionDate": "2001-09-01 00:00:00",
              "EquipmentTested": "Vessel, Oil seperators",
              "ChangeMgmtDate": "2002-10-01 00:00:00",
              "ChangeMgmtReviewDate": "2001-08-30 00:00:00",
              "PreStartupReviewDate": "2002-03-15 00:00:00",
              "ComplianceAuditDate": "2001-08-30 00:00:00",
              "AuditCompletionDate": "2002-03-05 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-08-30 00:00:00",
              "HotWorkPermitReviewDate": "2001-08-30 00:00:00",
              "ContractorSafetyReviewDate": "2002-02-28 00:00:00",
              "ContractorSafetyEvalDate": "2001-08-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 31624,
                  "PreventionProgram3ID": 21406,
                  "ProcessChemicalID": 50368
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 38201,
      "AltID": "Freezer Warehouse",
      "FacilityID": 26648,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 50369,
          "ProcessID": 38201,
          "ChemicalID": 56,
          "Quantity": 32000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 39117,
          "ProcessID": 38201,
          "NAICSCode": "311412",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 26648,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-07-01 00:00:00",
    "ERTrainingDate": "2002-02-11 00:00:00",
    "CoordinatingAgencyName": "Marshall Fire Department",
    "CoordinatingAgencyPhone": "6608863312",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26648,
      "SummaryText": "CON AGRA RISK MANAGEMENT PROGRAM DOCUMENT\n\nThis document contains all required information in order to meet 40 CFR 68 Risk Management Program including an Executive Summary and RMP data elements (68.155 through 68.185).  \n\nEXECUTIVE SUMMARY\n\n1.0\tRelease Prevention and Emergency Response Policies\n\nThe ConAgra Frozen Prepared Foods (CFF) facility in Marshall, Missouri has a good record in preventing releases of anhydrous* ammonia.  The CFF facility has a thorough emergency training program for on-site emergency responders.  The facility has implemented CFF's HAZWOPER plan (emergency response program) which is a plan designed for the safety of its employees', the community and the environment.  This detailed emergency response program includes procedures for handling an emergency - the established action plan and appropriate personnel involved in containing a hazardous release (HAZMAT team).  As part of this emergency response program, CFF emphasizes a thorough training program and medical surveillance of the HAZMAT team prior to and after an incident.  With the potential dangers associated with a hazardous chemical release, CFF has researched and developed safe containment and disposal procedures as well as an evaluation procedure following an emergency response.  All of these components make the CFF HAZWOPER plan a thorough and comprehensive plan for release prevention and emergency response.\n\nThe emergency response policies at the CFF facility ensure that there is emergency response coverage 24 hours - 7 days per week.  There are also provisions for coordination with outside agencies such as the Marshall Fire Department in the event of an emergency.\n\n*From this point in the Executive Summary, anhydrous ammonia will be synonymous with ammonia."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26648,
      "SummaryText": "2.0\tProcess Description and Regulated Substances\n\nCFF is a producer of prepared frozen food products, specifically dinners, entrees, and specialty products.  The NAICS code for these processes at this facility is 311412.   The facility is capable of producing and packaging various chicken products, pot pies, and frozen meals for consumer intake.   Many areas of the plant are refrigerated to preserve the food products. \n\nCFF has one regulated substance under 40 CFR 68: ammonia.  Ammonia is used as a refrigerant in the refrigeration of the foods in the various areas of the plant.\n\nThe ammonia threshold for triggering applicability to 40 CFR 68 is 10,000 pounds. The quantity of ammonia stored on-site is approximately 147,000 pounds.  Thus, 40 CFR 68 is applicable to the ConAgra Frozen Prepared Foods (CFF) plant in Marshall, Missouri.\n\n\n3.0\tWorst-case and Alternative Release Scenarios\n\nWorst-Case Scenario Description\n\nThe largest potential release of ammonia will occur with a one-inch diameter puncture in the liquid portion of the vertical high-pressure receiver located just outside of the new engine room (NE side of the plant) at ground level.  Taking the specific definition of the worst-case from 40 CFR 68.25, the largest quantity of ammonia that can be stored in a vessel is in the high-pressure receiver during a pump-out situation.  The total quantity of ammonia that can be stored in the high pressure receiver is 25,549 pounds with administrative controls (limited to top of 8¿ stand pipe).  It is assumed that 25,549 pounds is released to the atmosphere in 10 minutes.  For the worst-case release, the release height must be zero feet.  Therefore, the worst-case release of 25,549 pounds is modeled as if it originates at ground level. Refined computer modeling shows that the release would reach offsite endpoints and nearby receptors.\n\nAlternative Release Scenario Descri"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26648,
      "SummaryText": "ption - Main Plant\n\nThe alternative release scenario that meets both selection criteria is an ammonia release from Intermediate Cooler guage on the pump liquid line.  The diameter of the release orifice is assumed to be ¼¿.  The pipe would break in such a way as to produce a horizontal jet release.  The Intermediate Cooler is located on the ground next to the new engine room (5.4 ft above ground).  There is no applicable administrative controls or passive mitigation.  Active mitigation of the release is human intervention (pipe repaired or system shutdown at 20 minutes from the start of the release.  \tOur calculations showed that the ammonia release rate is 32.5 lb/min.  The ammonia is released as a liquid/vapor mixture. \tExhibit 4-5 of the Model Risk Management Plan for Ammonia Refrigeration Facilities (April 1998) was used to determine the distance to endpoint. The release would reach offsite endpoints and nearby public receptors.\n \nAlternative Release Scenario Description - Freezer Warehouse\n\n\tThe alternative release scenario that meets both selection criteria is an ammonia release from the liquid space in a high pressure receiver through a pipe that is attached to the sight glass.  The pipe would break in such a way as to produce a horizontal jet release.  The high pressure receiver is located indoors in the engine room. Administrative controls.  are not applicable to this scenario. However, since the release would occur in an enclosure (passive mitigation), the release rate would be reduced by a factor of 55% as recommended in the Off-site Consequence Analysis guidance issued by EPA. Active mitigation of the release is human intervention (pipe repaired or system shutdown at 60 minutes from the start of the release).  Also, a certain percentage of the ammonia released will be liquid and be collected in the floor drains (passive mitigation) which lead to the storm sewer.  The release would reach offsite endpoints and nearby public receptors.\n\n\n4.0\tGeneral Acciden"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26648,
      "SummaryText": "tal Release Prevention Program and Chemical-Specific Prevention Steps\n\nCFF has developed an OSHA PSM program for their  ammonia refrigeration systems. At CFF, ammonia falls under the RMP Program 3 prevention program, which is identical to the OSHA PSM program.  EPA has said that if the process is in compliance with OSHA PSM, then it is compliance with RMP Program 3.  Thus, CFF's ammonia PSM has been reviewed and determined to be complete for the RMP document.  \n\nThere are several aspects of the ammonia prevention program that are key:\n\n1.\tThe ammonia PSM program at CFF includes provisions for employee involvement, procedures for working with contractors, pre-startup safety reviews and managing change within the system. The different sections of the PSM document detail employee participation (hazard analysis team), process safety information, process hazard analysis (PHA - what-if/checklist), operating procedures, training, mechanical integrity, hot work permits, management of change, incident investigation, compliance audits and emergency planning and response (HAZWOPER plan).  The plant, therefore, maintains good training, certification, and employee awareness of operating procedures.\n\n2.\tCFF has researched information pertaining to the properties and hazards of ammonia, sought professional assistance from experts in the ammonia refrigeration industry, and used many internal resources to develop the ConAgra Frozen Prepared Foods - Ammonia Refrigeration Reference Manual.  Block flow diagrams and P&ID's have been developed and are updated as the ammonia refrigeration system audits are completed.\n\n3.\tCFF has established a hazards analysis team (comprising of plant employees) responsible for updating existing operating procedures for the refrigeration system and also verifying and documenting the mechanical integrity of the system.\n\n4.\tIn the event of a catastrophic release or an incident which could have resulted in a catastrophe, investigations will be undertaken ("
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 26648,
      "SummaryText": "this is a policy of the PSM document).  Necessary preventative measures will be taken to reduce the risk of incident reoccurrence.\n\n\n5.0\tFive-year Accident History\n\nThe review of CFF's accident history includes the following range of dates: March 12, 1997 ¿ March 12, 2002.  To date, there have been no reportable accidents with ammonia at the facility.  \n\n\n6.0\tEmergency Response Program\n\nAs mentioned previously, the CFF facility has developed an OSHA hazardous substance emergency response program called HAZWOPER. The HAZWOPER document contain detailed procedures for: 1) pre-emergency planning and coordination; 2) personnel roles and lines of authority; 3) training; 4) communication; 5) emergency recognition and prevention; 6) safe distances and places of refuge; 7) site security and control; 8) emergency alerting and response; 9) ammonia decontamination; 10) emergency medical treatment and first aid; 11) critique of response and follow-up; 12) personal protective and emergency equipment; and 13) medical surveillance.\n\nCFF's emergency response plan (HAZWOPER) is a detailed document, which discusses the role of employees and management in an emergency situation.  All emergency response personnel undergo training and records of this training are maintained and updated on site.  The plan outlines specific procedures for evacuations, incident alarms and alerting.  Depending upon a given situation, the Fire Department will be called to provide back-up emergency responders and equipment.   The Fire Department will be called for all fire-related emergencies.  The incident commander has ultimate control of implementation of the emergency response plan.\n\n\n7.0\tPlanned Changes to Improve Safety\n\nBased on the completed Process Hazard Analysis (PHA) for ammonia, a list of action items were developed and their status was monitored to ensure that implementation was accomplished."
    }
  ]
}