{
  "FacilityID": 26649,
  "FacilityName": "Leprino Foods Company, Tracy, CA Plant",
  "FacilityStr1": "2401 North MacArthur Drive",
  "FacilityStr2": null,
  "FacilityCity": "Tracy",
  "FacilityState": "CA",
  "FacilityZipCode": "95376",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06077",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.755278",
  "FacilityLongDecDegs": "-121.415833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Leprino Foods Company",
  "Company2Name": null,
  "CompanyDUNS": 7076664,
  "Company2DUNS": null,
  "OperatorName": "Leprino Foods Company",
  "OperatorStr1": "1830 West 38th Avenue",
  "OperatorStr2": "P.O. Box 173400",
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80217",
  "OperatorZipCodeExt": "3400",
  "FTE": 302,
  "OtherEPAFacilityID": "CAD983576257",
  "EPAFacilityID": "100000145844",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-07-02 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2002-09-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-09-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2002-09-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 37.7551,
  "FRS_Long": -121.4158,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 38202,
      "AltID": null,
      "FacilityID": 26649,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 50370,
          "ProcessID": 38202,
          "ChemicalID": 56,
          "Quantity": 84290.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 39118,
          "ProcessID": 38202,
          "NAICSCode": "311513",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 21407,
              "Process_NAICS_ID": 39118,
              "SafetyReviewDate": "2002-06-06 00:00:00",
              "PHA_Date": "2002-07-25 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-01-25 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Operator Interuption",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "hand-held portable gas monitors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-07-24 00:00:00",
              "TrainingReviewDate": "2000-11-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "training exercise",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-08-01 00:00:00",
              "EquipmentInspectionDate": "2002-04-03 00:00:00",
              "EquipmentTested": "Evaporator tube wall thickness check with ultrasonic meter",
              "ChangeMgmtDate": "2002-06-04 00:00:00",
              "ChangeMgmtReviewDate": "2001-06-20 00:00:00",
              "PreStartupReviewDate": "2002-08-20 00:00:00",
              "ComplianceAuditDate": "2001-08-08 00:00:00",
              "AuditCompletionDate": "2003-02-08 00:00:00",
              "IncidentInvestigationDate": "1999-05-26 00:00:00",
              "InvestigationChangeDate": "1999-07-15 00:00:00",
              "ParticipationPlansReviewDate": "2001-06-20 00:00:00",
              "HotWorkPermitReviewDate": "2002-08-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-15 00:00:00",
              "ContractorSafetyEvalDate": "2001-06-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 31625,
                  "PreventionProgram3ID": 21407,
                  "ProcessChemicalID": 50370
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 26649,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2002-07-16 00:00:00",
    "ERTrainingDate": "2002-07-16 00:00:00",
    "CoordinatingAgencyName": "San Joaquin County O.E.S.",
    "CoordinatingAgencyPhone": "2094683969",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26649,
      "SummaryText": "1   Accidental Release Prevention and Emergency Response Policies\n\nLeprino Foods Company is strongly committed to employee, public and environmental safety.  This commitment is inherent in its comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  If such a release does occur, our highly trained emergency response personnel are at hand to control and mitigate the effects of the release.  We are also completely coordinated with the San Joaquin County OES and Tracy, CA Fire Department, which provide additional emergency response expertise.\n\n\n2  The Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities encompass Cheese Manufacturing.  The plant is located at 2401 MacArthur Drive in Tracy, CA.  We have one RMP-regulated substance, Ammonia, at our facility, which is used to provide refrigeration for the manufacturing of cheese.  The maximum inventory of Ammonia at our facility is approximately 84,290 lbs.\n\n\n3  The Worst Case Release Scenario and the Alternative Release Scenarios, including administrative controls and mitigation measures to limit the distances for each reported scenario\n\nTo perform the required offsite consequence analysis for our facility, we have used RMP*Comp(TM) in the RMP Offsite Consequence Analysis Guidance and EPA Model RMP for Ammonia Refrigeration.  The following paragraphs provide details of the chosen scenarios.\n\nConsequence modeling was conducted to determine the release distances from the site.  The distance to the end point would be 1.7 miles. \n\nThe worst-case release scenarios represent a release of the largest vessel's contents when full over a 10-minute release period. The scenario involves the release of 19,415 lb. of Ammonia from the High P"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26649,
      "SummaryText": "ressure Receiver #1 in a gaseous form over 10 minutes.  Release distances were calculated using Class F atmospheric stability and 1.5 m/s windspeed, and  a toxic endpoint of 0.14 mg/L.  Results for the WCS were modeled using EPA's RMP-Comp based on a toxic gas release that has been liquefied under pressure, and is located outside the engine room. The largest vessel is located outdoors.  For a release of a toxic gas, outdoors,  RMP-Comp assumes that the rate of release to the atmosphere is 100%.\n\nThe alternative scenario consists of an ammonia release from an oil drain valve in the Intercooler Oil Pot that was inadvertently left open. The pipe diameter is 3/4. The scenario involves a release rate of 751 lbs./minute.  The guidance used to develop the release distance did not assume a specific release duration and is applicable to releases of all lengths. In the event of an actual release, it is expected that an operator would intervene to stop the release within a 10-minute period. EPA permits the alternative release scenarios to allow the facility to account for administrative controls and mitigation systems that could be used in case of an emergency. However, for purposes of this analysis, no such mitigation has been assumed.  While mitigation systems and controls do exist, the analysis is intended to report more conservative results.  The distance to the end point would be 0.2 miles.\n\n\n4  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set forth by the EPA under 40 CFR part 68.  The ammonia refrigeration system is also subject to the OSHA PSM standard under 29 CFR 1910.119, and to EPCRA Section 302 notification requirements.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nLeprino Foods Company maintains"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26649,
      "SummaryText": "a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is a What If/Checklist.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of (five years or when changes dictate).  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Leprino Foods Company maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nLeprino Foods Company has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with those processes.  Refresher training is provided at least every three years, and more frequently if needed.  All training will be documented and validated by employees on the LFC Training Tracking System.\n\nMechanical Integrity\nLeprino Foods Company carries out documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes, among others, pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these pers"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26649,
      "SummaryText": "onnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Leprino Foods Company to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-startup safety reviews related to new processes and to modifications in established processes are conducted regularly at Leprino Foods Company.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nLeprino Foods Company conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nLeprino Foods Company promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident, as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nLeprino Foods Company truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including in"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 26649,
      "SummaryText": "formation resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of the contractor's safety performance of the contractor is carried out.  Leprino Foods Company has a strict policy of informing all contractors of known potential hazards related to their work.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n5  Five-year Accident History\nLeprino Foods Company has had a good record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, no incidents have occurred.\n\n\n6  Emergency Response Plan\nLeprino Foods Company carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nThe Leprino Foods Tracy, CA facility coordinates its emergency response plan with the San Joaquin County LEPC and Tracy Fire Department.\n\n7  Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program. Completion of the most recent PHA recommendations are expected to occur by January 25, 2004."
    }
  ]
}