{
  "FacilityID": 26732,
  "FacilityName": "Harborside Refrigerated Services, Inc.",
  "FacilityStr1": "2900 Guy N. Verger Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Tampa",
  "FacilityState": "FL",
  "FacilityZipCode": "33605",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12057",
  "LEPC": "Tampa Bay regional Planning Co",
  "FacilityLatDecDegs": "27.9165",
  "FacilityLongDecDegs": "-82.43175",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 47907373,
  "ParentCompanyName": "Stevedoring Services of America",
  "Company2Name": null,
  "CompanyDUNS": 155359037,
  "Company2DUNS": 0,
  "OperatorName": "Harborside Refrigerated Services, I",
  "OperatorStr1": "2900 Guy N. Verger Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Tampa",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33605",
  "OperatorZipCodeExt": null,
  "RMPContact": "Scott Wittebort",
  "RMPTitle": "Chief Engineer",
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000180109",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-10-30 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-10-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-10-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-10-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-05-16 00:00:00",
  "DeRegistrationEffectiveDate": "2007-04-27 00:00:00",
  "AnniversaryDate": "2007-10-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 27.9165,
  "FRS_Long": -82.43175,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 38309,
      "AltID": null,
      "FacilityID": 26732,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 39225,
          "ProcessID": 38309,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 50479,
          "ProcessID": 38309,
          "ChemicalID": 56,
          "Quantity": 13608.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 550479,
          "ProcessID": 38309,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26732,
      "SummaryText": "Executive Summary\n\nA.     Describe Accidental Release Prevention and Emergency Policies\n\nThis  company's Occupational Safety and Health Policy is based on a sincere desire to eliminate personal injuries and illnesses.  It is also meant to help prevent damage to equipment and property and to protect the general public, insofar as they may come in contact with or are affected by our work.  Therefore, Harborside Refrigerated Services' accident and illness prevention program was designed to accomplish the above goals.  \n\nHarborside Refrigerated Services, Inc. recognizes that safety is the responsibility of every employee of the company.  However, the direct chargeable responsibility rests on the shoulders of management and supervisory personnel.  To assist them in fulfilling their safety and health responsibilities, our company has delegated these people the authority necessary.\n\nAll Harborside Refrigerated Services, Inc. employees shall make every effort to become familiar and comply with governmental safety and health regulations that apply to the Marine Cargo Handling Industry.  These regulations include, but are not limited to the following:\n\nU.S. Department of Labor - OSHA\n29-CFR-Parts 1903 through 1905\n29-CFR-Part 1910\n29-CFR-Parts 1917 through 1919\n\nU.S. Department of Transportation - USCG\n33-CFR-Part 3\n33-CFR-Part 6\n33-CFR-Part 20\n33-CFR-Parts 125 through 127\n46-CFR-Part 146\n\nU.S. Department of Transportation - RSPA\n49-CFR-Parts 106 & 107\n49-CFR-Part 130\n49-CFR-Parts 171 through 177\n\nIt is good business and evidence of competent leadership to prevent accidents that can lead to personal injury, illness and/or property damage.  In retrospect, Harborside Refrigerated Services, Inc. recognizes that nearly all accidents are preventable. Harborside Refrigerated Services, Inc. also recognizes that, in order to maintain a viable place in our industry, we must and will be successful in the prevention of accidents.\n\nAccidental Release Prevention and Emergency Policies are"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26732,
      "SummaryText": " designed to comply with OSHA's Process Safety Management (PSM) standard (Process Safety Management of Highly Hazardous Chemicals, 29 CFR 1910.119) and EPA's Risk Management Program (RM program) regulation (Risk Management Programs for Chemical Accidental Release Prevention, 40 CFR Part 68).  The Chief Engineer is responsible for the management of the accidental release prevention and emergency action programs.\n\nThe purpose of the accidental release prevention and emergency action programs is to prevent the occurrence, and minimize the consequences, of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents.  Overall, these programs prevent accidental fatalities, injuries and illnesses and avoid physical property damage.\n\nB. Stationary Source and Regulated Substances Handled\n\nThis company operates a freezing and storage warehouse for the perishable food industry.  This facility operates an ammonia refrigeration system to provide cooling and freezing capabilities.  The amount of anhydrous ammonia (CAS #7662-41-7) contained in this system is in excess of 10,000 pounds.  The ammonia inventory of this system is 13,608 lbs.  Since ammonia releases from this system could pose a risk of offsite public impact and is regulated under the OSHA PSM standard (29 CFR 1910.119), the system is subject to the Program 3 requirements of the EPA's RM program.\n\nThe closed ammonia refrigeration system removes heat from the storage freezers of the facility.  A refrigeration system provides two-stage and single-stage operation with screw compressors for the 0/-10 degree F. freezers.  The sub-zero temperatures are provided with low pressure ammonia suction and liquid lines via pumped recirculating accumulators.  The higher pressure portions of the system include the condenser, located on the roof, along with refrigerant vent lines where any leaks can dissipate to the air, joining ammonia produced by lightning where it can be consumed "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26732,
      "SummaryText": "as it goes through a natural biodegrading process.  Normal safeties include: high pressure cut-outs, relief valves, and ventilating systems for machine room areas.\n\nC.     Summary of Worst-Case and Alternative  Release Scenarios\n\nThe Worst Case Release Scenario is determined to be a catastrophic release from V-3 Intercooler Receiver.  The V-3 Intercooler Receiver operates at 12 degree F. and approximately 26 psig.\n\nThe V-3 Intercooler Receiver is 3.5 feet in diameter and 17.16 feet tall.  When 50% filled, the intercooler capacity is approximately 3,379 pounds of anhydrous ammonia.\n\nAssumed is that the release occurs through a circular hole located at the bottom of the V-3 receiver.  Because the bottom piping in the V-3 receiver is four-inch diameter, leakage is assumed to occur through a four-inch circular hole.  For this Worst Case Release Scenario, the distance from source to toxic endpoint is 0.76 miles.\n\nThe worst-case release scenario is unlikely for the following reasons:\n\nThe worst-case weather conditions which were used for this scenario are uncommon;\n\nIndustry standards were followed for the manufacture and quality control of these vessels;\n\nAmmonia is not corrosive in this service;\n\nPressure safety valves limit operating pressures in these vessels and vessels have design margins of safety of about 4 to 1.\n\nAlternative Release Scenario Analysis\n\nAn Alternative Release Scenario is chosen as a pipe failure.  The potential for a pipe failure is significant given the extensive ammonia piping system extending throughout the Facility.\n\nAssumed is the failure of a four-inch pipe connected to the V-3 Intercooler Receiver. It is assumed that the pipe fails at the V-3 Intercooler Receiver.  Using EPA-suggested meteorological parameters for alternative scenarios and following a one-hour release, the distance from release point to the toxic endpoint is 0.17 miles.  \n\nThe Alternative Release Scenario is unlikely for the following reasons:\n\nThe high pressure liquid lines"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26732,
      "SummaryText": " are located in enclosed areas that could help to contain such a release;\n\nIndustry standards were followed for the manufacture and quality control of these lines;\n\nAmmonia is not corrosive in this service.\n\nVessel design uses a factor of approximately 4 to 1 margin for safety.\n\nActive mitigation considered would be the Emergency Shutdown System which permits system to equalize to 50-60 psig.\n\nD.     Description of the Accidental Release Prevention Program\n\nThe prevention program (OSHA Process Safety Management CFR 1910.119) consists of the following elements:\n\nEmployee Participation\nProcess Safety Information\nProcess Hazard Analysis\nOperating Procedures\nTraining\nContractors\nPre-startup Safety Review\nMechanical Integrity\nHot Work Permit\nManagement of Change\nIncident Investigation\nCompliance Audits\n\nE.     Five-Year Accident History\n\nNo ammonia-related incidents were identified for the facility in the previous five years which resulted in significant on-site or off-site consequences.\n\nF.     Description of the Emergency Response Program\n\nThis facility has an Emergency Action Plan.  The plan contains procedures describing how the facility will respond to ammonia spills and other emergencies, including evacuation procedures, escape routes, critical operations shutdown procedures, procedures to account for all employees, rescue and medical duties assignment, means of reporting fires and emergencies, name of responsible person, alarm system, training and fire prevention.\n\nHarborside Refrigerated Services, Inc. is included in the community emergency response plan developed by the Tampa Bay Regional Planning Council (727-570-5151). \n\nG.    Planned Changes to Improve Safety\n\nA Process Hazard Analysis was conducted in May of 2000.  Any recommendations resulting from this audit will be evaluated and implemented as required.\n\nHarborside Refrigerated Services, Inc.\nTampa, Florida"
    }
  ]
}