{
  "FacilityID": 26751,
  "FacilityName": "Pateros Facility",
  "FacilityStr1": "491 Industrial Way",
  "FacilityStr2": null,
  "FacilityCity": "Pateros",
  "FacilityState": "WA",
  "FacilityZipCode": "98846",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53047",
  "LEPC": "Okanogan County LEPC",
  "FacilityLatDecDegs": "48.0525",
  "FacilityLongDecDegs": "-119.903333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 50173210,
  "ParentCompanyName": "Magi Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Jim Divis",
  "OperatorStr1": "26049 SR 97",
  "OperatorStr2": null,
  "OperatorCity": "Brewster",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98812",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dale Davis",
  "RMPTitle": "Director of Operations",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000180136",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-09-25 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-10-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-10-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-09-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-09-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 48.0525,
  "FRS_Long": -119.90333,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "ADDRESS MATCHING-BLOCK FACE",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 38354,
      "AltID": null,
      "FacilityID": 26751,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 39270,
          "ProcessID": 38354,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 50522,
          "ProcessID": 38354,
          "ChemicalID": 56,
          "Quantity": 17655.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 550522,
          "ProcessID": 38354,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26751,
      "SummaryText": "\n RISK  MANAGEMENT  PLAN\n\n\n\n\n\ncovering\n\n\n\n ANHYDROUS AMMONIA\n\n\n\nfor\n\n\n\nMAGI, INC.\n\n\n\n\n\napplicable to facilities at:\n\n\n\n\n\nBREWSTER  WA\n\nPATEROS  WA\n\nOKANOGAN  WA\n\n\n\n\n\nPrepared by:  Bruce Merighi / FRM llc \n\nIn Compliance with  40 CFR 68\n\nAugust 16, 2002\n\n\n\n\n\n\n\n\n\n\n\nRISK  MANAGEMENT  PLAN\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\nExecutive Summary                                3\n\n\n\n\n\nDescription of Program                            9\n\n\n\n\n\nManagement of System                            11\n\n\n\n\n\nHazard Assessment                                13\n\n\n\n\n\nProgram Level 3 - Prevention Program                    17\n\n\n\n\n\nAmmonia Release Response Plan                         26\n\n\n\n\n\n\n\n\n\n\n\nRisk Radius Maps                        Appendix    A\n\n\n\n\n\nRMP Submission Information                    Appendix     B\n\n\n\n\n\nUnified Command Organization Chart            Appendix     C\n\n\n\n\n\n\n\n\n\nEXECUTIVE  SUMMARY \n\n\n\n\n\nA.    Accidental Release Prevention and Emergency Response\n\n\n\nMagi, Inc. (hereafter referred to as Magi ) accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices.  It is the policy of Magi to adhere to all applicable federal and state safety and environmental regulations.\n\n\n\n    Magi refrigeration personnel respond to ammonia releases at a very limited level but have none the less received the training in accordance with 29 CFR 1910.120, in addition to training applicable to ammonia.  An emergency plan has been developed covering notification to public safety agencies and the public.  An evacuation plan for the Brewster, Pateros and Okanogan facilities have also been developed and all employees receive training on this plan.  Omak's facility is a very small cold storage warehouse and as such hosts a very limited number of occasional employees at specific times of the year. With this in mind the evacuation plan for the Omak facility is simply for the one or two employees to: 1)  Leave by the closest exit,  2)  Call 911,  3)  Report the emergency situation to the Okanogan plant supervisor and 4) Inform incoming emergency responders of the situation and accountability of personnel on site. \n\n\n"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26751,
      "SummaryText": "\nAt Magi, anhydrous ammonia is used on-site. Ammonia is considered hazardous by EPA and is listed on the Extremely Hazardous Substance (EHS) list.  Chemical properties of ammonia make it necessary to observe certain safety precautions in handling ammonia in order to:\n\n\n\n1) Prevent unnecessary human exposure\n\n\n\n2) Reduce the threat to our personnel\n\n\n\n3) Reduce the threat to the community\n\n\n\nB.    Facility and Regulated Substance Handled\n\n\n\nMagi owns and operates three fruit processing in combination with  four cold storage facilities located at Brewster, Pateros, Omak and Okanogan, in the county of Okanogan, the state of Washington.\n\n\n\nThe regulated substance used at Magi is anhydrous ammonia (CAS # 7664-41-7). The anhydrous ammonia is used as a refrigerant.\n\n\n\n1) There is approximately 23,215 pounds of anhydrous ammonia in the Brewster systems.  The largest interconnected system could potentially involve Engine Room #1 and #2, and potentially release 8,570 pounds of product.\n\n\n\n2) There is approximately 17,655 pounds of anhydrous ammonia in the Pateros system. The larger of the two independent systems ( South Engine Room ) could potentially release 10,009 pounds of product.\n\n\n\n3) There is approximately 23,827 pounds of anhydrous ammonia in the Okanogan systems. The largest interconnected system could potentially involve Engine Room 'C' and 'D' and release 7,640 pounds of product.   \n\n\n\n4) There  is  approximately  3,135 pounds  of  anhydrous ammonia  in the  Omak systems. The quantities present at this location are well below the 10,000 pound threshold and therefore does not require a RMP.  As such, Worst Case and Alternative Scenarios were not calculated.  If in the future this location increases it's capacity to the 10,000 threshold an amended RMP will be immediately submitted.  In order to provide the Omak facility and the surrounding area a higher  level of safety, many  aspects of this RMP and the related PSM have included the Omak system.\n\n\n\nMagi uses other haza"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26751,
      "SummaryText": "rdous substances on-site, however they do not meet or exceed the threshold limits established in 40 CFR 68.130.  However, Magi believes in the concept set forth in the \"General Duty Clause\" of the Clean Air Act.  Therefore, Magi has established policies, procedures and training to reduce the risk of an accidental hazardous substance release for the safety of its employees and surrounding areas.\n\n\n\nC.    Worst-Case and Alternative Scenarios\n\n\n\nThe off-site consequence analysis considers two ammonia release scenarios identified as \"worst case\" and \"alternative\" scenarios for each facility.  The worst case scenario is defined by the Environmental Protection Agency (EPA), which states that \"the owner or operator shall assume that the maximum quantity in the largest vessel is released ...\".  The alternative scenario is defined as \"more likely to occur than the worst case scenario\".\n\n\n\nWorst-Case Scenario for Brewster - Failure of the largest vessel / system would release 8,570 pounds of anhydrous ammonia.  The release would occur inside a compressor room, its walls are in direct contact with the outside, however the effects of building mitigation were not considered.  The distance to the toxic end-point of 0.14 mg/L is 1.3 miles.  The \"risk radius\" extends past the boundaries of the plant, into public receptor areas. Distance was determined by use of RMP-COMP. See attached maps.\n\n\n\n\n\n\n\n\n\nAlternative Release Scenario for Brewster - Several alternative scenarios were modeled, using ALOHA(tm), version 5.2.1, however a release from the bottom ( liquid space ) of the receiver, under normal operating conditions, was chosen.  This alternative scenario provided the greatest risk radius of  779 yards.  There was no building mitigation used for this scenario.  It was, however, assumed that the safety systems in place would limit the release to the amount in the receiver.\n\n\n\nWorst-Case Scenario for Pateros - Failure of the largest vessel / system would release 10,009 pounds of anhydro"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26751,
      "SummaryText": "us ammonia.  The release would occur inside a compressor room, its walls are in direct contact with the outside, however the effects of building mitigation were not considered.  The distance to the toxic end-point of 0.14 mg/L is 1.6 miles.  The \"risk radius\" extends past the boundaries of the plant, into public receptor areas. Distance was determined by use of RMP-COMP. See attached maps.\n\n\n\nAlternative Release Scenario for Pateros - Several alternative scenarios were modeled, using ALOHA(tm), version 5.2.1, however a release from the bottom ( liquid space ) of the receiver, under normal operating conditions, was chosen.  This alternative scenario provided the greatest risk radius of 918 yards.  There was no building mitigation used for this scenario.  It was, however, assumed that the safety systems in place would limit the release to the amount in the receiver.\n\n\n\nWorst-Case Scenario for Okanogan - Failure of the largest vessel / system would release 7,640 pounds of anhydrous ammonia.  The release would occur inside a compressor room, its walls are in direct contact with the outside, however the effects of building mitigation were not considered.  The distance to the toxic end-point of 0.14 mg/L is 1.12 miles.  The \"risk radius\" extends past the boundaries of the plant, into public receptor areas. Distance was determined by use of RMP-COMP. See attached maps.\n\n\n\nAlternative Release Scenario for Okanogan - Several alternative scenarios were modeled, using ALOHA(tm), version 5.2.1, however a release from the bottom ( liquid space ) of the receiver, under normal operating conditions, was chosen.  This alternative scenario provided the greatest risk radius of 684 yards.  There was no building mitigation used for this scenario.  It was, however, assumed that the safety systems in place would limit the release to the amount in the receiver.\n\n\n\nBoth the \"worst-case\" and \"alternative\" scenarios, for all facilities, are unlikely due to the safeties on the system such as t"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 26751,
      "SummaryText": "emperature and pressure cutouts, and pressure relief valves to prevent an overpressure situation.\n\n\n\nA more realistic scenario would be that of a pressure relief valve lifting, discharging ammonia vapor from vents.  In scenarios modeled for this type of an event, the risk radius was reduced to approximately 250 yards.\n\n\n\n\n\nD.    General Accidental Release Prevention Program\n\n\n\nMagi's accidental release prevention program is based on the following key elements:\n\n\n\n1) Initial and continued training of personnel\n\n\n\n2) Preventative maintenance programs as described in the PSM\n\n\n\n3) Use of safety equipment and procedures\n\n\n\n4) Use of accurate and effective written operating procedures\n\n\n\nMagi complies with:\n\n\n\n1) OSHA's and Washington State's Process Safety Management rules.\n\n\n\n2) Washington State's safety regulations.\n\n\n\n3) IIAR (International Institute of Ammonia Refrigeration) standards for good work practices.\n\n\n\nThe ammonia refrigeration system was installed to standards and local codes at the time of installation.  Piping and equipment is secured and protected; compressor (engine) room doors are tight fitting and open outwards.  Other safety systems Magi utilizes include:\n\n\n\n1) Suction trap hi-level float\n\n\n\n2) High discharge pressure shut down\n\n\n\n3) Low suction pressure shut down\n\n\n\n4) High discharge temperature shut down\n\n\n\n5) Oil pressure failure shut down\n\n\n\n6) High amperes shut down\n\n\n\n7) Oil filters plugged shut down\n\n\n\n8) 250 psi relief valves on high pressure side, to prevent overpressure situations\n\n\n\n9) 150 psi relief valves on low pressure side, to prevent overpressure situations\n\n\n\n10) The PSM Committee members have discovered areas that needed improved levels of safety and identified them in their Hazard Tracking reports.  These items have been addressed as follows:\n\n\n\n*  Video cameras and motion detectors in high crime areas.\n\n\n\n* Outside drop leg valves are locked.\n\n\n\n* Engine Room windows are being covered with expanded metal for increased security.\n\n\n"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 26751,
      "SummaryText": "\n* Exterior piping that could be exposed to forklift accidents has received impact shielding\n\nOperating Procedures and checklists have been prepared by Magi to be used by employees performing operational functions. Procedures are kept in the office of Dale Davis.  These procedures include: \n\n\n\n1) Pre-start up procedures\n\n\n\n2) Routine operations\n\n\n\n3) Maintenance\n\n\n\n4) Response to major and minor releases\n\n\n\n5) Emergency Action Plan\n\n\n\nE.    Five-Year Accident History\n\n\n\nMagi has not had any accidents involving ammonia in the last five years.  \n\n\n\nF.  Emergency Response Program\n\n\n\nIn addition to the operating procedures, Magi has established Emergency Response Guidelines for releases involving ammonia.  These procedures are part of our ongoing training. Magi is currently meeting with the Okanogan County Department of Emergency Management, the Omak, Okanogan, Brewster and Pateros Fire Departments, Lifeline Ambulance, area Hospital and educational facility representatives, the WSP, the Okanogan County Sheriff and the Police Departments of the above listed cities in order to define roles and functions of various agencies in the event of an ammonia release.  \n\n\n\n\n\n\n\nTable tops meetings have determined roles for emergency events, staging areas, support functions, employee and community evacuation or shelter in place duties, Incident Command staff functions as well as mitigation procedures and support. Please note the HazMat Unified Command Organizational Chart in the last section. The table tops drills are also developing plans for yearly, all agency, drills to commence shortly after the holidays in 2003.  \n\n\n\n\n\nG. Planned Safety Improvements\n\n\n\nMagi plans to install ammonia monitors / detectors in the engine rooms. The engine room ventilation fans will be connected to ammonia monitors so the fans will activate upon reaching a threshold less than 40,000 parts per million, which is 1/4 of ammonia's lower explosive limit (LEL).  The actual threshold will be at, or less than, 1"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 26751,
      "SummaryText": ",000 ppm and the monitor will be connected to an auto dialer, to alert refrigeration personnel of a potential ammonia release.  \n\n\n\n\n\nOther planned safety improvements are:\n\n\n\n1) Install emergency shutdowns on the outside wall of all engine rooms\n\n\n\n2) Increase training to personnel ( both refrigeration and fork lift operators )\n\n\n\n3) Review and update the emergency plan yearly and provide semi-annual drills and training in the emergency ( evacuation ) plan to all plant personnel. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDESCRIPTION  OF  PROGRAM\n\n\n\n\n\n1. This is to inform all interested persons, including employees, that Magi Inc., headquartered at 26049 State Highway # 97, Brewster WA 98812 in conjunction with it's other facilities in the cities of Okanogan, Omak and Pateros jointly comply with Process Safety Management of Highly Hazardous Chemicals (PSM) and EPA's Risk Management Program (RMP).  These programs deal with the risks involved in the storage, handling, and processing of highly hazardous materials such as ammonia.  In this way, we promote overall plant and worker safety.\n\n\n\n2. Magi's PSM/RMP programs enable our facility to work towards the mitigation of the occurrence and consequences of significant releases of hazardous materials as well as fires, explosions, and other types of incidents.  \n\n\n\n3. Magi's PSM/RMP programs help prevent accidents because they focus on the rules, procedures, and practices that govern individual processes, activities, or pieces of equipment.  These rules are improved as necessary.  They are also communicated to all appropriate employees at Magi.\n\n\n\n4. Copies of the written program may be reviewed in the office of Dale Davis, in the Brewster office. \n\n\n\n5. If an employee (or any reader of this document) feel that any improvements can be made to the PSM/RMP programs, please contact Dale Davis and present your written suggestion. Magi encourages all suggestions because we are committed to the success of our PSM/RMP programs. Ma"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 26751,
      "SummaryText": "gi strives for a comprehensive, integrated prevention system that results in clear understanding, safe behavior, and involvement in the program from every level of the facility.\n\n\n\n6. The Director of Operations, Dale Davis is the program coordinator with overall responsibility of ensuring that program goals and objectives are met and appropriate resources are available.  He'll ensure that the RMP is reviewed and updated, as necessary, but at least once every five years.\n\n\n\n7. Like all PSM / RMP programs, ours contains the following major elements:\n\n\n\na) General Company Policy\n\n\n\nb) Employee Participation\n\n\n\nc) Process Safety Information\n\n\n\n\n\nd) Process Hazard Analysis\n\n\n\ne) Operating Procedures\n\n\n\nf) Training\n\n\n\ng) Contractor Qualifications\n\n\n\nh) Pre-Startup Safety Review\n\n\n\ni) Mechanical Integrity Program\n\n\n\nj) Hot Work Permit\n\n\n\nk) Management of Change\n\n\n\nl) Incident Investigation\n\n\n\nm) Emergency Planning and Response\n\n\n\nn) Compliance Audits\n\n\n\no) Management System\n\n\n\np) Hazard Assessment\n\n\n\nq) Five-Year Accident History\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMANAGEMENT  SYSTEM\n\n\n\nApplicability (68.15)\n\n\n\nMagi is a Program 3 process, and as such, is required by the management system provision in section 68.15 to:\n\n\n\n1) Develop a management system to oversee the implementation of the risk management program elements;\n\n\n\n2) Designate a qualified person or position with the overall responsibility for the development, implementation, and integration of the risk management program elements; and\n\n\n\n3) Document the names of people or positions, and define the lines of authority. \n\n\n\nPurpose\n\n\n\nThe purpose of the management system is to define the lines of authority and roles and responsibilities of staff who oversee the risk management program elements.  This helps to:\n\n\n\n1) Ensure effective communication about process changes between divisions;\n\n\n\n2) Clarify the roles and responsibilities related to process safety issues at Magi;\n\n\n\n3) Avoid problems or conflicts among the "
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 26751,
      "SummaryText": "various personnel responsible for implementing elements of the risk management program;\n\n\n\n4) Ensure the program elements are integrated into an ongoing approach that helps identify hazards and manage risks.\n\n\n\n5) Avoid confusion and allow those responsible for implementation to work together as a team; and\n\n\n\nResponsibilities:\n\n\n\nThe Director of Operations, Dale Davis, bears overall responsibility for the RMP \n\nprogram at Magi plus:\n\n\n\n1) Employee participation\n\n\n\n2) Incident investigation\n\n\n\n3) Review and update of the emergency response plan\n\n\n\n4) Training \n\n\n\n5) Compliance audits\n\n\n\nHe is also responsible for ensuring operational areas of Process Safety Management are carried out.  These areas include:\n\n\n\n1) Updating of the Risk Management program, as necessary, including hazard assessment \n\n\n\n2) Process Safety Information\n\n\n\n3) Process Hazard Analysis\n\n\n\n4) Pre-Startup Safety Review\n\n\n\n5) Operating Procedures\n\n\n\n6) Management of change\n\n\n\n7) Mechanical Integrity ( Preventative Maintenance )\n\n\n\n8) Hot Work Permit\n\n\n\n9) Contractor Qualification\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHAZARD  ASSESSMENT\n\n\n\n\n\nThis hazard assessment was prepared in compliance with Subpart B of 40 CFR 68.\n\n\n\nApplicability\n\n\n\nMagi uses ammonia as a refrigerant for cold storage of fresh fruit. Ammonia is an EPA-regulated substance and the amount onsite is in excess of the regulatory threshold of 10,000 pounds.  The use of ammonia at Magi is subject to Washington State and OSHA Process Safety Management (PSM) regulations. The worst case scenario's risk radius does encompass public and environmental receptors.  This qualifies Magi as a Program 3 facility.\n\n\n\n\n\nOffsite Consequence Analysis Parameters (68.22)\n\n\n\nThe following parameters were used when determining the offsite consequences, as required by Section 68.22.\n\n\n\nEnd-point - Toxic\n\n\n\nAs required by the EPA, the toxic end-point of 0.14mg/L was used as the end-point for the worst case scenario for each applicable facility.  This amount wa"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 26751,
      "SummaryText": "s also used for the alternative scenarios.  Distances to the end-point for the worst-case scenario were computed by use of RMP-COMP(tm), version 1.06.  The toxic end-points were determined to be 1.3 miles for Brewster, 1.6 miles for Pateros and 1.12 miles for Okanogan.  No passive mitigation was used in the calculation for the toxic end-point. The toxic end-point of 0.14mg/L (or 200 ppm) is the concentration at which an average person can be exposed to for up to an hour without adverse health effects.\n\n\n\nThe toxic end-point of 0.14 mg/L for the alternative scenario was computed by the use of Aerial Location of Hazardous Atmosphere (ALOHA(tm)), version 5.2.1.  ALOHA(tm) modeling a toxic end-points  of  779 yards for Brewster, 918 yards for Pateros and 684 yards for Okanogan based on a release directly to atmosphere. \n\n\n\nWind Speed / Atmospheric Stability Class\n\n\n\nFor the worst-case release analysis, as required by EPA, a wind speed of 1.5 meters per second and  F atmospheric stability class were used.\n\n\n\nFor the alternative release scenario, a wind speed of 3 meters per second, and stability class D were used. \n\n\n\nAmbient Temperature/Humidity\n\n\n\nFor the worst-case release analysis, as required by EPA, a temperature of 25 degrees centigrade and humidity of 50% were used.\n\n\n\nFor the alternative release scenario, a temperature of 51 degrees Fahrenheit (Annual mean temperature) and 25% humidity were used. [Climatological Summary Table (1940 - 1993), Tree Fruit Research Center, Wenatchee, WA, - National Weather Service.]\n\n\n\nHeight of Release\n\n\n\nFor the worst-case release analysis, as required by EPA, the release was analyzed assuming ground level (0 feet) release.\n\n\n\nFor the alternative release analysis, the release was again analyzed assuming ground level.  This was based on a release from a .75\" in diameter short pipe, at the bottom of the receiver, below the liquid line.\n\n\n\nSurface Roughness\n\n\n\nRural surface roughness was chosen for both scenarios.  The selection was b"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 26751,
      "SummaryText": "ased on the fact that the surrounding area within a 1-mile radius has limited buildings and is fairly open when averaging all facilities.\n\n\n\n\n\nWorst-Case Release Scenario Analysis (68.25)\n\n\n\nRMP regulation requires that a worst-case release scenario analysis be performed for each substance in excess of the regulatory threshold.  Since ammonia is the only substance onsite in excess of the threshold, only one worst-case scenario for each of the three facilities was performed.  \n\n\n\nThe quantity calculated for was the amount in the largest vessel, as required by 40 CFR 68.25(e), which is the high-pressure receiver.  Receiver dimensions  are:\n\n\n\n1) Brewsters two engine room receivers ( #1 = 17'8\" in length with a radius of 8'3\"  and #2 is 18' in length with a radius of 9'7\" ) together these receivers have a combined volume of 221 cubic feet.  The amount of ammonia possible, if the vessel were to be filled to 100% capacity at 85 degrees F is 8,232 pounds. ( Based on the weight of liquid ammonia at 85o F, which is 37.25 pounds per cubic foot. )  Since there is connecting piping to the receiver containing liquid ammonia, the actual amount used in modeling the worst-case release was 8,570 pounds.  \n\n\n\n\n\n2) Pateros largest is 12'9\" radius  and 20' in length, giving the receiver a volume of 250 cubic feet.  The amount of ammonia possible, if the vessel were to be filled to 100% capacity at 85 degrees F is 9,499 pounds. ( Based on the weight of liquid ammonia at 85o F, which is 37.25 pounds per cubic foot. )  Since this is a medium sized facility which connects the piping to the receiver containing liquid ammonia, the actual amount used in modeling the worst-case release was 10,009 pounds.  \n\n\n\n3) Okanogan largest two are 105.98 cubic feet and 84.77 cubic feet providing a combined storage capacity of 3,918.95 and 2,721.50 respectively. The amount of ammonia possible, if the vessels were to be filled to 100% capacity at 85 degrees F is 6,640.45 pounds. ( Based on the weight of l"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 26751,
      "SummaryText": "iquid ammonia at 85o F, which is 37.25 pounds per cubic foot. )  Since there is connecting piping to the receiver containing liquid ammonia, the actual amount used in modeling the worst-case release was 7,640 pounds.  \n\n\n\nAlso, there are no administrative controls or passive mitigation used in these scenarios to mitigate the effects of the release.  The distance to the toxic end-points, of 1.3 miles for Brewster, 1.6 miles for Pateros and 1.12 miles for Okanogan were obtained by use of RMP-COMP, version 1.06.\n\n\n\n\n\nAlternative Release Scenario Analysis (68.28)\n\n\n\nRMP regulations require that at least one alternative scenario be identified and analysis for each regulated substance.  Since ammonia is the only regulated substance in excess of the threshold, only one alternative scenario was selected.  The scenario used was a release from a short pipe (.75\" diameter) at the bottom of the receiver (the drain).  Of the alternative scenarios looked at, this scenario gave the greatest risk radius for the alternative release.\n\n\n\nUsing RMP*Comp(tm), the modeling analysis was based on the high-pressure receiver being filled with 30% liquid at 85o F, which is the normal operating situation.  The tank-modeling source was used, which resulted in a risk radius of 779 yards in Brewster, 918 yards in Pateros and 684 yards in Okanogan..\n\n\n\nThe tank and heavy gas model was used for the alternative scenario.\n\n\n\n[It should be noted that the most realistic (and common) alternative release scenario would be from the lifting of a pressure relief valve (PRV), venting ammonia vapor to atmosphere.  In the models run with this scenario, none of the release scenarios from a PRV produced a risk radius in excess of the chosen alternative scenario.  Other alternative scenarios ran produced risk radiuses between 225 yards and 500 yards, based on a toxic end-point of 0.14 mg/L]\n\n\n\n\n\n\n\nOff-Site Impact - Population (68.30)\n\n\n\nWorst-Case Alternative Scenario\n\n\n\nOkanogan County has a population density o"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 26751,
      "SummaryText": "f 12.7 per square mile.  Douglas County has a population density of 14.4 per square mile.  (Population densities are from the US Census Bureau, 1990 census.)  \n\n\n\n1) The Brewster area impacted by this worst-case scenarios is 6.4 square miles of Okanogan County and 1.2 square miles of the Columbia River. The effected  residential population within the risk radius is approximately 2,262.\n\n\n\na) There are two schools within the risk radius.  Brewster Elementary at 502 S. 7th and Brewster Junior and Senior High School at 503 S. 7th approximately 1.1 mile to the south of the plant. \n\n\n\nb) Okanogan County Fire District 5 main station at 101 S. 3rd, is approximately 1.5 miles to the southeast  of the plant.\n\n\n\nc) The Brewster Police Department / City Hall complex, at 105 S. 3rd is approximately 1.5 mile to the southeast of Magi.  The City Police Department is staffed 24-hours a day and is a public safety answering point (PSAP) and a jail.\n\n\n\nd) The Brewster Community Hospital, at 5707 Hospital Way, is within one tenth of a mile to the north of the plant.\n\n\n\ne) The Community Medical Center on Indian Ave., The Family Health Center on J St., Main Street Health Clinic on Main, The Hospital's Assisted Living facility and the Harmony House on SR 97 are all within 1 mile of Magi.\n\n\n\nf) The Brewster Ambulance Hall at 412 W. Indian Ave.\n\n\n\n\n\n2) The Pateros area impacted by this worst-case scenarios is 5.3 square miles of Okanogan County, the Columbia River and 1.6 square miles of Douglas County.  The effected residential population within the risk radius would be approximately 640.\n\n\n\na) There no schools, police stations, hospitals, clinics or nursing homes within the \n\nrisk radius. \n\n\n\nb) Okanogan County Fire District 5 / Pateros Fire Department station / City Hall complex, at 113 Lakeshore Drive, is approximately .75 mile to the southwest of the Magi facility..\n\n\n\n3) The Okanogan County area impacted by this worst-case scenarios is 6.3 square miles and effects a residential popula"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 26751,
      "SummaryText": "tion within the risk radius of 2,480.\n\n\n\na) There is one school within the risk radius,  Okanogan Junior and Senior High School at 130 S. 5th approximately .75 mile to the west of the plant. The Virginia Granger Elementary school at 1118 S. 5th is outside the risk radius.\n\n\n\nb) Okanogan City / County Fire District #5 main station at 235 Oak St. is approximately .5 miles to the west of the plant.\n\n\n\nc) The Washing State Patrol Okanogan Headquarters is across the street and to the north of the Magi facility at 108 Patrol Rd.\n\n\n\nd) The Okanogan County Sheriff Office and the Okanogan County Department of  Emergency Management are located at 123 N. 5th and are approximately .5 miles distant from the facility. OCSO is staffed 24-hours a day and is a public safety answering point (PSAP) and a jail.\n\n\n\ne) Okanogan City Hall is located at 120 N. 3rd Ave. and is approximately .5 miles to the west of Magi.  \n\n\n\nf) The Family Health Center at 716 S. 1st is just within the risk radius. \n\n\n\nAlternative Scenario\n\n\n\nThe risk radius encompasses 779 yards in Brewster or approximately 475 people.\n\n\n\nThe risk radius encompasses 918 yards in Pateros or approximately 200 people.\n\n\n\nThe risk radius encompasses 684 yards in Okanogan or approximately 750 people.\n\n\n\n\n\nOff-Site Impacts - Environment (68.33)\n\n\n\nWorst-Case\n\n\n\nEnvironmental receptors within the worst-case risk radius are:\n\n\n\n\n\n\n\n1) The Columbia  River for the Brewster facility\n\n\n\n2) The Columbia  River and Methow River for the Pateros facility. \n\n\n\n3) The Okanogan River for the Okanogan facility.\n\n\n\nAlternative\n\n\n\nThe environmental receptor within the alternative release scenario risk radius is the Columbia River for Brewster and Pateros at distances of 150 yards each. The Okanogan plant could impact the Okanogan River at a distance of 200 yards. \n\n\n\nReview and Update (68.36)\n\n\n\nMagi will review and update the offsite consequence analysis at least once every five years.\n\n\n\nIf changes in processes, quantities stored or handled, o"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 26751,
      "SummaryText": "r any other aspect of the facility might reasonably be expected to increase or decrease the distance to the end-point by a factor of two or more, Magi will complete a revised analysis within six months of the change and submit a revised risk management plan.\n\n\n\n\n\nFive-Year Accident History (68.42)\n\n\n\nMagi has not had and accidental release in the past five years. \n\nPROGRAM 3  PREVENTION  PROGRAM\n\n\n\n\n\nProcess Safety Information (68.65)\n\n\n\nAnhydrous ammonia is the chemical used in the refrigeration process and is the chemical used at Magi that requires Process Safety Management. This requires Magi to be a Program 3 for RMP purposes.\n\n\n\nExposures to anhydrous ammonia tend to happen suddenly and unexpectedly.  Situations where exposure can occur include:\n\n\n\n1) During transfer from shipping vehicle to system.\n\n\n\n2) When equipment fails.\n\n\n\n3) When pressure release valve opens.\n\n\n\n4) When equipment is damaged.\n\n\n\nThe following is the basic process safety information for anhydrous ammonia.  Complete Process Safety Information can be found in Magi's Process Safety Management document, located in the office of Dale Davis.\n\n\n\nPhysical Data\n\n\n\nDescription:  Anhydrous ammonia is a hydroscopic compound, which means that it seeks water from the nearest source, including the human body (ammonia in the eyes can cause blindness).  It is a colorless gas with a pungent, suffocating odor.  It is shipped as a liquefied compressed gas.  It is easily liquefied under pressure.  Its chemical symbol is NH3.\n\n\n\nMolecular Weight:  17.0\n\n\n\nBoiling Point:  -28 F \n\n\n\nFreezing Point:  -108 F\n\n\n\nSpecific Gravity:  0.68  \n\n\n\nVapor Density:  0.6\n\n\n\nVapor Pressure:  8.5 atmospheres\n\n\n\nUpper Flammable Limit (UFL):  27%\n\n\n\nLower Flammable Limit (LFL):  16%  [note - the LFL may be lower with the presence of oil in the ammonia]\n\n\n\nExpansion Ratio:  850 to 1\n\n\n\nBoiling Liquid Expanding Vapor Explosion (BLEVE):  Flame impingement on a pressure vessel has the potential of causing a BLEVE.\n\n\n\nSpecial:  Althou"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 26751,
      "SummaryText": "gh ammonia does not meet the US Department of Transportation (DOT) definition of a flammable gas (for labeling purposes), it should be treated as one. \n\n\n\nSpecial:  Ammonia decomposes into nitrogen and hydrogen above 600o F.\n\n\n\n\n\nToxicity Data and Exposure Limits\n\n\n\nDescription:  Ammonia is considered an Extremely Hazardous Substance (EHS) by the US Environmental Protection Agency (EPA).\n\n\n\nThreshold Limit Value-Time Weighted Average (TLV-TWA):  25 ppm\n\n\n\nShort Term Exposure Limit (STEL):  35 ppm\n\n\n\nImmediately Dangerous to Life & Health (IDLH):  300 ppm\n\n\n\nRoutes of Exposure:  Inhalation; skin & eye contact\n\n\n\nTarget Organs:  Eyes, skin, and respiratory system.\n\n\n\nSymptoms:  Irritation of eyes, nose and/or throat.  Dyspnea (breathing difficulty, bronchospasm, chest pain, pulmonary edema (fluid in the lungs), pink frothy sputum, skin burns, and frostbite from liquid ammonia.  \n\n\n\nHealth: Ammonia can do severe damage to the eyes, exposure to amounts above 700 ppm can cause permanent eye damage.  At 50,000 ppm death is immediate.  Ammonia's ability to bond with water destroys any human tissue (since all tissue has moisture).\n\n\n\nIncompatibilities and Reactivites\n\n\n\nAnhydrous Ammonia is incompatible with:  acids; aldehydes; amides, halogens, heavy metals, oxidizers, plastics, and sulfur.\n\n\n\nAt Magi, the ammonia is used in a closed system, so the threat of ammonia mixing with an incompatible material is minimal.  It is important to keep potential incompatible materials away from areas that have the highest potential of a release, such as pressure relief devices.\n\n\n\nAmmonia is stable and hazardous polymerization will not occur.\n\n\n\n\n\nCorrosiveness\n\n\n\nAnhydrous Ammonia is corrosive to certain materials, including brass, bronze, copper, cuprous nickel, nickel copper, phosphor bronze, tin, and zinc.  It is also corrosive to human tissue.\n\n\n\nIron and steel are suitable for use with ammonia, if iron contamination is not a problem.  Rusting will occur, particularly in the vapor "
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 26751,
      "SummaryText": "space of tanks, but the attack diminishes with time as the vessel becomes \"seasoned\".\n\n\n\nSolutions of ammonia and ammonium nitrate (used for fertilizers) are intensely corrosive to carbon steel, even at ambient temperatures.  Corrosion can be reduced by the use of an inhibitor.\n\n\n\nAmmonia increases corrosion in nitrate solutions and solutions of other acid-forming anions because acidic constituents are formed upon hydrolysis, and because of the ability of the ammonium ion to form complexes with iron in steel.\n\n\n\n\n\nProcess Hazard Analysis (68.67)\n\n\n\nA team of Magi personnel conducted a complete PHA by use of the \"What-if\" method.  Team members had knowledge of the refrigeration system and the PHA method.  The PHA can be found in the PSM document, located in office of Dale Davis. \n\n\n\nIn accordance with 40 CFR 68.67, the PHA will be updated and revalidated every five years by the PHA team, unless updating is necessary in a shorter period of time.\n\n\n\nOperating Procedures (40 CFR 68.69)\n\n\n\nMagi has developed written operating procedures that provide clear instructions or steps for safely conducting activities associated with the refrigeration process.  These procedures are located in office of Dale Davis.\n\n\n\n\n\n\n\n\n\nThe procedures cover:\n\n\n\n1) Pre-start up\n\n\n\n2) Normal operations\n\n\n\n3) Maintenance\n\n\n\n4) Preventative maintenance\n\n\n\n5) Emergency shut down\n\n\n\n6) Health and safety information regarding ammonia\n\n\n\n7) Training and use of personal protective equipment (PPE)\n\n\n\n8) Safe work practices and safety training\n\n\n\n9) Lockout/Tagout\n\n\n\n10) Confined space\n\n\n\nMagi updates these operating procedures, if necessary, whenever a major change occurs and prior to startup of the changed process.\n\n\n\nTraining (68.71)\n\n\n\nMagi ensures that each employee, who is presently operating the refrigeration process, and each employee who is newly assigned to the refrigeration process, are trained in the operating procedures (listed above) that pertain to their duties.  Magi's training documentat"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 26751,
      "SummaryText": "ion requires that employees have the knowledge, skills, and abilities to safely carry out the duties and responsibilities as provided in the operating procedures.\n\n\n\nMagi also provides key employees with the 24 hours of Hazardous Materials Technician level training and the 40 hour Hazardous Materials Incident Command training, in accordance with 29 CFR 1910.120(q) and WAC 296-62, Part P.\n\n\n\nHAZWOPER refresher training is provided yearly to each employee operating the refrigeration system to ensure that the employee understands and adheres to the current operating procedures of the process. Training records are filed in the personnel records, located in office of Dale Davis.\n\n\n\n\n\n\n\n\n\nMechanical Integrity (68.73)\n\n\n\nMagi has prepared and implemented procedures to maintain the ongoing mechanical integrity of the refrigeration process equipment.  Some procedures or instructions were provided by refrigeration process equipment vendors.\n\n\n\nMagi has trained each employee involved in maintaining the ongoing mechanical integrity of the refrigeration process.  To ensure that the employee can perform the job tasks in a safe manner, each employee was trained in the hazards of the process, in how to avoid or correct unsafe conditions, and in the procedures applicable to the employee's job tasks.\n\n\n\nMagi performs inspections on the refrigeration process equipment.  Inspection procedures follow recognized and generally accepted good engineering practices.  The frequency of inspections of the process equipment is consistent with the applicable manufacturers' recommendations, industry standards or codes, good engineering practices, and prior operating experience.\n\n\n\nInspection records and further information regarding the mechanical integrity program are located in the refrigeration office.\n\n\n\n\n\nManagement of Change (68.75)\n\n\n\nMagi has an active Management of Change program, which is coordinated by Dale Davis and the Refrigeration Supervisor Richard Lyons.  Written procedures have b"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 26751,
      "SummaryText": "een established for any changes, including replace in kind.  Management of Change procedures and appropriate forms are located in office of Dale Davis.\n\n\n\n\n\nPre-Start Up Review (68.77)\n\n\n\nMagi's pre-start up reviews (PSSR) are done prior to any start of new equipment or process that have undergone an emergency shutdown.  PSSR are done under the Refrigeration Supervisor Richard Lyons.  In the case of new equipment start up, the PSSR is done in conjunction with the equipment vendor and the Refrigeration Supervisor Richard Lyons and the Director of Operations Dale Davis.\n\n\n\n\n\nCompliance Audits (68.79)\n\n\n\nMagi will certify every three years (or earlier) that compliance with Program 3 Prevention Program requirements has been evaluated to verify that the procedures and practices developed are adequate and are being followed.  The compliance audit will be conducted by at least one person knowledgeable in the process.\n\n\n\nMagi will prepare a report of the audit findings and promptly determine and document an appropriate response to each of the findings of the audit.  Documentation of deficiency corrections will be done.\n\n\n\nMagi will retain the two most recent compliance audit reports within the prior five-year period.\n\n\n\nAuditing and inspection procedures can be located in office of Dale Davis..\n\n\n\n\n\nIncident Investigation (68.81)\n\n\n\nMagi will investigate each incident that resulted in, or could reasonably have resulted in a catastrophic release.\n\n\n\nAn incident investigation will be initiated as promptly as possible, but not later than 48 hours following the incident.\n\n\n\nA summary will be prepared at the conclusion of the investigation including:\n\n\n\n1) Date of the incident;\n\n\n\n2) Date the investigation began;\n\n\n\n3) A description of the incident;\n\n\n\n4) The factors that contributed to the incident; and\n\n\n\n5) Any recommendations resulting from the investigation\n\n\n\nMagi will promptly address and resolve the investigation findings and recommendations.  Resolutions and corrective "
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 26751,
      "SummaryText": "actions will be documented.\n\n\n\nThe findings will be reviewed with all affected personnel whose job tasks are affected by the findings.  Investigation summaries will be retained for five years.\n\n\n\n\n\nEmployee Participation (68.83)\n\n\n\nMagi has developed an employee participation program in conjunction with their PSM program and Hazard Communications program.  All employees have been made aware of both PSM and RMP programs via monthly reports at the Magi Safety Committee meetings.  The PSM team has an employee representative as a member, as required by the PSM regulation.\n\n\n\n\n\nHot Work Permit (68.85)\n\n\n\nMagi has a hot work permit program, complying with PSM of highly hazardous chemicals.  The Refrigeration Supervisor Richard Lyons, who ensures that all hot work done on or around the covered process meets the standard, supervises the program.\n\n\n\nMagi has identified personnel who can authorize the hot work permit, perform the hot work, and personnel who are qualified for fire watch.  These personnel are identified in the Hot Work procedures.\n\n\n\nThe permit documents that the fire prevention and protection requirements in 29 CFR 1910.252(a) have been implemented prior to beginning hot work operations.  The permit indicates the date(s) authorized for hot work; and identifies the object on which hot work is to be performed.  The permit is kept on file until the completion of the hot work operations.\n\n\n\n\n\nContractors (68.87)\n\n\n\nContractor evaluation is performed by Magi on any contractor that works on or near the refrigeration process.  Contractors that do not meet the criteria under the PSM regulation are not evaluated.\n\n\n\nMagi obtains and evaluates information regarding the contractors safety performance and programs.  \n\n\n\nIn its communications with contractors, during evaluation, Magi also informs the contractor of:\n\n\n\n1) The known potential fire, explosion, or toxic release hazards associated with the refrigeration process (anhydrous ammonia).  \n\n\n\n2) Any information on ap"
    },
    {
      "ESSeqNum": 20,
      "FacilityID": 26751,
      "SummaryText": "plicable safety procedures, such as lockout/tagout.\n\n\n\n3) Any applicable portion of the emergency plan to the contractor.\n\n\n\nMagi will periodically evaluate the performance of the contractor in fulfilling their obligations under PSM.  As noted earlier, Magi's emergency response policy involves the preparation of response plans, training of employees and coordination with local emergency response organization.\n\n\n\n\n\nApplicability (40 CFR 68.90)\n\n\n\nMagi employees respond to incidents/releases involving ammonia.\n\n\n\nEMERGENCY  RESPONSE  PROGRAM \n\n(40 CFR 68.95)\n\n\n\n\n\nI    PURPOSE \n\n\n\n\n\nA   This emergency response plan is for all MAGI Inc. fruit packing and cold storage\n\n      facilities located in Brewster, Pateros, Omak and Okanogan. Magi is headquartered at\n\n      located at  26049 SR 97 Brewster, WA.\n\n\n\nB   This document is to ensure that Magi is properly prepared for  an unplanned or \n\naccidental discharge of anhydrous ammonia ( NH3 ), a hazardous substance. This \n\nplan addresses the actions to be taken by specific employees. No plan can \n\nanticipate every possible scenario but it's the responsibility of each employee to \n\ntake only the actions they can do safely and within the scope of their training.  This \n\nplan was designed specifically to conform to the following regulations:\n\n\n\n1. Occupational Safety and Health Administration, Process Safety Management of Highly Hazardous Chemicals Requirements 29 CFR 1910.119\n\n\n\n2. Environmental Protection Agency, Risk Management Programs for Chemical Accidental Release Prevention 40 CFR Part 68\n\n\n\n3. Washington State Labor & Industries Process Safety Management of Highly Hazardous Chemicals WAC 296-67 and  General Safety and Health Standard WAC 296-24\n\n\n\n\n\nII    SCOPE\n\n\n\nThis emergency response plan applies only to the Ammonia Refrigeration Engineering staff and the management teams that will assist them. Headed by the  Director of Operations.\n\n\n\n\n\nIII    STATEMENT OF POLICY\n\n\n\nIt is the policy of the management to implement the parame"
    },
    {
      "ESSeqNum": 21,
      "FacilityID": 26751,
      "SummaryText": "ters of this ammonia response plan by managing, properly training and outfitting specific employees in accordance with OSHA, EPA, Washington State Labor & Industries, and Department of Ecology regulations, in addition to good operating practices and basic common sense.\n\n\n\nIt's objective is to minimize the risks associated with an accidental release while simultaneously developing a plan to ensure an efficient and timely response. MAGI personnel shall cooperate with fellow employees and emergency responders, as directed, to assure successful resolution of any emergency, always providing for safety first.\n\n\n\n\n\nIV    FACILITY DESCRIPTION\n\n\n\n\n\nName:        Magi Inc.\n\n \n\nBrewster Address:    \n\n26049 SR 97\n\n            Brewster WA 98812\n\n\n\nPateros Address:\n\n            491 Industrial Way\n\n            Pateros WA 98846\n\n\n\nOkanogan Address:\n\n            124 Van Duyn St.\n\n            Okanogan, WA 98840 \n\n\n\nOmak Address:\n\n            716 E. 5th\n\n            Omak, WA 98841\n\n        \n\nMagi Inc. is fruit packing warehouse and cold storage facility located at three locations in the above listed cities. The Brewster facility is bordered primarily by commercial property, with residential areas of the City of Brewster approximately 1/4  mile to the southeast. The Pateros facility  is bordered primarily by open space , with residential areas of the City of Pateros approximately 1/4  mile to the southeast. The Okanogan facility is bordered primarily by commercial property, with residential areas of the City of Okanogan  approximately 1/2  mile to the west. The Omak  facility is bordered primarily by commercial property, with residential areas of the City of Omak surrounding the storage area. \n\n\n\n\n\nV    PROCESS DESCRIPTION\n\n\n\nA    Anhydrous Ammonia ( NH3 ) is commonly used as an effective refrigerant in cold storage facilities .  The type of refrigeration system used is a \"flooded\" system, using a float switch and an electric operating solenoid valve for liquid level control and a back pressure regulator to control temperature.  In this process the liquid refrigerant flow"
    },
    {
      "ESSeqNum": 22,
      "FacilityID": 26751,
      "SummaryText": "s from the liquid receiver through the liquid line, up to the electrically operated solenoid valve.  The evaporator in this system consists of a tubed coil.  It contains an electric solenoid valve, which maintains a constant level of liquid refrigerant under a low-side pressure. Vaporized refrigerant moves through the suction (vapor) line to the compressor where it is compressed to a high pressure and discharged into the condenser.  It is cooled by the condenser, returns to a liquid and flows into the liquid receiver.  There is approximately 23,215 pounds of NH3 on the Brewster site,   17,655 pounds of NH3 on the Pateros site,  21,830 pounds of NH3 on the Okanogan site and 3,136                 pounds of NH3 on the Omak site. \n\n\n\n\n\nVI    RESPONSE TEAM \n\n\n\nA    Members\n\n\n\nWho              Location    Position    Special     Respirator                                Training          Qualifications    \n\n    \n\n    Rick Lyons        Brewster    Refer. Tech.     HAZWOPER 24    Y\n\n    Terry     Gannon    Pateros     Asst.  Tech    HAZWOPER 24    Y     \n\n    Kevin    Tostenrude    Okanogan    Refer. Tech.    HAZWOPER 24    Y\n\n    Dale  Davis        Brewster/Ok.    Plant Mgr.    HAZWOPER 24        Y    \n\n    Troy Burnett        Pateros    Plant Mgr.     HAZWOPER 24    Y\n\n    Jason    Lyons        Brewster    Asst.  Tech    HAZWOPER 24    Y      \n\n    Mel Broughton    Okanogan    Refer. Tech.    HAZWOPER 24    Y          \n\n\n\nVII    INCIDENT \n\n\n\nA. General Information\n\n\n\n1. Severity Criteria has been developed in PSM meetings in order to create a more realistic review of the potential response dangers.\n\n\n\n2. The team shall be notified via Magi radios and/or cell phones and then by landline phone if necessary.  The facility shall be notified by phone that an emergency exists and for them to initiate the emergency evacuation process and to call 911.\n\n\n\n3. The Incident Command System will be followed for all emergency situations.\n\n\n\nB    Personal Protective Equipment ( PPE )\n\n\n\n1 Gaseous, low risk scenarios that an operator can fix,  such as oil draining problems, sight glass leaks or packing leaks require at least the correct use of nitrile rubber gloves and a full face m"
    },
    {
      "ESSeqNum": 23,
      "FacilityID": 26751,
      "SummaryText": "ask ammonia canister respirator.  Ammonia canister respirators are stored on the inside of all engine room doors.  Also the notification of another co-worker to respond and standby with at least a similar level of PPE is required. \n\n\n\n2 Any incident requiring a greater level of response will not be addresses and an immediate evacuation of the facility will be ordered.\n\n\n\n3 If  aerosol  or  liquid  ammonia  is present, the hazardous materials response team shall not enter for any reason.\n\n\n\n4 PPE maintenance, periodic testing, re-supply and storage will be the responsibility of the Refrigeration Supervisor.\n\n\n\nC    Discovery Phase\n\n\n\n1.      Before any emergency situations, employees should know the location of all \n\nexits and primary and secondary assembly areas.  Remember the way you entered may not be the best way to exit in an emergency. \n\n\n\n2.      Upon discovering any accidental NH3 release, immediately summon \n\nassistance via a supervisor and rescue anyone (including yourself) who is in \n\nimmediate danger from the NH3, if safe to do so.\n\n\n\n3.     Remove these people to the closest \"safe area\", simultaneously notifying             \n\n    other occupants to evacuate the area. \n\n\n\n4.   If the supervisor determines that a true, NH3 release, emergency does exist      \n\n  then all non response plan employees will proceed as provided in the \n\n  Emergency Evacuation Plan.\n\n\n\nD    Initial Stage\n\n\n\n1    Handling Releases of Ammonia\n\n\n\n* Establish Exclusion and Hot zones \n\n\n\n\n\n\n\n\n\n* Under our emergency response plan, employees may respond only to small releases or releases that can be handled without entering a Hot zone.\n\n\n\n* PPE requirements shall be established based on observed incident  severity.\n\n\n\n2 Low Risk Scenario Emergency Actions\n\n\n\n* Examples of  low risk situations are packing leaks, sight glass packing leaks or oil draining problems. A low risk situation can also be classified as a leak that isn't releasing product  rapidly, doesn't endanger people or the environment"
    },
    {
      "ESSeqNum": 24,
      "FacilityID": 26751,
      "SummaryText": " except by direct contact, can be managed safely by trained employees and will not spread to or affect off-site positions. \n\n\n\n* Response criteria shall be: \n\n\n\na) Activate the Emergency Evacuation process.\n\n\n\nb) Refrigeration engineers don appropriate PPE.\n\n\n\nb)    Refrigeration engineer immediately notifies via radio or cell  phone \n\nhis supervisor of the currant situation and the planned actions to \n\nremedy the problem.\n\n\n\nd)    Supervisor shall immediately respond to the situation and don PPE.\n\n\n\ne)    Supervisor makes contact with the operator and acts as standby \n\nuntil the situation is stabilized.\n\n\n\nf) Very small releases may be stopped by safe and limited direct action necessary on the leaking component. Releases at valve packing would meet this criteria.\n\n\n\ng) If the situation escalates, the supervisor shall order a facility wide evacuation and remove the team to a safe location as defined in the North American Emergency Response Guide ( NAERG ).\n\n\n\n3    High Risk Scenario Emergency Actions\n\n\n\n* Examples of a high risk situation: Forklift breaks a drain valve on a drop leg,  forklift hits evaporator, evaporator piping leaks, evaporator fan blade creates a leak, cracked pipe, leaking seals or a vessel ruptures.\n\n\n\n* Response criteria shall be \n\n\n\na) First trained refrigeration engineer on scene calls the front desk and requests a facility evacuation.  This person will also inform the front desk of any hazardous area(s) for the evacuees to avoid. This person also requests a call to 911 to bring fire and   \n\nlaw enforcement to staging . \n\n\n\nb) This person contacts the supervisor and gives a size-up report and sets up a cold zone staging area for responders.\n\n\n\nc) The supervisor shall order a facility wide evacuation and remove all employees to a safe location as defined in the NAERG.\n\n\n\nd) Operations, Staging, PPV Venting and Decon, R.I.T. and general cold zone support shall be provided by the Fire Department.  The Sheriff shall provide Community evacuation or Shelter in"
    },
    {
      "ESSeqNum": 25,
      "FacilityID": 26751,
      "SummaryText": " Place functions. The local police shall provide scene control outside the cold zone, while the Washington State Patrol will command the operation as Unified Command with  facility management.\n\n\n\n* A compressor room exposed to an unplanned ammonia release should be ventilated using the existing ventilation equipment. From a safe distance, outside a compressor room, the Fire Departments PPV fans could ventilate.\n\n\n\n* When it is impossible to sufficiently isolate and stop a small release, then it may be necessary to remotely pump down a section of piping or equipment.\n\n\n\n* Magi  personnel are not trained to respond to a larger ammonia release. \n\n\n\n* Releases of ammonia that are classified as areas that are suspect or proven to be  Inherently Dangerous to Life and Health ( IDLH ) should be approached by indirect operational methods such as closing valves and/or turning off equipment.\n\n\n\n* Recommended isolation distance for a large ammonia release is 300 feet in all directions then protecting persons downwind for 0.2 mile during the day and 0.5 mile during the evening. Source:    U.S. Dept. of Transportation Emergency Response Guidebook,  2000 edition )\n\n \n\n\n\nE    Communications\n\n\n\n1    Alarm Notification Process\n\n\n\n* All emergencies must be reported to management immediately. \n\n\n\n* Outside agencies should be contacted immediately if the incident is affecting or could affect the community, or if serious on-site conditions exist. Agency notification will be conducted upon the order of the Emergency Manager as defined in the Emergency Evacuation Plan.  \n\n\n\n* For incidents resulting in, injuries requiring hospitalization of two or more employees, or death of one or more employees, the Washington State Department of Labor and Industries shall be notified within 8 hours of the incident.  Notification shall be verbally  either in person, or by telephone, to the nearest office and will be conducted by  Dale Davis.\n\n\n\n* On scene & Incoming emergency responders will communicate via spare"
    },
    {
      "ESSeqNum": 26,
      "FacilityID": 26751,
      "SummaryText": " radios provided by the Fire Department or face to face.\n\n\n\n\n\nF    Agency Contact Numbers\n\n\n\n1 Emergency contacts ( fire, police and medical ) 911\n\n\n\n2 Follow-up notification in the event of an ammonia release:\n\n\n\na)    Okanogan County Local Emergency Planning Committee\n\n(LEPC)  via Connie Humphries at 422-7206.\n\n\n\nb)   Okanogan Co. Fire Department # 5    689-3757 for Brewster     \n\n      and Pateros.  322-1007 for Okanogan Chiefs cell #.\n\n\n\n* For releases in excess of 100 pounds of ammonia, the National Response Center (NRC) shall be notified within 24 hours of the release.  800-424-8802.\n\n    \n\n* Washington State Department of Ecology  (509) 575-2490 (24 hour # )\n\n\n\n* WA State Department of Labor and Industries 800-321-6742.\n\n\n\n3 Reporting criteria and agency notification should include the following \n\n                       information:\n\n\n\na)    The name, title, affiliation, address and telephone number of the person reporting the incident.\n\n\n\n  b)    The chemical name and an estimate of the quantity of the \n\n    hazardous substance(s) discharged.\n\n\n\n                      c)    Information regarding the extent of the release including:\n\n\n\n* A release has occurred which will probably not have an off-site impact; or\n\n\n\n* A release has occurred which will probably have an off-site impact.\n\n\n\n* The time, or estimated time, of the release, the projected duration and a brief description of the measures taken to terminate the release.\n\n\n\n* Information on any injuries or other health effects of  the hazardous substance.\n\n\n\n* The exact location of the discharge including:\n\n\n\n        I    For discharges from sites located on land, \n\n            the name of the site, the street address, the \n\n            municipality and the county.\n\n\n\n        II    For discharges on, under or into water, the \n\n            name of the water body, location of the \n\n            discharge with reference to a fixed point(s) \n\n            and a description of the area that the \n\n            discharge may reach.\n\n\n\n* Weather conditions, including temperature, wind direction and speed, and any expected "
    },
    {
      "ESSeqNum": 27,
      "FacilityID": 26751,
      "SummaryText": "off-site effects.\n\n\n\n* The actions taken to contain, clean up and remove the hazardous substances discharged.\n\n\n\n* Obtain case number for incident and name of individual the incident was reported to. Attachment A contains an emergency response notification form.  \n\n\n\n        G    Incident Command Functions   See Appendix  \n\n\n\nH    Evacuation Standards are established in the PSM Emergency Evacuation Plan.\n\n\n\nI    Shelter in Place\n\n\n\n1 This is a viable and safe option to evacuation in certain situations. It can be taken during an ammonia release to protect personnel from the ammonia vapor.  This procedure can be especially useful for the main office.  The idea is to have personnel stay inside of a building and close doors and windows, keeping the ammonia vapor out of the building.  Shelter-in-Place can be used by the EM calling for it during an emergency evacuation process, or if it is safer for employees to stay inside instead of evacuating through an ammonia release.  Upon being notified to take Shelter-in-Place, the following should be done:\n\n\n\n* Move to an area inside with the fewest doors and windows.  A room in the center of the building is best.\n\n\n\n* Shut all doors and windows, but do not lock doors.\n\n\n\n* Turn off any external air circulating equipment or turn HVAC controls to 100% internal circulation.\n\n\n\n* Seal off bottom of doors with towels, newspaper, tape, or any other item that will help keep ammonia vapors out.\n\n\n\n* Account for personnel and notify the EM, by radio if everyone is accounted for, or if there are personnel not accounted for.\n\n\n\n* Remain inside until directed by the EM, or designee, that it is safe to leave.\n\n\n\n* After it is safe to leave, open up the area and let the area air out.\n\n\n\n\n\nJ    Injuries\n\n\n\n1.   First Aid kits are kept in every department.\n\n\n\n2. In the case of serious injury, do not move the injured person unless absolutely \n\nnecessary.  Only provide assistance to the level of your training.  Call 911 \n\n\n\n3. Aids/HIV and Hepatitis B are the prim"
    },
    {
      "ESSeqNum": 28,
      "FacilityID": 26751,
      "SummaryText": "ary infectious diseases of concern in blood.  All blood should be assumed to be infectious.  These diseases can both be deadly.  In the event of a bleeding injury where first aid is needed, gloves will be used to prevent exposure to blood or other potentially infectious materials.\n\n\n\n\n\nK    First Aid Procedures\n\n\n\n1.      If the condition cannot be treated on-site, the injured should be transported \n\nto the hospital by local Emergency Medical Services. \n\n\n\n2.      If an injured person is sent off-site for treatment, notify   Dale  Davis who     \n\nwill ensure that the injured employees family is notified and make all other \n\nappropriate notifications, such as to the Department of Labor and \n\nIndustries.\n\n\n\nL    Decon\n\n\n\n            Provided by Fire Department's PPV Fans.    \n\n\n\n\n\nM    Incident Conclusion\n\n\n\nThe IC must determine at what point the incident can be safety considered concluded.  Also considerations must be made for monitoring or excluding the area from public access until such a time as the site can be determined to be safe and normal. \n\n    \n\n\n\nVI      TRAINING\n\n\n\n\n\nA    Emergency Evacuation Plan  \n\n\n\nAll employees shall receive training in the emergency evacuation action plan at the time of their initial hire and annual refreshers thereafter.  Unless otherwise specifically trained all employees are expected to do nothing further than evacuate a threatened area and if safe to report a possible release of ammonia to 911 .\n\n\n\nB    Response Training\n\n\n\n1. Refrigeration employees who are expected to respond to a minor release of ammonia shall receive training in the hazards of ammonia, proper PPE (personal protective equipment) and how to identify and respond to minor releases commensurate with 29 CFR 1910.120 (e).\n\n\n\n2. Employees who are expected to respond to any ammonia release, other than a minor release, shall receive training in accordance with WAC 296-62-3112, appropriate and required for their particular level of involvement.\n\n\n\n3. Training for the EM will occur at bi-yearly dri"
    },
    {
      "ESSeqNum": 29,
      "FacilityID": 26751,
      "SummaryText": "lls and subsequent critiques.\n\n\n\n4. Ammonia release responders shall drill with emergency service responders yearly.\n\n\n\n\n\nVII    PRELIMINARY ASSESSMENT OF THE SITUATION\n\n\n\nA    The refrigeration supervisor will assume the role of Response Team Leader ASAP.  Incoming aid will work within the ICS structure established by the HazMat Response Incident Commander working within the response chart provided in the appendix.  He shall also initiate and maintain a log of events during an emergency. The following initial information should be added to the checklist \n\nduring the preliminary assessment of the situation:\n\n\n\n1. Assessment of pre-incident site condition (condition of iced areas, surface \n\n                runoff, ground condition and containment capability and ambient \n\n                environmental conditions);\n\n\n\n2. Date and time of incident (as accurately as possible);\n\n\n\n3. Name of substance involved;\n\n\n\n4. Ammonia concentrations measured using the ammonia detectors;\n\n\n\n5. Estimated volume or weight of substance involved;\n\n\n\n6. Estimated duration of release;\n\n\n\n\n\n7. Cause of incident, if known;\n\n\n\n8. Names of persons and agencies contacted, time contacted, description of conversation and report numbers issued; and\n\n\n\n9. Record of control measures taken (include times of action when possible).\n\n\n\nB    The EM will assume the role of Planning / Finance Chief unless the assistant can fill these positions and the EM is moved to the Unified IC Position. He/she assesses  possible hazards both direct and indirect to human health and/or the environment or property both inside and outside of the plant \n\n\n\n\n\n\n\nVIII    TERMINATION AND FOLLOW-UP ACTIVITIES\n\n\n\nA    Incident Documentation/Reporting Requirements\n\n\n\n1. A written report may be required to be submitted to the Okanogan County Local Emergency Planning Committee, Department of Ecology and the National Response Center, as soon as practicable, after the initial reporting of an ammonia release. The agency will advise you  if they need a written report.\n\n\n\n2."
    },
    {
      "ESSeqNum": 30,
      "FacilityID": 26751,
      "SummaryText": " This written report should include:\n\n\n\n* The name, address and telephone number of the individual that reported the release;\n\n\n\n\n\n* The name, address and telephone number of the individual submitting the report;\n\n\n\n* The source of the release;\n\n\n\n* The location of the release, as follows:\n\n\n\na    For discharge on land or into air, the name of the site, the \n\nstreet address, the municipality and the county of facility \n\ninvolved; or\n\n\n\nb    For discharge on, under or into water, the name of the \n\nwater body, the latitude and longitude of the place the \n\ndischarge originated and a map identifying the areas affected \n\nby the discharge.\n\n* The chemical name and Chemical Abstract Service (CAS) Number of each of the hazardous substances discharged (CAS Number for Ammonia is 7664-41-7); \n\n\n\n* The quantities of each hazardous substance discharged, including best estimates if the quantities are unknown;\n\n\n\n* The date and time at which the discharge began, the date and time at which the discharge was discovered, the date and time at which the discharge ended and the date and time when outside agencies were notified;\n\n\n\n* A detailed description of the actions taken;\n\n\n\n* The corrective actions or countermeasures taken to mitigate future releases; and\n\n\n\n* Additional preventive measures taken or proposed to minimize the possibility of recurrence.\n\n\n\n* Plan table top and or drills with the key players for the future.\n\n\n\n\n\nIX        INCIDENT CRITIQUE\n\n\n\nA    Magi Inc. will conduct a critique of any incident that required the activation of this plan.  The purpose of the critique is to evaluate the actions taken during the plan's activation and     determine what is needed, if anything, to improve the emergency plan.\n\n\n\nB    The critique will include all personnel that IC Chiefs and Command Staffers feel are appropriate.\n\n\n\nC    The critique should be held anywhere from 5 to 10 days after the incident \n\nand should be facilitated by personnel not involved in the incident.\n\n\n\nD    Areas that should be include"
    },
    {
      "ESSeqNum": 31,
      "FacilityID": 26751,
      "SummaryText": "d in the critique are:\n\n\n\n1. How did evacuation procedures work?\n\n\n\n2. How well did incident communications work?\n\n\n\n\n\n3. How well was the overall incident managed?\n\n\n\n4. Safety concerns, equipment replacement or modifications and capabilities analyzed.\n\n\n\n\n\nX    UPDATE AND REVIEW \n\n\n\nA    This plan will be reviewed and updated, as appropriate, once ever two (2) years.\n\n\n\nB    After each implementation of Magi Inc.'s Ammonia Release Response Plan, the EM will complete the Emergency Response Plan Assessment Form, Attachment C, and submit it to the Operations Manager within 30 days.  The Refrigeration Supervisor in conjunction with the PSM Committee will determine when amendments of plan are appropriate.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAttachment A\n\nThis page intentionally left blank.\n\n\n\n\n\nEmergency Response Notification Form\n\nPart 1\n\n\n\nNational Response Center\n\nTelephone:\n\n1-800-424-8802\n\nLocal Emergency Planning Cmt\n\nTelephone:\n\n1-509-422-7206 (Emergency Management)\n\nState Ecology 24 hr reporting #\n\nTelephone:\n\n1-509-575-2490\n\n\n\n\n\n\n\nFire Department \n\nTelephone:\n\n9-1-1 \n\nPolice Department\n\nTelephone:\n\n9-1-1 \n\nOther \n\nTelephone:\n\n\n\n\n\nPart 2\n\nThe following script should be followed when making agency notifications.\n\n\n\nThis is Magi Inc., at __________________\n\nMy name is (state your name).\n\nI am the (insert your position.), and the telephone number is ( #)\n\nI am calling to report a (release/spill) of (insert name of material).\n\nThis leak occurred at (insert time and date) and has/has not been contained as of this moment. \n\n\n\nThis leak occurred at (insert time and date) and is ongoing and is not expected to be contained/stopped until (estimate time leak will be stopped).\n\nThis is a (choose one):\n\nSite Emergency: Release has occurred and will probably not have an off-site impact.\n\nGeneral Emergency: Release has occurred which will probably have an off-site impact.\n\n\n\n\n\nThe estimated quantity of (insert name of material) released is (insert quantity or un"
    },
    {
      "ESSeqNum": 32,
      "FacilityID": 26751,
      "SummaryText": "known).\n\nThe current weather conditions, as measured at the plant, are a wind speed of (insert speed) in a direction that is (insert from  to direction).\n\nWe have (insert number) of injured personnel who will/will not require medical assistance.\n\nWe need/do not need your assistance at this time to (describe what you need).\n\nDo you have any questions?\n\n\n\n\n\nAttachment B\n\nThis page intentionally left blank.\n\n\n\n\n\n\n\n\n\n EM' s Checklist and Operations Package\n\nChecklist - Hazardous Material Release\n\n\n\nInitial Information\n\n\n\nDate\n\nIncident Number\n\n\n\n\n\nWhat happened?\n\nWind Direction\n\n\n\n\n\n\n\nOutside air temperature\n\n\n\n\n\n\n\nTemp. in the area of the spill\n\n\n\n\n\nWhen did it happen?\n\n\n\n\n\n\n\nWhere did it happen?\n\n\n\n\n\n\n\nWho reported it?\n\n\n\n\n\n\n\nFor any of the following questions answered \"No\", list the planned action items below.\n\n\n\n\n\n\n\nHas the area been evacuated?\n\n[ ]Yes\n\n[ ]No\n\nTime\n\nIf evacuated, have all employees been accounted for?\n\n[ ]Yes\n\n[ ]No\n\nTime\n\nHas XXX Inc. management been notified?\n\n[ ]Yes\n\n[ ]No\n\nTime\n\nHas the Fire Department been notified?\n\n[ ]Yes\n\n[ ]No\n\nTime\n\nHas the Police Department been notified?\n\n[ ]Yes\n\n[ ]No\n\nTime\n\nHas LEPC been notified?\n\n[ ]Yes\n\n[ ]No\n\nTime\n\nHas EPA been notified?\n\n[ ]Yes\n\n[ ]No \n\nTime\n\nWere there any injuries? \n\n[ ]Yes\n\n[ ]No\n\n\n\nAre there medical personnel at the site?\n\n[ ]Yes\n\n[ ]No\n\n\n\nWhat type of chemical has been spilled?\n\n\n\n\n\n\n\nWhat type of chemicals are in the area?\n\n\n\n\n\n\n\nAny physical hazards in the area?\n\n\n\n\n\n\n\nWhat has been done so far?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAction Items \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAssignment Sheet Incident Command System\n\n\n\nIncident Commander:\n\nSafety Officer:\n\nOperations Chief\n\nResponse Team Leader\n\nHazMat Safety Officer\n\nResponder #1:\n\nResponder #2:\n\nResponder #3:\n\nResponder #4\n\nDecontamination:\n\nAssistant:\n\nFirst Aid:\n\n\n\nSize Up\n\n\n\nOn a drawing of the area indicate the following:\n\n    1.    Probable spill location.\n\n    2.    Safest point of entry.\n\n    3.    Routes of exit once inside.\n\n    4.    Delineate the hot zone.\n\n    5.    Locate the comman"
    },
    {
      "ESSeqNum": 33,
      "FacilityID": 26751,
      "SummaryText": "d post.\n\n    6.    Locate decontamination areas.\n\n\n\nAction\n\n\n\n    1.    Move equipment to an area that is not affected by the release (the cold zone). This includes all self-contained breathing apparatus, PPE, ropes, flashlights, drinking liquids, materials for decontamination, fans, first aid supplies, ladders, tools, etc.\n\n    2.    Equip two responders with SCBA, PPE and sampling equipment and have them take a sample just inside the doorway to the release  area.\n\n    3.    Based on the reading, the type of protective clothing that is required can be determined. (If the chemical is harmful to the skin, chemical suit protection is required.)\n\n    4.    If the reading is less than 1/4 of the LEL for that chemical (in the case of ammonia this will be 4%), the two responders can enter and search for the spill or leak. Readings should be taken every 20 feet and if at any time the readings approach 4%, the responders are to exit immediately.\n\n    5.    Equip a third responder and have him stay at the edge of the hot zone and man the rope attached to one of the two responders.\n\n    6.    Confirm ventilation has automatically started.\n\n    7.    After the release site has been secured, the responders will exit and go to the decontamination area.\n\n\n\n\n\nPost Operations\n\n\n\nTime leak was secured:\n\n\n\nEstimated duration of release:\n\n\n\nTime building was safe to re-enter:\n\n\n\nDecontamination:\n\n\n\n\n\nTime completed:\n\n\n\nMethod of disposal of contaminated water:\n\n\n\nEquipment cleaned and stored:\n\nSelf-Contained Breathing Apparatus:\n\n\n\n\n\nBottles refilled:\n\n\n\nCleaned and disinfected:\n\n\n\nStored properly:\n\nCalculate the amount of chemical lost, and if above reportable quantities, make the suitable reports.\n\n\n\nHave each member of the response team write a short report of his actions during the emergency.\n\n\n\nConduct a critique of the operation.\n\n\n\n\n\nClean-Up\n\n\n\nDetermine the chemical concentration remaining. This is done by sampling.\n\n\n\nUse one or all of the three methods for elimination of the contamination.\n\n\n\n\n\nVentilation\n\n\n\nAbsorption\n"
    },
    {
      "ESSeqNum": 34,
      "FacilityID": 26751,
      "SummaryText": "\n\n\nNeutralization\n\n\n\nLog of Emergency Responders\n\n\n\nName:\n\nTime Entry:\n\nTime Exit:\n\nName:\n\nTime Entry:\n\nTime Exit:\n\nName:\n\nTime Entry:\n\nTime Exit:\n\nName:\n\nTime Entry:\n\nTime Exit:\n\nName:\n\nTime Entry:\n\nTime Exit:\n\nName:\n\nTime Entry:\n\nTime Exit:\n\nName:\n\nTime Entry:\n\nTime Exit:\n\nName:\n\nTime Entry:\n\nTime Exit:\n\nName:\n\nTime Entry:\n\nTime Exit:\n\nName:\n\nTime Entry:\n\nTime Exit:\n\n\n\n\n\n Attachment C\n\nMAGI Inc.\n\nEmergency Response Plan Assessment Form\n\n\n\nThis form is to be completed after each implementation of the emergency response plan and submitted to Corporate within 30 days.\n\n\n\nDate Emergency Response Plan was Implemented:\n\n\n\nTime Emergency Response Plan was Implemented:\n\n\n\n\n\nPlan was implemented for a (please circle one):\n\n\n\n\n\n\n\n\n\n\n\n  Drill\n\n  Fire\n\n  Release\n\n  Other (Specify):\n\nWere there any problems in implementing the plan?\n\n\n\n\n\n\n\n\n\n\n\n[ ]Yes\n\n[ ]No\n\n\n\n\n\n\n\nComments:\n\n\n\n\n\n\n\nWas the performance of the site personnel satisfactory?\n\n\n\n\n\n\n\n\n\n\n\n[ ]Yes\n\n[ ]No\n\n\n\n\n\n\n\nComments:\n\n\n\n\n\n\n\nWas the performance of the emergency response team satisfactory?\n\n\n\n\n\n\n\n\n\n\n\n[ ]Yes\n\n[ ]No\n\n\n\n\n\n\n\nComments:\n\n\n\n\n\n\n\nWas the treatment of exposed personnel on-site adequate?\n\n\n\n\n\n\n\n\n\n\n\n[ ]Yes\n\n[ ]No\n\n[ ]N/A\n\n\n\n\n\nComments:\n\n\n\n\n\n\n\nWas the treatment of exposed personnel off-site adequate?\n\n\n\n\n\n\n\n\n\n\n\n[ ]Yes\n\n[ ]No\n\n[ ]N/A\n\n\n\n\n\nComments:\n\n\n\n\n\n\n\nWas the on-site communications systems adequate?\n\n\n\n\n\n\n\n\n\n\n\n[ ]Yes\n\n[ ]No\n\n[ ]N/A\n\n\n\n\n\nComments:\n\n\n\n\n\n\n\nWas the off-site communications systems adequate?\n\n\n\n\n\n\n\n\n\n\n\n[ ]Yes\n\n[ ]No\n\n[ ]N/A\n\n\n\n\n\nComments:\n\n\n\n\n\n\n\nWas the emergency power and lighting systems adequate?\n\n\n\n\n\n\n\n\n\n\n\n[ ]Yes\n\n[ ]No\n\n[ ]N/A\n\n\n\n\n\nComments:\n\n\n\n\n\n\n\nRecommendations for changes in equipment, procedures, additional comments, etc.:\n\n\n\n\n\n\n\n\n\n\n\nSignature of EM:\n\n\n\n\n\n\n\nDate\n\n\n\n            RMP                                \n\n\n\n\n\n\n\n\n\n15\n\nFeb 2002                                 Response Plan        \n\n\n\n\n\n\n\n\n\n45\n\nAug 2002        Response Plan\n\n\n\n        \n\n\n\n"
    }
  ]
}