{
  "FacilityID": 26911,
  "FacilityName": "BLACKHAWK FS, Inc. - Forreston Location",
  "FacilityStr1": "Rte 26 North",
  "FacilityStr2": "703 N. Walnut Street",
  "FacilityCity": "Forreston",
  "FacilityState": "IL",
  "FacilityZipCode": "61030",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17141",
  "LEPC": "Ogle County LEPC",
  "FacilityLatDecDegs": "42.131389",
  "FacilityLongDecDegs": "89.580556",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 5969019,
  "Company2DUNS": 0,
  "OperatorName": "CARROLL SERVICE COMPANY",
  "OperatorStr1": "505 IL Rte 64",
  "OperatorStr2": "PO Box 25",
  "OperatorCity": "Lanark",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "61046",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ramon Woessner",
  "RMPTitle": "ENVIRONMENTAL/SFTY COMPLIANCE SPEC",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000047291",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "ILLINOIS DEPARTMENT OF AG",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-10-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-10-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-10-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-10-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 42.1179,
  "FRS_Long": -89.5851,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS BLOCK/TRACT-1990-CENTROID",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 38566,
      "AltID": "Anhydrous Ammonia Storage",
      "FacilityID": 26911,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 39482,
          "ProcessID": 38566,
          "NAICSCode": "42291",
          "_desc": {
            "NAICS_CODE": "42291",
            "NAICS_DESCRIPTION": "Farm Supplies Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 50757,
          "ProcessID": 38566,
          "ChemicalID": 56,
          "Quantity": 112000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 550757,
          "ProcessID": 38566,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26911,
      "SummaryText": "EXECUTIVE SUMMARY-CARROLL SERVICE COMPANY FORRESTON FACILITY\n\nNote that this facility was the property of BLACKHAWK FS and they have since gone out of business.                                              \n\n1. Facility accidntal relaease and emergency response policy.\n\nThe management and employees of Carroll Service Company are committed tot he prevention of any accidental releases of anhydrous ammonia.  If an accidental release should accur, the facility is prepared to work with the local fire department, or other authorities, to mitigate any release and minnimize the impact of the release to people and the environment.\n\n2.  The stationary source and the regulated substances handled.\n\nThe primary activity at the facility is the storage and blending of fertilizers for sale to farmers.  Anhydrous ammonis is received, stored, and distributed for direct application as a crop production nutrient.  Access to the site is restricted to authorized employees, authorized management personnel and authorized contractors.\n\nThe maximum quantity of anhydrous ammonia that can be stored would be 112,000 pounds, this would include the large tank and the nurse tanks.\n\n3. The worst-case release scenario and the alternative release scenario.\n\nThe worst-case release scenario would be the release of the total contents of the storage tank released as a gas over a 10 minute period.  The maximum quantity released would be 56,000 pounds, this would represent the volume of the largest storage tank as limited by design.\n\nThe distance to the endpoint of .14 mg/L for the worst-case scenario is .84 miles.\n\nThe alternative release scenario based on the most likely potential incident is a release from a break in a transfer hose.\n\nThe distance to the endpoint of .14 mg/L for the alternative scenario is .1 miles.  This release has the possibility of extending beyond the facility boundaries.\n\n4. The accidental release prevention program.\n\nThis facility complies with EPA's Accidental Release Prevention"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26911,
      "SummaryText": " Rule and with all applicable state codes and regulations.  This facility has implemented the provisions of \"Safety Requiarements for the Storage and Handling of Anhydrous Ammonia, K-61.1\", published by The American National Standards Institute, Inc. as adopted by state regulation and the standards of the U.S. Occupational Safety and Health Administration (OSHA), 29 CFR 1910.111, \"Storage and Handling of Anhydrous Ammonia\".\n\n5. Five year accident history.\n\nThere have been no accidental releases of anhydrous ammonia in the past five years that have caused any deaths, injuries, or significant property damage at the facility; nor to our knowledge, have resulted in offsite deaths, injuries, evacuations, shelter in place, property damage, or environmental damage.\n\n6. The emergency response program.\n\nThe facility has:\n-a written emergency action plan, in accordance with OSHA standard, 29 CFR 1910.38;\n-provided state and local authorities the emergency planning and community right-to-know information as required under SARA Title III (EPCRA);\n-a written emergency response plan, in accordance with OSHA standard, 29 CFR 1910.120, including pre-emergency planning and employee training.\n\n7. Planned changes to improve safety.\n\nSafety improvement is and on=going process at the facility.  Periodic evaluations are performed to assess the maintenance of safe conditions.  There are no specific safetly recommendations for implementation at this time.\n\n\nEXECUTIVE SUMMARY FOR A NURSE TANK\n\nThe storage of an anhydrous ammonia nurse tank is 1,000 gallon.  The maximum pounds that can be stored is 5,000 pounds.\n\nThe worst case scenario would be the release of the nurse tanks entire contents as a goas over 90 minutes.  The maximum quantity released would be 5000 pounds which represents the volume of the nurse tank or as limited by design standards.\n\nThe distance to the endpoint of .14 mg/L for the worst-case scenario is .36 miles.\n\nThe alternative release scenario based on the most likely po"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26911,
      "SummaryText": "tential incident is a release from a failed safety valve.  There is no emergency shutdown considered to limit the amount of product released.\n\nThe distance to the endpoint of .14 mg/L for the alternative scenario is .1 miles.  This release has the possibility of reaching beyond the facility boundary.  The release rate is 52 lbs/min.\n\nThis facility complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  This facility has implemented the provisions of \"Safety Requirements for the Storage and Handling of Anhydrous Ammonia, K-61.1\". Published by The American National Standards Institue, Inc. as adopted by state regulation and the standards of the U.S. Occupational Safety and Health Administration (OSHA), 29 CFR 1910.111, \"Storage and Handling of Anhydrous Ammonia\".  Compliance with these regulations and on-going training of our employees make up our accident program.\n\nThere have been no accidental releases of anhydrous ammonia in the past five years that:\n-Have caused any deaths, injuries, or significant property damage at the facility; nor\n-To our knowledge, have resulted in offsite deaths, injuries, evacuations, shelter inplace, property damage, or environmental damage.\n\nThe emergency response program.\nThe facility has:\n-a written emergency action plan, in accordance with OSHA standard, 29 CFR 1910.38;\n-provided state and local authorities the emergency planning and community right-to-know information as required under SARA Title III (EPCRA)>\n\nIn the event of an emergency involving anhydrous ammonia, it is our policy to notify the Forreston Fire Department and the Ogle County LEPC and request that they respond to the emergency.  Our emergency action plans have been coordinated with both the fire department and the Ogle County LEPC.\n\nPlanned chages to improve safety:\nSafety improvement is an on-going process at the facility. Periodic evaluations are performed to assess the maintenance of safe conditions.  There are n"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26911,
      "SummaryText": "o specific safety recommendations for implementation at this time."
    }
  ]
}