{
  "FacilityID": 26919,
  "FacilityName": "Calcasieu Refining Company",
  "FacilityStr1": "4359 West Tank Farm Road",
  "FacilityStr2": null,
  "FacilityCity": "Lake Charles",
  "FacilityState": "LA",
  "FacilityZipCode": "70605",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22019",
  "LEPC": "Calcasieu Parish LEPC",
  "FacilityLatDecDegs": "30.1325",
  "FacilityLongDecDegs": "-93.320278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "crctoni@xspedius.net",
  "FacilityDUNS": 118488154,
  "ParentCompanyName": "Transworld Oil USA, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 58754722,
  "Company2DUNS": null,
  "OperatorName": "Calcasieu Refining Company",
  "OperatorStr1": "4359 West Tank Farm Road",
  "OperatorStr2": null,
  "OperatorCity": "Lake Charles",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70605",
  "OperatorZipCodeExt": null,
  "FTE": 38,
  "OtherEPAFacilityID": "3585",
  "EPAFacilityID": "100000071469",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "0520-00050-V1",
  "SafetyInspectionDate": "1998-08-01 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2002-11-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-10-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2002-10-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-10-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 30.1338,
  "FRS_Long": -93.3206,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 38576,
      "AltID": "LPG Storage Vessel,TK-201",
      "FacilityID": 26919,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 50771,
          "ProcessID": 38576,
          "ChemicalID": 155,
          "Quantity": 310000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 36024,
              "ProcessChemicalID": 50771,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 36025,
              "ProcessChemicalID": 50771,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 36026,
              "ProcessChemicalID": 50771,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 36027,
              "ProcessChemicalID": 50771,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 36028,
              "ProcessChemicalID": 50771,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 39492,
          "ProcessID": 38576,
          "NAICSCode": "32411",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 21623,
              "Process_NAICS_ID": 39492,
              "SafetyReviewDate": "2002-08-01 00:00:00",
              "PHA_Date": "1999-05-21 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-05-21 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Fire safe fusible link (on truck loading line and truck vapor return line).  Temp.>200F melts link and closes valve.",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Administrative control taken into consideration - Full tank (10'10\"). Adm. Control limits liquid height to 9'8\".",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Combustible Gas Sensors - Five located around tank perimeter and one located above SRV.",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Implement an auto-dialing system to call people within the \"hazard zone\" if there is a release with the potential for off-site impact & erect warning sign warning people to stay 200' from marker.",
              "OpProceduresReviewDate": "2002-08-01 00:00:00",
              "TrainingReviewDate": "2002-08-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-08-01 00:00:00",
              "EquipmentInspectionDate": "2002-08-01 00:00:00",
              "EquipmentTested": "TK-201 LPG Tank Hi-Level Alarm",
              "ChangeMgmtDate": "1999-01-04 00:00:00",
              "ChangeMgmtReviewDate": "2002-08-01 00:00:00",
              "PreStartupReviewDate": "1999-02-04 00:00:00",
              "ComplianceAuditDate": "2002-06-02 00:00:00",
              "AuditCompletionDate": "2002-08-01 00:00:00",
              "IncidentInvestigationDate": "1999-02-12 00:00:00",
              "InvestigationChangeDate": "1999-05-12 00:00:00",
              "ParticipationPlansReviewDate": "1998-08-01 00:00:00",
              "HotWorkPermitReviewDate": "1998-08-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-02-01 00:00:00",
              "ContractorSafetyEvalDate": "1998-08-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 31885,
                  "PreventionProgram3ID": 21623,
                  "ProcessChemicalID": 50771
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 26919,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-08-31 00:00:00",
    "ERTrainingDate": "1999-05-30 00:00:00",
    "CoordinatingAgencyName": "Calcasieu Parish LEPC",
    "CoordinatingAgencyPhone": "3374373512",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26919,
      "SummaryText": "3585 LDEQ Facility ID Number\n\nExecutive Summary\n\n1.0 Accidental Release Prevention and Emergency Response Policies\n\nCalcasieu Refining Company (CRC) operates a petroleum refinery located about five miles southwest of Lake Charles, Louisiana in Calcasieu Parish.  Parts of the operations at this facility involve the storage of liquefied petroleum gas (LPG) and are subject to the Chemical Accident Prevention Provisions located in Part 68 of Title 40 of the Code of Federal Regulations (i.e., 40 CFR 68).\n\nCRC is strongly committed to protecting its employees, the public, and the environment.  As part of this commitment, CRC maintains an operational policy that requires compliance with all applicable federal, state, and local regulations.  Significant resources have been used to implement a Process Safety Management program that is compliant with 29 CFR 1910.119.  CRC¿s Process Safety Management program addresses process safety, hazard analysis, management of change, mechanical integrity, operating procedures, emergency response, and employee training and meets a portion of the requirements of the Risk Management Program mandated by 40 CFR 68.\n\nStorage tank TK-201 stores up to 310,000 pounds of LPG.  CRC conducted a process hazard analysis for the LPG production and storage system under its Process Safety Management program.  In addition, this storage tank meets the criteria for being classified as a Program Three process under 40 CFR 68.  CRC has prepared the attached Risk Management Plan to address specific actions taken in accordance with Subpart G of the Chemical Accident Prevention Provisions.\n\nCRC has implemented over-fill controls on storage tank TK-201 to prevent accidental releases that might result from over-filling this storage tank.  In addition, the LPG storage tank is monitored daily by both the senior operator and supervisory staff.  The LPG storage tank has a height of 10 feet, 10 inches.  CRC has implemented an administrative control that effectively"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26919,
      "SummaryText": "limits the liquid height of LPG in Tank Number 201 to nine (9) feet, eight (8) inches.  A high-level alarm activates when the liquid height reaches seven (7) feet, six (6) inches.  A high-high level alarm activates at nine (9) feet.  Both of these alarms activate a flashing light and siren when the liquid height reaches the alarm set point.  In case of either alarm, the LPG customer is contacted for immediate pickup; which usually occurs within two hours.  If the event the LPG liquid height were to accidentally reach nine (9) feet, eight (8) inches, the operator would manually route the LPG production to one of the crude oil tanks.\n\nCRC¿s Emergency Response Plan meets or exceeds the requirements as set forth in 40 CFR 68.95 (Risk Management Rule, Subpart E ¿ Emergency Response), 29 CFR 1910.119(n) (Process Safety Management of Highly Hazardous Chemicals) and 29 CFR 1910.38(a) (OSHA¿s Emergency Action Plans Regulation).  The primary objective of the Emergency Response Plan is to address what action CRC employees should take in the event of an accidental release of hazardous chemicals.  The Emergency Response Plan contains emergency notification procedures and telephone numbers for the local fire district and other agency contacts (e.g., Calcasieu LEPC).  As part of its Risk Management Program, CRC will implement an automatic calling service that will notify potentially affected neighbors if an emergency upset has the potential to cause an off-site impact.  In addition, CRC will erect a warning sign near the storage tank warning recreational users of the Calcasieu River to remain at least 200 feet from the marker.  \n\n2.0 Stationary Sources and Regulated Substances\n\nThe Chemical Accident Prevention Provisions consider two types of hazards: acute toxicity from inhalation and the effects from fires and explosions.  Owners or operators of stationary sources may be subject to the Risk Management rule if they conduct an activity that involves the use, storage, or production"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26919,
      "SummaryText": "of a Regulated Substance (RS) in excess of its listed threshold quantity.  The original RS listing rule was promulgated on January 31, 1994 (see 59 FR 4478) and was modified by two subsequent Federal Register notices (see 62 FR 45132 and 63 FR 640).  The current list rule includes 77 toxic and 63 flammable RSs.\n\nCRC operates a petroleum refinery consisting of an atmospheric distillation unit, supporting utility units (e.g. wastewater treatment), a products pipeline, and various transfer operations (e.g., loading of naphtha product to barges).  The facility operates 24 hours a day and may process up to 16,000 barrels per stream day of crude oil.  The CRC facility meets the definition of stationary source as contained in 40 CFR 68.3.\n\nThe first step in determining if the Chemical Accident Prevention Provisions are applicable is to determine the quantity of RSs used, stored, or produced in any processes.  If the amount of RS exceeds the threshold quantity provided for that RS, then that process is subject to the applicable provisions of the rule.  The CRC facility is a petroleum refinery and uses sweet, domestic crude oil as a raw material.  The raw crude oil is unloaded from trailer trucks or barges and pumped to crude oil storage tanks for storage prior to processing.  Processing the crude oil consists of pumping the crude oil from the storage tanks to the desalters, heating it in process heaters, and then charging the heated crude oil to the atmospheric distillation column.  During distillation, various fractions of hydrocarbon product are created by separating the components of the crude oil by boiling point.  The various fractions of hydrocarbon product are then treated in downstream units.  After treatment, the products (i.e., LPG, naphtha, kerosene, diesel, and reduced crude) are routed to storage tanks for storage prior to shipment.  Shipment may be by trailer truck, product pipeline, or barge.\n\nBased on a through review of the CRC facility there is only one a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26919,
      "SummaryText": "ffected process with a RS present above its threshold quantity.  This process is the storage of LPG in storage tank TK-201.  LPG is a mixture of various light hydrocarbon compounds including propane, butane, and pentane.  The entire LPG mixture is considered to be a RS because it has a NFPA flammability hazard rating of four (4).  The LPG contains the following listed RSs: propane (9 weight percent), butane (21.2 weight percent), pentane (12.4 weight percent), ethane (< one weight percent), and methane (< one weight percent).  Accounting for administrative controls, up to 310,000 pounds of LPG may be stored in storage tank TK-201.\n\nThe CRC facility does not have any processes that contain toxic RSs in amounts or conditions that warrant review under the Chemical Accident Prevention Provisions.  For example, hydrogen sulfide (CAS number 7783-06-4) is present in the crude oil in concentrations less than one percent by weight of the mixture.  Therefore, under the mixture rule, the amount of hydrogen sulfide in the mixture is not subject to the review.  Other flammable mixtures present in the facility have an NFPA flammability rating of three or less and are; therefore, exempt under the mixture rule.  For example, naphtha has an NFPA rating of three (3), kerosene has an NFPA rating of two (2), diesel has an NFPA rating of two (2), and reduced crude has an NFPA rating of one (1).\n\n3.0 Worst-Case and Alternative-Case Release Scenarios\n\nThe Chemical Accident Prevention Provisions require that the consequences from a worst-case release be estimated separately for toxic and flammable RSs.  The CRC facility does not have any process with a toxic RS in excess of a threshold quantity.  However, it does have one process with flammable RSs in excess of their associated threshold quantities.  The LPG mixture includes propane, butane, pentane, ethane, and methane; which are all RSs.  Based on the LPG composition, and assuming storage tank TK-201 is storing LPG at capacity, the LPG s"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 26919,
      "SummaryText": "torage tank contains 27,900 pounds of propane; 65,720 pounds of butane; and 37,820 pounds of pentane\n\nOn April 27, 1999, the United States of Appeals granted a stay of the Chemical Accident Prevention Provisions as it applies to facilities having more than 10,000 pounds of propane in a process.  This effectively prevents propane facilities from having to file a Risk Management Plan by the June 21, 1999 deadline.  In addition, the USEPA proposed in an April 20, 1999 memorandum entitled Fuels & The Risk Management Program that it intends to exempt flammable hydrocarbon fuels stored in quantities of less than 67,000 pounds.  However, as noted above, the LPG storage tank has a storage capacity of up to 310,000 pounds and holds butane and pentane in excess of their 10,000 pound threshold quantity.  Therefore, the CRC facility will still be required to file its Risk Management Plan on or before June 21, 1999.\n\nThe off-site consequence analysis for the CRC facility was conducted using the methodology provided by the United States Environmental Protection Agency (USEPA) in the RMP Off-Site Consequence Analysis Guidance document.  The worst-case release scenario for flammable RSs at the CRC facility involves the sudden release of 310,000 pounds of LPG.  For modeling purposes, the worst-case analysis was conducted assuming all of the LPG was propane.  Propane is a major component of the LPG mixture and has the highest heat of combustion of all the RSs in the LPG.\n\nAdministrative controls that limit the height of the liquid in storage tank TK-201 were taken into consideration during the off-site consequence analysis.  The amount of LPG released during the worst-case release scenario assumes storage tank TK-201 has nine (9) feet, eight (8) inches of LPG in the tank.  It is assumed the total quantity of the LPG mixture (i.e., 310,000 lbs.) is released during a ten-minute period, forms an explosive vapor cloud, and ignites in a vapor cloud explosion.\n\nModeling was conducted using"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 26919,
      "SummaryText": "the USEPA¿s look-up tables and the results of the calculation were verified using Trinity Consultants Inc.¿s Breeze Haz Advisor software.  The distance to the flammable endpoint of one psig overpressure was estimated to be 0.55 miles.  The hazard zone for the flammable worst-case release scenario is a circle with its center on top of storage tank TK-201 and a radius of 0.55 miles.\n\nLandView¿ III and the MARPLOT® mapping system were used to estimate the potentially affected public receptors within the hazard zone.  Potentially affected environmental receptors within the hazard zone were determined using a United States Geological Survey (USGS) map.  Based on LandView¿ III, the residential population within the hazard zone is 65. LandView¿ III uses a Block Group Uniform Density Method to estimate population within a radius.  This method may result in an overcount if the circle includes areas where no people live, such as over water and industrial areas.  The hazard zone for the worst-case release scenario does include a large water area (i.e., Calcasieu River).  Based on a reconnaissance of the local area there are about 18 people residing within the hazard zone, excluding any workers that may be present on the Equilon property adjacent to the CRC facility.\n\nA review of the USGS Westlake Quadrangle Map for Calcasieu Parish, Louisiana indicates there are no institutions (e.g., schools, hospitals, prisons), parks, or environmental receptors  within the hazard zone.  In addition, there are no major commercial or office buildings within the hazard zone.  The hazard zone does include a recreational area (i.e., a portion of the Calcasieu River) and the Equilon office building; which is normally staffed eight hours per day, five days per week.\n\nWorst-case release scenarios have, by definition, an extremely small probability of occurrence and may be of little practical interest in terms of risk management or emergency response planning.  CRC has developed an alternative-case"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 26919,
      "SummaryText": "release scenario for storage tank TK-201 to provide a more reasonable scenario for emergency response planning.  The alternative-case release scenario involves a trailer truck loading LPG and pulling away without the loading hose being disconnected.  This results in a burst hose and the release of all the LPG in the line.  The loading hose is four-inches in diameter and 25 feet long and is estimated to hold 75 pounds of LPG.  The excess flow valve in the fill line is assumed to shut the flow of liquid from the storage tank after the truck pulls away.  In addition, it is assumed the other active mitigation measures (e.g., deluge system) will limit the LPG release to 75 pounds.\n\nIt was assumed that the released LPG formed a vapor cloud and detonated.  Modeling using the USEPA¿s look-up tables, which was verified using Trinity Consultants Inc.¿s Breeze Haz Advisor software, estimates that the distance to the flammable endpoint of one psig overpressure is 180 feet (less than 0.03 miles).  The hazard zone for the alternative-case release scenario does extend off the facility property line.  There are no institutions (e.g., schools, hospitals, prisons), parks, or environmental receptors within the hazard zone.  In addition, there are no major commercial, office, or industrial buildings within the hazard zone.  The hazard zone does include a recreational area (i.e., a small portion of the Calcasieu River) on the south side of the facility.\n\n4.0 Accidental Release Prevention Program\n\nCRC is strongly committed to protecting its employees, the public, and the environment.  As part of this commitment, CRC maintains an operational policy that requires compliance with all applicable federal, state, and local regulations.  CRC has retained Leading Edge Environmental Group (LEEG) to review its petroleum refinery to ensure it is compliance with the applicable provisions of the USEPA¿s Chemical Accident Prevention Provisions, which are codified at 40 CFR 68.  Based on this review,"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 26919,
      "SummaryText": "CRC believes its accidental release program meets the requirements of OSHA¿s PSM and also complies with the Risk Management rule.  Specific reviews have been conducted on the LPG storage system and, where prudent, additional controls or procedures have been implemented to reduce or minimize the consequences of any accidental release.\n\n\n5.0 Five-Year Accident History\n\nFor the five years prior to the submittal of this RMP there have been no accidental releases that resulted in deaths, injuries, or significant on-site property damage.  Furthermore, there have been no accidental releases that caused known off-site deaths or injuries, required local residents to evacuate or shelter-in-place, caused property damage, or damaged the environment.\n\nCRC has an excellent record of safe operations and has been recognized by the National Petrochemical and Refiners Association (NPRA).  CRC received the Gold Award for achieving a 100 percent reduction in the total recordable incident rate during 1998, 1999 and 2001 as compared to the average total recordable incident rate for the three previous calendar years.  In addition, CRC received the Award for Safety Achievement for operating three years without a lost workday case.  The company also received the Award for Meritorious Safety performance for achieving a total recordable incidence rate of 0.0 for calendar year 1998 and 2001.\n\n6.0 Emergency Response Program\n\nCRC has a written emergency response plan that addresses accidental releases of hazardous substances.  The plan is protective of human health and the environment and includes the following elements:\n\n? an evaluation of plant risk,\n? an evaluation of area risk,\n? notification procedures and an explanation of the communication systems,\n? a listing of emergency equipment and facilities,\n? a description of emergency response training and drills,\n? a listing of Emergency Coordinators,\n? an equipment testing program,\n? emergency response procedures,\n? procedures for returning to"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 26919,
      "SummaryText": "normal procedures, and\n? a method for documenting updates to the plan and results of drills and tests.\n\nCRC¿s emergency response plan meets or exceeds the requirements set forth in 40 CFR 68.95 (Risk Management Rule, Subpart E ¿ Emergency Response) and  29 CFR 1910.119(n) (OSHA Process Safety Management of Highly Hazardous Chemicals).  CRC has coordinated its emergency response program with the local fire department and will promptly provide to the Calcasieu Parish LEPC any information needed to implement the community emergency response plan.\n \n7.0 Planned Changes to Improve Safety\n\nSeveral developments and findings have resulted from the implementation of the various elements of CRC¿s Process Safety Management program.  Actions taken under this program have already improved the safety of the LPG storage process.  To further improve safety, CRC will implement an auto-dialing\nsystem to call people within the worst-case accidental release hazard zone if there is a release with the potential for off-site impact.  In addition, CRC will erect a warning sign near storage tank TK-201 warning recreational users of the Calcasieu River to remain at least 200 feet from the marker."
    }
  ]
}