{
  "FacilityID": 26912,
  "FacilityName": "Micronutrients, a Div of Heritage Technologies,LLC",
  "FacilityStr1": "1550 Research Way",
  "FacilityStr2": null,
  "FacilityCity": "Indianapolis",
  "FacilityState": "IN",
  "FacilityZipCode": "46231",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18097",
  "LEPC": "Marion County LEPC",
  "FacilityLatDecDegs": "39.742778",
  "FacilityLongDecDegs": "86.298333",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "P1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.micronutrients.net",
  "FacilityEmailAddress": "mary.king@micronutrients.net",
  "FacilityDUNS": 49714657,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Fred Steward",
  "OperatorStr1": "1550 Research Way",
  "OperatorStr2": null,
  "OperatorCity": "Indianapolis",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46231",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mary King",
  "RMPTitle": "EHS & Quality Manager",
  "FTE": 47,
  "OtherEPAFacilityID": "46321MCRNT1550R",
  "EPAFacilityID": "100000038292",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-06-06 00:00:00",
  "SafetyInspectionBy": "Local environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-10-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-10-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-10-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-10-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 39.74307,
  "FRS_Long": -86.29702,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 38567,
      "AltID": "Inorganic Salt Production",
      "FacilityID": 26912,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 39483,
          "ProcessID": 38567,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 50758,
          "ProcessID": 38567,
          "ChemicalID": 56,
          "Quantity": 54000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 550758,
          "ProcessID": 38567,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26912,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAt Micronutrients, we are committed to operating and maintaining all of our processes in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n *  A description of our facility and use of Anhydrous Ammonia as regulated by EPA's RMP regulation\n *  A summary of results from our assessment of the potential offsite consequences from accidental chemical releases\n *  An overview of our accidental release prevention programs\n *  A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\n *  An overview of our emergency response program\n *  An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\nMicronutrients Division of Heritage Technologies, L.L.C., located in Indianapolis, IN, manufactures Tri-Basic Copper Chloride(TBCC).  TBCC is a low dust, free flowing insoluble powder used as a dietary source of copper for commercial animal feed industries.  Micronutrients employs a proprietary/patented process which utilzes copper bearing acidic and alkaline solutions to produce a copper based salt, TBCC, and an ammoniacal etchant solution used in printed circuit board manufacturing.  Environmentally focused, this faciltiy maximizes the reuse concept of enviromental compliance.  Current chemical engineering technology provides the foundation for the production process.  \n\nMost recently, Micronutrients has constructed, and begun operation of a pilot scale research & development facility.  This facility"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26912,
      "SummaryText": " is currently being used to develop a commercial process for manufacturing Tetra-Basic Zinc Chloride (TBZC).  TBZC is a low dust, free flowing insoluble powder designed for use as a dietary source of zinc for commercial animal feed industries.\n\nChemicals used at Micronutrients include anhydrous ammonia, carbon dioxide, hydrochloric acid, sodium hydrosulfide, incoming acidic/basic feedstock solutions, copper oxide, zinc oxide, copper scrap, and trace catalysts. Of these, EPA has identified anhydrous ammonia as having the potential to cause significant offsite consequences in the event of a substantial accidental release.\n                                                                                                                                                             Regardless of the RMP requirements, Micronutrients takes seriously its responsiblity for employee and environmental safety.  Micronutrients uses engineering controls and best management practices to prevent the release of anydrous ammonia and to mitigate its impact should it occur.  Examples of this include process area detectors (toxic vapor analyzers), vents, relief systems, check valves,scrubbers, manual & automatic shutoffs, interlocks, excess flow device, and alarms and procedures.  Equipment inspections, incident invesigations, and routine audits are performed.  Employees are trained in the operation of the anhydrous ammonia delivery systems, safety programs and safety procedures.  Information about Micronutrients and its commitment to environmental, health & safety issues is communicated to the our employees, customers and surrounding community through our website, meetings, and our Environmental and Quality Policies.      \n\nToxics\n\nAnhydrous Ammonia is stored in an above tank that holds 54,000 pounds.  The ammonia is used in TBCC production, ammo redissolve operations,  formulated etchant production, and in the pilot plant. \n\nMicronutrients accidental release prevention program and contin"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26912,
      "SummaryText": "gency planning efforts help effectively manage the hazards that are posed to our employees, the public, and the environment by our use of Anhydrous Ammonia.\n\nKEY OFFSITE CONSEQUENCE ANALYSIS SCENARIOS\n\nEPA's RMP rule requires that Micronutrients provides information about the worst-case release scenario(s) and alternative release scenario(s) for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario:\n\nWorst-case Release Scenario(s) - Regulated Toxic Chemicals\n\nMicronutrients stores Anhydrous Ammonia outside in an above ground tank that has a capacity of 54,000 pounds.  The Worst-case Release Scenario would be a tank rupture.  If the tank ruptured the Anhydrous Ammonia plume would travel a distance of 2.6 miles from the facility.   There were no administrative controls or mitigation measures considered for the Worst-case Release Scenario.  Based on this information, there potentially would be offsite consequences to the public.\n\nAlternative Release Scenario(s) - Regulated Toxic Chemicals\n\nMicronutrients stores Anhydrous Ammonia outside in an above ground tank that has a capacity of 54,000 pounds.  The Alternative Release Scenario would be a filling hose rupture.  If the filling hose ruptured the Anydrous Ammonia plume would travel a distance of 0.2 miles from the facility.   Although there are administrative controls and mitigation measures in place for the Alternative Release Scenario, RMPComp does not take these into account.  The truck unloader would shut the truck down and a water fogger would be used to mitigate the Anydrous Ammonia release.  Based on this information, there potentially would be offsite consequences to the public.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nMicronutrients takes a systematic, proactive approach to preventing accidental releases of hazardous c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26912,
      "SummaryText": "hemicals.  Micronutrients management systems address each of the key features of successful prevention programs including:\n\n *  Process safety information\n *  Process hazard analysis\n *  Operating procedures\n *  Training\n *  Mechanical integrity\n *  Management of change\n *  Pre-startup review\n *  Compliance audits\n *  Incident investigation\n *  Employee participation\n *  Hot work permit\n *  Contractors\n\nAs part of the Micronutrients prevention efforts, we have implemented the following Anhydrous Ammonia release prevention steps:\n\n1. Employee training\n2. Internal ammonia sensors with alarms\n3. Pressure relief valves\n4. Inspection and maintenance of equipment\n5. Scrubber systems\n\nThese elements of the Micronutrients prevention program work together to prevent accidental chemical releases.  Micronutrients and our employees are committed to the standard that these management systems set for the way we do business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.  \n\nFIVE-YEAR ACCIDENT HISTORY\n\nMicronutrients will keep records for all significant accidental chemical releases that occur at our facility.  To date, Micronutriens has not had a release of Anhydrous Ammonia off of the facility property.\n\nEMERGENCY RESPONSE PROGRAM\n\nMicronutrients maintains a contingency plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning.  Our program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, we coordinate our plan with the local fire department and the LEPC.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nMicronutrients continues to inspect equipment to assess mechanical integrity in an effort to further prevent significant accidental chemical releases.  Management has recently renewed efforts to strengthen and grow our predictive and prevent"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 26912,
      "SummaryText": "ive maintenance programs."
    }
  ]
}