{
  "FacilityID": 26927,
  "FacilityName": "Beaver Dam Creek Gas Plant",
  "FacilityStr1": "Highway 16 at Highway 63",
  "FacilityStr2": null,
  "FacilityCity": "Watson",
  "FacilityState": "LA",
  "FacilityZipCode": "70786",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22091",
  "LEPC": "St. Helena Parish LEPC",
  "FacilityLatDecDegs": "30.658944",
  "FacilityLongDecDegs": "-90.808278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Whittier Energy Company",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Whittier Energy Company",
  "OperatorStr1": "3355 West Alabama, Ste 950",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77098",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000035268",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-02-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Production & Storage of NGL",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2002-11-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-11-01 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2002-10-24 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-12-14 00:00:00",
  "DeRegistrationEffectiveDate": "2006-01-01 00:00:00",
  "AnniversaryDate": "2007-10-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 30.658944,
  "FRS_Long": -90.808278,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Source no longer produces NGL at this plant.",
  "_processes": [
    {
      "ProcessID": 38594,
      "AltID": "NGL Production & Storage",
      "FacilityID": 26927,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 50789,
          "ProcessID": 38594,
          "ChemicalID": 98,
          "Quantity": 37195.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 39510,
          "ProcessID": 38594,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 26927,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-01 00:00:00",
    "ERTrainingDate": "1999-06-21 00:00:00",
    "CoordinatingAgencyName": "Greensburg Fire Department",
    "CoordinatingAgencyPhone": "2252224413",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26927,
      "SummaryText": "This Risk Management Plan is for the Beaver Dam Creek Gas Plant operated by Wittier Energy company (Whittier).  This facility was purchased by Whittier from Cabot Oil and Gas Corporation on 02/01/02.  Cabot bought this facility from Oryx Energy Co in January 1999.  The facility is located in a rural section of St. Helena Parish approximately 4.6 miles south of Pine Grove, LA.  The lease road, which is maintained by Whittier and is privately owned, is located just before the intersection of Highway 16 and Highway 63 in Watson, LA.  Surrounding property is pastureland and timberland used mainly for grazing and occasional recreation hunting.  Public access to the area is restricted.  The only persons allowed into the area are the land owner and leasee, Whittier personnel, and members of the Hilltop and Mullins Hunting Clubs.\n\nThe facility produces crude oil, natural gas, and NGL.  Natural gas and well fluids (oil & water) are separated using pressure separation vessels.  The gas is routed to a membrane unit where carbon dioxide is removed.  The  gas is then compressed and routed to a cold separator in which natural gas liquids are produced.  The liquids are removed in order to lower the heating value of the natural gas to meet pipeline specifications.  The separated NGL mixture is stored in a 700 BBL pressurized tank until transported by tank truck for sales.  The natural gas is sold by pipeline and the oil and water are stored in on-site atmospheric storage tanks until hauled by tank truck.  \n\nThe 700 BBL NGL storage tank is equipped with a relief valve which vents to atmosphere and automatically operates according to preset pressure specifications.  Manual shut-off valves are located at the cold separator effluent line and the inlet to the storage tank.\n\nThe threshold quantity for all flammable substances under 40 CFR part 68 is 10,000 lbs. It is the facility's policy not to store more than 8800 gal (or one truck load) of NGL at any one time thus limiting the invento"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26927,
      "SummaryText": "ry to a maximum of 37,195 lbs.  The NGL contains a mixture of propane, butane, and pentane which are all regulated substances.  The threshold determination is based on the properties of propane since it is the predominant flammable component in the mixture with the highest heat of combustion.                                                                                                                                                                    \nThe worst-case release scenario is a tank failure due to a 1 psi overpressure resulting in a vapor cloud explosion.  The scenario is based on the facility's administrative control to limit the maximum amount of NGL stored to 37,195 lbs. (8800 gal) and assumes failure of all safety devices.  The distance to the endpoint for this type of release is 0.30 mile.  According to USGS maps there are no public or environmental receptors within a 0.30 mile radius of the facility.  The closest receptor is a private hunting camp located 0.32 mile south of the facility.  The residential population within the worst-case circle is estimated to be zero.  The worst case release area was determined using EPA's RMP*Comp software.\n\nAn alternative scenario is not required for this facility.\n\nThe facility has not experienced a release which caused on or off site injury, death or property damage within the past five years.  \nWhittier has developed a facility emergency response plan & procedures for the Beaver Dam Creek Gas Plant.  This plan is located on-site. The facility is also listed with the Greensburg Fire Department and the St. Helena Parish LEPC.\n\nIn general the emergency response plan, in the event of an accidental release, provides procedures for facility operators to locate the problem and close the necessary flow valves to and from the storage tanks or to shut-in the entire facility.  Should a fire or explosion occur facility operators would contact the local fire department or other specially trained organizations and work with"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26927,
      "SummaryText": "them to respond to the release.                                                                                                                                                                As an additional safety measure Whittier plans to further restrict public access to the facility by locking the \"no traspassing\" gate located mid-way down the lease road."
    }
  ]
}