{
  "FacilityID": 27062,
  "FacilityName": "Bakelite Epoxy Polymers Corporation",
  "FacilityStr1": "3750 Clanton Road",
  "FacilityStr2": null,
  "FacilityCity": "Augusta",
  "FacilityState": "GA",
  "FacilityZipCode": "30906",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13245",
  "LEPC": "Richmond County LEPC",
  "FacilityLatDecDegs": "33.362778",
  "FacilityLongDecDegs": "-82.012222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G6",
  "LatLongDescription": "PP",
  "FacilityURL": "www.bakelite.us",
  "FacilityEmailAddress": "llake@bakelite.us",
  "FacilityDUNS": 119171986,
  "ParentCompanyName": "Bakelite North America Holding",
  "Company2Name": "N/A",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Bakelite Epoxy Polymers Corporation",
  "OperatorStr1": "P.O. Box 297",
  "OperatorStr2": null,
  "OperatorCity": "Gracewood",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30812",
  "OperatorZipCodeExt": null,
  "FTE": 19,
  "OtherEPAFacilityID": "GAD000610378",
  "EPAFacilityID": "100000042081",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-11-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2002-11-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-11-19 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2002-11-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2006-08-15 00:00:00",
  "DeRegistrationEffectiveDate": "2006-07-26 00:00:00",
  "AnniversaryDate": "2007-11-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 33.368333,
  "FRS_Long": -82.014444,
  "FRS_Description": "PLANT ENTRANCE (PERSONNEL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 38798,
      "AltID": "Epoxy Resins & Diluents",
      "FacilityID": 27062,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 51011,
          "ProcessID": 38798,
          "ChemicalID": 21,
          "Quantity": 300000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 39715,
          "ProcessID": 38798,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 21739,
              "Process_NAICS_ID": 39715,
              "SafetyReviewDate": "2002-10-25 00:00:00",
              "PHA_Date": "2002-11-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-11-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-10-25 00:00:00",
              "TrainingReviewDate": "2002-10-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-10-09 00:00:00",
              "EquipmentInspectionDate": "2002-10-17 00:00:00",
              "EquipmentTested": "S-6, S-9, S-10, S-14, SEP-1, SEP-2, S-5, S-15, S-1, HE-53, R-8, R-19, R-20, M-13, M-14, H-2",
              "ChangeMgmtDate": "2002-10-25 00:00:00",
              "ChangeMgmtReviewDate": "2002-09-20 00:00:00",
              "PreStartupReviewDate": "2002-11-07 00:00:00",
              "ComplianceAuditDate": "2002-10-25 00:00:00",
              "AuditCompletionDate": "2002-10-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2002-10-22 00:00:00",
              "HotWorkPermitReviewDate": "2002-10-22 00:00:00",
              "ContractorSafetyReviewDate": "2002-08-15 00:00:00",
              "ContractorSafetyEvalDate": "2002-10-25 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 32062,
                  "PreventionProgram3ID": 21739,
                  "ProcessChemicalID": 51011
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 27062,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2002-10-01 00:00:00",
    "ERTrainingDate": "2002-10-17 00:00:00",
    "CoordinatingAgencyName": "Augusta/Richmond County EMA",
    "CoordinatingAgencyPhone": "7068211155",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 27062,
      "SummaryText": "The Bakelite Epoxy Polymers Corporation (formerly RÜTGERS Organics Corporation) Augusta (GA) Plant primarily manufactures epoxy resins and diluents and some various organic chemicals for clients in the specialty chemicals industry.\n\nAccidental release prevention and emergency response policies\n\nThe Bakelite Epoxy Polymers Augusta Plant is committed to conducting operations in a manner that prevents accidental chemical releases.  Bakelite Epoxy Polymers' policy is to design, maintain, operate and audit operations to make sure the possibility of a chemical release is kept as low as possible.  In the unlikely event an accidental chemical release does occur, Bakelite Epoxy Polymers' policy is to have a well trained and prepared workforce capable of responding to a release; and have the equipment and facilities available to minimize the release and its affects on employees, the public, and the environment.  The Bakelite Epoxy Polymers Augusta Plant's accidental release prevention program, coupled with the emergency response program, consists of \"Six Layers of Protection\" designed to prevent or minimize the effects of an accidental chemical release.  \n\nThe stationary source and regulated substances handled\n\nThe Bakelite Epoxy Polymers Corporation Augusta Plant is located on a 77-acre tract of land in south Augusta, GA.  Originally built in 1980, the mission of the plant has changed over the years.  The current purpose of the facility is to manufacture several epoxy resins and specialty chemicals.  Periodically throughout a typical year, production will be switched from one resin to another.\n\nThe resins manufactured at the Augusta Plant require the use of epichlorohydrin.  Epichlorohydrin is listed by the EPA as a regulated toxic substance, and the quantity stored of the substance during the production of the product exceeds the threshold quantity defined by the EPA.  The threshold quantity for epichlorohydrin is 20,000 pounds.\n\nWorst-case release scenario(s) and the alter"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 27062,
      "SummaryText": "nate release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n \nWorst-Case Release Scenario:  The EPA regulations require reporting of the worst-case release scenario estimated to result in the greatest distance to a specified toxic endpoint.  The worst-case release scenario is a release of the entire storage tank of epichlorohydrin.  Specific data on the worst-case release are included in Section 2 of the RMP.  Using worst-case weather conditions, as specified by the EPA, the distance to the toxic endpoint of 0.076 mg/l was determined.  These results are based on modeling performed using RMP*Comp Ver. 1.07 modeling software.\n\nAlternate Release Scenario:  The alternate release scenario is more likely than the worst-case release.  The team of employees that conducted the PHA selected the alternate release scenario.  Several preventive measures have been taken to prevent a release of epichlorohydrin.  Some of the preventive measures include installation of pumps designed to reduce leaks and emissions, gaskets placed in flanges that reduce the potential for leaks, flanges bolts are torqued to required specifications, safety interlocks are in place to control temperatures and pressures and dry type fittings are used on stainless steel braided hoses used to unload a tanker truck of epichlorohydrin. The alternate release scenario is a release from the tanker truck unloading hose as it is disconnected from the truck.  A hose would contain approximately 45 pounds of epichlorohydrin and would be released in less than a minute, which would result in an evaporation rate of .236 pounds/min over a 191 minute time span.  A total of 45 pounds of epichlorohydrin are released during this scenario.  Using typical weather conditions for Augusta, GA, the distance to the epichlorohydrin toxic endpoint of 0.076 mg/l for this release would be less than 0.1 mile and would not have an effect outside our property fenceli"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 27062,
      "SummaryText": "ne.  These results are based on modeling performed using RMP*Comp Ver. 1.07 modeling software.\n\nThe general accidental release prevention program and the specific prevention steps\n\nAccidental chemical releases are prevented at the Bakelite Epoxy Polymers Augusta Plant through an extensive management and operational prevention program designed to protect employees, the public's health, and the environment. The Bakelite Epoxy Polymers Augusta Plant's accidental release prevention program, coupled with the emergency response program, consists of six layers of protection designed to prevent or minimize the effects of an accidental chemical release.  \n\nThe first layer is to ensure all processes are designed for safety.  Hazard assessments are performed on the initial process design and every five years afterwards.  Safety systems are designed into the process that actively or passively help minimize the effects of a chemical release.  Equipment and piping are designed and installed per established industry codes and standards, such as the American Society of Mechanical Engineers.  All changes to a process are thoroughly reviewed by technical and health and safety personnel to ensure any change to equipment, procedures, chemicals, etc. will not affect the safety of employees, the environment, or the public.  \n\nThe second layer of the prevention program involves the maintenance of process equipment.  A preventive maintenance program is in place that is designed to identify problems with plant equipment before they occur.  All critical safety equipment is checked regularly and prior to process startup to ensure it operates as designed.  Inspections and tests of critical devices such as relief valves, pressure vessels, and storage tanks are regularly performed to ensure the integrity and function of the equipment are maintained.  In addition, maintenance personnel are highly skilled and regularly trained.\n\nOperating the plant in a safe manner makes up the third layer of the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 27062,
      "SummaryText": "Augusta Plant's prevention program.  Operators are trained on a process prior to startup and at least every three years afterwards.  All operations are conducted using written procedures that have been reviewed and approved by management and technical personnel.  Access to the plant is restricted to authorized employees, authorized visitors, and authorized contractors.  Areas where epichlorohydrin is stored and handled are further restricted during handling operations.  Sensitive and/or critical process parameters, such as process temperatures and pressures, are continuously monitored by the computer in the Control Room.  Maintaining an excellent safety program is considered everyone's responsibility.\n \nThe fourth layer of the accident prevention program involves auditing plant operations.  Internal reviews by plant management and health and safety personnel are regularly performed to ensure employees are doing their job correctly and safely.  Operating procedures are reviewed periodically to guarantee that they are current and reflect design intentions.    All processes undergo a pre-startup safety review that confirms design specifications have been followed, procedures are in place, a process hazard analysis has been performed and all recommendations from the analysis have been implemented, and that training for all employees involved in the process has been conducted.  Should any incident occur involving a chemical release, no matter how small, the incident is investigated and any recommendations from the investigation are implemented to ensure the possibility of any future occurrence is minimized.  \n\nFive year accident history\n\nThere have been no accidental releases of reportable quantities of any EPA regulated substances at the Bakelite Epoxy Polymers Augusta Plant over the past five years.\n\nThe emergency response program\n\nThe Bakelite Epoxy Polymers Augusta Plant's emergency response program is based on two fundamentals: (1) have a properly trained and prepar"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 27062,
      "SummaryText": "ed workforce, and (2) if a release does occur, have the equipment and procedures necessary to minimize the possible health and environmental effects of the release.  These are the last two layers of chemical release protection.\nTraining for an emergency involves all personnel at the Augusta Plant.  The plant has trained HAZMAT Technicians that are able to offensively stop chemical releases.  The rest of the plant is trained on emergency equipment, emergency response and evacuation procedures.  Emergency exercises are performed regularly with Augusta-Richmond County emergency responders.  The last exercise was performed in October, 1998, and simulated a chlorine release.  All exercises are critiqued afterwards for improved efficiency.  \nIf a release does occur, the facility is equipped with a plant alarm to alert all personnel.  A contingency plan is in place that directs employees on the actions to take in the case of a chemical release.  This plan includes notification procedures (i.e., 9-1-1 the community, including area schools, businesses, etc.), procedures to control the release, safety procedures (i.e., evacuation, shelter-in-place), and procedures for establishing a response management system.  Bakelite Epoxy Polymers's HAZMAT Technicians are always on site to respond to a chemical release, and Augusta-Richmond County Fire Department and HAZMAT teams can respond to an emergency within minutes.  In addition to these procedures, the plant is equipped with various emergency equipment, including foam spray nozzles, fire hydrants, sprinkler systems, and spill kits that assist in combating an emergency.\n\nPlanned changes to improve safety\n\nThe Bakelite Epoxy Polymers Augusta Plant strives to improve operations in accordance with the ACC's Responsible Care guidelines.  These guidelines steer companies towards continuously improving product stewardship, employee health and safety, process safety, pollution prevention, and community awareness and emergency response."
    }
  ]
}