{
  "FacilityID": 27094,
  "FacilityName": "Newington Energy",
  "FacilityStr1": "99 Old Dover Road",
  "FacilityStr2": null,
  "FacilityCity": "Newington",
  "FacilityState": "NH",
  "FacilityZipCode": "03801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "33015",
  "LEPC": "Newington LEPC",
  "FacilityLatDecDegs": "43.105",
  "FacilityLongDecDegs": "-70.806944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "AS",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Newington Energy LLC/Consolidated Edison",
  "Company2Name": "General Electric Power Systems",
  "CompanyDUNS": 22934678,
  "Company2DUNS": 22934678,
  "OperatorName": "Newington Energy LLC",
  "OperatorStr1": "99 Old Dover Road",
  "OperatorStr2": null,
  "OperatorCity": "Newington",
  "OperatorStateFIPS": "NH",
  "OperatorZipCode": "03801",
  "OperatorZipCodeExt": null,
  "FTE": 24,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000180546",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "044-121NH10",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-11-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-11-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-11-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-11-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 43.105,
  "FRS_Long": -70.80694,
  "FRS_Description": "AIR RELEASE STACK",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 38855,
      "AltID": "NH3 for NOx Reduction",
      "FacilityID": 27094,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 51068,
          "ProcessID": 38855,
          "ChemicalID": 56,
          "Quantity": 19992.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 39771,
          "ProcessID": 38855,
          "NAICSCode": "22111",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 21779,
              "Process_NAICS_ID": 39771,
              "SafetyReviewDate": "2002-05-02 00:00:00",
              "PHA_Date": "2002-05-02 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-09-27 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "handheld direct reading instruments and colormetric detector tubes",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-05-01 00:00:00",
              "TrainingReviewDate": "2002-10-11 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-09-27 00:00:00",
              "EquipmentInspectionDate": "2002-09-04 00:00:00",
              "EquipmentTested": "Valves, gauges, tanks, deluge system, vaporizer, heaters, blowers, controls, and alarms.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2002-09-20 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2002-09-20 00:00:00",
              "HotWorkPermitReviewDate": "2002-09-20 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Ammonia Storage Vessel\n\nAnhydrous ammonia is supplied by tanker truck through a liquid filled connection.  This connection is supported by a bulkhead containment wall designed to withstand the force arising from a tanker truck pulling away while still connected.  An emergency shut-off valve is also provided at both the liquid filled and vapor returned line to allow quick shut-off of liquid and vapor flow in the event that there is an accidental pull-away of a truck or a hose rupture.  Ammonia is stored in a liquid state in equilibrium with its vapor at saturation conditions in a pressurized vessel.  The vessel is maintained at approximately 100 psig and 64 ?F by an electric vaporizer under drum pressure control via a PID loop controller (1CI-PIC-1570) modulating the heat input to the ammonia vaporizer.  \n\nThe ammonia storage vessel temperature is monitored through the local indicator (1CI-TI-1570).  The level in the vessel is monitored through the local gauge (1CI-LI-1571), and remotely through the DCS (1CI-LI-1570).  A local level indicator (1CI-LI-1570A) and a local horn for high level alarm (1CI-LAH-1570) are also provided at the truck unloading station.  The ammonia tank pressure is indicated through a local gauge (1CI-PI-1571) and remotely through the DCS (1CI-PI-1570).  A high pressure switch (1CI-PSH-1572) will shut-off the vaporizer if the drum pressure increases to 165 psig.   The tank is supplied with a dual pressure relief valve set at 265 psig; excess flow valves at all fluid flow nozzles; and thermal relief valves set at 325 to 350 psig on associated liquid ammonia lines.  \n\n4.1.2    Ammonia Vaporizer\n\nThe ammonia vessel is kept at the desired operating pressure of 100 psig by an electric vaporizer via a PID loop pressure controller (1CI-PIC-1570).  Liquid anhydrous ammonia is vaporized by direct contact with the heating element.  The liquid ammonia feed line to the vaporizer is protected from over pressure at blocked in condition by a thermal relief valve (1CI-PSV-1582) set at 350 psig.  The gasified ammonia is piped back via the vapor line into the storage vessel.  The vapor from the vessel is then sent to the dilution air system.  A pressure controller (1CI-PC-1573) set at 52 psig is provided on the vapor line to ensure a constant feed pressure to the dilution air system.  A high temperature cut-off switch (1CI-TSH-1571) is provided to shut-down the vaporizer if the heating element is in excess of 200 ?F.\n\n4.1.3    Ammonia Dilution Air and Injection Control Skid\n\nA dilution air and injection control skid is supplied for the HRSG in the plant to support the operation of the associated SCR system.  The skid consists of 100%-spare Dilution Air Blowers (1CI-BLR-1001A/B), Dilution Air Heaters (1CI-HTR-1001A/B), Ammonia/Air Mixer (1CI-MIX-1001), Ammonia Filter (1CI-FLT-1001) and Ammonia Accumulator (1CI-ACC-1001).\n\nAmmonia vapor is fed from the storage vessel to the dilution air and injection control skid under constant pressure control (1CI-PC-1573) set at 52 psig.  The ammonia injection rate is regulated via a corresponding flow valve (1CI-FV-1600) under its respective flow controller (1CI-FC-1600).  The controller is reset by a function block (1CI-FY-1600) that automatically calculates the required ammonia injection rate to achieve the required NOx reduction depending on the GTG load and fuel type; and the firing load of the HRSG duct burner.  The function block (1CI-FF-1601) receives the GTG exhaust gas inlet NOx concentration signal (1GT-AI-1000) to the SCR catalyst reactor from the GTG Controller Mark V.  This function block also receives a calculated inlet NOx signal for the duct burner from the DCS via 1FG-FI-1802, 1CI-AY-1535 and 1CI-AI-1535.  The signal from 1CI-FF-1601 is sent to 1CI-FY-1600 and acted as a feedforward signal to rapidly adjusts the ammonia flow valve to follow load swing.  The ammonia flow is trimmed via a feedback signal (1CI-FF-1600, 1HR-AI-1513 & 1HR-AI-1533) form the outlet NOx analyzers (1HR-AIT-1513) located at the stack.  Depending on the GTG fuel type, the NOx outlet analyzer indicator in the DCS is 1HR-AI-1513 for GTG firing with fuel oil and 1HR-AI-1533 for GTG firing with fuel gas.  The combined feedforward and feedback signal is used to stimulate a faster response to modulate the ammonia flow valve (1CI-FV-1600) and thus allows rapid achievement of the specified outlet NOx without any overshoots and undershoots and large deviations from the setpoint.  A hand control station in the DCS (1CI-HS-1600) is provided for the operator to switch between the GTG firing mode.  This sets the appropriate constants for the base ammonia flow demand and trim calculations.\nThe regulated ammonia flow is diluted in transport air in an Ammonia/Air Mixer (1CI-MIX-1001) before injection into the SCR catalyst reactor via an injection/balancing skid of the HRSG.  Ammonia Filter (1CI-FLT-1001) and Ammonia Accumulator (1CI-ACC-1001) to knock out any condensate is provided for the ammonia vapor just before the mixer.  \n\nThe ammonia dilution air and injection control skid is supplied with a 100%-spare ammonia Dilution Air Blowers (1CI-BLR-1001A/B).  Each blower is provided with an inlet filter/silencer unit.  The air flowrate is measured by 1CI-FT-1602 and monitored in the DCS via 1CI-FI-1602.  The air is heated in a Dilution Air Heater (1CI-HTR-1001A/B) prior to mixing with ammonia in the ammonia/air mixer.  The air temperature outlet of the heater is 225 ?F and is monitored in the DCS (1CI-TI-1600).  The heater is controlled in the range of 200 ?F to 250?F by temperature switch (1CI-TSL-1601, 1CI-TSH-1601).  A local high temperature switch (1CI-TSH-1603A/B) is also provided to shut-off heater at TBD ?F.\n\nThe ammonia injection control is activated automatically by a minimum condition permissive (1CI-TY-1503) on the temperature at the SCR catalyst reactor inlet.  The system also needs to meet the following injection permissive conditions: GTG load greater than 90 % (1GT-JL-1006), dilution air temperature (1CI-TI-1601) leaving the dilution air heater greater than 150 ?F, dilution air flow greater than 3000 lb/hr and the system on switch (1CI-HS-1601) is enable.  The system is automatically shutdown upon tripout of the GTG (1GT-XA-1009), flue gas temperature greater than 800 ?F (1CI-TY-1503) and loss of the start permissive conditions specify above.  In case of failure of the online blower, the standby spare unit is automatically activated through DCS logic.  Each blower is provided with running lights (1CI-XL-1622/1623) in the DCS.  Each Heater is also provided with a heater on signal (1CI-XL-1623A/B) and heater trouble (1CI-XA-1623A/B) in the DCS.\n\n4.2    Start-Up \nAmmonia vessel is filled to 82 % of storage volume per code requirement (OSHA 29CFR 1910).",
              "_chemicals": [
                {
                  "PrimaryKey": 32102,
                  "PreventionProgram3ID": 21779,
                  "ProcessChemicalID": 51068
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 27094,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2002-09-20 00:00:00",
    "ERTrainingDate": "2001-10-01 00:00:00",
    "CoordinatingAgencyName": "Newington Fire Dept. (LEPC)",
    "CoordinatingAgencyPhone": "6034365737",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 27094,
      "SummaryText": "Executive Summary\nNewington Energy - Newington, NH \n\nThe Newington Energy Power Project (NEL) is a 525 MW gas fired combined cycle power plant located at 99 Old Dover Road in Newington, NH.  The project lies approximately 1000 feet from the Piscataqua River in a mixed zone area.  The NEL Facility is to be owned and operated as a merchant power facility using state-of-the-art technology and environmental controls that provide extremely high operational efficiency and low air emissions.  Through the use of natural gas and low sulfur number 2 distillate, as a backup fuel the facility will generate enough power to supply of 700,000 homes in New England.  \n\nSystem Overview\n\nThe anhydrous ammonia system provides storage, vaporization, transfer, and injection control facilities for the ammonia gas to support the selective catalytic reduction system (SCR) in the heat recovery steam generator (HRSG). The application of Selective Catalytic NOx Reduction Technology (the process) reduces nitrogen oxide air emissions from the station.  There are two HRSG's in the plant and are designated as train 1 and 2.  Each HRSG will have its own dedicated anhydrous ammonia system and the system description below pertains to the train 1 design and operation.  The train 2 system design and operation will be identical to train 1.\n\nThe ammonia system consists of a pressurized storage vessel supplied with a 100% directly heated vaporizer, one ammonia dilution air and injection control skid for the HRSG(s) which includes two-100% dilution air blowers and heaters; ammonia/air mixer and the associated injection/balancing skid of the HRSG.  The SCR is used to reduce the emissions level of nitrogen oxides (NOx) generated from the operation of the gas turbine generator (GTG), and of the duct burners in the HRSG.  Ammonia is injected into the exhaust gas stream at the proper temperature section in the HRSG that contain the SCR catalyst modules and converts the NOx into nitrogen and water before dischar"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 27094,
      "SummaryText": "ge of the exhaust gas to the atmosphere via the stack\n\nThe ammonia storage and supply system includes a 2,000-gallon horizontal, cylindrical, pressure vessel for storing liquefied anhydrous ammonia. The storage vessel is size to provide approximately 2.5 days of continuous supply of ammonia at the design usage rate of 144 lb/hr for NOx reduction to 9 ppmv based on a 24-hour per day operation of fuel oil at -10?F in the GTG.  When the GTG is firing with fuel gas, the vessel has approximately 7 days of storage.  The vessel is mechanically rated for 265 psig and 170 ?F.\n\nAnhydrous ammonia is supplied by tanker truck through a liquid filled connection.  This connection is supported by a bulkhead containment wall designed to withstand the force arising from a tanker truck pulling away while still connected.  An emergency shut-off valve is also provided at both the liquid filled and vapor returned line to allow quick shut-off of liquid and vapor flow in the event that there is an accidental pull-away of a truck or a hose rupture.  Ammonia is stored in a liquid state in equilibrium with its vapor at saturation conditions in a pressurized vessel.  The vessel is maintained at approximately 100 psig and 64 ?F by an electric vaporizer under drum pressure control via a PID loop controller modulating the heat input to the ammonia vaporizer.  \n\nAmmonia Storage Vessel\n\nThe ammonia storage vessel temperature is monitored through the local indicator.  The level in the vessel is monitored through the local gauge, and remotely through the DCS.  A local level indicator and a local horn for high level alarm are also provided at the truck unloading station.  The ammonia tank pressure is indicated through a local gauge and remotely through the DCS .  A high pressure switch will shut-off the vaporizer if the drum pressure increases to 165 psig.   The tank is supplied with a dual pressure relief valve set at 265 psig; excess flow valves at all fluid flow nozzles; and thermal relief valves s"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 27094,
      "SummaryText": "et at 325 to 350 psig on associated liquid ammonia lines.  \n\nAmmonia Vaporizer\n\nThe ammonia vessel is kept at the desired operating pressure of 100 psig by an electric vaporizer via a PID loop pressure controller.  Liquid anhydrous ammonia is vaporized by direct contact with the heating element.  The liquid ammonia feed line to the vaporizer is protected from over pressure at blocked in condition by a thermal relief valve set at 350 psig.  The gasified ammonia is piped back via the vapor line into the storage vessel.  The vapor from the vessel is then sent to the dilution air system.  A pressure controller set at 52 psig is provided on the vapor line to ensure a constant feed pressure to the dilution air system.  A high temperature cut-off switch is provided to shut-down the vaporizer if the heating element is in excess of 200 ?F\n\nAmmonia Dilution Air and Injection Control Skid\n\nA dilution air and injection control skid is supplied for the HRSG in the plant to support the operation of the associated SCR system.  The skid consists of 100%-spare Dilution Air Blowers, Dilution Air Heaters, Ammonia/Air Mixer, Ammonia Filter (1CI-FLT-1001) and Ammonia Accumulator.\n\nAmmonia vapor is fed from the storage vessel to the dilution air and injection control skid under constant pressure control set at 52 psig.  The ammonia injection rate is regulated via a corresponding flow valve under its respective flow controller.  The controller is reset by a function block that automatically calculates the required ammonia injection rate to achieve the required NOx reduction depending on the GTG load and fuel type; and the firing load of the HRSG duct burner.  The function block receives the GTG exhaust gas inlet NOx concentration signal to the SCR catalyst reactor from the GTG Controller Mark V.  This function block also receives a calculated inlet NOx signal for the duct burner from the DCS via.  The signal from is sent and acted as a feedforward signal to rapidly adjusts the ammonia flo"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 27094,
      "SummaryText": "w valve to follow load swing.  The ammonia flow is trimmed via a feedback signal form the outlet NOx analyzers located at the stack.  Depending on the GTG fuel type, the NOx outlet analyzer indicator in the DCS is for GTG firing with fuel oil and for GTG firing with fuel gas.  The combined feedforward and feedback signal is used to stimulate a faster response to modulate the ammonia flow valve and thus allows rapid achievement of the specified outlet NOx without any overshoots and undershoots and large deviations from the setpoint.  A hand control station in the DCS is provided for the operator to switch between the GTG firing mode.  This sets the appropriate constants for the base ammonia flow demand and trim calculations.\nThe regulated ammonia flow is diluted in transport air in an Ammonia/Air Mixer injection into the SCR catalyst reactor via an injection/balancing skid of the HRSG.  Ammonia Filter (1CI-FLT-1001) and Ammonia Accumulator to knock out any condensate is provided for the ammonia vapor just before the mixer.  \n\nThe ammonia dilution air and injection control skid is supplied with a 100%-spare ammonia Dilution Air Blowers Each blower is provided with an inlet filter/silencer unit.  The air flowrate is measured by and monitored in the DCS via.  The air is heated in a Dilution Air Heater prior to mixing with ammonia in the ammonia/air mixer.  The air temperature outlet of the heater is 225 ?F and is monitored in the DCS. The heater is controlled in the range of 200 ?F to 250?F by temperature switch.  A local high temperature switch (1CI-TSH-1603A/B) is also provided to shut-off heater at TBD ?F.\n\nThe ammonia injection control is activated automatically by a minimum condition permissive on the temperature at the SCR catalyst reactor inlet.  The system also needs to meet the following injection permissive conditions: GTG load greater than 90 %, dilution air temperature  leaving the dilution air heater greater than 150 ?F, dilution air flow greater than 3000 "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 27094,
      "SummaryText": "lb/hr and the system on switch is enable.  The system is automatically shutdown upon tripout of the GTG, flue gas temperature greater than 800 ?F and loss of the start permissive conditions specify above.  In case of failure of the online blower, the standby spare unit is automatically activated through DCS logic.  Each blower is provided with running lights in the DCS.  Each Heater is also provided with a heater on signal and heater trouble in the DCS.\n\nRisk Management Plan (RMP) and Process Safety Management (PSM) \n\nGE Contractual Services recognizes that people are its most vital resource, and their safety and health is one of our principal responsibilities.  GE Contractual Services will strive to provide a safe and healthy working environment and to avoid adverse impact and injury to the environment and the communities in which we do business.  GE utilizes a Risk Management Plan (RMP) and Process Safety Management (PSM) to provide guidelines for preventing and/or minimizing the consequences of catastrophic releases of toxic, reactive, flammable, or explosive chemicals.  In general terms, the RMP protects the health and safety of environment and the community and PSM protects the on-site employees.  \n\nItems that are addressed in the RMP/PSM:\n\nAn Emergency Response Plan (the Integrated Contingency Plan (ICP)) has been developed to address a broad spectrum of emergency scenarios and contingent responses.  The use of a single emergency response plan per facility will eliminate confusion for facility first responders who often must decide which of their plans is applicable to a particular emergency.  The \"ICP\" is designed to yield a highly functional document for use in varied emergency situations while providing a mechanism for complying with multiple agency requirements.  Use of a single integrated contingency plan should also improve coordination between facility response personnel and local, state, and federal emergency response personnel\nOffsite Consequence Anal"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 27094,
      "SummaryText": "ysis of worst case and an alternative case release scenarios where air dispersion models and release parameters are evaluated to determine off-site impacts and affected populations.  Records of these analyzes are kept.\n\nA management system is in place to implement and manage the RMP/PSM procedures.  The qualified person is responsible for coordinating with and keeping local authorities informed of changes that affect the RMP/PSM.\n\nThe Process Safety Management program provides a safe and healthful work environment for the facility employees/contractors by performing a process hazard analysis.  A process hazard analysis is an organized and systematic effort to identify and analyze the significance of potential hazards associated with the processing or handling of highly hazardous chemicals. \n\nOperating Procedures are established, for all affected processes, relating to tasks to be performed, data to be recorded, operating conditions maintained, samples to be collected, and safety and health precautions to be taken for each particular process.\n\nEmployees are trained to understand the nature and causes of the problems created by process operations and increase employee awareness and reactions to the hazards of each process.  Training also includes O&M procedures, health and safety, emergency operations and safe work practices.  Refresher training must be provided at least every two years.\n\nMechanical Integrity has been developed to assure the continued integrity of process equipment.  The program includes the identification of all equipment and instrumentation, written maintenance procedures, documentation of maintenance training, and documentation of inspections and testing.\n\nAn incident Investigation has been developed to investigate incidents that occur in the facility, including written investigations procedures.\n\nCompliance Audits of the facility PSM/RMP program are evaluated at least every three years and must include auditing maintenance records for the previous"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 27094,
      "SummaryText": " two years.\n\nThe Contractor Safety Program ensures that contractors hired to work in and around processes that involve highly hazardous chemicals have been screened by reviewing their safety performance records.  Contractor selection criteria includes, which contractor can complete the specialized work without endangering the safety and health of employees at the plant.  Written procedures have been developed that also include training for contractors.\n\nPre-Startup Safety Review and Procedures are conducted as part of the \"normal startup\" operating procedure for each system.  Written procedures for conducting a pre-startup safety review have been  developed and personnel have been trained in their use.  \n\nNon-Routine work authorization procedures are in place and reference and coordinate, as applicable, with lockout/tagout procedures, line breaking procedures, confined space entry procedures, and hot work permits.\n\nThe Management of Change Program monitors and controls all modifications to equipment, procedures, raw materials, and processing conditions.\n\nEmployees are encouraged and required to participate in the RMP/PSM process.  Their input is of critical importance and is required by regulation and employees have access to information developed under the RMP/PSM Program.\n\nEmployee's are trained to understand the safety and health hazards of the chemicals and processes in their work area that involve highly hazardous chemicals.  Additional training in operating procedures, safe work practices, emergency response and evacuation, and other areas pertinent to process safety and health are covered in the facility's training program.  Records of training are maintained.\n\nThe RMP program requires audits of certain program elements every 3 years.  The PSM program requires audits of certain program elements every 2 years."
    }
  ]
}