{
  "FacilityID": 2715,
  "FacilityName": "Persigo Wastewater Treatment Plant",
  "FacilityStr1": "2145 River Road",
  "FacilityStr2": null,
  "FacilityCity": "Grand Junction",
  "FacilityState": "CO",
  "FacilityZipCode": "81505",
  "Facility4DigitZipExt": "9407",
  "FacilityCountyFIPS": "08077",
  "LEPC": "Mesa County LEPC",
  "FacilityLatDecDegs": "39.122778",
  "FacilityLongDecDegs": "-108.663056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "billbe@ci.grandjct.co.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Grand Junction",
  "Company2Name": "Mesa County",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Grand Junction",
  "OperatorStr1": "2145 River Road",
  "OperatorStr2": null,
  "OperatorCity": "Grand Junction",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "81505",
  "OperatorZipCodeExt": "9407",
  "RMPContact": "Bill Beaver",
  "RMPTitle": "Safety Coordinator",
  "FTE": 33,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000035552",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-16 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-05-14 00:00:00",
  "DeRegistrationEffectiveDate": "2011-03-28 00:00:00",
  "AnniversaryDate": "2004-06-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 39.11,
  "FRS_Long": -108.65556,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3031,
      "AltID": "Sulfur Dioxide",
      "FacilityID": 2715,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3096,
          "ProcessID": 3031,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3233,
          "ProcessID": 3031,
          "ChemicalID": 49,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503233,
          "ProcessID": 3031,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 3032,
      "AltID": "Chlorine",
      "FacilityID": 2715,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3097,
          "ProcessID": 3032,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3234,
          "ProcessID": 3032,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503234,
          "ProcessID": 3032,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2715,
      "SummaryText": "EXECUTIVE SUMMARY\n\n1. Accident Release Prevention and Emergency Response Policy.\n\nThe United States Environmental Protection Agency (USEPA) requires all facilities which have specific hazardous chemicals above a defined quantity, or threshold level, in a process, to be in compliance with the Clean Air Act, (CAA) 40 CFR 112r Part 68. The ingestion of hazardous chemicals by humans in sufficient quantity will result in loss of life or serious injury. Chlorine and sulfur dioxide are on the hazardous chemical list. The Persigo Wastewater Treatment Facility (WWTF) has more than the threshold quantity of chlorine and sulfur dioxide on site. The Clean Air Act, 40 CFR 112r Part 68, requires us to comply and to observe specific safety precautions in handling these chemicals. Release prevention and emergency response policies are in place to help prevent exposure to facility personnel and the community, given the life, health, and safety hazards associated with these chemicals. It is the policy of the City of Grand Junction to adhere to all applicable Federal and State rules, regulations, and safety precautions. \n\nThe primary purpose of the Persigo (WWTF) is to treat wastewater produced in the Grand Junction 201 sewer district area. Following other wastewater treatment processes, chlorine is added as a disinfectant and sulfur dioxide is then added to neutralize the chlorine prior to discharging the treated effluent into Persigo Wash, which flows into the Colorado River.\n\nIt is the management's opinion that the Persigo WWTF Emergency Action Plan is in compliance with OSHA's Employee Emergency and Fire Prevention Plan, 29 CFR Part 1910.38. The emergency action plan includes procedures for notification of the Grand Junction Hazardous Materials Team (Haz-mat) to respond to all hazardous chemical releases at this facility, and to notify all potentially affected neighbors.\n\n2. Stationary Source and Regulated Substances Handled.\n\nPersigo WWTF receives chlorine and sulfur dioxide by t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2715,
      "SummaryText": "ruck transport. These chemicals are stored in 2000-pound containers separately in the \"chlorine\" building. The chemicals are in liquid/gaseous form. Each full container has 2000 lbs. of chemical. By standard operating policy the facility has a maximum of seven (7) chlorine containers and five (5) sulfur dioxide containers at any time. Therefore, the maximum amount of chlorine stored at this facility is 14,000 pounds and the maximum amount of sulfur dioxide stored at the facility is 10,000 pounds.\n\nThe two chemical feed processes; chlorine and sulfur dioxide, which are separated in different rooms, each have two containers of chemical attached to the feed system at one time. Each process contains a maximum of 4,000 pounds of chemicals. In each process, the system feeds from one container until the container becomes empty, and then automatically switches to the other container on line. This is accomplished with a component termed a \"Switchover Valve\". The remainder of the inventory is in storage, in the same room.\n\nAccess to the WWTF is restricted to authorized personnel only. Persigo WWTF operations and maintenance staffs are thoroughly trained regarding the hazards and risks associated with sulfur dioxide, and chlorine. Specific regulatory operation and maintenance procedures are in place and are strictly followed. Procedure and personnel audits are performed quarterly at this facility to identify hazards or risks, which may have been overlooked or not previously identified. These audits are also used to identify any deficiencies in personnel safe work practices of the procedures.\n\nThe chlorine building is locked after hours when personnel are not present. The fire department has a locked box at the main gate, which contains the door key for all of the facility buildings.\n\n3. Worst-Case Release Scenario\n\nThe Worst-Case release scenario for this facility involves the use of chlorine.\n\nThe worst-case scenario for a one- (1) ton container of chlorine is the catastrophi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2715,
      "SummaryText": "c failure due to corrosion, impact or construction defects. This scenario assumes a release of 2,000 pounds of chlorine in ten (10) minutes. The estimated perimeter from the facility, which could be affected, is 2.2 miles. In this and any other scenario the Grand Junction Haz-mat team would respond to hazardous chemical releases and would notify the public of actions to take in the affected area.\n\nThis worst-case release scenario for chlorine assumes a release inside of a building with contact with out side air. Chlorine and sulfur dioxide were both considered for worst-case scenarios, and chlorine, as indicated by RMP Comp, will create the worst case scenario because of the greater perimeter involved.\n\n(The data for this scenario was taken from EPA, RMP Comp software, provided by the EPA).\n\nAlternative Scenarios.\n\nThe alternative release scenarios include administrative controls and mitigation measures to limit the exposure perimeter for each reported scenario. This scenario would happen inside the storage rooms for each hazardous chemical.\n\nThe alternative scenario assumes a release from one (1) ton sulfur dioxide with a flexible tubing failure, bad connection, or valve failure. This scenario further assumes the release of gas through the 5/16-inch diameter valve body opening. These assumptions would result in the release of 7 pounds of sulfur dioxide per minute. The estimated affected perimeter from the facility is 0.1 miles. The quantity of chemicals released depends on how long it takes the Haz-mat team to respond and stop the release. Assuming 30 minutes for response and 30 minutes to stop the release, the amount of chemical released could be 420 pounds in 60 minutes.\n\n\n(The data for this scenario was taken from Risk Management Program Guidance for Wastewater Treatment Plants, Chapter 4, Off Site Consequence Analysis Guide, pp. 4-30, exhibit 4-19, provided by the EPA).\n\nThe alternative scenario for a one (1) ton chlorine container would assumes a flexible tubi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2715,
      "SummaryText": "ng failure, bad connection, or valve failure which would result in the release of gas through the 5/16 inch diameter valve body opening. This would release 15 pounds of chlorine per minute. The estimated affected perimeter from the facility is 0.2 miles. The Grand Junction Haz-mat team responds to hazardous chemical releases and would notify the public of actions to take in the affected area. The quantity of chemical released depends on how long it takes the Haz-mat team to respond, and stop the release. Assuming 30 minutes for response and 30 minutes to stop the release the amount of chemical released could be 900 pounds in 60 minutes.\n\n(The data for this scenario was taken from Risk Management Program Guidance for Wastewater Treatment Plants, Chapter 4, Off Site Consequence Analysis Guide, pp. 4-26, exhibit 4-15, provided by the EPA).\n\nIn all of the scenarios, the Grand Junction Haz-mat team would respond to the hazardous chemical releases and would notify the public of actions to take in the affected area.\n\n4. General Accidental Release Prevention Program and Specific Prevention Steps.\n\nIt is the management's opinion that the Persigo WWTF is currently in compliance with USEPA's Accidental Release Prevention Rule and all applicable Colorado State codes and regulations. The facility was designed and constructed in 1984 in accordance with National Fire Protection Association (NFPA) and local building codes. Equipment and components related to receiving, feed process and final discharge of hazardous chemicals are inspected daily and maintained according to manufacturer recommendations. Persigo Wastewater treatment plant staff have been trained to follow specific operational and maintenance procedures while handling hazardous chemicals.\n\nThe feed process for chlorine and sulfur dioxide was updated in 1995 to reduce the risks of a release: 90% of the plumbing system is now under vacuum feed, which reduces the risk of a chemical release. The flow of chemicals is shut of"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 2715,
      "SummaryText": "f in the event of a leak in the vacuum system and helps to prevent a release of hazardous chemical. \n\nPlant personnel check the hazardous chemical feed system daily and a scheduled maintenance program is in place. Chemical release detection sensors are located in the feed and storage rooms to set off alarms if a release is detected. The alarms at the chlorine building turn off the heating and ventilation systems, sound an alarm, and activate a strobe light outside of the building. This light is visible from work areas near the chlorine building. The alarm is also detected in the operations building. After working hours, the alarm activates the automatic phone dialer and key personnel are called. Specific procedures are in place for after hour's alarms, and all plant personnel have been trained to carry out these procedures in the event of an alarm after normal working hours. The policy and procedure manual is reviewed and updated annually.\n\n5. Five-year accident history.\n\nWe have had no accidental release. There has never been an accidental release of chlorine or sulfur dioxide since the plant was built in 1984. \n\n6. Emergency Response Program.\n\nIt is the management's opinion that the Persigo WWTF emergency response program is in compliance with the OSHA Employee Emergency Plans and Fire Prevention Plan Standard, 29 CFR 1910.38(a). These standards and the WWTF program is supported by the Mesa County Local Emergency Planning Committee and Grand Junction Haz-mat Team personnel. The Grand Junction Haz-mat Team has had specific on-site training at the WWTF to prepare for and respond to a release at this facility.\n\nAdditional points of contact:\nAny questions regarding the actions to be taken by the Haz-mat team, in the advent of a release at this facility, can be answered by, Mr. Drew Reekie, Environmental Specialist, of the Grand Junction Haz-mat team. Mr. Reekie can be reached by phone at (970) 244-1470, or his E-mail address is drewr@ci.grandjct.co.us.\n\n7. Planned Cha"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 2715,
      "SummaryText": "nges to Improve Safety.\n\nIt is the management's opinion that this facility is in compliance with all NFPA standards currently adopted and enforced by the Grand Junction Fire Department. The Grand Junction Fire Department does not require any modifications to the current processes to become current with new NFPA codes until expansion of the facility takes place. Any recommended upgrades or modifications requested at that time will be addressed.\n\nA number of alternative processes have been considered for the replacement of the hazardous chemicals. This facility will continue to evaluate safer alternative ways to treat wastewater in a cost-effective manner in the future."
    }
  ]
}