{
  "FacilityID": 2719,
  "FacilityName": "City of Rockport Wastewater Treatment Plant",
  "FacilityStr1": "1401 North Pearl Street",
  "FacilityStr2": null,
  "FacilityCity": "Rockport",
  "FacilityState": "TX",
  "FacilityZipCode": "78382",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48007",
  "LEPC": "Aransas County LEPC",
  "FacilityLatDecDegs": "28.037222",
  "FacilityLongDecDegs": "-97.056389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Rockport",
  "OperatorStr1": "P.O. 1059",
  "OperatorStr2": null,
  "OperatorCity": "Rockport",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78381",
  "OperatorZipCodeExt": "1059",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000033322",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-10-07 00:00:00",
  "SafetyInspectionBy": "Texas Municipal League",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 28.037222,
  "FRS_Long": -97.056389,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3036,
      "AltID": "Chlorination",
      "FacilityID": 2719,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 3238,
          "ProcessID": 3036,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 3101,
          "ProcessID": 3036,
          "NAICSCode": "56221",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1968,
              "Process_NAICS_ID": 3101,
              "SafetyReviewDate": "1999-04-28 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-05-10 00:00:00",
              "ChangeCompletionDate": "1999-05-10 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Air dispersion",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-12 00:00:00",
              "TrainingReviewDate": "1999-04-29 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-11 00:00:00",
              "EquipmentInspectionDate": "1999-05-12 00:00:00",
              "EquipmentTested": "auto analyzer",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1992,
                  "PreventionProgram2ID": 1968,
                  "ProcessChemicalID": 3238
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 2719,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-04 00:00:00",
    "ERTrainingDate": "1999-06-04 00:00:00",
    "CoordinatingAgencyName": "Rockport Fire Department",
    "CoordinatingAgencyPhone": "3617291111",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2719,
      "SummaryText": "1.0 REGULATED SUBSTANCES\n\nThe City of Rockport Wastewater Treatment Plant (WWTP) uses two regulated chemicals, chlorine and sulfur dioxide, in the treatment of municipal wastewater. \n\nChlorine is used in the disinfection of municipal wastewater. Chlorine is stored prior to and during use in 1-ton containers. The containers are stored prior to and during use on a partially enclosed concrete pad. The maximum intended chlorine inventory at the facility is 4,000 lbs. The chlorine is stored as a pressurized liquefied gas, and is released into wastewater using a vacuum-regulated system. The maximum inventory of chlorine at the facility exceeds the RMP threshold quantity of 2,500 lbs.\n\nThe facility uses sulfur dioxide in the removal of chlorine from treated wastewater. Sulfur dioxide is stored in upright 150-lb cylindrical tanks. The storage area for sulfur dioxide consists of five (5) 150-lb cylinders surrounded by steel piping but otherwise unenclosed. Four 150-lb tanks are stored in a completely enclosed area with only one (1) tank in use at any given time. The sulfur dioxide is stored as a liquefied gas and released into wastewater using a vacuum-regulated system. The amount of sulfur dioxide  does not exceed the RMP threshold quantity of 5,000 lbs.\n\n\n2.0  POLICIES\n\nChlorine and sulfur dioxide are toxic chemicals and precautions must be taken in order to prevent unnecessary exposure to city employees and to reduce the treat of accidental release which might result in public exposure to the surrounding community ad to the environment. It is our policy to adhere to all applicable Federal and Stare rules and regulations. Chemical safety at the City of Rockport WWTP is dependent upon strict operating procedures, safe handling methods, and thorough training of employees. Chlorine and sulfur dioxide safety devices are also inherent in the design of the facility and  in the equipment used in the chlorine chemical process.\n\n\n3.0 WORST CASE/ALTERNATIVE CASE SCENARIO ANALYSES IN"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2719,
      "SummaryText": "CLUDING ADMINISTRATIVE CONTROLS AND MITIGATION MEASURES TO LIMIT THE DISTANCES FOR EACH REPORTED SCENARIO.\n\nEPA defines the worst case scenario as total failure of the largest vessel. The alternative case scenario is defined as a release that is more likely to occur than the worst case scenario. The alternative case scenario should also reach an offsite endpoint, unless no such scenario exists.\n\nAt the City of Rockport WWTP, the worst case scenario for the RMP regulated chemical, chlorine, would result in a release of 2,000 pounds of chlorine gas. The impact radius would be 1.3 miles and affect 2,600 persons. Public receptors would include schools, residences, hospitals, public recreation areas or arenas, and major commercial or industrial areas. There were no environmental receptors within the impact radius.\n\nThe alternative scenario for chlorine would result in a release of 2,000 pounds of chlorine gas. The impact radius would be 0.3 miles and affect 180 persons. Public receptors would include residences, hospitals, public recreation areas or arenas, and major commercial or industrial areas. There were no environmental receptors within the impact radius.\n\nThe worst case scenario for the RMP regulated chemical, sulfur dioxide, would result in a release of 150 pounds of sulfur dioxide. The impact radius would be 0.3 miles, affecting 180 person. Public receptors would include residences, hospitals, public recreation areas or arenas, and major commercial or industrial areas. There were no environmental receptors within the impact radius.\n\nThe alternative scenario for sulfur dioxide would result in a release of 150 pounds of sulfur dioxide. The impact radius would be 0.1 miles and affect 20 persons. Public receptors within the endpoint would include public recreation areas or arenas, and major commercial or industrial areas. There were no environmental receptors within the impact radius.\n\n\n4.0 PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\nThe City of Rockp"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2719,
      "SummaryText": "ort WWTP complies with the Occupational Safety and Health Administration (OSHA)'s Process Safety Management (PSM) rule,  EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  Our facility has taken all the necessary steps to comply with the accidental release prevention requirements under 40 CFR part 68 of the EPA. The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nSafety Information \n\nThe City of Rockport WWTP maintains a detailed record of safety information that describes the chemical hazards, operating parameters, and equipment designs associated with the wastewater disinfection process.\n\nHazard Review\n\nOur facility conducts comprehensive studies to ensure that the hazards associated with our chlorine and sulfur dioxide processes are identified and controlled efficiently.  The methodology used to carry out these analyses is a \"What if\" checklist.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at least once every five years.  Any findings related to the hazard review are addressed in a timely manner.\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our chlorine and sulfur dioxide processes, The City of Rockport WWTP maintains written operation procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown, and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operations involved in the process.\n\nTraining\n\nThe City of Rockport WWTP has a comprehensive training program to ensure employees who are operating the chlorine and sulfur dioxide processes are competent in the operations procedures associated with the processes. \n\nMaintenance\n\nThe City of Rockport WWTP ca"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2719,
      "SummaryText": "rries our highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nCompliance Audit\n\nThe City of Rockport WWTP conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\n\nThe City of Rockport WWTP promptly investigates any incident that resulted in, or could reasonably result in a catastrophic release of propylene.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All investigation reports are retained for a minimum of five years.\n\n\n5.0 FIVE YEAR ACCIDENT HISTORY\n\nIn the past five years, there have been no accidental releases of chlorine that resulted in deaths, injuries, or significant property damage onsite, or know offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\n\n\n6.0 EMERGENCY RESPONSE PROGRAM \n\nThe City of Rockport WWTP employees will not respond to a chemical emergency at the plant.  As required by CFR 40 68.90, the City of Rockport is included in the community emergency response plan developed under 42 U.S.C. 11003 and appropriate mechanisms are in place to notify emergency responders when there is a need for response.   \n\n\n7.0 PLANNED CHANGES TO IMPROVE SAFETY\n\nThe City of Rockport WWTP plans to develop chemical specific operating pro"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 2719,
      "SummaryText": "cedures, training procedures, and maintenance procedures. These procedures will then be implemented to ensure the safe operation and mechanical integrity of the RMP regulated process."
    }
  ]
}