{
  "FacilityID": 27254,
  "FacilityName": "W,G & L Water Filtration Plant",
  "FacilityStr1": "1726 Lily Pond Road",
  "FacilityStr2": null,
  "FacilityCity": "Albany",
  "FacilityState": "GA",
  "FacilityZipCode": "31707",
  "Facility4DigitZipExt": "9761",
  "FacilityCountyFIPS": "13095",
  "LEPC": "Dougherty County LEPC",
  "FacilityLatDecDegs": "31.508889",
  "FacilityLongDecDegs": "-84.203361",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AE",
  "FacilityURL": "www.albanyutil.org",
  "FacilityEmailAddress": "gmorefield@wgl.albanyga.org",
  "FacilityDUNS": 30964605,
  "ParentCompanyName": "Albany Water Gas & Light Commission",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Albany Water Gas and Light Comm.",
  "OperatorStr1": "207 Pine Ave.",
  "OperatorStr2": "P.O. Box 1788",
  "OperatorCity": "Albany",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31701",
  "OperatorZipCodeExt": "2530",
  "RMPContact": "Sue Bays",
  "RMPTitle": "Safety Loss Control Coordinator",
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000180939",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-12-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-12-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-12-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-02-12 00:00:00",
  "DeRegistrationEffectiveDate": "2020-02-04 00:00:00",
  "AnniversaryDate": "2007-12-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 31.50889,
  "FRS_Long": -84.20336,
  "FRS_Description": "ATMOSPHERIC EMISSIONS TREATMENT UNIT",
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 39157,
      "AltID": "Disinfection of water",
      "FacilityID": 27254,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 40073,
          "ProcessID": 39157,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 51457,
          "ProcessID": 39157,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 551457,
          "ProcessID": 39157,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 27254,
      "SummaryText": "The chemical accident prevention rule (40CFR Part 68) requires owners and operators of  satationary soures subject to the rule to submit a Risk Management Plan (RMP) under the Clean Air Act, section 12 (R)(7), by June 21, 1999, for the prevention and mitigation of accidental chemical release. Facilities are subject to the RMP rule if they have more than a threshold quantity of one of the regulated 77 acutely toxic substances, 63 flammable gases or volatile liquids in a process. Part 68 requires that sources with more than the threshold quanitiy of a regulated substance in a process develop a prevention program, emergency response program and to communicate to the public the regulated substances handled, five-year accident history, worst-case release scenaio and an alternative release scenario.\n\nIt is the Albany Water, Gas and Light (WG&L) policy to operate a safe Water Treatment plant (WPT), reducing to the greatest extent possible of any hazards associated with the processes and reducing and subsequent risk to the surrounding community, personal, and environment. This policy includes working with the surrounding Community and local emergency response agencies, to promote a spirit of cooperation and teamwork, to orchestrate an effective contingency plan in the unlikely event of a process incident occorring at the Albany WG&L WTP.\n\nThe Albany WG&L WTP is located approximately 2 miles south of the Albany Regional Airport main entrance on the East side of Highway 92. WG&L provides potable water to the city of Albany and portions of Dougherty County. We use chlorine at this site for disinfecting drinking water per the U.S. Environmental Protection Agency, 1976 Safe Drinking Water Act.\n\nChlorine Information\nChlorine is one of the chemical elements. Neither the gas or the liquid is explosive or flammable; however, like oxygen, it is capable of supporting combustion. Both react chemically with many substances. Chlorine gas is greenish yellow in color; liquid is a clear amb"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 27254,
      "SummaryText": "er color. Chlorine gas is about two and one haft times heavier then air and therefore, if it escapes from a container or system it will seek the lowest level. Liquid chlorine is about one and one-haft times heavier than water. One volume of liquid when vaporized will produce about 460 volumes of gas. Chlorine is extremely corrosive when in contact with moisture. Chlorine is easy to detect at very low concentrations, has a penetrating and irritating odor.\n\nChlorine gas is a respiratory irritant. Inhaling the gas in high concentration causes coughing, tears, running nose and breathing difficulties. These symptoms result from chlorine combining with moisture in the lungs to form a weak acid. All symptoms are reversible if the person is removed from the area, kept comfortable, and is given proper medical attention. Complete recovery is normal. However, if a person is trapped for a long period of time in a high chlorine-concentration atmosphere, death can result.\n\nEffects of various levels of chlorine inhalation (dependent on the physiological makeup of the person) are as follows:\nLess than 1 part per million (ppm)     Threshold of odor perception for the average person.\n3 - 5 ppm                                            Slight irritation of the nose and upper respiratory tract.\n5 - 8 ppm                                            Irritation of the respiratory tract and eyes.\n15 - 20 ppm                                        Immediate, severe irritation of the respiratory tract: intense\n                                                           cough and choking.\n30 ppm                                               Shortness of breath, chest pains, possibly nausea and vomiting.\n40 - 60 ppm                                        Development of chemical bronchitis and fluid in the lungs, which may\n                                                           occur after several hours; chemical pneumonia may occur several\n                                                    "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 27254,
      "SummaryText": "       days later.\nProlonged exposure above 50 ppm   Unconsciousness and death.\n\n\nWorst-case and Alternative Release Scenarios\nThe worst-case release scenario is defined by the USEPA as the release of the largest quantity of a regulated substance from a vessel or process line failure in ten minutes, that results in the greatest distance to an end point. The worst-case release scenario for the WG&L WTP involves a failure of a one-ton cylinder yielding a cumulative release of 2100 lbs. of chlorine, with a wind speed of 3.4 miles/hour, an atmospheric stability class of \"F\", with passive mitigation measures only.\nWhen atmospheric dispersion modeling for this unlikely scenario was performed using EPA's \nRMP*Comp ?, a distance to toxic endpoint of 2.2 miles was obtained.\n\nThe alternative release scenarios are assumed to be more realistic, it serves to more accurately depict the \nconfiguration and effects of an accidental release at the WG&L WTP. The alternative release scenario for the WG&L WTP involves the mechanical failure of a flexible manifold connection (pigtail) allowing the accidental release of chlorine at a rate of 8 lbs./min. for 60 minutes, with a wind speed of 6.7 miles/hour, an atmospheric stability class of \"D\", with passive and active mitigation in place.\nWhen atmospheric dispersion modeling for this scenario was performed using EPA's RMP*Comp. ?, a distance to toxic endpoint of 0.1 miles was obtained.\n\nThe distance that the substance would travel before dissipating enough to no longer pose a hazard to the public is called the \"the endpoint.\" Toxic endpoints are defined by the USEPA in Appendix A of 40 CFR part 68. For chlorine, the toxic endpoint is defined as 0.0087 milligrams per liter (mg/l), for an exposure time of one hour.\n\n\nFive-Year Accident History\nThe Albany WG&L WTP has no accidents to report; this is a new facility.\n\n\nPrevention Program\nWhen receiving a new shipment or changing empty chlorine ton cylinders, there will a minimum of three plant "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 27254,
      "SummaryText": "operators, safety equipment and the WTP Chlorine Handling Standard Operating Procedure checklist.\nAll chlorine cylinders are received, stored and used in a chlorine storage room designed under the 1994 Uniform Fire Code (Article 80, Hazardous Materials, in particular), the 1991 Uniform Building Code and the latest NIOSH guidelines. The chlorine storage room is visually monitored a minimum of six times daily by plant personnel and is equipped with a chlorine leak detector. Access is limited to plant personnel only.\n\nIf in the event of a chlorine leak, the chlorine leak detector will automatically start a chlorine room scrubber, activate a visual and audible alarm at the chlorine storage site and in the WTP control room. The room scrubber is sized to the anticipated release including the flow rate, quantity of the leak, and the volume of the room. Fresh air is introduced at the top of the containment room, while contaminated air is removed from the bottom. The airflow maintains a negative pressure in the room during the entire release and subsequent scrubbing period, minimum over all system removal efficiency of 99.99%. Scrubber will safely absorb more than 2350 pounds of\nchlorine (a ton Cylinder plus 15%).\n\n\nEmergency Response Program\nIn the event of an uncontrolled chlorine leak, Plant staff will call \"911\". This facility has elected not to create an On-site emergency response team. All employees will give complete cooperation to the responding outside agencies, including but not limited to the fire department, emergency medical services and law enforcement. Public notification and/or evacuation will be performed by the responding agencies, at their discretion.\n\n\n\nFor more information, comments or concerns.\nYou may write us at\n\nAlbany Water Gas and Light\nPO Box 1788\nAlbany, Georgia 31701-2530\nc/o: Water Treatment Plant RMP"
    }
  ]
}