{
  "FacilityID": 27474,
  "FacilityName": "Champaign Distribution Center",
  "FacilityStr1": "2611 North Lincoln Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Urbana",
  "FacilityState": "IL",
  "FacilityZipCode": "61801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17019",
  "LEPC": "Champaign County LEPC",
  "FacilityLatDecDegs": "40.141667",
  "FacilityLongDecDegs": "88.22",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "PF",
  "FacilityURL": "www.supervalu.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6961411,
  "ParentCompanyName": "SUPERVALU",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "SUPERVALU",
  "OperatorStr1": "PO Box 990",
  "OperatorStr2": null,
  "OperatorCity": "Minneapolis",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55440",
  "OperatorZipCodeExt": "0990",
  "RMPContact": "Mike Guth",
  "RMPTitle": "Director of Distribution",
  "FTE": 560,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000047095",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-07-19 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-02-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-02-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-02-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-02-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 40.13675,
  "FRS_Long": -88.21988,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 39505,
      "AltID": "Refrigeration System",
      "FacilityID": 27474,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 40422,
          "ProcessID": 39505,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 51894,
          "ProcessID": 39505,
          "ChemicalID": 56,
          "Quantity": 35250.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 551894,
          "ProcessID": 39505,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 27474,
      "SummaryText": "The Champaign Distribution Center, a Division of SuperValu, Inc., located at 2611 North Lincoln Avenue, Urbana, IL, is a food distribution center supplying perishable and dry good items to retail grocery stores throughout the midwest.\n\nAt our facility, anhydrous ammonia (cas #7664-41-7) is used as a refrigerant to cool our perishable product rooms and freezers. Designed as a closed loop system, ammonia is circulated to each of the room cooling units (evaporators) and returns to the suction accumulator (cooler rooms) or the low temperature recirculator (freezer units), located in the Engine Room. Heat laden ammonia vapor is pulled from the accumulators, compressed, and sent to rooftop condensers where it is cooled and liquified and re-circulated to the room cooling units. The maximum system working pressure is 165 psig. Maximum quantity of ammonia on-site is 35,250 lbs.\n\nWorst-case Scenario for a toxic substance:\n\nAs required by 40 CFR 68 Subpart B, the Champaign Distribution Center has evaluated a worst-case release scenario for anhydrous ammonia using the parameters specified by the EPA.  The worst-case release scenario is defined as the release of the entire contents of the largest single vessel over a 10-minute period.  Based on the Champaign Distribution Center's refrigeration system, the worst case release scenario is the rupture of the largest single vessel (the High Pressure Receiver) containing 4,020 pounds of ammonia  when filled to 80% capacity, the maximum fill capacity allowed by the operating and engineering controls. Using the EPA's RMPGuidance for Ammonia Refrigeration Reference Tables or Equations,  the maximum distance to the specified \"endpoint\" (1.14 miles) includes offsite receptors. Using Landview 3 census data, an ammoia release of this size, would affect a population of 620, one school, residential and industrial areas and small retail businesses. \n\nThe worst-case release scenario was developed following EPA regulations and is not considered b"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 27474,
      "SummaryText": "y the Champaign Distribution Center to be a likely release scenario for the facility.  During normal operations, the Champaign Distribution Center maintains the receivers at no more than 30% capacity.  Only during pump-down operations (which would only occur during major modifications to the facility) do the receivers have the potential to be filled to 90% of capacity.   \n\nAlternative release scenario for a toxic substance:\n\nA more realistic release scenario (alternative release) was developed by the Champaign Distribution Center taking into consideration the process hazard analyses (PHAs) conducted to ensure that hazards associated with operating an ammonia refrigeration system are identified and minimized.  These analyses were conducted in accordance to Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) regulations promulgated as Title 29 of the Code of Federal Regulations Chapter 1910, Section 119 (29 CFR 1910.119). A more credible release scenario identified by the Champaign Distribution Center would be a release caused by a leak of a liquid pipe and a reasonable response time from the facility's refrigeration operators and the local HAZMAT Team. \n  \nAccidental Release and Emergency Response Policies:\n\nThe Champaign Distribution Center has trained all associates to recognize and report accidental ammonia releases, no matter how small. Selected Maintenance Department employees have been trained and will respond to, and attempt to isolate minor releases (0-300ppm).  If a mojor release occurs (over 300 ppm), response personnel are instructed to shut down the refrigeration system, using the Emergency Stop Switches, and notify the Urbana Fire Department. The Urbana Fire Department has trained Hazardous Materials Technicians who will respond to all major ammonia releases.\n\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps:\n\nThe Champaign Distribution Center not only complies with the EPA Risk Managem"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 27474,
      "SummaryText": "ent Regulation but also the OSHA Process Safety Management Standard to assure that the Ammonia Refrigeration System is well maintained and employees are properly trained and periodically retrained to assure they are kept up to date on any changes and new operations that may effect them. In addition, to maintain the mechanical integrity and safety of this process, this facility practices the following industry codes and standards: ASME Boiler & Pressure Valve Codes; ANSI B31.3 Piping Code; IIAR industry guideline for safety and good engineering practices; NFPA guidelines for fire protection equipment.\n  \nThrough regular audits, training, maintenance, testing and inspection programs the Champaign Distribution Center has established a history of safe operation, community emergency action plans are current, and training with community services is done for a safe response in the event of an accidental release.\n\nFive Year Accident History:\nNone to report. \n\nEmergency Response Program:\n\nThe Champaign Distribution Center has devised a comprehensive emergency response program, designed to protect both employees and the community in the event of an ammonia release.  This program is fully described in a document entitled EMERGENCY RESPONSE PLAN (ERP) in order to facilitate response efforts in the event of an off-site anhydrous ammonia release.  Included in the plan are measures to be taken internally by Sara Lee Bakery as well as measures to be taken by off-site response agencies.\n\nThe following local agencies have reviewed and approved Sara Lee Bakery's ERP:\nUrbana Fire Department\nChampaign Fire Department\nChampaign County ESDA\n\nIn the event of an anhydrous ammonia release with off-site effects, the general public will be warned using the following methods:\n \nSirens\n \nBroadcast message via the television by the County LEPC\n \nPolice and fire vehicles equipped with public address systems, and\n \nDoor-to-door notification of residents (if time permits).\n\nPrimary Public Emergency "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 27474,
      "SummaryText": "Responders:\n\nLocal Fire Department:  Urbana Fire Department\nLocal Hazardous Material Response Team:  Urbana Fire Department; Champaign Fire Department\n\nContinuing Efforts to Improve Safety\n\nAs part of the Champaign Distribution Center's continuous efforts to improve the performance of its safety systems and Refrigeration Operators, the ammonia detection system and emergency ventilation system were upgraded in February, 2003. Refresher training for Refrigeration Operators was conducted in January, 2003."
    }
  ]
}