{
  "FacilityID": 2755,
  "FacilityName": "Sulphur Springs Waste Water Plant",
  "FacilityStr1": "360 Thomas Road",
  "FacilityStr2": null,
  "FacilityCity": "Sulphur Springs",
  "FacilityState": "TX",
  "FacilityZipCode": "75482",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48223",
  "LEPC": null,
  "FacilityLatDecDegs": "33.158333",
  "FacilityLongDecDegs": "-95.522222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 68985852,
  "ParentCompanyName": "City of Sulphur Springs",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Sulphur Springs",
  "OperatorStr1": "125 S. Davis",
  "OperatorStr2": null,
  "OperatorCity": "Sulphur Springs",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75482",
  "OperatorZipCodeExt": null,
  "RMPContact": "Marc Maxwell",
  "RMPTitle": "City Manager",
  "FTE": 10,
  "OtherEPAFacilityID": "TX0058955",
  "EPAFacilityID": "100000033698",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-05-18 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 33.15833,
  "FRS_Long": -95.52222,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3079,
      "AltID": "Chlorine",
      "FacilityID": 2755,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3144,
          "ProcessID": 3079,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3286,
          "ProcessID": 3079,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503286,
          "ProcessID": 3079,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 3080,
      "AltID": "Sulphur Dioxide",
      "FacilityID": 2755,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3145,
          "ProcessID": 3080,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3287,
          "ProcessID": 3080,
          "ChemicalID": 49,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503287,
          "ProcessID": 3080,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2755,
      "SummaryText": "THE ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICY AT THE CITY OF SULPHUR SPRINGS WASTE WATER FACILITY\n\nThe City of Sulphur Springs Waste Water Facility located at 360 Thomas Road has a comprehensive Emergency Response Policy to be followed in all cases which involve real or potential injury to City personnel, immediate neighbors, nearby residents of the community and/or the environment. The plan concentrates on chemical release emergencies and specifies emergency response procedures to be followed by City of Sulphur Springs employees. These activities include recognition of the emergency; responding in a defensive manner in the protection of life and property; limited control, containment, and confinement activities; and facility evacuation. OSHA HAZWOPER requirements for achieving this capability are detailed. The plan is constructed generally around the requirements given in 29 CFR 1910.120. It is intended primarily for use in connection with a chlorine or sulphur dioxide release, since those are the facilitys most sensitive chemicals from both safety and environmental points of view. This plan is intended for use in conjunction with the Facilities Emergency Action Plan covering evacuation procedures. The Emergency Response Policy is backed up by and is a supplement to Annex Q of the City of Sulphur Springs Emergency Management Plan.\n\nThe facility manager is directly responsible for coordinating the efforts involving this Emergency Response Policy. The facility manager is closely involved with the activities which bear on the facilitys interface with the public and Fire and Emergency Management responders as well. The City Manager has overall accountability for the program. The facility manager and shift supervisors are responsible for directing the activities of the employees involved in emergency responses.\n\nIt is not the intent of the Waste Water Facility to maintain a complete hazardous materials emergency response team. Activities of facility "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2755,
      "SummaryText": "employees are limited to the capabilities attained for their training level as described below. The intent of the facility is to maintain a training level no higher than Hazardous Materials Operational Level. This level of training permits the employee to respond at the site of the emergency only under conditions permitting activities within their levels of expertise gained through the training described below. In the event of the use of the Sulphur Springs Fire Department and Office of Emergency Management, employee assistance in the emergency response will be under the guidance of the on-site Incident Commander, which in our case means only along with outside responding entry teams, and only if the assistance can be given within parameters set for the training level achieved by facility employees.\n\nThe facility maintains coordination with the Sulphur Springs Fire Department and the Sulphur Springs Office of Emergency Management in order to familiarize them with the potential emergencies which might occur. The Waste Water Facility has assembled and maintains appropriate materials in the form of manufacturers literature, handbooks, pictures, drawings, etc. to demonstrate clearly the layout of the facilitys potential trouble areas and the equipment which the Sulphur Springs Fire Department may need to work with to alleviate an emergency situation. This material will be used by facility personnel, in a safe area prior to entry into the emergency site, to assist the Sulphur Springs Fire Department in their activities, and to show the outside responders what they need to do to mitigate any potential emergency situation.\n\nPeriodic tours are offered to the Sulphur Springs Fire Department and the Sulphur Springs Office of Emergency Management in order to familiarize their personnel with our facility. The general public is also welcome to tour the City of Sulphur Springs Waste Water Facility.\n\nIn any emergency situation, the facility manager will be in overall charge of t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2755,
      "SummaryText": "he facility employees and their activities. In the facility managers absence, the shift supervisor will be in charge. The Sulphur Springs Fire Department or Office of Emergency Management will be in charge of actual response activities.\n\nTHE CITY OF SULPHUR SPRINGS WASTE WATER FACILITY AND THE REGULATED SUBSTANCES HANDLED\n\nThe primary activity of the City of Sulphur Springs Waste Water Facility is the treatment of the municipal waste water supply. The primary regulated products are chlorine and sulphur dioxide.\n\nTHE WORST-CASE RELEASE SCENARIO AND THE ALTERNATIVE RELEASE SCENARIO\n\nThe chlorine worst-case release scenario is based on a ten minute release of a 2000 pound cylinder. The offsite impact could be up to 1.3 miles from the Waste Water Facility. The number of citizens who might be affected by such a release would depend on the wind speed, direction, and other atmospheric conditions at the time of the release. In the entire 1.3 mile radius around the facility the approximate residential population is 2500 citizens.\n\nThe chlorine alternative release scenario is based on a 200 pound pipe leak release of chlorine which would affect only a radius of 0.10 miles around the facility. This area has no residential population. This type of leak can be mitigated by trained plant employees with minimal exposure.\n\nThe sulphur dioxide worst-case release scenario is based on a ten minute release of a 2000 pound cylinder. The offsite impact could be up to 1.3 miles from the Waste Water Facility. The number of citizens who might be affected by such a release would depend on the wind speed, direction, and other atmospheric conditions at the time of the release. In the entire 1.3 mile radius around the facility the approximate residential population is 2500 citizens.\n\nThe sulphur dioxide alternative release scenario is based on a 200 pound pipe leak release of sulphur dioxide which would affect only a radius of 0.10 miles around the facility. This area has no residential popula"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2755,
      "SummaryText": "tion. This type of leak can be mitigated by trained plant employees with minimal exposure.\n\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nIn accordance with the Emergency Response Plan, on-site evacuation resources and facilitators or other management personnel will make the decision as to whether outside help needs to be summoned. This decision will be made on the basis of the type and scale of the emergency and the likelihood of injury to facility personnel, immediate neighbors, nearby residents of the community, and the environment. Fire Department, Office of Emergency Management, Emergency Medical Services and Police can be reached by calling  911.\n\nIf outside emergency responders are summoned, the facility employees will give information including the location, the type of emergency, its scale including injuries, its location within the facility, and the best approach route.\n\nTHE FIVE YEAR ACCIDENT HISTORY\n\nThe City of Sulphur Springs Waste Water Facility has had no reportable accidents in the last five years.\n\nTHE EMERGENCY RESPONSE PROGRAM\n\nFirst Responder Operational Level trained employees will respond to the emergency only in a defensive manner to protect nearby persons, property, and the environment. This training is designed to provide the ability to contain the release from a safe distance, keep it from spreading, and  prevent exposures.\n\nThe First Responder Operational Level of training is available through the local office of Emergency Management. The training consists of at least sixteen hours in the classroom or sufficient experience to objectively demonstrate competency in the areas listed below:\n\na.  Basic hazard and risk assessment techniques.\nb.  Use of proper personal protective equipment available at this response level.\nc.  Basic hazardous material terminology.\nd.  Basic control, containment and/or confinement operations available at this level of response.\ne.  Basic decontamination procedures.\nf. "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 2755,
      "SummaryText": " Relevant operating and termination procedures.\n\nAppropriate personal protective equipment (PPE) is available at the Waste Water Facility for chemical release emergencies up to a scale requiring SCBA (Self-Contained Breathing Apparatus). Employees involved in response to minor emergencies will use this PPE as needed for each incident.\n\nResponding agency personnel such as the Sulphur Springs Fire Department are equipped with their own PPE, including SCBA capability. They also have their own decontamination equipment.\n\nThe emergency response CHLORINE KIT and SULPHUR DIOXIDE KIT are maintained onsite at the Waste Water Facility.\n\nPLANNED CHANGES TO IMPROVE SAFETY AT THE CITY OF SULPHUR SPRINGS WASTE WATER FACILITY\n\nAll new employees are scheduled for Haz/Mat Operational Level training. Mock disaster training is held annually.\n\nAfter every training scenario or actual release, whether minor in scale or large enough to require outside assistance, a critique will be conducted to determine areas of the procedures needing improvement. This critique will be conducted by the facility manager and will include input from any of the responding agencies involved. The facility manager will consider the outcome of the critique and incorporate any needed changes to this plan and the operating procedures."
    }
  ]
}