{
  "FacilityID": 27611,
  "FacilityName": "Agriliance LLC - Valparaiso",
  "FacilityStr1": "403 East U.S. Hwy 30",
  "FacilityStr2": null,
  "FacilityCity": "Valparaiso",
  "FacilityState": "IN",
  "FacilityZipCode": "46383",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18127",
  "LEPC": "Porter County LEPC",
  "FacilityLatDecDegs": "41.444167",
  "FacilityLongDecDegs": "-86.987778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Agriliance LLC",
  "Company2Name": null,
  "CompanyDUNS": 152719498,
  "Company2DUNS": null,
  "OperatorName": "Agriliance LLC",
  "OperatorStr1": "403 East U.S. Hwy 30",
  "OperatorStr2": null,
  "OperatorCity": "Valparaiso",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46383",
  "OperatorZipCodeExt": null,
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000061531",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-09-30 00:00:00",
  "SafetyInspectionBy": "Office of the Indiana State Chemist",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-03-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-02-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-02-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-11-04 00:00:00",
  "DeRegistrationEffectiveDate": "2004-06-30 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 41.443278,
  "FRS_Long": -86.987915,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 39753,
      "AltID": "A-30,000 gallon Aqua Amm",
      "FacilityID": 27611,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 52262,
          "ProcessID": 39753,
          "ChemicalID": 57,
          "Quantity": 67000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 40670,
          "ProcessID": 39753,
          "NAICSCode": "42291",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 15459,
              "Process_NAICS_ID": 40670,
              "SafetyReviewDate": "2002-12-30 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "Indiana Agricultural Ammonia Law",
              "FR_Comments": null,
              "HazardReviewDate": "1999-02-26 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Vandalism and vehicular accident",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Routine visual observations (undocumented)",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-12-30 00:00:00",
              "TrainingReviewDate": "2002-12-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Competency",
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-12-30 00:00:00",
              "EquipmentInspectionDate": "2002-12-30 00:00:00",
              "EquipmentTested": "Storage Tanks",
              "ComplianceAuditDate": "2002-12-30 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1998-12-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 16153,
                  "PreventionProgram2ID": 15459,
                  "ProcessChemicalID": 52262
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "ProcessID": 39754,
      "AltID": "B-25,000 gallon Aqua Amm",
      "FacilityID": 27611,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 52263,
          "ProcessID": 39754,
          "ChemicalID": 57,
          "Quantity": 55000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 40671,
          "ProcessID": 39754,
          "NAICSCode": "42291",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 39755,
      "AltID": "C-25,000 gallon Aqua Amm",
      "FacilityID": 27611,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 52264,
          "ProcessID": 39755,
          "ChemicalID": 57,
          "Quantity": 55000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 40672,
          "ProcessID": 39755,
          "NAICSCode": "42291",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 27611,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Porter County LEPC",
    "CoordinatingAgencyPhone": "2194653593",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Indiana Agricultural Ammonia Law"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 27611,
      "SummaryText": "Agriliance LLC ¿ Valparaiso\nFacility Manager:  Don Wagenblast\nFacility Telephone:  (219) 462-9049\n\nAccidental Release Prevention and Emergency Response Protocols:  The owners, management and employees of the Valparaiso facility are committed to providing a safe workplace free of accidental releases of aqua ammonia.  Health, safety and environmental compliance are a fundamental part of every employee's job.  It is facility protocol to adhere to applicable Federal, State and local laws and to implement appropriate controls to prevent accidental releases of aqua ammonia.  If an accidental release were to occur, the facility would respond in accordance with its Emergency Action Plan and is prepared to work with the local fire department, the Local Emergency Planning Committee and other authorities to control and mitigate the release and minimize the impact of the release to employees, the environment and the general public.\n\nStationary Source and Regulated Substances Handled:  The primary activity at this facility (the stationary source) is the storage and handling of fertilizers for direct retail sale to farmers.  Aqua ammonia (29% ammonia solution - 24% nitrogen) is received and stored at the facility and is used for blending into other liquid fertilizer mixtures and for distribution to farmers for direct application as a crop production nutrient.  The maximum stored quantity of aqua ammonia at the facility can be approximately 80,000 gallons (608,000 pounds) stored in two 25,000 gallon storage tanks (190,000 pounds each) and one 30,000 gallon storage tank (228,000 pounds).  The tanks can be filled to 100% full, but seldom are filled more than 92% - 93% full, which is measured by a liquid level gauge.  Aqua ammonia is delivered to the facility only in transport trucks; railroad cars are not used.  The maximum quantity of aqua ammonia stored at the facility would occur when all three stationary storage tanks are full and would be approximately 608,000 pounds.  All thre"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 27611,
      "SummaryText": "e storage tanks are located within a concrete secondary containment structure that can hold approximately 90,000 gallons.  The handling and storage of the aqua ammonia is subject to program 2 requirements of EPA's Risk Management Program.\n\nWorst-Case Release Scenario:  The worst-case release scenario would be the release of the total contents of the 30,000 gallon storage tank within the concrete secondary containment structure.  The maximum quantity of aqua ammonia (29% ammonia solution) released would be approximately 228,000 pounds of solution released as liquid with approximately 67,000 pounds of ammonia (228,000 pounds x 29%) being released as a vapor (i.e., evaporating) from the solution over 74.5 minutes.  The resulting distance to the toxic endpoint concentration extends offsite and public receptors are within the distance to the endpoint.  The distance to the toxic endpoint concentration (0.14 mg/L) is 0.60 miles, which is limited by the size of the concrete secondary containment structure.  There were no administrative controls considered in this scenario.  There was one passive mitigation measure considered in this scenario, which is, the size (approximately 8,000 square feet) of the concrete secondary containment.  The small size limits the spread (i.e., surface area or maximum pool area) of the ammonia solution and consequently the rate of evaporation and release of ammonia.\n\nAlternative Release Scenario:  The alternative release scenario involves a release of aqua ammonia from a pipe leak at one of the storage tanks.  The quantity of aqua ammonia (29% ammonia solution) released would be approximately 4,100 pounds of solution released as liquid with approximately 1,200 pounds of ammonia (4,100 pounds x 29%) being released as a vapor (i.e., evaporating) from the solution over 43.2 minutes.  The resulting distance to the toxic endpoint concentration extends offsite and public receptors are within the distance to the endpoint.  The distance to the toxic end"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 27611,
      "SummaryText": "point concentration (0.14 mg/L) is 0.11 miles.  The active mitigation measure considered which may assist in limiting the release duration is listed in section 3.16 and is manual shutting of valves.  There were no passive mitigation measures that affected this scenario, even though the storage tank and pipe are located within a concrete secondary containment structure.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps:  This facility complies with EPA¿s accidental release prevention requirements and applicable State and local codes and regulations.  The following sections briefly describe the elements of the facility¿s release prevention program.\n\n1) Safety Information:  The facility was designed, constructed and is operated in accordance with applicable Federal and State regulations.  All plans and procedures maintained at the facility are periodically reviewed by facility management for safety updates and changes.  Material Safety Data Sheets, equipment specifications and the codes and standards used to build and operate the aqua ammonia equipment are maintained at the facility. \n\n2) Hazard Review:  Facility management conducts reviews of the hazards associated with the handling and storage of aqua ammonia.  The reviews identify the opportunity for equipment malfunctions or human errors that could cause an accidental release, the safeguards used to control hazards and prevent releases, and the steps used to detect or monitor releases.  The results of the reviews are documented and problems identified are addressed in a timely manner.  In addition, it is facility protocol to not store combustible material under or immediately adjacent to the bulk aqua ammonia tanks or to locate petroleum or propane storage tanks immediately adjacent to the bulk aqua ammonia tanks.  \n\n3) Operating Procedures:  The facility maintains written operating procedures for the handling and storage of aqua ammonia.  The procedures generally follow State pr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 27611,
      "SummaryText": "ovisions.  The written procedures are reviewed by facility management on a regular basis and revised as necessary. \n\n4) Training:  All employees at the facility that handle aqua ammonia participate in a training program.  Initial training for new employees consists of classroom type instruction (e.g., reading safety information, operating procedures and response measures followed by an oral test) and on-the-job supervision.  Refresher training for all employees is conducted annually.  The training program is reviewed by facility management on a regular basis and revised as necessary. \n\n5) Maintenance:  The facility maintains written equipment inspection and maintenance procedures.  Storage and transfer/process equipment inspections are performed by qualified personnel on an approximate annual basis and are documented.  Equipment maintenance procedures follow either instructions furnished by the equipment vendors, State regulations or industry codes.  The written procedures are reviewed by facility management on a regular basis and revised as necessary.\n\n6) Compliance Audits:  As required by the RMP rule, compliance audits will be performed at least once every three years.  The audit will be documented and conducted by a person knowledgeable in the safe handling and storage of aqua ammonia.  Corrective actions required as a result of each compliance audit will be performed promptly and documented.    \n\n7) Incident Investigation:  Facility management will investigate each incident that results in, or could have reasonably resulted in a catastrophic release of aqua ammonia.  The investigation will be performed to identify the situation leading to the incident as well as corrective actions to prevent the release from reoccurring.  Investigation reports will be retained for five years.\n\nFive-Year Accident History:  There have been no accidental releases of aqua ammonia in the past five years that caused deaths, injuries, or significant property damage at the facility; no"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 27611,
      "SummaryText": "r, to our knowledge, resulted in offsite deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.\n\nEmergency Response Program:  In the event of an emergency, it is facility protocol per the Emergency Action Plan to notify the local fire department and other emergency responders and request that they respond to the emergency.  Facility employees will not respond to accidental releases of aqua ammonia except for those that are small or incidental, can be controlled at the time of the release by employees in the immediate release area (e.g., shutting a valve) and do not appear to pose an immediate safety or health hazard.  This protocol has been discussed with the local fire department and the other emergency responders and the facility has appropriate mechanisms in place to notify the emergency responders when there is a need for a response.  The facility is also included in the written community emergency response plan developed under the Emergency Planning and Community Right-to-Know Act (EPCRA).\n \nPlanned Changes to Improve Safety:  There are no specific aqua ammonia safety changes planned at this time.  However, safety improvement is an on-going process at this facility.  Periodic evaluations are performed to assess the safety of equipment and procedures."
    }
  ]
}