{
  "FacilityID": 27637,
  "FacilityName": "Parachute Creek Gas Plant",
  "FacilityStr1": "4289 County Road 215",
  "FacilityStr2": null,
  "FacilityCity": "Parachute",
  "FacilityState": "CO",
  "FacilityZipCode": "81635",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08045",
  "LEPC": "Garfield County LEPC",
  "FacilityLatDecDegs": "39.475",
  "FacilityLongDecDegs": "-108.125",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Williams Production RMT Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Williams Production RMT Company",
  "OperatorStr1": "P.O. Box 370",
  "OperatorStr2": null,
  "OperatorCity": "Parachute",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "81635",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bob Gardner",
  "RMPTitle": "Plant Superintendent",
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000181572",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-03-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-03-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-02-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-02-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 39.475,
  "FRS_Long": -108.125,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 39794,
      "AltID": "Nat. gas liq. Extraction",
      "FacilityID": 27637,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 40711,
          "ProcessID": 39794,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 52308,
          "ProcessID": 39794,
          "ChemicalID": 155,
          "Quantity": 520957.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 36778,
              "ProcessChemicalID": 52308,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 36779,
              "ProcessChemicalID": 52308,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 36780,
              "ProcessChemicalID": 52308,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 36781,
              "ProcessChemicalID": 52308,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 552308,
          "ProcessID": 39794,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 27637,
      "SummaryText": "This executive summary is a brief overview of the Risk Management Program and the associated policies at the Williams Parachute Creek Gas Plant.\n\nPrevention and Response Policies\nThe accidental release prevention and emergency response policies are represented in the Emergency Planning and Response Sections of the Parachute Creek PSM/RMP manual for the Natural Gas Liquids system(s). Williams takes an active role in preventing accidental releases at all of its facilities by ensuring that its employees are properly trained in the safe operation of covered processes and the safe handling of regulated chemicals.  As for emergency response, Williams has established and maintained procedures for emergency notification and response.  These are reviewed with employees on a periodic basis and revised to accommodate changes in staffing when they occur.\n\nWilliams? management understands its duty to provide a safe working environment and to take measures to prevent accidents that may have an effect on the surrounding community.  This understanding is reflected in procedures described and referenced in the PSM/RMP manual.\n\nStationary Source and Regulated Substances\nParachute Creek is a natural gas liquids extraction facility designed to process  100 mmscfd of natural gas.  The purpose of the Parachute Creek Gas Plant is to reduce the dew point of the gas to a level that is acceptable for pipeline transmission.  Control of the dew point is critical since the incoming gas is water-saturated in many cases.  The dew point increases as the concentration of moisture (water and heavy hydrocarbons) in the inlet gas increases.  As gas flows through the pipeline, its temperature will decrease to about the same temperature as the surrounding ground.  If this temperature is below the dew point of the gas, the water and heavy hydrocarbons will tend to condense.  The resulting buildup of hydrates can begin to restrict process flow, particularly at orifices and bends in the pipe.  In extreme c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 27637,
      "SummaryText": "old or pressure drop cases, the hydrates may even form a potentially dangerous ice plug.\n\nIn order to reduce the dew point of the gas (and accordingly, minimize the formation of hydrates), the inlet gas is chilled using a propane refrigeration system.  This process allows the heavy hydrocarbons and water to condense out of the process flow.  Ethylene glycol is spray-injected into the inlet gas at each heat exchanger to absorb the condensed water.  Ethylene glycol, condensed liquid hydrocarbons, and residue gas are then separated in a cold separator.  The lower the temperature in the separator, the greater the volume of liquid extracted, which also lowers the dew point of the residue gas.  The ethylene glycol is circulated through a reboiler to drive off condensate, and then it is circulated to the separator.  Condensed hydrocarbons are then stored.  The residual gas is at its dew point when it leaves the cold separator and is then delivered to the transmission pipeline.\n\nThe PSM/RMP-regulated substances handled at this facility are LPG and propane.  Following is a breakdown of the locations of these materials at Parachute Creek:\n\nNGL Plant Propane System:  Maximum Volume = 5000 gallons       \n             Maximum Weight = 14,848 lbs .\nPropane Makeup Tank:          Maximum Volume = 3000 gallons       \n             Maximum Weight = 8,909 lbs..\nLPG Product System:            Maximum Volume = 400 gallons       \n             Maximum Weight =  2,200 lbs\nLPG Product Storage:           Maximum Volume = 90,000 gallons     \n             Maximum Weight =  495,000\n                                              \nThe propane and liquid hydrocarbon system is the only covered process at this time at the Parachute Creek Gas Plant. \n\nFilling of the tanks is administratively limited to 80% of the tank capacity by NFPA 58 requirements, as corrected for facility elevation.\n\nRelease Scenarios\nWorst-case and alternative release scenarios have been determined after careful review of the reg"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 27637,
      "SummaryText": "ulation and consideration of the storage vessel configuration at the facility.  For worst-case release scenario, the regulation is clear.  The assumption is that the single largest container of a regulated substance (one of the 45,000 gallon LPG product storage gas tank or 247,000 pounds of LPG) is released over a ten-minute period.  No active mitigation may be considered.  Worst-case meteorological conditions are also assumed to be present.  The EPA RMP*Comp model was used to determine the distance to overpressure of 1.0 psi for a vapor cloud explosion of hydrocarbon product.  A distance of 0.5 miles to the flammable endpoint was determined for a release of 247,000 pounds in ten minutes. \n\nThe alternative release scenario was developed based on discussions at the process hazard analysis and consists of a release of 50,000 pounds of NGL from the 45,000 gallon storage tank over a one-hour period due to overpressuring of the NGL bullet tank with continued release (and potential failure open) from a three 3-inch relief valves on the tank.  No active mitigation devices were considered to influence the release scenario.  The RMP*Comp model was used to calculate the distance to overpressure of 1.0 psi.  A distance of 0.3 miles to the flammable endpoint was determined. \n\n\nPrevention Steps for NGL Releases\nThe prevention program and chemical-specific prevention steps are described in detail in the Parachute Creek PSM/RMP manual.  The prevention program includes the Program 3 elements:\n? Employee participation, which includes provisions for active participation by plant employees in the development and implementation of the facility PSM/RMP program, as well as ready access to program information\n? Process safety information, which has been collected in the facility office and is summarized in the PSM/RMP manual\n? Process hazard analyses (PHAs) - The initial PHA for the LPG, drip gas, and propane system was conducted in July 2002.  All recommendations from the PHA have been, "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 27637,
      "SummaryText": "or are being, addressed.\n? Operating procedures for the facility operations, which are included in the Operations Manual in the control room located at the Parachute Creek Gas Plant\n? Training for all plant personnel involved in the operation and maintenance of the plant operations\n? Contractor management policy, which is to not allow contractors to operate or maintain the PSM/RMP-regulated processes\n? Pre-startup safety review procedure for implementation for significant system changes to ensure that the construction and equipment installation is according to design specifications, appropriate procedures are in place and accurate, a PHA has been done and the recommendations resolved, and employees are trained prior to startup of the modified system\n? Mechanical integrity program through the operator computer system to ensure that the system equipment is maintained in good and safe working condition.  Facility personnel conduct daily visual inspections of the system.  The date and equipment included in 7.7 b and c address the last major PM activity.\n? Hot work procedures to require controls as specified in the operations manual before hot work is performed on the regulated processes\n? Management of change program to ensure that proposed system changes are comprehensively evaluated before implementing the change\n? Incident investigation procedures for the investigation of any catastrophic (or potentially catastrophic) incident associated with the regulated processes\n? Compliance audits to be conducted at least once every three years to ensure the continued compliance of the Parachute Creek PSM/RMP program. \n\nAccident History\nWithin the five-year period prior to the submittal of this RMP, there were no accidental releases of regulated flammable materials meeting the requirements of 40 CFR 68.42.\n\nEmergency Response Program\nThis facility has established and maintains an emergency response program that is coordinated with local response agencies.  The program is describ"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 27637,
      "SummaryText": "ed in detail in the Emergency Planning and Response section of the PSM/RMP compliance manual and meets the requirement of 40 CFR 68.95.  The goals of the program are to protect onsite employees from the hazardous effects of chemical releases and to minimize the effects of releases on the general public.  The program is routinely reviewed and updated to reflect personnel and regulatory changes.\n\nPlanned Changes for Improved Safety\nIdeas for changes to improve safety are actively sought from employees.  Employee safety meetings that focus on chemical safety issues are held regularly at this facility.  Employees are encouraged and trained to recognize hazards and present ideas to eliminate them or to minimize the potential consequences of those hazards.\n\nDuring the development of the Parachute Creek PSM/RMP program, process hazard analyses were conducted with key employees to meet the prevention program requirements.  During these sessions, recommendations were made for the purpose of improving safety and preventing accidental chemical releases.  Each recommendation has been or will be considered for implementation.  Though not all recommendations may be implemented, all will be considered.  The exercise has provided all affected employees with a heightened awareness of safety issues related to the covered processes."
    }
  ]
}