{
  "FacilityID": 27790,
  "FacilityName": "Lake Mary Water Treatment Plant",
  "FacilityStr1": "4500 S. Lake Mary Road",
  "FacilityStr2": null,
  "FacilityCity": "Flagstaff",
  "FacilityState": "AZ",
  "FacilityZipCode": "86001",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04005",
  "LEPC": "Coconino County LEPC",
  "FacilityLatDecDegs": "35.149861",
  "FacilityLongDecDegs": "-111.652194",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "C1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.flagstaff.az.gov",
  "FacilityEmailAddress": "jdavison@ci.flagstaff.az.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Flagstaff",
  "Company2Name": null,
  "CompanyDUNS": 88302625,
  "Company2DUNS": 0,
  "OperatorName": "City of Flagstaff",
  "OperatorStr1": "211 W. Aspen Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Flagstaff",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "86001",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jack Rathjen",
  "RMPTitle": "Water Production Plant Manager",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000036276",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-03-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-03-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-03-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-03-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 35.14891,
  "FRS_Long": -111.65315,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 40001,
      "AltID": "Chlorination System",
      "FacilityID": 27790,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 40918,
          "ProcessID": 40001,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 52578,
          "ProcessID": 40001,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 552578,
          "ProcessID": 40001,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 27790,
      "SummaryText": "Executive Summary\n     The Lake Mary Water Treatment Plant (WTP) is one of the facilities owned and operated by the City of Flagstaff.  Lake Mary WTP has prepared a Risk Management Plan (RMP) in accordance with the EPA and OSHA regulatory requirements.  A brief overview of the RMP and the associated policies at this facility is described below.\n\nPrevention and Response Policies\n     The City takes an active role in preventing accidental releases by ensuring that its employees are properly trained in the safe operation of covered processes and the safe handling of treatment chemicals. The City has also established and maintains procedures for emergency notification and response.  These are reviewed with employees on a periodic basis and revised to accommodate changes in staffing when they occur.  To increase employee safety and awareness, the City:\n? Maintains up-to-date safety information and operating procedures,\n? Performs regular preventative maintenance,\n? Provides periodic refresher training on safe handling of chemicals, and\n? Conducts periodic drills.\n\nFacility Description and Regulated Substances\n     Lake Mary WTP utilizes surface water supplies to produce potable water through a series of physical and chemical treatment operations.\n     The regulated substance handled at Lake Mary WTP is chlorine.  The chlorine is stored in 1-ton containers, with a maximum of 7 containers (14,000 lbs) on site. \n\n\nRelease Scenarios\n     Worst-case and alternative release scenarios have been determined after careful review of the regulation and consideration of the storage vessel configuration at the facility.  The EPA?s software program RMP*Comp was used to model both release scenarios and determine the radius of the impact.\n\n     In the worst-case release scenario, the regulation clearly states the release quantity shall be the contents of the single largest vessel of the covered process chemical, at ground level and under very stable atmospheric conditions. These conditio"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 27790,
      "SummaryText": "ns are most likely to result in a cloud of the released chemical remaining intact as it slowly moves along the ground.  As required by regulation, the worst-case scenario for chlorine assumed the complete release of chlorine from a single container (2,000 lbs), with no release mitigation measures taken.  Planning for an accidental release under these unlikely conditions provides the City with additional safety margin in protecting the public.  \n\n     For the alternative release scenario, the assumptions were that (a) a failure occurred in the ton container safety device (fusible plug), and (b) 600 lbs of chlorine were released over a 60-minute period before the leak could be repaired.  No mitigation effects were considered, to provide the City with additional safety margin in protecting the public.\n\nPrevention Steps for Chlorine\n     The prevention program fulfills the requirements of the OSHA Process Safety Management (PSM) rule and the EPA RMP rule, and includes:\n? formal and on-the-job training,\n? written operating procedures, and\n? a process equipment preventive maintenance program.\n\nAccident History\n     There has been no release of the covered chemical in the past five years.\n\nEmergency Response Program\n     Lake Mary WTP has established and maintains an emergency response program that is coordinated with local response agencies.  The goals of the program are to protect on-site employees from the hazardous effects of a release and to minimize the effects of releases on the general public.  The program is routinely reviewed and updated to reflect personnel and regulatory changes.\n\nPlanned Changes for Improved Safety\n     Ideas for changes to improve safety are actively sought from employees.  Employee meetings that focus on safety issues are held regularly at the facility.  Employees are encouraged and trained to recognize hazards and present ideas to eliminate them or to minimize the potential consequences of those hazards.\n\nDuring the development of this RMP "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 27790,
      "SummaryText": "document, a process hazard analysis of the chlorine system was conducted with key employees to fulfill the prevention program requirements. During these sessions, recommendations were make for the purpose of improving safety and preventing accidental chemical releases.  Each recommendation will be or has been considered for implementation. In addition, the exercise provided all affected employees with a heightened awareness of safety issues related to the covered processes.  Prior to the initial start up of the new process, initial training was conducted to familiarize employees with the process systems, safety, and the operation & maintenance program."
    }
  ]
}