{
  "FacilityID": 2780,
  "FacilityName": "SOUTHWEST FOODS ICE CREAM PLANT",
  "FacilityStr1": "13157 N. HWY 271",
  "FacilityStr2": null,
  "FacilityCity": "TYLER",
  "FacilityState": "TX",
  "FacilityZipCode": "75708",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48423",
  "LEPC": "Smith County LEPC",
  "FacilityLatDecDegs": "32.434167",
  "FacilityLongDecDegs": "95.185278",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "BROOKSHIRE GROCERY COMPANY",
  "Company2Name": "N/A",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "BROOKSHIRE GROCERY COMPANY",
  "OperatorStr1": "13157 N. HWY 271",
  "OperatorStr2": null,
  "OperatorCity": "TYLER",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75708",
  "OperatorZipCodeExt": null,
  "FTE": 35,
  "OtherEPAFacilityID": "N/A",
  "EPAFacilityID": "100000033803",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-20 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 32.434653,
  "FRS_Long": -95.183658,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3108,
      "AltID": null,
      "FacilityID": 2780,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 3317,
          "ProcessID": 3108,
          "ChemicalID": 56,
          "Quantity": 19500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 3173,
          "ProcessID": 3108,
          "NAICSCode": "31152",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 978,
              "Process_NAICS_ID": 3173,
              "SafetyReviewDate": "1999-04-06 00:00:00",
              "PHA_Date": "1997-07-10 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-04-06 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-06 00:00:00",
              "TrainingReviewDate": "1999-04-06 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-06 00:00:00",
              "EquipmentInspectionDate": "1999-04-06 00:00:00",
              "EquipmentTested": "04/06/1999",
              "ChangeMgmtDate": "1997-07-10 00:00:00",
              "ChangeMgmtReviewDate": "1999-04-06 00:00:00",
              "PreStartupReviewDate": "1999-04-06 00:00:00",
              "ComplianceAuditDate": "1999-04-06 00:00:00",
              "AuditCompletionDate": "1999-04-06 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-02-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-04-06 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-06 00:00:00",
              "ContractorSafetyEvalDate": "1999-04-06 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1108,
                  "PreventionProgram3ID": 978,
                  "ProcessChemicalID": 3317
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 2780,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-02-01 00:00:00",
    "ERTrainingDate": "1999-03-29 00:00:00",
    "CoordinatingAgencyName": "Tyler Hazmat Team",
    "CoordinatingAgencyPhone": "9035311319",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2780,
      "SummaryText": "SouthWest Foods Ice Cream plant is owned and operated by Brookshire Grocery Company in Tyler, Texas. SouthWest Foods Ice Cream plant produces forty-one different flavors of ice cream under the Brookshire Grocery Company private label GoldenBrook Farms. SouthWest Foods Ice Cream plant produces eleven different flavors under the Brookshire Grocery Company label Super 1 Foods. SouthWest Foods Ice Cream plant produces seven different flavors under the Brookshire Grocery Company private label Brass Dipper, as well as nine more flavors under the Hytop label. SouthWest Foods Ice Cream uses anhydrous ammonia to keep products under federally mandated temperature levels. There is approximately 19,500lbs. of anhydrous ammonia on site.\nSouthWest Foods Ice Cream has used anhydrous ammonia at this site since its inception in 1997. There has never been an accidental release that required any type of reporting.\nThe main hazards associated with anhydrous ammonia at this site would include a release of the entire system to the atmosphere. Because of the safeties that are in place at this facility, this would be very unlikely to occur, unless there was an event of major catastrophic relevance, such as a tornado. \nRelevant offsite receptors include residential homes as well as industrial businesses. Off site consequence analysis for a worst case scenario would be approximately 0.7 of a mile. This event could possibly occur in the event of an anhydrous ammonia release from the receiver, which holds approximately 6,300lbs. of ammonia at 75% capacity. This release would be liquid which would then gas off. The alternative scenario would be the one to more likely occur than the worst case scenario. It would involve the release of ammonia from 1/4 hole in an ammonia pipe. This scenario would release ammonia at a rate of approximately 100lbs per minute at 155psi until valves upstream and downstream are valved out.\nThe Southwest Foods Ice Cream maintenance department has over 100 years of com"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2780,
      "SummaryText": "bined experience with anhydrous ammonia. Each maintenance employee is trained every six months in donning SCBA, ammonia respirators, and Level A suits. Also, each maintenance employee is trained in confined space rescue. SouthWest Foods Ice Cream, the Tyler Fire Department, Tyler Hazmat Team, and Winona Fire Department have a very close relationship. All groups are invited to visit our facility on an annual basis to ensure that they will be familiar with the facility if there is an ammonia release. The Tyler Fire Department, Tyler Hazmat Team, and Winona Fire Department have recognized the experience that SouthWest Foods Ice Cream Maintenance personnel possess with respect to anhydrous ammonia, and have asked that all parties back-up SouthWest Foods Maintenance personnel in the event of an ammonia release. This confidence in our maintenance personnel is particularly important to top management. Any and all risks associated with the release of anhydrous ammonia are taken very seriously by Brookshire Grocery Company and SouthWest Foods Ice Cream, and are thus held responsible for the safe operation of the anhydrous ammonia system. If the ice cream plant was to experience a large release of ammonia, the Tyler Police Department, Tyler Fire Department, and Winona Fire Department would coordinate any evacuation of persons at homes or businesses. \nAll other SouthWest Foods Ice Cream plant employees, other than maintenance personnel, are annually trained in the emergency evacuation if there is an ammonia release. Furthermore, any new hires of SouthWest Foods Ice Cream are trained, before they begin work, to evacuate the premises in the event of a release. Windsocks have strategically been placed outside the facility, so that employees can determine the travel of release, and go upwind of the release.\nAll of the SouthWest Foods Ice Cream plant ammonia equipment is in an enclosed room that is vented to the atmosphere. All piping is routed to the roof, so that if there were a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2780,
      "SummaryText": "release, it would be released outdoors. SouthWest Foods Ice Cream plant also has an Emergency Anhydrous Ammonia Control Box outside the facility that would allow the entire system to be shut down manually from a safe distance of a large release.\nSouthWest Foods Ice Cream was required to comply with the Occupational Safety and Health Standard for Process Safety Management. An OSHA Compliance Officer viewed this plan in 1998 during a surprise inspection of SouthWest Dairy that concentrated on anhydrous ammonia and the safety systems that are in place to ensure the safety of all employees. All recommendations made by the compliance officer were quickly carried out and recognized by the agency as going above and beyond the requirements of the PSM Standard. Furthermore, SouthWest Foods Ice Cream implemented and continues to conduct a preventative maintenance program to ensure that any and all hazards are addressed to reduce the risks of an anhydrous ammonia release. \nIf there were a release of anhydrous ammonia, SouthWest Foods Ice Cream has a Pollution Crisis Management and Emergency Response Contingency Plan in place. This plan is updated at least annually or whenever deemed necessary by management and the safety and environmental coordinator. This plan was created to enhance the safety of our employees and the local community. SouthWest Foods Ice Cream Management, Supervision, Security, Winona Fire Department, the Tyler Fire department and the Tyler Hazmat Team all have copies of this document. Furthermore, it is always available to employees in different areas of the plant for reference or a refresher on what to do in the event of an ammonia release. This plan consists of an emergency notification sheet that has important pager and home telephone numbers listed so that personnel may respond to the situation as it dictates. This is coordinated with police and fire departments that respond to the situation as necessary regarding any type of evacuation plan. \nThe plan"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2780,
      "SummaryText": "also consists of qualifications and duties for ammonia specialists. Ammonia Specialists are members of the maintenance group. Each specialist is assigned responsibilities to carry out in the event of a release. These employees have demonstrated the ability to react and follow through with these responsibilities.\nThis plan also consists of numbers for the LEPC (Local Emergency Planning Commission), the SERC (State Emergency Response Commission), the NRC (National Response Commisision), and the TNRCC (Texas Naturasl Resource Conservation Commission). There is also an MSDS for anhydrous ammonia in the plan. This plan was also viewed  and approved by the OSHA Compliance Officer who visited the dairy in 1998. SouthWest Foods Ice Cream and Brookshire Grocery Company are always looking for ways to limit the possibility of a release of anhydrous ammonia. We strongly feel that our relationship with our employees, the responding emergency units, government agencies and the community has increased awareness of the hazards that exist at this facility. Working together with these different entities has made SouthWest Foods Ice Cream a safer place for our employees to work, and a safer place for those who live, work, and play in this community."
    }
  ]
}