{
  "FacilityID": 2790,
  "FacilityName": "Sandvik Special Metals Corporation",
  "FacilityStr1": "43507 S. Piert Road",
  "FacilityStr2": null,
  "FacilityCity": "Kennewick",
  "FacilityState": "WA",
  "FacilityZipCode": "99337",
  "Facility4DigitZipExt": "7745",
  "FacilityCountyFIPS": "53005",
  "LEPC": "Benton County LEPC",
  "FacilityLatDecDegs": "46.146111",
  "FacilityLongDecDegs": "-119.002222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "WR",
  "FacilityURL": null,
  "FacilityEmailAddress": "sterling.derrick@sandvik.com",
  "FacilityDUNS": 1479369,
  "ParentCompanyName": "Sandvik Incorporated",
  "Company2Name": null,
  "CompanyDUNS": 1479369,
  "Company2DUNS": 0,
  "OperatorName": "Sandvik Special Metals Corporation",
  "OperatorStr1": "P.O. Box 6027",
  "OperatorStr2": null,
  "OperatorCity": "Kennewick",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "99336",
  "OperatorZipCodeExt": null,
  "FTE": 259,
  "OtherEPAFacilityID": "99337SNDVKCHEMI",
  "EPAFacilityID": "100000034278",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1995-06-27 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2000-11-07 00:00:00",
  "DeRegistrationEffectiveDate": "2000-09-05 00:00:00",
  "AnniversaryDate": "2004-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 46.1478,
  "FRS_Long": -119.0124,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3118,
      "AltID": "Storage",
      "FacilityID": 2790,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 3327,
          "ProcessID": 3118,
          "ChemicalID": 55,
          "Quantity": 31000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 3183,
          "ProcessID": 3118,
          "NAICSCode": "49319",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 2022,
              "Process_NAICS_ID": 3183,
              "SafetyReviewDate": "1999-05-06 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 1,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-05-06 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "\"Manual Shutoff\" means an operator would attempt to stem the flow from a punctured barrel, but only if it could be safely done.",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "Release would flow, due to floor slope, or be washed to a sump  where the acid would be pumped into the wastewater treatment system for neutralization.",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "visual and odor detection by operators",
              "CH_ChemicalReduction": 1,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-06 00:00:00",
              "TrainingReviewDate": "1999-05-06 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Written storage procedures at the storage location.",
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-06 00:00:00",
              "EquipmentInspectionDate": "1999-02-17 00:00:00",
              "EquipmentTested": "Forklift",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "All elements of the Prevention Program apply to all the units (55-gallon barrels) in the process (storage).",
              "_chemicals": [
                {
                  "PrimaryKey": 2047,
                  "PreventionProgram2ID": 2022,
                  "ProcessChemicalID": 3327
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 2790,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Benton County Emergency Services",
    "CoordinatingAgencyPhone": "5096282600",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": "Written \"Contingency Plans and Emergency Procedures\" required by 40 CFR 264.50. \"Spill Control Plan\" required by NPDES discharge permit."
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2790,
      "SummaryText": "RISK MANAGEMENT PLAN EXECUTIVE SUMMARY\nFOR\nSANDVIK SPECIAL METALS CORPORATION\nKENNEWICK, WASHINGTON\n\nJune 15, 1999\n\n\n\nFACILITY DESCRIPTION\n\nSandvik Special Metals (Sandvik) operates a tubing manufacturing facility near Finley, Washington. The facility is located on Piert Road, approximately one-fourth of a mile south of the intersection of Highway 397 (Chemical Drive) and Piert Road. It is surrounded by farmland, with the general area being sparsely populated. The Unocal fertilizer plant is located approximately one-half mile to the north, Kerley Inc., one-half mile to the south, and the Columbia River one-half mile to the east. The facility consists of a main manufacturing building, a wastewater treatment building, a well house containing a well and a diesel fire pump, a product storage building, and an administration building. Sandvik manufactures tubing made from titanium or zirconium alloy that is used by the nuclear and aerospace industries. The tubing is also used to manufacture light weight sporting goods such as golf clubs, bicycles, and wheel chairs. Approximately 250 people are employed in a twenty-four hours per day, seven days a week operation.\n\nREGULATED SUBSTANCES AND PROCESSES\n\nAs part of the manufacturing process, Sandvik uses a substance regulated under Section 112(r) of the Clean Air Act. This regulation requires facilities using listed substances, in a process, and above threshold amounts, to prepare a Risk Management Plan. The purpose of the plan is to provide to the public, the consequences of a release of the substance, and what steps the facility is taking to prevent such a release. The only substance used at Sandvik in a process, above the threshold amount, is hydrofluoric acid and the only process affected is storage of that acid in fifty-five gallon drums.\n\nWhen delivered to the facility, no more than two barrels, containing less than a regulated amount, are removed from the delivery vehicle and moved to the storage area at any one time. Wh"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2790,
      "SummaryText": "en moved from the storage area to the manufacturing area where the acid is used, no more than two barrels are transported or used at any one time. Therefore, transportation of the substance around the plant is not affected by the regulation. When used in the manufacturing process, the acid is diluted with water and is below the regulated concentration. That is why storage is the only  process considered in this Risk Management Plan.\n\n\nACCIDENTAL RELEASE PREVENTION AND FACILITY EMERGENCY RESPONSE POLICY\n\nThe following Environmental Policy Statement was reviewed and signed by the President and Chief Executive Officer of Sandvik Special Metals Corporation on March 22, 1996:\n\n\"It is the policy of Sandvik Special Metals to maintain a workplace free of environmental hazards for all of its employees. It is our policy to be a good environmental neighbor to the surrounding community and ecosystems. We will maintain compliance with all state and federal environmental regulations, both present and future. We will foster an awareness, by example, and through training, of our corporate and individual responsibilities.\"\n\nThis policy means that Sandvik recognizes its responsibility to the surrounding community to operate its processes in a safe manner. \n\nWORST-CASE RELEASE SCENARIO\n\nThe worst-case release scenario involves the release of five hundred pounds of seventy percent hydrofluoric acid onto the floor of the storage area. This is the amount contained in the largest vessel (a 55-gallon drum) in the storage process. The scenario considers the passive mitigation effects of the release occurring inside a building but no other mitigation measures are considered. The spill is assumed to instantaneously form a pool on the floor of the storage building with the entire amount slowly evaporating and being released from the building.\n\nOff-site consequences were determined using the EPA approved \"RMP*Comp\" air dispersion modeling program, using the default meteorological conditions for"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2790,
      "SummaryText": " worst-case releases in a rural area. The distance to the toxic end-point for the release is 0.2 miles. A circle with a radius of 0.2 miles from the process point contains only one public receptor, a residence at the corner of highway 397 and Piert road, and no environmental receptors. The residence is located right at the toxic endpoint so it is highly unlikely that a release from the storage area would produce any off-site consequences. \n\nALTERNATE RELEASE SCENARIO\n\nThe alternate release scenario involves the release of one thousand pounds of seventy percent hydrofluoric acid onto the floor of the storage area from two 55-gallon drums. The release is assumed to occur when the forks of a forklift puncture two barrels of acid and all of the contents of both barrels are released. This scenario is considered to be the most likely to occur, because two barrels of acid are stored on a four-foot square pallet, such that the two forks of a forklift could puncture two drums at once.\n\nHowever, in this scenario certain active mitigation systems, as well as the storage building's passive mitigation, are considered. The design of the storage building provides active mitigation in that the floor slopes to several drains, which are connected to a sump containing water. Spilled acid would quickly flow to a drain and then to the sump. From the sump, it would be automatically pumped into the wastewater treatment system and treated by neutralization. Also, after the building had been evacuated, a door would be opened slightly, a water hose inserted, and a deluge of water used to quickly wash the acid to a drain. These mitigation systems would reduce the amount of hydrofluoric acid released from the building by a conservative estimate of fifty percent. \n\nAs with the worst-case release scenario, off-site consequences for this release were determined using the EPA approved \"RMP*Comp\" air dispersion modeling program, using the default meteorological conditions for alternate releases in "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2790,
      "SummaryText": "a rural area. The distance to the toxic end-point for this release is 0.1 miles. A circle with a radius of 0.1 miles from the process point contains no public or environmental receptors. Therefore, in all probability, there would be no off-site consequences from this release.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nSandvik has prepared \"Contingency Plans and Emergency Procedures\" which is a response plan to lessen the potential impact on the public health and the environment in the event of an emergency circumstance. This includes the release of hazardous substances. The plan includes a list of emergency coordinators, a list of emergency equipment available, and procedures to be followed in the event of an emergency, including public notification if necessary. Sandvik has also prepared specific \"Spill Response Procedures\" detailing procedures to be followed in the event of a hazardous substance release including hydrofluoric acid; a \"Spill Prevention, Control, and Countermeasures Plan\" dealing specifically with the release of oil or other petroleum products; a \"Solid Waste Disposal Plan\" and a \"Stormwater Pollution Prevention Plan\".\n\nSandvik has also prepared a set of internal documents called \"Environmental Compliance Guidelines\" that detail how to operate in a manner that assures compliance with environmental regulations. By complying with environmental regulations, the likelihood that a release of a hazardous substance will occur is significantly lessened.\n\nSandvik complies with the requirements of OSHA's Hazard Communication Standard. This regulation requires that new employees receive information regarding the hazards and safe handling of substances that they might come in contact with in the course of their work at Sandvik. Current employees are trained on the hazards of substances they might encounter when assigned to a new task. Employees assigned to duties involving hazardous waste receive training in the prope"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 2790,
      "SummaryText": "r handling and management of that waste. All of these plans, documents, and training make Sandvik employees better prepared to properly store and use hydrofluoric acid and make an accidental release much less likely.\n\nFIVE YEAR ACCIDENT HISTORY\n\nSandvik has had no accidents involving any hazardous substance that resulted in off-site, or on-site, consequences in the past five years.\n\nEMERGENCY RESPONSE PROGRAM\n\nSandvik does not have personnel specifically trained in emergency response, therefore an emergency response program is not required. A small release of a hazardous substance where the substance can be absorbed, neutralized, or otherwise controlled at the time of the release by employees in the immediate release area or by maintenance personnel and where there is no potential safety or health hazard, would be considered an incidental release and would be handled by Sandvik employees. However, for a release where there is a potential safety or health hazard, or where there could be off-site public or environmental consequences, outside responders would be immediately called. In this case, the response of Sandvik personnel would be to immediately evacuate the area. In the unlikely event that off-site consequences might occur, off-site notification would be handled by local law enforcement. \n\nSandvik has provided copies of its' \"Contingency Plans and Emergency Procedures\" to the following agencies:\n\nBenton County Emergency Management\nBenton County Fire District #1\nKennewick General Hospital\nBenton County Sheriff's Office\nWashington State Emergency Response Commission\n\nIn addition State and local Emergency Management organizations, as well as the local fire department are provided a yearly report on the types and amounts of hazardous substances present at Sandvik.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe inventory of hydrofluoric acid has already been reduced to about half of its previous level. Both physical and administrative controls have been instituted to preve"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 2790,
      "SummaryText": "nt the transportation of more than a regulated quantity of acid by forklift. At this time, no further changes are planned."
    }
  ]
}