{
  "FacilityID": 28033,
  "FacilityName": "BASF Corporation - Freeport Terminal",
  "FacilityStr1": "FM 1495 at Port of Freeport",
  "FacilityStr2": null,
  "FacilityCity": "Freeport",
  "FacilityState": "TX",
  "FacilityZipCode": "77541",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48039",
  "LEPC": "Brazoria County LEPC",
  "FacilityLatDecDegs": "28.935833",
  "FacilityLongDecDegs": "-95.339167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.basf.com",
  "FacilityEmailAddress": "rmpquest@notes.basf-corp.com",
  "FacilityDUNS": 8081697,
  "ParentCompanyName": "BASF Corporation",
  "Company2Name": null,
  "CompanyDUNS": 1307032,
  "Company2DUNS": 1307032,
  "OperatorName": "Arthur Colwell",
  "OperatorStr1": "602 Copper Road",
  "OperatorStr2": null,
  "OperatorCity": "Freeport",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77541",
  "OperatorZipCodeExt": null,
  "RMPContact": "Leanard Schooler",
  "RMPTitle": "EHS Hub Manager",
  "FTE": 1,
  "OtherEPAFacilityID": "TXD0000195966",
  "EPAFacilityID": "100000111577",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-01-23 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-04-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-04-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-04-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-04-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 28.93583,
  "FRS_Long": -95.33917,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 40323,
      "AltID": "Harbor Terminal",
      "FacilityID": 28033,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 41244,
          "ProcessID": 40323,
          "NAICSCode": "49311",
          "_desc": {
            "NAICS_CODE": "49311",
            "NAICS_DESCRIPTION": "General Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 52951,
          "ProcessID": 40323,
          "ChemicalID": 56,
          "Quantity": 60000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 552951,
          "ProcessID": 40323,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28033,
      "SummaryText": "\nCommitment to the Community\nBASF Corporation has a long tradition of operating its facilities in the safest possible manner.  BASF also believes in being a responsible corporate citizen and maintaining open, constructive dialogue with our neighbors.  These principles are an integral part of our corporate vision statement and values.  We believe that sharing this information with our neighbors makes good sense.  By doing so, we believe the community will better understand how safe and ecologically sound BASF operations are.\n\nPolicies\nBASF Corporation has the following Corporate Guidelines related to environmental, health and safety:\n\n? We produce products that are safe to manufacture, use and dispose of.\n? We assist our customers to use our products safely and in an environmentally sound manner.  We provide them with information on correct handling of our products.\n? We minimize the impact on mankind and the environment during production, storage, transportation, marketing and use of our products.\n? Economic considerations do not take priority over environmental protection, health and safety.\n? An important contribution to \"Sustainable Development\" is our involvement in the \"Responsible Care\" initiative worldwide.  This applies to our products and services in all our businesses and affiliates.\n? We are committed to making continuous improvements in safety, health and environmental protection.  We do this acting on our own initiative and in consultation with recognized regulatory authorities.  We take any action judged to be necessary, whether or not dictated by statutory obligation or official regulations.\n? We encourage safety, environmental and health awareness among employees.\n? We regard it as an important corporate duty to advance science and technology in order to improve safety and environmental protection.\n? We carefully weigh the potential benefits and risks of new discoveries and technologies in dialogue with scientists and society before deciding on how t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28033,
      "SummaryText": "o proceed.\n? We pursue an open dialogue with all relevant opinion leaders in society.  Our goals are to promote and strengthen mutual understanding and deepen trust in what we do.\n\nThe BASF Corporation Freeport Site implements these policies through site-specific programs and procedures.  The Freeport Harbor Terminal Risk Management Plan information was presented to the community in November, 1997.\n\nFacility Description\nThe BASF Corporation Freeport Harbor Terminal uses Anhydrous Ammonia.  Ammonia is a basic building block chemical and is used in the manufacturing of many common products. The largest users of ammonia are the agricultural fertilizer business. BASF uses ammonia as a basic raw material in the production of chemicals used to produce fertilizers and a variety of nylon plastics\n \nRelease Scenarios\n\nWorst Case\n? Liquid spill and vaporization of ammonia from the ammonia terminal with off-site impacts.  Administrative and electronic controls were considered which result in reduced vessel inventory.  \n\nAlternative\n? Pipe leak of ammonia in the harbor terminal with off-site receptors.  Deluge system and emergency shut-down systems were assumed operational.  \n\n\nAccidental Release Prevention Program\nTo prevent accidental releases, this facility is in compliance with the EPA Risk Management Program, the OSHA Process Safety Management standard, and the Chemical Manufacturer Association's Responsible Care Process Safety Code.  \n\nThe ammonia harbor terminal vessel is equipped with automatic shut-off and relief devices have been installed to handle fluctuations in temperature and pressure.  Warning alarms, leak detectors, regular equipment inspections, and pressure monitoring in pipes and vessels provide layers of protection for employees and the community.  In addition, the ammonia terminal storage vessel is a double walled \"tank within a tank\".  This greatly reduces potential for leaks.\n\nFive Year Accident History\nThis facility has had no accidental releases over t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28033,
      "SummaryText": "he past five years which meet the reporting criteria.\n\nEmergency Response Program\nEmergency response programs are in place for both internal preparation and coordination with the community.  The Freeport Harbor Terminal plan is coordinated with the Brazoria County Local Emergency Planning Committee to ensure community safety.  Annual drills are coordinated with the community and the community warning sirens are tested weekly.  In the event of an incident, information is transmitted over a local radio station.  BASF participates in the Industrial CAER program (Community Awareness and Emergency Response), which operates a hotline for communication with the community.  Incident commander training is conducted annually and two drills are staged each year.  Information on emergency health care is  incorporated into the  emergency plan.  BASF also maintains a corporate-wide Emergency Response Team that is expertly trained in emergency mitigation techniques for transportation and off-site incidents.\n\nPlanned Changes to Improve Safety\n\nFacility processes are routinely changed to improve safety as a result of employee suggestions, process hazard analyses, incident investigations, etc."
    }
  ]
}