{
  "FacilityID": 28071,
  "FacilityName": "Conrad Forest Products",
  "FacilityStr1": "7085-C Eddy Road",
  "FacilityStr2": null,
  "FacilityCity": "Arbuckle",
  "FacilityState": "CA",
  "FacilityZipCode": "95912",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06011",
  "LEPC": "Colusa Cy OES - (530) 458-0218",
  "FacilityLatDecDegs": "38.962556",
  "FacilityLongDecDegs": "-122.018139",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.conradwp.com",
  "FacilityEmailAddress": "www.conradwp.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Conrad Wood Preserving Co.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Conrad Wood Preserving Company",
  "OperatorStr1": "68765 Wildwood Drive",
  "OperatorStr2": null,
  "OperatorCity": "North Bend",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97459",
  "OperatorZipCodeExt": null,
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000182394",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-04-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-04-29 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-04-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2013-10-18 00:00:00",
  "DeRegistrationEffectiveDate": "2013-09-05 00:00:00",
  "AnniversaryDate": "2008-04-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 38.96539,
  "FRS_Long": -122.01286,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 40373,
      "AltID": "Aqua Ammonia Storage Tank",
      "FacilityID": 28071,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 53022,
          "ProcessID": 40373,
          "ChemicalID": 57,
          "Quantity": 74000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 41294,
          "ProcessID": 40373,
          "NAICSCode": "321114",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 15770,
              "Process_NAICS_ID": 41294,
              "SafetyReviewDate": "2003-04-01 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": "Determine the building specs of tanks, piping, flanges, etc.",
              "HazardReviewDate": "2002-11-15 00:00:00",
              "ChangeCompletionDate": "2003-05-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "leak detection, leak collection system under concrete",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Bulk Tanktruck unloading procedures",
              "OpProceduresReviewDate": "2002-11-15 00:00:00",
              "TrainingReviewDate": "2002-12-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Training to be provided when facility opens",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-11-15 00:00:00",
              "EquipmentInspectionDate": "2003-04-01 00:00:00",
              "EquipmentTested": "All equipment to be tested in May, 2003 when facility is 1 to 2 weeks from starting up",
              "ComplianceAuditDate": "2002-11-15 00:00:00",
              "AuditCompletionDate": "2003-05-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2002-11-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 16468,
                  "PreventionProgram2ID": 15770,
                  "ProcessChemicalID": 53022
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 28071,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2002-07-31 00:00:00",
    "ERTrainingDate": "2003-06-15 00:00:00",
    "CoordinatingAgencyName": "Arbuckle fire Department",
    "CoordinatingAgencyPhone": "5304762231",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28071,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies\nIt is our policy at Conrad Forest Products to provide a safe work place for our employees. Further, it is our intention to use guidelines established by OSHA, EPA, and other available sources, to help provide a safe work place.  The facility will comply fully with both the letter and the spirit of all applicable regulatory compliance requirements.\n\nThis adherence to safety is integrated into our philosophy and code of ethics. This philosophy is based on several ideals.  We seek to provide a safe and healthy environment for our employees, for the prevention of illness, injury, or death to anyone due to factors under our control. Protecting the environment is a high priority for our company. We are pledged to reduce and hope to eliminate our use of toxic substances whenever possible. When it is not possible to avoid the wastes produced, we are committed to minimize the quantities generated by staying within the bounds of the environmental laws that reduce undesirable effects on air, water, and land.\n\nFacility and Regulated Substances Handled\nConrad Forest Products pressure treats lumber and plywood with wood preservatives to significantly increase their useful life by protecting them against termite attack and decay caused by fungi and microorganisms-and we do this without impairing the natural characteristics of the wood.  The preservatives to be used at this plant site are Copper Boron Azole (CBA) and Disodium Octaborate Tetrahydrate (DOT). The elements in CBA and DOT are important to the overall performance of the preservatives.\n\nWhen pressure impregnated into the wood, the CBA, or DOT, and its elements become fixed to the cellulose of the wood cells and form insoluble precipitates. The preservative ingredients actually become locked in the cells of the wood. They will not vaporize or evaporate. Unlike wood that has merely been coated with paint or stain, pressure treated wood penetrates deep into the wo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28071,
      "SummaryText": "od structure offers a lifetime warranty for the product. FIFRA (i.e., EPA's pesticide regulations) classifies CBA and DOT as non-restricted use pesticides and does not require California's Prop 65 labeling.\n\nThe primary wood species is incised by passing the wood through a machine equipped with cutting teeth projecting from rollers. As the wood passes through the machine, the teeth are pressed into the wood to form a predetermined pattern of incisions that penetrate to a specified depth, usually dependent upon the pattern and density of the teeth. The incising provides a continuous envelope of treatment by allowing the preservative to penetrate the cell structures of the wood. The timber, lumber, and plywood to be treated are loaded onto small rail or tramcars. Using a vehicle, such as a forklift or winch, the trams are moved into a large horizontal treating cylinder. The cylinder door is sealed, and a vacuum is applied generally after conditioning.\n\nA vacuum is applied to remove most of the air from the cylinder and the wood cells. Preservative solution is then pumped into the cylinder and pressure raised to about 150 pounds per square inch, forcing the preservative into the wood. The total time will vary, depending on the species of wood, commodity\nbeing treated, and the amount of preservative to be impregnated but, in all instances, the treating process is a closed system.  At the end of the process, excess treating solution is pumped out of the cylinder and back to a work tank for reuse. The cylinder door is opened and the trams pulled out.\n\nThe wood is wet at that time, so it is kept on a covered pad, which meets 40 CFR 265.440 Subpart W drip pad requirements. Any drips trickle onto the pad containment area, then drain to a sump where it is pumped to a work tank where it is reused.  The process of pressure treating wood with CBA and DOT\npreservative is regulated throughout North America by the United States Environmental Protection Agency as well as state autho"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28071,
      "SummaryText": "rities, and the Code of Good Practice.\n\nThe facility stores and uses only one regulated chemical, in sufficient quantity, to be required to comply with the California Accidental Release Prevention (CalARP) program.  This material is aqua ammonia at 29% concentration.  The aqua ammonia is added to the CBA treating solution (with up to 1.3%\naqua ammonia in the solution) to enhance penetration of the wood preservative in the lumber.  The regulated system and equipment, under the CalARP, will include the storage tank for the aqua ammonia concentrate, the associated piping into and out of that tank that carry the aqua ammonia, and all tanks and piping with at least 1% concentration of aqua ammonia.  There is a water scrubber system to treat the fugitive emissions of ammonia vapor released in the process and associated tanks.\n\nWorst Case Release Scenario and Alternative release Scenario\nThe worst case and alternate release scenario dispersions were modeled by the RMP*COMP computer program.  The worst case scenario is the release of the contained aqua ammonia tank contents within ten minutes.  The distance to the endpoint for the worst case extends beyond the plant boundaries.  The\nalternate release scenario is a gasket failure on the four inch discharge line of the aqua ammonia tank.  The distance to the endpoint for the alternative release extends beyond the plant boundaries.\n\nThere are several controls that will be in place to reduce the potential distance endpoint.  The tank is located within a diked containment area which should reduce or eliminate a release to ground.  Water is readily available to use as a spray to minimize vapor release.  Our facility will have pumps available on site so that during a release we will have the capability to start pumping the liquid portion back into a tank within a short period of time.  The valving system located on our piping can be used to reduce the loss of material in our alternate release scenario.  Employee training on proced"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28071,
      "SummaryText": "ures will be key to minimizing a release.\n\nAccidental Release Prevention Program and Chemical Specific Prevention Steps\nEmployees are provided with ongoing training to make sure they understand how to work safely.  Everyone at the plant knows the spill prevention and emergency plans.  These plans, as well as the nature of the materials handled, are shared with the local fire department and emergency response personnel.  Our treating processes and our work practices ensure the health and safety of our employees and the community in a number of ways.\n\nOur wood treating process is accomplished in a closed system. When the concentrate arrives for CBA it arrives in a special tanker at our treating plant, it is unloaded directly into a concentrate receiving tank. No one comes in contact with the solution.  The DOT comes in 50 lb. bags and is stored in the treatment facility. It is poured into a elevator system which dumps the borate powder into a mix tank and water is added.  The concentrates are then diluted with water in an automated mix system to produce the work solutions we use in the wood treating process.  Wood is loaded onto small cars which are pushed into the treating cylinder. There, in a sealed and locked cylinder with vacuum and pressure developed under precisely controlled conditions, the wood is injected with the diluted solutions of CBA or DOT.\n\nWhen the wood is removed from the treating cylinder, no fumes or vapors are released to the environment except very small amounts of ammonia and some organic vapors from the conditioning process. All areas are monitored to comply with PEL monitoring requirements for the EPA.  The treated wood comes out of the cylinder with approximately 85% of the preservative locked in the cell walls when treated with CBA. DOT being a diffusion process stays in the wood after it dries; but will migrate out of the wood when saturated with moisture. While the wood cures, it remains on the drip pad, which is designed to collect exces"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28071,
      "SummaryText": "s preservative for reuse. Within a few days, all the treated wood is dry and moved to storage or loaded for delivery.\n\nThe drip pad is made of impervious material including high strength reinforced concrete, using special water tight construction joints, and is coated with a impermeable sealer per 40 CFR Part 265.440 Subpart W.  The drip pad had an external liner and detection system installed.\n\nThe operation is a zero discharge plant with regards to process water. The portion of the plant where the liquid preservative is handled is totally contained through the use of concrete diking around our tanks and treatment cylinders. The floors of these areas are also impermeable and sloped toward collection\npoints where liquids are sumped and piped to work tanks for reuse. All rainwater, cleaning water, etc. that contact the chemical processing areas are collected for reuse in the preservative treatment.\n\nPrevention of a release is, of course, top priority. Programs ensure that drivers remain at the tank truck during unloading aqua ammonia, with the proper PPE for handling a response either on or accessible; facility employees unlock and remove the valve cover on the aqua ammonia tank prior to loading from the\ndelivery vehicle.  This will ensure that the tank level has been checked and that the correct product is loaded into the aqua ammonia tank. A form will be completed and signed for documented compliance.  Daily visual and monthly documented inspections will be performed by operators and/or maintenance\npersonnel so that equipment and piping are maintained.  Facility operators will be trained concerning the hazards, handling and cleanup of aqua ammonia. Priority will be given for immediate maintenance repair on any leaks or equipment damage.  When cylinders are cleaned, loaded or unloaded, or when\nfreshly-treated wood is handled, employees wear appropriate personal protective equipment (PPE).  On going air monitoring ensures that employees breathe healthful air.  All co"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 28071,
      "SummaryText": "llected process waste is properly shipped off site.\n\nFive-Year Accident History\nThere is no accident history for this facility since this facility has not gone into operation to date.\n\nEmergency Response Program\nEmergency response during an incident will be based upon four levels of protection.\n\nThe first level of protection is to coordinate with the local fire department by providing them with our contingency plan and requesting that they visit our facility to look at the aqua ammonia storage area and discuss potential release scenarios so they can be fully prepared to respond in the event of a release.\n\nThe second level of protection is to ensure that our employees receive hazard, handling and emergency response training, per OSHA's HAZWOPER program to allow them to know the correct PPE required and to safely contain and cleanup an incident. It is of the up most importance that our employees and the\nlocal fire department have a good working relationship along with accurate communication so an incident can be minimized.\n\nThe third level of protection is the design and operation of the facility. The containment area has sufficient dike wall height, heavy mobile equipment is prevented in the chemical storage areas, gasket locations are limited since most of the piping will be welded, and chemical piping is located within the contained area.\n\nThe fourth level of protection is that employees daily perform a visual check as well as monthly inspections of all tanks and piping.  These equipment inspections, and security, will help prevent, as well as minimize, a release incident.\n\nPlanned Changes To Improve Safety\nSafety improvements will be continually looked at once the facility is in operation. The design of this facility tried to incorporate safety features such as the inaccessibility of tanks and pipes to mobile equipment, diking, a leak detection and collection system, along with security to prevent any incidents\nfrom happening. Employee training will be complete, u"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 28071,
      "SummaryText": "sing outside resources such as our aqua ammonia vendor, to ensure they have the knowledge to recognize a potential unsafe act or hazard so prevention of an incident can be assured."
    }
  ]
}