{
  "FacilityID": 28169,
  "FacilityName": "Koch Nitrogen Company - Beatrice Nitrogen Plant",
  "FacilityStr1": "4 Miles W. Hwy #4 & 2 miles North",
  "FacilityStr2": null,
  "FacilityCity": "Beatrice",
  "FacilityState": "NE",
  "FacilityZipCode": "68310",
  "Facility4DigitZipExt": "9424",
  "FacilityCountyFIPS": "31067",
  "LEPC": "Gage County LEPC",
  "FacilityLatDecDegs": "40.321944",
  "FacilityLongDecDegs": "-96.843472",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 602084618,
  "ParentCompanyName": "Koch Mineral Services",
  "Company2Name": null,
  "CompanyDUNS": 6944334,
  "Company2DUNS": 0,
  "OperatorName": "Koch Nitrogen Company",
  "OperatorStr1": "4111 E. 37th Street North",
  "OperatorStr2": null,
  "OperatorCity": "Wichita",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "67220",
  "OperatorZipCodeExt": null,
  "RMPContact": "Raymond Rohlfing",
  "RMPTitle": "Plant Manager",
  "FTE": 41,
  "OtherEPAFacilityID": "68310frmIn4miwe",
  "EPAFacilityID": "100000036999",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "310670001",
  "SafetyInspectionDate": "1992-08-06 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-05-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-05-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-05-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 40.31915,
  "FRS_Long": -96.8413,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 40479,
      "AltID": "Nitrogen Fertilizer Mfg",
      "FacilityID": 28169,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 41400,
          "ProcessID": 40479,
          "NAICSCode": "325311",
          "_desc": {
            "NAICS_CODE": "325311",
            "NAICS_DESCRIPTION": "Nitrogenous Fertilizer Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 53171,
          "ProcessID": 40479,
          "ChemicalID": 56,
          "Quantity": 132000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 53172,
          "ProcessID": 40479,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 53173,
          "ProcessID": 40479,
          "ChemicalID": 155,
          "Quantity": 16068.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 37503,
              "ProcessChemicalID": 53173,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 37504,
              "ProcessChemicalID": 53173,
              "ChemicalID": 149,
              "_chemical": {
                "ChemicalID": 149,
                "ChemicalName": "Hydrogen",
                "CASNumber": "1333-74-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 37505,
              "ProcessChemicalID": 53173,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 553171,
          "ProcessID": 40479,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 553172,
          "ProcessID": 40479,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 553173,
          "ProcessID": 40479,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28169,
      "SummaryText": "\n\nRISK MANAGEMENT PLAN\nEXECUTIVE SUMMARY\nKOCH NITROGEN COMPANY\nBEATRICE NITROGEN PLANT\n\n\n\nKoch Nitrogen Company?s (KNC), Beatrice Nitrogen Plant is located in southeastern Nebraska, about 8 miles northwest of Beatrice, Nebraska.  The plant primarily manufactures anhydrous ammonia and urea-ammonium nitrate (UAN) that provide area farmers with high-quality, cost effective nutrients for the crops they grow to feed families around the world.  As a nitrogen fertilizer manufacturing operation, this facility is subject to the U.S. Environmental Protection Agency?s (EPA) Risk Management Program (RMP) Rule under the Clean Air Act Amendments of 1990.\n\nThe RMP rule requires facilities handling threshold amounts of certain chemical substances to submit Risk Management Plans for the prevention of accidental releases of these substances.  The plan requirements include submission of the risk management plan to include hazard assessments defining possible offsite impacts of certain regulated substance release scenarios, a five-year accident history, description of the facility?s accidental release prevention program, and an emergency response program.\n\nThe following is the Executive Summary of the Risk Management Plan for KNC, Beatrice Nitrogen Plant at Beatrice, Nebraska.\n\nStationary Source and Regulated Substances\n\nThe Beatrice Nitrogen Plant is a nitrogen fertilizer manufacturing facility consisting of a large-scale natural gas feed ammonia production unit and an integrated urea-ammonium nitrate (UAN) production unit.  These products are primarily used as agricultural fertilizers.  Carbon dioxide production is also a segment of facility operations.\n\nInitial operation began in 1965.  The original small UAN unit was replaced in 1969 with a larger plant, which was revamped and upgraded in 1998.\n\nThe facility produces, handles, and stores large quantities of anhydrous ammonia in its operations.  The ammonia unit uses natural gas, air and water for the production of ammonia.  Ammonia"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28169,
      "SummaryText": " is used along with byproduct carbon dioxide to produce liquid urea in the UAN plant.  Ammonia and air in the same plant are used to produce nitric acid, which is subsequently neutralized with ammonia to produce ammonium nitrate.  The liquid urea and ammonium nitrate are mixed forming the urea-ammonium nitrate solution product.\n\nEach of these production units along with the ammonia storage and handling constitute the processes covered by the EPA RMP Rule.  Regulated substances include the primary product of the plant, anhydrous ammonia, which is also the main feedstock for urea-ammonium nitrate production.  In addition, flammable substances as a class: methane (natural gas), and hydrogen (produced as an intermediate in ammonia production), specifically are regulated under the RMP Rule.  Finally, chlorine is also present in regulated threshold quantities on the site.  It is used as a biological control agent in the cooling water systems associated with the production units.\n\nAccidental Release Prevention and Emergency Response Policy\n\nThe management and employees of this facility are committed to the prevention of any accidental releases from this facility.  It is this facility?s policy to eliminate significant accidental releases of any substance and, in particular, hazardous and regulated substances; and to minimize and eliminate to the extent possible even minor and inconsequential releases of any type.  Prevention of accidental releases is critical to the safe operation of this plant, to the safety of its employees, and to the safety of the general public.\n\nTo achieve its goals of accident and accidental release prevention, the facility is committed to the following:\n\n?    Knowledgeable and highly trained and motivated employee group\n?    A well designed facility that is maintained and operated in a superior manner\n?    Improvements that enhance safety and accident prevention where appropriate\n?    Excellence in safety programs and practices and a superior safety and acciden"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28169,
      "SummaryText": "t record\n?    Preparation and training for emergency response and mitigation\n\nThe Beatrice Nitrogen Plant has had a written Emergency Response Plan in effect for many years and is committed to respond to and mitigate any accidental release to minimize the impact to employees, the community, and environment.  The response plan is coordinated with the Local Emergency Planning Committee (LEPC) and emergency response agencies and the plant has interacted with possible responding agencies for many years regarding the plan and activities at the plant.  Employees are trained in the implementation of the plan and in possible response activities that could be required in the event of an emergency.\n\nPrevention Program\n\nThe Beatrice Nitrogen Plant is subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) rule, 29 CFR 1910.119, and is a nitrogen fertilizer manufacturing facility.  Therefore, under the EPA RMP Rule the plant is a Program 3 facility with a Program 3 Prevention Program.\n\nThe OSHA PSM/EPA Prevention Program consists of a set of facility management policies and procedures, which promote and recognize process safety and the prevention of accidents in plants that handle, use, store, and process hazardous chemical materials.  The procedures address all aspects of plant activities including training, maintenance, operating procedures, process reviews, critical information maintenance and updating, safe work practices, incident investigation, audit, and other activities in a manner to provide controls which prevent errors, failures, and inadvertent changes in a process that could result in accidents.\n\nThe Beatrice Nitrogen Plant adheres to the requirements of PSM and has written policies and procedures addressing all aspects of PSM and EPA Prevention Programs.  In all of its years of operation, the facility has addressed the elements of accident prevention included in these programs.\n\nThe Prevention Program consists of several el"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28169,
      "SummaryText": "ements and policies, which are briefly outlined below.\n\n?    Employee Participation - Employees are involved in all aspects of the program and are provided any information developed in the program.  Employees participate in process reviews, assist with development of procedures, and all other aspects of the program.\n?    Process Safety Information - All necessary process information and records are maintained including information on the hazards of the chemicals, process technology with safe operating limits, and equipment records and design requirements.\n?    Process Hazard Analysis - Process hazard analysis and review has been conducted by employee teams to identify and correct any perceived hazards.  These reviews are updated on a schedule or more often if changes indicate the necessity of additional review.\n?    Operating Procedures ? Operating procedures are in place for all aspects of operation including emergency operation and shutdown, operating limits and methods to correct or avoid deviations from limits, safety and health considerations of operations and the chemicals involved, and safety system operation and function.\n?    Operator Training ? All operators are trained initially in the process and its operating procedures and receive refresher training not less than every three years.  In reality, operator training is a continual and ongoing process.  Operator training includes on the job training with experienced operators and classroom type instruction.\n?    Contractors - Contractor selection includes review of safety performance and programs.  Contractors are oriented to known hazards in the facility, the emergency plan, and are required to adhere to facility safe work practice procedures.  Contractor performance is periodically evaluated as necessary to assure work is completed in a safe and correct, manner.\n?    Pre-startup Safety Review ? A safety review is conducted on any new facility and for any significant modification of the facility.  This assures that constructio"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28169,
      "SummaryText": "n and equipment is installed in accordance with design, all necessary procedures including safety procedures are in place, training is completed, and that hazard analysis or requirements of management of change are completed. \n?    Mechanical Integrity ? Procedures for inspection and testing and correction of equipment deficiencies are in place.  A quality assurance procedure assures equipment, parts, materials, and installations are suitable for the applications intended.  Maintenance employees are trained in the process hazards and in safety procedures applicable to their work.\n?    Safe Work Practices ? Procedures and policies for work permits and maintenance and operating actions are in place for accident prevention.\n?    Management of Change ? No changes are allowed in the process or procedures without review and authorization.  Safety impacts, technical basis, required procedure modification, and training are all considered in the review.  The procedure is to assure the safety of the change and to prevent unintended consequences as a result of change.\n?    Incident Investigation ? Any incident, which results in a significant release or could have reasonably resulted in such a release is promptly investigated by a facility team.  Findings of the investigation and recommendations for corrective action are documented as is the resolution of the recommendations and corrective actions.\n?    Emergency Planning and Response ? The Process Safety Management/Prevention Program includes the facility Emergency Response Plan. \n?    Compliance Audit ? Compliance with the program is audited at least every three years to verify compliance with these procedures.  Findings, if any, of the audit are documented and any deficiencies are corrected and documented.  The audit is conducted by persons knowledgeable of the facility processes, but not directly connected with the facility.\n\nThe facility is diligent in adhering to and maintaining its Process Safety/Prevention Program.\n\nEmergency Response Pl"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 28169,
      "SummaryText": "an\n\nThe Beatrice Nitrogen Plant has a written Emergency Response Program as required by the RMP Rule and other EPA and OSHA rules.  This Plan is coordinated with the local community response plan and is available to responding agencies.  Emergency Planning and Community Right-To-Know Information as required under Superfund Amendments and Reauthorization Act (SARA) Title III has been provided to the State Emergency Response Commission, the LEPC, and other appropriate agencies such as the local fire department.\n\nThe facility is an active participant in the LEPC and interacts with various local agencies in its emergency planning such as local fire departments; law enforcement agencies such as the police, highway patrol, and sheriff?s office; and hospitals.\n\nEmployees receive annual training in the response plan and also receive various safety training, both in general, and in the competencies relative to their required roles in the plan.  Periodically the plan is practiced in a tabletop, classroom type setting. \n\n5-Year Accident history\n\nThe RMP Rule requires inclusion of the five-year accident history of the facility for all accidental releases that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\nThe Beatrice Nitrogen Plant has had no qualifying accidents in the past five years.\n\nSynopsis of Worst-Case and Alternative Release Scenarios\n\nThe RMP Rule requires a hazard analysis for ?worst case? and alternative accidental release scenarios for regulated substances present in threshold quantities at the site.  For this facility, the regulated substances include anhydrous ammonia and chlorine as regulated toxics, and flammables as a class, which includes methane and hydrogen.  The rule requires an analysis of the ?worst-case? toxic as that scenario affecting the greatest distance and a ?worst-case? flammable accident as a vapor cloud explosi"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 28169,
      "SummaryText": "on.  Alternative release scenarios, which are more reasonably likely events, for each regulated toxic and flammables in general must also be presented.\n\nWorst-Case Toxic Release ? Anhydrous Ammonia\n\nConsidering the seasonal nature of fertilizer use and application in agriculture, large quantities of the ammonia produced at this facility must be stored until needed by the ultimate consumer.  The RMP rule requires that the largest amount in a single vessel be considered the release quantity for the ?worst case? event unless smaller quantities handled at different conditions result in a greater distance to the regulated endpoint of consideration.  This is a requirement of the rule regardless of whether the event is likely or could even reasonably occur.\n\nFor this facility, the largest single quantity of anhydrous ammonia is held in an atmospheric storage tank, each of which contains 33,000- tons.  However, the worst-case scenario pertains to the 200-ton anhydrous ammonia high- pressure non-diked bullet tank.  The ?worst-case? release assumes, as required by the rule, that this entire amount is released as a result of a catastrophic failure of a tank.  This unlikely event was modeled by a publicly available model (DEGADIS), which is known to provide reasonable estimates of concentrations and distances associated with release events.  Details of the results of this modeling are provided elsewhere in the Risk Management Plan submittal.\n\nTo assure that the event indicated above was, in fact, the ?worst case? as the rule defines it; failure of the other on-site ammonia storage tanks were also modeled.  In addition, a ?worst-case? failure of chlorine containers was similarly modeled.   Neither of these resulted in a distance greater than the circumstance noted above.\n\nIt should be emphasized that the possibility of such an event as described by the ?worst case? is very unlikely.  Analysis of this unlikely scenario was completed as required by the rule.  Facility maintenance "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 28169,
      "SummaryText": "and inspection programs address the integrity of process and storage vessels, and largely preclude such massive and improbable failures.\n\nWorst-Case Flammable Release\nAs the rule requires, the largest quantity flammable release and a subsequent vapor cloud explosion must be analyzed as the ?worst case? for these substances.  In this facility, a failure releasing the entire contents of the ammonia synthesis loop constitutes the largest flammable release.  This quantity is assumed to result in a vapor cloud explosion with impact distance determined by the EPA Offsite Consequence Analysis Look Up Tables.  Although large volumes of flammable gases are handled daily by the plant, actual in-process inventory is relatively small, especially considering the quantity of inert gases and steam mixed with the flammable gases.  Consequently, impact distance is relatively limited.\n\nAlternative Release Scenarios - Toxics\n\nAmmonia\nMore reasonably likely release events tend to concentrate in areas where the ammonia product is handled such as loading and other transport activities.  Significantly lower quantities are involved, various shutdown safeguards are present as they are throughout the plant, and operator intervention all tend to mitigate and limit the consequences of failures.  Such events can include failure of smaller valves, lines, and hoses.\n\nThe alternative release scenario, modeled with the DEGADIS model for this facility is the overpressure of the loading surge tank with a 10-minute release.  Modeled impact distance is substantially lower for more reasonable, but not necessarily likely, release events.\n\nChlorine\nChlorine is used at several locations in this plant as a biocidal agent for cooling water systems, much as it is also used in swimming pools.  It is used as a gas from one-ton chlorine cylinders through an injection system to the circulating cooling water.\n\nThe alternative release scenario assumed is failure of the connecting tubing from the cylinder and releas"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 28169,
      "SummaryText": "e of gaseous chlorine.  This release was modeled using the DEGADIS dispersion program.\n\nFlammables\nLarge volumes of flammable gases are handled throughout the plant, even though actual physical inventory is relatively low.  More likely flammable release events include failures of smaller pipes and lines in comparison to the large release contemplated in the worst-case analysis.\n\nMore reasonable and likely events result in minimal impact distances.  The alternative release scenario assumed a vapor cloud explosion as a result of a pressure relief valve in the ammonia synthesis loop lifting for 4 minutes.  The impact distance of this event utilized the EPA Offsite Consequence Analysis Look Up Tables.\n\nPlanned Changes for Safety Improvements\n\nSafety improvements are a continual and ongoing process at the facility, which is facilitated by the Prevention Program/PSM Program.  Formal process hazard analysis is conducted at least every five years, but review is constant through management of change procedures, operator training, incident investigation, and mechanical integrity programs.  As a result, changes relevant to safety occur continuously as needs are identified through these procedures and policies."
    }
  ]
}