{
  "FacilityID": 28191,
  "FacilityName": "Moses Lake Generating",
  "FacilityStr1": "3338 Road M.2 NE, Building 10B",
  "FacilityStr2": null,
  "FacilityCity": "Moses Lake",
  "FacilityState": "WA",
  "FacilityZipCode": "98837",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53025",
  "LEPC": "Grant County LEPC",
  "FacilityLatDecDegs": "47.137417",
  "FacilityLongDecDegs": "-119.211278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Sempra Energy Trading Co.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Moses Lake Generating, LLC",
  "OperatorStr1": "58 Commerce Road",
  "OperatorStr2": null,
  "OperatorCity": "Stamford",
  "OperatorStateFIPS": "CT",
  "OperatorZipCode": "06902",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000182526",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-05-14 00:00:00",
  "ErrorReportDate": "2003-05-14 00:00:00",
  "ReceiptDate": "2003-05-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-05-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-04-29 00:00:00",
  "DeRegistrationEffectiveDate": "2007-08-08 00:00:00",
  "AnniversaryDate": "2008-05-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 47.13742,
  "FRS_Long": -119.21128,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Generating facility dismantled,all equipment either sold or moved to storage",
  "_processes": [
    {
      "ProcessID": 40521,
      "AltID": "Aqeous Ammonia Storage",
      "FacilityID": 28191,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 53233,
          "ProcessID": 40521,
          "ChemicalID": 57,
          "Quantity": 160000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 41442,
          "ProcessID": 40521,
          "NAICSCode": "22111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 28191,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2003-02-28 00:00:00",
    "ERTrainingDate": "2003-02-19 00:00:00",
    "CoordinatingAgencyName": "Grant County Emergency Services",
    "CoordinatingAgencyPhone": "5097621462",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28191,
      "SummaryText": "1.  Accidental Release Prevention and Emergency Response Policies\n\nThe Moses Lake Generating Facility stores and uses aqueous ammonia (29 percent solution) with the selective catalytic reduction (SCR) systems as part of the nitrogen oxides (NOx) emissions controls for the engine-generators at the facility.  Aqueous ammonia is the only substance at the facility used in amounts equal to or greater than the ?threshold quantity? defined in 40 CFR Part 68.  Moses Lake Generating, LLC has developed and is implementing a Risk Management Plan (RMP) to ensure appropriate site management of the aqueous ammonia.  The RMP is designed to ensure the safety of its employees and the public and to protect the environment.\n\nIt is the company?s policy to adhere to all applicable federal and state rules and regulations.  Moses Lake Generating, LLC manages the safety of the regulated processes by means of operating procedures, equipment testing and inspections, and safety devices (e.g., instrumentation, relief devices) inherent in the design of this facility.  Safe work practices and training of our personnel supplement the inherent safe design of the plant.\n\nThis document has been prepared in accordance with the EPA?s Risk Management Plan regulation.  The substances and processes considered during the preparation of this RMP and the scenarios described were selected based on criteria established in the regulation.\n\n2.  Facility Description and Regulated Substances \n\nThe Moses Lake Facility consists of 29 engine-generator sets capable of producing up to 50.3 megawatts of electricity.  The compression ignition engines use dual fuels for combustion, with a fuel mixture of at least 5 percent No. 2 diesel fuel oil and the rest being natural gas.  Each engine is equipped with a SCR system to limit NOx emissions.  In order for the SCR systems to remove NOx from the engine exhaust ammonia, in the form of aqueous ammonia, is injected into the exhaust stream entering the SCR catalyst beds.  The "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28191,
      "SummaryText": "aqueous ammonia used for this purpose is a 29 percent, by weight, solution of ammonia and water.\n\nThe aqueous ammonia is stored in two (2) 10,500 gallon fixed roof storage tanks.  The tanks are contained within a diked area capable of containing the full contents of both tanks as well as incidental rainwater.  The surface area of the diked area is 870 square feet.  Aqueous ammonia is periodically received at the facility via tanker trucks and transferred to the storage tanks.  The maximum amount of aqueous ammonia (29 percent solution) stored and used at the facility is 160,000 pounds. \n\n3.  Worst Case Release Scenario(s) and Alternative Scenario(s)\n\nThe potential consequences of a ?worst-case release scenario? ammonia storage tank failure were evaluated based on the EPA?s Offsite Consequence Analysis (OCA) guidance.  The EPA defines the worst-case release scenario for liquids in storage vessels as a catastrophic failure and release of the entire contents of the storage tank with the greatest amount held in a single tank, taking into account administrative controls.\n\nFor the facility the worst-case release scenario is the release of the entire contents of a full storage tank (78,840 lbs) into the diked in containment area.   The dikes in area around the tanks limits the exposed surface area of a pool formed by the spill and thus reduces the release rate to 54.4 lb/min.\n\nUsing EPA OCA guidance, the maximum distance to the EPA-defined toxic endpoint for ammonia of 200 ppm is 400 meters (0.25 mile) from the storage tanks.  There are no public receptors with the distance (0.25 mile) to the toxic endpoint.\n\n4.  The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe facility developed prevention program elements based on the federal EPA?s Accidental Release Prevention Provisions (40 CFR Part 68) regulation.  The facility was designed and constructed to comply with applicable state and industry codes.\n\n5.   Five-Year Accident History\n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28191,
      "SummaryText": "\nThere have been no accidents involving or accidental releases of aqueous ammonia at the facility in the past five years.\n\n6.  The Emergency Response Program\n\nThe facility maintains a Contingency Plan and Emergency Procedures manual that contains specific procedures for employees to take in the event of an emergency or accidental release.  This information also contains the names and numbers of responding outside agencies, notification procedures, and spill control procedures.\n\n7.  Planned Changes to Improve Safety\n\nThere are no planned changes.  The facility conducts safety inspections and periodically reviews the emergency procedures.  If there are changes that will improve safety that are identified during these inspections"
    }
  ]
}