{
  "FacilityID": 28262,
  "FacilityName": "Indian Trails",
  "FacilityStr1": "7250 E SR 47",
  "FacilityStr2": null,
  "FacilityCity": "Lebanon",
  "FacilityState": "IN",
  "FacilityZipCode": "46052",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18011",
  "LEPC": "Boone County LEPC",
  "FacilityLatDecDegs": "40.128028",
  "FacilityLongDecDegs": "-86.333278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Frontier LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Frontier Co-op, Inc.",
  "OperatorStr1": "815 West Pearl St.",
  "OperatorStr2": null,
  "OperatorCity": "Lebanon",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46052",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Stebbins",
  "RMPTitle": "Manager",
  "FTE": 7,
  "OtherEPAFacilityID": "ind980820898",
  "EPAFacilityID": "100000106565",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-02-19 00:00:00",
  "SafetyInspectionBy": "Indiana State Chemist",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-05-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-05-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-05-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 40.0395,
  "FRS_Long": -86.3766,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 40622,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 28262,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 41548,
          "ProcessID": 40622,
          "NAICSCode": "42291",
          "_desc": {
            "NAICS_CODE": "42291",
            "NAICS_DESCRIPTION": "Farm Supplies Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 53339,
          "ProcessID": 40622,
          "ChemicalID": 56,
          "Quantity": 330000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 553339,
          "ProcessID": 40622,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28262,
      "SummaryText": "EXECUTIVE SUMMARY\n\nIndian Trails\n\n1. Accidental release prevention and emergency response policies:\n\nIn this distribution facility, we handle anhydrous ammonia  which is considered hazardous by EPA. We are committed to the prevention of accidental releases of these products at our facilities.  It is necessary to observe certain safety precautions in handling anhydrous ammonia to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as our co-workers, and to reduce the threat to nearby members of the community. It is our policy to adhere to all applicable Federal and state rules and regulations. Safety depends upon the manner in which we handle anhydrous ammonia, combined with the safety devices inherent in the design of this facility combined with the safe handling procedures that we use and the training of our personnel.\n\nOur emergency response program for anhydrous ammonia is based on the ANSI K-61.1 standard, \"Safety Requirements for the Storage and Handling of Anhydrous Ammonia\", and the OSHA standard 29 CFR 1910.111, \"Storage and Handling of Anhydrous Ammonia\". The facility has a written emergency action plan, in accordance with OSHA Standard 29 CFR 1910.38; has provided state and local authorities the emergency planning and right-to-know information as required under SARA Title III (EPCRA); has coordinated response actions with the Sheridan Fire Department, including pre-emergency planning and emergency training, and has verified that the County Emergency Plan includes the facility in the event of a release of regulated substances; and,  has  instructed employees on  procedures for notification of the local fire authority (Sheridan Fire Department) and notification of any potentially affected neighbors. \n\n2. The stationary source and regulated substances handled.\n    \n The anhydrous ammonia storage was constructed in 1977 and updated to meet new Indiana State Chemist rules in February of 2003. Ammonia is received by truck tra"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28262,
      "SummaryText": "nsports and stored in 3  tanks.  This   facility has equipment for unloading truck transports and equipment to load nurse tanks and transports . Access to the site is restricted to authorized facility employees, authorized management personnel, customers, and authorized contractors. \n\n     The regulated substance handled at this distribution facility is  anhydrous ammonia. \n\n       The maximum amount of anhydrous ammonia that can be stored at this plant is 330,000 pounds. The maximum quantity handled would be 330,000 pounds.\n\n3. The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and\nmitigation measures to limit the distances for each reported scenario.\n\n        Product: anhydrous ammonia\n     Worst case Scenario: Release of the total contents of the largest tank, the 30,000 gallon storage tank, filled to 85% maximum capacity would be released as a gas over 10 minutes. The maximum quantity released would be 131,325  pounds. The distance to the endpoint (point of dispersion to 200 ppm) is 2.68 miles.\n      Alternative Release Scenario: Based on a potential incident of the failure of a 2 inch hose during product transfer operations. The distance to the endpoint  (point of 200 ppm dispersion) is 1.18 miles. The amount of anhydrous ammonia released would be 11,908 pounds.\n\n4. The general accidental release prevention program and the specific prevention steps. \n\nThis distribution facility complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and\nregulations. The facility's  anhydrous ammonia plant has  implemented the OSHA standard 29 CFR 1910.111, \"Storage and Handling of Anhydrous Ammonia\"; periodic inspections by the Indiana State Chemists Office are also conducted. Employees involved in anhydrous ammonia activities are trained by our Safety Coordinator, contractor and insurance companies, and industry experts utilizing classroom, hands-on, verbal, and demonstration methods; an an"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28262,
      "SummaryText": "nual formal refresher course as well as periodic training is also provided.  \n  The major hazards identified with anhydrous ammonia include toxic release, stress corrosion, overfilling, equipment failure, earthquake, and tornado. Process controls, such as relief valves, check valves, manual shutoffs, alarms and procedures, emergency shut-off valves, and excess flow devices are utilized to minimize the potential for release. \n  Mitigation systems available include a deluge or water curtain provided by the responding fire department in the event of a release which would \"knock down\" the vapor cloud and neutralize the ammonia. In addition,  passive mitigation systems limiting the filling of tanks to 85% capacity (through tank gauges and onsite personnel) are utilized.\n  Employees are trained on an initial and ongoing basis. Employee Training is provided as well as periodic refresher training available from our Safety Coordinator, industry seminars, and vendor programs. Competency is measured through written and oral testing, demonstration (hands-on), and observation.\n   Maintenance programs are in place. Items are replaced if they fail, present a risk to the user, are required by law or standard, are out-of-date,  or if a system or process is changed or upgraded. OSHA 1910.111 standards are used to identify those needs. The Indiana State Chemist also makes periodic unannounced visits to our facility to inspect equipment, tanks, and safety training (they do not always leave documentation). In addition, employees utilizing the equipment on a nearly daily basis informally inspect the equipment for leaks, cracks, soundness, etc.\n\n\n5. Five-year accident history. \n\nWe have had no accidental releases of  anhydrous ammonia from this facility in the last 5 years.\n\n6. The emergency response program.\n\nThis facility has an emergency action plan, in accordance with OSHA standard 1910.38. We have  coordinated response actions with the Sheridan fire department, including pre-emergenc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28262,
      "SummaryText": "y planning and emergency training. We have discussed this program with the\n\nBoone County Local Emergency Planning Committee, and our  facility is included in the county emergency plan. In the event of a release of regulated substances, our employees have been instructed on the  procedures for notification of the local fire authority (Sheridan) fire department, emergency personnel,  and notification of any potentially affected neighbors. \n\n\n\n7. Planned changes to improve safety.\n\nAt his facility, safety improvement is an ongoing process.  Periodic evaluations are performed to assess the maintenance of safe conditions. This facility is  in compliance with the OSHA 29 CFR 1910.111 standard and current Indiana State Chemist rules."
    }
  ]
}