{
  "FacilityID": 28375,
  "FacilityName": "Empire Abo Gas Plant",
  "FacilityStr1": "257 Empire Road",
  "FacilityStr2": null,
  "FacilityCity": "Artesia",
  "FacilityState": "NM",
  "FacilityZipCode": "88210",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "35015",
  "LEPC": "Eddy County LEPC",
  "FacilityLatDecDegs": "32.776278",
  "FacilityLongDecDegs": "-104.257778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "elkhrn@pvtnetworks.net",
  "FacilityDUNS": null,
  "ParentCompanyName": "BP Corporation North America Inc.",
  "Company2Name": null,
  "CompanyDUNS": 8966889,
  "Company2DUNS": null,
  "OperatorName": "Elkhorn Operating Company-Operator",
  "OperatorStr1": "P.O. Box Drawer 70",
  "OperatorStr2": "257 Empire Roade",
  "OperatorCity": "Artesia",
  "OperatorStateFIPS": "NM",
  "OperatorZipCode": "88211",
  "OperatorZipCodeExt": "0070",
  "FTE": 29,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000075465",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "P 146-m-1",
  "SafetyInspectionDate": "1999-02-24 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-06-05 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-05-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2017-01-25 00:00:00",
  "DeRegistrationEffectiveDate": "2016-04-29 00:00:00",
  "AnniversaryDate": "2008-05-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 32.77716,
  "FRS_Long": -104.25982,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 40768,
      "AltID": "Nat Gas Liquid Extraction",
      "FacilityID": 28375,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 53527,
          "ProcessID": 40768,
          "ChemicalID": 115,
          "Quantity": 140000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 53528,
          "ProcessID": 40768,
          "ChemicalID": 125,
          "Quantity": 140000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 53529,
          "ProcessID": 40768,
          "ChemicalID": 118,
          "Quantity": 280000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 53530,
          "ProcessID": 40768,
          "ChemicalID": 98,
          "Quantity": 580000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 53531,
          "ProcessID": 40768,
          "ChemicalID": 94,
          "Quantity": 20000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 41698,
          "ProcessID": 40768,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 23227,
              "Process_NAICS_ID": 41698,
              "SafetyReviewDate": "2002-11-16 00:00:00",
              "PHA_Date": "2000-08-24 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-12-12 00:00:00",
              "TrainingReviewDate": "2002-12-31 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-03-31 00:00:00",
              "EquipmentInspectionDate": "2003-03-31 00:00:00",
              "EquipmentTested": "Visual Inspection on G8-402-B High Level Gas Chiller",
              "ChangeMgmtDate": "2003-01-02 00:00:00",
              "ChangeMgmtReviewDate": "2003-01-02 00:00:00",
              "PreStartupReviewDate": "2003-02-17 00:00:00",
              "ComplianceAuditDate": "2002-06-21 00:00:00",
              "AuditCompletionDate": "2003-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2002-06-30 00:00:00",
              "HotWorkPermitReviewDate": "2002-12-16 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2003-04-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 33975,
                  "PreventionProgram3ID": 23227,
                  "ProcessChemicalID": 53527
                },
                {
                  "PrimaryKey": 33976,
                  "PreventionProgram3ID": 23227,
                  "ProcessChemicalID": 53528
                },
                {
                  "PrimaryKey": 33977,
                  "PreventionProgram3ID": 23227,
                  "ProcessChemicalID": 53529
                },
                {
                  "PrimaryKey": 33978,
                  "PreventionProgram3ID": 23227,
                  "ProcessChemicalID": 53530
                },
                {
                  "PrimaryKey": 33979,
                  "PreventionProgram3ID": 23227,
                  "ProcessChemicalID": 53531
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 28375,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2002-06-01 00:00:00",
    "ERTrainingDate": "2002-09-01 00:00:00",
    "CoordinatingAgencyName": "Artesia Fire Department",
    "CoordinatingAgencyPhone": "5057462701",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "TSCA"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28375,
      "SummaryText": "Executive Summary\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nThe Empire ABO Gas Plant demonstrates a commitment to worker and public safety.   This commitment includes regular instruction and training in accident prevention and in emergency response.  Installation of equipment is permitted only after adequate reviews are conducted to ensure that the equipment can be operated without significant impact on workers or the public.  Employees are instructed to operate and maintain equipment within its design limits.  Elkhorn Operating Company, as operator of Empire ABO Plant, recognizes that policies and procedures that protect workers, the public, and the environment, also improve the operating efficiency of a facility.  If a release does occur, plant personnel will utilize their HazWOper training to respond to, control, and contain any release.  \n\n\nDESCRIPTION OF EMPIRE ABO GAS PLANT AS A STATIONARY SOURCE AND REGULATED SUBSTANCES \n\nThe Empire ABO Gas Plant, located about 8 miles east of Artesia, NM, processes natural gas.  The plant is considered to be a single process qualified for Program Level 3.\n\nProducts produced and stored at this facility include market quality residue gas, propane, butane and natural gasoline. A liquid ethane product is piplelined without storage. The plant also produces sulfur.  All products are extracted from the plant inlet natural gas stream.  The market quality products are all regulated flammables and are stored in quantities that exceed threshold quantities.  The sulfur extraction process involves the reduction of Hydrogen Sulfide (H2S).  The threshold quantity of Hydrogen Sulfide (10,000 lbs) is not met at this facility.\n\n\nOFFSITE CONSEQUENCE ANALYSIS RESULTS\n\nThe WCS associated with the release of flammable substance in Program Level 3 is a vapor cloud explosion (VCE)  involving the full inventory of the largest storage tank containing propane.  This tank is also the largest vessel in the plant containing a regulated substa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28375,
      "SummaryText": "nce.  The WCS assumes the inventory of 277,010 lbs. is released and ignites, reulting in a VCE.  The maximum distance to the 1-psi endpoint for this WCS, using RMPComp equation is 0.53 miles.  The evaluation of the release scenario does not take any passive mitigation procedures into account.  There are no public receptors within the 0.53 mile radius of this storage tank. The alternate case release scenerio involves the rupture of a loading hose at the propane loading area. The scenerio assumes that the propane loading hose ruptures, that the driver does not initiate the emergency shut-down (ESD), and that the maximum flow, 400 gpm, continues until the release is isolated two minutes later when the process area gas detector alarms the control room to ESD the truck loading process. The released mass under this scenerio would amount to 3200 lbs. of propane, all of which was assumed to be involved in a vapor cloud explosion. The endpoint distance to a 1 psi overpressure is 420 feet.  \n\nThe Empire ABO Gas Plant is covered under Program Level 3.\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe Empire ABO Gas Plant takes several proactive approaches to prevent the accidental release of regulated flammable and/or regulated toxic substances.  The essentials of the accidental release prevention program include worker training, safe work practices, operating knowledge and mechanical integrity.\n\nAll employees and contractors are trained in the hazards associated with regulated substances found at Empire ABO Gas Plant.  Training includes the characteristics of products produced as well as the specific hazards associated with hydrogen sulfide.  All visitors to the plant who might be exposed to operating equipment are required to receive the process overview training prior to entering the plant. This training serves to make workers aware of the importance of conducting plant operations and maintenance in a manner that prevents the release of regulated substances.\n\nMany safe w"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28375,
      "SummaryText": "ork practices are enforced at Empire ABO Gas Plant.  These practices are found in the plant safety manual.  Safe work practices include procedures for things such as: energy isolation, hot work, crane/lifting operations, vehicle operation and hazard reporting.  All of the safe work practices are intended to provide a margin of safety in work that prevents damage to equipment or injury to personnel.\n\nEmployees directly responsible for operating plant equipment are trained in proper operation before being permitted to operate alone in any area of the plant.  Operating procedures are contained in manuals available to all plant personnel 24 hours/day.  Plant operations knowledge levels on each shift are maintained by limiting the number and classification of operators on vacation at any one time.  Various Plant Operators are trained to relieve Lead Operators as necessary.  Refresher training is conducted as necessary to keep operator skills honed.  This procedure maintains the operators' awareness of design and operating limits for equipment under their control.  Every employee at Empire ABO Plant has the authority to shutdown the plant whenever they feel it is unsafe to operate.  Operating procedures include methods to prevent excessive corrosion in the plant amine systems.\n\nOne of the most significant components of the accidental release prevention program is the mechanical integrity program.  This program utilizes scheduled and unscheduled inspections of vessel and pipe wall thickness, compressor and pump serviceability, critical control calibration, and relief and vent system serviceability.  Wall thickness is used to determine corrosion rates in various equipment.  This program is monitored by an on-site Mechanical Integrity Coordinator who is certified in piping inspection and ultrasonic thickness determination.  Vessels and piping are inspected on a scheduled frequency depending on service and established corrosion rates.  Qualified mechanics constantly inspect a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28375,
      "SummaryText": "nd maintain fluid moving equipment such as pumps and compressors.  Repairs are made as necessary. Critical controls, such as those designed to prevent overpressure of vessels and piping, are tested periodically to ensure that they are calibrated accurately.  Pressure safety valves are inspected and tested annually by a certified PSV repair shop. All of these programs are intended to ensure that plant equipment is suitable for its current service.\n\n\n\n\nCHEMICAL SPECIFIC PREVENTION STEPS\n\nThe Empire ABO Gas Plant has safety features on many units to (1) contain/control a release, (2) quickly detect a release, and (3) mitigate a release.  The following types of safety features are used in the plant.\n\nRelease Detection\n1. Hydrocarbon detectors with alarms and shutdowns\n2. Hydrogen sulfide detectors with alarms\n\nRelease Containment and Control\n1. Process Safety Valves that discharge to a flare to capture and incinerate episodic releases\n2. Valves to permit isolation of various parts of the process\n3. Automated shutdown systems for specific process parameters such as high temperature, high pressure, \n4. Curbing and diking to contain liquid releases\n5. Redundant equipment such as back up power supply for critical control equipment\n6. Atmospheric relief devices\n\nRelease Mitigation\n1. Fire suppresion and extinguishing systems\n2. Trained emergency response personnel\n3. Personal protective equipment including chemical protective clothing and self contained breathing apparatus\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe Empire ABO Plant has not experienced any accidental releases in the 5 years prior to this submittal that resulted in death, injury, or significant property damage on site.  Neither has the plant experienced any accidental releases in the 5 years prior to this submittal that resulted in death, injury, evacuation, sheltering in place, property damage, or environmental damage offsite.\n\n\nEMERGENCY RESPONSE PROGRAM\n\nThe Empire ABO Plant maintains a written emergency response pr"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28375,
      "SummaryText": "ogram, which is in place to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response, including evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the affected public if a release occurs.  The emergency response program, in conjunction with HazWOper training also addresses postincident cleanup and decontamination requirements.\n\nThe plant also has procedures and practices that address maintenance, inspection and testing of emergency response equipment, as well as instructions and training that address the use of emergency response equipment.  Employees receive training in these procedures and practices as necessary to perform their specific emergency response duties.  The emergency response program is updated when necessary based on modifications to the plant.  The program is also updated as necessary to keep phone numbers, contacts, and procedures current.  Employees are encouraged to suggest improvements to the emergency response procedures based on their familiarity with plant equipment and operating procedures.\n\nThe Empire ABO Gas Plant emergency response program is coordinated with the Eddy County, NM Local Emergency Planning Committee (LEPC).  This coordination includes discussion with local fire and law enforcement agencies concerning their expected response.  Primarily, plant personnel will be responsible for control and mitigation of any accidental release.  The Empire ABO Plant conducts periodic emergency drills to keep employees aware of their responsiblities in the event of an accidental release.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe EmpireABO Gas Plant plans the following types of changes over the next few years:\n\n· Continue the instal"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 28375,
      "SummaryText": "lation of additional hydrocarbon and/or hydrogen sulfide detectors\n· Upgrade the process control system to insure serviceability \n· Perform Corporate Mechanical Integrity Review of equipment in 2003\n· Review and update safe work procedures"
    }
  ]
}