{
  "FacilityID": 28430,
  "FacilityName": "Coloma Treatment Plant",
  "FacilityStr1": "11200 Coloma Road",
  "FacilityStr2": null,
  "FacilityCity": "Rancho Cordova",
  "FacilityState": "CA",
  "FacilityZipCode": "95670",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06067",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "38.618694",
  "FacilityLongDecDegs": "-121.2655",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Southern Cal. Water Co.",
  "Company2Name": null,
  "CompanyDUNS": 6908859,
  "Company2DUNS": 6908859,
  "OperatorName": "SCWC - Arden-Cordova Water Service",
  "OperatorStr1": "11088 Olson Dr.",
  "OperatorStr2": null,
  "OperatorCity": "Rancho Cordova",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95670",
  "OperatorZipCodeExt": null,
  "RMPContact": "Paul Schubert",
  "RMPTitle": "Northern District Manager",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000076151",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-01 00:00:00",
  "SafetyInspectionBy": "Sacramento County HazMat",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-06-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-06-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-06-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-04-19 00:00:00",
  "DeRegistrationEffectiveDate": "2018-12-19 00:00:00",
  "AnniversaryDate": "2008-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 38.6187,
  "FRS_Long": -121.26646,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 40843,
      "AltID": "Disinfection",
      "FacilityID": 28430,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 41773,
          "ProcessID": 40843,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 53624,
          "ProcessID": 40843,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 553624,
          "ProcessID": 40843,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28430,
      "SummaryText": "Southern Cal. Water Co. - Arden-Cordova Water Service has instituted a Risk Management Program for their water treatment facility, Coloma Treatment Plant, as required by Federal Accidental Release Prevention (ARP) Program regulations at 40 CFR Part 68.  The Risk Management Program identifies the equipment, procedures, maintenance, inspection, and training associated with Regulated Substances (RS's) handled at this facility in excess of Federal threshold quantities; describes the structured assessment of hazards which was conducted to assess possible effects on employees and offsite public and environmental receptors; provides the results of an offsite consequences analysis; defines a prevention program, emergency response program, and mitigation measures to reduce the probability and magnitude of accidental releases of RS's; and establishes a schedule and responsibilities for implementation of mitigation measures and auditing of program elements.  This Risk Management Plan (RMP) is being filed as required by ARP regulations in order to report the elements of the current Risk Management Program and to describe further measures planned to mitigate or prevent accidental releases of RS's.  \n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nSouthern Cal. Water Co. - Arden-Cordova Water Service operates a surface water treatment plant and several groundwater wells, and a distribution system serving the Rancho Cordova area in eastern Sacramento County.  Its water treatment facility, Coloma Treatment Plant, is located at 11200 Coloma Road, Rancho Cordova, CA in Sacramento County, and uses chlorine for disinfection in quantities greater than the Federal threshold quantity for this RS.  The facility is located in a commercial/residential neighborhood across the street from a fire station.  There are 4 full-time employees at this site.  Chlorine is received in ton containers by truck, handled with an electric hoist, and stored on ton container scales and trunnion sets insid"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28430,
      "SummaryText": "e the building.  The chlorine is used to control biological growth on the filters and to disinfect the treated water.  Pressurized chlorine gas within a ton container is reduced to vacuum at a vacuum regulator valve mounted directly onto the ton container's gas valve.  From there, the chlorine under vacuum is metered through rate valves and rotameters, and drawn into water solution by the passage of pressurized water through an injector.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nIt is the policy of Southern Cal. Water Co. - Arden-Cordova Water Service that the receipt, storage and handling of chlorine at its facility be done in a manner which meets regulatory requirements and minimizes the probability and severity of releases of chlorine to the atmosphere, in order to protect the health and safety of its workers, the public, and the environment.  In order to accomplish this goal, Southern Cal. Water Co. - Arden-Cordova Water Service has gathered safety information on chlorine and on the process, equipment and procedures involving chlorine; performed a structured assessment of hazards of the process and external events which might affect the process; performed an offsite consequences analysis of defined release scenarios; established a written program for prevention and mitigation of releases; and established a written emergency response program coordinated with emergency response agencies.\n\nWORST CASE RELEASE SCENARIO\n\nA single \"worst case\" release scenario is required to be considered for each stationary source, resulting in the maximum distance to an endpoint for all toxic RS's contained on site above the threshold quantity.\nThe worst case release scenario for toxic chemicals is defined in the ARP regulations as the release of the contents of the largest single container of RS (in this case chlorine) over a period of 10 minutes. The scenario considered the release of the contents of the largest container of chlorine on site, in this case 2,00"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28430,
      "SummaryText": "0 lb.  This release scenario is not physically possible, due to the characteristics of chlorine.\n\nALTERNATIVE CASE RELEASE SCENARIO\n\nAn \"alternative case\" release scenario is required to be considered for each toxic RS handled in quantities greater than the threshold quantity at the site.\n\nThe \"alternative case\" scenario is described in the ARP regulations as a likely release resulting in offsite effects, considering administrative controls and mitigation measures in place, and is to be determined by the facility operators as part of the Process Hazard Analysis required to be performed during RMP development.  The \"alternative case\" considered for this facility is the release of 2 pounds of chlorine gas from a ton container due to an operator error during hookup, with the release secured by the operator after 1 minute.\n\nADMINISTRATIVE CONTROLS\n\nAdministrative controls in effect at Southern Cal. Water Co. - Arden-Cordova Water Service which were considered to mitigate the severity of the Worst Case and Alternative Case release scenarios include Southern Cal. Water Co. - Arden-Cordova Water Service's written policies and procedures for training of operators and maintenance personnel, written procedures for control of the inventory of chlorine at the facility, and policies regarding quality level of replacement materials and components for the chlorine system.\n\nMITIGATION MEASURES\n\nNo mitigation measures were considered to limit the severity of the Worst Case scenario.  No passive mitigation measures were considered to limit the severity of the Alternative Case scenario.  Active mitigation was considered for the Alternative Case, in the form of the timely response of properly trained and equipped personnel following established emergency response procedures.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAMS\n\nGeneral accidental release prevention programs instituted by Southern Cal. Water Co. - Arden-Cordova Water Service are categorized as administrative (management) pro"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28430,
      "SummaryText": "grams; procedures, training, and engineering controls; and emergency response programs.\n\nSouthern Cal. Water Co. - Arden-Cordova Water Service has instituted a Process Safety Management (PSM) Program meeting OSHA requirements at 29 CFR 1910.119 covering its disinfection process.  This constitutes the general accidental release prevention program for Southern Cal. Water Co. - Arden-Cordova Water Service's operations.  The program and document management procedures included in the PSM Program will be used as the management system for the Risk Management Program.\n\nCHEMICAL-SPECIFIC RELEASE PREVENTION STEPS\n\nRelease prevention steps specific to chlorine have been identified and implemented.  These include, among other things, creation of numerous facility-specific operation procedures with check boxes for completion of critical steps.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no accidents involving chlorine at this facility within the past five years resulting in injuries or offsite consequences.\n\nEMERGENCY RESPONSE PROGRAM\n\nSouthern Cal. Water Co. - Arden-Cordova Water Service's Emergency Response Program applicable to chlorine has been coordinated with Sacramento County Environmental Management Department, Hazardous Materials Division, the local agency responsible for hazardous materials inventory reporting and release response coordination.  It consists of notification of the public agency assigned responsibility for First Response to hazardous materials release emergencies and evacuation of persons on site to designated assembly areas upwind of the released gas.  First Responders have participated with Southern Cal. Water Co. - Arden-Cordova Water Service personnel in response drills.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nAll of the improvements and mitigation measures identified in the process hazard analysis which Southern Cal. Water Co. - Arden-Cordova Water Service committed to accomplish have been completed or are in progress.  Any other measures identified by"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28430,
      "SummaryText": " employees during workplace hazard surveys, or as a result of audit activities, will be thoroughly reviewed and considered for implementation."
    }
  ]
}