{
  "FacilityID": 28521,
  "FacilityName": "Ventura Gas Processing Plant - Plant 7",
  "FacilityStr1": "1800 School Canyon Road",
  "FacilityStr2": "3382 N. Ventura Ave",
  "FacilityCity": "Ventura",
  "FacilityState": "CA",
  "FacilityZipCode": "93001",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06111",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.311944",
  "FacilityLongDecDegs": "-119.27",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": "www.aeraenergy.com",
  "FacilityEmailAddress": "rmpinformation@aeraenergy.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Aera Energy LLC",
  "Company2Name": null,
  "CompanyDUNS": 615055985,
  "Company2DUNS": 0,
  "OperatorName": "Aera Energy LLC",
  "OperatorStr1": "1800 School Canyon Road",
  "OperatorStr2": "3382 N. Ventura Ave.",
  "OperatorCity": "Ventura",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93001",
  "OperatorZipCodeExt": null,
  "RMPContact": "Marty McKenna",
  "RMPTitle": "Manager of Operations",
  "FTE": 2,
  "OtherEPAFacilityID": "CA0080666",
  "EPAFacilityID": "100000150971",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0041",
  "SafetyInspectionDate": "2001-07-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-07-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-07-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-07-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-07-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 34.30392,
  "FRS_Long": -119.28643,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "ZIP+2 CENTROID",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 40997,
      "AltID": "BP Mix Storage",
      "FacilityID": 28521,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 41928,
          "ProcessID": 40997,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 53802,
          "ProcessID": 40997,
          "ChemicalID": 155,
          "Quantity": 975000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 37687,
              "ProcessChemicalID": 53802,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 37688,
              "ProcessChemicalID": 53802,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 37689,
              "ProcessChemicalID": 53802,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 37690,
              "ProcessChemicalID": 53802,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 37691,
              "ProcessChemicalID": 53802,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 37692,
              "ProcessChemicalID": 53802,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 553802,
          "ProcessID": 40997,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 40998,
      "AltID": "Propane Refrigeration",
      "FacilityID": 28521,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 41929,
          "ProcessID": 40998,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 53803,
          "ProcessID": 40998,
          "ChemicalID": 98,
          "Quantity": 63000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 553803,
          "ProcessID": 40998,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28521,
      "SummaryText": "Aera Energy LLC, Ventura Operations\n    Gas processing Plant (Plant 7)\n            Risk Management Plan Executive Summary\n    \n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nAera Energy?s Gas Processing Plant (Plant 7) has a strong commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation and maintenance of our Plant. Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. However, if a release does occur, plant personnel will respond to control and contain the release.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES \n\nThe Gas Processing Plant (Gas Plant), located at 1800 School Canyon Road in Ventura, California processes raw natural gas from the Ventura oilfield. In this process natural gas liquids (NGL?s) are removed from the raw natural gas to meet gas sales specifications. The NGL?s are then pumped via regulated D.O.T. regulated pipelines to storage vessels at plant 6 approximately 2 miles away.. The NGL product processed and stored at the gas plant is a flammable mixture commonly known as BP Mix. BP Mix contains the following regulated substances butane, isobutane, propane, ethane and methane. \n\nOFFSITE CONSEQUENCE ANALYSIS RESULTS\n\nThe worst-case scenario (WCS) associated with a release incident at the Gas Processing facility is a vapor cloud explosion (VCE) involving the full inventory of the largest storage tank of BP Mix.  The release amount would be 86,000 pounds, which is assumed to release and ignite, resulting in a VCE.  The maximum distance to the 1-psi endpoint for this WCS is 0.4 miles. Although we have numerous controls to prevent such releases and to manage their consequences, no credit for passive measures was taken into account in evaluating this WCS.\n\nThe alternative release scenario (ARS) for flammable substances at this facility "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28521,
      "SummaryText": "is a vapor cloud explosion due to a 2? size leak due to a  maintenance error, corrosion, or external impact. The line may be associated with the BP Mix storage tanks or process equipment.  A release may occur of 5900 pounds per minute for 10 minutes. The flammable cloud may travel up to 350 feet in typical weather conditions before dispersing below flammable concentrations. If ignited, an explosion may cause an overpressure of 1 psi. up to 430 feet away.\n\nFlammable gas detectors are located throughout the facility, with automatic shutdown after 3 minutes. Manual emergency shutdown buttons are also located in the facility, and firewater monitors may be used to disperse below the flammable concentrations.  This scenario is unlikely to occur because of the mechanical integrity program, the pre-start up safety review, management of change and operating procedures at the facility.  \n\n\n\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe following is a summary of the accident prevention program in place at the facility. Because processes at the Storage facility that are regulated by the Environmental Protection Agency?s (EPA) risk management program (RMP) regulation are also subject to Cal/OSHA?s process safety management (PSM) standard., this summary addresses each of the PSM elements and describes the management system in place to implement the accident prevention plan.\n\nManagement System for RMP and PSM\n\nAera Ventura Operations has developed a management system in order to define all elements required by the process safety standard and risk management program. The management system defines for each program element the following:\n1. Purpose and scope of element\n2. Specific procedures\n3. Responsible and accountable personnel using a RACI (responsible, accountable,consult,inform) chart, \n4. Verification and measurement metrics\n5. Feedback mechanism\n6. Document locations for applicable documents\n\nThe management system is available for review at either facility.\n\nEmployee"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28521,
      "SummaryText": " Participation\n\nAera Energy Ventura Operations encourages employees to participate in all facets of process safety management and accident prevention. Examples of employee participation range for updating and compiling technical documents and chemical information, to participating as a member of a process hazard analysis (PHA) team. Employees have access to all information created as a part of the NGL storage facility (Plant 6) and the Gas Processing plant (Plant 7) accident prevention program.  Specific ways that employees can be involved in the accident prevention program are documented in the employee participation plan that is maintained at both facilities and addresses each accident prevention program element.  In addition, all Aera Ventura operations utilizes behavior based safety management (BBSM), an employee directed process to observe and review operations to assure safe behaviors are maintained and unsafe behaviors are corrected with corrective action plans.  \n\nProcess Safety Information\n\nThe Gas Processing facility keeps a variety of technical documents that are used to help maintain safe operation of the processes. These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information. Specific personnel within the facilities are assigned responsibility for maintaining up-to-date process safety information. A table summarizing the reference documents and their location is readily available as part of the management system.\n\n\n\n\n\nChemical specific information, including exposure hazards and emergency response/exposure treatment considerations is provided in material safety data sheets (MSDS?s). This information is supplemented by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals.  For specific process areas, the facility has documented safety-related limi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28521,
      "SummaryText": "ts for specific process parameters (e.g. pressure, tank levels, temperature) in a key process parameter document. The facility ensures that process is maintained within these limits using process controls, and monitoring instruments, trained personnel, automated shutdown systems.\n\nThe Gas Processing facility maintains numerous technical documents that provide information about the design and construction of process equipment. The information includes materials of construction, design pressure, temperature ratings, and electrical ratings of equipment.  This information, in combination with written procedures and trained personnel, provides the basis for establishing inspection and maintenance activities, as well as evaluating proposed process and facility changes to ensure that safety features are not compromised. \n\nProcess Hazard Analysis(PHA)\n\nBoth of Aera?s Ventura PSM facilities has a comprehensive program to ensure that hazards associated with the various processes are identified and controlled. Within this program, each process is systematically examined to identify hazards and ensure that adequate safeguards are in place to manage these hazards.\n\nAera?s Ventura plants primarily use the hazard and operability (HAZOP) analysis technique to perform these evaluations. HAZOP analysis in recognized as one of the most systematic and thorough hazard evaluation techniques. The analyses are conducted by a team of people who have operating and maintenance experience as well as engineering expertise.  This team identifies and evaluates hazards of the process as wells accident prevention and mitigation measures. The team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary. \n\nThe PHA teams findings are forwarded to local management for resolution. Implementation of mitigation options in response to PHA findings is based on a relative risk ranking assigned by the PHA team. The ranking helps ensure that pot"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 28521,
      "SummaryText": "e maintained at an acceptable level. This refresher training is conducted at least every 3 years. All of this training is documented for each operator, including the means used to verify the operator understood the training.\n \nContractors\n\nAera Energy uses contractors to supplement its workforce for specialized maintenance, inspection and construction activities. Because some of the contractors work on or near process equipment, Aera?s facilities have procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand and follow site safety rules, and (6) inform gas plant or NGL storage facility personnel of any hazards that they may find during their work. This is accomplished by providing contractors with \n(1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices prior to their beginning work. In addition, Aera evaluates contractor safety programs and performance during the selection of a contractor.  Plant personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\n\nPre-startup Safety Reviews(PSSR?s)\n\nBoth Aera facilities conduct a PSSR for any new facility or facility modification that requires a change in the process safety information. The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for start up prior to placing equipment into service. The review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready. The PSSR review team uses checklists to verify all aspects of readiness. A PSSR involves field verification of the construction and serves as a quality assurance function by requiring verification that accident pr"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28521,
      "SummaryText": "ential accident scenarios assigned the highest risk receive immediate attention. All approved mitigation options are tracked until they are completed. The final resolution of each finding is documented and retained.\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from original design safety features, the facilities periodically updates and revalidates the hazard analysis results. The periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating.\n\nOperating Procedures\n\nBoth Aera Ventura facilities maintain written procedures that address various modes of t process operations, such as (1) unit start up, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial start up of a new process. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators. These procedures are periodically reviewed and annually certified as current and accurate. The procedures are kept current and accurate by revising them as necessary to reflect changes made through the management of change process.\n\n\n\nTraining\n\nTo complement the written procedures for process operations, Aera?s facilities have implemented a comprehensive training program for all employees involved in operating a process. New employees receive basic training in plant operations if they not already familiar with such operations. After successfully completing this training, a new operator is paired with a senior operator to learn process-specific duties and tasks. After operators demonstrate (e.g. through tests, skills demonstration) having adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently. In addition, all operators periodically receive refresher training on the operating procedures to ensure their skills and knowledge ar"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 28521,
      "SummaryText": "evention programs are properly implemented.\n\n\n\n\n\n\n\n\n\n\n\n\n\nMechanical Integrity(MI)\n\nAera?s facilities has established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems are in a safe operating condition. The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures. In combination, these activities form a process that maintains the mechanical integrity of the process.\n\nPersonnel involved in maintenance activities receive training on (1) a overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to ensure that they can perform their job in a safe manner.  Written procedures help ensure that work is performed in a consistent manner and provide a basis for training. Inspections and tests are performed to help ensure that equipment functions as intended and to verify that equipment is within acceptable limits (e.g. adequate wall thickness for pressure vessels). If a deficiency is identified, employees will correct the deficiency before placing the equipment back in service (if possible), or a management of change team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.\n\nAnother integral part of the mechanical integrity program is quality assurance. Aera Ventura Operations incorporate quality assurance measures into the equipment purchases and repairs. This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\n\nSafe Work Practices\n\nAera?s safe work practices are in place to help ensure worker and process safety. Examples of these include: (1) co"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 28521,
      "SummaryText": "ntrol of the entry/presence/exit of support personnel, (2) a energy control  procedure to ensure the safe isolation of energy sources for equipment undergoing maintenance, (3) procedures for safe removal of hazardous substances before process piping or equipment is opened, (4) a permit and procedure to control spark producing activities (hot work), and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space. These procedures (and others), along with training affected personnel, form a system to help ensure that operations and maintenance activities are performed safely. \n\nManagement of Change\n\nAera has a comprehensive system to manage changes to all covered processes. The system requires that changes to items such as process equipment, chemicals, technology(including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to: (1) ensure adequate controls are in place to manage any new hazards, and\n(2) verify that existing controls have not been compromised by the change. Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes. In addition, operating and maintenance personnel are provided any necessary training on the change.\n\n\n\n\n\nIncident Investigation\n\nAera promptly investigates all incidents which results in or could have reasonably resulted in a major accident which also includes near misses.  The goal of each investigation is to determine the facts, identify causal factors and root causes, then develop corrective actions to prevent a recurrence of the incident or a similar incident. Aera uses the Taproot? root cause methodology for this level of incident investigation. The investigation team documents its findings, develops recommendations to prevent recurrence, and forwards these results to local management for res"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 28521,
      "SummaryText": "olution.  Corrective actions taken in response to the investigation teams findings and recommendations are tracked until they are complete.  The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings.  Incident investigation reports are retained for at least 5 years so reports can be reviewed during future PHA?s and PHA revalidation.\n\nCompliance Audits\n\nTo help ensure that the accident prevention program is functioning properly, Aera periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented. Compliance audits are conducted at least every 3 years. Both hourly and staff personnel participate as audit team members. The audit team develops findings that are forwarded to local management for resolution. Corrective actions taken in response to the audit team?s findings are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained.\n\nCHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe processes at the NGL storage facility have hazards that must be managed to ensure continued safe operation. The following is a description of the existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\n\nUniversal  Prevention Activities\n\nThe accident prevention program summarized previously is applied to all RMP-covered processes at Aera Ventura Operating Area. Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n\n\nSpecialized Safety Features\n\nThe Ventura Gas Processing facility has safety features on many processes to help (1) contain/control a release, (2) quickly detect a release, and (3) to reduce the consequences of a release. The following types of"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 28521,
      "SummaryText": " safety features are used in the covered processes:\n\nRelease Detection\n\n1. Hydrocarbon (LEL) gas detectors provide alarms and subsequent actuation of shutdown valves(SDV?s)\n\nRelease Containment/Control\n\n1. Valves to permit isolation of the process\n\n2. Automated shutdown systems for specific process parameters\n\n3. Berming and curbing to contain liquid releases\n\n4. Redundant equipment and instrumentation (e.g. uninterruptible power supply for process control system, generator, process monitoring and actuation capability from gas processing plant also)\n\n5. Atmospheric relief devices\n\nRelease Mitigation\n\n1. Firewater loop and 750 gpm fire monitors\n\n2. Personal protective equipment (e.g. fire resistive clothing, self container breathing apparatus)\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nVentura?s gas processing facility has had an excellent record of accident prevention over the last 5 years. There has been 2 onsite events: one in 1997 involving a release of natural gasoline through a pump casing and in May of 1999 a small release natural gasoline from a relief valve within this 5 year period. No offsite consequences occurred in these incidents and would not meet the definition of a serious offsite or onsite incident.\n \n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nAera Energy maintains a written emergency response program, which is in place to protect worker and public safety as well as the environment. The program consists of procedures for responding to a release of a regulated substance, including the possibility of fire or explosion.  The plans address response for credible events, including proper first aid and medical treatment for exposures, evacuation plan and accounting for personnel after an evacuation, notification of local emergency response agencies, post incident clean up and decontamination. Primary public response agencies are Ventura County Fire Department and Ventura City Fire Department (by automatic aid).\n\nIn addition, all plant has scheduled procedures that addres"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 28521,
      "SummaryText": "s the maintenance, testing, and inspection of emergency response equipment. All Aera operation personnel attend  annual 16 hour health and safety training which involves classroom, field simulations and scenarios.  The emergency action plan is updated when necessary based upon modifications to the plants or facilities. \n\n\n\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nAera Energy?s Gas Processing facility will assure all findings from the PHA are resolved by 07/31/2003.   The following types of changes are planned over the next few years to continuously improve safety and operations:\n\n- Upgrade process control systems\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n SECTION 4 ? CALARP DATA FIELDS\n\nExecutive Summary (2745.3)\n\nSee section 3\n\nOffsite Consequence Analysis WCS(2745.3)\n\n    - Chemical name: Flammable Mixture\n    - Model used: EPA?s RMP Comp\n    - Scenario: Vapor Cloud Explosion\n    - Quantity Released: 86,000 lbs in 10 minutes\n    - Distance to end point: 0.4 mile\n    - Estimated public receptors: 0\n- Public receptors within distance to endpoint: Commercial, office, or industrial areas-yes\n- Environmental receptors: none\n- Passive Mitigation considered: none\n\n    Alternative release\n\n- Chemical name: Isobutane ? flammable\n      - Model used: EPA?s OCA Guidance Reference Tables or Equations\n      - Scenario: Vapor cloud fire\n    - Quantity released: 60,000 lbs ; 5900 lbs/min for up to 10 minutes \n            - Distance to endpoint: 0.08 miles\n    - Public receptors : No\n- Environmental receptors: no\n- Passive mitigation considered: none\n\n    Five year Accident History (2745.5)\n\n    No incidents meeting reporting requirements have occurred\n\n    Process Safety Information(2745.7)\n\n    - SIC code: NAICS 211112\n- Name of regulated substance(s): Butane, Isobutane, Methane, Propane, Ethane\n    - Date last PSI information reviewed or revised: 09/26/2001\n         \n\n\n\n\n\n\n\n\n\n\n\n\n    \n\n\nProcess Hazard Analysis(2745.7)\n\n- Date of last PHA or PHA update: 04/26/2002\n- PHA technique used: HAZOP \n- Expected date of completion of changes from last PHA: 07/31/2"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 28521,
      "SummaryText": "003\n-Major hazard identified: Fire, explosion, equipment failure, loss of cooling,electricity, \n      instrument air,earthquake\n    - Process controls used: relief valves, check valves, manual shutoffs, automatic shutoffs,\n              alarms and procedures, emergency power\n- Mitigation systems: Flame retardant coating on storage vessels, fire water loop \n       with 750 gpm fire monitors\n    - Monitoring system: Process are detectors, \n            - Changes since last PHA: New control room built and relocated ,Installation of process\n               controls, non-code vessels removed from service\n\n    Operating procedures(2745.7)\n\n    - Date of most recent revision of operating procedures: 03/27/2003\n\n    Training(2745.7)\n\n- Date of the most recent review of revision of training programs: 12/2002\n- Type of training provided: Classroom and on-the-job\n- Type of competency testing: written test, oral test, demonstration, and observation\n\n    Mechanical Integrity(2745.7)\n\n    - Date of the most recent review/revision of maintenance procedures: 03/2002\n    - Date of the most recent revision/revision of recent equipment inspection or test:\n      03/29/2003\n\n    Management of Change(2745.7)\n\n    - The date of the most recent change that triggered management of change procedures: \n          03/19/2003\n    - The date of the most recent review or revision of management of change procedures:\n       02/26/2003\n\n    Pre-startup Review(2745.7)\n\n- Date of the most recent pre-start safety review: 03/31/2003\n\n    Compliance audits(2745.7)\n\n    - Date of the most recent compliance audit: 02/28/2000\n- Expected date or actual date of completion of all changes resulting from the \n  audit: 03/03/2000\n\nIncident Investigation(2745.7)\n    \n    - Date of most recent incident investigation : 05/27/2000\n    - The expected or actual date of completion of all changes resulting from investigation:\n       07/31/2001\n    \n    Employee Participation(2745.7)\n\n    - Date of the most recent review/revision of employee participation plans: 02/26/2003\n\n    Hot work permit(2745.7)\n\n    "
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 28521,
      "SummaryText": "- Date of the most recent review/revision of hot work permit procedures: 02/26/2003\n \n    Contractors(2745.7)\n\n- Date of the most recent review/revision of contractor safety procedures: 02/26/2003\n- Date of the most recent evaluation of contractor safety performance: 03/01/2003\n\n    External Events Analysis Information(2745.7)\n            \n- Types of external events considered in PHA : Seismic event-earthquake, On site  Process Fire and external fire, Wildland Fire, Landscape Instability\n-Magnitude or scope of external events considered: Earthquake: product releases\n         / On site and external process fire: pressure feed fires and potential for Boiling Liquid \n   Expanding Vapor Explosion(BLEVE) / Wildland Fire: possible exposure to piping and\n   equipment / Landscape instability: potential for slides into roads, piping or equipment \n            - Seismic analysis: See section 7\n- For each external events with offsite potential, process controls, mitigation systems:         \n       For Seismic Incidents: Leak and gas detection with shutdown / On site process fire \nAnd external fire: Emergency shutdowns, fire loop with fire suppression monitors /   Wildland fire: no offsite expected but weed abatement and onsite wildland fire suppression capability / Landscape instability: wet weather procedures and monitoring ground saturation\n- Date of most recent field verification that equipment is installed/maintained as\n      as designed: PSM Audit 02/28/2000\n\n    Emergency response program(2745.8)\n\n- Note: Please review executive summary for emergency response plan information\n- Do you have a written emergency response plan: Yes\n- Does the plan include specific actions to be taken during release: Yes\n           -  Does the plan include procedures for informing the public & responding agencies: Yes\n     -  Does the plan include emergency health care information: Yes\n    - Date of the most recent review/update to the emergency response plan: 03/01/2003\n    - Date of the most recent emergency response tra"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 28521,
      "SummaryText": "ining for employees: 03/31/2003\n    - List of the Federal/State emergency plan requirements that a stationary source is\n      subject to:\n- CCR, Title 8, Section 3220,Cal/OSHA emergency action plan: Yes\n- CCR, Title 14, Section 815.01-820.01;Oil Spill Contingency Plan: Yes\n- CCR, Title 19, Section Business Plan emergency response plans and    procedures: Yes\n- CCR, Title 22, sections 66265.50-66265.56 Hazardous waste contingency plan:            Yes\n- CCR, Title 23, section 2634; underground storage tank response plan: Yes\n        - 29 CFR 1910.119 and Title 8 Process Safety Management: Yes"
    }
  ]
}