{
  "FacilityID": 2868,
  "FacilityName": "North Augusta Water Treatment Plant",
  "FacilityStr1": "130 Hammond's Ferry Road",
  "FacilityStr2": null,
  "FacilityCity": "North Augusta",
  "FacilityState": "SC",
  "FacilityZipCode": "29841",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45003",
  "LEPC": null,
  "FacilityLatDecDegs": "33.481667",
  "FacilityLongDecDegs": "-81.961111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "OT",
  "LatLongDescription": "PG",
  "FacilityURL": "www.northaugusta.net",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of North Augusta",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of North Augusta",
  "OperatorStr1": "P.O. Box 6400",
  "OperatorStr2": null,
  "OperatorCity": "North Augusta",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29861",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000035026",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-07 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2019-05-09 00:00:00",
  "DeRegistrationEffectiveDate": "2019-04-26 00:00:00",
  "AnniversaryDate": "2004-06-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 33.495125,
  "FRS_Long": -81.986326,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3201,
      "AltID": "Chlorination of drinwater",
      "FacilityID": 2868,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 3412,
          "ProcessID": 3201,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 3268,
          "ProcessID": 3201,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1014,
              "Process_NAICS_ID": 3268,
              "SafetyReviewDate": "1999-05-20 00:00:00",
              "PHA_Date": "1999-05-20 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Surveillance camera monitors chlorine container area.",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Installation of surviellance camera in chlorine container storage area.",
              "OpProceduresReviewDate": "1999-05-13 00:00:00",
              "TrainingReviewDate": "1999-05-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-13 00:00:00",
              "EquipmentInspectionDate": "1999-05-21 00:00:00",
              "EquipmentTested": "scales, containers, vacuum regulator check units, gas piping, chlorinators, leak detectors, surveillance camera",
              "ChangeMgmtDate": "1998-12-11 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-13 00:00:00",
              "PreStartupReviewDate": "1998-12-08 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-20 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-20 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-05-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1138,
                  "PreventionProgram3ID": 1014,
                  "ProcessChemicalID": 3412
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 2868,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Aiken County Emergency Preparedness",
    "CoordinatingAgencyPhone": "8036421623",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2868,
      "SummaryText": "The purpose of this document is to inform interested persons, including the public, that the City of North Augusta is complying with the Environmental Protection Agency (EPA) Accidental Release  Prevention requirements: Risk management programs under the Clean Air Act Section 112(r)(7).  This regulation is published in Title 40 of the Code of Federal Regulations (CFR) Part 68.\n\nThe Risk Management Program (RMP) regulation was developed in response to public concern regarding the consequences that a catastrophic chemical release may have on surrounding communities and the environment.  The Clean Air Act required EPA to develop the RMP in an effort to help prevent accidental releases of regulated substances and to reduce the severity of a release should one occur.\n\nThe City of North Augusta has one of the regulated substances, chlorine,  above the threshold quantities as specified in Section 68.130 of 40 CFR Part 68, and therefore must comply with the RMP program.  This program provides our facility with an integrated approach to identifying and managing the hazards posed by the use of regulated substances. \n\nUnder the RMP rule, the storage and use of chlorine in quantities exceeding 2,500 pounds subjects the North Augusta Water Treatment Plant to Program 3 requirements.  Program 3 requirements apply to higher-risk processes already subject to OSHA's Process Safety Management (PSM) standard.  This facility routinely stores chlorine onsite in three (3) one-ton containers, two of which are connected to a single process.\n\nManagement System \n\nThe management system at our facility oversees the implementation of the RMP elements in order to manage the risk of a chemical release at this facility. The Superintendent of Water Production has overall responsibility for the development, implementation, and integration of the RMP elements.  Where the responsibilities are shared, the names and positions of these people are documented, and the lines of authority are defined in an"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2868,
      "SummaryText": "organizational chart.\n\nHazard Assessment\n\nOur written hazard assessment program evaluates the hazards that may exist with the chlorine systems, assesses the risks involved, and determines ways to reduce the probability of an accidental release of chlorine into the atmosphere. The program  also provides for determination of the impact of significant accidental releases on the public health and environment and provides  a history of such releases.\nIn accordance with RMP requirements our hazard assessment program will be reviewed and updated at least every 5 years. \n\n EPA regulations set the reportable release quantity for chlorine at 10 pounds. Records dating back to 1973 indicate there has never been a reportable release from this facility.  However, since the potential for a release does exist wherever chlorine is stored in large quantities, an analysis of the consequences of such a release was necessary. \n\n We used EPA's RMPCOMP Ver. 1.06 software to perform the consequence analysis for both a worst-case release scenario and an alternative case release scenario. The use of this software provides  the distance to toxic endpoint, which is the distance traveled by the chlorine released before its concentration decreases to 3 ppm.  EPA believes that nearly all individuals could be exposed to chlorine at this concentration for up to one hour without experiencing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\n\nWorst-Case Release Scenario: EPA defines the worst-case release as a release of the maximum quantity of the largest vessel over a 10 minute period.  Our worst-case release scenario simulated the release of 2,000 pounds of chlorine in a period of 10 minutes.  Using RMPCOMP software, the radius of the toxic endpoint distance was determined to be 0.9 miles from the chlorine storage building.  Based on the 0.9 mile radius, a total land area of 2.5 square miles and an estimated population of"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2868,
      "SummaryText": "3,500 could potentially be affected by a release of this magnitude. \nEnvironmental receptors, which are defined as national or state parks, monuments, forests, wildlife sactuaries or preserves, etc.  that would potentially be impacted by a release must be identified. There were none identified within the affected area under this scenario.  Several local parks and recreational facilities, however, were identified within the affected area.\n\nAlternative release scenario: The alternative release scenario simulated the failure of the connection of the vacuum regulator check unit to the container valve, a more likely release scenario than the worst-case.  A release rate of 18.1 pounds per minute for a period of 60 minutes resulted in an estimated distance to toxic endpoint of 0.1 miles.\n Due to the location of recreational facilities in close proximity to the facility, an estimated population of 200 could be affected by a release of this magnitude. The degree of impact would be dependent upon wind direction and velocity. \nAs in the worst-case scenario, there were no federal or state environmental receptors identified within the impact area. There was, however, one local park identified within the affected area.\n\nPrevention Program\nOur prevention program ensures that the elements of the risk management program are integrated and implemented on an ongoing basis, and that there is accountability and responsibility for the overall program and for each element of the program. An organizational chart is used to assign accountability and responsibility for each part of the program. Our prevention program addresses the following elements that are tailored to suit the degree of hazards present at our facility and the degree of complexity of our facility's operations:\n\na. Process safety information- Written process safety information regarding chlorine , chlorination technology, and chlorination equipment was compiled to enable the employees involved in the operating process at ou"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2868,
      "SummaryText": "r facility to identify and understand the potential hazards of chlorination processes.\n\nb. Process hazard analysis- Each process hazard analysis is performed by the Hazard Assessment Team, of which all members have expertise and knowledge specific to the chlorination process.  Reviews and updates of the process hazard analysis are conducted every 3 years.\n\nc. Operating procedures- The standard operating procedures at this facility provide clear instructions for properly conducting all activities associated with the operation, inspection, and maintenance of the chlorination system.  Operating procedures are reviewed annually for content and accuracy.\n\nd. Training-The intent of our training program is to increase employee awareness of process hazards that are associated with the chlorination process.  We  train each new employee involved with the chlorination process with an overview and the proper operating procedures for the process.  Refresher trainer is conducted annually and whenever a process change is made.\n\ne. Mechanical integrity- At this facility, all equipment used to process, store, or handle chlorine is designed, constructed, installed, and maintained in order to minimize the risk of a chlorine release. The frequency of our mechanical inspections is in accordance with applicable manufacturer's recommendations and each test and/ or inspection is documented.\n\nf. Management of change- Prior to implementing a change in the chlorination process, the change is identified, reviewed, and authorized prior to implementation.  A Process Change Authorization is required for any changes to ensure the operating procedures contain the operating parameters and the importance of operating within the limits. Management of change covers changes such as process technology changes and changes to equipment and instrumentation. \n\ng. Pre-startup review- Prior to startup of a changed process or affected part of a process, all employees involved in operating the process, maintaini"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 2868,
      "SummaryText": "ng the process, and contract employees affected by a change are informed of and trained in the change(s).  Additionally, process safety information and operating procedures are updated to reflect the change(s) if necessary.\n\nh. Compliance audits- The Hazard Assessment Team is responsible for assembling a compliance audit team to audit compliance with RMP at least every three (3) years. The audit procedures include examinations of the written  RMP plan and documentation, interviews with responsible personnel, and visual inspections of the site and equipment.  A checksheet is used as a guide to the elements to be considered. A standardized audit form is used to document each audit step and to ensure an effective audit is conducted and proper follow-up is accomplished. \n\ni. Incident investigation- Incidents that result in or could have reasonably resulted in a chlorine release are investigated within 48 hours of the incident.  The Incident Investigation Team  investigates each incident in an attempt to identify the underlying causes of the incident and to implement corrective actions to prevent future incidents. The incident investigation elements include a desription of the incident, process description, process flow diagram, listing of investigation team members, sequence of events, conributory factors, investigation conclusions, recommendations, and investigation report review with affected personnel.\n\nj. Employee participation- Employee participation is a required element in process safety and risk management. Employees are encouraged to serve on numerous task groups and teams to ensure that our PSM and RMP plans are current and in order.  All employees have ready access to all elements of our RMP plan.  All employees involved with operation of chlorination systems receives detailed training for all activities relating to the operation and maintenance of these systems.  New employees receive training prior to  being allowed to operate any portion of the chlorinatio"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 2868,
      "SummaryText": "n system. Refresher training is provided annually.\n\nk. Hot work permit- The hot work permits issued at our facility document that all fire prevention and protection requirements have been implemented prior to the start of any hot work operations.  Each permit, which must be issued by the Superintendent of Water Production, identifies the date(s) authorized to perform the hot work, and the equipment on which the hot work is to be performed, as well as site preparation and safety equipment requirements and documentation.  \n\nl. Contractors- Prior to starting any work on or adjacent to chlorination system equipment, contractors are required to provide detailed information regarding their safety and health program and safety performance record. Contractors are then informed of all potential hazards they may be exposed to,  emergency action plans in place, and required safe work practices.  They are also informed of their responsibilities to ensure that their employees receive the necessary training.  Periodic inspections of the contractor's performance are conducted to ensure safe work practices are being followed.  Documentation is maintained that all the listed requirements have been met.\n\nEmergency Response Program\nOur emergency action plan addresses the actions that our employees are to take in the event an accidental chlorine release occurs.  Although our employees will not serve as emergency responders, they are fully responsible for determining that a chlorine release is occurring and for coordinating emergency response activities through the Aiken County LEPC and the North Augusta Public Safety Department.  Our emergency action plan clearly lists the steps employees must take upon determining a chlorine release has occurred.  Employee training in emergency action plan responsibilities, in addition to practice drills, is conducted annually. \n\nSafety & Mitigation Systems\nOur facility currently has chlorine leak detectors located in both  the container storage and p"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 2868,
      "SummaryText": "rocess areas. Both detectors provide visual and audible alarms should a leak be detected. These units are inspected daily and tested weekly.\nA written evacuation plan is in place should evacuation become necessary.  Escape respirators are available for evacuation purposes.  Employees are also trained in shelter in place procedures.\n\nFuture Upgrades & Improvements\nSeveral options to improve existing mitigation systems are currently under review. The installation of a deluge system or a water curtain are both under consideration.\n\nArrangements are currently being made for pilot testing an onsite sodium hypochlorite generation system later this year. This system uses salt to generate a 0.8 % sodium hypochlorite solution  that can be used in place of chlorine gas. The decision to install the system will be made based upon the results of the pilot study and the availability of funding."
    }
  ]
}