{
  "FacilityID": 28695,
  "FacilityName": "MEMC Southwest, Inc.",
  "FacilityStr1": "6800 S. U.S. Hwy. 75",
  "FacilityStr2": null,
  "FacilityCity": "Sherman",
  "FacilityState": "TX",
  "FacilityZipCode": "75090",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48181",
  "LEPC": "Grayson County LEPC",
  "FacilityLatDecDegs": "33.555556",
  "FacilityLongDecDegs": "-96.611111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "AS",
  "FacilityURL": "www.memc.com",
  "FacilityEmailAddress": "tmiller@memc.com",
  "FacilityDUNS": 926775180,
  "ParentCompanyName": "MEMC Electronic Materials, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 361834617,
  "Company2DUNS": 361834617,
  "OperatorName": "MEMC Southwest, Inc.",
  "OperatorStr1": "6800 S. U.S. Hwy. 75",
  "OperatorStr2": null,
  "OperatorCity": "Sherman",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75090",
  "OperatorZipCodeExt": "3490",
  "FTE": 450,
  "OtherEPAFacilityID": "TXR000012898",
  "EPAFacilityID": "100000183204",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-06-10 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Reactive gas pad",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-08-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-08-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-08-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-03-07 00:00:00",
  "DeRegistrationEffectiveDate": "2011-12-01 00:00:00",
  "AnniversaryDate": "2008-08-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 33.55556,
  "FRS_Long": -96.61111,
  "FRS_Description": "AIR RELEASE STACK",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41287,
      "AltID": "Epi reactive gas pad",
      "FacilityID": 28695,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 54377,
          "ProcessID": 41287,
          "ChemicalID": 54,
          "Quantity": 21000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 54378,
          "ProcessID": 41287,
          "ChemicalID": 153,
          "Quantity": 56000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 42223,
          "ProcessID": 41287,
          "NAICSCode": "334413",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 23539,
              "Process_NAICS_ID": 42223,
              "SafetyReviewDate": "2003-07-23 00:00:00",
              "PHA_Date": "2003-04-10 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-09-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Water Cannon - Vapor supression system",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "This is the initial RMP submittal which required the first PHA.",
              "OpProceduresReviewDate": "2003-07-23 00:00:00",
              "TrainingReviewDate": "2003-07-23 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-07-23 00:00:00",
              "EquipmentInspectionDate": "2003-07-23 00:00:00",
              "EquipmentTested": "07/23/03",
              "ChangeMgmtDate": "2003-07-23 00:00:00",
              "ChangeMgmtReviewDate": "2003-07-23 00:00:00",
              "PreStartupReviewDate": "2003-07-23 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-02-05 00:00:00",
              "HotWorkPermitReviewDate": "2003-06-03 00:00:00",
              "ContractorSafetyReviewDate": "2003-07-23 00:00:00",
              "ContractorSafetyEvalDate": "2003-07-23 00:00:00",
              "CBI_Flag": 0,
              "Description": "MEMC-SW uses a systematic and proactive approach to prevent accidental releases of hazardous materials. Our process safety management systems address each of the essential features of successful prevention programs including:\n\n* Process Safety Information\n* Process Hazard Analysis\n* Operating Procedures\n* Employee Training\n* Preventative Maintenance and Mechanical Integrity\n* Management of Change\n* Pre-startup Reviews\n* Compliance Audits\n* Incident Investigation\n* Employee Participation\n* Permit to Work Systems including Hot Work Permits\n* Contractor Qualification and Safety Programs\n\nAs part of out prevention efforts, we have implemented the following chemical-specific prevention factors:\n\n* All changes to the process systems must be reviewed and approved by specialists in engineering, process technology, operations, maintenance, and environmental, safety and health.\n* All process systems are included in comprehensive, documented preventative maintenance and mechanical integrity programs.\n* All employees must successfully complete comprehensive training programs to be qualified to work with the related processes and equipment.",
              "_chemicals": [
                {
                  "PrimaryKey": 34617,
                  "PreventionProgram3ID": 23539,
                  "ProcessChemicalID": 54377
                },
                {
                  "PrimaryKey": 34618,
                  "PreventionProgram3ID": 23539,
                  "ProcessChemicalID": 54378
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 28695,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2003-07-22 00:00:00",
    "ERTrainingDate": "2003-05-21 00:00:00",
    "CoordinatingAgencyName": "Sherman Fire Department",
    "CoordinatingAgencyPhone": "9038927263",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28695,
      "SummaryText": "MEMC Southwest - Risk Management Plan\n\nExecutive Summary\nJuly 2003\n\n\nIntroduction\n\nMEMC Southwest, Inc. (MEMC-SW) located at 6800 U.S. Highway 75 South in Sherman, Texas is submitting this Risk Management Plan (RMP) in accordance with section 112(r) of the federal Clean Air Act for two regulated substances: Trichlorosilane and anhydrous Hydrogen Chloride.  The MEMC-SW facility currently employs approx. 450 people to manufacture pure crystalline silicon wafers for the semiconductor industry. MEMC-SW is subsidiary of MEMC Electronic Materials, Inc, headquartered in St. Peters, Missouri. \n\n\nAccidental Release and Emergency Response Policies\n\nMEMC-SW's practice of chemical safety is reflected in the following MEMC corporate Environmental, Safety and Health Policy: \"MEMC Electronic Materials, Inc will strive to achieve an injury-free and healthful workplace for our employees, ensure the safety of our community neighbors, and work toward zero-effect on the surrounding environment at each of our operating locations worldwide.\"  Additionally, MEMC-SW has an effective Environmental Management System, which received ISO-14001 registration in 2001.\n\nMEMC-SW is committed to operating the plant and maintaining all of our processes in a safe and responsible manner.  We use a combination of engineering controls, prevention and emergency response programs to help ensure the safety of our employees and the community to ensure the protection of the environment. \n\nFacility Processes and use of Regulated Substances\n\nMEMC-SW produces crystalline silicon wafers using amorphous polycrystalline silicon as the raw material. First, the polysilicon is heated in graphite furnaces until it melts, then a small \"seed\" silicon crystal approx. 4-inches long and 1/2-inch in diameter is slowly lowered into the melt. The silicon atoms contained in the molten polysilicon align with the silicon atoms contained in the crystal seed and \"freeze\" or solidify with the same crystal orientation as atoms in the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28695,
      "SummaryText": " seed crystal. This freezing process forms a single silicon crystal shaped as a cylindrical rod or ingot, which is slowly pulled from the molten polysilicon by a cable attached to the seed. This \"pulling\" process continues until the silicon ingot reaches the desired length and diameter for further processing. After the crystal silicon ingot cools, it is ground to the desired diameter and then sliced into wafers. The wafers then follow many processes ranging from lapping, polishing, final cleaning, inspection and finally to packing in preparation for shipment to the semiconductor (chip) manufacturer.\n\nSome customers require a second silicon crystal layer to be grown on the surface of the polished silicon crystal wafer.  This second crystal layer is called the \"Epitaxial Layer\" or \"Epi Layer\" and has different electrical properties from the original silicon crystal wafer substrate. The electronic characteristics provided by the epi layer allow the manufacture of special purpose semiconductor devices such as memory products and are required by most semiconductor device manufacturing companies. In order to operate the epi process efficiently, MEMC-SW requires that two chemicals listed in section 112(r) to be are stored in quantities that trigger this RMP. The chemicals that trigger this RMP are Trichlorosilane due to flammability and anhydrous Hydrogen Chloride due to toxicity. \n\nThe epi layer is grown on the silicon wafer substrate in a multi-chambered reactor under high-temperature. The following is a list of the main chemicals used in the epi process and the function each chemical performs:\n\nTrichlorosilane (TCS) - TCS is the source of the silicon that creates the epi layer. This chemical will be stored in quantities of up to 56,000 pounds in one double-walled aboveground tank. \n\nAnhydrous Hydrogen Chloride - Used to clean excess silicon growth from the reactor's chambers between wafer runs. It will be stored in a tube trailer that holds seven individual tubes. Each "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28695,
      "SummaryText": "tube contains 3000 pounds of anhydrous hydrogen chloride; therefore, the maximum total storage quantity of anhydrous hydrogen chloride is 21,000 pounds.\n\nHydrogen - Used as a carrier gas for TCS and dopant. Hydrogen is also used as a reducing agent in the process.\n\n\"Dopant\" gas - A semiconductor dopant is usually an element with electrical properties similar to silicon, which when used in small quantities, alters the electron's behavior inside the epi layer.  Usually a small quantity of Diborane is injected into the hydrogen carrier stream to supply the epi dopant, however other chemicals can also be used.\n\nNitrogen - Used as an inert purging gas for the process. \n\nArgon - An inert gas used to push the trichlorosilane from the tank to the process.\n\n\nWorst Case and Alternative Release Scenarios\n\nThe RMP rule requires that we provide information about the worst-case and alternative release scenarios for the listed chemicals used at our facility. The following are summaries of these scenarios:\n\nThe chemical release scenarios were modeled using two of the U.S. Environmental Protection Agency's approved atmospheric release modeling software programs. The \"Area LOcation of Hazardous Atmospheres\" (ALOHA) model was used for both the hypothetical Worst-Case and Alternative Case release of anhydrous hydrogen chloride and the RMP*Comp? software was used for both the Worst-Case and Alternative Case release of trichlorosilane.\n\nThe trichlorosilane Worst-Case event involved the release of 56,000 pounds of the chemical from the storage tank within ten minutes and was modeled using RMP*Comp? as a \"Vapor Cloud Explosion\". The alternative release case involved a 56,000 pounds released from the tank in 60 minutes and was modeled as a \"Pool Fire\".  The results of these events along with the release assumptions are detailed in this RMP.\n\nThe anhydrous hydrogen chloride Worst-Case event involves a similar incident where 21,000 pounds of the chemical were released from a tube trailer with"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28695,
      "SummaryText": "in ten minutes.  The alternative release scenario included a sixty-minute chemical release of a single 3000-pound tube that would be typical of a smaller leak from the tube trailer. The alternative event is more realistic because of the consideration for detailed safe handling and risk mitigation procedures already in place. Both the worst-case and alternative-case events for HCl were modeled using the ALOHA software program using the dense gas modeling assumption. This assumption was ALOHA's default parameter based on the physical properties of anhydrous hydrogen chloride which are stored in its internal database.\n\nThe Worst-Case modeling for both the trichlorosilane and the anhydrous hydrogen chloride assumed no mitigating actions or operational controls to minimize the release as required by the EPA guidance document. \n\nGeneral Release Prevention Program \n\nMEMC-SW uses a systematic and proactive approach to prevent accidental releases of hazardous materials. Our process safety management systems address each of the essential features of successful prevention programs including:\n\n* Process Safety Information\n* Process Hazard Analysis\n* Operating Procedures\n* Employee Training\n* Preventative Maintenance and Mechanical Integrity\n* Management of Change\n* Pre-startup Reviews\n* Compliance Audits\n* Incident Investigation\n* Employee Participation\n* Permit to Work Systems including Hot Work Permits\n* Contractor Qualification and Safety Programs\n\nAs part of our prevention efforts, we have implemented the following chemical-specific prevention factors:\n\n* All changes to the process systems must be reviewed and approved by specialists in engineering, process technology, operations, maintenance, and environmental, safety and health.\n* All process systems are included in comprehensive, documented preventative maintenance and mechanical integrity programs.\n* All employees must successfully complete comprehensive training programs to be qualified to work with the related process"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28695,
      "SummaryText": "es and equipment.\n\nFive-Year Accident History\n\nRecords for all significant incidents are maintained at our facility. These records include the results of formal investigations for each incident as well as the identification and correction of the root causes of the events. Since this facility began operation in 1997, the epi process has been storing and using small quantities of both trichlorosilane and anhydrous hydrogen chloride. No significant release of either chemical has occurred since start-up.\n\nEmergency Response Program\n\nIn case of an emergency involving any of the hazardous material at MEMC-SW, the response would be handled through an integrated response involving on-site and off-site resources. The plant maintains a trained hazardous materials response team. The team receives 40 hours of training when they join the team, with on-going refresher training. Other employees trained in process specifics are available as needed. Both the City of Sherman Fire Department and the HAZ-MAT team of SET Inc., a local environmental services company, are available to respond to emergencies.\n\nPlanned Changes to Improve Safety\n\nDue to the safe operating history of the plant and consistent process application, no new safety systems are scheduled to be implemented. However, the plant undergoes routine reviews of the existing safety systems. The following is a list of routine safety review activities:\n\n* Conduct review of work procedures and system operations every three and five years, in accordance with the Federal Process Safety Management rules.\n* Continual process hazard analysis to identify potential problems and implement changes\n* Continuous systems maintenance.\n* Conducting periodic audits of all systems"
    }
  ]
}