{
  "FacilityID": 28782,
  "FacilityName": "DSM Pharma Chemicals South Haven",
  "FacilityStr1": "1421 Kalamazoo Street",
  "FacilityStr2": null,
  "FacilityCity": "South Haven",
  "FacilityState": "MI",
  "FacilityZipCode": "49090",
  "Facility4DigitZipExt": "1945",
  "FacilityCountyFIPS": "26159",
  "LEPC": "Van Buren County Emergency Mgt",
  "FacilityLatDecDegs": "42.383333",
  "FacilityLongDecDegs": "-86.273333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 80361454,
  "ParentCompanyName": "DSM Pharmaceutical Products",
  "Company2Name": null,
  "CompanyDUNS": 884778879,
  "Company2DUNS": 0,
  "OperatorName": "DSM Pharma Chemicals, Inc.",
  "OperatorStr1": "1421 Kalamazoo Street",
  "OperatorStr2": null,
  "OperatorCity": "South Haven",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49090",
  "OperatorZipCodeExt": "1945",
  "RMPContact": "Mark Mielke",
  "RMPTitle": "Environmental Manager",
  "FTE": 158,
  "OtherEPAFacilityID": "49090WYCKF1421K",
  "EPAFacilityID": "100000183366",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-06-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "South Haven, Michigan",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-08-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-08-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-08-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-08-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 42.38358,
  "FRS_Long": -86.27551,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41391,
      "AltID": "Isoamylene Storage",
      "FacilityID": 28782,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 42327,
          "ProcessID": 41391,
          "NAICSCode": "325411",
          "_desc": {
            "NAICS_CODE": "325411",
            "NAICS_DESCRIPTION": "Medicinal and Botanical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 54490,
          "ProcessID": 41391,
          "ChemicalID": 155,
          "Quantity": 41000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 37822,
              "ProcessChemicalID": 54490,
              "ChemicalID": 141,
              "_chemical": {
                "ChemicalID": 141,
                "ChemicalName": "2-Methyl-1-butene",
                "CASNumber": "563-46-2",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 554490,
          "ProcessID": 41391,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 41392,
      "AltID": "Compressed Gas Storage",
      "FacilityID": 28782,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 42328,
          "ProcessID": 41392,
          "NAICSCode": "325411",
          "_desc": {
            "NAICS_CODE": "325411",
            "NAICS_DESCRIPTION": "Medicinal and Botanical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 54491,
          "ProcessID": 41392,
          "ChemicalID": 5,
          "Quantity": 17000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 5,
            "ChemicalName": "Methyl chloride  [Methane, chloro-]",
            "CASNumber": "74-87-3",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 54492,
          "ProcessID": 41392,
          "ChemicalID": 54,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 54,
            "ChemicalName": "Hydrogen chloride (anhydrous) [Hydrochloric acid]",
            "CASNumber": "7647-01-0",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 554491,
          "ProcessID": 41392,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 554492,
          "ProcessID": 41392,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 41393,
      "AltID": "Isopropylamine Storage",
      "FacilityID": 28782,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 42329,
          "ProcessID": 41393,
          "NAICSCode": "325411",
          "_desc": {
            "NAICS_CODE": "325411",
            "NAICS_DESCRIPTION": "Medicinal and Botanical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 54493,
          "ProcessID": 41393,
          "ChemicalID": 109,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 109,
            "ChemicalName": "Isopropylamine [2-Propanamine]",
            "CASNumber": "75-31-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 554493,
          "ProcessID": 41393,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28782,
      "SummaryText": "DSM PHARMA CHEMICALS, INC.\nSOUTH HAVEN, MI\nRISK MANAGEMENT PLAN\nEXECUTIVE SUMMARY\n\n1. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nDSM Pharma Chemicals, Inc. (DSM) has always acknowledged its responsibility to provide its employees  with a safe working environment and to be a responsible corporate citizen to the surrounding community. DSM strives to meet or exceed applicable EPA and OSHA rules and regulations.  As part of this commitment, DSM periodically evaluates the quality of its environmental and safety programs.\n\nDSM applies risk management by using a multi-layered approach for protective systems.  Minimization of risk due to process incidents is achieved by the independence of the layers of protection employed and the unlikelihood of simultaneous failure of several such layers.  The following is the order of the protection-layered system:\n\n1. Basic Process Control\n2. Engineered Shut Down Systems\n3. Active Release Protection (scrubber, sprinkler system)\n4. Passive Release Protection (dikes, barriers)\n5. Plant Emergency Response\n6. Response from Outside Authorities\n\nThe protective layer concept places initial reliance on the process operation itself followed as needed by various layers of protective systems.  These protective layers include engineered process shutdown systems, followed by release controlling systems.\n\nShould the inner layers of safety protection fail to prevent or sufficiently mitigate the incident?s effect, both on-site and off-site, then emergency response protection layers may be necessary.  \n\nThe facility's accident prevention and emergency response procedures have been designed for successful risk management and is a blend of sound organizational practices that prevent or mitigate incidents including operating procedures, employee training, preventative maintenance, management of change, process hazard analysis, any other human factor components.  \n\nDSM has integrated its emergency response procedures with those of the So"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28782,
      "SummaryText": "uth Haven Fire Department and the Van Buren County Emergency Management Committee.\n \nThe facility contact for DSM's risk management program is Mr. Mark Mielke, Environmental Manager. He can be contacted at 269-637-8474 (main).\n\n\n2. STATIONARY SOURCE INFORMATION AND REGULATED SUBSTANCES HANDLED\n\nA division of DSM Pharmaceuticals, Inc., DSM Pharma Chemicals, Inc. is located at 1421 Kalamazoo Street, South Haven, Michigan (Van Buren County).   Employing approximately 150 staff, DSM manufactures specialty organic chemicals, most of which are sold in bulk form to the pharmaceutical industry. \n\nThe South Haven facility currently has three processes covered in the risk management program.  Two of the processes are program level 3 and one process is program level 1.  The three covered processes contain four regulated substances, which are used as raw materials in the manufacture of pharmaceutical products. The covered processes and their regulated substances are summarized below:\n\n- Process #1: On-site storage and handling of isoamylene, which is a mixture of 2-methyl-2-butene and 2-methyl-1-butene.  Isoamylene is stored as a liquid at ambient conditions.  The risk management program rule regulates this substance as a flammable mixture.  The maximum expected inventory of isoamylene in this process is 41,000 lb.  Process #1 is a RMP program level 3 process.\n\n- Process #2: On-site storage and handling of compressed gas cylinders containing methylene chloride and hydrogen chloride.  The risk management program rule regulates these substances as toxics.  The maximum expected inventory of these materials is 12,000 and 14,000 pounds, respectively.  Process #1 is a RMP program level 3 process.\n\n- Process #3: On-site storage and handling of isopropylamine, stored as a liquid in 55-gallon drums.  The risk management program rule regulates this substance as a flammable.  The maximum expected inventory of isopropylamine is 18,000 pounds.  Process #1 is a RMP program level 1 process.\n\n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28782,
      "SummaryText": "\n3. WORST-CASE RELEASE SCENARIOS AND ALTERNATIVE RELEASE SCENARIOS\n\nIn estimating the worst case scenarios, EPA requires that the entire contents of the largest storage vessel will be released without the aid of active mitigation systems and safe work practices.  This is intended to ensure that no potential risks to public health are overlooked.  In addition to the worst case release scenario, alternate release scenarios are also in the risk management plan. Alternate release scenarios may consider any active or passive mitigation measures associated with the covered process.\n\nDSM referred to the OCA guidance manual and U.S. Census software to estimate the impacts of worst-case release and alternate release scenarios for the regulated substances. The RMP rule requires that the following release scenarios be reported:\n- Hydrogen chloride: Worst-case release scenario and alternative release scenario.\n- Methyl chloride: Alternative release scenario only. Since methyl chloride and hydrogen chloride are in the same process and the worst-case release distance to endpoint for methyl chloride is within that for hydrogen chloride, a worst-case release scenario is not required to be reported for methyl chloride.\n- Isoamylene (flammable mixture): Worst-case release scenario and alternative release scenario.\n- Isopropylamine: Worst-case release scenario only. Since the isopropylamine process is RMP program level 1, an alternative release scenario is not needed.  \n\nThe following paragraphs summarize the results of the worst-case release and alternative release scenarios.\n\n*Hydrogen Chloride Worst-Case Scenario\n\nUsing EPA's OCA Guidance Reference Tables or Equations, the distance to endpoint for a worst-case hydrogen chloride gas release without any mitigation is 1.1 miles.  The distance to endpoint calculations are based on a released amount of a full 600-lb cylinder at a rate of 60 pounds per minute for ten minutes.  Public receptors are located within the distance to endpoint "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28782,
      "SummaryText": "of this worst-case release scenario.\n\n*Hydrogen Chloride Alternative Release Scenario\n\nUsing EPA's OCA Guidance Reference Tables or Equations, the distance to endpoint for an alternate release scenario (ARS) for a hydrogen chloride gas leak is 0.3 miles.  The distance to endpoint calculations are based on an assumed failure of the cylinder plug and subsequent vapor release from a full cylinder.  Public receptors are located within the distance to endpoint of this alternative release scenario.\n\n*Methyl Chloride Alternative Release Scenario\n\nUsing EPA's OCA Guidance Reference Tables or Equations, the distance to endpoint for an alternate release scenario (ARS) for a methyl chloride gas leak is 0.1 miles.  The distance to endpoint calculations are based on an assumed failure of the cylinder plug and subsequent vapor release from a full cylinder.  Public receptors are not located within the distance to endpoint of this alternative release scenario.\n\n*Isoamylene (Flammable Mixture) Worst-Case Scenario\n\nUsing EPA's OCA Guidance Reference Tables or Equations, the distance to endpoint for a worst-case isoamylene vapor cloud explosion is 0.11 miles.  The distance to endpoint calculations are based on vapor cloud explosion from a released amount of 2,571 pounds to an EPA-specified overpressure endpoint of 1-psi.  The release amount is based on the volatilization of isoamylene in 10 minutes from the tank dike assuming that the contents of a full tank immediately spill into the dike.  Public receptors are located within the range of the worst-case distance to endpoint.\n\n*Isoamylene (Flammable Mixture) Alternative Release Scenario\n\nUsing EPA's OCA Guidance Reference Tables or Equations, the distance to endpoint for an alternate release scenario (ARS) for isoamylene is 0.05 miles. The distance to endpoint calculations are based on a pool fire in the isoamylene tank dike to an EPA-specified radiant heat level of 5 kW per square meter for 40 seconds. Public receptors are located wi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 28782,
      "SummaryText": "procedures that shall be implemented when the emergency siren is activated due to a chemical release, spill, fire, explosion, or run-away reaction.  While the prevention of a site emergency is DSM's goal, it is also recognized that employees must have adequate training to enable them to respond appropriately in the event a site emergency occurs.  \n\nPlanning for a site emergency is a continuous process, starting with prevention and including preparedness, and response.  DSM takes seriously its civic responsibility and tries diligently to comply with all requirements\n\nTo help maintain an effective ERP, DSM has established and seeks to maintain a productive working relationship with the Local Emergency Planning Committee and the local fire department. Also, DSM regularly trains employees and keeps several up-to-date copies of the ERP in areas accessible to all personnel.\n\n\n7. PLANNED CHANGES TO IMPROVE SAFETY\n\nDSM believes in emphasizing environmental and safety training. We will continue to assess the environmental impact of each of our processes and propose to design, build, operate and maintain our operations so they remain safe and acceptable to local communities and are protective of the environment."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28782,
      "SummaryText": "thin the distance to endpoint of this alternative release scenario.\n\n*Isopropylamine Worst-Case Scenario\n\nUsing EPA's OCA Guidance Reference Tables or Equations, the distance to endpoint for a worst-case isoamylene vapor cloud explosion is 0.05 miles.  The distance to endpoint calculations are based on vapor cloud explosion from a full 55-gallon (305-lb) drum to an EPA-specified overpressure endpoint of 1-psi.  No public receptors are located within the range of the worst-case distance to endpoint.\n\n\n4. ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nDSM is subject to the following safety and emergency response regulations:\n\n1. OSHA Regulations at 29 CFR 1910.38\n2. OSHA Regulations at 29 CFR 1910.120\n3. MIOSHA Standard 29 CFR 1910.119\n4. Clean Water Act Regulations at 40 CFR 112\n5. RCRA Regulations at 40 CFR 112\n6. State EPCRA Rules\n\nDSM has established several emergency prevention and response programs to ensure the safety of its employees and the surrounding community.  Among these are guidelines explaining fire prevention and general housekeeping practices, evacuation and alarm system instruction, back-up notification systems and emergency coordinator and first responder (HAZWOPER) guidelines. All of these publications are included in DSM's Emergency Response Plan (ERP).\n\nDSM also provides regular employee emergency and preventative training. Topics covered in mandatory new in-plant employee training include the following topics:\n\n1. Emergency Action and Response Plan;\n2. Safe Handling of Hazardous Waste;\n3. HazMat Training to the Awareness Level;\n4. Hazard Communication/Right-to-Know;\n5. Respiratory Training; and\n6. Operation and use of Fire Extinguishers.\n\n\n5. FIVE-YEAR ACCIDENT HISTORY\n\nDSM has not had any reportable accidental releases in the last five years as defined by 40 CFR Part 68, General Guidance for Risk Management Programs. \n\n\n6. EMERGENCY RESPONSE PROGRAM\n\nThe Emergency Action and Response Plan (ERP) provides specific "
    }
  ]
}