{
  "FacilityID": 28796,
  "FacilityName": "Foster Farms Turkey Products Plant 1 (7/03 Rev.)",
  "FacilityStr1": "500 F Street",
  "FacilityStr2": null,
  "FacilityCity": "Turlock",
  "FacilityState": "CA",
  "FacilityZipCode": "95380",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06099",
  "LEPC": null,
  "FacilityLatDecDegs": "37.486389",
  "FacilityLongDecDegs": "-120.846111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "UN",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 193426202,
  "ParentCompanyName": "Foster Poultry Farms",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Foster Poultry Farms",
  "OperatorStr1": "500 F Street",
  "OperatorStr2": null,
  "OperatorCity": "Turlock",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95380",
  "OperatorZipCodeExt": null,
  "FTE": 900,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000127846",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "N-1841-1-0",
  "SafetyInspectionDate": "2003-07-10 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-08-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-08-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-08-07 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-03-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 37.4856,
  "FRS_Long": -120.8442,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41411,
      "AltID": null,
      "FacilityID": 28796,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 54512,
          "ProcessID": 41411,
          "ChemicalID": 56,
          "Quantity": 45000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 42350,
          "ProcessID": 41411,
          "NAICSCode": "311615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 23594,
              "Process_NAICS_ID": 42350,
              "SafetyReviewDate": "1999-11-03 00:00:00",
              "PHA_Date": "1999-11-03 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-12-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Ammonia detection system with liquid solenoid valve shut offs and fire diffusion system for part of system",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "PHA recommendations are being reviewed by management",
              "OpProceduresReviewDate": "2003-05-22 00:00:00",
              "TrainingReviewDate": "2002-11-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-07-01 00:00:00",
              "EquipmentInspectionDate": "2003-08-07 00:00:00",
              "EquipmentTested": "Compressors",
              "ChangeMgmtDate": "2003-05-07 00:00:00",
              "ChangeMgmtReviewDate": "2002-11-01 00:00:00",
              "PreStartupReviewDate": "2003-05-22 00:00:00",
              "ComplianceAuditDate": "2002-04-29 00:00:00",
              "AuditCompletionDate": "2003-12-01 00:00:00",
              "IncidentInvestigationDate": "2003-04-07 00:00:00",
              "InvestigationChangeDate": "2003-06-13 00:00:00",
              "ParticipationPlansReviewDate": "2002-11-01 00:00:00",
              "HotWorkPermitReviewDate": "2002-11-01 00:00:00",
              "ContractorSafetyReviewDate": "2002-12-18 00:00:00",
              "ContractorSafetyEvalDate": "2002-08-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 34677,
                  "PreventionProgram3ID": 23594,
                  "ProcessChemicalID": 54512
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 28796,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-05-01 00:00:00",
    "ERTrainingDate": "2003-06-04 00:00:00",
    "CoordinatingAgencyName": "Turlock Fire Department",
    "CoordinatingAgencyPhone": "2096685580",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 28796,
      "SummaryText": "r modeling the alternative release scenario.\n\nThe RMP/PSM regulations require a review of the accidental release prevention program and chemical specific prevention steps used by the facility.  Foster Farms has incorporated many safety features in the ammonia refrigeration system to prevent system failures and to mitigate potential releases.  The predominant safety concern with closed-loop ammonia systems is an inadvertent buildup of pressure exceeding pressure ratings or capacities of equipment due to ammonia expansion.  The FTP 1 ammonia system is continuously monitored by automated control systems that shut down components if deviations from normal operating conditions occur.  \n\nOther safety features at the facility include: \n·emergency shutdown systems\n·component specific safety shutdowns\n·pressure relief valves on all vessels, compressors, and several other areas in the system where trapped ammonia could build pressure\n·ammonia detection system is connected to an automatic phone dialing system\n·activation of ammonia detection system closes liquid solenoid valves to production area ammonia equipment\n·engine rooms are equipped with ammonia detection systems\n·new engine room is equipped with emergency shut down switch\n·engine rooms are equipped with ventilation systems\n·many of the ammonia pipes, valves and components are labeled\n·a fire sprinkler system is installed in the majority of the plant including the engine rooms\n·operators receive ongoing training in operations, maintenance and emergency response\n\nIn addition to the physical features of the ammonia refrigeration system at the facility, Foster Farms has extensive administrative controls in place to maintain safe operation of the system.  Administrative controls include, but are not limited to, formal training programs for system operators and mechanics, emergency training, a hot work permit program, a lockout/tagout program, a contractor safety program, incident investigation program, mechanical integrity"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28796,
      "SummaryText": "program, management of change program, pre start-up safety review program, and a RMP/PSM auditing and inspection program.  Written standard operating procedures (SOPs) have been prepared for the ammonia system at the facility.  The SOPs provide a basis for site specific operator training and a ready reference for operating and trouble-shooting the systems.\n\nFoster Farms is committed to maintaining the mechanical integrity of the ammonia refrigeration system.  A computerized preventive maintenance system is utilized to manage the maintenance of the refrigeration system.  Preventive maintenance at the facility includes daily, weekly, and periodic inspection; calibration; testing; and overhaul of ammonia system equipment.  The system is used to track equipment performance and to create reports that are used by maintenance personnel to monitor the frequency of repairs and deviations from normal operating parameters.\n\nChanges to improve safety at the facility are ongoing.  Many of the mitigation measures suggested by the process hazard analysis team have already been implemented.  Others will be implemented during the next several months.  The status of significant mitigation measures is as follows:\n·preventive maintenance program is being reviewed to verify that all ammonia system components are included and maintenance frequencies are appropriate\n·management is evaluating the installation of a PRV relief header \n·management is evaluating the installation of an emergency shut down switch for the old Engine Room\n·management is evaluating the installation of an exit directly to the outside from the old Engine Room\n\nFoster Farms will respond to all suggested mitigation measures promptly and is scheduling completion of proposed actions.  Management responses and support will be consistent with Foster Farms' commitment to safe and environmentally responsible operations.\n\nFoster Farms recognizes that the RMP/PSM is a continuous process for evaluating, monitoring, and improvi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 28796,
      "SummaryText": "ng anhydrous ammonia handling operations at its facility.  As such, this document and related attachments and program elements will evolve as Foster Farms continues their ongoing focus and dedication of risk minimization and safety improvement for their employees and surrounding community.  Foster Farms will submit revised information if a change occurs that is considered significant and requires resubmission under the regulations.  However, minor improvements/modifications to the RMP/PSM and related attachments and program elements will be incorporated consistent with Foster Farms¿ internal review practices, and Foster Farms will maintain the most current versions on site.  Thus, the most current version RMP/PSM, related documents, and elements maintained on site may vary slightly from the information in submittals made to EPA and other regulatory agencies."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28796,
      "SummaryText": "he appropriate response measures, relying on support services provided by the local fire department and hazardous materials response team.\n\nFTP 1 is located at 500 F Street in Turlock, California.  The surrounding area consists of industrial and commercial businesses, residential development, and small agricultural properties.  The site is bordered by F Street to the northwest, 5th Street to the northeast, industrial businesses and residential development to the southeast and southwest. FTP 1 is approximately one mile east of Highway 99 and one quarter mile west of Golden State Boulevard.\n\nThe facility was originally constructed in the late-1950s.  The refrigeration system was remodeled in the mid and late-1980s.  Foster Farms purchased the plant from Butterball Turkey Company in July 1999.  Operations at the facility consist of the slaughtering, storage, processing, packaging, and distribution of poultry products.  The facility is surrounded by chain-link fencing and is staffed by a refrigeration operator or mechanic 24 hours per day, 365 days per year.\n\nAnhydrous ammonia is used in a refrigeration system at the facility.  The refrigeration system, which is a closed system, contains approximately 45,000 pounds of anhydrous ammonia.  The system provides cooling for production areas, product, and water chilling.  The desired temperatures are maintained by controlling the flow of ammonia with manually and electrically operated valves, float switches, and compressor controls.  \n\nThe RMP/PSM regulations require a review of the five-year accident history at the regulated facility.  The Foster Farms has facility reported no accidental releases of ammonia within the past five years meeting the criteria of 40 CFR Part 68.42(a). \n\nThe RMP regulations require facilities to identify and evaluate chemical release scenarios resulting from potential failures of the chemical handling systems covered by the RMP.  Program 3 requirements of the RMP apply to the Foster Farms facil"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 28796,
      "SummaryText": "FOSTER POULTRY FARMS\nFOSTER TURKEY PRODUCTS PROCESSING PLANT 1\nRISK MANAGEMENT PROGRAM AND\nPROCESS SAFETY MANAGEMENT PROGRAM\nAnhydrous Ammonia Refrigeration System\n\nRevised July 2003\n\nEXECUTIVE SUMMARY\n\nFoster Turkey Products Processing Plant 1 (referred to hereafter as Foster Farms or FTP 1) revised this document, previously submitted in March 2000, due to an updated and revised offsite consequence analysis and regulatory requirements requiring re-submittal.\n\nFoster Farms prepared a Chemical Risk Management Program and Process Safety Management Program (RMP/PSM) in general accordance with state and federal regulations.  The state risk management regulations, also referred to as the California Accidental Release Prevention (CalARP) program, are codified in California Code of Regulations (CCR), Title 19, Section 2735.1, et. Seq.  The Environmental Protection Agency (EPA) also regulates facilities with certain toxic and flammable substances.  The regulations are codified in Title 40 of the Code of Federal Regulations (CFR), Part 68.  Finally, both the Occupational Safety and Health Association (OSHA) and the California Occupational Safety and Health Association (CalOSHA) regulate facilities with certain acutely hazardous materials under the PSM regulations, as defined in CCR Title 8 Section 5189 and CFR Title 29 Part 1910 Section 119, respectively.\n\nFoster Farms prepared the RMP/PSM to satisfy regulatory requirements and to demonstrate a commitment to evaluate and improve anhydrous ammonia handling systems and practices at the facility. Many state-of-the-art safety features were incorporated into the ammonia refrigeration system at the facility as part of the original construction and during system modifications.  Foster Farms will continue to improve ammonia-handling safety through the implementation of the prevention program elements of the RMP/PSM.  In the unlikely event that a chemical release does occur at the facility, Foster Farms personnel are trained in t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28796,
      "SummaryText": "ity due to the quantity of ammonia used.  Program 3 facilities are required to evaluate a worst-case release scenario (release parameters are defined by the regulations) and an alternative release scenario.  The regulations define a worst-case release scenario as ¿¿the greatest amount held in a single vessel¿released as a gas over 10 minutes.¿  An alternative release scenario is identified as a release that is more likely to occur at the facility.\n\nThe largest ammonia vessel at FTP 1 is the high-pressure receiver, which contains approximately 45,000 pounds at 80% of capacity ¿ the safe fill level for the vessel.  A release from the high-pressure receiver will escape directly to the atmosphere at ground level.  The worst-case release scenario for the facility is a release of 45,000 pounds of ammonia in 10 minutes. Catastrophic failure of the high-pressure receiver is required for this scenario to occur.  As required by the RMP regulations, pessimistic atmospheric conditions, very conservative chemical dispersion characteristics, and a toxic endpoint of 200 parts per million (ppm) ammonia vapor were assumed.  The SLAB Model was used for modeling the worst case release scenario.  SLAB was first developed by Lawrence Livermore National Laboratory under contract with the U.S. Department of Energy.  SLAB has been revised and updated by the USAF Engineering and Services Center and the American Petroleum Institute.  SLAB is commonly used to simulate the atmospheric dispersion of denser-than-air releases.\n\nFoster Farms used the alternative release scenario described in the EPA's Model Risk Management Program and Plan for Ammonia Refrigeration, November 1998.  The release scenario is described as a ¼-inch effective diameter orifice leaking liquid ammonia and resulting in an airborne release, representative of a pipe connection leak or a gasket rupture.  The evaluation used a release rate of 78.8 pounds per minute and average weather conditions. The SLAB Model was used also fo"
    }
  ]
}