{
  "FacilityID": 28857,
  "FacilityName": "South Coles Levee Gas Plant - Central Resources",
  "FacilityStr1": "10 Miles West Old River Rd, Hwy 119",
  "FacilityStr2": "25761 Hwy 119",
  "FacilityCity": "Tupman",
  "FacilityState": "CA",
  "FacilityZipCode": "93276",
  "Facility4DigitZipExt": "0219",
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.251722",
  "FacilityLongDecDegs": "-119.279639",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "AO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "dgibson@centralresources.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Central Resources, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Central Resources, Inc.",
  "OperatorStr1": "1775 Sherman Street",
  "OperatorStr2": "Suite 2600",
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80203",
  "OperatorZipCodeExt": "4313",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000112576",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "s-40",
  "SafetyInspectionDate": "2001-08-01 00:00:00",
  "SafetyInspectionBy": "calOSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-08-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-08-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-08-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2017-03-08 00:00:00",
  "DeRegistrationEffectiveDate": "2017-02-07 00:00:00",
  "AnniversaryDate": "2007-04-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 35.251722,
  "FRS_Long": -119.279639,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41484,
      "AltID": "NGL Gas Plant",
      "FacilityID": 28857,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 54624,
          "ProcessID": 41484,
          "ChemicalID": 155,
          "Quantity": 1170756.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 37855,
              "ProcessChemicalID": 54624,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 37856,
              "ProcessChemicalID": 54624,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 37857,
              "ProcessChemicalID": 54624,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 37858,
              "ProcessChemicalID": 54624,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 42423,
          "ProcessID": 41484,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 28857,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-07-01 00:00:00",
    "ERTrainingDate": "2002-02-01 00:00:00",
    "CoordinatingAgencyName": "Kern County Fire Department",
    "CoordinatingAgencyPhone": "6618313467",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28857,
      "SummaryText": "South Coles Levee Gas Plant - Central Resources, Inc.\nRMP Submittal\n\nExecutive Summary\n\n\n·\tThe South Coles Levee Gas Plant was built in the 1940¿s.  It is currently owned and operated by CENTRAL RESOURCES, INC.\n·\t CENTRAL RESOURCES, INC. maintains a commitment to worker and public safety as evidenced by the resources invested in accident prevention and in the consideration of safety in the design, installation, operation and maintenance of the plant.  \n·\tCENTRAL RESOURCES, INC. maintains a code of safe work practices under the umbrella of the Illness and Injury Prevention Program (IIPP).\n·\tThe process plant is regulated under Cal OSHA Process Safety Management (PSM) Program, Title 8 California Code of Regulations Section 5189.  \n·\tThe CENTRAL RESOURCES, INC. PSM Program has fourteen elements paralleling the regulatory structure.  CENTRAL RESOURCES, INC. has in place programs, policies and procedures to address each of these 14 elements.  A brief summary of the CENTRAL RESOURCES, INC. PSM program is presented below.\n·\tEmployee Participation ¿ CENTRAL RESOURCES, INC. employees receive PSM training, are involved in Process Hazard Analyses, and participate in the Management of Change Process.\n·\tProcess Safety Information ¿ CENTRAL RESOURCES, INC. maintains plant mechanical and process information under the specification of the PSM program.  \n·\tProcess Hazard Analysis ¿ The facility has only been operated by CENTRAL RESOURCES, INC. since March of 2003, however prior operators have conducted an original PHA (1993) and one revalidation (1998).  The facility is due for a second revalidation in 2003.\n·\tOperating Procedures ¿ Prior operators of the facility programmed a computer-based system to handle operating procedures and operator training.  CENTRAL RESOURCES, INC. is in the process of updating this system. \n·\tTraining ¿ CENTRAL RESOURCES, INC. relies on a combination of classroom and computer based training for PSM purposes.\n·\tContractors ¿ CENTRAL RESOURCES, INC. requ"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28857,
      "SummaryText": "ires companies providing services to provide PSM trained and qualified personnel.  CENTRAL RESOURCES, INC. personnel review contractor safety and training programs.   In addition, all contractor employees and visitors working in or near the process areas are required to attend video based site-specific hazard awareness training.\n·\tPre-Job Start-Up Review ¿ As part of the Management of Change process CENTRAL RESOURCES, INC. will not allow new or modified equipment to be started up with the completion of Pre-Startup Safety Review (PSSR) form. \n\n·\tMechanical Integrity (MI) ¿ CENTRAL RESOURCES, INC. has in place a MI program that provides guideline and requirements for preventative maintenance and inspection of critical process equipment. The mechanical Integrity part of the prevention program includes ultrasonic testing of process lines and vessels.\n·\tHot Work Permit ¿ CENTRAL RESOURCES, INC. utilizes a Hot Work Permit system to control the use of fire or spark producing activity in process areas.\n·\tManagement of Change ¿ CENTRAL RESOURCES, INC. has in place a Management of Change policy that governs any change that may affect process safety.  CENTRAL RESOURCES, INC. personnel are trained in MOC procedures and involved in MOC execution.\n·\tIncident Investigation ¿ has a policy for prompt and effective investigation of all workplace injuries, incidents or near misses.  \n·\tEmergency Planning and Response ¿ The facility Emergency Response Plan was revised in February of 2002.  Tabletop training drills were conducted in training sessions attended by all CENTRAL RESOURCES, INC. employees at the facility.\n·\tCompliance Audits ¿ Prior owner/ operators have conducted compliance audits on the required three-year intervals.   The last was completed in December of 1999.  The next is due in December of 2002.\n·\tThe plant is functionally divided into three sections: Gas Plant, Compression Storage, and Refrigeration Skid.  The main function of the facility is to extract liquid hydrocar"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28857,
      "SummaryText": "bons and prepare produced gas for sales.  The natural gasoline liquids are stored in multiple pressure vessels, the largest being 80,000 gallons.  \n·\tCENTRAL RESOURCES, INC. maintains an emergency response plan in compliance with local emergency response agencies.  The South Coles Levee Gas Plant has a Hazardous Materials Business Plan on file with the Kern County Environmental Health Department and Certified Unified Program Agency.  \n·\tIn the event of an accidental release, the facility operators are trained to sound the alarm, contact 9-1-1, shut off the source from a safe location or activate one of the emergency shutdown devices, and secure the area.   The 9-1-1 system is used to notify the Fire Department.\n·\tBased on the criteria of 40 CFR 68.10 and 19 CCR 2735.4, this facility has not had an accidental release in the last 5 years.  This information was verified by the reviewing records from the Certified Unified Program Agency.\n·\tThe worst-case release scenario of 389,645 pounds of liquefied petroleum gasoline liquids is based on the Environmental Protection Agency model.  The scenario indicates a 1-psi overpressure distance of 0.6 miles.  This distance does not impact public receptors. \n\n·\tThis is a remote facility.  All visitors onto the property must undergo a site safety orientation and check in prior to each visit.  \n·\tSeismic parameters were addressed by conducting a walkthrough of the facility and reviewing the mechanical integrity records.  There were no significant indications of deterioration. \n\n\nThe seismic walkthrough was conducted as a requirement of the California Accidental Release Prevention Program, 19 CCR 2735.  During the preliminary visits, it was believed that this facility would fall under a RMP/CalARP Program Level 3 due to the process safety management regulatory oversight.  However, after consideration of the remote location and discussions with the Certified Unified Program Agency, (Dale Hineman and Dan Starky, April 19, 1999), the So"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28857,
      "SummaryText": "uth Coles Levee Unit qualified as a Program Level 1.  External events analyses are not required for Program Level 1 filing.  \n\nThe seismic walkthrough consisted of a visual inspection the process area piping and vessels above grade.  Structural integrity below grade was not conducted.  Attached are the parameters used during the walkthrough and a plot map indicating the areas of the facility visually checked.  \n\nIn general, the physical condition of the facility is consistent with the original construction and subsequent modifications were built to design standards for the year of modification.  There were no significant findings.  Based on the document ¿Maps of Known Active Fault Near-Source Zones in California and Adjacent Portions of Nevada:  Uniform Building Code 1997,¿ this facility does not reside within the boundaries of a Type A or Type B Near Source Fault Zone."
    }
  ]
}