{
  "FacilityID": 28900,
  "FacilityName": "ConAgra Foods",
  "FacilityStr1": "4300 West 62nd Street",
  "FacilityStr2": null,
  "FacilityCity": "Indianapolis",
  "FacilityState": "IN",
  "FacilityZipCode": "46268",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18097",
  "LEPC": "Marion County LEPC",
  "FacilityLatDecDegs": "39.869167",
  "FacilityLongDecDegs": "-86.234167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.conagrafoods.com",
  "FacilityEmailAddress": "tom.stachura@conagrafoods.com",
  "FacilityDUNS": 108292624,
  "ParentCompanyName": "ConAgra, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 7258908,
  "Company2DUNS": 7258908,
  "OperatorName": "ConAgra Foods",
  "OperatorStr1": "4300 West 62nd Street",
  "OperatorStr2": null,
  "OperatorCity": "Indianapolis",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46268",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert Wojcik",
  "RMPTitle": "Plant Manager",
  "FTE": 250,
  "OtherEPAFacilityID": "46268FLSCH4300",
  "EPAFacilityID": "100000020693",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-10-23 00:00:00",
  "SafetyInspectionBy": "Fire Dept 10/23/01& Global Risk Consult'g 11/21/02",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-09-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-09-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-09-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-09-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 39.86732,
  "FRS_Long": -86.23276,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41540,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 28900,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 42479,
          "ProcessID": 41540,
          "NAICSCode": "311225",
          "_desc": {
            "NAICS_CODE": "311225",
            "NAICS_DESCRIPTION": "Fats and Oils Refining and Blending"
          }
        },
        {
          "Process_NAICS_ID": 42480,
          "ProcessID": 41540,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 54707,
          "ProcessID": 41540,
          "ChemicalID": 56,
          "Quantity": 65000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 554707,
          "ProcessID": 41540,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28900,
      "SummaryText": "RISK MANAGEMENT PROGRAM\nEXECUTIVE SUMMARY \nCONAGRA FOODS\n4300 West 62nd Street\nIndianapolis, Indiana\n\n\n1.0 INTRODUCTION\nA Risk Management Program has been implemented at ConAgra Foods (ConAgra) for the reduction of accidental releases of hazardous materials. This Program summarizes the management, administrative, procedural, and technological controls that work together to minimize the risk to site personnel, contractors, visitors, and the community and environment at large of hazardous chemical releases. The Risk Management Plan (RMP) is organized to correspond with specific U.S. Environmental Protection Agency (EPA) RMP, Program 3 of 40 CFR 68, definitions and requirements of Subpart G, including:\n\n?Introduction;\n?ConAgra policies to protect health, environment, and safety;\n?Facility identification and regulated substances covered processes;\n?Hazard Assessment;\n?Prevention Program;\n?Five-Year Accident History;\n?Emergency Response Plan; and\n?Planned changes to improve safety.\n\n\n2.0 CONAGRA?S POLICIES TO PROTECT HEALTH, ENVIRONMENT, AND SAFETY\nRisk management and safety are important concerns at ConAgra; this RMP formalizes and documents these activities. ConAgra is committed to conducting its operations in a safe and responsible manner and to reducing risks to human health and to the environment. It is ConAgra?s policy to comply with all applicable federal, state, and local rules and regulations.\n\nThis RMP has identified potential hazards and has taken steps to design and maintain a safe facility in order to prevent releases, and minimize the consequences of accidental releases, which could occur. RMP addresses potentially catastrophic chemical releases that could result in immediate harm and acute health effects to offsite receptors (public and environmental). The RMP includes the Facility?s Emergency Response Plan (ERP) that contains procedures, which are designed to maximize the safety of all employees, contractors, and visitors in the event of an emergency and "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28900,
      "SummaryText": "also guard against environmental consequences.\n\nAlthough ammonia is a listed toxic substance, it is also a ubiquitous material, which is used by the surrounding farmers for fertilizer. Pursuant to 40 CFR 68.125 Exemptions ? Ammonia used as an agricultural nutrient, when held by farmers, is exempt from all provisions of this part (40 CFR 68).\n\n\n3.0 FACILITY IDENTIFICATION AND REGULATED SUBSTANCE\nThe ConAgra facility is located at 4300 West 62nd Street in Indianapolis, Indiana. The facility produces table spread products. The facility uses ammonia for refrigeration, and is regulated under 40 CFR Part 68, the EPA RMP Rule. The amount of ammonia present in the refrigeration system is approximately 65,000 pounds, which is above the minimum threshold quantity of 10,000 pounds. The ammonia receiver tank is not near other tanks or processes. ConAgra is voluntarily updating this RMP approximately one year ahead of the required schedule.\n\n\n4.0 HAZARD ASSESSMENT ? WORST CASE SCENARIOS (WCS)\nWhile a catastrophic release is not expected to occur, as required by the Rule, Worst-Case and Alternative Release Scenarios were evaluated to estimate the potential offsite consequences (i.e., offsite consequence analysis (OCA)) to the public or the environment from the potential accidental release of ammonia. \n\nPursuant to the Rule, ?the greatest amount held in a single vessel, taking into account administrative controls that limit the maximum quantity? was used. The worst-case toxic accidental release scenario is a catastrophic failure of the primary ammonia high pressure (approximately 200 psig) receiver, which is administratively-controlled to hold a maximum of 36,000 pounds (80-percent vessel capacity). EPA?s Risk Management Program Guidance for Ammonia Refrigeration (EPA 550-B-00-006, May 2000) Exhibit 4-4, shows that under a worst-case release scenario ? whereby the entire 36,000-pound quantity of anhydrous ammonia is released in a 10-minute period, the toxic endpoint distance is 2."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28900,
      "SummaryText": "3 miles. The ERPG-2 airborne toxic endpoint concentration of 200 parts per million (ppm) or 0.14 mg/L is the maximum which it is believed that nearly all individuals can be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms that could impair an individual?s ability to take protective action. Based upon year 2000 census data, the population within a radius of 2.3 miles is 43,000.\n\nIt should be noted that the worst-case scenario is an extremely unlikely event especially since most of the time, the ammonia is distributed within the piping of many refrigeration subsystems within the facility building ? and is not contained within this large vessel.\n\n\n5.0 HAZARD ASSESSMENT ? ALTERNATIVE RELEASE SCENARIO (ARS)\nAn ARS was modeled for ammonia in the hazard assessment and assumes that a leak occurs in a pipe joint or weld. ?Guidance average? weather conditions including 3 meters per second wind speed and a D stability class at an ambient temperature of 25 degrees C were used. The simplified Bernoulli equation was employed in the ARS OCA. Using a conservative pressure of 180 pounds per square inch (gauge) with a hole-diameter of up to 0.37 inches, the continuous release rate would be 300 pounds per minute, which would result in a 200-ppm toxic endpoint distance of 0.1 miles (Guidance Tables: Exhibits 4-5 and 4-6) in this urban setting. No mitigation measures were considered.\n\nA small population group may be affected by the ARS due to the close proximity of commercial business to the facility; however, the LandView Census estimator did not indicate any offsite receptors.\n\n\n6.0 GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\nA prevention program is in place to minimize the risk of hazardous chemical releases in accordance with the OSHA Process Safety Management (PSM) standard (29 CFR 1910.119) and the EPA Risk Management Program. This prevention program covers those processes that handle ammonia above the thresho"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28900,
      "SummaryText": "ld quantity for both PSM and RMP rules.\n\nThe prevention program provides a structured approach to preventing accidents. Some of the specific activities in the prevention program include:\n\n?Process safety information is provided to all employees upon hire and is accessible at all times.\n?In-depth process hazard analyses are completed every five years by qualified personnel using techniques approved under the PSM standard.\n?Written operating procedures (kept up-to-date) are used for training and guiding the work of operators.\n?Training is provided to all employees upon hire, and refresher training is given annually or upon request.\n?Operators, mechanics, and contractor personnel are qualified, trained and in the general hazards in the facility, and informed of any temporary situations affecting safety.\n?Pre-startup safety reviews are conducted to insure that conditions for safe operation have been satisfied prior to starting new or modified equipment.\n?A program is in place to maintain the mechanical integrity of the process, which includes written procedures, training requirements, equipment deficiency requests for employees, work orders, scheduled maintenance, and computerized documentation.\n?A hot work permit system assures that work is done safely and properly.\n?A management of change system is in place to ensure that changes are managed safely.\n?Incidents are investigated and actions are taken as part of a continuous improvement effort.\n?Routine audits are conducted to assure that safe practices are being followed.\n\nThis systematic approach to process safety at ConAgra involves employees and strives for continuing improvements in overall safety. The training, qualifications, and safety awareness of our operations, maintenance, and management personnel are a key element in reducing and mitigating accidents.\n\nChemical-specific prevention steps include safety interlocks/alarms to prevent ammonia (1) overfilling (flooding) of various subsystem vessels; and (2) over-p"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 28900,
      "SummaryText": " also coordinates with the Pike Township Fire Department on emergency response activities. \n\nThe facility has a windsock present onsite for use in determining wind direction in the event of an ammonia release.\n\nResponders receive Hazwoper training through classroom instruction, on the job training and drills. Hazwoper training includes first responder awareness levels, first responder operations level, hazardous materials technician training, hazardous materials specialist training and emergency (or on-scene) coordinator training. Responder Hazwoper training also includes procedures for using and maintaining emergency response equipment as required.\n\nThe facility's Onsite Incident Commander (Maintenance Manager) is responsible for notifying onsite emergency response personnel, emergency response contractors and local, state and federal agencies of releases. The Maintenance Manager is responsible for submitting written communication concerning releases to local, state and federal agencies.\n\nThe facility?s Operations Manager is responsible for coordinating site evacuation in the event of a release that requires evacuation.\n\n\n9.0 EMERGENCY COMMUNICATIONS\nTelephone numbers of agencies and plant personnel that may be contacted in case of an emergency are as follows:\n\n1.Ambulance Service    911\n2.Fire Department    911\n3.Police Department    911\n4.Honeywell Fire Protection    800-622-4010\n5.Industrial Clinic ? St. Vincent (24 hr)    317-856-0740\n6.Wackenhut Security Services    317-329-3724\nCaptain Bear    888-583-5870\n7.Tom Richter (Maintenance Manager/Onsite Incident Commander)    317-818-1037\n8.John Denny (Environmental Coordinator/Plant Engineer)    317-894-7484\n9.David Mooney (Safety Director/Personnel Mtg)    765-482-2237\n10.Eddie Lee (Director of Emergency Control)    317-888-5613\n11.Darius Clark (Assistant Director 2nd shift)    317-293-0979\n12.John Bower (Assistant Director 3rd shift)    317-697-4070\n13.Kurt DeJong (Supvr. Prod)    317-535-2938\n14.Torrence Spencer (Supv. Prod)    317-328-4574\n15.Jim Paxton "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28900,
      "SummaryText": "ressurization, whereby control valves fail ?open? to reduce and distribute system pressure. There are 35 ammonia point sensor monitors, some of which are redundant for additional safety, distributed in key areas around the facility.\n\nConAgra has a security surveillance program in place to deter theft, vandalism, and terrorism.\n\n\n7.0 FIVE-YEAR ACCIDENT HISTORY\nConAgra has not had an accidental anhydrous ammonia release which resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage in the last five years. \n\n\n8.0 EMERGENCY RESPONSE PLAN\nConAgra has an Emergency Response Plan (ERP), updated on May 1, 2003, to ensure that in the event of an emergency the personnel are aware of the appropriate actions to take and authorities to contact in order to mitigate the effects of a release. Response activities are coordinated with the Marion County Local Emergency Planning Committee (LEPC) also known as the Marion County Hazardous Material Planning Committee, and the Pike Township Fire Department. This coordination effort includes providing the fire department with site diagrams and hazardous material information, meeting with fire department personnel to discuss facility operations/processes, and periodic on-site inspections by fire department personnel.\n\nThe facility maintains an ERP on file at the plant. According to the ERP, facility employees are responsible for responding to accidental releases of ammonia. The plan includes annual training of all employees on evacuation procedures and emergency notification procedures. The plan also includes annual training for emergency response team members. It identifies the emergency coordinators, communication coordinators and alternates. In addition to the facility ERP, the plant will be included in a community emergency response plan developed by the Marion County Local Emergency Planning Commission. ConAgra Foods"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 28900,
      "SummaryText": "(Shift supv. prod)    812-298-0628 \n16.Lance Brinson (Shift supv. prod)    317-822-1344\n17.Mark Boutilier (Shift supv. prod.)    317-297-7451 \n18.Don Paul (Shift supv. prod)    317-831-6919 \n19.LeRoy Cox (Sr. Team Leader Stationary Engineer)    317-543-0840\n20.Tom Culross (Director of Health and Safety, Corporate)     630-512-1529\n630-750-2413\n630-226-9435\n21.Karen Savinski (Media)    402-595-5392\n22.Pike Township Fire Department (on duty shift commander)    317-327-6062\nLewis Dezelan (Indianapolis Fire Department Headquarters)    317-327-6041\n23.Hazardous Material (Special Operations: IFD)    317-327-6041\n24.Emergency Response Center EPA    800-424-8802\n25.Indianapolis Power & Light Co. Emergency    317-261-8111\n26.Citizens Gas & Coke Utility Emergency    317-924-3311\n27.St. Vincent, Hospital    317-338-2121\n28.Methodist EAP    317-929-2622\n29.I.O.S.H.A Compliance (Indiana)    317-226-7290\n30.Marion County Health Department (Haz-Mat)    317-541-2270\n31.Emergency Spill Recovery (Local Contractor)    317-881-9754\nLiquid Waste Removal, Inc.    \n500 Polk Ave, Suite 100    \nGreenwood, IN 46143    \n32.Indiana Department of Environmental Management     317-233-7745\n24-Hour Emergency Response Line    \n33.Marion County (LEPC)    317-327-3900\n\n\n10.0 SPILL REPORTING/ENVIRONMENTAL RELEASE PROCEDURES\nIn the event of a catastrophic release, call 911.\n\n1.Whenever there is any type of chemical release, the shift engineer, maintenance mechanic, or supervisor on duty must complete a chemical release incident report within 24 hours of the release. The report should be forwarded to the Maintenance Manager and then given to the Environmental Coordinator. The reports will be kept on file by the Environmental Coordinator for a period of six years.\n\n2.If an ammonia release has a flow rate of 100 pound or greater in a 24 period, the following steps should be taken:\n\na.Immediately contact the ConAgra Foods Environmental Engineering. ConAgra Foods Environmental Engineering (Onsite Incident Commander / Emergency Coordinator) will notify the appropriate state and "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 28900,
      "SummaryText": "federal agencies. The phone number for the Onsite Incident Commander is (317) 818-1037. If you cannot reach the Onsite Incident Commander, call the facility?s 24-hour emergency number at the Guard House onsite at (317) 329-3724. If no one can be reached at this number, contact ConAgra?s Corporate Director of Health and Safety at the following phone numbers: \n\n630-512-1529\n630-750-2413\n630-226-9435\n\nIf you cannot contact anyone at the above numbers, proceed to the next steps.\n\nIn the event of a catastrophic release, call 911.\n\nb.The supervisor/manager on the shift must notify the Emergency Response Branch of the Pike Township Fire Department: (317-327-6062), the Marion County Health Department ? Haz Mat Div. (317-541-2270) and the office of Environmental Response - Marion County LEPC: (317-327-3900) within 24 hours of the incident. When reporting the incident, the Emergency Notification Form must be completed. \n\nOnly department supervisors/ managers are authorized to report releases (except in the event of a catastrophic release, in which case, call 911). Within 36 hours of the first phone call a second phone call must be made to the Emergency Response Branch of the Pike Township Fire Department (317-327-6062) and to the Office of Environmental Response ? Marion County LEPC (317-327-3900) to advise them further on the status of the release. At this time a second Emergency Notification Form must be completed. \n\nc.The Onsite Incident Commander / Emergency Coordinator (or supervisor/department manager as directed by the Onsite Incident Commander / Emergency Coordinator) should also contact the Indiana Department of Environmental Management after calling the Emergency Response Branch (ERB) to put them on alert. The phone number for the Indiana Department of Environmental Management is 317-233-7745. The reporter will provide this agency with the same information as provided to the ERB and note that the call was made and contact person of the Emergency Notification Form.\n\n"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 28900,
      "SummaryText": "d.Third: The National Emergency Response Center must be notified. The phone number for the National Emergency Response Center is 1-800-424-8802. Again the reporter will note on the emergency notification form that the call was made and will list the contact name within 24 hours.\n\ne.Copies of all Emergency Notification Forms should be given to the Environmental Coordinator to keep on file for a period of six years.\n\n3.When an ammonia release is of the magnitude of 100 pounds or greater in a 24 hour period, the supervisor/engineer on shift should immediately notify the Director of Emergency Control who will initiate putting the Emergency Response Plan into effect. Procedures for activating the Emergency Response Plan are set forth in the Emergency Response Plan.\n\n4.Within 24 hours of a release of or exceeding 100 pounds in a 24-hour period, the environmental response for the Marion County Health Department and for the Indianapolis Fire Department Haz-Mat Special Operations Division and copies of this report will be signed by the Maintenance Manager. The report should also be copied to ConAgra Foods Environmental Engineering Department.\n\n\n11.0 PLANNED CHANGES TO IMPROVE SAFETY\nChemical safety is an important part of ConAgra?s operations. ConAgra recently conducted an audit of their Process Safety Management Program and will be dutifully implementing the recommendations from that audit. Continuous improvement in safety is an important goal for ConAgra. In addition to the facility ERP, the plant will be included in a community emergency response plan developed by the Marion County Local Emergency Planning Commission. \n\nSince the initial RMP submission, although propane when used as a fuel became exempt from the Rule, ConAgra has removed the entire propane standby system, which once held approximately 26,000 gallons (110,000 pounds) of propane. \n\nNew administrative procedures: On an annual basis, ConAgra management including the Maintenance Manager, the Human Resources Su"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 28900,
      "SummaryText": "pervisor, and the Stationary Engineer will review local (county) and state emergency planning procedures including:\n\n(1) Emergency Operations Plan / 2002 Hazardous Materials Annex -- A Plan submitted by the Marion County Hazardous Materials Planning Committee (Local Emergency Planning Committee) October 17, 2002; \n(2) The Indianapolis Marion County Emergency Management, 47 South State Avenue, Indianapolis, Indiana 46112 -- Emergency Management Plan; \n(3) Marion County Emergency Management; and \n(4) Marion County Hazards \n\nand will certify that these documents have been reviewed and discussed with the LEPC and the Pike Township Fire Department. Additionally, on an annual basis the following guidance documents will be review by the ConAgra management listed above:\n\n(1)EPA 550-F-01-005 LEPC?s and Deliberate Releases\n(2)EPA-F-00-005 Anhydrous Ammonia Theft\n(3)EPA 550-F-01-009 Hazards of Ammonia Release at Ammonia Refrigeration Facilities (Update)\n(4)EPA 550-F-97-002a Rupture Hazard of Pressure Vessels"
    }
  ]
}