{
  "FacilityID": 28916,
  "FacilityName": "Bonded Chemicals",
  "FacilityStr1": "2645 Charter St.",
  "FacilityStr2": null,
  "FacilityCity": "Columbus",
  "FacilityState": "OH",
  "FacilityZipCode": "43228",
  "Facility4DigitZipExt": "4605",
  "FacilityCountyFIPS": "39049",
  "LEPC": "Franklin County LEPC",
  "FacilityLatDecDegs": "40.006944",
  "FacilityLongDecDegs": "-83.135278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5034491,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Paul Cochran",
  "OperatorStr1": "2645 Charter St.",
  "OperatorStr2": null,
  "OperatorCity": "Columbus",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43228",
  "OperatorZipCodeExt": "4605",
  "RMPContact": "Jimmy Coleman",
  "RMPTitle": "Plant Manager",
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000183767",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-03-01 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-09-09 00:00:00",
  "ErrorReportDate": "2003-09-09 00:00:00",
  "ReceiptDate": "2003-09-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-08-26 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-08-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 40.00694,
  "FRS_Long": -83.13528,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41566,
      "AltID": "Chlorine",
      "FacilityID": 28916,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 42507,
          "ProcessID": 41566,
          "NAICSCode": "42269",
          "_desc": {
            "NAICS_CODE": "42269",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 54738,
          "ProcessID": 41566,
          "ChemicalID": 62,
          "Quantity": 22000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 554738,
          "ProcessID": 41566,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28916,
      "SummaryText": "\n\nEXECUTIVE SUMMARY\n\nTo strive to become a vital and responsible neighbor within our community with regard to chemical response and contact for both emergency support as well as accident prevention. Bonded Chemicals, Inc. strives to maintain a proactive approach to regulatory compliance, community assistance and process and documentation development for our area. Becoming more responsible as a community participant will be achieved by the development of competent and committed employees, good procedure documentation and becoming proactive with the knowledge base we can share with others.  Several key people from each of our facilities must progress to the level that their knowledge and commitment can be shared and demonstrated to others outside our company.  We must commit to operating model sites as well as promote all the needed activities to fully comply with regulations and thus put those activities into every day use.  We will stay committed to recurrent training and emergency response drills and include ourselves in real emergencies as they occur.  Bonded Chemicals, Inc.?s commitment is to always be a good neighbor.\n \n\nBonded Chemicals, located at 2645 Charter St., Columbus, Ohio 43228 is a supplier of commodity chemicals including inorganic, organic and related products. Our services include stocking and distribution of a complete line of industrial chemicals, and other related services as required by our customers. Our primary customers include industrial chemical users such as metal finishers, printers, compounders and others using chemical commodities in the manufacture of their products, as well as municipalities using chemicals for water treatment and waste water treatment.   Our facility is approximately 23,000 square feet. Incorporated in the design is a designated storage room (appox. 800 sq. ft.) for 150 lb cylinders of chlorine. This room (Chlorine Room) incorporates state of the art chlorine monitoring equipment, emergency closure of the room, outs"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28916,
      "SummaryText": "ide monitoring in conjunction with our alarm system and a scrubber system to remove the chlorine in the event of a chemical release. The described system is also run by an emergency back-up generator should the electricity fail during an emergency. We have on hand two (2) Emergency Kits ?A? for stopping a cylinder from leaking should one occur. We also have a Cylinder ?coffin? for containing a leaking cylinder. Chlorine cylinders are delivered to the facility via truck from the manufacturer and stored in metal racks for delivery to customers on company vehicles.\n\n\nBONDED CHEMICALS EMERGENCY RESPONSE PROCEDURES\n\n\nGENERAL: Bonded Chemicals will ensure these Standard Operating Procedures (SOP) and emergency plans are developed and reviewed which address emergencies such as accidental releases of toxic gases, chemical spills, fires, explosions, natural disasters and personal injury within our facility(s) and are evaluated.  This SOP is intended to provide company employees with basic guidance which address the issues of; evaluating and identifying potential emergencies, emergency planning, written procedures, and communicating information concerning these hazards to employees.\n\nRESPONSIBILITY:  The company Environmental/Safety Officer and/or his designee is solely responsible for all facets of this program and has full authority to make necessary decisions to ensure success of the program.  The Environmental/Safety Officer is the sole person authorized to amend these instructions and is authorized to halt any operation of the company where there is danger of serious injury.\n\n\nContents of Bonded Chemicals Emergency Preparedness Program \n\n1.   General.                                                          \n2.   Facility Planning Requirements.       \n3.   Chain of Command.                                        \n4.   Communications.                                            \n5.   Accounting for Personnel.                             \n6.   Emergency Response Teams      "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28916,
      "SummaryText": "                  \n7.   Training.                                                         8.   Drills and Performance Evaluation Criteria.    \n9.   Personal Protection.                                      \n10.  Medical Assistance.                                      \n11.  Security.                                                        \n12.  OSHA Requirements.                                    \n13.  Emergency Notification Phone Numbers      \n\n\nChemical Group Emergency Preparedness Program\n\n1.  Written program.  Bonded Chemicals will review and evaluate this standard practice instruction on an annual basis, or when facility operational changes occur that require revision. Effective implementation of this program requires support from all levels of management and employees within the company.  This written program must be communicated to all personnel that are affected by it.  It encompasses the total work place, regardless of number of workers employed or the number of work shifts.  It is designed to establish clear goals, and objectives.\n\n2.  General.  The importance of an effective work place safety and health program cannot be overemphasized.  There are many benefits from such a program including increased productivity, improved employee morale, reduced absenteeism and illness, and reduced workers' compensation rates; however, accidents still occur in spite of efforts to prevent them.  Bonded Chemicals Standard Operating Procedures (SOP) details the basic steps and planning documents to be used and will be initiated to prepare for emergencies at the Bonded Chemical facility.  These emergencies include accidental releases of toxic gases, chemical spills, fires, explosions, natural disasters and personal injury.  This SOP is intended to serve as a guideline for these emergencies.\n\n3.  Facility planning requirements.  Proper planning for emergencies is necessary to minimize employee injury and property damage.  The effectiveness of response during emergencies depe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28916,
      "SummaryText": "nds on the amount of planning and training performed. The management's responsibility within Bonded Chemical is to see that this program is instituted and that it is frequently reviewed and updated.  The input and support of all employees must be obtained to ensure an effective program.  The emergency response plans required by Bonded Chemical will be comprehensive enough to deal with all known types of emergencies.\n\n3.1  Emergency action plans.  When any new emergency action plans are \nrequired by a particular OSHA standard, the plan will be in writing, the plan will be completed with 30 days of the new standard. \n\n3.1.1 Emergency escape procedures and emergency escape route.  Assignments will be posted throughout the facility and will be updated as needed. \n\n3.1.2    The Emergency Response Notification and the Emergency Response                    \nChecklist.  These will be used by the Emergency Response Team who  \nwill remain to perform (or shut down) critical plant operations before they evacuate.  The plant manager and the Environmental Safety Department shall be the key contact during all emergencies.\n\n3.1.3  Sign-in-log.  The facility will maintain a sign-in log of all visitors and will be used along with management/employee knowledge to account for all employees after emergency evacuation has been completed.\n\n3.1.4  Rescue and medical assistance. Rescue and medical assistance will only be conducted by trained employees and/or the Emergency Response Team.  In all events, 911 should be notified when rescue and medical assistance is required.\n\n3.1.5 Reporting Emergency. The preferred means of reporting fires or other emergencies will be the communication system in Section 5.\n\n3.1.6 Key Names.  Names or regular job titles of persons or departments to be contacted for further information or explanation of duties under the plan.\n\nBill Keene Environmental Safety Department  937-667-4199\nGlenn Smith Environmental Safety Department 513-769-3567\nJimmy Coleman Bonded C"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 28916,
      "SummaryText": "s should be made to the Primary Emergency Response Employee or the Environmental Safety Department. \n\n4.  Chain of Command.  The Plant Manager is the Primary Emergency Response Team member and is in charge of facility-wide operations and ensuring that outside aid is called. Because of the importance of these functions, adequate backup must be arranged so that trained personnel are always available.  The entire team is clearly outlined in 3.2.2.  The duties of the Emergency Response Teams and alternates are to backup and accomplish the  following:\n\n4.1  Assessing.  Assessing the situation and determining whether an emergency exists that requires activating the emergency procedures. The Emergency Response Notification and the Emergency Response Checklist shall be used.\n\n4.2   Directing.  Directing all efforts in the area including evacuating personnel and minimizing property loss.  The Emergency Response Notification and the Emergency Response Checklist shall be used.\n\n4.3 Outside Service. Ensuring that outside emergency services such as medical aid and local fire departments are called in (or provisions for notification) when necessary. The Emergency Response Notification and the Emergency Response Checklist shall be used.\n\n4.4 Shut Down. Directing the shutdown of plant operations when necessary.\n\n\n5.  Communications.  Bonded Chemical has a or telephone and paging system.  All notifications will be made over the paging system.   During a major emergency involving a fire or explosion it may be necessary to evacuate offices in addition to warehouse areas.  Also, normal services, such as electricity, water, and telephones, may be nonexistent.  Under these conditions, notification may be made by word of mouth.  All employees will evacuate to their respective evacuation point.  All employees must remain at the evacuation location until released by the Plant Manager or the Emergency Response Team Alternate or Environmental Manager/Assistant or General Manager.  Since time "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28916,
      "SummaryText": "hemicals, Inc. - Plant Manager 614-777-9240\nPaul Cochran Bonded Chemicals, Inc. ? General Manager ? 614-777-9240\n\n 3.2  Emergency audits/ Exercises.  The emergency action addresses all potential emergencies that can be expected in our facility.  Therefore, it will be necessary to perform annual hazard audits by the Environmental Safety Department and regular drills and evacuations as determined by General Managers and/or the Environmental Safety Department.  All discrepancies must be notified and forwarded to the management team of Bonded Chemicals and corrections made. \n3.2.1  Chemical information.  For information on chemicals, the manufacturer supplier will be contacted to obtain Material Safety Data Sheets. These forms describe the hazards that a chemical may present, list precautions to take when handling, storing, or using the substance, and outline emergency and first-aid procedures.\n\n3.2.2  Emergency Response Team employees.  The Emergency Response Team consists of the Plant Manager and two alternates.  These employees must remain behind to care for essential plant operations until their evacuation becomes absolutely necessary.  This may include monitoring plant power supplies, water supplies, and other essential services that cannot be shut down for every emergency alarm.\n\nBonded Chemicals  Jimmy Coleman   Primary\n                  Brian Roberts Alternate\n            Roy Bevard ? Alternate in training\n\n3.2.3  Emergency evacuation.  For emergency evacuation, floor plans or work place maps show clearly the emergency escape routes and safe or refuge areas to meet during an evacuation.  All employees will be trained on what actions they are to take in the emergency situations that may occur in their work place.  A minimum of four drills a year, one quarterly shall be performed and documented at each location. \n3.2.4  Plan revision.  This plan will be reviewed with employees initially and whenever the employees' responsibilities under the plan change.  Any recommendation"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 28916,
      "SummaryText": "is an essential element for adequate response, the person designated as being in charge will quickly take a head count and advise appropriate emergency management team of any no shows and last location seen.\n\n\n5.1   Salesman's Car.  If a Salesman's car is available, the car will also be moved to the emergency evacuation point to use as needed to notifying employees of the emergency and for contacting local authorities, such as law enforcement officials, the Red Cross, the local Federal Emergency Management Office, and the fire department. \n\nIf a Salesman's car is not available anyone's car that has a phone should be used.\n\nAdvanced notification and communication with our neighbors should also be made to include possible usage of the communication system.\n\n5.2  Employee emergency notification.   The paging system will be used to alert employees to the evacuation or to take other action as required in the plan.  Employees will take appropriate action and quickly move to the designated evacuation point.  Emergency phone numbers will be posted on or near telephones, on employee's notice boards, or in other conspicuous locations.\n\n5.3   The warning system.  This warning system must be reviewed and understood by each employee.  The plan should be reviewed annually.\n\n5.4  Off-duty key personnel notification.  It may be necessary to notify other key personnel such as the Plant Manager, General Manager, Environmental Manager, or physician during off-duty hours.  An updated written phone list will be kept by all key personnel.\n\n5.5 Key Notification announcements.  The following notification must be made over the public address system and/or phone system during emergencies.   The announcements should be made clear and repeated twice.  \n\n\nFIRE Announcement - \"Fire in Building  #\" - Fire in building  #\"\n\nEVACUATION Announcement- ?Evacuate - Evacuate\"\n\nTORNADO Announcement- \" Tornado Take Cover - Tornado Take Cover\"\n\nNOTE:  IF THE PAGING SYSTEM AND/OR PHONE SYSTEM IS DOWN, ALL NO"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 28916,
      "SummaryText": "TIFICATION MUST BE MADE BY WORD OF MOUTH.\n6.  Accounting for Personnel.  The Plant Manager will need to know when all personnel have been accounted for.  This can be difficult during shift changes or if contractors or visitors are on site.  All management and employees must assist in the accounting of personnel. \n  \n6.1   Visitors/Contractors.  All employees are responsible for ensuring their visitors follow all appropriate emergency response procedures as required.  During any evacuation each employee must guide their visitors to the designated areas and wait further instruction.\n \n6.2      Sign in Book.  The facility must have a \"Sign-In-Book\" and all visitors must sign-in.  During an Emergency Evacuation the Sign-In- Book must be taken by the closest person. \n\n6.3     Back-up Tape.  A back-up tape of the facility operations must be removed if not already removed.\n\n6.4     Missing Persons.  The Plant Manager or his Emergency Response Alternate will take role call.  Notify immediately any names and last possible locations of the employee that may be missing to the Fire and Rescue Team\n\n7.  Emergency Response Teams.  Emergency Response Teams are the first line of defense in emergencies.  Before assigning personnel to these teams, it must be determined if employees are physically capable of performing the duties that may be assigned to them.  The type and extent of the emergency will depend on the facility plant operations and the response will vary according to the type of process, the material handled, the number of employees, and the availability of outside resources.  Critical Plant Operations should be trained in the types of possible emergencies and the emergency actions to be performed yearly.  They should be informed about special hazards, such as storage and use of flammable materials, toxic chemicals, radioactive sources, and water-reactive substances, to which they may be exposed during fire and other emergencies.  It is important to determine when not to "
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 28916,
      "SummaryText": "intervene. \n\nFor example, team members must be able to determine if the fire is too large for them to handle or whether search and emergency rescue procedures should be performed.  If there is a possibility of members of the Emergency Response Team receiving fatal or incapacitating injuries, they should wait for professional firefighters or emergency response groups.  Depending on the size of the facility there may be one or several teams trained in the following areas:\n\n  7.1  Use of various types of fire extinguishers.\n  7.2  First aid, including cardiopulmonary resuscitation (CPR).\n  7.3  Shutdown procedures.\n  7.4  Evacuation procedures.\n  7.5  Chemical spill control procedures.\n  7.6  Use of self-contained breathing apparatus (SCBA)\n  7.7  Search and emergency rescue procedures.\n  7.8  Natural disaster operation procedures.\n\n8.  Training.  Training is important to the effectiveness of an emergency plan. All members of the emergency response team will receive annually 8-hour training. \n  \n8.1  Additional training.  In addition to the specialized training for Emergency Response Team members, all employees will be trained in the following:\n7 Emergency Audits and Exercises. (Section 3)\n7 Notification  systems. (Section 5 and 5.5)\n7 Accounting for Personnel. (Section 6)\n7 Shutdown procedures. (Sop's)\n7 Types of potential emergencies. (Annual 8 hour training)\n7 Meet all required training outlined in company training manual.\n  \n8.2  Training Time Frames. These training programs will be provided as follows:\n7 For all new employees.\n7 Annually.\n7 When exercises show that employee performance must be improved.\n\n9.  Drills and performance evaluation criteria.   A drill or simulation will be held for all personnel, at random intervals at least four times a year, and an evaluation of performance made immediately by management and employees.  When possible, drills will include groups supplying outside services such as fire, emergency services, and police departments.  The em"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 28916,
      "SummaryText": "ergency plan will be reviewed periodically and updated to maintain adequate response personnel, and program efficiency.  Performance evaluation criteria will be developed and used to measure the effectiveness of periodic drills.  Drills will incorporate the use of different types of scenarios such as releases of toxic gases, chemical spills, fires, explosions, natural disasters, and personal injury. \n\n10.  Personal Protection Equipment.  Effective personal protection equipment is essential for any person who may be exposed to potentially hazardous substances.  In emergency situations our employees may be exposed to a wide variety of hazardous circumstances, including:\n\n7 Chemical splashes or contact with toxic materials.\n7 Falling objects and flying particles.\n7 Unknown atmospheres that may contain toxic gases, vapors or mists, or inadequate oxygen to sustain    life.\n7 Fires and electrical hazards.\n7 Safety equipment is extremely important and our employees must be adequately protected in these situations.  Some of the safety equipment may be used includes:\n7 Safety glasses, goggles, or face shields for eye protection.\n7 Hard hats and safety shoes for head and foot protection.\n7 Proper respirators for breathing protection.\n7 Whole body coverings, gloves, hoods, and boots for body protection from chemicals.\n7 Body protection for abnormal environmental conditions such as extreme temperatures.\n\n10.1 Equipment selection.  The equipment selected will be approved jointly by the Mine Safety and Health Administration (MSHA) and the National Institute for Occupational Safety and Health (NIOSH), or will meet the standards set by the American National Standards Institute (ANSI).  The choice of proper equipment is not a simple matter and consultation will be made with health and safety professionals before making any purchases.  Manufacturers and distributors of health and safety products will be consulted where necessary to answer questions if they have enough information abo"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 28916,
      "SummaryText": "ut the potential hazards involved.  The Environmental and Safety Department in conjunction with the Plant Managers will evaluate the required equipment needed and have it pre-staged within each facility on an emergency response pallet. \n\n10.2   The company Respirator Program. All emergency response team members who will be required to wear a respirator must meet the following. \n\n10.2.1  Have a Respiratory physical.  This physical must be done yearly.  \n\n10.2.2 Have a fit test. The fit test will be completed by the Environmental and \nSafety Department.\n\n10.2.3   Been Trained on Using and Maintaining a Respirator. The Environmental and Safety Department will provide a 4-hour training class on respirators. Professional consultation may be needed in providing adequate respiratory protection.  Respiratory protection is necessary for toxic atmospheres of dusts, mists, gases, or vapors and for oxygen-deficient atmospheres.\n\n10.3  The company Confined Space Program.  All Emergency response individuals are required to complete the confined space program text. Emergency situations may involve entering confined spaces to rescue\ncompany employees who are overcome by toxic compounds or who lack oxygen.  These confined spaces include tanks, vaults, pits, sewers, pipelines, and vessels. \n\n10.4  The company Lockout/Tag-out Program.  All Emergency response individuals are required to complete the Lockout/Tag-out Training.\n\n11.  Medical Assistance.  In a major emergency, time is a critical factor in minimizing injuries.  Bonded Chemical will ensure ready availability of medical personnel for advice and consultation on matters of employee health.  If health problems develop in the work place, medical help will be available to resolve them. \n\nA survey of the medical facilities near Bonded Chemical will be conducted and arrangements will be made to handle routine and emergency cases.  At least one and preferably more employees on each shift will be adequately trained to render first aid"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 28916,
      "SummaryText": ".  The American Red Cross, some insurance carriers, local safety councils, fire departments, and others may be contacted for this training.\n\nFirst-aid supplies will be provided for emergency use.  This equipment will be ordered through consultation with a physician.\n\nEmergency phone numbers will be posted in conspicuous places near or on telephones.\n\nSufficient ambulance services will be available to handle any emergency.  This will be conducted with advance contact with ambulance services to ensure they become familiar with plant location, access routes, and hospital locations.\n\n12.  Security.  During an emergency, it is often necessary to secure the area to prevent unauthorized access and to protect vital records and equipment.  An off-limits area should be considered (where necessary) by cordoning off the area with ropes and signs.  It may be necessary to notify local law enforcement personnel or to employ private security personnel to secure the area and prevent the entry of unauthorized personnel. Certain records also may need to be protected, such as essential accounting files, legal documents, and lists of employees' relatives to be notified in case of emergency.  These records will be stored in duplicate, if applicable, outside the plant or in protected secure locations within the plant.\n\n13. OSHA Requirements.  Bonded Chemical has complied with the following OSHA requirements pertaining to emergency response.  The list may also become a source documents within Bonded Chemical as it pertains to Work place Emergency Preparedness.  These references refer to appropriate sections of the Occupational Safety and Health Standards (Code of Federal Regulations, Title 29, Part 1910, which are the OSHA General Industry Standards).\n\nSubpart E - Means of Egress\n\n1910.37   Means of egress\n1910.38   Employee emergency plans and fire prevention plans\n                Appendix to Subpart E - Means of egress\nSubpart H - Hazardous Materials\n1910.120    Hazardous waste operation"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 28916,
      "SummaryText": " and emergency response:Interim final rule\nSubpart I - Personal Protective Equipment\n1910.132   General requirements-personnel protection\n1910.133   Eye and face protection\n1910.134   Respiratory protection\n1910.135   Occupational head protection\n1910.136   Occupational foot protection\n1910.146   Permit Required Confined Space Entry\nSubpart K - Medical and First Aid\n1910.151    Medical services and first aid\nSubpart L - Fire Protection\n1910.155-156 Fire protection and fire brigades\n1910.157-163 Fire suppression equipment\n1910.164  Fire detection systems\n1910.165  Employee alarm systems\n\n\nEmergency Notification Telephone Numbers\n\nCHEMTREC    800-424-9300              Poison Control      800-628-7625\nDOT Hotline 202-366-4488              Police Dept. 911    614-645-4545\nEEI Waste Co. 513-772-2818            Sheriff  911        614-983-2538\nEMS Dept. 911 614-645-7384            State Police  911   614-983-2538\nEPA Information  800-535-0202         U.S. NRC            800-424-8802\nETSS Waste Co.    937-845-3912        Ohio DOT/PUCO       800-686-7826\nEvergreen Waste  502-241-4171         Ohio SERC           800-282-9376\nFire Dept. 911        614-221-2345    Ohio SERC           614-224-0946\nLEPC                  614-221-9600    Ohio Reporting      800-282-9378\nMSD                   614-645-7102    Permafix Waste      937-268-6501\n"
    }
  ]
}