{
  "FacilityID": 28953,
  "FacilityName": "Costco Wholesale - West Palm Beach",
  "FacilityStr1": "5851 45th Street",
  "FacilityStr2": null,
  "FacilityCity": "West Palm Beach",
  "FacilityState": "FL",
  "FacilityZipCode": "33407",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12099",
  "LEPC": "District 10 LEPC",
  "FacilityLatDecDegs": "26.760306",
  "FacilityLongDecDegs": "-80.133778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "IO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.costco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Costco Companies, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 808696844,
  "Company2DUNS": null,
  "OperatorName": "Costco Wholesale",
  "OperatorStr1": "5851 45th Street",
  "OperatorStr2": null,
  "OperatorCity": "West Palm Beach",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33407",
  "OperatorZipCodeExt": null,
  "FTE": 81,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000183892",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-09-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-09-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-09-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-09-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 26.763291,
  "FRS_Long": -80.131345,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41668,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 28953,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 54860,
          "ProcessID": 41668,
          "ChemicalID": 56,
          "Quantity": 25000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 42612,
          "ProcessID": 41668,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 23765,
              "Process_NAICS_ID": 42612,
              "SafetyReviewDate": "2003-08-14 00:00:00",
              "PHA_Date": "2004-08-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Site Inspection",
              "PHACompletionDate": "2003-08-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Implementation of emergency and preventative maintenance procedures.",
              "OpProceduresReviewDate": "2003-08-14 00:00:00",
              "TrainingReviewDate": "2003-09-05 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-07-25 00:00:00",
              "EquipmentInspectionDate": "2003-09-12 00:00:00",
              "EquipmentTested": "Pressure Test - entire system",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2003-07-30 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-09-05 00:00:00",
              "HotWorkPermitReviewDate": "2003-07-30 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2003-08-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 34920,
                  "PreventionProgram3ID": 23765,
                  "ProcessChemicalID": 54860
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 28953,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "West Palm Fire Rescue",
    "CoordinatingAgencyPhone": "5618352910",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 8,
      "FacilityID": 28953,
      "SummaryText": "ssibilities of lightning strikes on the condensers and the potential consequences.\n\nR25 Ensure that the valves in the Emergency Refrigerant Control Box are labeled as to the corresponding upstream vessel.\n\nR26 Ensure that facility evacuation maps are posted in various locations around the warehouse indicating the primary assembly area.\n\nR27 Install a supply of disposable ear plugs just inside the entry doors into the engine room.  Also, provide hearing protection to employees that regularly walk through the engine room based on personal preference.\n\nR28 Install ammonia warning placards on each man door into the engine room.  NFPA placards may be required as per the fire department.\n\nR29 Install Confined Space - Permit Not Required signs at the Condenser access hatches.\n\nR30 Ensure that wind socks are installed (and maintained) in locations around the facility that can be seen from each facility entrance and at the primary evacuation assembly area.\n\nR31 Ensure that the ammonia refrigeration pipes in the engine room and in the warehouse are labeled based on the industry standard publication, IIAR Bulletin #114."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28953,
      "SummaryText": "e low temperature accumulator serves the 0 F freezer evaporators.  Fans in each evaporator are used to blow air across and through the coils which partially vaporizes the liquid ammonia as heat from the room is transferred to the ammonia.\n\nThe resulting two-phased (liquid/vapor) ammonia from each set of evaporators is returned to each accumulator respectively in which constant pressures (temperatures) are maintained based on the suction pressure of the corresponding compressors, the exception being the engine room evaporator, which returns a liquid/vapor mix to the high temperature pump accumulator.  The vapor from the accumulators is then drawn to the compressors where the pressure and temperature of the gas is increased.\n\nMultiple compressors are used to compress the vapor generated at the evaporator coils and collected in the accumulator vessels.  Each temperature zone (Cross Dock, Meat Cooler, Freezer) has certain dedicated compressors with several swing compressors being able to be used for multiple zones.  The compressors pull vapor from the three accumulator vessels and discharge through a common header to a condenser where the vapor is condensed to a high pressure liquid and drained back to the high pressure receiver.  Hot gas is also used  for defrost of the freezer, meat cooler, and cross dock evaporators.  An auto purger periodically purges the system of non-condensibles collected in the condensers.  The system is also equipped with a glycol heat exchanger that is used for underground heating of the freezer.  Dual pressure relief valve assemblies are installed on each vessel to relieve high pressure ammonia to a water diffusion tank through an emergency refrigerant control box in case of a high pressure event.\n\nHAZARD ASSESSMENT SUMMARY\n\nWorst Case Release Result Summary\n\nScenario Description : Release of the maximum quantity of ammonia that can be stored in a vessel (the High Pressure Receiver has the capacity to hold 20,074 pounds) in 10 minutes.  The m"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28953,
      "SummaryText": "ost pessimistic meteorological conditions were used: 1.5 meters per second wind speed, and F stability.  Since the HPR vessel is located inside, the enclosure of the building was considered a passive mitigation measure, reducing the effective release rate to the outside atmosphere by 55%.  No active mitigation measures were considered.  The Risk Management Program Guidance for Ammonia Refrigeration reference tables were used to determine the maximum distance to the toxic endpoint of 200 ppm in rural conditions.  This release reaches off site and may impact population receptors.  No environmental receptors were affected by this potential release.\n\nAlternative Release Result Summary\n\nScenario Description : The alternative release scenario presented is similar to the worst case in that it is a liquid release.  The alternative release scenario chosen for this facility is that of a 0.25 inch diameter orifice leading to an airborne release, representative of a pump seal leak, a gasket rupture, pinhole leak due to corrosion, flange seal leak, valve bonnet seal leak, etc.  It is assumed that this release is from the high side of the system; therefore at a maximum pressure of 180 psig.  The release scenario is assumed to continue for 60 minutes, thereby incorporating active mitigation measures such as the ammonia sensors and system shutdown.  No passive mitigation measures were considered.\n\nEPA allows a facility to use typical meteorological conditions at the facility when developing the Alternative Release. For this scenario, a wind speed of 3 meters/second and neutral conditions, D stability, were used to find the distance the toxic endpoint of 200 ppm in a rural area.\n\nEPA's Risk Management Program Guidance for Ammonia Refrigeration Facilities, Exhibit 4-5 for D Stability, Wind Speed 3.0 Meters per Second, was used to find the downwind distance for the alternate release scenario. This release reaches  off site.  No population or environmental receptors were affected b"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28953,
      "SummaryText": "y this potential release.\n\nRISK MANAGEMENT PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe Costco Wholesale ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the facility operates in accordance with OSHA's Process Safety Management regulation and EPA's Risk Management Program (RMP).  The facility also maintains a contract with a professional refrigeration service firm to conduct preventative maintenance and any necessary repairs.\n\nAmmonia detectors are strategically located in the engine room and the Wholesale.  In case of ammonia detection, visible and audible alarms will activate at the facility and at the computer system.\n\nIn the event of a power failure, ammonia operations would automatically shut-down (solenoid valves close, compressors shut-down, condenser fans and water pumps shut-down, evaporator fans shut-down, etc.), thereby limiting the possibility of any ammonia releases. \n\nThe system also incorporates a pressure relief system.  In the event of over-pressurization, vessels will vent to a common header which relieves, via an emergency refrigerant control box, to an outside water diffusion tank until the system pressure decreases sufficiently to reseat the valves.  This mechanism prevents vessels from rupturing in case they become over pressurized.\n\nAmmonia refrigeration systems do not experience any chemical reactions or internal corrosion.  The only composition change that occurs within the systems are phase changes, as ammonia is cycled through various stages of liquid and vapor, similar to a household refrigerator.  The refrigeration system is a closed-loop system without any regular emissions or releases.  Any leaks are noted during daily walk-throughs by Costco Wholesale, and repaired immediately.\n\nIn addition to the 1997 Uniform Mechanical Code, the facility will operate in accordance with the International Ins"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 28953,
      "SummaryText": "titute of Ammonia Refrigeration (IIAR) guidelines.  In particular, the IIAR Bulletin 110, Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems is used as a general guide.\n\nFIVE YEAR ACCIDENT HISTORY\n\nBecause this is a new ammonia refrigeration system, there have been no accidental ammonia releases at the Costco Wholesale facility within the last five years.  (Scheduled to Startup in September 2003)\n\nEMERGENCY RESPONSE PROGRAM\n\nCostco Wholesale has an emergency action plan in effect at the facility.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP document.  Emergency response activities are coordinated with the West Palm Beach Fire Rescue and the local fire houses.  In case of a major ammonia emergency, the facility will first call 9-1-1 to alert the local Police and Fire Departments.  Other responders will be called as needed, including the Department of Public Safety Emergency Management Services.  If a release exceeds the federal reporting quantity of 100 pounds for ammonia, calls will be made to the following organizations:  the National Response Center and within 15 minutes, the Florida Emergency Spill Reporting (State Warning Point).\n\nCostco Wholesale maintains a safety committee whose members are the designated emergency coordinators for the facility.  The plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  The plan is reviewed and updated at least once per year.  This plan will be reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes due to renovation of the facility.\n\nCostco Wholesale will be responsible for evacuating and ensuring the safety of its employees and will coordinate emergency response efforts with the fire departme"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 28953,
      "SummaryText": "nt and its refrigeration contractor on a periodic and ongoing basis.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazard Analysis (PHA) was conducted on July 9, 2002 and August 14, 2003.  This document includes the results from the two elements: 1) the Hazard and Operability (HAZOP) study and 2) a Site Inspection. These studies were performed to define potential hazards associated with operational deviations of the ammonia system.  As a result of the Process Hazard Analysis, a number of recommendations were made, such as procedural changes, ammonia awareness training and some equipment upgrades.  These recommendations are listed below.\n\nR01 Determine if the High Pressure Receiver is capable of holding the entire charge of ammonia in the system.\n\nR02 Include a periodic test and calibration of the ammonia detectors (based on the manufacturer's recommendations) in the facility's maintenance program to be completed by the refrigeration contractor.\n\nR03 Coordinate emergency response efforts with the local emergency responders (i.e. fire department) on a periodic and ongoing basis.\n\nR04 Ensure that every employee at the facility is provided with the following information: 1) general awareness of ammonia at the facility, 2) how to report an ammonia release, 3) where to go when they are told to evacuate.\n\nR05 Determine what actions are taken during an ammonia leak by the ammonia detection system including whether an off-site alarm company is automatically notified.\n\nR06 Consider installing a visual alarm outside the engine room that is activated by an ammonia detection in the engine room.\n\nR07 Determine whether liquid drains exist in the engine room floor.  If they do, ensure that the proper water treatment agency is alerted if liquid is released.\n\nR08 Ensure that extraneous materials, especially flammables, are not stored in the engine room.\n\nR09 Include the replacement of the pressure relief valves on a 5 year preventive maintenance schedule.  Also, any valve that enga"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 28953,
      "SummaryText": "ges to vent pressure should be replaced.\n\nR10 Ensure that an annual visual inspection is included in the maintenance program for all vessels.  Paint all vessels as needed.\n\nR11 Consider equipping the ammonia detectors in the engine room with a UPS (Un-interruptible Power Supply).\n\nR12 Ensure that safety shower/eye wash stations are located in and outside the engine room.\n\nR13 Ensure that a water source (i.e. portable water bottle, hose, eye wash station) is located on the roof near the Condensers.\n\nR14 Confirm that a mechanical high level float switch exists on each pump accumulator vessel that shuts down the compressors.\n\nR15 Include an annual test of the mechanical high level shut down float switches on each pump accumulator vessel in the preventive maintenance program.\n\nR16 Consider implementing a daily log sheet for the engine room to be completed by a Costco employee.  Typical data to document includes: suction and discharge pressures of the compressors, oil pressure and levels, liquid levels of all vessels.\n\nR17 Coordinate the oil draining procedures with the refrigeration contractor.  Ensure that they are documented in the Operating Procedures.\n\nR18 Establish an oil draining log to be kept in the ammonia engine room to document oil added and drained.\n\nR19 Ensure that all evaporator coils are periodically maintained by cleaning the pans and coils as needed.\n\nR20 Include an annual test of the compressor safety cutouts in the preventive maintenance program.\n\nR21 Establish a maintenance program for all ammonia equipment that includes manufacturer recommendations and/or industry standards.\n\nR22 Ensure that the Condensers are periodically maintained including a water treatment service and cleaning out the water reservoir.\n\nR23 Consider implementing a procedure for the contracted ammonia technician to check in with Costco management upon arrival at the facility and prior to performing non-routine work on the roof or in another isolated occasion.\n\nR24 Consider the po"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 28953,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Costco Wholesale facility has an emergency action plan in effect.  The Emergency Action Plan (Plan) is summarized in the Emergency Planning and Response section of Costco Wholesale's PSM/RMP document.  This Plan was designed to meet the following objectives:\n\n1.) To save lives.\n2.) To minimize and avoid injuries.\n3.) To protect the environment.\n4.) To minimize property damage.\n\nCostco maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan will be reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes.\n\nCostco Wholesale has coordinated emergency response efforts with the local fire department, West Palm Beach Fire Rescue.  In the case of an ammonia-related emergency, it is the policy of Costco Wholesale to evacuate the employees and to allow the responders to respond to the emergency (potentially with the assistance of trained facility personnel).  The refrigeration contractor will be available for guidance.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nCostco Wholesale will begin operation of the facility upon its completion in September 2003.  The ammonia system at the Costco Wholesale consists primarily of vessels, compressors, a condenser, evaporators and associated piping.  The majority of the equipment is located inside the engine room.  The system is a closed loop refrigeration system similar to a residential refrigerator.  There are no emissions or planned releases of ammonia.\n\nThe Costco Wholesale facility provides cold storage space and a cross docking area for refrigerated items.  Ammonia sensors are located in the Engine Room a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28953,
      "SummaryText": "nd Wholesale that alert facility personnel and activate the ventilation system in the engine room and close all feed lines out of the engine room.  The ammonia detection system also has the capability to shut-off all electrical power to the engine room.  \n\nThe maximum intended inventory of ammonia is 25,000 pounds.  \n\nRefrigeration process equipment at the facility operates continuously.  Compressors and condensers cycle on and off to comply with system demand during operation.  The ammonia refrigeration system provides cooling for several areas (Cross Dock (40 F), Meat Cooler (28 F), and Freezer Storage (0 F) and the Engine Room (40 F)).  The majority of the system equipment is located in the ammonia Engine Room.  The condensers are mounted on the Engine Room roof, the water diffusion tank is located outside the engine room, and the evaporators are placed in the cold storage areas with 1 unit in the ammonia engine room for temperature control. \n\nThe refrigeration cycle begins with the transfer of high pressure liquid ammonia from the high pressure receiver to the high temperature pump accumulator and the evaporator located in the Engine Room.  The high pressure receiver also maintains a reservoir of liquid ammonia that is used for compressor oil cooling.  As the ammonia enters the high temperature pump accumulator, it is expanded through a hand expansion valve, reducing the pressure (and hence the temperature) in order to maintain a predetermined internal pressure.  The high temperature pump accumulator feeds a similar vessel that maintains an intermediate pressure, the medium temperature pump accumulator.  The pressure is further reduced between the medium temperature accumulator and the low temperature pump accumulator.  Each accumulator vessel supplies pumped liquid ammonia to a distinct set of evaporators.  The high temperature accumulator serves the 40 F cross dock evaporators.  The medium temperature accumulator serves the 28 F meat cooler evaporators, and th"
    }
  ]
}