{
  "FacilityID": 28991,
  "FacilityName": "Small-Scale Natural Gas Liquefaction Facility",
  "FacilityStr1": "2001 Front St.",
  "FacilityStr2": null,
  "FacilityCity": "Sacramento",
  "FacilityState": "CA",
  "FacilityZipCode": "95818",
  "Facility4DigitZipExt": "1116",
  "FacilityCountyFIPS": "06067",
  "LEPC": null,
  "FacilityLatDecDegs": "38.571667",
  "FacilityLongDecDegs": "-121.510278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": "www.pge.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Pacific Gas and Electric Company",
  "Company2Name": null,
  "CompanyDUNS": 6912877,
  "Company2DUNS": 0,
  "OperatorName": "Pacific Gas and Electric Company",
  "OperatorStr1": "77 Beale St.",
  "OperatorStr2": "P.O. Box 770000",
  "OperatorCity": "San Francisco",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94177",
  "OperatorZipCodeExt": "1116",
  "RMPContact": "Anthony Estrada",
  "RMPTitle": "Environmental/Safety Compliance Eng",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000183981",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-08-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-09-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-09-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-09-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-03-23 00:00:00",
  "DeRegistrationEffectiveDate": "2008-09-17 00:00:00",
  "AnniversaryDate": "2008-09-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 38.57264,
  "FRS_Long": -121.51047,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41757,
      "AltID": "Storage tank and transfer",
      "FacilityID": 28991,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 42702,
          "ProcessID": 41757,
          "NAICSCode": "22121",
          "_desc": {
            "NAICS_CODE": "22121",
            "NAICS_DESCRIPTION": "Natural Gas Distribution"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 54957,
          "ProcessID": 41757,
          "ChemicalID": 93,
          "Quantity": 47770.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 93,
            "ChemicalName": "Methane",
            "CASNumber": "74-82-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 554957,
          "ProcessID": 41757,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28991,
      "SummaryText": "RMP EXECUTIVE SUMMARY\n\nThe purpose of the California Accidental Release Prevention (CalARP) Risk Management Plan (RMP) is to provide guidelines for facilities in California to conduct business in an environmentally safe manner.  The legal authority for the CalARP Program is the California Health and Safety Code, Division 20, Chapter 6.95, Article 2 (commencing with Section 25531).  The California Office of Emergency Services has issued implementation regulations under the California Code of Regulations (CCR) Title 19, Division 2, Chapter 4.5.  The Pacific Gas and Electric Company (PG&E) Small-Scale Natural Gas Liquefaction facility (?LNG Facility?) is subject to RMP requirements because the maximum intended inventory of liquefied natural gas (LNG) exceeds the 10,000-pound federal threshold for methane (this threshold quantity is specified in Table 2 of 19 CCR 2770.5).  This threshold quantity is applicable because natural gas is composed of 90 to 100 percent methane.  \n\nFacility\n\nThe LNG Facility is located at 2001 Front Street, Sacramento, California.  The facility produces LNG for fueling vehicles.  The portions of the system subject to CalARP regulations are the LNG storage tank, associated piping and equipment, and the operations for transferring LNG from the storage tank to tanker trucks. \n\nThe primary LNG Facility activities are the storage and transfer of LNG to transport trucks.  LNG production and storage are completely automatic, but the transfer of LNG from the storage tank to a tanker truck is conducted by contractors hired to transport the LNG to its final destination.\n\nChemical Inventories\n\nAs LNG is produced at the LNG Facility, it is collected in a storage tank.  The storage tank capacity is 15,000 gallons; however, due to administrative controls, the maximum volume contained within the tank at any one time is 13,500 gallons, or 47,770 pounds (lbs).  This amount exceeds the federal RMP applicability threshold of 10,000 lbs.  The PG&E LNG Facility is "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28991,
      "SummaryText": "subject to Program 3 requirements, as described in Section 7.0, because the facility storage quantity triggers the threshold for flammables under Occupational Safety and Health Administration (OSHA) Process Safety Management regulations (Title 29 of the Code of Federal Regulations, Part 1910.119, and 8 CCR 5189) and the facility is not eligible for Program 1.  \n\nChemical Hazards\n\nToxicologically, methane is classified as a simple asphyxiant.  The routes of exposure are inhalation and dermal contact.  Methane is inactive biologically and essentially nontoxic.  Therefore, the major properties are the exclusion of an adequate supply of oxygen to the lungs; effects are dizziness, unconsciousness, and eventual collapse.  Skin contact with the LNG or cold piping can cause freezing or frostbite.\n\nThe main hazards associated with LNG are fire and explosion.  The flash point of methane is ?306 degrees Fahrenheit (closed cup), the lower flammability limit is 5 percent, and the upper flammability limit is \n15 percent.\n\nHazard Assessment\n\nAs part of the PG&E CalARP RMP, the worst-case release scenario (WCS) and alternative-case release scenario (ACS) were identified in accordance with 19 CCR 2745.4.  \n\nThe WCS for the facility is assumed to be a catastrophic failure of the LNG storage tank, resulting in the release of the entire contents of the tank to the atmosphere (47,770 lbs).  The entire quantity is assumed to be released over a period of 10 minutes.  The release rate to the atmosphere is the quantity contained in the tank divided by the duration of the release.  The endpoint for an explosive chemical is defined in 19 CCR 2750.2(a)(4)(A) as the distance to an overpressure of 1 pound per square inch (psi) due to a vapor cloud explosion.  \n\nUnder the conditions described above, the vapor cloud explosion scenario results in an endpoint distance of 0.31 miles; the residential population affected under the WCS is 710 people.\n\nThe selected ACS for the PG&E LNG Facility is a tran"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28991,
      "SummaryText": "sfer hose failure due to a sudden hose uncoupling while pumping from the storage tank to the tanker truck.  LNG is released at a rate of 175 gallons per minute, which is the transfer pump rate.  A release duration of 1 minute has been assumed for the ACS.  This is a conservative assumption based on operator experience.  It encompasses time for the operator to realize what is occurring, travel to the pump control panel, and push the off-button.  No passive or active mitigation measures present at the facility have been considered in the evaluation of the ACS.  This release scenario has been modeled as both as a vapor cloud fire and a pool fire to determine which type of scenario produces the most conservative results.  \n\nThe amount of methane released under each type of scenario is 618 pounds.  The pool fire scenario results in an endpoint distance of 0.03 miles; the endpoint for this scenario is a thermal flux of 5 kw/m2.  The vapor cloud fire scenario results in an endpoint distance of 0.01 miles; the endpoint for this scenario is a concentration less than the lower flammability limit for methane (5 percent).\n\nOf the two types of scenarios, the pool fire scenario provides the most conservative results for the ACS radius of influence.  Therefore, the radius of influence for this scenario has been used in determining the exposed population and public and environmental receptors for the ACS.  The residential population affected under the ACS is 0 people. \n\nPrevention Program\n\nThe LNG covered process is subject to Program 3 prevention program requirements because it is subject to OSHA?s PSM standards and is not eligible for Program 1.  The PG&E Program 3 prevention program includes the following:\n?Process Safety Information;\n?Process Hazard Review;\n?Operating Procedures;\n?Training;\n?Mechanical Integrity;\n?Management of Change;\n?Pre-Startup Safety Review;\n?Compliance Audits;\n?Incident Investigations;\n?Employee Participation;\n?Hot Work Permit; and\n?Contractors.\n\nFive-Yea"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28991,
      "SummaryText": "r Accident History\n\nThe LNG Facility is a demonstration project and, as such, there have been no CalARP RMP reportable releases at the LNG Facility in the past 5 years that resulted in either of the following:\n?On-site deaths, injuries, or significant property damage; or\n?Known off-site deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\n\nEmergency Response Program\n\nPG&E has implemented an emergency response program that complies with the requirements of the CalARP RMP as described in 19 CCR 2765.2.\n\nPlanned Changes to Improve Safety\n\nPG&E is committed to providing a safe place of business for the employees and surrounding community.  This RMP document summarizes the programs and procedures in place at the LNG Facility to prevent or minimize the consequences of catastrophic releases of flammable or explosive chemicals.  The RMP provisions are intended to minimize the probability and/or consequences of accidental releases of highly hazardous chemicals from the facility and include such measures as a system hazard review, operation and maintenance procedures, training, compliance auditing, implementation of a management system, and providing routine updates.\n\nPG&E will address and resolve all of the action items identified in the Process Hazard Analyses for each RMP-covered process.  In the future, to ensure that the appropriate changes occur as necessary to maintain and improve safety, ongoing Process Hazard Reviews, Process Hazard Analyses, Training, Compliance Audits, inspection and maintenance, Contractor programs, Hot Work Permit issuance, and Incident Investigations will be conducted as required by the RMP.  Program 3 changes will be managed under the Management of Change system.  Updates to the RMP will be completed as necessary in response to these activities."
    }
  ]
}