{
  "FacilityID": 29031,
  "FacilityName": "Fort James Operating Company",
  "FacilityStr1": "PO Box 547",
  "FacilityStr2": "Portland St.",
  "FacilityCity": "Old Town",
  "FacilityState": "ME",
  "FacilityZipCode": "04468",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "23019",
  "LEPC": "Penobscot County LEPC",
  "FacilityLatDecDegs": "44.919167",
  "FacilityLongDecDegs": "-68.634972",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 101190031,
  "ParentCompanyName": "Georgia-Pacific Corporation",
  "Company2Name": null,
  "CompanyDUNS": 46156626,
  "Company2DUNS": null,
  "OperatorName": "Georgia-Pacific Corporation",
  "OperatorStr1": "1650 Lake Cook Rd",
  "OperatorStr2": null,
  "OperatorCity": "Deerfield",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60015",
  "OperatorZipCodeExt": "4753",
  "FTE": 442,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000062647",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "A-180-71-M-A",
  "SafetyInspectionDate": "2003-05-15 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-10-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-10-08 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-10-03 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2006-11-22 00:00:00",
  "DeRegistrationEffectiveDate": "2006-10-27 00:00:00",
  "AnniversaryDate": "2008-10-03 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 44.917362,
  "FRS_Long": -68.636511,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41805,
      "AltID": "ClO2 Generation & Storage",
      "FacilityID": 29031,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 55014,
          "ProcessID": 41805,
          "ChemicalID": 71,
          "Quantity": 18235.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 42751,
          "ProcessID": 41805,
          "NAICSCode": "322121",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 23851,
              "Process_NAICS_ID": 42751,
              "SafetyReviewDate": "2003-02-03 00:00:00",
              "PHA_Date": "2002-01-14 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-05-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Reseating relief hatches, muliple gas detectors",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Area Sewer",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Building Beacons / Evacuation Alarms",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-05-07 00:00:00",
              "TrainingReviewDate": "2003-02-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Training modules and SOPs",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-08-07 00:00:00",
              "EquipmentInspectionDate": "2003-05-15 00:00:00",
              "EquipmentTested": "Inspected all critical equipment (e.g., Check valves, pipelines, safety releases, pumps and generator)",
              "ChangeMgmtDate": "2003-08-19 00:00:00",
              "ChangeMgmtReviewDate": "2003-05-07 00:00:00",
              "PreStartupReviewDate": "2003-08-19 00:00:00",
              "ComplianceAuditDate": "2003-06-04 00:00:00",
              "AuditCompletionDate": "2003-11-15 00:00:00",
              "IncidentInvestigationDate": "2003-05-13 00:00:00",
              "InvestigationChangeDate": "2003-05-13 00:00:00",
              "ParticipationPlansReviewDate": "2003-02-14 00:00:00",
              "HotWorkPermitReviewDate": "2003-04-30 00:00:00",
              "ContractorSafetyReviewDate": "2003-05-20 00:00:00",
              "ContractorSafetyEvalDate": "2003-06-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 35022,
                  "PreventionProgram3ID": 23851,
                  "ProcessChemicalID": 55014
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 29031,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-01-28 00:00:00",
    "ERTrainingDate": "2003-07-29 00:00:00",
    "CoordinatingAgencyName": "Penobscot County LEPC",
    "CoordinatingAgencyPhone": "2079454750",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "CERCLA (40 CFR 302)"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 29031,
      "SummaryText": "rocedures to define how tasks related to process operations should be safely performed. The operating procedures (1) are used to train employees and (2) serve as reference guides for appropriate actions to take during both normal operations and upset operating conditions. The operating procedures include steps for safely conducting activities and applicable process information, such as safe operating limits and consequences of process deviations. Safety and health considerations, such as chemical hazards, personal protective equipment requirements, and actions to take if exposure to a hazardous substance occurs are contained in the Process Safety Information documents.\n\n The facility personnel develop and maintain operating procedures that cover all phases of the operations, including initial start up, normal operations, normal shutdown, emergency shutdown, start up following a standby condition, and temporary operations. The facility reviews and certifies the operating procedures annually.\n\n·Training\n The Old Town Mill trains employees to safely and effectively perform their assigned tasks. The facility training program for process operators includes both the initial training and refresher training that covers (1) a general overview of the process, (2) the properties and hazards of the substance in the process, and (3) a detailed review of the process operating procedures and safe work practices. Written test and oral reviews are used to verify that the employee understands the training materials before the employee can operate the process.\n\n The operators are consulted about the frequency of the training and the materials to be used for the training. Recommendations from the operators are reviewed and changes to the training are implemented as appropriate.\n\n· Mechanical integrity\n The Old Town Mill maintains the mechanical integrity of the covered process equipment to help prevent equipment failures that could endanger workers, the public, or the environment. The"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 29031,
      "SummaryText": "ments has been completed if an existing process has been modified.\n\nA pre-startup review checklist is completed to document the review and to ensure that the appropriate issues have been addressed.\n\n·Compliance audits\nThe Old Town Mill audits the covered processes to be certain that the facility's prevention program is effectively addressing the safety issues of the operations. The facility assembles an audit team that includes personnel knowledgeable in the RMP rule and in the process, and this team evaluates whether the prevention program satisfies the requirements of the RMP rule and also whether the prevention program is sufficient to help ensure safe operations of the process. The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n\n· Incident investigation\nThe Old Town Mill investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented. The facility trains employees to identify and report any incident requiring investigation. An incident investigation team is assembled, and the investigation is initiated within 48 hours of the incident. The results of the investigations are documented, recommendations are resolved and appropriate process enhancements are implemented.\n\n \n·Employee participation\nThe Old Town Mill has developed a written employee participation program for the covered processes to help ensure that the safety concerns of employees are addressed. The facility encourages active participation from personnel in the development and maintenance of the prevention program activities of all processes at the facility. Employees are consulted on, and informed about, all aspects of the RMP rule prevention program, including the development of Process Hazard Analysis and Operating Procedures.\n\n·Hot work permit\nThe Old Town Mill has established a hot work permit program"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 29031,
      "SummaryText": "mechanical integrity program includes (1) an inspection and testing program to help identify equipment deterioration and damage before the equipment fails and (2) a quality assurance program to help ensure that new and replacement equipment meet the design standards required for service in The Old Town Mill¿s covered processes. The mechanical integrity program also includes:\n -Specifications for inspection and testing of process equipment\n -Specifications for replacement parts and equipment\n -Standard maintenance procedures for inspecting, testing, and maintaining process equipment\n -Procedures for safe work practices such as lockout/tag out, hot work, confined space entry\n -Training of maintenance personnel\n -Documentation of maintenance activity\n\n· Management of change\nThe Old Town Mill ¿management of change¿ (MOC) program evaluates and approves all proposed changes to chemicals, equipment, and procedures for a covered process to help ensure that the change does not negatively affect safe operations. Process changes that are determined to be replacements in kind are allowed without completing an MOC form. All other changes must be confirmed through the full MOC program to help ensure that inadvertent consequences of the process changes are prevented, safety consequences of the changes are addressed, affected process safety information and operating procedures are updated, and affected employees are notified of the changes.\n\n· Pre-startup review\nThe Old Town Mill performs a safety review of new or modified equipment in the covered process before the process is placed into service to help ensure that the process has been prepared to operate safely. This review confirms that:\n -Construction and equipment are in accordance with design specifications\n -Adequate safety, operating, maintenance and emergency procedures are in place\n -Employee training has been completed\n -For a covered process, a PHA has been performed if the process is new or management of change require"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 29031,
      "SummaryText": "EXECUTIVE SUMMARY:  OLD TOWN MILL\n\nES.1 FORT JAMES OPERATING COMPANY¿S POLICIES ON ACCIDENTAL RELEASE PREVENTION\n\nCORPORATE COMMITMENT\n\nFort James Operating Company¿s basic commitment to responsible stewardship of the environment, protection of the community, protection of employee health, and assurance of product safety extends to the processes covered by the new EPA Risk Management Plan (RMP) requirements.  The Fort James Old Town Mill has developed management systems in compliance with various applicable regulations to prevent the release of regulated substances especially in locations that may cause detrimental effects to employees, the community, or the environment.  This is accomplished through a systematic evaluation of process design, process technology, operational procedures, maintenance activities, non-routine procedures, emergency preparedness, training, and several other factors.\n\nThe Fort James Operating Company has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, our trained personnel will respond to control and contain the release.\n\nThe Fort James Old Town Mill plans to meet or surpass all regulatory requirements.  In the attempt to accomplish this goal, the management systems at Old Town have been developed in such a way that the hazards are identified, understood, and controlled to prevent accidents.  The RMP regulated chemical is chlorine dioxide.\n\nThe Fort James Old Town Mill has developed a management system to oversee the implementation of the Risk Management Program in accordance with the requirements of 40 CFR Part 68, Subpart G.  The management system is summarized below.\n\nRisk Management Plan"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29031,
      "SummaryText": "esses. The facility ensures that this process safety information is maintained, accurate, and available to all employees, and the Local Emergency Planning Committee (LEPC). All of the information and documentation for the RMP Prevention Program is maintained at the facility. \n\n Material safety data sheets (MSDS) document the physical and chemical properties of the hazardous substances handled at the facility, including non-regulated substances in the covered process. MSDS's for hazardous substances handled in each process are available on the mill¿s intranet where operators can reference this information. In addition, MSDS's are provided to the LEPC and/or Plant Emergency Response Team for use in helping formulate emergency response plans\n\n Many of the operating parameters are included in the technology information to help with the safe operation of the process. These documents are also used (1) to train employees, (2) to perform process hazard analysis, and (3) to help maintain the equipment to the design specification.\n\n·Process hazard analysis\n The Old Town Mill performs and periodically updates process hazard analyses (PHAs) of the covered processes to help identify process hazards and generate recommendations that might improve the safe operation of the process. A team composed of personnel with engineering and process operating experience and a team leader with experience in performing process hazard analyses is assembled to analyze the process. The facility primarily uses the ¿Hazard and Operability¿ (HAZOP) and/or the ¿Checklist¿ techniques to perform this analysis. The PHA team prepares a written report describing the results of the analysis, including recommendations. Responsibility for resolving the recommendations is assigned to personnel and, when appropriate, changes to enhance the safety of the process are implemented.\n\n·Operating procedures\n Old Town Mill operators, supervisors, and engineers work together to develop and maintain accurate operating p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29031,
      "SummaryText": "¿ Management Organization\n\nThe Old Town Mill Site Manager has the overall responsibility for ensuring that the facility operates in a safe and reliable manner. This responsibility includes overseeing the implementation of the elements of the Risk Management Program. The Site Manager has assigned the Chemical Process Safety Coordinator the responsibility of overseeing the Accidental Release Prevention Program. The structure of this program is summarized below.\n\nAccidental Release Prevention Program ¿ Chemical Process Safety Coordinator\n·Off-site Hazard Assessment ¿ Safety & Environmental Manager\n·Process Safety Management (PSM) ¿ Chemical Process Safety Coordinator & PSM Committee\na)Process Safety Information ¿ Assistant Superintendent\nb)Process Hazard Analysis ¿ Assistant Superintendent\nc)Operating Procedures ¿ Assistant Superintendent / Area Superintendent\nd)Training ¿ Assistant Superintendent\ne)Mechanical Integrity ¿ Mechanical Integrity Coordinator\nf)Management of Change ¿ Assistant Superintendent \ng)Pre-startup Safety Review ¿ Assistant Superintendent\nh)Compliance Audits ¿ Chemical Process Safety Coordinator\ni)Incident Investigation ¿ Assistant Superintendent\nj)Employee Participation ¿ Chemical Process Safety Coordinator\nk)Hot Work / Safe Work Practices- Safety & Environmental Department\nl)Contractors ¿ Safety & Environmental Department\n (Note: A description of these PSM elements can be found later in the document)\n·Emergency Response Program ¿ Emergency Management Coordinator \n\nES.2 DESCRIPTION OF OLD TOWN MILL, REGULATED SUBSTANCE AND REGULATED PROCESSES\n\nMILL DESCRIPTION\n\nThe Old Town Mill of Fort James Operating Company manufactures kraft market pulp and tissue products.  It is located on the Penobscot River in Old Town, Maine. \n\nThe facility produces northern hardwood pulp.  Hardwood pulp is produced in two Kamyr kraft continuous digesters. Hardwood pulp from the two digesters is combined and piped to the bleach plant.  The bleaching operations use chlorine"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29031,
      "SummaryText": "dioxide, sodium hydroxide, hydrogen peroxide and oxygen.  Emissions from the chlorine dioxide stages of the bleach plant are collected and scrubbed with white liquor in a packed tower scrubber.  Chlorine dioxide is generated on-site and stored as a dilute aqueous solution.  The emissions from this process are also controlled by a packed tower scrubber.\n\n\nREGULATED SUBSTANCES AND PROCESSES\n\nThe Old Town Mill operates a process that has more than a threshold quantity of a regulated substance: chlorine dioxide generation and storage.  This process stores chlorine dioxide solution in a 190,000 gallon storage tank at typical concentrations of 9.5 grams per liter. The maximum concentration (before interlocks) is 11.5 grams per liter. A full storage tank at this concentration is equivalent to 18,235 lbs of chlorine dioxide. \n\nSince the resulting toxic endpoint distance predicted for the worst-case release of chlorine dioxide potentially encompasses public receptors, and the bleaching process is subject to OSHA¿s Process Safety Management (PSM) standard, this process is subject to Program 3 requirements. \n \n\nES.3 ACCIDENTAL RELEASE PREVENTION PROGRAM STEPS AT THE OLD TOWN MILL\n\nPREVENTION PROGRAM\n\nThe Old Town Mill of Fort James Operating Company has developed and implemented an accidental release prevention program to continuously comply with OSHA¿s 29 CFR 1910.119, Process Safety Management of Highly Hazardous Chemicals and EPA¿s 40 CFR Part 68 subpart D, Accidental Release Prevention provisions in the Risk Management Program.  The prevention program thus developed and implemented consists of the twelve elements listed below.\n\n·Process safety information\n The Old Town Mill maintains a variety of technical documents that are used to help ensure the safe operation of the processes. The documents address (1) the hazards of the chemicals used in the process, (2) the technology data of the process and (3) the design basis and configurations of the equipment used in the proc"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 29031,
      "SummaryText": "herefore, such a scenario is included in the Risk Management Plan for administrative completeness.\n\nChlorine dioxide has a molecular weight that is substantially greater than that of ambient air.  For this reason, a concentrated plume resulting from a large accidental release would display dense-gas behavior.  That is, the near-field dispersion would be controlled by gravitational slumping caused by the density difference.  EPA's 1996 RMP Off-site Consequence Analysis Guidance (OCAG) lists a number of refined dense-gas dispersion models that are available for off-site hazard assessment applications for risk management programs.  Among these models is the DEnse Gas DISpersion (DEGADIS) Model (Version 2.1).  DEGADIS, developed by the U.S Coast Guard and the Gas Research Institute to simulate dispersion of dense-gas releases, is the only dense-gas model included in U.S. EPA¿s Guideline on Air Quality Models (40CFR Parts 51 and 52, Appendix B).  DEGADIS has therefore been used to model the chlorine dioxide worst-case release. \n\nThe modeling was conducted using the prescribed weather conditions of 1.5 meters per second wind speed and F stability.  These low dispersion conditions are common at night with fair skies.   No passive mitigation measures were considered for this hypothetical release.  \n\nThe toxic endpoint for chlorine dioxide is set by regulation to 1 ppm (0.0028 mg/L).  This is equal to the Immediately Dangerous to Life or Health (IDLH) level of 10 ppm, divided by a safety factor of 10 to account for sensitive individuals.  The IDLH, developed by the National Institute of Occupational Safety and Health (NIOSH) is intended to protect healthy workers from irreversible health effects or escape-impairing symptoms for exposures of up to 30 minutes.\n\nUnder Section 68.22 (e), the RMP rule identifies ¿surface roughness¿ as a parameter to be specified in the hazard assessment. The surface roughness affects the amount of dispersion that occurs within a released plume"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 29031,
      "SummaryText": "to control spark or flame- producing activities that could result in fires or explosions in covered processes at the facility. The facility reviewed OSHA's fire prevention and protection requirements in 29 CFR 1910.252(a) and created a Hot Work Permit form to comply with these requirements. A supervisor from the area where the work is taking place is required to fill out the Hot Work Permit form prior to the work beginning.\n\n·Contractors\nThe Old Town Mill has established a program to help ensure that contractor activities at the facility are performed in a safe manner. The program reviews the safety record of all contractors to help ensure that the facility only hires contractors who can safely perform the desired job tasks. The facility explains to the contract supervisors the hazards of the process on which they and their employees will work, the safe work practices, and the emergency response procedures. The contractor supervisors are required to train each of their employees who will work on or near a covered process before that employee begins work at the site. The facility periodically reviews contractors' training documents and work performance to ensure that safe practices are followed.\n\n\nThe Fort James Operating Company concurs with US EPA¿s assessment that, ¿Prevention of accidental releases requires a holistic approach that integrates technologies, procedures, and management practices¿.  Therefore, Old Town Mill¿s prevention program is designed to provide for ongoing management of highly hazardous substances.  It is not a list of ¿once and done¿ actions.  Rather it provides a means for assuring safe operations throughout the life of the facility.  To this end, the Old Town Mill utilizes modern computer managing techniques in coordination with plant-wide awareness to ensure continued fulfillment of prevention requirements.\n\nES.4 5-YEAR ACCIDENT HISTORY AT THE OLD TOWN MILL\n\nThe Fort James Operating Company has an outstanding record of accident prevention o"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 29031,
      "SummaryText": "ver the past five years.  This good record is demonstrated by the lack of any accidental release which had offsite consequences over the past five years and by the decreasing frequency of any kind of accident.\n\n \nES.5 HAZARD ASSESSMENT\n\nThe hazard assessment evaluates the offsite consequences of accidental releases on public and environmental receptors.  Pubic receptors are offsite residences, institutions (such as schools and hospitals), commercial, and office buildings, parks, or recreational areas inhabited or occupied by the public at any time where members of the public could be exposed to toxic concentrations, radiant heat, or overpressure, as a result of an accidental release.  Environmental receptors are natural areas such as national or state parks, forests, or monuments; officially designated wildlife sanctuaries, preserves, refuges, or areas; and federal wilderness areas, that could be exposed at any time to toxic concentrations, radiant heat, or overpressure greater than or equal to the endpoints in the risk management program rule, as a result of an accidental release.\n\nThis section describes the worst-case and alternate scenario consequence analyses.  These analyses comprise the hazard assessment.\n\nES 5.1 Worst-Case Release Scenario Analysis for a Toxic Substance Release\n\nThe worst-case release scenario for a toxic substance at the Old Town Mill is a hypothetical release of the entire contents of a storage tank containing 190,000 gallons of chlorine dioxide solution.  In accordance with the definition of worst case for toxic gases under RMP regulations, the entire 18,235 lbs of chlorine dioxide were assumed to be released as a gas cloud from the spilled solution over a ten-minute period.  Based on the structural integrity of the tank and interconnected piping, The Old Town Mill considers such an event to have an extremely small probability of occurrence and, thus, not of practical interest in terms of risk management and emergency response planning.  T"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 29031,
      "SummaryText": "and influences the distance to toxic endpoint. The surface roughness used in determining the distance to toxic endpoint should be characteristic of the transport path of the plume from the release point to the endpoint distance.  ¿Urban¿ surface roughness indicates areas where there are many obstacles, such as industrial buildings or trees.  ¿Rural¿ indicates that there are few buildings or forests and that the terrain is generally flat and unobstructed. \n\nIn the immediate vicinity of the Old Town Mill, the aerodynamic surface roughness is clearly ¿urban¿ in nature, whereas at greater distances, the surface roughness is more ¿rural¿, especially along the Penobscot River.  In order to report the most conservative ¿distance to toxic endpoint¿ estimates in the Risk Management Plan, Fort James has elected to include only the modeling results obtained assuming ¿rural¿ surface conditions.  This is reflected in the use of a low 10 cm surface roughness in DEGADIS.\n\nThe modeling indicated a maximum distance of 9.3 miles to chlorine dioxide¿s toxic endpoint of 1 ppm (0.0028 mg/L).  An included file  illustrates the hypothetical 9.3-mile radius. The worst-case impact zone encompasses a resident population of approximately 32,500, based on the 2000 Federal Census (Census 2000 TIGER/Line Data).   The potential worst-case hazard zone includes schools, public recreation areas, environmental receptors (Sunkhaze Refuge) and industrial/commercial areas. \n \nES5.2 Alternate Release Scenario for Chlorine Dioxide \n\nChlorine dioxide solution is pumped from generation and storage to the bleach plant through a 6-inch diameter pipeline.  The chlorine dioxide pipeline is supported by a pipe bridge, which is approximately 250 feet long.  Normal solution strength is about 9.5 grams per liter.\n\nThis alternate-scenario is the rupture of the 6-inch diameter chlorine dioxide pipeline on the pipe bridge inside the bleach plant.  It is assumed that the approximately 250 feet of pipe would drain befor"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 29031,
      "SummaryText": "e the flow could be shutdown.  This would release 31.2 lbs of ClO2.  \n\nAlternative dispersion modeling was conducted using the U.S. EPA¿s RMP*Compä (Version 1.07) software. In accordance with the RMP rule, alternative releases are modeled under typical (rather than worst-case) dispersion conditions.  The EPA OCAG default dispersion conditions are neutral atmosphere, with dispersion neither enhanced nor limited (D stability and 3 m/sec wind speed).  No mitigation of the release was considered. Because the surface roughness in the immediate vicinity of the Old Town Mill is urban in nature, an urban surface roughness value was utilized in the alternative release modeling. \n\nThe estimated distance to toxic endpoint is 0.2 miles.  A graphical representation of this scenario is included.  The alternative impact zone encompasses an estimated residential population of approximately 52 persons, based on the 2000 Federal Census (Census 2000 TIGER/Line Data).  Public receptors in the alternative impact zone include industrial/commercial areas. No environmental receptors would be affected.\n\nES.6 EMERGENCY RESPONSE PROGRAM AT THE OLD TOWN MILL\n\nThe Fort James Operating Company Old Town Mill maintains a comprehensive written emergency response program to protect plant workers, the general public and the environment.  The program includes plans and procedures for responding to a wide range of events, caused either naturally or accidentally, which have the potential to result in a release of a regulated substance.  The Old Town Mill emergency response program utilizes the Incident Command System (ICS) which parallels the National Interagency ICS.  This is an ¿all risk¿ system developed for on-scene management of any emergency event.  The functional design of the ICS minimizes the impact of personnel changes upon the emergency plan.  Periodic emergency drills are conducted within the plant to maintain preparedness and to identify areas for improvement.  The emergency response progra"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 29031,
      "SummaryText": "m is updated when necessary, based on modifications made to the plant processes or facilities.  In addition, the plant has an emergency preparedness program that addresses maintenance, inspection and testing of response equipment as well as instructions and training that govern use of this equipment.\n\nThe overall emergency response program is coordinated with the LEPC.  This coordination includes periodic meetings of the committee, which includes local emergency response officials, local government officials, and industry representatives.  Old Town Mill has around-the-clock communications with the LEPC to ensure notification of the public in event of an incident, if necessary, as well as facilitating a quick response.\n\n\nES.7 PLANNED CHANGES TO IMPROVE SAFETY\n\nThe Fort James Operating Company continually strives to improve operations at its facilities in order to reduce the potential of an accidental release to the environment. To that end, the Fort James Operating Company Old Town Mill has replaced the chlorine bleaching system with an elemental chlorine-free system. The new system consists of chlorine dioxide oxidizing bleaching system. This change has resulted in the complete phase out of elemental chlorine from the Old Town Mill. The use of chlorine dioxide greatly reduces the risks of any potential off-site impacts associated with an accidental release, while also reducing the quantity of organically bound halide effluents produced in the bleaching process. The elimination of elemental chlorine in the bleaching process has reduced the worst-case distance to toxic endpoint.  Fort James believes that the conversion to an elemental chlorine-free bleaching process reduces potential risks to its employees, the local communities, and the environment."
    }
  ]
}