{
  "FacilityID": 29067,
  "FacilityName": "Rogas",
  "FacilityStr1": "21143 Stockdale Hwy",
  "FacilityStr2": "1 mi. East of Hwy 43 (Enos Lane)",
  "FacilityCity": "Bakersfield",
  "FacilityState": "CA",
  "FacilityZipCode": "93312",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.353333",
  "FacilityLongDecDegs": "-119.235278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Inergy,  L. P.",
  "Company2Name": null,
  "CompanyDUNS": 54331868,
  "Company2DUNS": 0,
  "OperatorName": "Inergy,  L.P.",
  "OperatorStr1": "P. O. Box 430",
  "OperatorStr2": "9224 Tupman Road",
  "OperatorCity": "Tupman",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92376",
  "OperatorZipCodeExt": "0430",
  "RMPContact": "Scott Jones",
  "RMPTitle": "Plant Manager",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000142703",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-03-21 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency PSM UNIT",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Inergy LLC",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-10-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-10-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-09-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-09-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 35.3952,
  "FRS_Long": -119.158,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41893,
      "AltID": "Rogas",
      "FacilityID": 29067,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 42842,
          "ProcessID": 41893,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 55105,
          "ProcessID": 41893,
          "ChemicalID": 155,
          "Quantity": 6705360.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 38636,
              "ProcessChemicalID": 55105,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 38637,
              "ProcessChemicalID": 55105,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 38638,
              "ProcessChemicalID": 55105,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 555105,
          "ProcessID": 41893,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29067,
      "SummaryText": "\n\nInergy, L.P. acquired the Rogas facility on October 1, 2003.  The Rogas Facility is a Liquefied Petroleum Gasoline (LPG) and Natural Gasoline Liquids loading and unloading rail car transfer facility.  The process is regulated by Title 40 CFR Part 68 Risk Management Plan and Title 19 California Code of Regulations 2735 California Accidental Release Prevention Program.  \n\nThe Rogas facility has recently been modernized through the addition of computer controls, the addition of rail spur, new loading/unloading rack and completion of all 1999 Process Hazard Analysis recommendations.  In addition, all piping and transfer control devices were replaced.  The facility design standards for the modernization included the 1997 Uniform Building Code, ANSI B31.3-1996 Process Piping, NFPA 58 Liquefied Petroleum Gas Code-2001, Federal Railroad Association and Department of Transportation.  Fire protection upgrades are compliant with the California Fire Code ? 1997 and Kern County Fire Department.  The fire protection system is new and includes fire monitors, fire hydrants, a 500,000-gallon fire water storage tank, and rail car deluge.  In addition, two tanks have been removed, thus reducing the risk by removing the permanent storage capacity at this facility.  This facility meets the requirements for a RMP/CalARP Program Level 2.  \n\nThe prevention program is based on the requirements of 40 CFR Part 68 and Title 19 CCR 2735 and includes the following: Offsite Consequence Analysis, Employee Participation, Process Safety Information, Process Hazard Analysis, Operating Procedures, Training, Contractor Evaluation, Contractors and Visitor Orientation, Pre-Job Start-Up Review, Mechanical Integrity, Code of Safe Work Practices (Hot Work Permit, Confined Space Entry, Control of Hazardous Energy), Management of Change, Incident Investigation, Emergency Planning and Response, and Compliance Audits. \n\nTraining includes employee responsibilities in the RMP/CalARP program, emergency response,"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29067,
      "SummaryText": " hot work permit procedure, code of safe work practices, and operating procedures. \n \nPlanned changes to improve safety have been established based on compliance with the process safety management audits and revalidation of the process hazard analysis. \n\nInergy, L.P. maintains an emergency response plan in compliance with local emergency response agencies.  Rogas Facility has a Hazardous Materials Business Plan on file with the Kern County Environmental Health Department ? Certified Unified Program Agency.\n\nIn the event of an accidental release, the facility operators are trained to shut off the source from a safe location or activate one of the emergency shutdown devices, contact 9-1-1 and secure the area.  The 9-1-1 system is used to notify the Fire Department.\n\nBased on the criteria set forth 40 CFR 68.10 and 19 CCR 2735.4, this facility has not had an accidental release.  This information was verified by the reviewing of records from the Kern County Environmental Health Department ? Certified Unified Program Agency.\n\nThe worst-case release scenario is based on the Environmental Protection Agency Offsite Consequence Analysis Guidance equations and model.  The worst-case scenario and alternate release scenario were based on Liquefied Petroleum Gas (LPG) as the modeled substance and one rail car releasing its full contents.  The worst-case release of 167,634 lbs of liquefied petroleum gas and indicates a one-psi overpressure distance of 0.45 miles. This distance impacts public receptors of an adjacent farm, chemical storage facility and a resident population of 22.  Although there are numerous controls in place, no credit for these controls were taken into account for evaluating the worst-case scenario.  \n\nThe Alternative Release Scenario for this process is a break in railcar transfer hose connection.  This scenario could result in release of 261 lbs of liquids over a ten-minute period. The maximum distance for this scenario is 0.05 miles. The process maintains mi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29067,
      "SummaryText": "tigation measures consisting of relief valves, check valves, manual shutoff valves, startup and operating procedures, grounding equipment, and excess flow devices.  In addition, there are automatic shutoffs valves on the rail car, loading rack, process piping, pumps, and compressors.  The facility operator is in attendance during transfer operations.\n\nIn May 1999, an external events analysis consisting of a preliminary seismic walkthrough was conducted.  This walkthrough was comprised of a visual inspection of the above grade process piping and vessels. The references used for the 1999 walkthrough were the following: \n\nAPI Standard 570 Pressure Vessel Inspection Code: Maintenance Inspection, Rating, Repair, and Alteration.\n\nUniform Building Code, 1997 Edition, International Conference of Building Officials.\n\nPlanned changes to improve the seismic safety of the facility were incorporated into the Process Hazard Analysis.  The planned changes and PHA recommendations were incorporated into the 2001 facility modernization and upgrade.\n\nThe design standards employed during the modernization included conformance to the most current design and operating standards, such as Uniform Building Code 1997, as well as other standards noted above.\n\nThe seismic walkthrough determined that based on the document Maps of Known Active Fault Near-Source Zones in California and Adjacent Portions of Nevada: Uniform Building Code 1997, this facility resides outside the boundaries and contours of a Near Source Fault Zone.\n\nInergy, L.P. has a commitment to employee and public safety. This commitment is demonstrated by maintaining the implementation of the process safety requirements already in place.  Furthermore, the resources invested in accident prevention, such as modernization of transfer operations, piping upgrades, training personnel and considering safety in design during construction and installation is an investment in good business practices.  Inergy?s policy is to implement reason"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29067,
      "SummaryText": "able controls to prevent foreseeable releases.  However, if a release does occur, trained personnel will respond to control and contain the release."
    }
  ]
}