{
  "FacilityID": 29176,
  "FacilityName": "Quarles Water Treatment Plant",
  "FacilityStr1": "4402 Lower Roswell Road",
  "FacilityStr2": null,
  "FacilityCity": "Marietta",
  "FacilityState": "GA",
  "FacilityZipCode": "30068",
  "Facility4DigitZipExt": "4233",
  "FacilityCountyFIPS": "13067",
  "LEPC": "Georgia Title III LEPC",
  "FacilityLatDecDegs": "33.963417",
  "FacilityLongDecDegs": "84.423139",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A6",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Cobb County ? Marietta Water Authority (CCMWA)",
  "Company2Name": null,
  "CompanyDUNS": 785430158,
  "Company2DUNS": 0,
  "OperatorName": "CCMWA",
  "OperatorStr1": "1660 Barnes Mill Road",
  "OperatorStr2": null,
  "OperatorCity": "Marietta",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30062",
  "OperatorZipCodeExt": "7535",
  "RMPContact": "James M. Parsons",
  "RMPTitle": "Director of Engineering",
  "FTE": 37,
  "OtherEPAFacilityID": "07-343-9382",
  "EPAFacilityID": "100000051588",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-10-23 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-11-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-11-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-11-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-05-28 00:00:00",
  "DeRegistrationEffectiveDate": "2008-10-13 00:00:00",
  "AnniversaryDate": "2008-11-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 33.96341,
  "FRS_Long": -84.42352,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42129,
      "AltID": "Quarles Chlorine Storage",
      "FacilityID": 29176,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 43078,
          "ProcessID": 42129,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 55460,
          "ProcessID": 42129,
          "ChemicalID": 62,
          "Quantity": 48000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 555460,
          "ProcessID": 42129,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29176,
      "SummaryText": "Introduction\nAs required by the Risk Management Program Rule, this section provides an executive summary of the chlorine storage and chlorination process at the CCMWA Quarles WTP, that will be submitted to EPA. This executive summary summarizes the accidental release prevention and emergency response policies, source description and regulated substances handled, worst-case and alternative release scenarios including mitigation measures, accidental release prevention program and chemical-specific prevention steps, 5-year accident history, emergency response program, and planned changes to improve safety. \nAdditionally, this risk management plan contains the data elements that will be submitted to EPA, given in Attachment 13-1. These data elements include registration, offsite consequence analysis, 5-year accident history, prevention program, emergency response program, and certification.\nExecutive Summary\nIntroduction\nLiquid chlorine containers are stored at the CCMWA's Quarles Water Treatment Plant (Quarles WTP). Chlorine gas drawn from the containers is used to disinfect water in order to provide safe water for consumption or for other uses. This document complies with the U.S. Environmental Protection Agency's (EPA's) Risk Management Program, under Section 112 (r) of the Clean Air Act Amendments (CAAA) of 1990, 40 Code of Federal Regulations (CFR) Part 68.\nPolicy Statement\nIt is the policy of CCMWA to operate the Quarles WTP safely, reducing to the greatest extent possible any hazards associated with the chlorine storage and chlorination system and reducing any subsequent risk to the surrounding community, personnel, and environment. Safe operation depends upon proper storage of chlorine, proper handling and maintenance of the chlorination system, and the use of inherent safety features in the design of the chlorination system. \nAccidental Release and Emergency Response Policies\nThe Quarles WTP accidental release prevention policy involves an integrated approach t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29176,
      "SummaryText": "hat combines the application of proven technology, training on operation and maintenance practices, and implementation of management system practices. The procedures of the Risk Management Program's Prevention Program are adhered to, including key elements such as training, systems management such as operating and maintenance procedures, and emergency response procedures. In addition, CCMWA has proactively installed a chlorine scrubber to minimize the consequences of chlorine in the event of an accidental release.\nThis policy includes working with the surrounding community and local emergency response agencies, to help implement an effective contingency plan in the unlikely event of a process incident occurring at the Quarles WTP. The emergency response plan includes procedures for notifying the Cobb County Fire and Emergency Services. \nThe Quarles WTP has a chlorination system that uses chlorine gas fed from liquid chlorine containers. The Quarles WTP facility has prepared a detailed and comprehensive emergency response plan to handle any potential accidental releases that is designed to safeguard both on- and off-site people. To date, the Quarles WTP has an excellent record in preventing accidents from occurring.\nGeneral Facility and Regulated Substance Information\nThe Quarles WTP facility, operating since 1953, is located in Cobb County, Georgia. The primary activity at the Quarles WTP is municipal water treatment, including chlorination of water for disinfectionl. The Quarles WTP underwent a capacity expansion from 64 to 86 MGD. The sludge lime by-product from the facility is applied to farm land.\nThe facility currently stores chlorine in 24 one-ton steel storage containers. This amount of chlorine storage exceeds the listed threshold quantity in the RMP Rule of 2,500 pounds. Some of the chlorine is used to generate chlorine dioxide, which is used as it is generated, and is not present in the process in amounts greater than the threshold quantity of 1,000 pounds"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29176,
      "SummaryText": " in the RMP Rule.\nThree chlorine leak detectors in the container storage area and one leak detector each in both the chlorinator room and the chlorine dioxide generator room continuously monitor for chlorine leaks. The facility also has additional alarms for process control. These alarms are annunciated at the chlorine central control panel at the Quarles WTP. \nThe cylinder storage area, the chlorinator room, and the chlorine dioxide generator room are enclosed in a building. A chlorine scrubber is located outside the cylinder storage area. In the event of a leak, the chlorine leak detectors sense the leak and send a signal to activate the scrubber. The exhaust fans pull the contaminated air in the chlorine storage room and route it to the scrubber. The scrubber is 98 percent efficient in capturing chlorine and converting it to an inert substance. The chlorine concentration in the scrubber exhaust would be less than NIOSH short-term exposure limit (SEL) of 3 ppm. Emergency showers and eye wash stations are provided at the building along with smoke alarms. \nOffsite Consequence Analysis Result\nThe offsite consequence analysis includes consideration of two release scenarios, identified as ?worst case? and ?alternative? release scenarios. The worst-case release scenario (WRS) requires that the single largest vessel or pipe be evaluated for off-site impacts from chlorine. An alternative release scenario (ARS) is also required for chlorine. \nWorst-Case Release Scenario\nOnly passive or administrative controls are allowed under the WRS to reduce off-site impacts. As required by the RMP Rule, the WRS used for the Quarles WTP is the rupture of one chlorine container with a maximum capacity of 1 ton, resulting in a release of 2,000 pounds of chlorine over a 10-minute duration. The chlorine cylinder storage area is in an enclosed building, which results in a 45 percent passive mitigation of any chlorine release. The release rate of chlorine to the atmosphere is reduced by 45 pe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29176,
      "SummaryText": "rcent due to passive mitigation by the enclosed building according to the guidance from EPA regarding control efficiencies levels for buildings storing chlorine. Therefore, the release rate will be 110 pounds per minute. \nThe released liquid is assumed to quickly volatilize and to disperse as a vapor cloud. The distance to the toxic endpoint was estimated to be 2.2 miles, using the EPA-approved model RMP Comp?. The chlorine toxic endpoint concentration set by the EPA is the same as the permissible exposure limit (PEL) of 3 ppm. In practice this type of total release of a cylinder would be unlikely and never occur during the lifetime of the plant. The model RMP Comp? estimates the distance to the chlorine toxic endpoint of 3 ppm taking into account the WRS input parameters such as wind speed of 1.5 meters per second, atmospheric stability class F, highest daily maximum temperature, and average humidity. The result of RMP Comp? for this WRS indicates that this scenario has an offsite impact.\nAlternative Release Scenario\nThe ARS is one that is more likely to occur than a WRS. Based on the process hazard analysis performed for the chlorine system, it was determined that the most likely scenario would be a chlorine gas leak from the gas side of the chlorine container or from the gas feed lines leading to the chlorinator. According to the Risk Management Program regulations, the mitigation from both active and passive controls can be factored in to determine the ARS chlorine release rate. The chlorine scrubber affords active control and the building enclosure provides passive control.\nFor the ARS, the unmitigated emission rate calculated by the EPA?s RMPComp? model for a chlorine leak from a hole of diameter 1/16th of an inch is 0.607 pound per minute. The amount of chlorine released, taking in to account active mitigation of 80 percent from the scrubber and passive mitigation of 45 percent from the building enclosure, was calculated to be 0.067 pounds per minute. The EPA"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 29176,
      "SummaryText": "-approved model, RMP Comp? was used to estimate the distance to the toxic end point of 0.1 mile. The model accounts for the more common meteorological conditions such as wind speed of 3.0 meters per second, atmospheric stability class D, average air temperature of 78 degrees F, and average humidity of 50 percent. The results of the dispersion modeling analysis for the alternative release scenario indicates that this scenario has an offsite impact.\nSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps\nThe CCMWA?s Quarles WTP is in compliance with the RMP Rule, 40 CFR 68. The facility has conducted a comprehensive review of the chlorine system, as well as of administrative, technical, operating and maintenance procedures, in addition to the other required program elements of the RMP rule. A hazard review was conducted at this facility using a ?What-If? analysis and a \"Hazard Review Checklist.\"\nChemical-specific prevention steps include availability of self-contained breathing apparatus, awareness of the hazardous and toxic properties of chlorine, an emergency chlorine scrubber, and the presence of chlorine detectors and alarms.\nThe Quarles WTP accidental release prevention program is based on the following key elements:\n1) Detailed management system and clear levels of responsibilities and team member roles\n2) Comprehensive safety process information that is readily available to staff, emergency responders, and contractors\n3) Comprehensive preventive maintenance program\n4) Participation of operation and maintenance staff in process hazard analysis of the process, the equipment, and the procedures\n5) Use of process and safety equipment meeting industry standard codes\n6) Use of accurate and effective operating procedures, written with operations and maintenance staff participation\n7) High level of training of operators and maintenance staff\n8) Implementation of an incident investigation, inspection, and auditing program using qualif"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 29176,
      "SummaryText": "ied staff\nFive-year Accident History\nThe CCMWA?s Quarles WTP has never had a release of chlorine resulting in deaths, injuries, property or environmental damage, evacuations, or sheltering in place. \nEmergency Response Program\nThe CCMWA?s Quarles WTP has an Emergency Response Program, which coordinates response efforts with the Cobb County Fire and Emergency Services' Hazardous Materials team, the police department, and the hospital. Response activities also have been discussed with the Cobb County Resource Council.\nPlanned Changes to Improve Safety\nIt was observed during the hazard review that the CCMWA?s Quarles WTP has the necessary equipment and the operating and training procedures required for the safe operation of the chlorination system. The following recommendation for improving the response to any chlorine leaks was made:\n1)  Provide additional wind socks to help determine the wind direction."
    }
  ]
}