{
  "FacilityID": 29253,
  "FacilityName": "Sara Lee Bakery -- Greenville",
  "FacilityStr1": "1916 Piedmont Highway",
  "FacilityStr2": null,
  "FacilityCity": "Greenville",
  "FacilityState": "SC",
  "FacilityZipCode": "29605",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45045",
  "LEPC": "Greenville County LEPC",
  "FacilityLatDecDegs": "34.789444",
  "FacilityLongDecDegs": "-82.423889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "AO",
  "LatLongDescription": "OT",
  "FacilityURL": "www.saralee.com",
  "FacilityEmailAddress": "http://www.saralee.com/ourcompany/contactus.aspx",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Sara Lee Corporation",
  "Company2Name": null,
  "CompanyDUNS": 97182828,
  "Company2DUNS": 0,
  "OperatorName": "Sara Lee Bakery Group",
  "OperatorStr1": "1916 Piedmont Highway",
  "OperatorStr2": null,
  "OperatorCity": "Greenville",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29605",
  "OperatorZipCodeExt": null,
  "FTE": 220,
  "OtherEPAFacilityID": "4504500241",
  "EPAFacilityID": "100000194764",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": "New Addition (Ammonia System Two) Initial RMP",
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-12-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-12-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-12-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-03-31 00:00:00",
  "DeRegistrationEffectiveDate": "2010-03-16 00:00:00",
  "AnniversaryDate": "2008-12-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42285,
      "AltID": "Ammonia System Two",
      "FacilityID": 29253,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 55670,
          "ProcessID": 42285,
          "ChemicalID": 56,
          "Quantity": 23637.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 43235,
          "ProcessID": 42285,
          "NAICSCode": "311812",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 24186,
              "Process_NAICS_ID": 43235,
              "SafetyReviewDate": "2003-11-03 00:00:00",
              "PHA_Date": "2003-12-05 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-03-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Closed circuit TV monitoring",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-12-08 00:00:00",
              "TrainingReviewDate": "2003-12-05 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": "New ammonia technician operator training -- on the job",
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-12-05 00:00:00",
              "EquipmentInspectionDate": "2003-12-05 00:00:00",
              "EquipmentTested": "Ammonia process -- thickness test throughout system",
              "ChangeMgmtDate": "2003-12-05 00:00:00",
              "ChangeMgmtReviewDate": "2003-12-05 00:00:00",
              "PreStartupReviewDate": "2003-12-11 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-12-05 00:00:00",
              "HotWorkPermitReviewDate": "2003-10-13 00:00:00",
              "ContractorSafetyReviewDate": "2003-10-21 00:00:00",
              "ContractorSafetyEvalDate": "2003-10-21 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Sara Lee Bakery of Greenville, South Carolina facility complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  This facility was designed and constructed in accordance with industry accepted practice and is in compliance with the Internation Institute of Ammonia Refrigeration ANSI/IIAR 2 Standard for \"Equipment, Design, and Installation of Ammonia Mechanical Refrigerating Systems\".  Management of the facility is strongly committed to employee and public safety and environmental protection.  This commitment is demonstrated by our comprehensive accidental release prevention practices which includes equipment design and installation, operating and maintenance procedures and employee training.  Our employees implement appropriate controls to prevent possible releases of regulated substances. If a release does occur, trained emergency response personnel are present to control and mitigate the effects of the release.  We also coordinate with the Greenville County Local emergency Planning Committee for additional emergency response expertise.\nAll of our Engineers, Operators and Technicians have been thoroughly trained using the International Institute of Ammonia Refrigeration R1 \"Guide to Good Practices for the Operation of an Ammonia Refrigeration System.\"",
              "_chemicals": [
                {
                  "PrimaryKey": 35521,
                  "PreventionProgram3ID": 24186,
                  "ProcessChemicalID": 55670
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 29253,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2003-10-03 00:00:00",
    "ERTrainingDate": "2003-05-23 00:00:00",
    "CoordinatingAgencyName": "Greenville County LEPC",
    "CoordinatingAgencyPhone": "8644672680",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29253,
      "SummaryText": "\n\n                                                                EXECUTIVE SUMMARY:\n\n1.     Accidental release prevention and emergency response policies:\n\nAt the Sara Lee Bakery Greenville, South Carolina we handle ammonia that is considered hazardous by EPA.  The same properties that make ammonia valuable as a refrigerant also make it necessary to observe certain safety precautions in handling ammonia to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as our co-workers, and to reduce the threat to nearby members of the community.  It is our policy to adhere to all applicable Federal and State rules and regulations.  Safety depends upon the manner in which we handle ammonia combined with the safety devices inherent in the design of this facility along with the safe operating procedures that we use and the training of our personnel.\n\n2.     The stationary source and regulated substances handled:\n\nThe primary purpose of the Sara Lee Bakery Greenville facility is the manufacture, packaging and distribution of baked and frozen goods.   Ammonia is used by the facility's refrigeration system to maintain various temperature levels required by production.  Ammonia is contained within a closed refrigeration system and brought into the facility only to charge the refrigeration system when required.  Access to the site is restricted to authorized facility employees, authorized management personnel and authorized contractors.  The regulated substance handled at the Sara Lee Bakery Greenville facility is anhydrous ammonia.\n\nThe maximum amount of ammonia that can be retained in the ammonia refrigeration systems is 32,338 pounds.  System one contains 8,701 pounds while system two contains 23,637 pounds.\n\n3.     The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario are as follows.\n\nWorst-Case Scenario  -  Fai"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29253,
      "SummaryText": "lure of the largest system two ammonia storage tank, the High Pressure Ammonia Receiver, when filled to the greatest amount allowed would release 10,300 pounds of ammonia.    \n\nThe distance to the endpoint for the worst-case scenario is 1.80 miles.  This release could have offsite consequences. \n\nAlternative Scenario  -  A pipe leak in the system two ammonia refrigeration piping system.  An ammonia leak forms in a part of the piping system at a release rate of 126 pounds per minute for 10 minutes.  The total quantity released would be approximately 1,260 pounds.  A wind speed of 3 meters per second was used for the scenario and it is assumed the contents released could result in a toxic exposure.\n\nThe distance to the endpoint for toxic exposure for the alternative scenario is less than .20 miles.  This release has the possibility of extending beyond the facility boundary.\n\n4.     The general accidental release prevention program and the specific prevention steps.\n\nThe purpose of the prevention program is to prevent or minimize the consequences of catastrophic releases of ammonia that may result in toxic hazards.  The prevention program applies to ammonia utilized in the Sara Lee refrigeration system covered by the EPA RMP standard and the process inventory of ammonia exceeding the specific threshold quantities for individual highly hazardous chemicals listed in CFR 40 Part 68.130 List of Substances.  The prevention program at the Sara Lee Greenville, serves as a means of ensuring that facility work processes conform to defined requirements through the preparation and effective implementation of procedures and instructions.\n\nRisk and process safety programs address the planning, organizing, implementing and controlling of each process as well as the identification of those responsible for managing, performing and verifying the work.  The prevention programs for program level 3 requirements are the same as OSHA PSM requirements with some terminology differences.  The "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29253,
      "SummaryText": "format and minimum policy considerations are based on the Risk Management requirements of the latest edition of the Code of Federal Regulations (CFR) 40 Part 68 \"Chemical Accident Prevention Provisions\".  The prevention program elements comprise twelve (12) major program elements that are aligned with OSHA's PSM standard CFR 29, Part 1910.119 \"Process Safety Management of Highly Hazardous Chemicals\".\n\nThe Sara Lee Greenville facility complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  This facility was designed and constructed in accordance with industry accepted practice and is in compliance with the International Institute of Ammonia Refrigeration ANSI/IIAR 2 Standard for \"Equipment, Design, and Installation of Ammonia Mechanical Refrigerating Systems\".  All Operators and Technicians have been thoroughly trained using the International Institute of Ammonia Refrigeration training materials.\n\n5.     Five-year accident history.\n\nThere have been three ammonia releases within the past five years.  Each of these releases occurred on the System 1 ammonia refrigeration system.  System 1, a non-covered process per the PSM regulation, has an inventory of 8,701 pounds.  In January 2003, the ammonia system was vandalized and a valve was left open.  Valve locks and a surveillance camera were added to the system to better protect the system from vandalism.  In July 2003, an automatic deluge system malfunctioned and caused the ammonia purger on the system to pump continuously.  Ammonia sensors were added to the deluge system to detect any unexpected ammonia in the wastewater stream.  In August 2003, a corroded pipe on the condenser purging system resulted in an ammonia release.  Extensive inspection and non-destructive testing was performed.  Any pipe deemed suspect, was replaced.  None of the above mentioned accidents resulted in any injuries or on-site or off-site consequences.\n\n6.     The emergency response program.\n\nAn"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29253,
      "SummaryText": " emergency response program has been implemented at the Greenville Plant.  This program contains procedures describing how the facility will respond to fires, ammonia leaks, and other emergencies.  The plan includes evacuation procedures.\n\nThe emergency response program includes the following elements:\n\n*   Evacuation Plan\n*   Procedures to Address Serious Accidents\n*   Ammonia Leak Procedures\n*   Emergency Medical Procedures\n\nThe program has been coordinated with the Greenville County Local Emergency Planning Committee.\n\n\n7.     Planned changes to improve safety.\n\nThe Sara Lee Greenville facility system for managing risk and process safety has been revised to include the original ammonia process as well as the recent addition.  Although the old process is under the 10,000 lb. threshold, the system has been included in the risk management and process safety management programs.  Additional ammonia sensors are planned for the facility as well as the addition of personnel to provide added surveillance. The new management system is to be formally implemented in early 2004."
    }
  ]
}