{
  "FacilityID": 29276,
  "FacilityName": "Nielsen & Bainbridge, LLC.",
  "FacilityStr1": "7830 West 71st Street",
  "FacilityStr2": null,
  "FacilityCity": "Bridgeview",
  "FacilityState": "IL",
  "FacilityZipCode": "60455",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17031",
  "LEPC": "Bridgeview Fire Department",
  "FacilityLatDecDegs": "41.763333",
  "FacilityLongDecDegs": "-87.815833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.nielsen-bainbridge.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 89405539,
  "ParentCompanyName": "Nielsen & Bainbridge, LLC.",
  "Company2Name": null,
  "CompanyDUNS": 89405539,
  "Company2DUNS": 89405539,
  "OperatorName": "Nielsen & Bainbridge, LLC.",
  "OperatorStr1": "7830 West 71st Street",
  "OperatorStr2": null,
  "OperatorCity": "Bridgeview",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60455",
  "OperatorZipCodeExt": null,
  "FTE": 70,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000184551",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-11-25 00:00:00",
  "SafetyInspectionBy": "Illinois State Fire Marshal",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-12-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-12-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-12-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-12-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 41.76318,
  "FRS_Long": -87.81618,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42308,
      "AltID": "Polystyrene Foam Product",
      "FacilityID": 29276,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 55699,
          "ProcessID": 42308,
          "ChemicalID": 118,
          "Quantity": 50000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 43258,
          "ProcessID": 42308,
          "NAICSCode": "32614",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 24200,
              "Process_NAICS_ID": 43258,
              "SafetyReviewDate": "2003-11-05 00:00:00",
              "PHA_Date": "2003-11-07 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Pressure Relief Valve",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Video Cameras Monitor Tank Area",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "New PHA for New Butane Tank",
              "OpProceduresReviewDate": "2003-11-05 00:00:00",
              "TrainingReviewDate": "2003-11-05 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-11-05 00:00:00",
              "EquipmentInspectionDate": "2003-11-25 00:00:00",
              "EquipmentTested": "Butane storage tank and associated piping",
              "ChangeMgmtDate": "2003-08-11 00:00:00",
              "ChangeMgmtReviewDate": "2003-11-05 00:00:00",
              "PreStartupReviewDate": "2003-11-05 00:00:00",
              "ComplianceAuditDate": "2003-11-25 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-11-05 00:00:00",
              "HotWorkPermitReviewDate": "2003-11-05 00:00:00",
              "ContractorSafetyReviewDate": "2003-11-05 00:00:00",
              "ContractorSafetyEvalDate": "2003-11-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 35539,
                  "PreventionProgram3ID": 24200,
                  "ProcessChemicalID": 55699
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 29276,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Bridgeview Fire Department",
    "CoordinatingAgencyPhone": "7089248250",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29276,
      "SummaryText": "Butane Risk Management Plan - Executive Summary\n\nIntroduction\nNielsen & Bainbridge, LLC. (NielsenBainbridge) will operate a foam manufacturing plant at 7830 West 71st Street in Bridgeview, Illinois (facility).  The facility is subject to the United States Environmental Protection Agency (USEPA) Risk Management Program as outlined in 40 CFR Part 68 because it will operate a 12,000-gallon (58,440 pounds) butane vessel that exceeds the established threshold quantity of 10,000 pounds established for regulated flammable substances.  With appropriate precautions, as described in the RMP, butane can be safely utilized at the facility.  \n\nNielsenBainbridge currently operates a foam manufacturing facility at 8301 South 77th Avenue in Bridgeview, Illinois, under the Risk Management Plan entitled Isopentane Risk Management Plan (EPA Identification Number 1100 0057 4049).  Currently, the facility is in the process of moving to a new building located at 7830 West 71st Street in Bridgeview, Illinois.  The facility is scheduled to be fully operational by January 2004.  \nThe facility will remain a foam manufacturing facility; however, butane instead of isopentane will be used during the foam manufacturing processes.  The facility will operate under the Butane Risk Management Plan prepared by CPI Environmental Services, Inc. and dated November 2003 at its new location.  \nButane Process\nThe facility will be utilizing a 12,000-gallon liquefied petroleum gas (butane) vessel.  Butane is stored in a pressurized aboveground vessel to keep it liquefied.  The butane vessel was constructed in accordance with ASME code and installed in conformation with the requirements of NFPA Standard #58.  Butane is delivered in a tanker truck by an outside vendor.  \nButane is a colorless, odorless liquid, which readily evaporates into a gas.  Its vapor pressure is approximately 17 psig at 70 degree F.  It is flammable and readily forms explosive air-vapor mixtures at ambient temperature.  It is heavier th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29276,
      "SummaryText": "an air, so it tends to sink towards the ground.  It can flow for long distances along the ground, and can collect in drains, gullies, and cellars.  \nButane will be used as a foam-blowing agent. The foam is utilized for various packaging applications.  In the foam manufacturing process, the blowing agent (butane) is injected into melted plastic pellets in an extruder at temperatures of 375-440 degree F along with color additives and aging agents.  The mixture exits through a specially designed die head with a resultant loss of pressure, allowing the blowing agent to expand to ambient pressure, which in turn, transforms the plastic into a foamed material.  \n\nThe storage vessel has been installed outdoors within a secured area away from general manufacturing and work areas where employees may reside.  The tank area is equipped with video surveillance and is protected with bollards and a concrete wall, which surrounds the tank.  In addition, engineered safety devices installed include emergency shutoff devices, high and low pressure shut down devices, hydrostatic and pressure relief valves, excess flow valves, check valves, vapor recovery, pressure transducers, and gas detection alarm and shutdown system.\nHazard Assessment\nA hazard assessment, including offsite consequence analysis, has been prepared for the facility to evaluate hazards associated with a potential release of butane from a worst-case release scenario and an alternative release scenario.  The USEPA¿s RMP*Comp model (1.07 version) was used to perform offsite consequence analyses.  \nWorst-Case Release Scenario\nThe worst-case release scenario was assumed to be the complete loss of contents of the 12,000-gallon liquefied gas vessel.  To allow for headspace and in accordance with the facility¿s standard operating procedure, the vessel will be loaded only to 85 percent of its full capacity.  Therefore, the RMP*Comp model simulates release of approximately 50,000 pounds of butane in form of a vapor cloud explosi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29276,
      "SummaryText": "on.  The RMP*Comp model predicted a downwind distance of 0.3 miles as the distance to the 1 psi overpressure endpoint based on the specified worst-case release.  \nBased on United States Geological Survey (USGS) 7.5 minute Berwyn, Illinois Quadrangle topographic map dated 1993 and inspection of the facility area, the following public receptors are located within the 0.3 mile radius of the butane vessel:  single family homes, a public recreation area, a commercial, and an industrial facility.  According to the Northern Illinois Planning Commission, the residential population within the 0.3-mile radius of the butane vessel is estimated to be 580 people.  The Northern Illinois Planning Commission uses Landview V Software that incorporates the most recent census data. \nThe facility has numerous safety features that make the worst-case release scenario highly unlikely.  The butane vessel is located within a fenced area protected with bollards and equipped with video surveillance.  Engineered safety devices include emergency shutoff devices, high and low pressure shut down devices, hydrostatic and pressure relief valves, excess flow valves, check valves, vapor recovery, and gas detection alarm and shutdown system.\nAlternative Release Scenario\nThe alternative release scenario analyses evaluate conditions that will lead to releases caused by punctured pipe or tank.  The USEPA¿s RMP*Comp model was used to determine the distance to the endpoint of the lower flammability limit due to a vapor cloud fire originated from release of butane caused by a punctured inlet pipe. Based on pump rate (150 gallons/min), length of inlet pipe (20 feet), and diameter of the inlet pipe (2 inch), it is estimated that approximately 160 pounds (33 gallons) of butane will be released before the shutoff valve is activated.  The RMP*Comp model simulation predicted butane dispersing to less than 0.1 mile radius of the vessel in the downwind direction.  \nBased on USGS 7.5 minute Berwyn, Illinois Quadran"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29276,
      "SummaryText": "gle topographic map dated 1993 and inspection of the facility area, the following public receptors are located within the 0.1 mile radius of the vessel:  twenty five (25) single family homes, one commercial building and one industrial facility.  The residential population within the 0.1-mile radius of the vessel is approximately 63 people (assuming 2.5 people per household). \nFive-Year Accident History\n\nNielsenBainbridge has been in operation as a foam manufacturer since 1997 and has had no reportable accidents in the last five years.  Nielsen Bainbridge will thrive to maintain this status at its new location.\n\nGeneral Accidental Release Prevention Program \nNielsenBainbridge has a thorough Emergency Action Plan which covers emergency preplanning, evacuation procedures and agency notification procedures as required by OSHA under 29 CFR 1910.38.  NielsenBainbridge has an extensive safety training program including fire extinguisher use, CPR and first aid training, lockout/tagout procedures, and emergency action procedures.  Safety training is required as part of the annual refresher courses and for new employees.  Evacuation drills are performed annually.\n\nNielsenBainbridge has a thorough Process Safety Management (PSM) Program as required by 29 CFR 1910.119.  As part of the PSM, a process hazard analysis was performed using a ¿What If¿ scenario in conjunction with a process flow diagram.  The effects of fire, explosion, and equipment failure were evaluated as part of the hazard analysis.  The facility has an inspection and preventative maintenance program for the butane vessel and process equipment.  The program includes operating procedures for the safe operation of the system, specific requirements for safe work practices regarding such actions as welding, and safety requirements for contractors.  The facility has a procedure in place for investigating incidents, identifying the cause, and implementing corrective actions thereby, minimizing the potential for recurr"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 29276,
      "SummaryText": "ence.  The program also will have a procedure for conducting compliance audits to ensure the PSM is being implemented at the facility.  Lastly, the PSM program will incorporate the facility¿s existing emergency action plan for emergency response and notification to proper agencies in the event of a butane release.    \nEmergency Response Plan\nNielsenBainbridge has notified the Bridgeview Fire Department regarding the butane tank, its location and capacity.  In case of fire, the facility¿s fire alarm will be activated and the Bridgeview Fire Department will be notified automatically.  Therefore, the facility is not required to have an Emergency Response Plan since the facility is not equipped to respond to accidental releases of butane beyond what can be controlled with a facility fire extinguisher.\nThe facility¿s Emergency Action Plan included in the Process Safety Management Compliance Manual contains the names and telephone numbers of the local and state agencies that will be contacted in case of emergency. \nNielsenBainbridge is tentatively scheduled to be fully operational at the new facility by January 2004.  The new facility has been engineered to provide a safe and efficient work environment.  As the new facility comes into full operation, it may be discovered that aspects of the RMP do not adequately describe facility operations, required training, preventative maintenance, etc.  When such discoveries are made, the RMP shall be revised accordingly."
    }
  ]
}