{
  "FacilityID": 29282,
  "FacilityName": "Sun Pacific Maricopa Packing House",
  "FacilityStr1": "31452 Old River Road",
  "FacilityStr2": null,
  "FacilityCity": "Bakersfield",
  "FacilityState": "CA",
  "FacilityZipCode": "93311",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.068694",
  "FacilityLongDecDegs": "-119.129639",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PC",
  "FacilityURL": "www.sunpacific.com",
  "FacilityEmailAddress": "lerdo@sunpacific.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Sun Pacific Corp.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Sun Pacific",
  "OperatorStr1": "33374 Lerdo Highway",
  "OperatorStr2": null,
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93308",
  "OperatorZipCodeExt": null,
  "FTE": 200,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000184579",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-11-12 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-12-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-12-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-12-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-12-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 35.071676,
  "FRS_Long": -119.129673,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42317,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 29282,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 55709,
          "ProcessID": 42317,
          "ChemicalID": 56,
          "Quantity": 15900.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 43267,
          "ProcessID": 42317,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 24204,
              "Process_NAICS_ID": 43267,
              "SafetyReviewDate": "2003-11-20 00:00:00",
              "PHA_Date": "2003-11-24 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Diffusion tanks",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-11-20 00:00:00",
              "TrainingReviewDate": "2003-11-20 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-11-20 00:00:00",
              "EquipmentInspectionDate": "2003-11-20 00:00:00",
              "EquipmentTested": "All ammonia equipment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2003-11-20 00:00:00",
              "PreStartupReviewDate": "2003-11-10 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-11-20 00:00:00",
              "HotWorkPermitReviewDate": "2003-11-20 00:00:00",
              "ContractorSafetyReviewDate": "2003-11-20 00:00:00",
              "ContractorSafetyEvalDate": "2003-11-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 35544,
                  "PreventionProgram3ID": 24204,
                  "ProcessChemicalID": 55709
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 29282,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Kern County Environmental Health",
    "CoordinatingAgencyPhone": "6618628700",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29282,
      "SummaryText": "SUN PACIFIC MARICOPA PACKING HOUSE\r\nEXECUTIVE SUMMARY\r\n\r\n\r\nAccidental Release Prevention and Emergency Response Policies\r\n\r\nSun Pacific utilizes anhydrous ammonia as a refrigerant in two separate \r\nrefrigeration systems at the Maricopa Packing House.  The \"degreening\" \r\nrefrigeration system is located in the southeast corner of the building and \r\nprovides process cooling for the facility's twenty degreening rooms.  The \"cold \r\nstorage\" refrigeration system in the northwest corner of the building provides \r\nprocess cooling for cold storage rooms and the loading dock area.   Since the \r\ncold storage refrigeration system handles more than 10,000 pounds of \r\nanhydrous ammonia, the Maricopa Packing House has developed and \r\nimplemented a process safety management (PSM) program for the refrigeration \r\nsystem.  \r\n\r\nAs part of the PSM program, Sun Pacific completed process hazard analyses, \r\ndeveloped written operating procedures, trained employees on the refrigeration \r\nsystems, conducted a pre-startup safety review, and developed a mechanical \r\nintegrity program for the ammonia equipment.  In addition to plant personnel \r\nmonitoring the operation of the refrigeration systems on a daily basis, Sun Pacific \r\nhas implemented a preventative maintenance program to ensure that the \r\nrefrigeration equipment is maintained in good operating condition.  Properly \r\nmaintained equipment reduces the risk of an accidental release.\r\n\r\nAdditionally, Sun Pacific emphasizes safe and environmentally sound operating \r\npractices and procedures through their employee training programs.  In addition \r\nto job specific and process specific training, operators and maintenance \r\npersonnel receive training in fire prevention, fire control, accident prevention, \r\nsafety, and first aid.  \r\n\r\nWhile it is Sun Pacific's objective to be a responsible citizen of the community in \r\nall of its business activities, the limited staff at the Maricopa Packing House \r\nprecludes emergency response operations.  As"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29282,
      "SummaryText": "such, an emergency action plan \r\nhas been prepared for the Maricopa Packing House and a chain of command to \r\nrespond to emergencies has been established.\r\n\r\nSun Pacific has developed a detailed Compliance Audit Checklist which is used \r\nto evaluate compliance with the Process Safety Management (PSM) and RMP \r\nregulations.  At least every three years, Sun Pacific audits these programs and \r\nany findings of noncompliance are documented and responded to and the \r\ndeficiencies are corrected.\r\n\r\nDescription of the Stationary Source and Regulated Substances \r\n\r\nSun Pacific owns and operates the Maricopa Packing House located at 31452 \r\nOld River Road (approximately one mile north of Highway 166).  The closest \r\npopulation center to the packing house/cold storage facility is the community of \r\nMettler, which is approximately 10 miles east of the facility.\r\n\r\nSun Pacific's Maricopa Packing House was constructed during 2003 and began \r\nhandling fruit in November 2003.  Anhydrous ammonia is used as the refrigerant \r\nin two separate refrigeration systems that provide process cooling for the \r\ndegreening rooms and the cold storage facilities.  The \"degreening\" refrigeration \r\nsystem consists of three rotary screw compressors, an evaporative condenser, a \r\nhigh pressure receiver, a medium temperature recirculation accumulator \r\nequipped with redundant liquid ammonia pumps, and twenty degreening room \r\nevaporators.  The degreening refrigeration system is located in the southeast \r\nportion of the building.\r\n\r\nThe \"cold storage\" refrigeration system consists of a suction accumulator with a \r\nliquid transfer system, three rotary screw compressors, two evaporative \r\ncondensers, a high pressure receiver, eight cold storage rooms, and the \r\nassociated hallway, staging and shipping areas.  The cold storage refrigeration \r\nsystem is located in the northwest portion of the building with the cold storage \r\noperations occupying the west side of the facility.\r\n\r\nDuring normal operation, th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29282,
      "SummaryText": "e anhydrous ammonia is distributed throughout the \r\nrefrigeration systems.  However, during shutdowns or major maintenance \r\nactivities, each refrigeration system can be \"pumped down\" to evacuate the \r\nammonia from the system and store it in the high pressure receiver.  The cold \r\nstorage refrigeration system contains the largest quantity of ammonia at the \r\nMaricopa Packing House.  The maximum quantity of ammonia that can be stored \r\nin the cold storage refrigeration system high pressure receiver is approximately \r\n15,900 pounds (85% receiver capacity).  \r\n\r\nFor purposes of the offsite consequence analyses, the RMP regulations (40 CFR \r\nPart 68) define the toxic endpoint for anhydrous ammonia as 0.14 mg/l (200 \r\nppm).  \r\n\r\nWorst Case Release Scenario and Alternative Release Scenario\r\n\r\nOffsite consequence analyses are used as tools to assist in emergency response \r\nplanning.  The RMP regulations require the owner or operator of a stationary \r\nsource to analyze the offsite impacts due to an accidental release of a regulated \r\nsubstance.  The offsite consequence analysis for a Program 3 process must \r\nanalyze the worst case release scenario and an alternative release scenario.  \r\nSince the Maricopa Packing House cold storage refrigeration system is \r\nconsidered a Program 3 process, both release scenarios were evaluated in the \r\noffsite consequence analysis.\r\n\r\nThe offsite consequence analysis must include an estimate of the residential \r\npopulation within an area potentially affected by the accidental release scenario.  \r\nThis area is defined as a circle with a radius equivalent to the distance the \r\nrelease would travel with concentrations at or above the endpoint.  The circle \r\nalso defines the area in which potential environmental receptors must be \r\nidentified.\r\n\r\nThe worst case release is defined by the U.S. EPA as the total release of the \r\ncontents of the single largest vessel or pipe within 10 minutes.  For liquefied \r\ngases stored under pressure, the entire"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29282,
      "SummaryText": "contents of the vessel or pipe are \r\nassumed to be released as a vapor.  A total vapor release is highly unlikely.  \r\nHowever, this standardized worst case scenario was developed for emergency \r\nresponse agencies to use for planning purposes.\r\n\r\nIn the selection of the worst case release scenario, the RMP regulations also \r\nrequire the analysis of an additional scenario if such a scenario would result in a \r\ngreater distance to an endpoint beyond the facility boundary.  This additional \r\nscenario would be based on smaller quantities handled at higher process \r\ntemperature or pressure and proximity to the boundary of the facility.  \r\n\r\nDue to the distance between the two refrigeration systems (located on opposite \r\nsides of the building), worst case release scenarios were investigated for each \r\nsystem.  In the cold storage refrigeration system at the Maricopa Packing House, \r\nthe high pressure receiver is the largest ammonia containing vessel in the \r\nsystem.  In the degreening refrigeration system, the recirculator package vessel \r\nand the high pressure receiver have almost the same storage capacity (the \r\nrecirculator package can store approximately 16 gallons more than the receiver).  \r\nAs such, a catastrophic failure of the high pressure receiver was selected as the \r\nworst case release scenario for the cold storage refrigeration system while the \r\nrecirculator package was used for the degreening refrigeration system.  No other \r\nvessel or pipeline release of ammonia from the respective systems would result \r\nin worst case release scenarios with a greater distance to an endpoint.  \r\n\r\nThe worst case release scenario from the Maricopa Packing House was the total \r\nrelease from the high pressure receiver in the cold storage refrigeration system.  \r\nAir dispersion modeling was conducted for the release of 15,900 lbs. of ammonia \r\nover a 10 minute period within the cold storage refrigeration system engine room.  \r\nIn this worst case release scenario, the plume would"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 29282,
      "SummaryText": "travel 1.7 miles at \r\nconcentrations at or above the endpoint.  Using 2000 Census data, the \r\npopulation potentially affected within the worst case release scenario circle is 12 \r\npersons.  There are no sensitive receptors or environmental receptors within the \r\nworst case release scenario circle.\r\n\r\nAn alternative release scenario is a release that is more likely to occur than the \r\nworst case release scenario.  For the Maricopa Packing House, the alternative \r\nrelease scenario was selected based on the results of the Process Hazard \r\nAnalysis (PHA) for the ammonia-based refrigeration systems.  A credible release \r\nevent with a high discharge rate would potentially have the greatest offsite \r\nimpact.  A failure of one of the pump seals in the degreening refrigeration system \r\nwas identified in the PHA as having a medium probability of occurrence with a \r\ndischarge rate high enough to cause an offsite impact, and therefore, was \r\nchosen as the alternative release scenario.\r\n\r\nIn the alternative release scenario, a failure of a pump seal was modeled as a \r\nrelease of liquefied ammonia stored under pressure.  For a release of 9.786 \r\nlb/min of anhydrous ammonia within the engine room, the model calculated that \r\nthe plume would travel less than 0.1 mile at concentrations at or above the \r\nendpoint.  No residences are located within the 0.1 mile radius from the engine \r\nroom at the Sun Pacific facility.  As such, there would be no population impacts \r\nfrom the alternative release scenario.  There were also no sensitive receptors or \r\nenvironmental receptors within the alternative release scenario circle. \r\n\r\nThe ammonia refrigeration equipment, except for the evaporative condensers, is \r\nlocated within a building, which would greatly reduce the impact of a release.  \r\nThe modeling performed as part of this offsite consequence analysis includes a \r\nmitigation factor which assumes that the release is within an enclosed space, in \r\ndirect contact with the outside air."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 29282,
      "SummaryText": "General Accidental Release Prevention Program and Chemical-Specific \r\nPrevention Steps\r\n\r\nA PSM program, which meets the requirements of the general accidental release \r\nprevention program, has been developed for the Maricopa Packing House to \r\naddress the anhydrous ammonia system.  The PSM program includes the \r\nfollowing chemical-specific prevention steps:\r\n\r\n.\tWritten process safety information, including information pertaining to the \r\nhazards of ammonia, the technology of the process, and the equipment in \r\nthe process has been compiled.\r\n\r\n.\tAn initial Process Hazard Analysis (PHA) was performed and will be \r\nupdated and revalidated at least every five years.\r\n\r\n.\tWritten operating procedures have been developed and implemented, and \r\nare reviewed at least annually.\r\n\r\n.\tSafe work practices, such as lockout/tagout, confined space entry, \r\nopening process equipment or piping, and control over entrance into the \r\nfacility have been developed and implemented.\r\n\r\n.\tEach employee involved in operating the ammonia system has received \r\ninitial training and refresher training at least every three years.\r\n\r\n.\tWritten mechanical integrity procedures have been established and \r\nimplemented.\r\n\r\n.\tA Management of Change (MOC) program has been developed and \r\nimplemented to address all proposed changes to the ammonia system.\r\n\r\n.\tPre-startup safety reviews are performed when a modification is made to \r\nthe ammonia system that is significant enough to require a change in the \r\nprocess safety information.\r\n\r\n.\tAudits are conducted at least every three years to evaluate compliance \r\nwith the CalARP regulations.\r\n\r\n.\tIncident investigation procedures have been established.\r\n\r\n.\tA written plan of action regarding the implementation of employee \r\nparticipation has been developed and implemented.\r\n\r\n.\tHot work permits are issued for all hot work operations conducted on or \r\nnear the ammonia system.\r\n\r\n.\tA Contractor Safety Policy has been developed and implemented.\r\n\r\nTo ensure"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 29282,
      "SummaryText": "that the general accidental release prevention program and the \r\nchemical-specific prevention steps are implemented, Sun Pacific has assigned \r\noverall responsibility for the RMP elements to the Maricopa Packing House \r\nGeneral Manager.  The Maricopa Packing House General Manager has the \r\noverall responsibility for the development, implementation, and integration of the \r\nRMP elements.\r\n\r\nFive-Year Accident History\r\n\r\nSun Pacific has not had any accidental releases from the Maricopa Packing \r\nHouse ammonia-based refrigeration systems that have resulted in deaths, \r\ninjuries, or significant property damage on site, or known offsite deaths, injuries, \r\nevacuations, sheltering in place, property damage, or environmental damage in \r\nthe last five years.\r\n\r\nEmergency Response Program\r\n\r\nSun Pacific has established an emergency action plan and a chain of command \r\nto respond to emergencies at the Maricopa Packing House and to notify \r\nemergency responders when there is a need for a response.  However, an \r\nemergency response program does not need to be developed for the facility \r\nsince Maricopa Packing House employees will not respond to accidental \r\nreleases of ammonia, the facility is included in the community emergency \r\nresponse plan, and appropriate mechanisms are in place to notify emergency \r\nresponders.  \r\n\r\nPlanned Changes To Improve Safety\r\n\r\nThrough the accidental release prevention program, Sun Pacific regularly \r\nevaluates the need for any changes to improve safety.  Currently, the Maricopa \r\nPacking House does not have any changes planned for the anhydrous ammonia-\r\nbased refrigeration systems to improve safety."
    }
  ]
}