{
  "FacilityID": 29324,
  "FacilityName": "Koch Nitrogen Company - Walton Terminal ET-8",
  "FacilityStr1": "7438 E CR 800 South",
  "FacilityStr2": null,
  "FacilityCity": "Walton",
  "FacilityState": "IN",
  "FacilityZipCode": "46994",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18017",
  "LEPC": "Cass County Emergency Mgmt Age",
  "FacilityLatDecDegs": "40.647222",
  "FacilityLongDecDegs": "-86.23",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 602084618,
  "ParentCompanyName": "Koch Mineral Services",
  "Company2Name": null,
  "CompanyDUNS": 6944334,
  "Company2DUNS": null,
  "OperatorName": "Koch Nitrogen Company",
  "OperatorStr1": "4111 E. 37th St. North",
  "OperatorStr2": null,
  "OperatorCity": "Wichita",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "67220",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000042946",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-01 00:00:00",
  "SafetyInspectionBy": "Internal Inspection",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-01-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-01-05 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-12-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 40.647222,
  "FRS_Long": -86.23,
  "FRS_Description": "OTHER",
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42449,
      "AltID": "Storage & Transportation",
      "FacilityID": 29324,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 55906,
          "ProcessID": 42449,
          "ChemicalID": 56,
          "Quantity": 140000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 55907,
          "ProcessID": 42449,
          "ChemicalID": 98,
          "Quantity": 91000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 43401,
          "ProcessID": 42449,
          "NAICSCode": "49319",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 24301,
              "Process_NAICS_ID": 43401,
              "SafetyReviewDate": "1999-03-08 00:00:00",
              "PHA_Date": "1995-03-24 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1997-11-19 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-01-01 00:00:00",
              "TrainingReviewDate": "1998-12-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-01 00:00:00",
              "EquipmentInspectionDate": "1999-04-01 00:00:00",
              "EquipmentTested": "Emergency Power Generator",
              "ChangeMgmtDate": "1999-02-17 00:00:00",
              "ChangeMgmtReviewDate": "1998-03-11 00:00:00",
              "PreStartupReviewDate": "1999-03-11 00:00:00",
              "ComplianceAuditDate": "1998-02-02 00:00:00",
              "AuditCompletionDate": "1999-05-01 00:00:00",
              "IncidentInvestigationDate": "1998-10-21 00:00:00",
              "InvestigationChangeDate": "1999-02-10 00:00:00",
              "ParticipationPlansReviewDate": "1997-07-28 00:00:00",
              "HotWorkPermitReviewDate": "1997-04-08 00:00:00",
              "ContractorSafetyReviewDate": "1999-03-11 00:00:00",
              "ContractorSafetyEvalDate": "1998-11-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 35677,
                  "PreventionProgram3ID": 24301,
                  "ProcessChemicalID": 55906
                },
                {
                  "PrimaryKey": 35678,
                  "PreventionProgram3ID": 24301,
                  "ProcessChemicalID": 55907
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 29324,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-03-16 00:00:00",
    "ERTrainingDate": "1998-09-01 00:00:00",
    "CoordinatingAgencyName": "Cass County Emergency Mgmt Agency",
    "CoordinatingAgencyPhone": "0000000911",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29324,
      "SummaryText": "KOCH NITROGEN COMPANY\n\nWalton Terminal ET-4\nWalton, Indiana\n\nEXECUTIVE SUMMARY\nFOR \nTHE RISK MANAGEMENT PLAN (RMPlan)\n\n\nIntroduction and Policies\n\nKoch Nitrogen Company (KNC) is committed to being associated with unmatched environmental performance as measured by its employees, customers, regulators, and the public.  KNC¿s management philosophy goals are achieved by the personal commitments of employees and contractors and by open communication with employees, customers, neighbors, and regulators. \n\nThe purpose of this Risk Management Plan is to provide information about operations at the terminal, programs to prevent accidental chemical releases, emergency response plans in the event an accidental release should occur, the 5 year accident history of the terminal and planned changes to improve safety at the terminal.\n\n\nStationary Source and Regulated Substance\n\nThe Walton Terminal is one of many facilities owned and operated by KNC along a 2,000-mile pipeline supplying anhydrous ammonia to the Midwest corn belt where it is used primarily as a fertilizer.  At the terminal, anhydrous ammonia is delivered by pipeline and stored until it is loaded on to trucks for distribution.  \n\nAnhydrous ammonia is the only toxic substance regulated under the Risk Management Program (RMP) that is present at the Walton Terminal in amounts above threshold quantity.  The terminal is classified as Program Level 3 under the regulation. \n\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe accidental release prevention and emergency response programs in place at the facility are part of the high standards striven for by KNC.  These high standards are achieved by:\n\n·Operating in compliance with all required environmental permits and regulations. \n·Operating and maintaining the assets in such a manner that any release will be unintentional and acknowledged as unacceptable.\n·Correcting any non-compliance found during regular audits of the facility.\n·Reporting promptly to regul"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29324,
      "SummaryText": "ators any non-compliance found during the course of audits as required by law. \n\n\nWorst Case and Alternative Release Scenarios\n\nWorst Case Release Scenario\nAs defined by the U. S. Environmental Protection Agency (EPA) RMP Regulations, the worst case release scenario is ¿¿ the release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to an endpoint¿¿.  In the case of the Walton Terminal, this would involve a 30,000-ton refrigerated ammonia storage tank.  Using the EPA Offsite Consequence Analysis (OCA) methods, the distance ammonia vapors could travel in this hypothetical case would result in offsite impacts.  If such an incident occurred, an earthen dike that surrounds the storage tank would largely contain the liquid ammonia. \n\nAlternative Release Scenario\nThe alternative release scenario, characterized as a more likely scenario that could involve an offsite exposure to ammonia vapors, is the overfilling of the ammonia bullet tank as product is being delivered by pipeline to the facility.  Using the EPA OCA methods, the distance that ammonia vapors could travel in this case would result in offsite impacts.  If such an incident occurred, relief valves on top of the bullet would be activated during the filling process.  These valves ensure that the entire bullet does not rupture.\n\nThere are several active mitigation measures in place, which substantially reduce the chance that such an event could occur.  The level of liquid ammonia in the bullet is monitored on a continuous basis.  If this level becomes too high, a motor-operated valve on the inlet pipe to the bullet will close automatically.  If higher levels are then detected in the bullet, an additional reverse check valve will automatically close on the inlet pipe and will alarm through the Supervisory Control and Data Acquisition (SCADA) monitoring system in Wichita, Kansas.  Following receipt of the alarm, the dispatcher calls out the te"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29324,
      "SummaryText": "rminal manager or terminal personnel to respond to the alarm, determine the cause and take appropriate action.  High pressure in the ammonia storage bullet will similarly result in this check valve closing and activation of SCADA.  These active mitigation measures serve to either prevent this scenario from occurring or to minimize the impact if it does occur.\n\nThese potential ammonia releases have been communicated to the terminal employees and to local emergency response officials in Cass County.\n\n\nPrevention Program\n\nThe Walton Terminal has been operating under the guidelines of the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program since 1992.  Ongoing analysis of the potential hazards of the process, detailed training of employees and constant emphasis on safety have helped avoid any serious accidents over the last 5 years.  Part of this program has also involved identifying and taking steps to avoid potential accidental chemical releases.  A few examples of the prevention features implemented at this facility include:\n\n·Requiring trucks to have a brake interlock system that helps prevent a truck driver from driving away before the transfer hose is properly disconnected.\n·Ensuring no interruption in the combustion of ammonia vapors by having continuous pilots in the flares.\n·Ensuring that the refrigeration system and flare operate with minimal interruptions by having a backup connection to a second power grid and backup generators.\n·Ammonia sensors in the process areas and on the property detect ammonia and activate the SCADA monitoring system if the threshold for ammonia is exceeded.\n·Providing annual truck loading training to ensure driver safety. \n\nThese safeguards as well as the vigilance of KNC¿s trained employees have helped the facility operate safely since it was acquired in 1988.\n\n\nFive Year Accident History\n\nNo incident resulting in onsite or offsite impacts from an ammonia release has occurred at the Walton Te"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29324,
      "SummaryText": "rminal within the last five years.  Although the terminal takes pride in that record, daily emphasis is placed on the prevention and safety programs to ensure this record continues.\n\n\nEmergency Response Program\n\nThe terminal will continue to conduct emergency response preparedness activities and coordinate any emergency response actions necessary for the Walton Terminal with the Walton City Fire Department.  Also involved in emergency response for the facility would be the Cass County Sheriff and, as appropriate, the Memorial Hospital at Logansport, the Miami County REMC at Peru, the Indiana State Patrol.  The Walton Terminal Manager is responsible for coordinating all emergency actions.  A specific Emergency Response Plan for the terminal is in place and that plan has been coordinated with local officials.  The Emergency Response Program provides the essential planning for effectively protecting workers, the public, and the environment during emergency situations.\n\n\nPlanned Changes to Improve Safety\n\nDiligent compliance with the RMP Prevention Program forms the framework on which the level of safety at the Walton Terminal will continue to improve.  Some of the key components of the safety program are:\n\n·The Management of Change provisions ensure that the potential safety and health impacts of any change made to process chemicals, technology, equipment or procedures are considered.\n·The Process Hazard Analysis (PHA) provisions serve as a tool to ensure continual evaluation of potential hazards, thereby leading to continual improvements in safety standards.\n·The Mechanical Integrity provisions ensure that process equipment and instrumentation are designed, constructed, installed and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of the safety program.\n·Internal and third party compliance audits will ensure that the level of safety protection at the terminal is constantly being evaluated for improvements.\n·An ongoing dialogu"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 29324,
      "SummaryText": "e with the Cass County Emergency Management Director or his designate will ensure a constant state of readiness to respond to any potential emergencies, as well as a means to implement improvements as the need develops. \n\nAll interested citizens or community organizations are encouraged to contact the Cass County Emergency Management Director for the latest information on emergency response for the county.  The terminal plans to coordinate its response capabilities and personnel with those of the county on an ongoing basis."
    }
  ]
}