{
  "FacilityID": 29414,
  "FacilityName": "Natural Selection Foods, LLC.",
  "FacilityStr1": "3701 South Ave. 3 1/2 E.",
  "FacilityStr2": null,
  "FacilityCity": "Yuma",
  "FacilityState": "AZ",
  "FacilityZipCode": "85365",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04027",
  "LEPC": "Yuma County LEPC",
  "FacilityLatDecDegs": "32.658333",
  "FacilityLongDecDegs": "-114.5725",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "AO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Natural Selection Foods, LLC",
  "OperatorStr1": "1721 San Juan Highway",
  "OperatorStr2": null,
  "OperatorCity": "San Juan Bautista",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95045",
  "OperatorZipCodeExt": null,
  "FTE": 700,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000184873",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-01-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-01-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-01-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-01-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 32.65833,
  "FRS_Long": -114.5725,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42627,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 29414,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 56183,
          "ProcessID": 42627,
          "ChemicalID": 56,
          "Quantity": 17000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 43581,
          "ProcessID": 42627,
          "NAICSCode": "31199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 24439,
              "Process_NAICS_ID": 43581,
              "SafetyReviewDate": "2001-12-06 00:00:00",
              "PHA_Date": "2001-12-06 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-12-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Operator Error",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Diffuser Tank",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-11-14 00:00:00",
              "TrainingReviewDate": "2003-11-14 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Tail Gates",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-04-01 00:00:00",
              "EquipmentInspectionDate": "2003-11-14 00:00:00",
              "EquipmentTested": "All",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2003-04-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2001-12-06 00:00:00",
              "AuditCompletionDate": "2004-12-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-04-01 00:00:00",
              "HotWorkPermitReviewDate": "2003-04-01 00:00:00",
              "ContractorSafetyReviewDate": "2003-04-01 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "The Natural Selection Foods facility utilizes anhydrous ammonia for use as a refrigerant in their cold rooms and process chilled water operations. Ammonia is the only regulated substance used at the facility. The system consists of portable skid mounted equipment located outside on a concrete slab. The highside skids consist of reciprocating compressors, evaporative condensers and high pressure receivers. The fixed high side consists of two screw compressors, frame mounted evaporative condenser and a high pressure receiver. The low side consists of a fixed low pressure recirculator, fixed fan coils, and chiller skids which consist of chiller evaporator plate, oil drain pot, and associated controls. There is also two fixed ammonia diffusion tanks. The system is based on a single stage vapor compression cycle.",
              "_chemicals": [
                {
                  "PrimaryKey": 35891,
                  "PreventionProgram3ID": 24439,
                  "ProcessChemicalID": 56183
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 29414,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2003-04-01 00:00:00",
    "ERTrainingDate": "2003-04-01 00:00:00",
    "CoordinatingAgencyName": "Yuma Fire Department",
    "CoordinatingAgencyPhone": "9283734850",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29414,
      "SummaryText": "STATIONARY SOURCE AND SUBSTANCE DESCRIPTION\nThe Natural Selection Foods facility is located at 3701 South Ave. 3 ? E, Yuma, Arizona. This facility utilizes anhydrous ammonia as a refrigerant in their cold rooms and process water chilling operations. Risk prevention and emergency response procedures are in place at this facility\nThe refrigeration installation for the facility consists of both fixed equipment and portable skid or trailer mounted equipment and all have safeties to detect unsafe operating conditions.  Fixed components include two screw compressors, an evaporative condenser, high pressure receivers, low pressure recirculators, ammonia diffusion tanks, and fan coils installed in the cold rooms. The fixed system supports cold storage and water chilling.  There are ammonia detectors in the cold rooms for alarming.  The fixed and portable systems have no detection since the units are outdoors.  Operators are present to monitor these units when they are running.  There is a list of responders experienced with ammonia refrigeration that would respond and determine specific responses for any incident.  Safeties and detection equipment are tested and maintained by experienced maintenance personnel as spelled out in the SOPs (Standard Operating Procedures) and the maintenance program. The portable units include  reciprocating compressors along with the associated evaporative condensers and electrical controls. The portable systems are in place and operating during the salad processing season from November through April.. \nAnhydrous ammonia (NH3) is a gas in its natural state and is extremely irritating to mucous membranes and lung tissue. The gas is pungent and may be suffocating as shortness of breath and labored breathing can develop if inhaled. Prolonged inhalation of high concentrations may cause bronchitis and/ or pneumonia, with some residual reduction in pulmonary functions. Repeated or prolonged contact of high concentrations of ammonia to the skin can ca"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29414,
      "SummaryText": "use frost bite, redness, pain and serious skin burn.* \n\nRELEASE PREVENTION AND EMERGENCY RESPONSE POLICY\nThe Natural Selection Foods facility utilizes pre-startup equipment inspections prior to equipment operations at the site. This includes reviews by certified refrigeration contractors and registered engineers. This pre-startup review is used to determine areas of equipment or operations that may predispose the system to accidental releases.\nEmergency response training will be conducted yearly for current employees and as required for new employees.  Records will be kept of all training performed at the site for a minimum of five (5) years.\nOFFSITE CONSEQUENCE ANALYSIS\nAn offsite consequence analysis for an ammonia release was performed. Both the worst case and an alternative release scenario were modeled for this RMP/PSM utilizing a computer modeling program (ALOHA). The worst case scenario had a toxic endpoint calculated at 2.1 miles. The residential population affected by this worst case release is estimated to be 8,013. The alternative release scenario had a toxic endpoint calculated at 0.23 mile. There is no residential population affected by this alternative case release. \nWORST CASE AND ALTERNATIVE RELEASE SCENARIOS\nWORST CASE SCENARIO ? The worst case release is based on the release of  the maximum amount in the largest vessel of the largest system.  Release duration was 10 minutes with ambient conditions as required by EPA regulations.  This results in a 1,700 lbs./minute release for a total release of 17,000 lbs. The maximum radius of impact is 2.1 miles to a toxic end point of 200 ppm.\nALTERNATIVE RELEASE SCENARIO ? The alternate was a release for 25 minutes averaging approximately 121 lbs/minute.  This is a more probable release due to items such as rotating seals, pressure relief valves, leaks in piping, charging system or draining oil.  This scenario is based on a high pressure liquid release from a 1.4-inch diameter opening. This represents a potent"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29414,
      "SummaryText": "ial release from a flange or fitting separation. The maximum downwind distance to 200 ppm is 1,215 ft (0.23 mile) for average meteorology.\nACCIDENTAL RELEASE PREVENTION PROGRAM\nNatural Selection Foods maintains a release prevention program to eliminate or minimize releases.  The program includes regular inspections, monitoring equipment and logging conditions, scheduled maintenance, and operator training.  There is a program to analyze releases for ways to prevent a similar future release. \nThe ammonia refrigeration system has specific safety procedures to prevent a release.  Operators and mechanics are trained for safe operation and maintenance of the refrigeration system.  They are also trained in emergency response procedures in the event of an ammonia release.  There are emergency shut off switches for shutting down the system.  An alarm and detection system monitors the facility cold rooms for unsafe ammonia concentration levels and for operating conditions outside of safety set points.  There is an emergency control box for manual pressure release. Two ammonia diffuser tanks are also installed for portable and fixed systems and emergency control box and related system reliefs are tied into these tanks. Preventive maintenance and safety inspections are used to insure equipment and piping is maintained and operating in a safe manner.\nFIVE YEAR ACCIDENT HISTORY\nAccording to Natural Selection Foods Personnel, since startup there have been no releases of anhydrous ammonia resulting in reportable quantities or injuries.\nEMERGENCY RESPONSE PROGRAM\nNatural Selection Foods currently has no Business Response Plan. Upon completion, this plan will be inserted as Appendix-N to this RMP. However,  emergency contact personnel information, general emergency response procedures, hazardous material release reporting procedures are provided in Section-V of this RMP as Emergency Response Program..\nIn event of a release, certain personnel are designated to determine the potential "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29414,
      "SummaryText": "hazard and coordinate response procedures.  The emergency coordinator is responsible for contacting emergency response agencies, schools, daycare centers, and acute care facilities that may be effected by the release.  The coordinator will also be responsible for evacuation of employees if necessary, and for coordination with community emergency responders if off-site evacuations are required.  \nPLANNED SAFETY IMPROVEMENTS\nAll refrigeration equipment is well maintained and operated in a safe manner by trained personnel.  Operating, maintenance, training, and safety procedures will be formalized with improved written documentation."
    }
  ]
}