{
  "FacilityID": 29502,
  "FacilityName": "Nu-Foam Products, Inc.",
  "FacilityStr1": "1101 Wisdom Street",
  "FacilityStr2": "P.O. Box 5648",
  "FacilityCity": "Chattanooga",
  "FacilityState": "TN",
  "FacilityZipCode": "37406",
  "Facility4DigitZipExt": "0648",
  "FacilityCountyFIPS": "47065",
  "LEPC": "Hamilton County LEPC",
  "FacilityLatDecDegs": "35.058333",
  "FacilityLongDecDegs": "-85.266667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 161942743,
  "ParentCompanyName": "Ohio Decorative Products, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 5036264,
  "Company2DUNS": null,
  "OperatorName": "Nu-Foam Products, Inc.",
  "OperatorStr1": "1101 Wisdom Street",
  "OperatorStr2": "P.O. Box 5648",
  "OperatorCity": "Chattanooga",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37406",
  "OperatorZipCodeExt": "0648",
  "FTE": 80,
  "OtherEPAFacilityID": "TND 055 794 770",
  "EPAFacilityID": "100000059624",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-04-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-02-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-02-03 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-01-28 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 35.081572,
  "FRS_Long": -85.260499,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42734,
      "AltID": "Polyurethane Foam Manufac",
      "FacilityID": 29502,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 56320,
          "ProcessID": 42734,
          "ChemicalID": 44,
          "Quantity": 800000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 43688,
          "ProcessID": 42734,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 16503,
              "Process_NAICS_ID": 43688,
              "SafetyReviewDate": "2004-01-14 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2004-01-14 00:00:00",
              "ChangeCompletionDate": "2004-01-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "TDI Tank Level Alarms",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-01-16 00:00:00",
              "TrainingReviewDate": "2004-01-16 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-01-16 00:00:00",
              "EquipmentInspectionDate": "2004-01-16 00:00:00",
              "EquipmentTested": "Storage tanks and alarms.",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2004-01-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 17222,
                  "PreventionProgram2ID": 16503,
                  "ProcessChemicalID": 56320
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 29502,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-01-15 00:00:00",
    "ERTrainingDate": "2004-01-16 00:00:00",
    "CoordinatingAgencyName": "Hamilton County LEPC",
    "CoordinatingAgencyPhone": "4234951743",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 29502,
      "SummaryText": "r block valve.  Prompt response to such a release is possible because written operating procedures require a trained operator, with appropriate personal protective equipment nearby, to continuously monitor TDI railcar unloading.  The resulting pool of TDI on the ground would spread to cover an area of approximately 32,800 ft2 with a depth of 0.4 inches and evaporate to form a toxic cloud that would disperse downwind.  Refined dispersion modeling predicts that the distance from the pool to the TDI toxic endpoint concentration of 1.0 ppm would not impact any different off-site receptors than the worst-case scenario and would impact one offsite receptor instead of three.\n\nThe general accidental release prevention program and specific prevention steps\n\nThe plant has implemented programs and procedures that comply with EPA¿s Level 2 Accidental Release Prevention Program Rule.  Our facility qualifies for Level 2 coverage because (1) our worst-case release scenario for TDI can impact persons across the property boundary of the nearest public receptor, (2) TDI is exempt from OSHA¿s process safety management standard, and (3) our polyurethane foam process has not been targeted by the EPA for Level 3 coverage.  Our accidental release program is designed to systematically accomplish the following functions:\n\n· Control the creation and retention of safety information regarding the regulated substances, processes, and equipment\n \n· Conduct hazard reviews to identify, evaluate, and control process hazards associated with the regulated substances, processes, and procedures\n \n· Create, maintain, and evaluate operating procedures for activities within or near processes that use regulated substances\n \n· Provide training for personnel who operate covered processes so that they safely perform their jobs\n \n· Monitor and control maintenance activities that can affect the mechanical integrity of equipment used in covered processes\n \n· Confirm through compliance audits that RMP practices a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 29502,
      "SummaryText": "t the plant are consistent with our written programs and that the programs are adequate to address all of the requirements of the RMP rule\n \n· Ensure that process incidents, particularly those of catastrophic magnitude or potential, are thoroughly investigated using our incident investigation procedures and that relevant findings are communicated throughout the plant to help prevent recurrence\n\n \n One feature of our program that goes beyond the RMP regulatory requirements in a number of ways is our management of change program, which is designed to ensure that proposed changes to our covered process are evaluated and approved before being implemented and that inadvertent or unintended changes are prevented.\n \n The TDI process at our plant has hazards that must be managed to ensure continued safe operation.  The prevention program outlined above is applied to the TDI process.  Collectively, these prevention program activities help prevent potential accidental releases that could be caused by equipment failures, human errors, and management system failures.\n \n In addition to the accidental release prevention program, our plant has safety features on many units to help (1) quickly detect a release, (2) contain or control a release, and (3) reduce the consequences of or mitigate a release.  The following types of safety features are used in various units of the TDI process:\n \n· Release Detection \n \n· Process alarms (e.g., high level alarms and flow cutoff relays on the TDI storage tanks)\n· Continuous operator surveillance (e.g., during TDI tanker unloading and TDI supply to the foam process)\n \n· Release Containment/Control\n \n· Curbing or dikes to contain TDI liquid releases\n· TDI storage tanks located inside an enclosed building\n· Automated shutdown systems for critical process parameters (e.g., high pressure)\n· Pressure relief devices on equipment to prevent rupture\n· Valves to permit isolation of process equipment\n· TDI railcar inner tank surrounded by an outer shell"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 29502,
      "SummaryText": "filled with insulation\n· Vapor displaced from storage tanks during unloading is vented through a carbon filter\n \n· Release Mitigation\n \n· Fire suppression and extinguishing systems\n· Trained emergency response personnel\n· Personal protective equipment (e.g., protective clothing, self-contained breathing apparatus)\n \n Five-year accident history\n \n We have had no releases of TDI in the last 5 years that resulted in deaths, injuries, or significant property damage on site, or known deaths, injuries, evacuations, sheltering-in-place, property damage, or environmental damage off site.  We have had one small release of TDI over the past 5 years.  That release was less than 100 lb of TDI and was quickly neutralized and remediated. The release was not large enough to result in injuries or significant damage and was exempt from reporting requirements due to the small quantity.. \n \n Emergency response program\n \n Our emergency response program is based on the requirements in OSHA¿s emergency action plan regulation, OSHA¿s hazardous waste and emergency operations regulation, and EPA¿s emergency response program requirements in its RMP rule.  Our program includes procedures for responding to a release of TDI.  Our procedures address all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident cleanup and decontamination requirements.  In addition, the plant has procedures that address maintenance, inspection, and testing of emergency response equipment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is updated when necessary, based on modifications made to plant processes or other facilities, by using management of change procedures.  Personnel affected by changes in the progr"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 29502,
      "SummaryText": "am are informed and trained on those changes.\n \n The emergency response plan for the plant is coordinated with the LEPC.  This coordination includes providing them with a copy of the ERP and subsequent telephone call and invitation to tour the plant.  The plant has around-the-clock communications capability with the appropriate LEPC officials and emergency response organizations such as the fire department.  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  \n \n Planned changes to improve safety\n \n We strive to improve the safety of our TDI process through periodic safety reviews.  Our hazard review and incident investigation programs are especially designed to identify needed process safety improvements, some of which result in changes to the process.  The RMP is viewed as a living document and will be subject to revisions as appropriate, based on process changes and on-the-job evaluations of existing procedures, which will then be submitted to the Management Review Committee prior to implementation of recommended changes.\n \n Past changes to improve safety\n\n· Provided high-level alarm of the TDI and other feeds to prevent overfilling the TDI storage tanks\n \n· Revised operating procedures to resolve findings from the latest TDI process hazard review."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 29502,
      "SummaryText": "EXECUTIVE SUMMARY\n\nAccidental release prevention and emergency response policies\n\nAt the Nu-Foam Products, Inc. (Nu-Foam) plant in Chattanooga, Tennessee, we handle toluene diisocyanate (TDI), which is considered hazardous and is regulated by the EPA.  The same properties that make TDI valuable for use at our facility also make it necessary to observe certain safety precautions in the handling of the substance.  TDI is considered a toxic substance, and associated safety precautions have been implemented to (1) prevent unnecessary human exposure, (2) reduce the threat to the health of our employees at the Nu-Foam Chattanooga plant, and (3) reduce the threat to nearby members of our community.  It is our policy to adhere to all applicable federal and state rules and regulations.\n\nWe are committed to the safety of our employees and the public, and to the preservation of the environment, through the prevention of accidental releases of hazardous substances.  Successful implementation of our accidental release prevention program will help ensure that emergencies are unlikely and reduce the likelihood that emergency response procedures will be needed.  Nevertheless, an emergency such as a release of TDI is possible.  We have emergency response procedures to help ensure that accidents will be mitigated properly without undue risk to the public, environment, employees, contractors, or other personnel within the plant.\n\nDescription of the facility and the regulated substances handled\n\nThe primary purpose of this facility is to produce polyurethane foam, which is sold to other facilities and is used to produce furniture, bedding, carpet padding and a number of other products.  TDI is one of the reactants required to produce our polyurethane foam.  TDI is received by railcar and by tank truck, and is stored in two indoor storage tanks.  The maximum quantity of TDI stored in the process (i.e., in storage tanks and in up to seven standby railcars) at our plant is about 750,000 l"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29502,
      "SummaryText": "b.  The TDI is piped to a mix head where it is mixed with other reactants to produce a slab of polyurethane foam.  The foam products are shipped to customers by truck.\n\nTDI is the only substance handled at our plant that is regulated by EPA¿s risk management program (RMP) rule.  This substance is covered because the maximum quantity contained in our TDI process exceeds EPA¿s threshold quantity of 10,000 lb for TDI.\n\nOffsite consequence analysis of release scenarios\n\nWe performed an offsite consequence analysis (OCA) to estimate the potential for an accidental release to affect the public or the environment.  The OCA consists of evaluating worst-case release scenarios and alternative release scenarios (ARSs).  We do not expect a worst-case release scenario to ever occur.  An ARS represents a release that might occur during the lifetime of a facility like ours.  ARSs can help us to work with the local emergency planning committee (LEPC) to improve the community emergency response plan.\n\nThe main objective of performing the OCA is to determine the distance at which an accidental release might affect the public (the endpoint distance).  The following could occur at the endpoint distance: Most people at the endpoint distance of a toxic substance release like TDI would be able to walk away from the exposure without any long-term health consequences, although some short-term consequences (e.g., strong eye or throat irritation) are likely.  Some people who are particularly susceptible to the released substance could be incapacitated.\n\n\t[Note: The following sections entitled Worst-case release scenario and Alternative release scenario are similar to those contained in EPA and industry guidance documents for risk management plans (RMPlans).  The EPA recently decided not to include on the Internet the OCA data submitted in sections 2 ¿ 5 of the RMPlan.  In January 1999, the EPA also revised its guidance on the scenario sections of the Executive Summary to delete an earlier"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29502,
      "SummaryText": "instruction to identify the distance to the endpoints.  The current guidance remains to describe each of the plant¿s scenarios but it has been revised for the plant to indicate whether the release has offsite impact.  The following scenario sections conform to this latest EPA guidance.]\n\nWorst-case release scenario.  Catastrophic failure of a TDI railcar, having a capacity of 200,000 lb of TDI, would be a worst-case release for a toxic substance because a TDI railcar is the largest outdoor TDI container at the plant.  The TDI vendors limit the quantity of TDI loaded into a railcar to a maximum of 190,000 lb to allow space for thermal expansion during possible heating of the TDI.  During hot weather, the TDI temperature could reach the maximum ambient temperature of 97  °F.  We assumed the release would occur at 100 °F to be conservative and allow for a margin of error in release modeling.  We also assumed that the entire contents of the railcar would be released as a liquid, form a pool that would spread to cover an area of approximately ,000 ft2 with a depth of about 0.4 inches (1 cm), and evaporate to form a toxic cloud that would disperse downwind.  Given the presence of nearby buildings and trees surrounding the TDI railcar, the terrain was considered more urban than rural.  Refined dispersion modeling predicts that the distance from the railcar to the TDI toxic endpoint concentration of 1.0 ppm (0.007 mg/L) extends beyond the plant¿s property boundary and touches portions of three adjacent properties.\n\nAlternate release scenario.  Rupture of the transfer line from the railcar to the TDI storage tank would release TDI to the ground at a calculated rate of 5,800 lb/min.  We assumed that the TDI temperature in the railcar is typically 85 °F and that the railcar is pressurized with air at 30 psig to facilitate unloading.  We also assumed that the release would continue for the 20 minutes expected for an employee to be able to stop the release by closing the railca"
    }
  ]
}