{
  "FacilityID": 29512,
  "FacilityName": "Adel WPCP",
  "FacilityStr1": "1325 Honeymoon Lane",
  "FacilityStr2": null,
  "FacilityCity": "Adel",
  "FacilityState": "GA",
  "FacilityZipCode": "31620",
  "Facility4DigitZipExt": "6010",
  "FacilityCountyFIPS": "13075",
  "LEPC": null,
  "FacilityLatDecDegs": "31.121389",
  "FacilityLongDecDegs": "-83.39",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Mr. Dixon Sinclair",
  "OperatorStr1": "112 N. Parrish Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Adel",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31620",
  "OperatorZipCodeExt": "2721",
  "RMPContact": "Mr. Dixon Sinclair",
  "RMPTitle": "Wastewater Superintendent",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000184999",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-02-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-02-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-02-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-03-24 00:00:00",
  "DeRegistrationEffectiveDate": "2008-01-24 00:00:00",
  "AnniversaryDate": "2009-02-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 31.12139,
  "FRS_Long": -83.39,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42748,
      "AltID": "Chlorine disenfection",
      "FacilityID": 29512,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 43702,
          "ProcessID": 42748,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 56338,
          "ProcessID": 42748,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 556338,
          "ProcessID": 42748,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29512,
      "SummaryText": "The City of Adel, situated in South Georgia, is upgrading their water pollution control plant (WPCP) to provide extra disinfection for effluent discharged into Bear Creek.  The WPCP treats all of the wastewater received from the City?s sewer distribution network.    A chlorine injection system comprised of liquid chlorine cylinders, chlorination equipment instrumentation, electrical equipment and process specific safety equipment will be installed.  Two one-ton cylinders (2,000 pounds each) of chlorine will be stored in the chlorination building adjacent to the chlorine contact chamber.  Piping leads from the cylinders to the injection equipment in the chlorine contact chamber.  This system will be operational June 1, 2004.\n\nThe Risk Management Program for the Adel WPCP addresses all applicable procedures of 40 CFR 68.170 and provides for employee safety, public health and response agency interaction.  It details the hazard assessment, prevention program and an emergency response program.  The Adel Chlorine RMP includes the following key elements to mitigate the effects of potential chlorine release hazards: safety parameters for entire chlorination process; hazard review of all potential hazards associated with handling, storing and using chlorine; safe operating procedures; operator training; preventive maintenance plan; and auditing and inspection programs.  The City of Adel has an active environmental, health and safety program and the following elements specifically supporting the safe handling of chlorine and the chlorine process:  Emergency Action Plan, Emergency Response Training and coordination with local responders.\n\nAccidental Release Prevention and Emergency Response Policies ? A vacuum regulator is attached to the valve of the chlorine container.  Tubing that supplies chlorine to the injector is connected the vacuum regulator.  If there is any leak or loss of pressure in the tubing, the vacuum regulator automatically shuts off the valve.  Chlorine dete"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29512,
      "SummaryText": "ctors and alarms are set at a detection limit of 1.0 ppm. \n\nAccidental release modeling was performed to determine potential consequences associated with accidental chlorine release in worst case and alternative release scenarios.\n\nWorst Case Release Scenario ? The \"worst case? scenario was defined as the sudden release of the entire contents of one of the one-ton (2,000 pounds) containers.  The chlorine would be released in a gas state over a 10-minute interval.  For the ?worst case? scenario to occur the container would have to fail from a catastrophic event.  Even though this scenario is unlikely, atmospheric dispersion modeling was used to determine the distance traveled by the chlorine release before its concentration decreases to a theoretical toxic endpoint.  The American Industrial Hygiene Association defined this as \"the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing life-threatening health effects.\"  The residential population within the toxic endpoint distance was used to estimate the potential population affected.  A toxic endpoint distance of 3 miles was calculated, which potentially affects 3,260 households.\n\nAlternative Release Scenario ? The \"alternative release\" scenario is defined as more likely to occur than the worst case.  For the ?alternative release? scenario to occur someone would have to deliberately not attach the vacuum regulator to the container valve and deliberately open the container valve, allowing the release of a one-ton cylinder of chlorine over a one-hour period.  Using atmospheric dispersion modeling a distance of 0.38 miles was calculated for the alternative release scenario under normal atmospheric conditions.  Within this parameter, 24 residences were identified as potential receptors.\n\nFive-Year Accident History ? No chlorine has been stored at the Adel WPCP for the past five years; no reportable accidental releases h"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29512,
      "SummaryText": "ave occurred during that time.\n\nEmergency Response Program ? The Adel WPCP maintains an up-to-date and complete written Emergency Action Plan (EAP).  The WPCP operator is responsible for training all personnel on EAP procedures and updating the EAP annually.  Both the operator and his assistant, the only employees at the WPCP, are designated as emergency response team members and are trained to coordinate emergency responses with the Adel Cook Emergency Management Agency (EMA).  The actual concentration of chlorine gas from dual sensors is continuously displayed on a gas leak detector.  When concentrations exceed 1 ppm an alarm horn sounds."
    }
  ]
}