{
  "FacilityID": 2955,
  "FacilityName": "Clarksville Water Treatment Plant",
  "FacilityStr1": "          Pumping Station Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Clarksville",
  "FacilityState": "TN",
  "FacilityZipCode": "37041",
  "Facility4DigitZipExt": "0387",
  "FacilityCountyFIPS": "47125",
  "LEPC": "Montgomery County LEPC",
  "FacilityLatDecDegs": "36.497222",
  "FacilityLongDecDegs": "87.334722",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Clarksville",
  "Company2Name": null,
  "CompanyDUNS": 364402685,
  "Company2DUNS": 0,
  "OperatorName": "Clarksville Gas and Water Dept.",
  "OperatorStr1": "P.O. Box 387",
  "OperatorStr2": null,
  "OperatorCity": "Clarksville",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37041",
  "OperatorZipCodeExt": "0387",
  "FTE": 17,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000039488",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1992-02-17 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-06-25 00:00:00",
  "DeRegistrationEffectiveDate": "2004-06-21 00:00:00",
  "AnniversaryDate": "2004-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 36.54583,
  "FRS_Long": -87.35611,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3294,
      "AltID": "Chlorine disinfection",
      "FacilityID": 2955,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 3511,
          "ProcessID": 3294,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 3361,
          "ProcessID": 3294,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1056,
              "Process_NAICS_ID": 3361,
              "SafetyReviewDate": "1999-05-03 00:00:00",
              "PHA_Date": "1999-05-03 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-03 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-25 00:00:00",
              "TrainingReviewDate": "1999-05-10 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-27 00:00:00",
              "EquipmentInspectionDate": "1998-07-21 00:00:00",
              "EquipmentTested": "Vacuum regulator changeover units (2)",
              "ChangeMgmtDate": "1999-04-07 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-19 00:00:00",
              "PreStartupReviewDate": "1999-04-07 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-25 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-28 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-27 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1184,
                  "PreventionProgram3ID": 1056,
                  "ProcessChemicalID": 3511
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 2955,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-05-04 00:00:00",
    "ERTrainingDate": "1999-05-25 00:00:00",
    "CoordinatingAgencyName": "Montgomery Co. Emerg. Mgt. Assoc.",
    "CoordinatingAgencyPhone": "9316485702",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2955,
      "SummaryText": "Executive Summary For The\n\nCity of Clarksville, TN\n\nWastewater Treatment Plant\n\n    In general, accidental release of chlorine is prevented through the education and training of plant personnel from their date at this facility.  This is accomplished specifically with training in the following areas that includes, but is not limited to 1) proper handling of 1 ton chlorine cylinders (during loading and unloading of vendor conveyance) as well as elevated transit of containers to and from our chlorine storage/usage area, 2) proper installation and removal of valves and lines that convey chlorine gas from the chlorine vessel(s) to primary regulators, check units, and manifold assemblies, 3) service, maintenance, and calibration of chlorine leak detection and monitoring systems, 4) manual leak detection procedures (aqueous ammonia vapor application) at the container valves themselves, and 5) training in the proper use of the Self-Contained Breathing Apparatus (SCBA), 2 sets of which are maintained at the facility proper.\n    This facility is a 15 MGD (maximum capacity) wastewater treatment plant which currently averages approximately 9 MGD.  Wastewater at this site undergoes three major types of treatment carried out in a particular order to improve effluent quality.  They are Mechanical, Biological, and Chemical in nature and are applied to achieve an acceptable end product to be released into our receiving stream.  Disinfection is achieved through the use of chlorine gas injected into the effluent at the end of the process prior to being released to the effluent line (one mile in length) to subsequently empties into the receiving stream.  Current inventory (stored in 1 ton cylinders) averages 8 full cylinders for a total of approximately 16,000 pounds of gaseous chlorine.\n    For the purposes of this report, our worst-case scenario consists of a gas release resulting from a breach in the skin of a 1 ton cylinder (approximately 2,000 lbs. of gaseous chlorine).  The release rate i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2955,
      "SummaryText": "s approximately 200 pounds per minute and the release lasts for about 10 minutes resulting in the release, to the environment of the entire vessel's capacity.  Using the EPA's RMP Guidance for Waste Water Treatment Plants Reference Tables or Equations, it was determined that in an urban area with an Atmospheric Stability Class of F, and a wind speed of 1.5 meters per second, the distance to endpoint is 1.30 miles.  The estimated residential population within this area is 4,385.  This model, though thought to be accurate, does not take into account the mitigating effects of the enclosure which houses the chlorine vessels or a dike (primarily for flood control) around the entire facility.  It is assumed that the enclosure would slow the release of the chlorine to the environment and the dike could serve to contain it somewhat,  though the amount of  mitigation has not been determined at this time.\n    The alternative release scenario consists of a gas release resulting from pipe failure adjacent to the valves on a 1 ton cylinder (approximately 2000 lbs. of gaseous chlorine).  The release rate is approximately 9.0 pounds per minute and lasts for 60 minutes.  This results in a release of approximately 540 lbs. of chlorine gas to the environment.  Again, using the EPA's RMP Guidance for Waste Water Treatment Plant Reference Tables or Equations it was determined that in this area with an Atmospheric Stability Class of D, and a wind speed of 3.0 meters per second, the distance to endpoint is 0.08 miles.  The estimated residential population within this area is 17.  Again, the mitigating effects of the enclosure or the dike are not factored into this scenario.\n    Our accidental release prevention program is a model one.  We pride ourselves on the caution and skill with which we undertake all activities related to chlorine use and maintenance.  In light of the amounts we deal with this is not only a necessity, but smart.  We are pro-active about chlorine handling safety and maint"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2955,
      "SummaryText": "ain a \"one in, one out\" protocol whereby one man is within the enclosure connecting and disconnecting chlorine cylinders while another waits outside (with SCBA equipment at the ready) to be of assistance in the unlikely event of an accidental release.  We are currently in compliance with state-delegated OSHA requirements including the PSM portions as well as those of 29 CFR 1910.38.  In addition, we have electronic chlorine leak detectors within the chlorine room (enclosure) and the chlorinator room (site of rotameters, chlorine analyzer, etc.) as well.\n    The Clarksville Wastewater Treatment Plant has been extremely fortunate in that there have been no accidental chlorine releases in over 20 years.  However, our emergency response  programs are in place and ready should the need arise.  There are several HAZMAT teams within the city to respond to such incidents.  Some of these are comprised of teams organic to the fire department and others are based at the Montgomery County Emergency Management Association.  Public notification of a hazardous release would be accomplished through the local television and radio media organizations.  Persons in the hazard area could also be notified through neighborhood or house to house alerting.  Recent training received by plant personnel has included on-site demonstration of Computer Aided Modeling of Emergency Operations (C.A.M.E.O.) and Area Locations and Hazardous Atmospheres (A.L.O.H.A.) software systems currently in use by local HAZMAT teams.\n    Changes that are foreseen in the area of safety include increased training in scenario modeling to allow plant and emergency responders to become familiar with the most likely scenarios for accidental chlorine release based on the most frequent direction of prevailing winds at the plant.  A much safer and more practical method of chlorine-related procedures monitoring is also in the planning stages.  In this method, members of a nearby fire station would actually be standing by on-site "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2955,
      "SummaryText": "during tank connecting/disconnecting procedures.  Their expertise would no doubt greatly enhance operator safety and confidence during the previously mentioned and potentially hazardous procedures.\n    In closing, we wish to plainly state that our facility, its managers, and employees are making, and will continue to make every effort to ensure the continued safety of all those who live, work, or play around our facility.\n\n\n\n\n\n\n\n"
    }
  ]
}