{
  "FacilityID": 29561,
  "FacilityName": "MeadWestvaco Texas LP",
  "FacilityStr1": "Highway 105 South",
  "FacilityStr2": null,
  "FacilityCity": "Evadale",
  "FacilityState": "TX",
  "FacilityZipCode": "77615",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48241",
  "LEPC": "Jasper County LEPC",
  "FacilityLatDecDegs": "30.452",
  "FacilityLongDecDegs": "-94.0357",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.MeadWestvaco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 123675469,
  "ParentCompanyName": "MeadWestvaco",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Rodney G. Strong",
  "OperatorStr1": "P.O. Box 816",
  "OperatorStr2": null,
  "OperatorCity": "Silsbee",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77656",
  "OperatorZipCodeExt": null,
  "RMPContact": "Katherine Davis",
  "RMPTitle": "Environmental Manager",
  "FTE": 850,
  "OtherEPAFacilityID": "77656PLPPPPOB",
  "EPAFacilityID": "100000074876",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O1265",
  "SafetyInspectionDate": "1999-05-14 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-02-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-02-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-02-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-02-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 30.34417,
  "FRS_Long": -94.05222,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42835,
      "AltID": "Chlorine Dioxide",
      "FacilityID": 29561,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 43790,
          "ProcessID": 42835,
          "NAICSCode": "32213",
          "_desc": {
            "NAICS_CODE": "32213",
            "NAICS_DESCRIPTION": "Paperboard Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 56442,
          "ProcessID": 42835,
          "ChemicalID": 71,
          "Quantity": 41630.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 71,
            "ChemicalName": "Chlorine dioxide  [Chlorine oxide (ClO2)]",
            "CASNumber": "10049-04-4",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 556442,
          "ProcessID": 42835,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29561,
      "SummaryText": "\n\n\n\n\n\n\n\n\n\n\nRISK MANAGEMENT PLAN\n\n\n\n\n\n\n\n\n\n\n\n\n\nMeadWestvaco Texas, L.P.\n\nEvadale Mill\n\nEvadale, Texas\n\n\n\n\n\n\n\n\n\n\n\n\n\nJuly 10, 2003\n\n\n\n\n\n\n\nEXECUTIVE SUMMARY\n\nRISK MANAGEMENT PLAN\n\n\n\n\n\nMEADWESTVACO TEXAS, L.P. - EVADALE, TEXAS\n\n\n\n\n\nMeadWestvaco Texas, L.P. (MeadWestvaco) owns and operates a pulp and paper mill in Evadale, Texas.  MeadWestvaco is committed to operating the mill in a manner that is safe for its employees, the public, and the environment.  As a demonstration of that commitment, MeadWestvaco has developed and implemented Environmental, Safety and Health policies to serve as guiding principles for all MeadWestvaco employees and operations.  The Environmental Policy includes the following:\n\n\n\n\"MeadWestvaco has a longstanding record of environmental leadership and responsible stewardship.  The company is committed to maintaining high environmental quality standards, which meet or exceed those established by all relevant environmental laws, regulations and other applicable requirements. \"\n\n\n\nThe Safety Policy further includes:\n\n\n\n\"Operating safely, with a constant focus on accident prevention and occupational health programs, is the most efficient way to manage our business.  It is the best way to safeguard our employees and the communities in which we are located.\"\n\n\n\nMeadWestvaco believes that adherence to these policies is the responsibility of each employee.  MeadWestvaco has established a management system to implement these policies across the company.  Adherence to these policies has a direct bearing on the performance of the corporation.  Therefore, compliance with the policies is included in evaluation of both managers and corporate executives.  Monthly senior management meetings begin with a report on environmental, safety and health activities.  MeadWestvaco's Board of Directors Committee on the Environment, Safety and Health meets regularly to examine reports from senior management.\n\n\n\nAs part of MeadWestvaco's commitment to Environmental, Safety and "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29561,
      "SummaryText": "Health operations at the Evadale mill, systems have been established to ensure safe operation of the processes at the facility.  One component of the system is a Risk Management Plan (RMP) that assists in managing risks and complies with the requirements of the Environmental Protection Agency's (EPA's) regulation found in 40 CFR 68, \"Accidental Release Prevention Requirements: Risk Management Programs.\"  One of the requirements of the rule is to submit a risk management plan describing the program at the mill.  This document is intended to satisfy the risk management plan requirement of the rule and provide an accurate description of the program at the MeadWestvaco Evadale mill.\n\n\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nMeadWestvaco is committed to the safety of its workers, contractors and the public, and the preservation of the environment, through the prevention of accidental releases of hazardous materials.  The mill has systems in place that provide reasonable controls to prevent foreseeable releases of hazardous substances.  These controls include initial and ongoing training for operators, and several programs to help ensure safety and health.  Environmental policies are met during design, installation, operation, and maintenance of process equipment.  Additionally, several programs and audit systems exist that continually evaluate hazards at the mill.\n\n\n\nIn the event of an accidental release, MeadWestvaco personnel will control and contain the release in a manner that will reduce the risk of exposure to workers, the public, and the environment.  MeadWestvaco has emergency responders trained in dealing with releases of materials specific to the mill.  Procedures in place outline the responsibilities of the incident commander to oversee response and coordinate activities with local emergency response personnel.  Materials on site and response activities have been reviewed with the Local Emergency Planning Committee and the State Dis"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29561,
      "SummaryText": "aster and Emergency Response Coordinator. \n\n\n\n\n\nMeadWestvaco and Regulated Substances\n\n\n\nThe MeadWestvaco Evadale, Texas mill is an integrated pulp and paper mill that manufactures bleached pulp and coated and uncoated paper. Chlorine dioxide is used in the whitening of pulp in the pulp mill and is stored in sufficient quantities to be subject to the RMP rule.  This is a Program Level 3 process and there is the potential to have 41,630 pounds of chlorine dioxide on site at one time.\n\n\n\n\n\nOffsite Consequence Analysis\n\n\n\nMeadWestvaco performed an analysis of the potential offsite consequence that an accidental release of chlorine dioxide could have on the public or the environment.  The RMP regulations require the analysis of both worst-case release and alternative release scenarios.  MeadWestvaco does not expect a worst-case release ever to occur based on the fact that no similar incident has occurred at the Evadale mill.  However, the analysis was done as required by the RMP rule and included in this report.  The alternative release scenarios evaluated are intended to represent releases, which might occur based on the mill's experience and knowledge of the processes.  The alternative release scenarios are more appropriate in working with the Local Emergency Planning Committee to evaluate the emergency response plan.  While MeadWestvaco believes that these releases are unlikely at the Evadale mill, we have evaluated the offsite impacts of these accidental releases as required by the rule.\n\n\n\nThe RMP rule specifies that for a Program 3 level process that both a worst case and alternative release scenarios be evaluated.  MeadWestvaco has conducted offsite consequence analysis for both release scenarios using readily available modeling and estimation techniques.  The ALOHA air dispersion model was used along with the RMP Comp estimation technique for this analysis.  Both techniques have been approved for use in evaluating offsite consequences under the RMP.  The purpose"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29561,
      "SummaryText": " of performing the modeling is to determine the distance to which certain effects may be experienced by public or environmental receptors.  This distance is called an endpoint distance.  When evaluating an accidental release, most people at or beyond the endpoint would be able to walk away from the exposure with no long-term health effects.  However, some short-term effects may be felt.\n\n\n\nThe worst case release scenario must be analyzed for the one regulated toxic substance estimated to create the greatest distance to the applicable endpoint concentration from the release of the entire contents of the largest single vessel containing the regulated substance (subject to administrative and engineering controls).  This worst case release scenario consists of the catastrophic failure of the chlorine dioxide storage tank and the spill of the maximum contents of this tank (400,000 gallons of chlorine dioxide solution).  Several overly conservative assumptions are included in this worst-case release scenario.  These assumptions include the instantaneous release of the entire contents of the tank, the accident occurs on the hottest day, there will be very light wind and no response by automatic systems or personnel can be factored into the modeling.  This release scenario will affect areas outside the mill site.  There are both public and environmental receptors within this area.\n\n\n\nThe alternative release scenario identified for chlorine dioxide consists of a pipeline break  downstream of the chlorine dioxide storage tank.  The ClO2 solution with a typical density of 12.5 grams per liter is released at a rate of 160 gallons per minute for fifteen minutes before the tank valve is manually shut off for a release of 2400 gallons of ClO2 solution.  In addition, the 587 gallons of ClO2 solution in the pipe upstream of the break is also released.  Total quantity released in pounds is equal to 311 pounds.  Modeling was conducted that identified the distance to endpoint.  The are"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 29561,
      "SummaryText": "a potentially affected includes areas outside the plant boundaries and may affect public but not environmental receptors.\n\n\n\n\n\nAccidental Release Prevention Program and Chemical-specific Prevention\n\n\n\nThe Evadale mill has always focused on ways to prevent accidental releases of hazardous substances.  In 1994, the Evadale mill implemented the fourteen elements of OSHA's Process Safety Management (PSM) program.  The EPA RMP rule, which was published in 1996, established various levels of prevention program requirements.  The Program level three is essentially the same as the OSHA PSM program, except that the RMP program focuses on protecting the public and the environment.  Program 3 requires twelve of the fourteen elements of the OSHA PSM program.  A prevention program to meet these requirements has been developed for the chlorine dioxide process.  The prevention program focuses on the following twelve elements:\n\n\n\n* Process safety information\n\n* Pre-startup review\n\n* Process hazard analysis\n\n* Compliance audit\n\n* Operating procedures\n\n* Incident investigation\n\n* Training\n\n* Employee participation\n\n* Mechanical integrity\n\n* Hot work permits\n\n* Management of change\n\n* Contractors\n\n\n\nIn addition to the required prevention program elements, MeadWestvaco has implemented safety features specific to the hazardous substances used at the Evadale mill. Chlorine dioxide is generated on site in a state of the art computer controlled process.  The dilute solution in water is stored in two tanks and fed to the process through pumps and piping dedicated to chlorine dioxide service.  The materials of construction and delivery system all meet the specifications of the suppliers and general industry standards.  Chlorine/chlorine dioxide detectors are located throughout the areas where chlorine dioxide is present in the pulp mill process areas.  These alarms are set to trigger below a concentration that would be dangerous to the operator.  The alarms are audible within the chlorine di"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 29561,
      "SummaryText": "oxide area and also alarm in the pulp mill control room where displays are constantly monitored.  \n\n\n\n\n\nFive Year Accident History\n\n\n\nThere has been no accidents or incidents at the Evadale Mill involving a covered process within the last five-years.\n\n\n\nEmergency Response Program\n\n\n\nMeadWestvaco has developed a written emergency response program centered on the mill's emergency disaster plan to help make the appropriate response to accidental releases of hazardous substances.  The program includes information specific to both processes at the mill.  The information includes:\n\n\n\n* Evaluation of the accidental release, determination of evacuation needs, determination of necessary assistance, notification to appropriate public agencies and management personnel\n\n* Controlling and containing accidental releases, including the use of emergency response equipment and the inspection, testing, and maintenance of that equipment\n\n* Providing first aid and emergency medical treatment for accidental exposure to hazardous substances\n\n* Training for employees in relevant procedures\n\n* Procedures to review and update the emergency response program and update employees as necessary.\n\n\n\nThe Evadale mill maintains an emergency response team.  All workers, contractors, and visitors are trained in appropriate evacuation procedures.  MeadWestvaco routinely conducts emergency response training and drills and each mill area conducts periodic evacuation drills.\n\n\n\nThe Evadale mill emergency response plan complies with the requirements of 29 CFR 1910.38(a) as required by the Process Safety Management rule and has been communicated to local responders. \n\n\n\nPlanned Changes to Improve Safety\n\n\n\nMeadWestvaco continually strives to improve the safety of processes at the mill.  The safety of the chlorine dioxide process is reviewed through a periodic review of the respective hazard and operability studies (HAZOP), management of change procedures, incident investigation programs, safety action team"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 29561,
      "SummaryText": "s, and solicitation of safety suggestions from employees.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nC:\\RMP\\ExecSum.txt    \n\n\n\n\n\n\n\nv\n\nC:\\RMP\\ExecSum.txt    \n\n\n\n\n\n\n\n\n\n\n\n\n\n8-1\n\nC:\\RMP\\ExecSum.txt    \n\n\n\n\n\n\n\n6\n\nC:\\RMP\\ExecSum.txt    \n\n\n\n"
    }
  ]
}