{
  "FacilityID": 29680,
  "FacilityName": "Nestle R&D Center",
  "FacilityStr1": "809 Collins Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Marysville",
  "FacilityState": "OH",
  "FacilityZipCode": "43040",
  "Facility4DigitZipExt": "4002",
  "FacilityCountyFIPS": "39159",
  "LEPC": "Union County LEPC",
  "FacilityLatDecDegs": "40.248056",
  "FacilityLongDecDegs": "-83.374444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 928663293,
  "ParentCompanyName": "Nestle R&D Center, Inc, New Milford, Conn",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Nestle R&D Center, Inc",
  "OperatorStr1": "809 Collins Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Marysville",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43040",
  "OperatorZipCodeExt": "4002",
  "RMPContact": "Robert Stevenson",
  "RMPTitle": "Director of Technical Services",
  "FTE": 215,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000000474",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0180010122",
  "SafetyInspectionDate": "2003-11-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-03-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-03-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-03-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-03-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 40.23024,
  "FRS_Long": -83.37788,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 43013,
      "AltID": "Refrigerations System",
      "FacilityID": 29680,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 43968,
          "ProcessID": 43013,
          "NAICSCode": "31192",
          "_desc": {
            "NAICS_CODE": "31192",
            "NAICS_DESCRIPTION": "Coffee and Tea Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 56740,
          "ProcessID": 43013,
          "ChemicalID": 56,
          "Quantity": 13500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 556740,
          "ProcessID": 43013,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29680,
      "SummaryText": "THE ACCIDENTAL RELEASE PREVENTATION AND EMERGENCY RESPONSE POLICIES\n\nIn this facility, we use Anhydrous Ammonia, which is considered hazardous by the EPA. This chemical must be used to provide cooling for the process and the areas.  It is our policy to have programs in place dealing with safety precautions in handling these substances and to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as our co-workers, and to reduce the threat to nearby members of the community.  It is our policy to adhere to all applicable Federal and state rules and regulations. Safety depends upon the manner in which we handle ammonia and propane combined with the safety devices inherent in the design of this facility combined with the safe handling procedures that we use and the training of our personnel. \n\nSOURCES AND PROCESS DESCRIPTION\n\nThe Nestle R&D Center's manufacturing 'facility is in the business of researching and developing foods; such as, coffees, candies, soups and ice creams for their corporation.  These products are cooled by evaporators and heat exchangers during the process.  Anhydrous Ammonia is the refrigerant used for cooling due to the low cost of the medium and the low temperatures that must be obtained.  The ammonia is enclosed within a closed loop that removes heat from the products and storage rooms.  Ammonia is vaporized in evaporator coils by heat removed from the products and cooling areas at low temperatures and pressures and then the heat is dispenced from the system to the atmosphere by moving outside air and water over condenser coils.\n\nThe ammonia system at the Nestle R&D Center contains 13,500 pounds of ammonia.\n\nSUMMARY OF HAZARDS\n\nConsequence of Failure to Control Hazards\n\nHEALTH HAZARDS\n\nAmmonia is a colorless gas with extremely pungent odor.  Liquid ammonia vaporizes to a poisonous gas cloud.\n\nAmmonia is a severe irritant of the eyes.  It penetrates the eyes more readily than any other alkali.  Contact with li"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29680,
      "SummaryText": "quid anhydrous ammonia and concentrated solutions can produce severe eye injury or blindness.  Exposure of the eyes to high gas concentrations can cause temporary blindness and severe eye damage.  Laceration or watering of the eyes can occur upon exposure to 150 ppm ammonia gas and higher.\n\nAmmonia is an irritant by inhalation.  At increasing concentrations it can cause symptoms ranging from runny nose, coughing, chest pain, trouble with breathing, and death.  It can cause severe breathing difficulties that are delayed in onset.  Inhalation of concentrations of 2500 to 6500 ppm causes shortness of breath, bronchospasm, chest pain, and pulmonary edema (filling of the lungs with fluid) that may be fatal.\n\nExposure of the skin to liquid anhydrous ammonia or high concentrations of the gas can cause first and second degree burns of the skin.  Vapor concentrations of 10,000 ppm are mildly irritating to moist skin, while 30,000 ppm or greater causes a stinging sensation and can produce skin burns and blisters.  These high concentrations of ammonia are corrosive to moist skin and other moist body tissues.\n\n\nPhysical Hazards\n\nAmmonia or ammonia with oil or other debris is an explosion hazard when exposed to flame or fire.  The Lower Explosive Limit (LEL) is 16% and Upper Explosive Limit (UEL) is 25% by volume in air.  Elevated temperatures can cause containers of the substance to explode.  Ammonia emits toxic fumes when exposed to heat.  When heated to temperatures above 850?F, ammonia will emit hydrogen gas.  The auto ignition temperature is 1204?F if catalyzed by iron.\n\nAmmonia can react to form potential violent or explosive reactions with halogens (e.g., chlorine, bromine).  It can react to form potential violent or explosive reactions with strong oxidizers, hypochlorite bleaches, silver compounds, mercury compounds, gold, other metals, and acids.\n\nCommon Exposure Control Methods\n-   Process enclosure\n-   Local exhaust ventilation\n-   General dilution ventilation\n-   Per"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29680,
      "SummaryText": "sonal protective equipment\n-   Use of water\n-   Area monitoring (with alarm systems)\n\nPotential for Exposure to Ammonia\n\nThe refrigeration operation is a closed system with no purposeful exposure to ammonia.  As a closed system, exposure potentials are primarily related to equipment failure, fugitive emissions from improperly adjusted or worn valve packing, failure of pump and compressor seals and pipe connector gaskets, or mistakes in operation of the system. \n\nWORST CASE SCENARIO\n\nThe worst case scenario for the Nestle R&D Center is the release of 13,068 pounds of ammonia from the system's largest vessel, the high pressure receiver, in a 10 minute period.  The toxic endpoint was determined by using the Cameo/Marplot/Aloha modeling programs.  With a wind speed of 1.5 m/sec and a Stability Class of F in an urban topography the endpoint of the spill was determined to be 1.25 miles from the receiver.  The plant site is located in the suburb of the city of Marysville, Ohio.  The public receptors within a radius of 1.25 miles from the plant site are schools, residents, hospital public parks and downtown office buildings with a population of 10,000.  .  In case of a major leak, passive mitigation's in place are drains that go to a collection tank for the ammonia area.\n\nALTERNATE CASE SCENARIO\n\nAlternate case scenarios for the Nestle R&D Center were reviewed by the maintenance and operating sections.  Considerations were given to the most probable cause of leaks within the system.  The possible leak scenarios considered were:\n-   Transfer hose rupture\n-   Process piping failure\n-   Process vessel or pump releases from seals, drains, bleeds\n-   Rupture of a sightglass\n-   Overpressure and release through relief valves\n\nAfter discussing these and the operations of the refrigeration system, it was decided that the rupture of a sightglass was the most probable cause of a leak within the system.  Calculations were made considering the leakage of high pressure ammonia liquid fr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29680,
      "SummaryText": "om the high pressure receiver sightglass.  The breakage would create a 1/2\" orifice in the sightglass.  At the system pressures, it was determined that a release rate of 393 lbs/min would be released for 20 minutes if this incident occurred.  Wind speeds of 3.0 m/sec and a stability class of D were used.  The toxic endpoint was determined to be 0.50 miles by using the Cameo/Marplot/Aloha computer modeling programs.  This was based on releasing 7,369 pounds of liquid ammonia.\n\nThe public receptors in this area would include residents and public recreational areas.  The population of this area would be 2,500.  There were no active or passive mitigation credits for this scenario.\n\nTHE FIVE YEAR HISTORY\n\nNestle R&D Center has been in operation only since 1996.  During that time, there have been no incidents or near miss spills or leaks of ammonia.  \n\nEXPLANATION OF HOW RELEASES ARE PREVENTED\n\nHistorically, exposures to ammonia most often occur from:\n-   Leaking valve stem packing glands while opening or closing a valve\n-   Leaking at valve flanges or other piping connections\n-   Pressurizing any equipment with sight glasses\n-   Mistakenly venting gas through open equipment to the atmosphere\n-   Malfunctioning pressure relief valves\n-   Mechanical seal failures on compressors and pumps\n\n\nRELEASE PREVENTATION PROGRAM AND PREVENTION STEPS\n\nThe Nestle R&D Center complies with the EPA's Accidental Release Preventative Rule with all applicable state codes and regulations for ammonia and propane.  Management systems are in place to administer the RMP prevention programs for ammonia and propane. .  The Section Leader is the responsible person for leading this program.\n\nThe Nestle R&D Center is in compliance with OSHA's PSM rule for ammonia.  The RMP's accidental release preventative program for ammonia is covered by the elements of the PSM program.  Controls for the preventative programs are acquired by:\n\n-   Effective preventative maintenance programs\n-   Reviews for proper de"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 29680,
      "SummaryText": "sign\n-   Development of and following operating procedures\n-   A mechanical integrity program that includes equipment testing procedures\n-   Training to be aware of potential exposure situations and using exposure prevention procedures and/or protective equipment.\n\nEMERGENCY RESPONSE PLAN\n\nThis facilities emergency response program is equal to the IIAR's \"Risk Management Guidelines Program for Ammonia Refrigeration.\"  An emergency response plan is in place at the Nestle R&D Center to deal with incidents and emergencies that might take place on site.  The site maintains it's own HAZMAT teams.  Training for these functions is given annually per state requirements.  Onsite drills are also scheduled as part of the emergency response plan to familiarize employees of the dangers of ammonia and propane and the proper response to alarms and evacuations. .  The plan has been provided and reviewed with the Union County Local Emergency Planner Center.  Coordination with the LEPC has been made to notify them through the emergency response plan to respond to incidents that may affect the public.\n\nPLANNED CHANGES TO IMPORVE SAFETY\n\nNestle R&D Center is continuing to improve and update the employee training program to enhance awareness for all employees, as well as contractors, and increase the skills and qualifications of our refrigeration operators to increase their abilities to respond to emergencies.  This ongoing training includes offsite refrigeration training courses, operating procedure reviews and drills."
    }
  ]
}