{
  "FacilityID": 29805,
  "FacilityName": "ACS-LLC",
  "FacilityStr1": "4102 South Avenue 3-1/2E",
  "FacilityStr2": null,
  "FacilityCity": "Yuma",
  "FacilityState": "AZ",
  "FacilityZipCode": "85365",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04027",
  "LEPC": null,
  "FacilityLatDecDegs": "32.653611",
  "FacilityLongDecDegs": "-114.574167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Dan Day",
  "OperatorStr1": "4102 South Avenue 3-1/2E",
  "OperatorStr2": null,
  "OperatorCity": "Yuma",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85365",
  "OperatorZipCodeExt": null,
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000185685",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-11-05 00:00:00",
  "SafetyInspectionBy": "City Building Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-04-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-04-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-04-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-04-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 32.65245,
  "FRS_Long": -114.57272,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) PRECISE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 43403,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 29805,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 57326,
          "ProcessID": 43403,
          "ChemicalID": 56,
          "Quantity": 23500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 44364,
          "ProcessID": 43403,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 25091,
              "Process_NAICS_ID": 44364,
              "SafetyReviewDate": "2001-10-26 00:00:00",
              "PHA_Date": "2001-10-26 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-10-26 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Ammonia Diffusion Tank",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "New Facility",
              "OpProceduresReviewDate": "2001-11-08 00:00:00",
              "TrainingReviewDate": "2001-11-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-11-08 00:00:00",
              "EquipmentInspectionDate": "2001-11-08 00:00:00",
              "EquipmentTested": "New facility - system pressure test",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2001-11-08 00:00:00",
              "PreStartupReviewDate": "2001-11-09 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-11-08 00:00:00",
              "HotWorkPermitReviewDate": "2001-11-08 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2001-11-08 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 36663,
                  "PreventionProgram3ID": 25091,
                  "ProcessChemicalID": 57326
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 29805,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2001-11-08 00:00:00",
    "ERTrainingDate": "2001-11-09 00:00:00",
    "CoordinatingAgencyName": "City of Yuma -Fire Department",
    "CoordinatingAgencyPhone": "5207835960",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "29 CFR 1910.120(q) First Responder Training",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 29805,
      "SummaryText": "evacuate affected area, begin notification process, and rely on off-site responders (e.g., the fire department, portable ammonia equipment supplier and/or refrigeration contractor).\n\n \nPLANNED CHANGES TO IMPROVE SAFETY\nThe Process Hazard Analysis (PHA) study team developed recommendations to improve safety and to reduce the possibility of a release.\nKey recommendations identified during study included;\n\n· Develop more written policies and procedures -in particular address the ammonia pump seal maintenance.\n· Remove the obsolete pump one of the portable components.\n- Revise the piping on the secondary low temperature accumulator to simplify liquid transfer\n\nACS has reviewed recommendations and decided to implement the recommended these measures. Implementation of the measures has begun according to the schedule set by ACS."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 29805,
      "SummaryText": "SCOPE\nThe EPA RMP regulation requires that an Executive Summary be provided as part of the registration submitted to the EPA. The following areas are addressed in this summary:\n·Accidental Release Prevention and Emergency Response Policies\n·Stationary Source Activities and Regulated Substances Handled\n·Worst-Case and Alternative-Case Release Scenarios\n·Prevention Program\n·Five-Year Accident History\n·Emergency Response Program\n·Planned Changes to Improve Safety\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nACS is committed to complying with all of the regulatory requirements of the EPA Risk Management Program. ACS has developed their Risk Management Plan / Process Safety Management (RMP/PSM) Manual to document ACS policies addressing the implementation of these regulations. The PSM sections pertain to the prevention of accidental releases and include the Process Hazard Analysis study and procedures for operating, training, maintenance, emergency response, and others. The RMP sections pertain to management systems and include the Hazard Assessment (Offsite Consequence Analysis) Report.\n\n\nSTATIONARY SOURCE ACTIVITIES AND REGULATED SUBSTANCES HANDLED\nThe ACS Yuma facility is a new facility, which will provide product cooling and short-term storage for fresh vegetables.\n \nThe facility is located in an industrial area of Yuma. Ammonia is used as the refrigerant in the Main Refrigeration System (\"System\"). This is a direct, mechanical refrigeration system, which was built in 2001. The full system charge and start-up will be on or soon after November 15, 2001. The majority of the ammonia equipment is located outside. Cold Room evaporators are located inside; however, their associated valves and piping are located on the roof.\n\nA portion of the ammonia equipment is portable and is moved on and off site annually as needed for the local produce season. The interconnecting piping between the portable components is permanently mounted. Additionally some vessels"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29805,
      "SummaryText": "and the Cold Room evaporators are permanently mounted. \n\nAccess to the facility is limited by a combination of fencing, gates, and retention basins on the property perimeter.\n\nWORST-CASE SCENARIO ANALYSIS\nThe regulation requires that the Worst-Case Release Scenario use the ammonia quantity in the largest vessel or pipe. Administrative controls were considered in determining the largest quantity. The High Pressure Receiver (HPR) will contain the full ammonia charge. The Worst Case Scenario is therefore based on the full system ammonia charge (e.g. the full ammonia inventory).\n\nNOTE: It is important to consider that the Worst-Case Scenario is extremely unlikely to occur since this scenario does not consider any safety features of the system  - in either design or operation. The scenario parameters are established by the regulation to provide uniformity for dialog between the industry, community, and regulatory agencies.\n\n\nALTERNATE-CASE RELEASE SCENARIO ANALYSIS\nThe Alternate-Case Scenario selected was an ammonia pump seal failure. The regulation allows the facility to select the Alternate-Case Scenario. In selecting the scenario, the Process Hazard Analysis was considered. Of the potential \"causes of deviation\", this scenario was selected because it would require human error by way of lack of maintenance.\n\nFor modeling of the Alternate-Case Scenario, this analysis used ALOHA, a modeling program approved by the EPA.  \n \nPREVENTION PROGRAM\nACS's Prevention Program is described in the RMP/PSM Manual. The RMP Prevention Program is equivalent to OSHA's Process Safety Management Program (PSM). The Prevention Program implemented by ACS is essential to help prevent releases and to minimize the effects if a release does occur.\nKey objectives of ACS's Prevention Program are briefly described below:\n\n1.Maintain current and complete refrigeration system technical information. (Addressed under the Process Safety Information chapter)\n2.Provde thorough team evaluation of the refrig"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29805,
      "SummaryText": "eration system. The evaluation considers a number of potential problems including: mechanical problems, human errors, and external events (e.g., earthquakes). All safety recommendations developed by the team are reviewed and addressed by ACS. (Addressed under Process Hazard Analysis chapter.)\n3.Written procedures and policies that establish how the refrigeration system should be operated and maintained and how to investigate accidental releases. (Addressed under Operating Procedures, Mechanical Integrity, and Incident Investigation chapters.)\n4.Certification of refrigeration operators to safely operate the refrigeration system. ACS certifies operators following completion of operator training and ACS's confirmation of the operator's ability apply what they have learned. (Addressed under Training chapter.)\n5.Employee involvement in the Prevention Program. This is addressed on two levels. First, refrigeration equipment operators participate in the planning and evaluation of the Prevention Programs (e.g., Process Hazard Analysis study team, writing and/or reviewing operating procedures, Incident Investigation team, etc.). This involvement encourages ownership of the Prevention Program and positively affects the operators' day-to-day activities.  \nSecond, all ACS employees (direct hires and contract) at this facility receive ammonia awareness training. Additionally, they have access to the RMP/PSM information. These activities improve the overall safety of the employees. (Both levels are addressed under Employee Participation chapter)\n6.Implementation of additional measures when changes are planned  (procedural or mechanical). These measures begin before any changes are made and may include a Process Hazard Analysis, operator training, and Process Safety Information updates plus other measures required by ACS's Management of Change Procedure.  \nIf a mechanical change is required and for maintenance contracts, ACS has a procedure for selecting a contractor based on the c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29805,
      "SummaryText": "ompany's experience and safety history. Additionally, if welding, grinding, or other \"Hot Work\" occurs inside the building and close to the refrigeration system, a ACS Hot Work permit is required. The purpose of the permit and the associated Hot Work procedure is to minimize the possibility of a fire. \nFollowing completion of a mechanical change, a pre-startup safety review is required before the system can be started. (These areas are addressed under Management of Change, Contractor Qualifications, Hot Work Permit, and Pre-Start-up Safety Review chapters.)\n7.Verification of ACS's compliance with the RMP/PSM program. This self-audit process is an important tool to confirm whether each of the elements in the Prevention Program  (and the Risk Management Program) has been implemented and properly documented by ACS personnel. ACS has established a Management System procedure to address any shortcomings, which the audit may find. (Addressed under Compliance Audit chapter.)   \n8.Minimize employee injury and illness. (Addressed under ACS's Illness and Injury Prevention Program.)\n\n\nFIVE-YEAR ACCIDENT HISTORY\nThe ACS facility is new and has no reportable accidental ammonia releases in the last five years.\n\n  \nEMERGENCY RESPONSE PROGRAM\nACS's Emergency Response Program is described in their Emergency Response Plan for the Yuma facility.\n\nThis plan includes planned responses and procedures for evacuations, notifying responders and governmental agencies. The plan also includes first aid procedures for immediate care and instructions for follow-up medical care when necessary. The plan addresses training requirements for employees including production employees, supervisors, managers, and operators. Evacuation drills are an important part of the training. \n\nUnder ACS's Emergency Response policy, ACS employees who have been trained as \"First Responders\" may initially respond to releases that can be addressed without entering the danger area (i.e. de-energizing equipment). ACS will"
    }
  ]
}