{
  "FacilityID": 29845,
  "FacilityName": "Calvert Cliffs Nuclear Power Plant",
  "FacilityStr1": "1650 Calvert Cliffs Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Lusby",
  "FacilityState": "MD",
  "FacilityZipCode": "20657",
  "Facility4DigitZipExt": "4702",
  "FacilityCountyFIPS": "24009",
  "LEPC": "Calvert County LEPC",
  "FacilityLatDecDegs": "38.434444",
  "FacilityLongDecDegs": "-76.441944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.constellation.com",
  "FacilityEmailAddress": "communications@constellation.com",
  "FacilityDUNS": 83157250,
  "ParentCompanyName": "Constellation Energy Group",
  "Company2Name": null,
  "CompanyDUNS": 62500678,
  "Company2DUNS": null,
  "OperatorName": "CCNPP inc.",
  "OperatorStr1": "1650 Calvert Cliffs Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Lusby",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "20657",
  "OperatorZipCodeExt": "4702",
  "FTE": 1000,
  "OtherEPAFacilityID": "MDD000621243",
  "EPAFacilityID": "100000006502",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "24-009-00012",
  "SafetyInspectionDate": "1998-11-09 00:00:00",
  "SafetyInspectionBy": "Equipment inspections are regularly performed.",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-05-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-05-03 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-04-29 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2008-09-24 00:00:00",
  "DeRegistrationEffectiveDate": "2008-06-27 00:00:00",
  "AnniversaryDate": "2009-04-29 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 38.435833,
  "FRS_Long": -76.4425,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 43481,
      "AltID": "AQUA AMMONIA",
      "FacilityID": 29845,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 57419,
          "ProcessID": 43481,
          "ChemicalID": 57,
          "Quantity": 20000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 44442,
          "ProcessID": 43481,
          "NAICSCode": "221113",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 16656,
              "Process_NAICS_ID": 44442,
              "SafetyReviewDate": "2004-01-27 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1998-03-16 00:00:00",
              "ChangeCompletionDate": "1998-03-16 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Gravel ground, concrete tank protection, water hose available during tank fill",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-12-22 00:00:00",
              "TrainingReviewDate": "2002-11-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "A continuing training item",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "If the training is strickly knowledge, a written test is usually given.  If the training is on a task or operation the testing will usually be oral, with a demonstration and observation.",
              "MaintenanceReviewDate": "2003-08-25 00:00:00",
              "EquipmentInspectionDate": "1998-07-23 00:00:00",
              "EquipmentTested": "Final leak check of the Ammonia tank prior to initial fill and placing the tank in service.",
              "ComplianceAuditDate": "2003-10-08 00:00:00",
              "AuditCompletionDate": "2003-10-08 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 17385,
                  "PreventionProgram2ID": 16656,
                  "ProcessChemicalID": 57419
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 29845,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-03-29 00:00:00",
    "ERTrainingDate": "2003-10-21 00:00:00",
    "CoordinatingAgencyName": "Calvert County Emerg. Management",
    "CoordinatingAgencyPhone": "4105351600",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29845,
      "SummaryText": "The Calvert Cliffs Nuclear Power Plant is located 2 miles north of Lusby in Calvert County Maryland. The facility is a nuclear power steam-electric generating plant (SIC4911). The facility was built into the Calvert Cliffs, but the upper topography of the site is generally flat or slightly sloping towards the Chesapeake Bay with high cliffs both north and south of the plant site. The site is approximately 2100 acres in area and is mostly forested. The areas¿ surrounding the site is mostly forested with some residential development.  All storm water and process water is discharged into the Chesapeake Bay. The site operates a private waste water system that supplies the site. The onsite waste water treatment plant treats wastes from facility sinks and bathrooms. The site is covered by NPDES Permit 99-DP-0187, effective December 31, 1999.\nAmmonia hydroxide is used at the plant as an additive to the feed water system in the secondary steam cycle to maintain the pH of the water within a required band. This pH requirement is maintained to minimize the corrosion of the system piping which extends the life expectancy of the system piping and components and reduces piping failures. \nSince installation, the ammonia tank has had no individual safety inspection, however as a nuclear power facility, Calvert Cliffs has well established release prevention programs and emergency response capabilities. Calvert Cliff¿s accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices. All applicable procedures of the Nuclear Regulatory Commission (NRC) and the U.S. Environmental Protection Agency (EPA) Prevention Program are adhered to. Calvert Cliffs has two resident NRC inspectors, whom have the same authority as OSHA,  on site.  MDE gives Calvert Cliffs two formal inspections per year.  One announced and one unannounced.  The site also usually has a site inspection by the Institute of Nuclear Power Operations (INPO)"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29845,
      "SummaryText": "every other year  (the last inspection was 11/02), and assist visits more frequently.  INPO's goal is to achieve and enhance safe reliable operation by working to achieve operational excellance. The emergency response policy involves the preparation of response plans which are tailored to the emergency response services available in the community, and is in compliance with the EPA Emergency Response Program requirements. The EPA requires this accidental release prevention plan for Calvert Cliffs Ammonia Hydroxide (NH3OH) usage. \nAmmonia Hydroxide, 28% to 30% concentration, is stored in a 8500 gallon, seismic class 2 above ground, double walled, high density, cross linked polyethylene tank secured by steel cables to a seismic class 2 pad. The inner tank has pressure relief protection that relieves to the outer tank and an ammonia vapor sensor in the outer tank with an alarm.  The outer tank capacity is 10,000 gallons. The tank discharge line is connected to the tank with a flexible coupling to allow for tank creep. The tank is surrounded by concrete barriers to prevent accidental vehicular contact with the tank. The tank is filled from a tanker truck. The procedure for filling the ammonia hydroxide tank is the Chemistry procedure CP-414, Filling the Bulk Chemical Storage Tanks. The driver  transfers the contents to the storage tank, a second person, fully dressed in protective equipment is at the transfer location to provide assistance and / or summon help should a leak occur. The site maintains a large supply of spill control equipment in a designated location and maintains personnel on-site at all times who are trained to respond to fires, spills and medical emergencies. The site has a strong Spill Prevention Control and Countermeasures Plan (SPCC) that defines actions to be taken during spills and a strong Emergency Response Plan which comes into affect if the safety of the plant personnel or the public is threatened. The tank is regularly inspected and those ins"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29845,
      "SummaryText": "pections are documented. Any operational or maintenance deficiencies are documented and repaired in a timely fashion. Training at the plant is a continuous process throughout the year. Emergency Response training is conducted in job task groups. Each job task group is trained annually.\n \nEPA requires atmospheric modeling of hypothetical releases amounts for determining off site consequences. The off site consequence analysis includes consideration of two ammonia release scenarios, identified as \"worst case release\" and \"alternative scenario\". The first scenario is defined by EPA, which states that \"the owner or operator shall assume that the maximum quantity in the vessel is released and vaporizes over 10 minutes,\" due to an unspecified failure. The alternative scenario is defined as \"more likely to occur than the worst-case release scenario and was selected by careful review of ammonia process operating experience.\"\nStandard EPA atmospheric dispersion modeling was performed to determine the distance traveled by the ammonia vapor released before its concentration decreases to the \"toxic endpoint\" selected by EPA of 0.14 mg/ l, using the Emergency Response Planning Guideline Level 2 (ERPG-2). This is defined by the American Industrial Hygiene Association (AIMA) as the \"maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\" The residential population within the radius corresponding to the toxic endpoint distance has to be defined, \"to estimate the population potentially affected\".\nThe worst-case release scenario at the Calvert Cliffs Nuclear Power Plant involves a complete failure of the 8500 gallon ammonia hydroxide tank (a total of 19,000 lb. of ammonia). The off site consequence analysis for this scenario used worst-case release scenario c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29845,
      "SummaryText": "onditions pre-defined by the EPA, namely release of the entire ammonia tank contents as a liquid turning vapor in 10 minutes, and use of the ERPG-2 as the toxic endpoint. EPA mandated meteorological conditions, assume a Stability F, wind speed 1.5 meters per second, an average air temperature of 77 oF, and average humidity was used.\nWhen the atmospheric dispersion modeling for the worst case scenario was performed using the EPA assumptions, a distance to toxic endpoint of 0.4 miles (2112 feet) and an estimate of residential population potentially affected of 0 was obtained.\nThe most likely alternative release scenario involves the rupture of the flexible connection connecting the supply truck and the ammonia tank during a normal filling evolution.  The amount of ammonia released is 3200 pounds, over a duration of one minute. Chemical specific prevention steps include use of a respirator, worn by the operator during ammonia tank filling evolution so if the transfer line ruptured the operator could push the remote shut off valve switch within 1 minute. Toxic endpoint distances at ERPG-2 levels were obtained. The typical meteorological conditions assumed a Stability D, wind speed 3 meters per second and average air temperature of 77oF. The estimated distance traveled to the toxic endpoint is 0.1 miles (528 feet).\n\nResults Summary:                                      Worst Case                              Alternative\nAmmonia Released:                             20,000 lbs. in 10 min.               2,080 lbs in 1 min.\nOff Site Impact Distance:                     0.4 miles (0.6 kilometers)                     0.1 miles (0.2 kilometers)\nNumber of Residential Public Receptors:       0                                                  0\n\nNo residential public receptors were identified in the Worst Case and the Alternative scenarios.  Nuclear Regulatory Commission requirements determined that an ammonia  release would not affect the safe operation of the plant.  Should a r"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 29845,
      "SummaryText": "elease occur, the realistic public concern is for the possibility of fisherman on boats in the Chesapeake Bay near the plant intake structure and visitors at the plant visitors center.  However, the visitors center has been closed since 9-11-2001 and will remain closed for the near future. Calvert Cliffs emergency response procedures would have personnel evacuate these areas if a significant ammonia release occurred.\n\nThe accidental release prevention program is based on the following key elements:\n¿ Use of modern equipment and construction planning by the engineering section\n¿ High level of training of the operators\n¿ Preventive maintenance program\n¿ Use of state-of-the-art process and safety equipment\n¿ Required use of accurate and effective operating procedures\n¿ Performance of a hazard review of equipment and procedures\n¿ Implementation of inspection and review programs\nNo accidental releases of ammonia have occurred at this facility in the past ten years.\nThe facility has an emergency response program, which has been coordinated with the Calvert County Emergency Management Plan. This program includes an emergency response decision tree and a notification plan. Emergency response drills and drill evaluations that include Calvert County Emergency Management, St. Mary's County, Dorchester County, Maryland Emergency Management Agency, and Maryland Department of the Environment and the Nuclear Regulatory Commission are conducted annually.  Emergency operation and response procedures are also reviewed at that time."
    }
  ]
}