{
  "FacilityID": 2992,
  "FacilityName": "U.S. Foodservice - Knoxville",
  "FacilityStr1": "269 Kings Court",
  "FacilityStr2": null,
  "FacilityCity": "Alcoa",
  "FacilityState": "TN",
  "FacilityZipCode": "37701",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47009",
  "LEPC": "Blount County LEPC",
  "FacilityLatDecDegs": "35.771361",
  "FacilityLongDecDegs": "-83.987722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "C2",
  "LatLongDescription": "LF",
  "FacilityURL": "www.usfoodservice.com",
  "FacilityEmailAddress": "bobbyb@kings.usfood.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "U. S. Foodservice",
  "Company2Name": null,
  "CompanyDUNS": 24024333,
  "Company2DUNS": null,
  "OperatorName": "U.S. Foodservice - Knoxville Div.",
  "OperatorStr1": "269 Kings Court",
  "OperatorStr2": null,
  "OperatorCity": "Alcoa",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37701",
  "OperatorZipCodeExt": null,
  "FTE": 160,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000037578",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-21 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 35.778538,
  "FRS_Long": -83.987284,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3338,
      "AltID": "1",
      "FacilityID": 2992,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 3561,
          "ProcessID": 3338,
          "ChemicalID": 56,
          "Quantity": 14700.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 3406,
          "ProcessID": 3338,
          "NAICSCode": "49311",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1086,
              "Process_NAICS_ID": 3406,
              "SafetyReviewDate": "1999-05-14 00:00:00",
              "PHA_Date": "1998-12-15 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-07-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-15 00:00:00",
              "TrainingReviewDate": "1998-12-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-06-15 00:00:00",
              "EquipmentInspectionDate": "1999-05-21 00:00:00",
              "EquipmentTested": "Ammonia Alarm System",
              "ChangeMgmtDate": "1998-12-12 00:00:00",
              "ChangeMgmtReviewDate": "1998-12-12 00:00:00",
              "PreStartupReviewDate": "1998-11-25 00:00:00",
              "ComplianceAuditDate": "1999-05-21 00:00:00",
              "AuditCompletionDate": "1999-06-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-06 00:00:00",
              "HotWorkPermitReviewDate": "1998-11-24 00:00:00",
              "ContractorSafetyReviewDate": "1998-11-24 00:00:00",
              "ContractorSafetyEvalDate": "1998-10-24 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1218,
                  "PreventionProgram3ID": 1086,
                  "ProcessChemicalID": 3561
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 2992,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-21 00:00:00",
    "ERTrainingDate": "1999-05-21 00:00:00",
    "CoordinatingAgencyName": "Alcoa Fire Department",
    "CoordinatingAgencyPhone": "4239814128",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 2992,
      "SummaryText": "here at U.S. Foodservice - Knoxville Division consists of the\nfollowing:\n\n     1.  Employee Participation - this program requires the participation of our trained employees in the\n          establishment and implementation of our release prevention program.  The employees also are part\n          of the hazard analysis process when it is performed as part of our Process Safety Management\n          Program.\n     2.  Here at U.S. Foodservice - Knoxville Division all process safety information is maintained in the\n          Process Safety Information book.  This written material is to help employees understand the hazard\n          potential in the ammonia system.  This information includes the MSDS data for ammonia and a\n          description of the design of the ammonia operating system.\n     3.  Process Hazard Analysis - formal studies using the What If technique have been conducted to look\n          at the systems and ideitify potential hazards.\n     4.  Operation Procedures - written detail procedures have been developed to provide instructions for  \n          the safe operation of the ammonia refrigeration system.\n     5.  Training - we have developed a written training program to assure that employees are trained in all\n          areas of our PSM/RM Plan programs and to assure the safe operation of our ammonia refrigeration\n          plant.\n     6.  Pre Start-Up Safety Review - a pre start-up safety review is completed for all new construction or\n          system changes to verify that all safety systems are in place.  Also there is a review to insure that \n          the required training is complete and documented.  A review of the construction is conducted to\n          make sure it is complete and in compliance with the design and design standards.\n     7.  Mechanical Integrity - this program insures that our ammonia refrigeration system is built and\n          maintained using preventive maintenance procedures to minimize unexpected break downs or\n          sy"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 2992,
      "SummaryText": "A.\n\nThe management of U.S. Foodservice - Knoxville Division is aware of its reponsibility in protecting it's employees, equipment, property and the environment.  The safety and health of all personnel is the foremost concern in our company.  The control of accidents shall always be the responsibility of all employees here at this facility.\n\nIt is the Company's goal to control or eliminate all accidental losses of ammonia.  To accomplish this, the facility  has established a plant safety program.  The objectives of the safety program are to achieve maximum efficiency and safety performance.\n\nThe Plant Safety Program includes associated acivities that have been developed and implemented to prevent accidental releases of ammonia and to provide an emergency response that is in compliance with OSHA's Process Safety Management (PMS) standard (Process Safety Management of Highly Hazardous Chemicals, 29 CFR 1910.119) and EPA's Risk Management Program (RM Program) regulation (Risk Management Programs for Chemical Accidental Release Prevention, 40 CFR part 68).  The maintenance supervisor is responsible for the management of the accidental release prevention and emergency response programs.\n\nThe purpose of the accidental release prevention and emergency response programs is to prevent any ammonia releases, and if there are any releases, to minimize the consequences of significant releases of ammonia, as well as fires, explosions and any other type of catastrophic accidents.  These programs prevent accidental fatalities, injuries, illness and loss of property.\n\nB.\n\nAlthough U.S. Foodservice is a nation-wide concern, the U. S. Foodservice - Knoxville Division is a locally managed company with strong ties to the local community and the local emergency management organizations.\n\nWe are a fresh and frozen food warehouse as well as a food distributor for the Southeastern United States.  Our facility includes 50,000 square feet of freezer space and 10,000 square feet of cooler spac"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2992,
      "SummaryText": "e.To maintain these freezers and coolers we have an ammonia refrigeration plant with an inventory of 14,700 pounds of Anhydrous Ammonia.  An ammonia release from this system could pose a risk of off-site public impact.  As this system's ammonia inventory exceeds the 10,000 pound threshold set by the OSHA PSM standard (29 CFR 1910.119) this is subject to the program's three requirements of the EPA Risk Management Program.\n\nIn our refrigeration system, low pressure ammonia vapor and cold ammonia liquid returns to a low pressure intercooler.  From the intercooler the liquid ammonia passes to receivers.  Compressors pull low pressure vapor from the receivers then compress the vapor to approximately 25 pounds (PSIG) per square inch guage pressure.  Second stage compressors again compress the ammonia vapor to 150 PSIG.  This high pressure ammonia vapor is supplied to condensers to remove excess heat and to liquidfy the ammonia.  The warm high pressure liquid ammonia flows to the high pressure receiver where a certain level is maintained.  The ammonia flows from the receiver to the intercooler where the temperature of the liquid is lowered.  The cold liquid ammonia is pumped to the freezers, chillers and evaporators thoughout our plant to pick up heat and repeat the cycle.\n\nC.\n\nThe worst case release scenario at our facility would involve the release of 14,000 pounds of ammonia over a thirty minuite period through a high pressure ammonia liquid line.  The worst case scenario would also assume the worst case weather conditions and under these conditions the ammonia would travel 1.08 miles before dispersing enough to be of no hazard to the public.\n\nThe worst case scenario at our plant is unlikely for the following reasons:\n\n     1.  Industry standards for piping materials and the fabrication of these materials make failure unlikely.\n     2.  The new supervised operating system, on sensing a pressure drop, will isolate the leaking              \n          section of pipe."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2992,
      "SummaryText": "3.  Pressure safety valves limit the operating pressures throughout the system.\n     4.  Our facility has a mechanical integrity program in place to maintain the ongoing integrity on all piping\n          and vessels for our system, based on the International Institute of Ammonia Refrigeration (IIAR)\n          bulletin 110 for inspections and frequency of inspections.\n\n\n\n     5.  Our facility has a training program to assure that only qualified personnel perform maintenance\n          activities including mechanical integrity inspections.\n     6.  Our facility has an emergency response program based on emergency response procedures which\n          enable trained personnel to quickly isolate any potential releases.\n\nThe alternative release scenario at our plant involves the release of 500 pounds of ammonia through a one-half inch (1/2) liquid ammonia line for a ten minute period.  This one-half inch line is a drain line from the main receiver.\n\nThis alternative release scenario is unlikely at our facility for the following reasons:\n\n     1.  The high pressure liquid ammonia drain lines are located inside our engine room (an enclosed area\n          which will help contain a release of this type).\n     2.  Industry standards for piping materials and installation of these materials make this release unlikely.\n     3.  Restriction of personnel and activities in the engine room make the possibility of physical damage\n          remote.\n     4.  Our facility has a mechanical integrity program in place to maintain the ongoing integrity of all piping\n          and vessels in our system.\n     5.  Our facility has a training program to assure that only qualified personnel perform maintenance\n          activities including mechanical integrity inspections.\n     6.  Our facility has an emergency response program based on emergency response procedures\n          which enable trained personnel to quickly isolate any potential releases.\n\nD.\n\nOur accidental release prevention program"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 2992,
      "SummaryText": "stem failures.\n     8.  Hot Work Permits - these procedures insure that a signed permit is obtained prior to any cutting,\n          welding or burning.\n     9.  Management Of Change - our management of change procedure is to insure a complete review\n          of any proposed changes to our ammonia system prior to that change.\n   10.  Incident Investigation - any accidental releases or near misses are investigated as instructed by this\n          procedure.\n   11.  Compliance Audits - compliance audits are procedures to verify program integrity.\n\nE.\n\nFive Year Accident History - no ammonia related accidents or unplanned ammonia releases occurred in the previous five years at the U.S. Foodservice - Knoxville Division with significant on-site or off-site consequences.\n\n\n\n\nF.\n\nDescription of the Emergency Response Program - our facility has an implemented emergency response program.  Our emergency response procedures describe how this facility will respond to an accidental ammonia spill and other emergencies, including evacuation procedures.  This program has been coordinated with the Alcoa, TN Fire Department.\n\nThe emergency response program contains the following elements:\n\n     1.  Organization plan and responsibilities\n     2.  Communications procedures\n     3.  Detailed action plans\n     4.  Emergency medical treatment procedures\n     5.  Evacuation plans\n     6.  Description of outside assistance available\n     7.  Site re-entry procedures\n     8.  The requirement for training programs and drills\n\nG.\n\nPlanned Changes To Improve Safety - additional on-site training for all U.S. Foodservice personnel as classroom instruction and drills will improve the ammonia awareness and response attitude.\n\nDuring our hazard analysis it was noted that a common header for the ammonia relief valve system was required to assure a safer operating plant.  The work for this installation is in progress and with the final painting will be complete."
    }
  ]
}