{
  "FacilityID": 29932,
  "FacilityName": "Eastside Wastewater Treatment Plant",
  "FacilityStr1": "71 Mercer Street",
  "FacilityStr2": null,
  "FacilityCity": "Oswego",
  "FacilityState": "NY",
  "FacilityZipCode": "13126",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36075",
  "LEPC": "Oswego County LEPC",
  "FacilityLatDecDegs": "43.469444",
  "FacilityLongDecDegs": "-076.498056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www2.oswegony.org/",
  "FacilityEmailAddress": "mcoffey9@twcny.rr.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Oswego",
  "Company2Name": null,
  "CompanyDUNS": 77308765,
  "Company2DUNS": 0,
  "OperatorName": "Gary T Hallinan",
  "OperatorStr1": "71 Mercer Street",
  "OperatorStr2": null,
  "OperatorCity": "Oswego",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13126",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gary T Hallinan",
  "RMPTitle": "Assistant Superintendent",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000136621",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-06-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-05-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-04-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-05-12 00:00:00",
  "DeRegistrationEffectiveDate": "2013-04-03 00:00:00",
  "AnniversaryDate": "2009-04-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.0",
  "FRS_Lat": 43.46961,
  "FRS_Long": -76.49928,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 43639,
      "AltID": "Chlorine Injection System",
      "FacilityID": 29932,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 44608,
          "ProcessID": 43639,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 57650,
          "ProcessID": 43639,
          "ChemicalID": 62,
          "Quantity": 7500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 557650,
          "ProcessID": 43639,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29932,
      "SummaryText": "                                                                           EXECUTIVE SUMMARY\n\n     On April 28, 2004 the City of Oswego performed the Environmental Protection Agency (EPA) required 5 year review of our Risk Management Program (RMP).  All necessary changes and updates have been completed.  In addition, all Safety and Training Programs have been reviewed.  The City of Oswego will electronically submit this updated Risk Management Plan to the EPA by June 2004.\n\n     In 1999 Watts Engineers was subcontracted by Pratt and Huth Associates, LLP to provide the City of Oswego a Level 3 RMP and a Process Safety Management (PSM) Program in accordance with 40 CFR 68 Risk Management Programs for Chemical Accidental Release Prevention and 29 CFR 1910.119 Process Safety Management for its East Side Wastewater Treatment Plant (WWTP) located at 71 Mercer Street in the City of Oswego, New York.  This evaluation was performed to assure that the facilities chlorine injection system complies with applicable regulations.  Key elements of the Risk Management Plan that were originally provided by Watts Engineers included: a review of the accidental release prevention and emergency response policies; a review of the regulated substance handled; a worst-case and alternative release scenario; a review of the general accidental release program and chemical-specific prevention steps; a review of the five-year accident history; a review of the emergency response program; and participation in meetings and planning changes to improve the Process Safety Program.  \n\n     The Oswego East Side WWTP is located on the East side of the City of Oswego between Fort Ontario to the West and the abandon Hammermill Paper Company site to the East.  It employs seven (7) full-time employees.  Activities at the facility include the treatment of Wastewater, removal of solid waste, and the treatment of the water portion with the addition of chlorine gas before returning the water to Lake Ontario.\n\n  "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29932,
      "SummaryText": "   Chlorine is considered a regulated substance under the Risk Management and Process Safety Programs.  Characteristics of this gas or liquid include a pungent suffocating odor.  It is irritating to the mucous membranes.  When chlorine reacts with water, it forms hydrochloric acid.  Hydrochloric acid gas is a toxic and corrosive fume.  The odor threshold for chlorine is about 0.5 ppm.  Long term exposures to small concentrations or short term exposures to high concentrations may result in adverse health effects.  Since chlorine gas is heavier than air, it can settle in low spots along the ground, therefore care should be exercised while working in confined spaces or low lying areas.\n\n     The City of Oswego and senior management at the East Side Wastewater Treatment Plant have a strong commitment to the overall safety of its employees, the public and the environment.  It is the policy of the East Side WWTP to train each employee and contractor about safety considerations and emergency procedures in the unlikely event of a discharge.  A maximum of eight thousand (8,000) pounds of chlorine gas in four (4) tanks are either in use or stored at one time at the facility.  Each tank contains two thousand (2,000) pounds of chlorine gas.  The chlorine is composed of 99.5 percent chlorine and 0.5 percent inert ingredients.  All tanks are stored inside the facility?s scale room.  Chlorine is being delivered by truck and unloaded using a two ton crane and placed inside the scale room until it is ready for use.  Each gas tank has its own valve guard to prevent objects from coming in contact with the valves.\n\n     When a chlorine tank is needed, a two ton crane lifts the cylinder and is moved along a crane rail and set onto the tank scale.  The tank scale room is fully enclosed.  The room is labeled ?chlorine hazard? and emergency instructions are posted at the door.  Material Safety Data Sheets (MSDS) are located in a common hallway by the operations station.  The tank scale roo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29932,
      "SummaryText": "m is always kept locked.  After employees leave for the day an intrusion alarm is set.\n\n     Within the tank scale room is the chlorine injection system.  PVC tubing leads from the tanks into the chlorine injection system.  Here, the chlorine is injected into the wastewater through a series of valves and PVC tubes.\n\n     The chlorine tanks are stored on either the calibrated scale, designed to hold two, 2000 pound tanks on roller trunnions or on 4 floor mounted trunnions. The chlorine containers have two valves in each head, with the tank in a horizontal position and the valves in a vertical line.  They deliver gas from the upper valve and liquid from the lower valve.  Five hundred (500) psig copper tubing fitted with a special adapter is used to connect the tank to the tubing system.  To connect the line to the container, a valve protection hood and the valve outlet cap are removed.  A wrench is used to connect the valving to the yoke.  A new gasket, which is supplied with the container, is used each time a connection is made.  As part of the Process Safety Management Program leaks are then checked using ammonia vapor.  The appearance of white vapor indicates a chlorine leak.  A protective suit, gloves, and a self contained breathing apparatus (SCBA) is worn by the operator and a chlorine tank repair kit is kept on hand in the unlikely event of a chlorine leak while changing tanks.  In the past five years, this facility has had no accidental releases of chlorine.\n\n     The City of Oswego East Side Wastewater Treatment Plant maintains a general accidental release prevention program and chemical specific prevention steps.  As a part of this program, a chlorine alarm system is in place at the facility.  The chlorine detector is located on the wall outside of the chlorine injection tank scale room.  The chlorine sensors and a visual alarm are located in the injection tank scale room.  In the event of a chlorine leak, a visual and audio alarm will sound on the computer "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29932,
      "SummaryText": "in the Assistant Superintendent?s office and in the operator?s control room, which is staffed 8 hours per day, 5 days per week.  The alarm is also connected to an autodialer which will call up to 14 different numbers/cell phones until someone is reached.  The monitor is maintained and calibrated by an outside contractor. The calibration frequency is yearly as recommended by the manufacturer.  Literature and information on the alarm system is kept on file by the Assistant Superintendent of the facility.  All employees are trained yearly on the chlorine alarm system.  An operator receiving an alarm is to follow the Emergency Response Plan.\n\n     The chlorine injection system itself operates under a vacuum produced by the injector mechanism.  Gas leaves the tank through a vacuum regulating valve.  A diaphragm senses vacuum on one side and atmospheric pressure on the other.  A spring loaded stem off the seat is displaced by force on the diaphragm.  Gas moves toward the flow control components and proper vacuum is maintained.  While under vacuum, gas enters the rotameter where its flow is measured.  Gas flow rate is controlled by a v-notch orifice and either manual or automatic positioning of the v-grooved plug in its ring.  A differential regulating valve is located after the orifice, which maintains the proper vacuum across the v-notch.  A pressure relief valve vents to the atmosphere if a malfunction occurs and pressure builds.  Gas is then dissolved in the water stream at the injector.  Check valves are in place and designed to close on injector shutdown.  There are no lines carrying gas under pressure in this system.  Loss of vacuum for any reason causes the vacuum regulating valve to shut off the gas supply.\n\n     The facility also complies with the Occupational Safety and Health Process Safety Management rule.  Management believes that the training of its employees and its contractors is crucial to maintaining a safe environment and continuing its accident free re"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 29932,
      "SummaryText": "cord for the chlorine system.  Training of all employees consists of a general orientation of the chlorine system first.  They are then instructed on the hazards and proper safe handling of the chlorine system.  The following courses are administered to all employees and refreshed yearly:\n\n  General Safety Training\n  DEC Wastewater Operator Renewal Training\n  Hazardous Communication Training\n  Confined Space Training\n  Respiratory Protection Program Training\n  Lock-out/Tag-out\n  Chlorine Tank Handling and Connections\n  Hearing Protection Program\n  Personal Protective Equipment Program\n\n     A record is kept of the training and placed in the training files.  The record contains the employee or contractor name, title of course, date the course was held, name of the trainer, and results of any written, oral, or hands-on exam.\n\n     Accidents are also prevented by good administrative controls.  Standard Operating Procedures (SOPs) are kept on hand and are easily accessible to the workers.  Each operator is trained in the applicable aspects of their job functions.  Those operators whose work is involved with any aspect of the chlorine injection system are thoroughly trained in those specific SOPs.  Workers who need to be inside the chlorine tank scale room or the chlorine injection room are provided chlorine specific training.\n\n     The City of Oswego East Side Wastewater Treatment Plant maintains an Emergency Management Program.  In the event of a chlorine leak alarm, the operator will first notify the other employees and then determine the location and magnitude of the leak.  The magnitude is broken down to minor leaks; no yellowish gas is visibly present, and major leaks; yellowish gas is visibly present.  For a minor leak, two trained operators will don SCBAs and protective gear and using the ammonia and water vapor bottle, find where the leak is and rectify the situation.  In the event of a major leak, the operator will call the Oswego Fire Department immediately an"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 29932,
      "SummaryText": "d then notify the other workers in the plant of the major chlorine leak.  The operator will designate one location that is upwind from the chlorine leak for all personnel to assemble and remain until the fire department informs the operator otherwise.  The Superintendent will then be called and informed of the situation.  The Oswego Fire Department will be in charge of the scene until they depart.  The approximate response time is less than five minutes.\n\n     Each member of the fire department is trained to at least Haz-Mat Level I.  Two members are trained to the Technician Level, and eleven members are trained to the Specialist Level.  The fire department has toured the plant to become familiar with what is on site, and develop different leak scenarios and practice emergency response measures.  On May 7th of 2002, a Haz-Mat drill with the Oswego Fire Department Haz-Mat Team was conducted.  The Haz-Mat Team was activated.  The scenario staged was that a tank while being changed, started leaking.  A full decon was set up.  The entry personnel used the chlorine kit to stop the tank from leaking.  A full critique was conducted, and everyone at the scene reviewed the site.\n\n     In the attached Risk Management Plan, toxic worst case and toxic alternative release scenarios were examined.  The scenarios were developed based on a two thousand pound tank filled with 99.5 percent chlorine.  The quantity released was the full two thousand pounds at a release rate of two hundred pounds per minute for ten minutes.  The meteorological factors were an atmospheric stability class of ?F? and a wind speed of 1.5 meters per second.  The topography is urban.  The release is assumed to be at ground level.  The toxic endpoint is 0.0087 mg/L (3 ppm).  These airborne concentrations are the maximum airborne concentrations that most people can be exposed to for up to one hour without experiencing serious or irreversible effects or symptoms.  The calculated distance to endpoint is 1.3 mile"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 29932,
      "SummaryText": "s.\n\n     The alternate release scenario for the chlorine injection system is one that is more likely to occur than the worst case scenario that reaches and endpoint off-site.  A chlorine leak caused by piping or valve failure is used in the alternative scenario.  A hole diameter of ? inch on the piping or valve could theoretically occur.  The release rate for this scenario is 9 pounds per minute for 222.2 minutes.  The meteorological conditions were atmospheric stability class of ?D? and a wind speed of 3.0 meters per second.  The topography is urban.  Again the toxic endpoint is 0.0087 mg/L (3 ppm).  The calculated distance to endpoint for the alternative scenario is 0.10 miles.  Methodology for determining distance to endpoints was done by referencing Risk Management Program Guidance for Wastewater Treatment Plants (40 CFR Part 68).\n\n\n     The chemical of concern at the East Side Wastewater Treatment Plant is chlorine.  Chlorine can be toxic if not handled properly, however, the City of Oswego has a reasonable program in place to minimize the potential risks to a chlorine gas release.  A training program combined with required record keeping, administrative controls, an effective emergency management program, a local Haz-Mat team, and an alarm system all address and meet the needs of the applicable regulations as defined under 40 CFR 68 and 29 CFR 1910.119.  The East Side Wastewater Treatment Plant evaluates their Safety and Training programs annually. They are also taking this opportunity to improve and expand their training programs, to make their employees further aware of the continued necessity for the safe use of chlorine."
    }
  ]
}