{
  "FacilityID": 2994,
  "FacilityName": "King Industries, Inc.",
  "FacilityStr1": "2 Science Road",
  "FacilityStr2": null,
  "FacilityCity": "Norwalk",
  "FacilityState": "CT",
  "FacilityZipCode": "06852",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "09001",
  "LEPC": "Norwalk LEPC",
  "FacilityLatDecDegs": "41.108139",
  "FacilityLongDecDegs": "-73.41275",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.kingindustries.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 42279513,
  "ParentCompanyName": "King Industries, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 42279513,
  "Company2DUNS": null,
  "OperatorName": "Richard S. King",
  "OperatorStr1": "2 Science Road",
  "OperatorStr2": null,
  "OperatorCity": "Norwalk",
  "OperatorStateFIPS": "CT",
  "OperatorZipCode": "06852",
  "OperatorZipCodeExt": null,
  "FTE": 165,
  "OtherEPAFacilityID": "CTD042279513",
  "EPAFacilityID": "100000043071",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-09 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 41.108491,
  "FRS_Long": -73.41271,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3340,
      "AltID": "Oleum Storage & Distrib.",
      "FacilityID": 2994,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 3563,
          "ProcessID": 3340,
          "ChemicalID": 69,
          "Quantity": 150000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 3408,
          "ProcessID": 3340,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1087,
              "Process_NAICS_ID": 3408,
              "SafetyReviewDate": "1999-03-01 00:00:00",
              "PHA_Date": "1999-03-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-10 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Annular space of double-walled tank monitored continuously.",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Double-walled storage tanks.",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Personnel inspections",
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-29 00:00:00",
              "TrainingReviewDate": "1999-01-08 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-01 00:00:00",
              "EquipmentInspectionDate": "1999-05-25 00:00:00",
              "EquipmentTested": "Oleum storage tanks",
              "ChangeMgmtDate": "1999-04-29 00:00:00",
              "ChangeMgmtReviewDate": "1998-11-30 00:00:00",
              "PreStartupReviewDate": "1997-11-10 00:00:00",
              "ComplianceAuditDate": "1998-04-16 00:00:00",
              "AuditCompletionDate": "1999-12-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1997-02-10 00:00:00",
              "HotWorkPermitReviewDate": "1998-06-24 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-28 00:00:00",
              "ContractorSafetyEvalDate": "1998-01-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1219,
                  "PreventionProgram3ID": 1087,
                  "ProcessChemicalID": 3563
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 2994,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1997-02-03 00:00:00",
    "ERTrainingDate": "1998-11-16 00:00:00",
    "CoordinatingAgencyName": "Norwalk Fire Department",
    "CoordinatingAgencyPhone": "2038663312",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2994,
      "SummaryText": "Mail to:\n\nRMP Reporting Center\nP.O. Box 3346\nMerrifield, VA  22116-3346\n EPA Risk Management Plan\nExecutive Summary\n\nKing Industries, Inc., is a small, privately held specialty chemical company located at 2 Science Road, Norwalk, CT.  The company manufactures a variety of specialty chemicals for the lubricants and coatings industries.  The company operates one facility for all manufacturing, research, marketing and administrative functions.  King Industries also operates a sales office in The Netherlands.  The company has operated in Norwalk since 1932.\n\nKing Industries uses a material called Oleum 20%.  Oleum 20% is the trade name for the mixture of 20% sulfur trioxide and 80% sulfuric acid.  The company has two storage tanks for Oleum that are capable of storing more than 10,000 lbs each.  This exceeds the reporting amount for Oleum (40 CFR Part 68.130).  Thus, King Industries is subject to Risk Management Plan Program 3 requirements (40 CFR 68.10).\n\nKing Industries takes a very proactive approach toward safety.  The company has several different programs to ensure the ongoing safety of its employees and the surrounding community.  The company has nine employees dedicated to working on safety and environmental issues, out of 165 total employees.  The company maintains a full-time fire brigade department.  The company has many written procedures for safely operating and maintaining plant equipment.  The company has an extensive training program for all its employees.  Operating procedure reviews, plant safety policy reviews, work procedure reviews, and any other training required by safety or environmental regulations are included in the company's training program.  The company uses state-of-the-art process and safety equipment throughout the facility.  The company has an ongoing inspection program for equipment, piping and vessels to help maintain reliability and prevent any incidents from occurring.\n\nKing Industries also has several programs for auditing and in"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2994,
      "SummaryText": "specting both new and existing facilities to ensure their continued safe performance.  The company has a well-established Management of Change program to thoroughly review all plant changes prior to execution.  The company conducts a pre-startup safety review for all changes, regardless of their size, to make sure they are done properly and the system will continue to function safely.  The company conducts Hazard and Operability Studies (HAZOP) to review all possible scenarios that may result in a release of material; appropriate changes are made to prevent that release from ever happening.  If a release were to take place, the company maintains a thorough incident investigation program.  This investigation includes a cross-functional team of operators, maintenance personnel, engineers, and any other personnel who may be able to contribute to the investigation.  The investigation team determines the root cause(s) for the incident, and offers recommendations to prevent recurrence for the process in question and the facility in general.  The company completes these recommendations on a priority basis.  King Industries uses these programs on all plant activities, regardless of their regulatory status.\n\nKing Industries completed the most recent HAZOP study for facilities handling Oleum in March 1999.  Recommendations of the study team are complete.\n\nKing Industries takes the potential to have an incident very seriously.  The company maintains written procedures on accidental release prevention, incident command and emergency response.  The company emphasizes accidental release prevention through all of these documents and in its training programs.  The company's training program includes annual refresher training in accident prevention and emergency response awareness for all manufacturing personnel.  Several employees receive additional training to help assist in any plant emergency.  The company has trained all emergency response personnel and several other key plant"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2994,
      "SummaryText": "personnel in specific Oleum related spill prevention and emergency response procedures.\n\nThe company has two emergency response vehicles equipped to help control the release of any material of any size.  All process buildings have fixed fire protection and foam deluge equipment.  The facility has a plant-wide fire alarm system that includes heat detection, smoke detectors and manual pull stations.  Any activation of the facility's fire alarm system alerts the Norwalk Fire Department through at least one of two independent means.  The fire alarm system is connected to both Security Link) from Ameritech and to TPC Associates, which have independent central stations and dispatch centers.  Further, Security Link) signals are transmitted directly to the Norwalk Fire Department from King Industries.  The company conducts drills on an annual basis and coordinates these drills with the Norwalk Fire Department.  The facility has never had an incident involving Oleum that had any offsite impacts whatsoever.  The facility has never required assistance from the Norwalk Fire Department due to an incident involving Oleum.\n\nThe company's worst case scenario involves the instantaneous release of all contents of one Oleum storage tank (see 40 CFR 68.25 for definitions of worst case scenario).  Both storage tanks used for Oleum are double-walled tanks surrounded by open cement walls (i.e., a dike).  The outer shell of the tank would contain any rupture of the internal tank and prevent the release of material to the environment.  For the worst case scenario, it is assumed that both tank walls fail simultaneously.\n\nEach Oleum tank has a working capacity of 68,800 lbs of Oleum.  The dike surrounding each tank is about fifteen feet on side and four feet tall.  The dike can hold all the material in the tanks, minimizing the area of the release.  There is up to 228 square feet of exposed surface within the dike.  The SLAB dispersion model estimated the release under worst-case weather cond"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2994,
      "SummaryText": "itions as defined by the EPA.  The affected area was estimated to be a radius of 610 feet from the tanks.  Two people reside within this area.\n\nKing Industries analyzed all Oleum handling scenarios to determine if there are any ways to release Oleum to the environment.  Two scenarios were analyzed to determine if there were offsite impacts:  failure of the transfer line to the storage tanks while unloading, and failure of the transfer line from storage to the process vessel.  Active mitigation measures are in place to limit the size of the release to 50 gallons of Oleum in each of these scenarios.\n\nUsing typical weather conditions for southwestern Connecticut, the SLAB dispersion model estimated the distance to endpoint for the two alternative risk scenarios.  The affected area was estimated to be a radius of 102 feet from the transfer lines (in the center of the plant) at ground level.  This distance is within the plant boundary; no offsite impacts exist for any credible alternative risk scenarios.\n\n\n\n\nCertification Statement for Program Level 3 Processes:\n\nTo the best of the undersigned\u0012s knowledge, information, and belief formed after reasonable inquiry, the information submitted is true, accurate, and complete.\n\n___________________________\t___________________________\nSignature\t\t\t\t\tPrint Name\n\n___________________________\t_______________\nTitle\t\t\t\t\t\tDate\n\n\n\n\nMail to:\n\nRMP Reporting Center\nP.O. Box 3346\nMerrifield, VA  22116-3346\n EPA Risk Management Plan\nExecutive Summary\n\nKing Industries, Inc., is a small, privately held specialty chemical company located at 2 Science Road, Norwalk, CT.  The company manufactures a variety of specialty chemicals for the lubricants and coatings industries.  The company operates one facility for all manufacturing, research, marketing and administrative functions.  King Industries also operates a sales office in The Netherlands.  The company has operated in Norwalk since 1932.\n\nKing Industries uses a material called Oleum 20%.  Oleum"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 2994,
      "SummaryText": "20% is the trade name for the mixture of 20% sulfur trioxide and 80% sulfuric acid.  The company has two storage tanks for Oleum that are capable of storing more than 10,000 lbs each.  This exceeds the reporting amount for Oleum (40 CFR Part 68.130).  Thus, King Industries is subject to Risk Management Plan Program 3 requirements (40 CFR 68.10).\n\nKing Industries takes a very proactive approach toward safety.  The company has several different programs to ensure the ongoing safety of its employees and the surrounding community.  The company has nine employees dedicated to working on safety and environmental issues, out of 165 total employees.  The company maintains a full-time fire brigade department.  The company has many written procedures for safely operating and maintaining plant equipment.  The company has an extensive training program for all its employees.  Operating procedure reviews, plant safety policy reviews, work procedure reviews, and any other training required by safety or environmental regulations are included in the company\u0012s training program.  The company uses state-of-the-art process and safety equipment throughout the facility.  The company has an ongoing inspection program for equipment, piping and vessels to help maintain reliability and prevent any incidents from occurring.\n\nKing Industries also has several programs for auditing and inspecting both new and existing facilities to ensure their continued safe performance.  The company has a well-established Management of Change program to thoroughly review all plant changes prior to execution.  The company conducts a pre-startup safety review for all changes, regardless of their size, to make sure they are done properly and the system will continue to function safely.  The company conducts Hazard and Operability Studies (HAZOP) to review all possible scenarios that may result in a release of material; appropriate changes are made to prevent that release from ever happening.  If a release were to"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 2994,
      "SummaryText": "take place, the company maintains a thorough incident investigation program.  This investigation includes a cross-functional team of operators, maintenance personnel, engineers, and any other personnel who may be able to contribute to the investigation.  The investigation team determines the root cause(s) for the incident, and offers recommendations to prevent recurrence for the process in question and the facility in general.  The company completes these recommendations on a priority basis.  King Industries uses these programs on all plant activities, regardless of their regulatory status.\n\nKing Industries completed the most recent HAZOP study for facilities handling Oleum in March 1999.  Recommendations of the study team are complete.\n\nKing Industries takes the potential to have an incident very seriously.  The company maintains written procedures on accidental release prevention, incident command and emergency response.  The company emphasizes accidental release prevention through all of these documents and in its training programs.  The company\u0012s training program includes annual refresher training in accident prevention and emergency response awareness for all manufacturing personnel.  Several employees receive additional training to help assist in any plant emergency.  The company has trained all emergency response personnel and several other key plant personnel in specific Oleum related spill prevention and emergency response procedures.\n\nThe company has two emergency response vehicles equipped to help control the release of any material of any size.  All process buildings have fixed fire protection and foam deluge equipment.  The facility has a plant-wide fire alarm system that includes heat detection, smoke detectors and manual pull stations.  Any activation of the facility\u0012s fire alarm system alerts the Norwalk Fire Department through at least one of two independent means.  The fire alarm system is connected to both Security Link) from Ameritech and to TPC"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 2994,
      "SummaryText": "Associates, which have independent central stations and dispatch centers.  Further, Security Link) signals are transmitted directly to the Norwalk Fire Department from King Industries.  The company conducts drills on an annual basis and coordinates these drills with the Norwalk Fire Department.  The facility has never had an incident involving Oleum that had any offsite impacts whatsoever.  The facility has never required assistance from the Norwalk Fire Department due to an incident involving Oleum.\n\nThe company\u0012s worst case scenario involves the instantaneous release of all contents of one Oleum storage tank (see 40 CFR 68.25 for definitions of worst case scenario).  Both storage tanks used for Oleum are double-walled tanks surrounded by open cement walls (i.e., a dike).  The outer shell of the tank would contain any rupture of the internal tank and prevent the release of material to the environment.  For the worst case scenario, it is assumed that both tank walls fail simultaneously.\n\nEach Oleum tank has a working capacity of 68,800 lbs of Oleum.  The dike surrounding each tank is about fifteen feet on side and four feet tall.  The dike can hold all the material in the tanks, minimizing the area of the release.  There is up to 228 square feet of exposed surface within the dike.  The SLAB dispersion model estimated the release under worst-case weather conditions as defined by the EPA.  The affected area was estimated to be a radius of 610 feet from the tanks.  Two people reside within this area.\n\nKing Industries analyzed all Oleum handling scenarios to determine if there are any ways to release Oleum to the environment.  Two scenarios were analyzed to determine if there were offsite impacts:  failure of the transfer line to the storage tanks while unloading, and failure of the transfer line from storage to the process vessel.  Active mitigation measures are in place to limit the size of the release to 50 gallons of Oleum in each of these scenarios.\n\nUsing typical"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 2994,
      "SummaryText": "weather conditions for southwestern Connecticut, the SLAB dispersion model estimated the distance to endpoint for the two alternative risk scenarios.  The affected area was estimated to be a radius of 102 feet from the transfer lines (in the center of the plant) at ground level.  This distance is within the plant boundary; no offsite impacts exist for any credible alternative risk scenarios."
    }
  ]
}