{
  "FacilityID": 30116,
  "FacilityName": "MeadWestvaco South Carolina, LLC - Kraft Division",
  "FacilityStr1": "5600 Virginia Avenue",
  "FacilityStr2": null,
  "FacilityCity": "North Charleston",
  "FacilityState": "SC",
  "FacilityZipCode": "29406",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45019",
  "LEPC": "Charleston County LEPC",
  "FacilityLatDecDegs": "32.889560",
  "FacilityLongDecDegs": "-079.968892",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.meadwestvaco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3358322,
  "ParentCompanyName": "MeadWestvaco Corporation",
  "Company2Name": null,
  "CompanyDUNS": 102235004,
  "Company2DUNS": 0,
  "OperatorName": "MeadWestvaco South Carolina, LLC",
  "OperatorStr1": "PO Box 118005",
  "OperatorStr2": null,
  "OperatorCity": "Charleston",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29423",
  "OperatorZipCodeExt": "8005",
  "RMPContact": "Wilson T. Gautreaux",
  "RMPTitle": "Technical and Environmental Manager",
  "FTE": 1113,
  "OtherEPAFacilityID": "29411WSTVC5600A",
  "EPAFacilityID": "100000089584",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0560-0008",
  "SafetyInspectionDate": "2002-03-27 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-05-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-05-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-02-03 00:00:00",
  "DeRegistrationEffectiveDate": "2009-01-22 00:00:00",
  "AnniversaryDate": "2009-05-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.0",
  "FRS_Lat": 32.89306,
  "FRS_Long": -79.96694,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "removed chlorine from this location",
  "_processes": [
    {
      "ProcessID": 43835,
      "AltID": "Paper Machines",
      "FacilityID": 30116,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 44809,
          "ProcessID": 43835,
          "NAICSCode": "32212",
          "_desc": {
            "NAICS_CODE": "32212",
            "NAICS_DESCRIPTION": "Paper Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 57864,
          "ProcessID": 43835,
          "ChemicalID": 62,
          "Quantity": 360000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 557864,
          "ProcessID": 43835,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 43836,
      "AltID": "Hazmat Railroad Track",
      "FacilityID": 30116,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 44810,
          "ProcessID": 43836,
          "NAICSCode": "32212",
          "_desc": {
            "NAICS_CODE": "32212",
            "NAICS_DESCRIPTION": "Paper Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 57865,
          "ProcessID": 43836,
          "ChemicalID": 62,
          "Quantity": 360000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 557865,
          "ProcessID": 43836,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 30116,
      "SummaryText": "RMP 2004 Executive Summary\n\nAbout MeadWestvaco\nMeadWestvaco South Carolina, LLC (MeadWestvaco) is a major manufacturer of paper, and employs nearly 1000 people in the North Charleston Mill. Our paper mill in North Charleston manufactures unbleached paper used to make decorative laminates for surfaces like kitchen countertops and office furniture.  Our high-strength paperboard is also used in the manufacture of a variety of familiar food containers and drink cartons.  In addition, MeadWestvaco's lumber mill produces framing lumber and construction timbers.\nEfficient use of all resources is a trademark of MeadWestvaco operations.  Natural by-products of the papermaking process are the raw materials for specialty chemical products manufactured by MeadWestvaco at its North Charleston Specialty Chemical Division facilities. These specialty chemical products are used in the manufacture of a variety of goods like rubber and plastics, soaps, asphalt, textile dyes and printing inks.\nMeadWestvaco emphasizes product and service differentiation.  As part of the company?s strategy, we are also unequivocally committed to total compliance with environmental, safety and health regulations.\nMeadWestvaco and Chlorine\nMeadWestvaco uses chlorine in 90-ton rail cars to treat water before it is used in the papermaking process.  Prior to use, the chlorine rail cars are staged on a separate track referred to as the Haz-Mat track.\n\nAt low concentrations chlorine is commonly used to make solvents, disinfectants and chlorine bleach cleaners.\nExposure to chlorine can cause irritation of the eyes, nose and throat.  Exposure to extremely high levels can damage the lungs and cause a buildup of fluid which can be life-threatening.\nProtection of the health and safety of our employees and residents of our communities is our highest priority.  When we handle chlorine, we make every effort to safeguard people and the environment.  Multiple safeguards are in place to ensure that we handle chlorine safe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 30116,
      "SummaryText": "ly. We also work closely with other members of our industry, local officials and the public to maintain stringent safety and environmental programs and to minimize risks.\n\nFive-Year Accident History\nMeadWestvaco?s commitment to the safe transportation, storage and handling of chlorine has prevented any accidents in the past five years of chlorine handling operations.\nEmergency Response\nMeadWestvaco has plans in place for handling emergencies -- fires and natural disasters as well as chemical incidents.  First and foremost, our goal in any chemical incident is to contain any release as quickly as possible and to minimize the impact on the\n \nfacility and its neighbors.  If an incident occurs:\n* Automatic safety valves close quickly to seal off chlorine supply;\n* Plant alarms will sound, the emergency communicated to all site personnel over the mill-wide alert system and emergency response teams will be activated;\n* MeadWestvaco Environmental Services personnel will be alerted, and if necessary, perform computer modeling to estimate area affected by release; and\n* North Charleston Fire Department will activate local and county response teams if needed.\n\nTraining and Preparation\nMeadWestvaco trains employees on safe handling of chlorine and prepare to respond appropriately to incidents should they occur.  This training and preparation includes:\n* Trained and qualified emergency response teams composed of MeadWestvaco employees are on-site around the clock take prompt action using the facility's fire truck, ambulance, and hazardous materials unit;\n* Emergency response systems in place, including plant wide alarms, radios linked to North Charleston Fire Department, and an accessible water supply;\n* Routine emergency drills conducted in conjunction with the county emergency preparedness office and the Local Emergency Planning Committee (LEPC); and\n* Action plans and community alert procedures in the event outside assistance is needed or potential for off-site impact exists"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 30116,
      "SummaryText": ".\n\nAccidental Release Prevention\n \nDesigning for Safety\nMeadWestvaco maintains wide-ranging systems to reduce the likelihood of incidents, including:\n* Safe chlorine containment in a rail car with steel inner core, an insulation layer to maintain temperature and a protective steel outer cover;\n* Solid steel barriers that prevent other transportation equipment from damaging rail cars;\n* Special hose connections to prevent an improper link to railcar during chlorine transfer;\n* Transfer of chlorine under vacuum to assure safe and complete clearance of lines;\n* Elevated transfer lines to protect them from ground traffic;\n* Valves that close if chlorine is released suddenly;\n* Monitoring equipment linked to alarm systems with automatic chlorine shutoff valves;\n* A Haz-Mat track for temporary storage remotely located inside the mill, and\n* Twenty-four hour monitored surveillance systems for rail cars and track.\n\nAssuring Safe Operations\nMeadWestvaco audits our safe handling procedures and maintain our equipment to assure consistent safe operation of the chlorine handling system.  These activities include:\n* Adherence to written operating procedures with checklists which must be followed for all operations;\n* Complete and detailed safety reviews prior to any changes to the operation or equipment;\n* Routine inspection of all instruments and control devices to assure optimal efficiency and effectiveness;\n* Preventative maintenance to assure equipment is safe, reliable and efficient;\n* Safety and Environmental audits to assure compliance with all regulations and MeadWestvaco?s stringent corporate standards for safe handling.\n\nPlanned Safety Improvements\nMeadWestvaco maintains a proactive approach to safety, and continuously monitors developments in chlorine handling safety. New mitigation and control technologies are thoroughly reviewed for effectiveness and applicability to our process.\n\nManaging Risks\nAs part of our commitment to comply with the laws and regulations of loc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 30116,
      "SummaryText": "al, state and federal agencies, MeadWestvaco has developed a risk management plan under the guidelines established by the Environmental Protection Agency (EPA).  Under these guidelines, facilities that handle specific quantities of regulated chemicals must submit plans that show the consequences of certain chemical releases and outline the measures taken to reduce the risk and minimize the effects of these releases."
    }
  ]
}