{
  "FacilityID": 30144,
  "FacilityName": "Anacortes Water Treatment Plant",
  "FacilityStr1": "14489 Riverbend Road",
  "FacilityStr2": null,
  "FacilityCity": "Mount Vernon",
  "FacilityState": "WA",
  "FacilityZipCode": "98273",
  "Facility4DigitZipExt": "9686",
  "FacilityCountyFIPS": "53057",
  "LEPC": "Skagit County LEPC",
  "FacilityLatDecDegs": "48.437778",
  "FacilityLongDecDegs": "-122.371601",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.cityofanacortes.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Anacortes",
  "Company2Name": null,
  "CompanyDUNS": 37993714,
  "Company2DUNS": null,
  "OperatorName": "William LaRue",
  "OperatorStr1": "14489 Riverbend Road",
  "OperatorStr2": null,
  "OperatorCity": "Mount Vernon",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98273",
  "OperatorZipCodeExt": "9686",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000099118",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-03-25 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-06-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-05-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-05-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2019-03-01 00:00:00",
  "DeRegistrationEffectiveDate": "2019-02-14 00:00:00",
  "AnniversaryDate": "2009-05-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.0",
  "FRS_Lat": 48.437572,
  "FRS_Long": -122.369918,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 43881,
      "AltID": "Water Treatment Plant",
      "FacilityID": 30144,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 58015,
          "ProcessID": 43881,
          "ChemicalID": 62,
          "Quantity": 36000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 44855,
          "ProcessID": 43881,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 25294,
              "Process_NAICS_ID": 44855,
              "SafetyReviewDate": "2004-05-11 00:00:00",
              "PHA_Date": "2004-01-12 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-05-12 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Chlortainer System",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-01-12 00:00:00",
              "TrainingReviewDate": "2004-03-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Simulation Exercise",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-08-15 00:00:00",
              "EquipmentInspectionDate": "2004-05-12 00:00:00",
              "EquipmentTested": "Chlorine system inspected daily",
              "ChangeMgmtDate": "2004-08-15 00:00:00",
              "ChangeMgmtReviewDate": "2004-08-15 00:00:00",
              "PreStartupReviewDate": "2004-08-15 00:00:00",
              "ComplianceAuditDate": "2002-06-01 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-04-05 00:00:00",
              "HotWorkPermitReviewDate": "2004-04-05 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2004-04-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 36996,
                  "PreventionProgram3ID": 25294,
                  "ProcessChemicalID": 58015
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 30144,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-05-11 00:00:00",
    "ERTrainingDate": "2004-03-24 00:00:00",
    "CoordinatingAgencyName": "Mount Vernon FD",
    "CoordinatingAgencyPhone": "3603366277",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 30144,
      "SummaryText": "Risk Management Plan Executive Summary\n\n1.Accidental Release Prevention and Emergency Response Policy.\n       \nA.Plant Policy:\n\nThe City of Anacortes Water Treatment Plant is committed to aggressively identifying hazardous conditions and practices that could result in any chemical spill, and will take immediate action to eliminate those hazardous conditions once found.\n       \nTo ensure that information about the dangers of all hazardous chemicals used by the Anacortes Water Treatment Plant are known by all affected employees, the following hazardous information program has been established:\n\nAll operators will participate in the Hazardous Communication Program. This program will always be available on the bookshelf on the left-hand side of the operator's console, for review by any interested operator. \n\nB.Container Labeling:\n\nThe operator on duty will verify that all containers received for use will be clearly labeled as to the contents, note the appropriate hazard warning and list the name and address of the manufacturer. The operator will then make sure that the Plant Manager, designated Supervisor and /or the Safety Representative are notified of the shipment received so they may verify whether or not the product complies with current plant policy.\n\nThe current Safety Representative will ensure that all secondary containers are labeled with either an extra copy of the original manufacturer's label or with labels that have the identity and the appropriate hazard warning. For help with labeling see the Manager or the designated Supervisor. The Plant Manager and the current Safety Representative will review plant labeling policy once a year and update as needed.\n\nC.Material Safety Data Sheets:\n\nThe Plant Manager is responsible for establishing and monitoring the plant's Material Safety Data Sheets (MSDS) program, and will make sure procedures are developed to obtain the necessary MSDS and will review incoming MSDS's for new or significant health and safety informat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 30144,
      "SummaryText": "ion..\n\nCopies of MSDS's for all hazardous chemicals in use will be kept in the appropriate MSDS Binder located at the Plant Console .  MSDS's will be available to all operators during each work shift.  If a MSDS is not available, immediately contact the current Safety Representative, the Plant Manager and/or the designated Supervisor.\n\n\n\nD.Employee Training Information:\n\nThe current Safety Representative is responsible for the plant's employee training program. The Safety Representative will ensure that all program elements specified below are carried out, and will also clear all program elements with the Plant Manager.\n\nUpon starting work, each new employee of the Water Treatment Plant will receive a health and safety orientation included in normal Water Treatment Plant training, that includes the following: \n\n·An overview of the requirements contained in the Hazard Communication Standard.\n·Hazardous chemicals present at the Water Treatment Plant.\n·Physical and health risks of the hazardous chemicals.\n·The symptoms of overexposure.\n·How to determine the presence of hazardous chemicals in the Water Treatment Plant.\n·How to reduce or prevent exposure to hazardous chemicals through use of control procedures, work practices and personal protective equipment.\n·Steps the City has taken to reduce or prevent exposure to hazardous chemicals.\n·Procedures to follow if employees are overexposed to hazardous chemicals.\n·How to read labels and review MSDS's to obtain information.\n·Location of the MSDS file and written hazard communication program.\n\nPrior to introducing a new chemical hazard into the Water Treatment Plant, each operator will be given information and training as outlined above for the new chemical hazard.\n\nE.Hazardous Non-routine Tasks:\n\nPeriodically, all operators are required to perform hazardous non-routine tasks. Some examples of non-routine tasks are:\n\nConfined Space entry, painting, etc.\n\nPrior to starting work on such projects, each affected operator will b"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 30144,
      "SummaryText": "e given information by the Plant Manager, project leader and/or the Safety Representative about the hazardous chemicals the operator may encounter during such activity. This information will include specific chemical hazards, protective and safety measures the operator can use, and steps the City is using to reduce the hazards, including ventilation, respirators, presence of another operator and emergency procedures. \n\nF.Informing Contractors:\n\nIt is the responsibility of the City to provide contractors with information about hazardous chemicals their employees may be exposed to on the job site and suggested precautions for the contractor¿s employees. \nContractors will be contacted before work is started to gather and distribute information concerning any chemical hazard that they may bring to the Water Treatment Plant.\n\nG.List of Hazardous Chemicals:\n\nFollowing is a short list of hazardous chemicals used at the Water Treatment Plant. Further information on each chemical may be obtained by reviewing the MSDS's located on the bookshelf on the left-hand side of the Operator's console. The chemicals commonly used at the Plant for the treatment of water include: \n\n·Chlorine\n·Aluminum Sulfate (aqueous solution)\n·Hydrated Lime\n·Polyacrylamide Polymer\n·Activated Carbon.\n·Ascorbic Acid\n\n2.Facility and regulated substances handled.\n\nThe City of Anacortes Water Treatment Plant is located on the east bank of the Skagit River in Mount Vernon.\n\nDescription of Process.\n\nThe source of untreated water for the City of Anacortes water supply system is the Skagit River.  The treatment process consists of raw water intake and pumping, flocculation, sedimentation, filtration, disinfection and finish water pumping.  The intake structure is located on the west bank of the river.  The water is pumped across the river to the flocculation and sedimentation basins at the treatment plant site.  Following flocculation and sedimentation, the water flows through the filter beds in the treatment p"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 30144,
      "SummaryText": "lant and then into a 760,000-gallon clearwell where the water is disinfected.  Eight vertical and two smaller variable speed turbine centrifugal pumps deliver the chlorinated water to the transmission pipelines.\n\nAlum, lime, polymer, chlorine and activated carbon can be mixed with the raw water as part of the treatment process to aid in the removal of solid particles and other contaminants.  Mechanical flocculators were installed in 1978 upstream of the sedimentation basins to improve plant performance.  Solids settled out in the sedimentation basin are mechanically removed from the bottom by continuous chain scrapers.\n\nThe six filters contain a mixed media filter material.  These filters remove the remaining particles in the water before it enters the clearwell.  They are equipped with surface agitators and are backwashed when the head loss through them exceeds the maximum value for optimum operation.  The filters are also backwashed if the turbidity of the effluent water exceeds 0.2 NTUs regardless of the head loss.  Backwash water for the filters is pumped from the clearwell.\n\nTreated water (i.e., ¿Finished Water¿) is supplied to the transmission pipeline by eight high-head pumps and two variable-speed pumps at the treatment plant.  The actual output of the high-head pumps is limited by the capacity of the transmission pipeline to approximately 33-mgd.  Actual peak flow rates in 1997 were 30.0 mgd.\n\nSediment from the flocculation chamber, sedimentation basins, and the filter backwash process is piped to the plant waste sump.  Two pumps are used to pump this wastewater to a solids handling facility.  The solids handling facility consists of three lagoons located on plant property.  The lagoons allow for suspended material to settle out.  Clear water can then be allowed to flow back to the river or to dissipate through natural percolation and evaporation. \n\n\n3.Worst-Case and Alternate Release Scenarios.\nBoth worst-case and alternate realease information can be foun"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 30144,
      "SummaryText": "d in the RMP Database\n\n4.General Accidental Release Prevention Program and Chemical Specific Prevention Steps.\n\nCHLORINE EMERGENCY RESPONSE PLAN\n\nINTENT:\nThe intent of this chlorine emergency response plan is to educate and prepare this and other departments in the importance of an effective and rapid response in the execution and elimination of a real or potential hazard by training individuals through preplanning and coordination with all affected departments in a professional and unified manner.\nPOL-28.23.07   RESPONDING TO CHLORINE EMERGENCIES\n        \nThis policy applies to all Water Treatment Plant operators and C.E.R.T. team members.\n\n1.Operators Attend Training and Pass Tests to Join Chlorine Emergency Response Team (C.E.R.T.)\n\nTo join the Chlorine Emergency Response Team and be a qualified responder to a chlorine emergency operators must:\n·Pass a Self-Contained Breathing Apparatus (SCBA) fit test.\n·Train in the use of the SCBA.\n·Train in the requirements and use of level ¿B¿ chemical suite and proper personal protective equipment.\n·Train in the use of the chlorine leak Class B repair kit.\n·Have a valid first aid card.\n·Be physically able to perform the work.\n·Be able to function under stress.\n\n2.Operator on Duty Always Determines if Qualified C.E.R.T. Members are on Site\n \nWTP qualified C.E.R.T. members are:\n                           Home      Nextel         Pager\nWilliam LaRue    293-1897   661-3684    336-0247\nJamie LeBlanc    240-1399   661-3582    336-0257\nGeorge Atkinson 293-0125   661-3540    848-3247\n\n3.Operator Calls C.E.R.T. Team Immediately to Respond to Chlorine Emergencies\n\n\n\n4.Staff Calls 911 AFTER Plant Manager and C.E.R.T. Team Are Contacted\n\nStaff calls 9-911 only AFTER the Plant Manager or authorized supervisor and the C.E.R.T. team have been contacted and have determined that the leak is severe enough to require backup. To call 911 on City Nextel¿s dial: 336-3131 or Speed Dial #91\n\n5.Employee Calling 911 Gives Important Information\n\nThe e"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 30144,
      "SummaryText": "mployee calling 9-911 prepared to give the following information:\n·Location of WTP and our Staging Area. Staging Area/Communication Center will be at edge of the south field after the C.E.R.T. team has been activated.\n·Leak Severity\n·Wind Direction/Wind Speed\n·Extent of injuries\n·Need to evacuate neighbors north or south of the site.\n\n6.C.E.R.T. Members Follow POL-28.23.08WTP When Fighting a Chlorine Leak \n7.Emergency Phone Number for Pioneer Americas 8am to 5pm   \n\n1-877-272-0500 \n1-253-272-9376\nGeorge Karscig (Plant Manager) 24 hr contact Cell # 1-253-686-4554\n\n\n\n\n\nPOL-28.23.08   FIGHTING CHLORINE LEAKS\n        \nThis policy applies to all Water Treatment Plant C.E.R.T. team members.\n\n1.Responding C.E.R.T. Members Wear Personal Protective Clothing\n\nResponding C.E.R.T. members wear personal protective clothing that meet the requirements of WAC 296-62-3170(b). This includes SCBA, chemical resistant inner and outer gloves, chemical resistant steel toe and shank boots, hard hat, and Dupont Tychem Level ¿B¿ hooded coveralls.\n\n2.Responding C.E.R.T. Members Always Rotate Containers\n\nResponding C.E.R.T. members always rotate the container so chlorine gas leaks, not liquid. The quantity of chlorine that escapes from a gas leak is about 1/15th the amount that escapes from liquid leak through the same size hole.\n\n3.Team Keeps Tank Cool Using Water During a Fire or Extreme Heat\n \nBecause a fusible plug met down occurs at 158-162 degrees Fahrenheit the team members keep the tank cool using water during a fire or extreme heat, except\n·When the container is leaking, water should not be used. Chlorine and water react and acids are formed that will corrode the container and the leak will quickly worsen. However, where several containers are involved and some are leaking, it may be prudent to use water to prevent rupture of the non-leaking containers.\n\n4.Members ALWAYS Shut Off the Chlorine Feed System During a Fire\n\nChlorine and steel burn at 400 degrees F.\n\n5.Team Operates Under t"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 30144,
      "SummaryText": "he Buddy System at All Times\n\n6.Members Use Ammonia Bottles to Determine Leak Location and Severity\n\n7.Members Determine if Need to Call the Mount Vernon Fire Department for Backup and Assistance \n\n8.Team Closes Building Vents and Installs B-Kit to Contain Leak\n\n9.If 10 Pounds or More of Chlorine is Released Plant Manager or Authorized Supervisor Calls 911.\n\n10.Team Provides First Aid to Victims of Chlorine Exposure\n\n11.After Leak is Contained Plant Manager or Authorized Supervisor Fills Out an Incident Report for Washington Cities Insurance Authority\n\n\n\nRESPONDING C.E.R.T MEMBERS SHOULD NEVER:\n\n1.NEVER Discard a Leaking Container Into a Water Way\n\nBy discarding a leaking chlorine container into a water way the chlorine would not only endanger or kill aquatic life, the chlorine leak will become aggravated, increasing the corrosion, and in turn increasing the amount of chlorine leaking. The container may float when still partially full of liquid chlorine allowing gas evolution at the surface.\n\n2.NEVER Leave Container Valves Open When Container is Not in Use\n\nPiping, valves, and containers should always be closed or capped when not in use to keep atmospheric moisture out of the system. Moisture in the system will create a highly corrosive condition. When chlorine mixes with moisture it readily forms hydrochloric acid.\n\n3.NEVER Connect a Container to a Manifold That is Not the Same Temperature as Existing Containers\n\nWhen discharging through a manifold, all containers should be at the same temperature to prevent transfer of gas from a warm container to a cool container.\n\n\n4.NEVER Drop a Container\n\nThis could fracture, weaken, or damage container valves or fusible plugs causing a leak.\n\n5.NEVER Handle a Container When the Valve Bonnet is Not in Place\n\nThe valves could become damaged or broken as a result of a collision, dropping, etc.\n\n6.NEVER Store a Container in Direct Sunlight\n\nThis will cause a build up of pressure and the possibility of a rupture due to high surrou"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 30144,
      "SummaryText": "nding temperature.\n\n7.NEVER Re-Use Gaskets\n\nA leak can be caused by the use of an old gasket which is weak, brittle, cracked, or damaged in some way.\n\n8.NEVER Use a Wrench Larger Than 6¿, Use Designated Wrenches Only\n\nOver-torque can damage or break the container or header valves.\n\n9.NEVER Open the Container Valve or Header Valve Over ½ Turn\n\nTo allow rapid shutdown of chlorine flow.\n\n\n5.Five Year Accident History.\nThe Anacortes Water Treatment Plant has had no reportable incidents in the last five years. A reportable incident is classified as an incidental chlorine spill of ten pounds or more.\n\n6.The Emergency Response Program.\n\nOur chlorine emergency response plan is designed to educate and prepare the Chlorine Emergency Response Team (CERT) for the effective and rapid response in the execution and elimination of a real or potential chlorine hazard by training it¿s members through preplanning and coordination in a professional and unified manner. This policy is reviewed yearly for any needed updates.\n\nThe Chlorine Emergency Response Team (CERT) is made up of members of the Water Treatment Plant. The team is on call 24 hours a day. The objective of the team is to respond quickly to contain any leaks or ruptures of chlorine containers found at the Treatment Plant or on any lands owned or operated by the City of Anacortes. All team members train four times each year in the use of Self-Contained Breathing Apparatus (SCBA) and on how to set up and use the Ton Repair Kit(B-Kit)\n\nIn the event of a serious leak that releases or has the potential to release 10 or more pounds of chlorine, local responders (Mount Vernon Fire Dept.) and the County Department of Emergency Services will be called to assist.\n\nAlso, as part of our overall safety program, we conduct the following inspections. \n\n\nA.Annual Site Survey: Once a year an inspection team made up of members of the Safety Committee will conduct a thorough walk through inspection of each work site. They will list any safety"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 30144,
      "SummaryText": "hazards or potential hazards at the walk through. Results of these inspections will be used to control obvious hazards, target certain work areas for more intensive investigation, assist in revising checklists used during regular monthly safety inspections, and as part of annual review of the effectiveness of our accident prevention program.\n\nB.Periodic Change Survey: Any time a new piece of equipment is received, a change is made in work procedures, or any changes made to building structures that may have safety ramifications, safety committee representatives shall examine the changed conditions and make recommendations to eliminate or control hazards that may be created as a result of the change.\n\nC.Monthly Safety Inspection: Each month before regularly scheduled safety committee meeting, each \nmember will inspect their area for hazards using the standard safety inspection checklist and talk to co-workers regarding their safety concerns. The committee member will report any hazards or concerns expressed to the whole committee for consideration. Results of area inspections and any actions taken shall be posted in affected areas. Committee members may, periodically, agree to inspect each other¿s areas to provide different outlook. \n\nJob Hazard Analysis: When work areas or tasks are identified as potentially hazardous as the result of a review of injury records, a note on the annual site survey, or a reasonable concern expressed by a worker, supervisor, or safety committee member, a hazard analysis is to be conducted by a group from the safety committee using the ¿Job Hazard Analysis¿ form and instructions will be scheduled as soon as possible. The job will be modified as needed to control or eliminate the hazard. Employees will be trained in revised operation. Results will be reported to safety committee.\n \n7.Planned Changes to Improve Safety.\n\nFormalized HAZWOPER training and certification for all CERT members from accredited training facility is being planned at"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 30144,
      "SummaryText": "this time."
    }
  ]
}