{
  "FacilityID": 3019,
  "FacilityName": "Bristol Tennessee Water Treatment Facilities",
  "FacilityStr1": "364 South Holston Dam Road",
  "FacilityStr2": null,
  "FacilityCity": "Bristol",
  "FacilityState": "TN",
  "FacilityZipCode": "37620",
  "Facility4DigitZipExt": "0842",
  "FacilityCountyFIPS": "47163",
  "LEPC": "Sullivan County",
  "FacilityLatDecDegs": "36.5",
  "FacilityLongDecDegs": "-82.7",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.bristoltn.org",
  "FacilityEmailAddress": "bsorah@3wave.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Bristol Tennessee",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Bristol Tennessee",
  "OperatorStr1": "801 Anderson Street",
  "OperatorStr2": "P.O. #1189",
  "OperatorCity": "Bristol",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37621",
  "OperatorZipCodeExt": "1189",
  "RMPContact": "David L. St. John",
  "RMPTitle": "Water Plant Superintendent",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000036677",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-31 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "1999-12-07 00:00:00",
  "DeRegistrationEffectiveDate": "1999-11-09 00:00:00",
  "AnniversaryDate": "2004-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 36.53556,
  "FRS_Long": -82.1075,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3374,
      "AltID": "Chlorine - Disinfection",
      "FacilityID": 3019,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3442,
          "ProcessID": 3374,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3601,
          "ProcessID": 3374,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503601,
          "ProcessID": 3374,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3019,
      "SummaryText": " The City of Bristol Tennessee owns and operates a Water Filtration Plant located off of Highway #421, South, at 364 South Holston Dam Road.  The Water Plant uses 1-ton Chlorine cylinders to treat approximately 5-7 million gallons/day of drinking water for the citizens of Bristol Tennessee. All applicable procedures of the OSHA, Process Safety Management Plan (PSM) are followed, as well as the steps of an Emergency Operational Manual required by the Tennessee Department of Environment and Conservation.\n As indicated on the site map, the chlorine storage/feed room is located at the end of the chemical building.  This room contains scales and a crane to unload and move the chlorine cylinders.  The weight of the chlorine is recorded every two hours a cylinder is in use.  Chlorine is fed from the top valve on the chlorine tank (the top valve allows us to feed chlorine as a gas, not a liquid, which is easier to contain if a leak does occur).  The chlorine storage room and the chlorine feed droom both contain chlorine alarms which will notify an operator if a problem does occur.  Also, both chlorine rooms have an exhaust fan that works automatically when the door is opened to help prevent operator injury.  We have a chlorine repair Kit B, which is used for one-ton cylinders.  We also have Scott Air Paks on hand to use in case of an emergency.\nThese are maintained and tested according to regulations.                                                            \n  The offsite consequence analysis included two chlorine release scenarios, identified as \"Worst Case Release\" and \"Alternative Scenario\".  The Worst Case Release is defined by EPA as \"a release of the maximum quantity in the largest vessel, in the form of a gas in 10 minutes.\" We usually have two chlorien cylinders connected to the manifold at the same time.  Although, the valve is closed on the full cylinder is almost emplty and ready to be switched over, the worst case would be the release of 2000 pounds of chlorin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3019,
      "SummaryText": "e.  The alternative release scenario is defined as \"more likely to occur than the worst-case scenario.\"\nThis could occur in the flexible hoses that connect the chlorine cylinders to the chlorine vacuum feeders.  This could occur during a cylinder change-over, by not properly tighting a connection.  This could cause a very small amount of chlorine to be released.\n  Atmospheric dispersion modeling has to be performed to determine the distance traveled by the chlorine gas released before its concentration decreases to the \"toxic endpoint\" selected by the EPA as 3ppm, which is the Emergency Response Planning Guideline Level. (ERPG)  This is defined by the American Industrial Hygiene Association (AIHA) as the \"maximum airborne concentration below which it is believed that nearly all individuals could be exposed to for up to one hour without developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\" The residential population within a circle with a radius corresponding to the toxic endpoint distance has to be defined, \"to estimate the population potentially affected.\"  Chapter 12 of the Process Safety Management plan (PSM), contains a Chlorine Emergency Action Plan and evacuation plans for the areas around the Bristol Water Plant.\n The Worst-Case Release scenario at the Bristol Water Plant involves a failure of a one-ton cylinder which could involve 2000 pounds of chlorine.  The scenario follows the conditions set by EPA, the release of the entire cylinder in 10 minutes, use of the one-hour average (ERPG-2) as the toxic endpoint, and considering the population residing within a full circle with a radius corresponding to the toxic endpoint distance. EPA set these conditions to facilitate the performance of the offsite consequence analysis; however, this is somewhat unrealistic because only the population within an elliptical plume extending downwind of the release point is potentially affected."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3019,
      "SummaryText": "  This plume area, will be smaller than the area of the full circle.  EPA mandated conditions such as, Stability Class F,  wind speed of 1.5 m/sec, highest daily maximum temperature, and average humidity were used.  The distance to endpoint was calculated for an Urban area of 2.63 miles.\n  The Alternative-Case Release scenario involves a tubing failure or bad connection.  The release is only a  gas, no liquid escapes.  The amount of chlorine released is 320 pounds, at an average rate of 60 minutes for the duration of the release at 10.5 or 11 lb/min.  The toxic endpoint distance to the ERPG-2 was used.\nThe distance to Endpoint was calculated for an urban area as 0.48 mi.  This scenario was modeled as a release from a horizontal 1-ton cylinder with the release occurring through a short pipe or bad connection. The chlorine escapes only as a gas.  The same conditons would occur as in the previous scenario, only affecting the population within the plume which extends downwind from the release point, not the people in the full circle.  The distance to endpoint was calculated for an Urban area of 0.48 miles.\n The chlorine detector/alarm is an active mitigation measure, while the chlorine being stored inside a building\ncreates a passive mitigation measure.  We are located near the South Holston Lake which encompasses a great deal of TVA property.  TVA wildlife areas, as well as the lake and the Weir Dam represent areas of recreation and environmental receptors.\n  The Bristol Tennessee Water Plant is in compliance with OSHA-Process Safety Management.  Our accidental release prevention program is based on the following elements:\n   * The preventive maintenance program.\n   * The use of state-of-the-art process and safety equipment.\n   * The performance of a Process Hazard Analysis, to review equipment and procedures. \n   * The high level of training of the Water Plant Operators.\n   * Implementation of an auditing and inspection program."
    }
  ]
}