{
  "FacilityID": 30197,
  "FacilityName": "NEW Cooperative-LuVerne/ FORMERLY BODE COOPERATIVE",
  "FacilityStr1": "101 Peavey Drive",
  "FacilityStr2": null,
  "FacilityCity": "LuVerne",
  "FacilityState": "IA",
  "FacilityZipCode": "50560",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19091",
  "LEPC": "Region 5 LEPC",
  "FacilityLatDecDegs": "42.907611",
  "FacilityLongDecDegs": "-094.087639",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 22028369,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "NEW Cooperative, Inc.",
  "OperatorStr1": "2626 1st Avenue South, Box 818",
  "OperatorStr2": null,
  "OperatorCity": "Fort Dodge",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50501",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dennis Knight",
  "RMPTitle": "Safety & Loss Control Manager",
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000173233",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-07-24 00:00:00",
  "SafetyInspectionBy": "Ia. Dept. of Ag.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-05-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-05-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-05-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.0",
  "FRS_Lat": 42.90761,
  "FRS_Long": -94.08764,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 43949,
      "AltID": null,
      "FacilityID": 30197,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 44923,
          "ProcessID": 43949,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 58086,
          "ProcessID": 43949,
          "ChemicalID": 57,
          "Quantity": 86700.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 558086,
          "ProcessID": 43949,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 30197,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION/EMERGENCY RESPONSE AT NEW COOPERATIVE, LUVERNE, IOWA\n\nThis facility complies with ANSI Standard k-61.1-1995 requirements for Anhydrous Ammonia storage. It is our policy to adhere to all applicable Federal, State, and local regulations. If an emergency were to occur, it is our policy to immediately vacate the premises, move to a safe location, and notify the LUVERNE Volunteer Fire Department (via 911call) and request that it respond to the emergency. Incidental to the notification to the fire department, a call to the Region 5 LEPC will be made.\n\nWhile we have planned for an emergency, it is acknowledged that a real emergency will be unexpected and may very well be different and cannot be ensured to duplicate what may have been planned. In reality, the situation that develops may not happen in the manner in which it has been planned. In that event, what we may have planned will serve only as a guideline to follow.\n\nThe Emergency Action Plan for this facility describes certain procedures that are intended to minimize the hazards associated with human health and the environment from fires, explosions, the sudden and unexpected release of chemicals (i.e. Anhydrous Ammonia), tornadoes, bomb threats or other accidents or acts of God which might occur on our premises.\n\nThe primary emergency response coordinator for the LUVERNE, Iowa location is DOUG YETMAR, Location Manager. His work and 24 hour emergency response telephone numbers are provided in the Registration Section of this document. The 24 hour emergency response number provided in that section also provides a telephone tree for additional individuals who are available and can respond to an emergency at that location.\n\nDESCRIPTION OF THE ANHYDROUS AMMONIA STORAGE/DISTRIBUTION PLANT AND THE REGULATED SUBSTANCE HANDLED AT NEW COOPERATIVE, LUVERNE, IOWA\n\nThis facility is a parking lot staging area for nurse tanks. The anhydrous ammonia that is stored at this facility is distributed to agri"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 30197,
      "SummaryText": "cultural crop producers in the surrounding area who utilize the anhydrous ammonia for crop nutrient purposes.\n\nNurse tanks are filled and positioned a waiting distribution and transportation from the parking area to the farm. In this instance, nurse tanks are parked in a lot that is not situated on continguous property to the bulk plant. At any one point in time between 1-20 nurse tanks could be parked in this lot awaiting pickup or delivery to area crop producers. The specific address of the parking lot is described in the registration section of this document.\n\nTHE WORST-CASE RELEASE SCENARIO:\nThe worse-case scenario is the failure of the 1500 gallon nurse tank when filled to the greatest amount allowed (85% of capacity), resulting in the release of the total volume in a gaseous (hazardous ammonia vapor cloud) form. According to EPA's RMP* COMP (Version 1/06), the distance to the endpoint is .8 miles. The alternative release scenario involves the transport delivery vehicle pulling away from the intake lines into the storage plant without disconnecting the transfer hoses. The resulting release (according to EPA's RMP*COMP Program) has a distance to endpoint of 0.1 miles.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS:\n\nThis facility complies with EPA's accident prevention rule and all applicable State and local codes and regualtions. The anhydrous ammonia system is designed, installed, and maintained in accordance with ANSI Standard k-61.1-1995 and State law.\n\nIn addition the company has specific operating procedures in place intended to minimize the potential for an accidental (and potentially catastrophic) release of anhydrous ammonia. Finally, NEW Cooperative has extended to the LUVERNE Volunteer Fire Department the opportunity to visit our anhydrous ammonia plant, to particiapte in mock emergency simulation training, and to avail themselves of specific anhydrous ammonia health hazard information and training provided by th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 30197,
      "SummaryText": "e company.\n\nFIVE-YEAR ACCIDENT HISTORY:\n\nThere have been no accidental releases of anhydrous ammonia in the last five years that have caused any deaths, injuries,evacuations, shelterings in place, property damage, or environmental damage.\n\nTHE EMERGENCY RESPONSE PROGRAM:\n\nIn the event of an emergency involving our anhydrous system, it is the policy of NEW Cooperative to immediately notify the LuVerne Fire Department and the Region 5 LEPC to request that they respond to the emergency. In the unlikely event that the LuVerne Fire Department is unable to adequately respond to an emergency at our LuVerne location, mutal aid (reciprocal agreement between neighboring fire department) will be summoned. We have discussed this policy with the fire department and Region 5 LEPC. Members of the fire department and the LEPC have inspected our anhydrous plant. In addition, copies of photographs taken of our plant have been provided (for reference) to both entities.\n\nPLANNED CHANGES TO IMPROVE SAFETY:\n\nSafety improvement is an ongoing process at this facility. Periodic evaluations are performed to assess the maintenance of safe conditions. There are no additional specific safety recommendations regarding storage or use of anhydrous ammonia for implementation at this time."
    }
  ]
}