{
  "FacilityID": 30227,
  "FacilityName": "City of Alma Water Treatment Plant",
  "FacilityStr1": "200 N. Lincoln",
  "FacilityStr2": null,
  "FacilityCity": "Alma",
  "FacilityState": "MI",
  "FacilityZipCode": "48801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26057",
  "LEPC": "Gratiot County LEPC",
  "FacilityLatDecDegs": "43.376944",
  "FacilityLongDecDegs": "-084.666111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Alma",
  "OperatorStr1": "525 E. Superior St.",
  "OperatorStr2": null,
  "OperatorCity": "Alma",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48801",
  "OperatorZipCodeExt": null,
  "RMPContact": "William Pilmore",
  "RMPTitle": "Water Systems Superintendent",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000011541",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-05-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-04-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-05-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-05-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-10-18 00:00:00",
  "DeRegistrationEffectiveDate": "2013-10-11 00:00:00",
  "AnniversaryDate": "2009-05-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.0",
  "FRS_Lat": 43.37766,
  "FRS_Long": -84.66641,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "2400",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 43985,
      "AltID": "Chlorine gas",
      "FacilityID": 30227,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 44959,
          "ProcessID": 43985,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 58123,
          "ProcessID": 43985,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 558123,
          "ProcessID": 43985,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 30227,
      "SummaryText": "The City of Alma Water Treatment Plant uses chlorine gas for the purpose of destroying disease causing organisms in the public water supply. The EPA has determined that chlorine is a potential hazard to the community as it relates to air quality when more than 2000 pounds are stored on site. Because of this risk it is necessary to observe safe operating and handling procedures, as well as test and maintain safety devices built into the system. Personnel assigned to handle chlorine storage tanks have attended training seminars related to proper handling procedures. Annual training is also given to all personel in the use of a self contained breathing apparatus ( Scott Air Packs) should it be needed for rescue or evacuation of the building. Procedures for evacuation and notification should a release occur are also discussed annually. The staff of the Water Treatment Plant have made an effort to identify process risks over the years and provide reasonable solutions tominimize these risks. Recent improvements include installation of chlorine resistant exterior fiberglass doors in the chlorine room to help contain a release to the building. In 1994 the original pressure fed chlorinators were scrapped and a vacuum feed system put in its place. This system automatically shuts the chlorine feed valve off should a leak occur in the feed line. Air quality monitoring devices are installed on the first and second floors of the building. Should a chlorine leak occur these devices activate an audio alarm in the building and a visual alarm outside the building in the form of a blinking red light. Routine maintenance and daily checks are made on these devices to ensure their reliability. Should an accidential release occur it is the policy of the Water Treatment Plant to evacuate the building and notify the local fire department to respond to the incident. It is the responsibility of the Fire department to coordinate control and cleanup of the incident with Youngs Environmental ser"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 30227,
      "SummaryText": "vices. The stationary source of chlorine storage is located at the Water Treatment Plant in a residential neighborhood at 200 N. Lincoln Ave. Chlorine tanks are shipped to the plant by truck. The maximum amount of chlorine in the building at any one time is 6 tons. The vulnerability zone for the City of Alma Water Treatment Plant was determined by a worse case scenario for a release of chlorine. Utilizing RMP comp software, a worse case scenario would involve a complete release of 2000 pounds of chlorine within a 10 minute period. This release could potentially affect a downwind area of .9 miles. Since wind direction is indeterminate, a .9 mile radius around the facility which includes a population of approximately 9000 people could be affected. It must be recognized that the actual area affected during a release would be dependent on many variables, including atmospheric conditions and release rates. It is the policy of the Water Treatment Plant to contain the leak to the chlorine room. No vent to the outside will be turned on while a risk to the community exists. An alternative scenario was also calculated. This scenario would involve a complete release of 2000 pounds of chlorine through a .45 square inch hole in one hour. This would equate to shearing one of the valves off the tank. This release could potentially affect a downwind area of .1 miles. This scenario would be more likely to happen than the worst case scenario. It is the goal of the City of Alma Water Treatment Plant to eliminate the practice of feeding chlorine gas and switch to sodium hypochlorite as the primary disinfecting chemical. The city has hired the services of Rowe Engineering to design a sodium hypochlorite system in the existing chlorine storage room. This project is the be completed in the summer of 2009. In doing this the risk to the public is all but eliminated. In the mean time the number of ton cylinders stored in the building has been reduced from a max of 6 cylinders to 4 cylinders."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 30227,
      "SummaryText": "\n"
    }
  ]
}