{
  "FacilityID": 30247,
  "FacilityName": "Riverside Energy Center",
  "FacilityStr1": "1401 W. B-R Townline Road",
  "FacilityStr2": null,
  "FacilityCity": "Beloit",
  "FacilityState": "WI",
  "FacilityZipCode": "53511",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55105",
  "LEPC": "Rock County LEPC",
  "FacilityLatDecDegs": "42.960556",
  "FacilityLongDecDegs": "-089.031667",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Riverside Energy Center, LLC",
  "Company2Name": null,
  "CompanyDUNS": 112710876,
  "Company2DUNS": null,
  "OperatorName": "Energy Riverside Center, LLC",
  "OperatorStr1": "250 Parkway Drive, Suite 380",
  "OperatorStr2": null,
  "OperatorCity": "Lincolnshire",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60069",
  "OperatorZipCodeExt": null,
  "FTE": 22,
  "OtherEPAFacilityID": "WIR000110254",
  "EPAFacilityID": "100000186078",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "01RV077 WI",
  "SafetyInspectionDate": "2004-01-19 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-05-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-05-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-05-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.0",
  "FRS_Lat": 42.58442,
  "FRS_Long": -89.03672,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 44010,
      "AltID": "SCR System",
      "FacilityID": 30247,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 58148,
          "ProcessID": 44010,
          "ChemicalID": 57,
          "Quantity": 185040.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 44984,
          "ProcessID": 44010,
          "NAICSCode": "22111",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 16919,
              "Process_NAICS_ID": 44984,
              "SafetyReviewDate": "2003-07-29 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "Yes",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": "All equipment design and installation were based on these standards.",
              "HazardReviewDate": "2002-03-01 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Uninterrupted Power Supply not on the ammonia tank delivery system.",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-04-15 00:00:00",
              "TrainingReviewDate": "2004-02-11 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": "Questions and answer session",
              "MaintenanceReviewDate": "2004-04-15 00:00:00",
              "EquipmentInspectionDate": "2004-04-21 00:00:00",
              "EquipmentTested": "4/21/04   Ammonia Tanks and Piping",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 17655,
                  "PreventionProgram2ID": 16919,
                  "ProcessChemicalID": 58148
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 30247,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-04-08 00:00:00",
    "ERTrainingDate": "2004-05-24 00:00:00",
    "CoordinatingAgencyName": "Beloit Fire Department",
    "CoordinatingAgencyPhone": "6083642997",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 30247,
      "SummaryText": "C.  The response plan details the emergency response structure and includes personnel responsibilities and procedures within that structure.  In addition, the plan includes procedures for notification of local agencies in the event of an incident, facility evacuation, and decontamination.  Finally, the facility reviews emergency preparedness and planning, including plans for conducting emergency response team training and drills.\n\nRiverside Energy management is committed to supporting the emergency response (ER) organization and its prescribed functions.  ER team members are drawn from the existing employee pool and the organizational concept fosters pride and emphasizes concerns for safe operation of the Riverside facility.  The well defined ER organization operates in conjunction with the local Fire Department and the Rock County LEPC to alleviate safety concerns about handling aqueous  ammonia.\n\nAuditing Program\nRiverside Energy has developed an auditing program for the Riverside facility's ammonia syste.  This audit program includes elements from the Program 3 requirements and has been established to provide a mechanism for periodic reviews of the various aspects of the RMP including:  \n   - the physical ammonia system;\n   - hazard review;\n   - operation of the system;\n   - maintenance procedures;\n   - training procedures; and \n   - incident investigation procedures.\n\nAlthough not specifically required by the RMP regulations for Program 2 facilities, audits are conducted every three years.  A copy of the auidt form used to conduct the audits is included in this document.\n\nIncident Investigation Program\nRiverside Energy has developed an incident investigation program for the Riverside facility's ammonia system.  This program inludes elements form the Program 3 requirements and has been established to provide a mechanism for determining root causes of accidental relalease of ammonia and preventing such events in the future.  A copy of the form used to conduct inci"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 30247,
      "SummaryText": "dent investigations is included in this document."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 30247,
      "SummaryText": "Introduction\nRiverside Energy Center, LLC  (Riverside Energy), a susidiary of Calpine Corporation,owns the Riverside Energy Center, a combined-cycle electric power generating facility located just north of the city of Beloit, in  Rock County, Wisconsin.  The Riverside facilityincludes two Selective Catalytic Reduction (SCR) systems that use ammonia for reduction of nitrogen oxide (NOx) emissions.  The  ammonia is stored in aqueous form in two 12,000-gallon storage tanks located at the facility.  At full capacity, the tanks can store up to 185,040 pounds of aqueous ammonia.  Since the Riverside facility will be storing more than 20,000 pounds of the aqueous ammonia in a process, it is subject to United States Environmental Protection Agency (USEPA) Risk Management Program (RMP) regulations codified in 40CFR Part 68.\n\nAmmonia is an easily liquefiable colorless gas with a sharp, intensely irritating odor. The aqueous form is a solution of ammonia and water.   It is listed by the USEPA as a regulated toxic substance for release prevention.\n\nRelease Prevention and Emergency Response Policy\nPursuant to the Risk Management Plan (RMP) regulations (40 CFR Part 68)Riverside Energy has developed a comprehensive written program to protect employees and the surrounding community from exposure to  ammonia.\n\nRiverside Energy is committed to the safe operation of the SCR ammonia system at the Riverside facility.  A release prevention program has been developed and implemented by Riverside Energy that is a combination of several programs at the facility.  The release prevention program includes employee education in the hazards of aqueous and anhydrous ammonia and measures that can be used to reduce employee and community exposure to accidental releases of ammonia.  The program includes preventive maintenance programs (mechanical integrity) for the ammonia system that incorporates inspections of the system in accordance with recognized standards of equipment inspection within the am"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 30247,
      "SummaryText": "monia industry, as well as tests of system components in accordance with component manufacturers¿ recommendations.\n\nThe release prevention program includes programs for pre-startup safety reviews and management of changes (MOC) to the ammonia system.  The program also includes specific requirements for safe work practices (such as safe approaches to welding and similar hot work) and safety requirements for contractors who may be hired to work on the systems. \n                                                                     \nSpecial emphasis is placed on handling accidental releases of ammonia and coordination of emergency response with local fire departments and other emergency response organizations in the release prevention program.\n\nAs part of the release prevention program requirements, Riverside Energy undertook a review of the potential offsite consequences of the accidental releases from two 12,000-gallon aqueous ammonia storage tanks.  Although such a release is highly unlikely, the regulation requires this review.\n\nWorst-Case Release Scenario\nAs required by USEPA regulations, the worst-case release scenario was assumed to be the complete loss of contents of both of 12,000-gallon storage tanks containing 185,040 pounds of aqueous ammonia.  This analysis included a common containment dike for both tanks as a passive mitigation measure.  The USEPA guidance for defining a worst-case release scenario for a release of gas is to estimate the release rate over a 10-minute period of the largest quantity resulting from a pipe or vessel failure.  Thus, the ammonia emission rate from the worst-case release scenario used was the loss of 185,040 pounds of aqueous ammonia averaged over a 10-minute period (i.e., approximately 56.1 lbs./min. of ammonia released to the air).\n\nUSEPA¿s public-domain RMP*Comp model was used to determine the distance to the toxic endpoint of 0.14 mg/lit (or 200 ppm).  The model predicted a downwind distance of 0.4 miles as the distance to th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 30247,
      "SummaryText": "e toxic endpoint due to the specified worst-case release.  Based on LandView 6 output, the total population within the potential exposure area is 45 with the following public receptors being potentially impacted ¿residences and industrial areas.\n\nRiverside Energy employees thoroughly inspect the ammonia system per the recommendations of the release prevention program.  This greatly minimizes the chance that the tank will fully discharge their contents in a release and minimizes the potential for an offsite impact.\n\nAlternative Release Scenario\nFor the Riverside facility, the alternative release scenario was assumed to be the structural failure of a 2-inch pipe filled with aqueous ammonia under pressure at 56 psig pressure beyond the confines of the concrete dike.  Assumed active mitigation (e.g., use of emergency shutdown systems etc.) starts within a reasonable time after the accidental release begins.  For this analysis, the total release duration is assumed to be the time period from the beginning of the release event until the release is totally contained.  The total release duration was assumed to be 10 minutes.  In this analysis, no passive mitigation measures were assumed.  Thus, the ammonia emission rate from the alternative release scenario is given as the loss of 61,800 pounds of aqueous ammonia averaged over a 10-minute period (i.e., 1,550 lbs./min release rate of ammonia to the outside air).\n\nUSEPA¿s public-domain RMP*Comp model was used to determine the distance to the toxic endpoint of 0.14 mg/lit (or 200 ppm).  The model predicted a downwind distance of 1.0 miles as the distance to the toxic endpoint due to the specified alternative release.  Based on LandView 6 output, the total population within the potential exposure area is 264 with the following public receptors being potentially impacted ¿ residences and industrial areas.  It should be noted that the potential offsite impact due to a release is greatly minimized by the rural location of the faci"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 30247,
      "SummaryText": "lity.\n\nRiverside Energy employees thoroughly inspect the ammonia system per the recommendations of the release prevention program.  This greatly minimizes the chance that there will be any discharge of tank contents in a release and minimizes the potential for an offsite impact.\n\nRelease Prevention Program\nAs indicated earlier, Riverside Energy has proactively implemented a release prevention program for the SCR ammonia process.  The scope of the release prevention program encompasses various facets of release prevention; e.g., it engenders employee participation, increases employee awareness about the hazards of handling  ammonia, establishes safe standard operating procedures and enhances access to process safety information.  Riverside Energy  performed a process hazard analysis on the SCR ammonia system during the design process.  In addion, reviews of the  operating procedures, equipment maintenance schedules, and operational safeguards have been performed to identify action items to render the process safer.  Riverside Energy has developed a written release prevention program for the Riverside facility.  The release prevention program provides the procedural backbone for safe operability functions (i.e., continual review of safe operating procedures, review of mechanical integrity of equipment, improved maintenance schedules, increased training, better access to process safety information and hazard awareness for both employees and onsite contractors, and effective emergency response planning), and allows Riverside Energy to maintain, review and evaluate the program on a periodic basis.\n\nEmergency Response Program\nThe release prevention program incorporates the Riverside facility¿s comprehensive emergency response plan.  The emergency response program places special emphasis on handling accidental releases of aqueous ammonia and coordination of emergency response with local fire departments and other emergency response organizations such as the Rock County LEP"
    }
  ]
}