{
  "FacilityID": 30384,
  "FacilityName": "The Dow Chemical Company",
  "FacilityStr1": "1468 Prosser Drive, SE",
  "FacilityStr2": null,
  "FacilityCity": "Dalton",
  "FacilityState": "GA",
  "FacilityZipCode": "30721",
  "Facility4DigitZipExt": "5466",
  "FacilityCountyFIPS": "13313",
  "LEPC": "Whitfield County LEPC",
  "FacilityLatDecDegs": "34.633056",
  "FacilityLongDecDegs": "-084.929167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.dow.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 45929643,
  "ParentCompanyName": "The Dow Chemical Company",
  "Company2Name": null,
  "CompanyDUNS": 1381581,
  "Company2DUNS": null,
  "OperatorName": "Jose Prieto",
  "OperatorStr1": "1468 Prosser Drive, SE",
  "OperatorStr2": null,
  "OperatorCity": "Dalton",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30721",
  "OperatorZipCodeExt": null,
  "FTE": 65,
  "OtherEPAFacilityID": "30720dwchm1468p",
  "EPAFacilityID": "100000037346",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "28223130054V02",
  "SafetyInspectionDate": "2007-05-03 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-05-13 13:10:11",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-05-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-05-24 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-05-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.0",
  "FRS_Lat": 34.632592,
  "FRS_Long": -84.927668,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 44161,
      "AltID": "Latex Mfg Facility",
      "FacilityID": 30384,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 58317,
          "ProcessID": 44161,
          "ChemicalID": 110,
          "Quantity": 600000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 58318,
          "ProcessID": 44161,
          "ChemicalID": 120,
          "Quantity": 832500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 45137,
          "ProcessID": 44161,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 25396,
              "Process_NAICS_ID": 45137,
              "SafetyReviewDate": "2002-04-18 00:00:00",
              "PHA_Date": "2002-04-18 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Walk Through",
              "PHACompletionDate": "2002-12-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-03-11 00:00:00",
              "TrainingReviewDate": "2004-01-07 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer-based learning",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-06-24 00:00:00",
              "EquipmentInspectionDate": "2004-03-11 00:00:00",
              "EquipmentTested": "Reactor butadiene meters",
              "ChangeMgmtDate": "2004-06-24 00:00:00",
              "ChangeMgmtReviewDate": "2004-01-15 00:00:00",
              "PreStartupReviewDate": "2002-01-14 00:00:00",
              "ComplianceAuditDate": "2002-03-21 00:00:00",
              "AuditCompletionDate": "2002-03-21 00:00:00",
              "IncidentInvestigationDate": "2004-01-30 00:00:00",
              "InvestigationChangeDate": "2004-01-30 00:00:00",
              "ParticipationPlansReviewDate": "2001-04-12 00:00:00",
              "HotWorkPermitReviewDate": "2002-04-02 00:00:00",
              "ContractorSafetyReviewDate": "2003-05-22 00:00:00",
              "ContractorSafetyEvalDate": "2002-01-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 37111,
                  "PreventionProgram3ID": 25396,
                  "ProcessChemicalID": 58317
                },
                {
                  "PrimaryKey": 37112,
                  "PreventionProgram3ID": 25396,
                  "ProcessChemicalID": 58318
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 30384,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-03-10 00:00:00",
    "ERTrainingDate": "2004-04-30 00:00:00",
    "CoordinatingAgencyName": "Whitfield County Fire Department",
    "CoordinatingAgencyPhone": "7062597433",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "OSHA PSM",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 30384,
      "SummaryText": "General Executive Summary\nfor\nThe Dow Chemical Company\nDalton, Georgia Site\n\nThis plan is being updated for the following reasons:  \n\na)  In accordance with the April 9, 2004 Rule Change:  updated emergency contact information, updated the five year accident history, added the email address of the RMP contact, and included in this summary the reasons for the RMP Plan update.  \n\nUnder the rule changes effective April 9, 2004, we are required to list the name of a contractor that helped prepare the report.  This section does not apply to this site, as no contractor was used to prepare this report.  \n\nThe revisions to the RMP rule of April 9, 2004 removed the requirement for facilities to include in the executive summaries a brief description of the off-site consequence analysis for their facilities.  This informaiton has been removed.\n\nb)  Updated to the newest version of RMP submit 2004\n\nc)  Removed the Styrofoam Facility , Facility ID #2, which is no longer subject to RMP.\n\n1.\tAccidental Release Prevention and Emergency Response Policies\nWe at The Dow Chemical Company; Dalton Georgia Site are strongly committed to employee, public and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, our well-trained personnel are at hand to control and mitigate the effects of the release. We are also completely coordinated with The Whitfield County Fire and Sheriff Departments, both of whom we would rely upon for additional emergency response expertise.\n\n2.\tThe Stationary Source and the Regulated Substances Handled\nThe Dow Dalton facility manufactures latex, polyurethane dispersion (latex),  and Styrofoam* extruded po"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 30384,
      "SummaryText": "lystyrene board.  This facility is located at 1468 Prosser Drive, S.E., approximately 10 miles south of the town of Dalton, Georgia. The facility has three manufacturing plants on site, one for the production of latex which is shipped off-site for use in the paper and carpet industries, one for the production of a polyurethene dispersion latex which is shipped off-site for use in the carpet industry, and one for Styrofoam* board which is used predominantly in the construction industry as and insulating material. We have 2 regulated substances present at our facility.  These substances include 1,3-Butadiene and Vinylidene chloride  [Ethene, 1,1-dichloro-].  The regulated substances at our facility :  1,3-Butadiene and   Vinylidene chloride  [Ethene, 1,1-dichloro-] are used as raw materials for latex production.  \n\n\n\n3. The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures \nTo evaluate the worst case and alternative scenarios, we have used RMP COMP version 1.07. \n\n\n4.\tThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps \nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119.  Our facility is also subject to EPCRA Section 302 notification requirements.  We also have an air operating permit ID under Title V of the Clean Air Act.  Our facility has received a Star/Merit Ranking under OSHA's Voluntary Protection Program.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nThe Dow Chemical Company; Dalton Georgia Site maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 30384,
      "SummaryText": "all processes. \n\nProcess Hazard Analysis\n\nThe Dalton facility has an active Process Hazard Analysis program to identify, evaluate, and control the hazards of the processes.  Plant management is also responsible for the documentation and follow-up of action items from these reviews.  The Dow Environmental, Health and Safety (EH&S) Requirements specify that risk assessment or analysis be used to evaluate hazard potentials of all installations.  Dow Hazard Analysis programs were instituted and operational many years prior to the issue of RMP. In particular, the programs listed below constitute the Dow interpretation of a Process Hazard Analysis:\n\n* Reactive Chemical Review\n* Fire & Explosion Index (F&EI)\n* Chemical Exposure Index (CEI)\n* Process Hazard Analysis Checklist  \n\nThese studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval.  Any findings are addressed in a timely manner.  \n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, The Dow Chemical Company; Dalton Georgia Site maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nThe Dow Chemical Company; Dalton Georgia Site has a comprehensive training program in place to ensure that employees who are operating processes or newly assigned to the process are competent in the operating procedures associated with these processes.  Refresher training is provided every three years and more frequently as needed.\n\nMechanical Integrity\nThe Dow Chemical Company; Dalton Georgia Site carries out a highly documented Planned Preventative Maintenance Program  (PPM) which provides c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 30384,
      "SummaryText": "hecks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls,  and pumps and compressors.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nThe Dow Chemical Dalton facilities require management of all modifications to process equipment, procedures, raw materials and processing conditions other than \"like for like\", by identifying and reviewing them prior to implementation of changes.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and are trained to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at The Dow Chemical Company;  Dalton Georgia Site.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nThe Dow Chemical Company;  Dalton Georgia Site conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nThe Dow Chemical Company; Dalton Georgia Site promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are un"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 30384,
      "SummaryText": "dertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nThe Dow Chemical Company; Dalton Georgia Site truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  Behavior-based safety training is one of the major steps we've implemented to improve safety at our facility.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  The Dow Chemical Company;  Dalton Georgia Site has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n5.\tFive-year Accident History\nThe Dow Chemical Company; Dalton Georgia Site has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there have been no accidental releases as defined by the RMP rule of regulated substances, during this period.\n\n6.\tEmergency Response Plan\nThe Dow Chemical Company; Dalton Georgia Site carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies an"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 30384,
      "SummaryText": "d the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n7.\tPlanned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Safety and Enivronmental initiatives implemented since our last RMP submittal include: Loss of Primary Containment (LOPC) Top Ten Incident Identification; and Picture the Hazard, which provides a pictoral presentation of real or potential safety issues in the facility.  These initiatives will be on-going activities.  Another current initiative is the Layer of Protection Audit (LOPA) in the latex manufacturing facility. This audit has identified and prioritized areas for process safety improvement within our plant, and will generate appropriate corrective actions with prioritized, planned, completion timelines.\n\n8. Certification Statement\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\nName:\nJose Prieto\nSignature:\n\nTitle:\nResponsible Care Leader\nDate Signed:\n\n\nTDCC\tPage 6\t May 2004"
    }
  ]
}