{
  "FacilityID": 3041,
  "FacilityName": "Pleasant Prairie Distribution Center",
  "FacilityStr1": "7400 95th Street",
  "FacilityStr2": null,
  "FacilityCity": "Pleasant Prairie",
  "FacilityState": "WI",
  "FacilityZipCode": "53158",
  "Facility4DigitZipExt": "0908",
  "FacilityCountyFIPS": "55059",
  "LEPC": "Kenosha LEPC",
  "FacilityLatDecDegs": "42.535",
  "FacilityLongDecDegs": "-87.894444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "SuperValu, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6961411,
  "Company2DUNS": 0,
  "OperatorName": "Supervalu, Inc.",
  "OperatorStr1": "P. O. Box 990",
  "OperatorStr2": null,
  "OperatorCity": "Minneapolis",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55440",
  "OperatorZipCodeExt": null,
  "RMPContact": "Sherri Harmon",
  "RMPTitle": "Risk Control Manager",
  "FTE": 885,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000037211",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-26 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-05-07 00:00:00",
  "DeRegistrationEffectiveDate": "2013-04-26 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 42.53385,
  "FRS_Long": -87.86031,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3401,
      "AltID": "Refrigeration",
      "FacilityID": 3041,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3469,
          "ProcessID": 3401,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3634,
          "ProcessID": 3401,
          "ChemicalID": 56,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503634,
          "ProcessID": 3401,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3041,
      "SummaryText": "The Pleasant Prairie Distribution Center, a Division of SuperValu, Inc., located at 7400 95th Street, Pleasant Prairie, WI, is a food distribution center supplying perishable and dry good items to retail grocery stores throughout the midwest.\n\nAt our facility, anhydrous ammonia (cas #7664-41-7) is used as a refrigerant to cool our perishable product rooms and freezers. Designed as a closed loop system, ammonia is circulated to each of the room cooling units and returns to the accumulators, located in the Energy Center. Heat laden ammonia vapor is pulled from the accumulators, compressed, and sent to rooftop condensers where it is cooled and liquified and re-circulated to the room cooling units. The maximum system working pressure is 175 psig. Maximum quantity of ammonia on-site is 30,000 lbs.\n\nWorst-case Scenario for a toxic substance:\n\nThe worst-case release toxic endpoint was determined using EPA's \"RMP Guidance for Ammonia Refrigeration' reference tables and equations. This scenario was based on the following criteria:\n\nVessel:                         High Pressure Receiver (HPR) \nVessel Size:                 60\" x 20' 0\"\nAmount Released:        15,000 lbs.\nDuration of Release:     10 minutes\nRelease Rate:               1,500 lbs/min\nWind Speed:                 1.5 meter/sec\nAtmospheric Stability:   F\nTopography:                 Rural\nPassive mitigation:        Building Enclosure\n\nSince the HPR is housed inside the \"Energy Center\", the toxic endpoint was calculated using this enclosure as passive mitigation. The enclosure has two different ceiling heights, one section measures 40' x 40' x 18' and the other 40' x 28' x 32' for a total of 64, 640 cubic feet. There are four(4) exhausts fans rated at 4,000 cfm each providing 6 air exchanges per hour. Using the formulas provided in Chapter Four of the \"RMP Guidance for Ammonia Refrigeration\" the release rate, from the building, was calculated at 300 lbs/min. with a distance to the Toxic Enpoint of 1.0 miles.\n\nUsing La"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3041,
      "SummaryText": "ndview 3 census data, an ammoia release of this size, would affect a population of 620, one school, residential and industrial areas and small retail businesses. \n\nAlternative release scenario for a toxic substance:\n\nThe alternative release toxic endpoint was also determined using EPA's \"RMP Guidance for Ammonia Refrigeration\" reference tables and equations. The scenario was based on the following criteria:\n\nScenario:                          Vessel leak\nOrifice Size:                      1/2\"\nDuration of Release:         10 min\nAmount Released:            5,400 lbs\nRelease Rate:                   540 lbs/min\nWind Speed:                     3 meter/sec\nAtmospheric Stability:       D\nTopgraphy:                       Rural\n\nUsing the same passive mitigation formulas as for the worst-case scenario, the release rate, from the building, was calculated at 100 lbs/min. with a toxic endpoint of 0.20 miles. An ammonia release under these conditions, will affect 11 people, residential and retail structures. \n \nAccidental Release and Emergency Response Policies:\n\nThe Pleasant prairie Distribution Center has established an in-house emergency response team to quickly respond to and handle releases of Anhydrous Ammonia. The established steps include initial training under the OSHA regulation 29 CFR 1910.120 'HAZWOPER'. The facility has also established annual retraining for all personnel that are on the HAZMAT team as well as periodic spill drills and plant wide evacuation drills to assure all employees are prepared in the event of an emergency. This facility has also established training with the Fire Department personnel and community Local Emergency Planning Committee. These established plans and procedures shall be periodically reviewed to assure that they are current and up to date.\n\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps:\n\nThe Pleasant Prairie Distribution Center has not only complied with the EPA Risk Management Program but als"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3041,
      "SummaryText": "o the OSHA Process Safety Management regulation to assure that the Ammonia Refrigeration System is well maintained and employees are properly trained and periodically retrained to assure they are kept up to date on any changes and new operations that may effect them. In addition, to maintain the mechanical integrity and safety of this process, this facility practices the following industry codes and standards:\n \nASME Boiler & Pressure Valve Codes\nANSI B31.3 Piping Code\nIIAR industry guideline for safety and good engineering practices\nNFPA guidelines for fire protection equipment\n  \nThrough regular audits, training, maintenance, testing and inspection programs the Pleasant Prairie Distribution Center has established a history of safe operation, community emergency action plans are current, and training with community services is done for a safe response in the event of an accidental release.\n\nFive Year Accident History:\nNone to report. \n\nEmergency Response Program:\n\nPrimary Public Emergency Responders:\nLocal Fire Department:  Pleasant Prairie Fire Department\nLocal Hazardous Material Response Team:  Racine Fire Department HAZMAT Team\nLocal Law Enforcement:  Pleasant Prairie Police Department\nCounty Sheriffs Department:  Kenosha County Sheriffs Department\nAmbulance Service:  Pleasant Prairie Fire & Rescue, City of Kenosha Fire & Rescue\n\nSpecial Resources Available From Facility:\n\nThe Pleasant Prairie Distribution Center has trained the refrigeration operators and selected production and office personnel in Hazardous Waste Operation and Emergency Response '29 CFR 1910.120. The trained personnel will assess each release situation and determine the appropriate emergency response to initiate. This could be by simply tightening a packing nut or flange bolt or initiating a system shut down. This facility has also established written operating procedures for the ammonia refrigeration system and have included in those procedures the Emergency Shutdown and isolation in the even"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3041,
      "SummaryText": "t of a release. The facility has purchased Level A Chemical Suits, Self Contained Breathing Apparatus and other appropriate equipment to support the in-house HAZMAT team. This team will coordinate their efforts with the outside emergency services to assure the safety of all."
    }
  ]
}