{
  "FacilityID": 30476,
  "FacilityName": "Roundup Natural Gas Liquids Extraction Facility",
  "FacilityStr1": "3064 Road I",
  "FacilityStr2": null,
  "FacilityCity": "Wiggins",
  "FacilityState": "CO",
  "FacilityZipCode": "80654",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08087",
  "LEPC": "Morgan County LEPC",
  "FacilityLatDecDegs": "40.114722",
  "FacilityLongDecDegs": "-104.091944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": "www.xcelenergy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Xcel Energy",
  "Company2Name": null,
  "CompanyDUNS": 186614616,
  "Company2DUNS": 0,
  "OperatorName": "Public Service Company of Colorado",
  "OperatorStr1": "4653 Table Mountain Drive",
  "OperatorStr2": null,
  "OperatorCity": "Golden",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80403",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": "COD981544430",
  "EPAFacilityID": "100000019749",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "950PMR081",
  "SafetyInspectionDate": "2003-08-11 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Roundup RMP Plan Resubmission June 2004",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-05-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-05-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-05-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.0",
  "FRS_Lat": 40.11472,
  "FRS_Long": -104.09139,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 44314,
      "AltID": "Nat Gas Liq. Extraction",
      "FacilityID": 30476,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 58581,
          "ProcessID": 44314,
          "ChemicalID": 98,
          "Quantity": 6572.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 58582,
          "ProcessID": 44314,
          "ChemicalID": 155,
          "Quantity": 115115.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 42740,
              "ProcessChemicalID": 58582,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 42741,
              "ProcessChemicalID": 58582,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 42742,
              "ProcessChemicalID": 58582,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 42743,
              "ProcessChemicalID": 58582,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 45292,
          "ProcessID": 44314,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 25484,
              "Process_NAICS_ID": 45292,
              "SafetyReviewDate": "2003-10-13 00:00:00",
              "PHA_Date": "2003-12-09 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-04-13 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Evaluation of closed looping vent; liquids sample analyses",
              "OpProceduresReviewDate": "2003-12-23 00:00:00",
              "TrainingReviewDate": "2001-10-26 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-12-19 00:00:00",
              "EquipmentInspectionDate": "2004-01-13 00:00:00",
              "EquipmentTested": "NGL safeties",
              "ChangeMgmtDate": "2003-12-12 00:00:00",
              "ChangeMgmtReviewDate": "2001-12-13 00:00:00",
              "PreStartupReviewDate": "2004-01-02 00:00:00",
              "ComplianceAuditDate": "2002-07-24 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "2001-04-01 00:00:00",
              "InvestigationChangeDate": "2001-04-30 00:00:00",
              "ParticipationPlansReviewDate": "2001-10-29 00:00:00",
              "HotWorkPermitReviewDate": "2001-10-29 00:00:00",
              "ContractorSafetyReviewDate": "2001-10-29 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Natural Gas Liquids Extraction",
              "_chemicals": [
                {
                  "PrimaryKey": 37289,
                  "PreventionProgram3ID": 25484,
                  "ProcessChemicalID": 58582
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 30476,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2001-10-16 00:00:00",
    "ERTrainingDate": "2004-03-03 00:00:00",
    "CoordinatingAgencyName": "Morgan County Emergency Response",
    "CoordinatingAgencyPhone": "9708672461",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 30476,
      "SummaryText": "This executive summary is a brief overview of the Risk Management Program and the associated policies at the Public Service Company of Colorado (PSC) Roundup Natural Gas Liquids (NGL) Extraction Facility.\n\nPrevention and Response Policies\nThe accidental release prevention and emergency response policies are represented in the Emergency Planning and Response Sections of the Roundup PSM/RMP manual for the LPG, drip gas, and propane system. PSC takes an active role in preventing accidental releases at all of its facilities by ensuring that its employees are properly trained in the safe operation of covered processes and the safe handling of regulated chemicals.  As for emergency response, PSC has established and maintained procedures for emergency notification and response.  These are reviewed with employees on a periodic basis and revised to accommodate changes in staffing when they occur.\n\nPSC management understands its duty to provide a safe working environment and to take measures to prevent accidents that may have an effect on the surrounding community.  This understanding is reflected in procedures described and referenced in the PSM/RMP manual.  \n\nStationary Source and Regulated Substances\nRoundup is a natural gas liquids extraction facility designed to process 40 mmscfd of natural gas.  The purpose of the Roundup NGL Extraction Facility is to reduce the dew point of the gas to a level that is acceptable for pipeline transmission.  Control of the dew point is critical since the incoming gas is water-saturated in many cases.  The dew point increases as the concentration of moisture (water and heavy hydrocarbons) in the inlet gas increases.  As gas flows through the pipeline, its temperature will decrease to about the same temperature as the surrounding ground.  If this temperature is below the dew point of the gas, the water and heavy hydrocarbons will tend to condense.  The resulting buildup of hydrates can begin to restrict process flow, particularly at orifice"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 30476,
      "SummaryText": "s and bends in the pipe.  In extreme cold, the hydrates may even form a potentially dangerous ice plug.\n\nIn order to reduce the dew point of the gas (and accordingly, minimize the formation of hydrates), the inlet gas is chilled using a propane refrigeration system.  This process allows the heavy hydrocarbons and water to condense out of the process flow.  Ethylene glycol is spray-injected into the inlet gas at each heat exchanger to absorb the condensed water.  Ethylene glycol, condensed liquid hydrocarbons, and residue gas are then separated in a cold separator.  The lower the temperature in the separator, the greater the volume of liquid extracted, which also lowers the dew point of the residue gas.  The ethylene glycol is circulated through a reboiler to drive off condensate, and then it is circulated to the separator.  Condensed hydrocarbons are then stored.  The residual gas is at its dew point when it leaves the cold separator and is then delivered to the transmission pipeline.\n\nThe PSM/RMP-regulated substances handled at this facility are LPG, drip gas, and propane.  Following is a breakdown of the locations of these materials at Roundup:\n\nNGL Plant Propane System:  Maximum Volume = 500 gallons       Maximum Weight = 2530 lbs.\nPropane Makeup Tank:          Maximum Volume = 1200 gallons     Maximum Weight =6072 lbs.\nLPG Product System:            Maximum Volume = 150 gallons       Maximum Weight = 759 lbs.\nLPG Product Storage:           Maximum Volume = 9600 gallons     Maximum Weight = 48,576 lbs.\nDrip Gas:                               Maximum Volume = 5000 gallons     Maximum Weight = 25,300 lbs.\n                                              \nThe propane and liquid hydrocarbon system is the only covered process at this time at the Roundup Gas Storage Facility.  The balance of the plant is regulated under DOT Pipeline Safety regulations Parts 190-199.\n\nFilling of the tanks is administratively limited to 80% of the tank capacity by NFPA 58 requirements, as c"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 30476,
      "SummaryText": "orrected for facility elevation.\n\nPrevention Steps for LPG, Drip Gas, and Propane\nThe prevention program and chemical-specific prevention steps are described in detail in the Roundup PSM/RMP manual.  The prevention program includes the Program 3 elements:\n? Employee participation, which includes provisions for active participation by plant employees in the development and implementation of the facility PSM/RMP program, as well as ready access to program information\n? Process safety information, which has been collected in the facility office and is summarized in the PSM/RMP manual\n? Process hazard analyses (PHAs) - The initial PHA for the LPG, drip gas, and propane system was conducted in May 1994;  the PHA was updated in June 1995. Several subsequent PHAs have been conducted as well as revalidations every five years. The last PHA revalidation was performed in December 2003.  All recommendations from the PHAs have been addressed.\n? Operating procedures for the facility operations, which are included in the Job Books located at Roundup\n? Training for all plant personnel involved in the operation and maintenance of the plant operations\n? Contractor management policy, which is to not allow contractors to operate or maintain the RMP-regulated processes\n? Pre-startup safety review procedure for implementation for significant system changes to ensure that the construction and equipment installation is according to design specifications, appropriate procedures are in place and accurate, a PHA has been done and the recommendations resolved, and employees are trained prior to startup of the modified system\n? Mechanical integrity program through the operator computer system to ensure that the system equipment is maintained in good and safe working condition.  Facility personnel conduct daily visual inspections of the system.  The date and equipment included in 7.7 b and c address the last major PM activity.\n? Hot work procedures to require controls as specified in the Gas Sta"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 30476,
      "SummaryText": "ndards Manual before hot work is performed on the LPG, drip gas, and propane system\n? Management of change program to ensure that proposed system changes are comprehensively evaluated before implementing the change\n? Incident investigation procedures for the investigation of any catastrophic (or potentially catastrophic) incident associated with the LPG, drip gas, and propane system\n? Compliance audits to be conducted at least once every three years to ensure the continued compliance of the Roundup PSM/RMP program.  PSM/RMP audits were conducted in February 1999 and July 2002.  There were no regulatory findings at the 2002 audit.\n\nAccident History\nWithin the five-year period prior to the submittal of this RMP, there were no accidental releases of regulated flammable materials meeting the requirements of 40 CFR 68.42.\n\nEmergency Response Program\nThis facility has established and maintains an emergency response program that is coordinated with local response agencies.  The program is described in detail in the Emergency Planning and Response section of the PSM/RMP compliance manual and meets the requirement of 40 CFR 68.95.  The goals of the program are to protect onsite employees from the hazardous effects of chemical releases and to minimize the effects of releases on the general public.  The program is routinely reviewed and updated to reflect personnel and regulatory changes.\n\nPlanned Changes for Improved Safety\nIdeas for changes to improve safety are actively sought from employees.  Employee safety meetings that focus on chemical safety issues are held regularly at this facility.  Employees are encouraged and trained to recognize hazards and present ideas to eliminate them or to minimize the potential consequences of those hazards.\n\nDuring the development of the Roundup PSM/RMP program, process hazard analyses were conducted with key employees to meet the prevention program requirements.  During these sessions, recommendations were made for the purpose of improvi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 30476,
      "SummaryText": "ng safety and preventing accidental chemical releases.  Each recommendation has been or will be considered for implementation.  Though not all recommendations may be implemented, all will be considered.  The exercise has provided all affected employees with a heightened awareness of safety issues related to the covered processes."
    }
  ]
}