{
  "FacilityID": 3054,
  "FacilityName": "National Forge Company",
  "FacilityStr1": "One Front Street",
  "FacilityStr2": null,
  "FacilityCity": "Irvine",
  "FacilityState": "PA",
  "FacilityZipCode": "16329",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42123",
  "LEPC": "Warren County LEPC",
  "FacilityLatDecDegs": "41.840556",
  "FacilityLongDecDegs": "-79.270833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 926456229,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "National Forge Company",
  "OperatorStr1": "One Front Street",
  "OperatorStr2": null,
  "OperatorCity": "Irvine",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "16329",
  "OperatorZipCodeExt": null,
  "FTE": 425,
  "OtherEPAFacilityID": "534083685003",
  "EPAFacilityID": "100000037435",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-18 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-15 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 41.841555,
  "FRS_Long": -79.27005,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3417,
      "AltID": "Nitriding Furnaces",
      "FacilityID": 3054,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 3651,
          "ProcessID": 3417,
          "ChemicalID": 56,
          "Quantity": 70000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 3485,
          "ProcessID": 3417,
          "NAICSCode": "332111",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1128,
              "Process_NAICS_ID": 3485,
              "SafetyReviewDate": "1997-01-01 00:00:00",
              "PHA_Date": "2000-01-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Operating/Maintenance Experience",
              "PHACompletionDate": "1999-06-08 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Alarms and operator attention",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1997-01-01 00:00:00",
              "TrainingReviewDate": "1999-04-20 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "No",
              "TR_OtherType": "Drills",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1997-01-01 00:00:00",
              "EquipmentInspectionDate": "1999-04-20 00:00:00",
              "EquipmentTested": "Piping",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-09-30 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1998-08-17 00:00:00",
              "AuditCompletionDate": "2000-01-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-30 00:00:00",
              "HotWorkPermitReviewDate": "1999-09-30 00:00:00",
              "ContractorSafetyReviewDate": "1998-07-31 00:00:00",
              "ContractorSafetyEvalDate": "1999-07-31 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1267,
                  "PreventionProgram3ID": 1128,
                  "ProcessChemicalID": 3651
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 3054,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-04-16 00:00:00",
    "ERTrainingDate": "1999-02-26 00:00:00",
    "CoordinatingAgencyName": "Warren County Emergency Management",
    "CoordinatingAgencyPhone": "8147238478",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 3054,
      "SummaryText": "of the continuous plant safety awareness and improvement program. NFC also has plans to revise the nitriding process/operation materials, procedures, and equipment. Currently, the project is scheduled for completion in January 2000. Details of the complete plan are not final but at a minimum, either two smaller ammonia tanks and related appurtenances/ accessories will replace the current single ammonia tank or the maximum ammonia inventory will be reduced. Based on projected nitriding cycle process changes that have been full scale tested at NFC, the total nitrogen/ammonia requirements will be decreased significantly and allow less ammonia storage. Consequently, NFC is pursuing use of two smaller ammonia storage tanks or less of an ammonia inventory to decrease the impact of any release and RMP consequence."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3054,
      "SummaryText": "management) have been established to minimize potential for an accidental or catestrophic ammonia release. Specifically, the most significant system physical improvement was the installation of a high pressure, magnetically coupled sight gage that allows accurate tank contents volume measurement/management. Ammonia ordering/delivery policy and unloading management by two plumbers (required) minimizes overfill potential and a delivery release respectively - the most likely release incidents.\n\nBased on NFC operating policy and procedures, no release accidents related to ammonia storage have occurred within the past five years. No personnel lost time incidents, injuries, physical plant damage or releases affecting the plant or off site have occurred. NFC has prepared and implemented a written Safety Procedure (plant document SA-004) entitled, Nitride Department Anhydrous Ammonia Emergency Procedure, effective dated January 1, 1997 and a written Off Site Response Plan (last update April 16, 1998) to deal with ammonia releases. NFC operations also require compliance and plans associated with OSHA, Spill Control (SPCC), Preparedness, Prevention (PPC), Clean Water Act (CWA),  Emergency Planning and Community Right to Know (EPCRA), etc. Currently, NFC is up to date with all related plans and implementation. The site response plan is registered with the Warren County LEPC and is periodically implemented as a full scale onsite drill. The last county wide ammonia disaster drill, including LEPC, local fire departments, EMS, etc., was conducted at NFC on October 3, 1998. NFC has multiple designated and trained emergency response personnel as part of their work force. Most recently (February 26, 1999), the emergency response team was updated/recertified by independent outside auditors as part of the NFC annual program.\n\n\n\n\nNFC currently has plans to prepare and implement additional plant-wide policies/plans, i.e., hot work permit program, contractor safety program, etc. as part"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 3054,
      "SummaryText": "National Forge Company (NFC), located in Irvine PA, is an employee owned, fully integrated manufacturer of specialty forged steel products. Currently, the plant core products are crankshafts used in larger diesel engines and pipe molds used as expendable tooling in the production of iron pipe for water transmission. The balance of production consists of other heavy industrial products that involve precision machining or proprietary boring/coring techniques. The plant site encompasses 323 acres with 46 acres of developed property and 578,000 square feet under roof. The plant employs approximately 600 total personnel in manufacturing and administrative positions. The plant operates three shifts throughout the work week and conducts a one to two week plant maintenance shutdown annually in July. The maximum number of employees at the site is approximately 425 during the first, or daylight, shift.\n\nEmployee and community health and safety protection is a major policy of NFC and its management, as is environmental protection. NFC employs at least two full time professionals in health and safety and retains other consultants and professionals appropriate to provide supplemental services, training, certifications, etc. Multiple other staff are also involved in health and safety affairs on a variable part time basis. The employee owners and management of NFC prides itself on being ISO 9002 certified and the recipient of multiple recent safety and environmental awards.\n\nA portion of the manufacturing operation at NFC includes the nitriding or surface hardening department that is the location of the RMP regulated substance storage - anhydrous ammonia - a toxic and buoyant gas - threshold quantity 10,000 pounds. In the nitriding department, crankshaft wear surfaces (bearing/throws) are heated in a nitrogen environment and nitrogen is absorbed in unmasked steel surfaces causing a case hardening to a prescribed depth based on temperature and exposure duration. The ammonia is stor"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3054,
      "SummaryText": "ed in a single 18,500 gallon horizontal, welded, steel, ASME certified, pressure tank. Based on administrative controls/operating procedure, the maximum volume stored on site at any time is 13,800 gallons (70,000 lbs). For the nitriding cycle, ammonia is withdrawn from the tank, used to purge air from the furnace environment, thermally separated into elemental nitrogen/hydrogen, and fed to the furnace to establish the nitrogen environment. Periodically, hydrogen and some nitrogen is vented to the atmosphere during the nitriding cycle and replaced. At the conclusion of the cycle, ammonia is used to purge residual hydrogen and nitrogen from the furnace.\n\nAmmonia release scenarios considered in the NFC RMP were consistent with the USEPA Offsite Consequence Analysis (OCA) guidance. For both worst case and alternative release scenarios, RMP*COMP was used to calculate the distances to the toxic endpoint (0.14 mg/l or 200 ppm). Both model scenarios were considered as releases in rural areas, utilized the default atmospheric stability factors/wind speeds, and resulted in offsite impacts. Passive mitigation-release in an enclosure/building is applicable in either scenario but was not used in the alternative release case. Active mitigation available at the site includes water sprinklers to absorb released ammonia and detectors/alarms/operator attention to contain/control a release. However, no active mitigation was utilized in either scenario. The worst case and alternative release rates used in the RMP analyses were 7000 lb/min (3850 lb/min-mitigated) and 7570 lb/min (exceeds max storage capacity), respectively. The RMP*COMP calculated distance to the toxic endpoints for the worst and alternative release scenarios utilizing the noted inputs are 3.6 and 1.6 miles, respectively. The affected populations are estimated to be 5100 and 2300 for the worst case and alternative scenarios.\n\nNFC operation and safety plans, policies, and procedures as well as planned maintenace (overall"
    }
  ]
}