{
  "FacilityID": 30683,
  "FacilityName": "ABITEC Corporation",
  "FacilityStr1": "1530 S. Jackson Street",
  "FacilityStr2": null,
  "FacilityCity": "Janesville",
  "FacilityState": "WI",
  "FacilityZipCode": "53547",
  "Facility4DigitZipExt": "1759",
  "FacilityCountyFIPS": "55105",
  "LEPC": "Rock County LEPC",
  "FacilityLatDecDegs": "42.657222",
  "FacilityLongDecDegs": "-089.021944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 873174361,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Jeff Walton",
  "OperatorStr1": "1530 S. Jackson Street",
  "OperatorStr2": null,
  "OperatorCity": "Janesville",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53547",
  "OperatorZipCodeExt": "1759",
  "RMPContact": "Jeff Walton",
  "RMPTitle": "CEO",
  "FTE": 34,
  "OtherEPAFacilityID": "WID006075824",
  "EPAFacilityID": "100000029382",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-06-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.0",
  "FRS_Lat": 42.65745,
  "FRS_Long": -89.01815,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 44633,
      "AltID": "Chemical Manufacturing",
      "FacilityID": 30683,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 45616,
          "ProcessID": 44633,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 58958,
          "ProcessID": 44633,
          "ChemicalID": 9,
          "Quantity": 270000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 9,
            "ChemicalName": "Ethylene oxide  [Oxirane]",
            "CASNumber": "75-21-8",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 58959,
          "ProcessID": 44633,
          "ChemicalID": 12,
          "Quantity": 83000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 12,
            "ChemicalName": "Propylene oxide  [Oxirane, methyl-]",
            "CASNumber": "75-56-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 558958,
          "ProcessID": 44633,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 558959,
          "ProcessID": 44633,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 30683,
      "SummaryText": "Accidental release and emergency response policies:\n\nAn emergency situation, by definition, occurs unexpectedly.  Whatever its form, it may present a potentially serious threat to company operations, health and safety of employees and the surrounding community.  Some emergencies are governed by strict federal, state and local regulations.  Therefore it is essential that all employees working at this site be aware of potential emergency situations, to plan for them, and to follow emergency procedures should an emergency occur.\n\nThe purpose of these procedures are to provide information and establish guidelines for responding to emergencies.  Our procedures include requirements for emergency notification to outside agencies, emergency communications within the plant, evacuation plans, and steps for implementing response activities.  \n\nThe procedures are divided into separate sections for quick reference and easy access to vital information.  These sections include plan implementation, emergency equipment and personnel responsibilities, facility layout, emergency procedures, emergency contacts and communication, and spill management.  All employees are expected to become familiar with emergency procedures and are trained on the procedures on an annual basis.\n\nThe Janesville plant is seriously committed to operating safely.  The plant has a comprehensive set of emergency response procedures.  We have a fully trained emergency response team on hand capable of responding to chemical releases.  We also participate as an active member of the county LEPC.  Site officials work closely with the local fire department and safety and environmental consultants to help insure the facility complies with all permits and environmental regulations.\n\nFacility operations:\n\nThe facility is known as a manufacturer of surfactants.  The principal products include food ingredients, Kosher specialty oils, fabric softeners, and specialty surfactants.  These ingredients are used in food, cosmeti"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 30683,
      "SummaryText": "cs, pharmaceuticals, and personal care products.  The facility is committed to protecting human health and the environment and hazardous materials are managed in accordance with applicable health, safety and environmental regulations.  \n\nThis facility is subject to Risk Management Planning.  \n\nPrevention program:  accidental chemical-specific releases:\n\nOur facility is subject to Process Safety Management (PSM).  As a result we have written operating procedures that are used to prevent accidental releases of regulated substances.  The equipment used to process with these regulated substances is equipped with alarms for pressure, temperature, and hazardous vapors to alert personnel of emergency conditions.  These alarms allow personnel to safely and quickly respond to conditions like a chemical release before a release has off-site consequences.  The facilty has an active security program and works closely with the local authorities in preplanning and prevention of chemical releases.  \n\nFive year accident history:\n\nThere have been no releases from this site in the past 5 years that have resulted in off-site consequences.\n\nEmergency response program:\n\nOur facility has a highly trained emergency response team that equipped to quickly control and mitigate small releases of regulated substances at the facility before releases become too big.  Team members practice responding to potential  response scenarios of regulated substances as part of their annual training requirement.  This training is led by the on-site Health, Safety and Environmental Manager.  Emergency drills are conducted and detailed training on the facility contingency plan is provided to all employees.  The Health, Safety and Environmental (HSE) Manager serves as a member of the Rock County LEPC.   The HSE Manager coordinates preplanning of emergency services with the LEPC, local health care facilities, police department and various fire departments.  \n\nFor large scale releases of regulated substances thi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 30683,
      "SummaryText": "s facility would rely upon 911 emergency response services provided by the local and regional fire departments.  It is estimated that the fire department could arrive at our facility in a matter of 15 minutes.\n\nPlanned changes to improve safety:\n\nThere are plans to upgrade O-rings on several of our reactor agitator seals from Kalrez to Teflon.\n\nWe plan to upgrade our organic vapor monitor to include more modern electronics and sensors.\n\nWe plan to extend our alarm announcers to other buildings to allow more people to monitor chemical operations.\n\nWe are inviting officers from the city police department to tour our facility to understand the hazards of our facility."
    }
  ]
}