{
  "FacilityID": 30777,
  "FacilityName": "Springfield Water Treatment Plant",
  "FacilityStr1": "6213 Smith Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Cedar Hill",
  "FacilityState": "TN",
  "FacilityZipCode": "37032",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47147",
  "LEPC": "Robertson County LEPC",
  "FacilityLatDecDegs": "36.635278",
  "FacilityLongDecDegs": "-086.990000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Springfield",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Springfield Water Treatment Plant",
  "OperatorStr1": "6213 Smith Road",
  "OperatorStr2": null,
  "OperatorCity": "Cedar Hill",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37032",
  "OperatorZipCodeExt": null,
  "RMPContact": "Trent Morris",
  "RMPTitle": "Chief Operator",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000104923",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-03-24 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-06-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-02-19 00:00:00",
  "DeRegistrationEffectiveDate": "2020-05-28 00:00:00",
  "AnniversaryDate": "2009-06-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 36.63528,
  "FRS_Long": -86.99,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) PRECISE POSITION",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 44731,
      "AltID": "Disinfection",
      "FacilityID": 30777,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 45716,
          "ProcessID": 44731,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 59084,
          "ProcessID": 44731,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 559084,
          "ProcessID": 44731,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 30777,
      "SummaryText": "\nFacility Process: The Springfield Water Plant uses chlorine gas as part of its treatment process.  Chlorine is used in the treatment process as a disinfectant.  There are four (4) one tone cylinders stored on site.  Two (2) cylinders are stored as back-up supplies, while (2) cylinders are in use.  A common manifold connects the cylinders in use.  Chlorine gas is fed by pressure to a pressure reducer.  From that point gas is fed through a chlorinating system by vacuum where it is mixed in water.  The chlorinated water goes into the treatment process at two (2) different locations.  One application point is on top of the filters; the other is in the potable water storage clearwell.\n\nAccidental Release Prevention Policies:  The City of Springfield takes the safe handling of chlorine and the safety of its employees and neighbors very seriously.  A policy has been developed and administered for the practice of handling and feeding chorine at the Springfield Water Plant.  Certain steps are taken to assure that there is no accidental release of chlorine gas in the facility.  Operators are well trained on how to handle chlorine as well as what steps to take in the event of a chlorine leak.  Chlorine leak detectors are installed in both the chlorine storage and chlorine feeder rooms.\n\nWorst Case Release Scenario: The worst case scenario would be a 10 minute leak of 400 pounds of chlorine gas per minute, resulting in a total of 4000 pounds of chlorine.  This would have an end point of 3 miles from the point of leak, affecting an estimated 280 individuals.  All affected people are residential.  There are no industries, schools, or businesses in this range.\n\nAlternative Release Scenario: The alternative release scenario would be a 10 minute leak of one (1) pound per minute resulting in a total of ten (10) pounds of chlorine.  This would have an end point of 0.10 miles from point of leak, affecting 2 individuals.\n\nGeneral Accidental Release Prevention Program: The following is "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 30777,
      "SummaryText": "a list of precautions that are to be taken in handling chlorine, feeding chlorine, and the maintenance of chlorine equipment:\n\nEach cylinder is to be inspected, fusible plugs checked, and valves checked for leaks upon arrival.  If the integrity of the cylinder does not seem sound or if there are any signs of leakage, the cylinder shall not be received and must be removed from the premises.\n\nAll equipment used in the chlorination process will be checked each time the chlorine cylinders are changed.  Any equipment will be replaced if the integrity of that equipment is in question.  Chlorine leak detectors and exhaust fans will be checked monthly and serviced annually.  Pressure reducers and chlorinators will be cleaned and serviced annually by a trained technician.\n\nAll employees shall be made aware of the hazards of chlorine on their first day of work.  They shall be shown the material safety data sheets and the Process Safety Management Plan.  Each employee will be trained in the safe handling of chlorine, leak repair, and the use of SCBA.  They will receive refresher courses every year.\n\nThere are two scenarios to consider in the event of a catastrophic release of chlorine.\n1. If there is only one operator on duty they are to shut the plant down and immediately leave the premises.  They are to call the emergency response team from the nearest phone that is at a safe distance.  They are to return to the facility, remaining at a safe distance and secure the area while waiting for the emergency response team to arrive.\n2. If there are more than one operator on duty the following applies.  They are to shut the plant down and immediately leave the premises.  One individual is to remain at a safe distance and secure the area.  The other individual(s) are to go to the nearest phone that is at a safe distance and call the emergency response team.  They are to return to where they had dropped off the first individual and wait for the response team.\n\n\n\nEmergency Response Tea"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 30777,
      "SummaryText": "m:\n\nTrent Morris\nChief Operator, Springfield Water Plant\nHome # (615) 696-8211\nPager # (615) 402-4667\n\nSpringfield Fire Department\nPhone # (65) 384-4381\n\nCharles M. Schott, City of Springfield Safety Officer\nWork # (615) 384-4381\nHome # (615) 384-8719\n\nRobertson County Sheriff?s Department\nPhone # (615) 384-7972\n\nBrenntag Chemical Co.\nEmergency Response Team\nPhone # (615) 350-8090"
    }
  ]
}