{
  "FacilityID": 30902,
  "FacilityName": "West Bank Water Treatment Palnt",
  "FacilityStr1": "4500 Westbank Expressway",
  "FacilityStr2": null,
  "FacilityCity": "Marrero",
  "FacilityState": "LA",
  "FacilityZipCode": "70072",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22051",
  "LEPC": "Jefferson Parish Emergency Mgt",
  "FacilityLatDecDegs": "29.897500",
  "FacilityLongDecDegs": "-090.095833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.jeffparish.net/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Jefferson Parish Department of Water",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Jefferson Parish Water Department",
  "OperatorStr1": "1221 Elmwood Park Blvd - Suite 909",
  "OperatorStr2": null,
  "OperatorCity": "Harahan",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70123",
  "OperatorZipCodeExt": null,
  "FTE": 52,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000086006",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-02-18 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-06-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-01 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 29.8975,
  "FRS_Long": -90.095833,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 44892,
      "AltID": "Disinfection System",
      "FacilityID": 30902,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 59274,
          "ProcessID": 44892,
          "ChemicalID": 62,
          "Quantity": 48000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 45877,
          "ProcessID": 44892,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 17326,
              "Process_NAICS_ID": 45877,
              "SafetyReviewDate": "2004-05-10 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2004-05-10 00:00:00",
              "ChangeCompletionDate": "2004-05-10 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "scrubber",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-05-10 00:00:00",
              "TrainingReviewDate": "2004-05-10 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-05-10 00:00:00",
              "EquipmentInspectionDate": "2004-04-15 00:00:00",
              "EquipmentTested": "chlorinators, vacuum regulators, injectors, switchover system, gas monitors, scrubber",
              "ComplianceAuditDate": "2003-03-03 00:00:00",
              "AuditCompletionDate": "2003-03-03 00:00:00",
              "IncidentInvestigationDate": "1997-02-13 00:00:00",
              "InvestigationChangeDate": "1997-02-24 00:00:00",
              "MostRecentChangeDate": "2004-05-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 18072,
                  "PreventionProgram2ID": 17326,
                  "ProcessChemicalID": 59274
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 30902,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-05-12 00:00:00",
    "ERTrainingDate": "2003-05-16 00:00:00",
    "CoordinatingAgencyName": "Jefferson Parish Emergency Mgt",
    "CoordinatingAgencyPhone": "5043495360",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 30902,
      "SummaryText": "ency Operation. Also included are Troubleshooting Procedures.\r\n\r\nTraining \r\n\r\nTraining is required by the EPA to be included in the Risk Management Program. A program has \r\nbeen developed with guidelines on how to conduct regular and structured plant training. Training \r\nRecord Forms are included with the Program for the required documentation. Additionally, a \r\nTraining Record has been compiled and included for all affected personnel associated with the \r\ncovered processes.\r\n\r\n\r\nMaintenance\r\n\r\nBasic chlorine system maintenance procedures have been developed with associated \r\ndocumentation forms. Sound preventive maintenance will reduce potential hazards to personnel \r\nonsite, as well as to the off-site public.  In the event of an inspection or compliance review, state \r\nand federal regulators will request to see documentation and record keeping associated with the \r\nMaintenance Program. \r\n\r\nIncident Investigation\r\n\r\nAn Incident Investigation Program has also been developed. The EPA has established strict \r\nguidelines to follow in the aftermath of any release involving the chlorine system. The Incident \r\nInvestigation Program outlines key milestones that must be accomplished within 24 hours of any \r\ncovered incident, and the actions that must occur subsequently. Ultimately, it is desired that the \r\nplant learns from the incident and takes action to prevent similar incidents in the future. Incident \r\nInvestigation Report Forms are included, and must be maintained for a minimum of five years \r\nafter each incident.\r\n\r\nCompliance Audits\r\n\r\nInternal Compliance Audits must be conducted every three years to verify compliance with the \r\nprograms and procedures contained in this document. The Plant Manager must certify that the \r\nRisk Management Program team has evaluated compliance with the provisions of the Program, \r\nand verify that the procedures and practices are adequate and are being followed. Audit Report \r\nForms are provided.  The two most recent audit reports must"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 30902,
      "SummaryText": "Executive Summary\r\nThis document was developed to comply with the Environmental Protection Agency's (EPA's) \r\nRisk Management Program II, under Section 112 (r) of the Clean Air Act (CAA) Amendments of \r\n1990, 40 CFR Part 68.  The disinfection process is covered under this regulation at the Jefferson \r\nParish West Bank Water Treatment Plant (WTP).  \r\nThis document contains information on the chlorine systems at the West Jefferson Water \r\nTreatment Plant that may be used as a training reference in initial and recurring operator and \r\nmaintenance training. Training on process fundamentals, operations, and maintenance, coupled \r\nwith the current mitigation systems, will reduce the potential hazards to plant personnel and the \r\nsurrounding community.\r\nAn Emergency Response Program and an Incident Investigation Program are included. These \r\ntwo programs have been incorporated into both initial and recurring training.\r\nHazard Assessment\r\nThe Hazard Assessment is comprised of a Worst Case and Alternative Release Scenario for the \r\nchlorine system, as well as a 5-Year Accident History for the same. Because the West Bank \r\nWTP is located in a residential neighborhood and is not subject to OSHA programs, the West \r\nBank WTP is categorized in Risk Management Program Level II.  \r\nWorst Case Scenario \r\nThe Worst Case Scenario is defined as a ton container (2,000 pounds) of chlorine being \r\nreleased by a catastrophic event within a 10-minute duration and includes the passive mitigation \r\nrelated to the chlorine building.  A mitigation factor of 0.32 was determined for the chlorine \r\nbuilding using the EPA's Wastewater Treatment Plants Risk Management Program Guidance \r\ndocument.  The toxic endpoint for chlorine was determined to be 0.5 miles at the 3 ppm toxic \r\nendpoint concentration specified by EPA.  It should be noted that at this concentration, a person \r\nmay be exposed for up to one hour without suffering permanent injuries.\r\n\r\nAlternative Release Scenario\r\nThe Alternative"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 30902,
      "SummaryText": "Release Scenario of chlorine was based on a fusible plug release from an \r\noverfilled1-ton cylinder containing 2350 lbs with a release rate of 437 lbs/minute, applying both \r\npassive and active mitigation of the chlorine building and the recently installed 1-ton chlorine \r\nscrubbers. A total release of 2350 lbs of chlorine was assumed in this alternative scenario.  The \r\ntoxic end point for the Alternative Release Scenario was determined to be 0.0 miles with all \r\nchlorine gas remaining inside the chlorine building and scrubber system with no release to the \r\nenvironment.  This was based on a 2400 SCFM chlorine gas release rate and a 3000 SCFM \r\nscrubber exhaust rate that maintained the chlorine building under negative pressure during the \r\nentire period of the release.  It should be noted that this Alternative Release Scenario release \r\nrate of 437 lbs/minute is 2.2 times greater than the Worst Case Scenario required by Risk \r\nManagement Program, described above.\r\n\r\n5 Year Accident History - Chlorine\r\nNo releases have been documented in the past five (5) years.\r\n\r\nManagement Program\r\nA Document Management System was established to attribute responsibility for the \r\ndevelopment, implementation, and maintenance of the Risk Management Program. The \r\nProgram requires that a Compliance Audit to certify compliance with RMP Accident Prevention \r\nprovisions at least every three years.  In addition, a revised Risk Management Plan (RMP) must \r\nbe submitted to EPA every 5 years (within 5 years of the previous submission) or within 6 \r\nmonths of a change that results in a revised process hazard assessment or hazard review, or \r\nthat requires a revised offsite consequence analysis.  The Document Management System is \r\nlargely a function of the Risk Management Program Team, comprised of the Water Purification \r\nSuperintendent II, the Water Plant Maintenance Superintendent, Pump Equipment Mechanic, \r\nand Water Quality Scientist IV.  The Water Purification Superintendent II has th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 30902,
      "SummaryText": "e ultimate \r\nresponsibility for this Risk Management Plan.\r\n\r\nPrevention Program\r\nThe Prevention Program is comprised of Safety Information, Hazard Review, Operating \r\nProcedures, Training, Maintenance, Incident Investigation, and Compliance Audit procedures.  \r\nEach has an entire chapter devoted to it in this RMP, and is described in more detail below.\r\n\r\nChemical Safety Information\r\nComprehensive chemical data is provided in this section and includes:  regulatory reporting \r\naction thresholds, health hazard and chemical exposure limitations, as well as physical \r\nproperties of chlorine.  It is also imperative that plant operators and managers are appraised of \r\nthe potential health hazards and exposure limits associated with this chemical.\r\nProcess Safety Information\r\nProcess Safety Information includes the basic specifications on each process along with specific \r\ndetails such as Maximum Intended Inventory, Safe Upper and Lower Temperatures, Safe Upper \r\nand Lower Pressures, and Codes and Standards Used to Design, Build and Operate the \r\nProcess. \r\nHazard Review\r\nA Hazard Review was also conducted for the chlorine systems.  The Hazard Review technique \r\nused was a hybrid Hazard and Operability Study (HAZOP), in the form of a \"What If\" analysis. \r\nThe \"What If\" was developed from HAZOP experience at similar chlorine systems. The Hazard \r\nReview team consisted of plant management, process operating and maintenance personnel, \r\noutside process design engineers, and consultants knowledgeable in the Hazard Review \r\nprocess itself.\r\nRecommendations\r\nAll previous recommendations have been implemented or addressed.  There are no \r\nrecommendations for improvements at this time.\r\n\r\nOperating Procedures\r\n\r\nBasic chlorine system operating procedures have been developed and documented for the \r\nfacility. They provide system descriptions, specifications, and operating procedures for the \r\nchlorine gas system. Procedures include Start-up, Shutdown, Normal, Abnormal, and \r\nEmerg"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 30902,
      "SummaryText": "always be retained in the RMP file. \r\n\r\n\r\nEmergency Response Program\r\n\r\nThe Emergency Response Program is included as part of the Risk Management Program, in \r\ncase a significant release ever occurs. As in all the above programs, it is important to review this \r\nprogram regularly. The Rule, 40 CFR 68.95 requires training for all employees \"in relevant \r\nprocedures\" of the Emergency Response Program.\r\n\r\nIt is recommended that training on the specific plant safety procedures take place upon initial \r\nemployment and every year thereafter, as with most of the other RMP training programs.  Other \r\ntraining recommendations are discussed in the Emergency Response Program as appropriate to \r\nthe level of response.\r\n\r\n\r\n\r\nSummary of Action Items for the West Bank Water Treatment \r\nPlant\r\n\r\nThe RMP Rule, 40 CFR 68.42 requires that details of all accidental releases be recorded.  The \r\nformat details are provided in Sections 2 and 9.  All incident investigations must be conducted \r\nwithin 24 hours of each incident.\r\n\r\nThe RMP Rule, 40 CFR 68.15 requires that the Document Management System (e.g., the RMP \r\nTeam) be updated anytime personnel changes or administrative changes are made that would \r\naffect the lines of authority or responsibility for maintaining the RMP at the West Bank WTP. \r\n\r\nThe RMP Rule, 40 CFR 68.54 requires that each employee presently operating a process, and \r\neach employee newly assigned to a covered process be trained or tested competent in the \r\noperating procedures.  As an alternative, the Jefferson Parish may certify in writing that the \r\nemployee has the required knowledge, skills, and abilities to safely carry out the duties and \r\nresponsibilities as provided in the operating procedures.  Training documentation forms are \r\nprovided in Section 8.  CDM facilitated the development of operating procedures for the facility, \r\nand they are provided in Section 6.  These operating procedures may be used as training guides \r\nas well. \r\n\r\nThe RMP Rule, 40 CFR"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 30902,
      "SummaryText": "68.56 also requires training on the plant maintenance procedures.  \r\nMaintenance guidance is provided in Section 7.  The Jefferson Parish must train or cause to be \r\ntrained each employee involved in maintaining the on-going mechanical integrity of the process. \r\nTo ensure that the employee can perform the job tasks in a safe manner, each such employee \r\nmust be trained in the hazards of the process, in how to avoid or correct unsafe conditions, and \r\nin the procedures applicable to the employee's job tasks.  Refresher training on operating and \r\nmaintenance procedures must be provided every three years. Training documentation forms are \r\nprovided in Section 8.\r\n\r\nThe RMP Rule, 40 CFR 68.58 requires Jefferson Parish to conduct a Compliance Audit to certify \r\ncompliance with RMP Accident Prevention Program provisions at least every three years to \r\nverify that the procedures and practices developed under the rule are adequate and are being \r\nfollowed.  That guidance, along with Compliance Audit forms, is provided in Section 10.\r\n\r\nThe Rule, 40 CFR 68.95 requires training for all employees \"in relevant procedures\" of the \r\nEmergency Response Program.  It is recommended that training on the specific plant \r\nprocedures take place upon initial employment and every year thereafter, as with most of the \r\nother RMP training programs.  Other training recommendations are discussed in the Emergency \r\nResponse Program as appropriate to the level of response. The Emergency Response Program \r\nis discussed in Section 11.  Training documentation forms are provided in Section 8.\r\n\r\nThe Rule, 40 CFR 68.19 requires Jefferson Parish to submit a revised the Risk Management \r\nPlan (RMP) to EPA within 5 years of the previous submission or within 6 months of a change \r\nthat results in a revised process hazard assessment or hazard review, or that requires a revised \r\noffsite consequence analysis.\r\n\r\n\r\nExecutive Summary"
    }
  ]
}