{
  "FacilityID": 30914,
  "FacilityName": "WEST HICKMAN CREEK WWTP",
  "FacilityStr1": "645 WEST HICKMAN PLANT RD.",
  "FacilityStr2": null,
  "FacilityCity": "NICHOLASVILLE",
  "FacilityState": "KY",
  "FacilityZipCode": "40356",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21113",
  "LEPC": "Jessamine County LEPC",
  "FacilityLatDecDegs": "37.943472",
  "FacilityLongDecDegs": "-048.499833",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 618239958,
  "ParentCompanyName": "LEXINGTON-FAYETTE URBAN COUNTY GOVERNMENT",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "LEXINGTON-FAYETTE URBAN COUNTY GOV.",
  "OperatorStr1": "645 WEST HICKMAN PLANT RD.",
  "OperatorStr2": null,
  "OperatorCity": "NICHOLASVILLE",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "40356",
  "OperatorZipCodeExt": null,
  "RMPContact": "TIM BULLOCK",
  "RMPTitle": "PLANT SUPERINTENDENT",
  "FTE": 23,
  "OtherEPAFacilityID": "KY0021504",
  "EPAFacilityID": "100000099305",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-09 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-06-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 37.94167,
  "FRS_Long": -84.50056,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 44904,
      "AltID": "SEWAGE TREATMENT FACILITY",
      "FacilityID": 30914,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 45889,
          "ProcessID": 44904,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 59286,
          "ProcessID": 44904,
          "ChemicalID": 62,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 559286,
          "ProcessID": 44904,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 44905,
      "AltID": "SEWAGE TREATMENT FACILITY",
      "FacilityID": 30914,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 45890,
          "ProcessID": 44905,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 59287,
          "ProcessID": 44905,
          "ChemicalID": 49,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 559287,
          "ProcessID": 44905,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 30914,
      "SummaryText": "\nExecutive Summary        \n\n\n\n\n\n    Risk Management Plan\n\n    West Hickman Waste Water Treatment Plant\n\n\n\n\n\nThis Risk Management Plan for West Hickman Wastewater Treatment Plant has been prepared in accordance with EPA \"Risk Management\" and is designed specifically for the above-specified location.  West Hickman Waste Water Treatment Plant is located in Nicholasville, Kentucky, 3174 Ashgrove Pike and is operated by the Lexington-Fayette Urban County Government - Division of Sanitary Sewers. The primary function of this facility is the treatment of wastewater, in doing so chlorine is used for disinfection purposes and sulfur dioxide is for the neutralization of chlorine in plant effluent. The probability of a release at this facility is classified as low to medium.  The new enclosure for the chlorine cylinders along with the existing storage room for the sulfur dioxide cylinders and the new scrubbing facilities should prevent any major release from leaving the area.  Should a leak of a chlorine cylinder or sulfur dioxide cylinder occur, the onsite personnel (LFUCG employees) would be immediately vulnerable to exposure.  In the event of a release, there may be possible human health impacts to on-site employees and the population in the surrounding area.  A worse case release could affect an area over 2.0 mile radius and impact a sizeable residential and institutional population.  The Lexington Fayette Urban County Government (LFUCG) Division of Sanitary Sewers has invested considerable time in devising and implementing accidental release prevention programs and emergency response policies to prevent an accidental release from occurring.\n\n\n\nThe LFUCG and personnel of West Hickman Wastewater Treatment Plant applies a holistic and proactive approach towards risk management.  The LFUCG has devised a reliable maintenance program, identifying management policies, preventive maintenance practices and plans and procedures to identify and minimize risk at the plant.  Preventive maintenanc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 30914,
      "SummaryText": "e consists of daily and weekly checks of plant equipment.  All equipment is loaded on a database maintained by the LFUCG.  A data sheet is printed out daily indicating the maintenance and check schedule of all equipment and procedures.\n\n\n\nThe LFUCG manages risk proactively by reduction, avoidance, and thorough communication with one another and the Local Emergency Planning Committees.  To date no accidents or leaks have occurred at the West Hickman facility.  The possibility of risk situations is reduced by conducting manual inspections and routine maintenance checks on a regular basis.  The LFUCG identifies, evaluates, and analyzes potential risk situations in order to minimize a potential hazardous event at the plant.  Communication and practice with the LFUCG Fire Department ensures preparedness in the unlikely event that a leak should occur.\n\n\n\nIn the unlikely event that a chlorine or sulfur dioxide leak would occur, LFUCG employees, and the LFUCG Fire Department are well prepared and trained to remediate and or mitigate the situation.  LFUCG employees are trained in handling chlorine and sulfur dioxide.  They are also trained on initial startup procedures, normal operating procedures, temporary operating procedures, emergency operating procedures, emergency shutdown procedures, normal shutdown procedures, and startup following a turnaround or after an emergency shutdown procedure.\n\n\n\nExecutive Summary    cont.        \n\n\n\n\n\nResponse to a large chemical release at the West Hickman Wastewater Plant will include, but not be limited to the following agencies:  Lexington Fire Department, DEEM, Jessamine County LEPC, and Jessamine County Fire Department.  Other responding agencies are:  State Fire Marshall's Office, Kentucky Emergency Response Commission (KERC), Kentucky DES Area Coordinator, Natural Resources and Environmental Protection Agency, Chemtrac, and public works personnel.\n\n\n\nThe regulated substances at the West Hickman facility are chlorine and sulfur dioxide.  Wor"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 30914,
      "SummaryText": "st case and alternative release scenarios were developed for both of these regulated chemicals in order to determine the impact it would have on the immediate community.  The risk analysis for both was modeled with EPA's OCA Guidance Reference Tables and Equations.  The results for this modeling is described below; however, it should be noted that the likelihood of leaks of this size and nature occurring are absolute worst scenarios and are not likely to occur.  \n\n\n\nThe West Hickman WWTP has invested millions of dollars to ensure the proper precautionary systems and equipment was installed to protect against leaks to the atmosphere.  These precautionary measures are best exemplified in the alternative release scenarios for both chlorine and sulfur dioxide and are described later in this report.\n\n\n\nThe worst-case scenario for both chlorine and sulfur dioxide was modeled to determine offsite consequence analysis.  The EPA defines a worst-case release as the following:\n\n\n\n* The release of the largest quantity of a regulated substance from a vessel or process line failure, and\n\n\n\n* The release that results in the greatest distance to the endpoint for the regulated toxic substance.\n\n\n\nMitigation measures were not factored for the off-site consequence analysis for both scenarios.  Thus, the scenarios assume that full enclosure does not exist.\n\n\n\nThe maximum quantity of chlorine at any given time is no more then 14 tons and no more then 12 tons for sulfur dioxide. The largest quantity of both chemicals was determined by taking into account administrative controls rather than absolute capacity of the pipes.  West Hickman uses administrative controls that limit the quantity of chlorine and sulfur dioxide that can be stored in a pipe at any one time.\n\n\n\nThe toxic worst-case release for chlorine via a pipe leak at West Hickman is 2,000 lbs with a release rate of 400 lbs/min.  The duration of the release is 10 minutes with wind speed calculated at 1.5 m/sec.  Considering these "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 30914,
      "SummaryText": "factors, the maximum effected radius or distance to the endpoint is calculated at 2 miles (based on EPA's OCA Guidance Reference Tables for Chlorine Gas).  Within this 2-mile radius, approximately 23,000 people could potentially be affected.  Residences, schools, hospitals, and recreation areas are all within this specified area and could potentially be impacted in the event of a release.\n\n\n\n\n\n\n\nExecutive Summary    cont.        \n\n\n\n\n\nThe toxic worst-case release for anhydrous sulfur dioxide via a pipe leak is 2,000 lbs with a release rate of 400 lbs/min.  The duration of the release is 10 minutes with wind speed calculated at 1.5 m/sec.  Considering these factors, the maximum effected radius or distance to the endpoint is factored at 2.0 miles (based on EPA's OCA Guidance Reference Tables for Sulfur Dioxide).  Within this 2.0 miles radius, approximately 23,000 people could potentially be affected.  Residences, schools, hospitals, and recreation areas are all within this specified area.\n\n\n\nAlternative releases were also modeled for both chlorine and sulfur dioxide.  The alternative releases depict a more accurate picture of offsite consequence analysis and are more realistic than the worse case scenarios.  Passive mitigation measures were used to determine and factor alternative release scenarios.\n\n\n\nThe passive mitigation considered for both alternative scenarios was enclosure.  Modeling for the alternative releases was based on EPA's OCA Guidance Reference Tables and Equations for gas pipe leaks.\n\n\n\nThe maximum quantity release for chlorine at West Hickman through a pipe leak, using passive mitigation measures is 6 lbs with a release rate of 0.1 lbs/min.  The duration of the release is 60 minutes with wind speed calculated at 3.0 m/sec.  Considering these factors, the realistic distance to an endpoint or offsite analysis is actually 0.10 mile with only 25 people affected.  The number is significantly reduced from the worse case scenario due to the mitigation measures in pl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 30914,
      "SummaryText": "ace at the facility.  \n\n\n\nThe maximum quantity release for sulfur dioxide at West Hickman using passive  mitigation measures to 6 lbs with a release rate of 0.1 lbs/min.  The duration of the release is 60 minutes with wind speed calculated at 3.0 m/sec.  Considering these factors the realistic distance to an endpoint or offsite analysis is actually 0.10 mile with only 25 people affected, the same as chlorine with the mitigation measures in place.\n\n\n\nIn addition, the chlorine and sulfur dioxide rooms of the plant have been designed such that even in worst-case scenarios, minimal levels of toxic gas will be released into the atmosphere.  If a chlorine leak does occur it will be detected by the leak detectors in the chlorine feed room, scale room or in the chlorine cylinder storage room and the following systems would activated. If a chlorine gas leak is detected, an internal alarm within the chlorine building will be activated. When the leak detectors are activated, they will cause the ventilation systems to shut down and automatically activate the scrubber system. This system will remove the contaminated air from the feed or storage via intake piping. Chlorine gas will settle to the lower portions of the room, where the air intake piping is located, allowing it to be picked up and pulled into the caustic scrubbing unit. This caustic solution neutralizes the chlorine gas that is in the air and exhausts it to the atmosphere. One other addition to the scrubber unit is the use of vacuum regular shut off valves on each chlorine cylinder in service. Upon any leak in the feed system will cause a loss of vacuum, forcing an automatic shut off of all chlorine cylinders in service.\n\n\n\n\n\n\n\nExecutive Summary    cont.        \n\n\n\n\n\nMany precautionary measures are taken to prevent leaks from occurring.  Preventive maintenance and constant system monitoring are two of the most important elements comprising proactive risk management at West Hickman.  The following is a brief description of the"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 30914,
      "SummaryText": " chlorine and sulfur dioxide process at the facility.  Chlorine is pulled into the system through the piping systems.  Before it goes into the chlorinator room it goes through an automatic switch over system that is designed to monitor the chlorine gas pressure in the feed lines.  If the chlorine gas vacuum drops below a certain set point that has been pre-determined, the switch over system will switch from one bank to the other.  Once the chlorine gas is fed through the storage system in the scale room, it then enters into the chlorinator room.\n\n\n\nThe chlorine gas is then pulled through the five main chlorinators in the chlorinator room.  The five units have the capability of feeding a total 4,000 pounds. Three of the units feed up to 1,000 pounds each and the other two can feed up to 500 pounds each per day. These five units provide chlorine for the post-chlorination system.  The chlorine is fed through injectors which are operated with plant water.  The chlorinators are used for various plant processes throughout the plant, and feed chlorine through four different chlorine injectors, which also uses plant water to operate.  Chlorine is provided to various points of the plant through these four injectors.\n\n\n\nThe chlorine scale room and the chlorine chlorinator room utilizes ventilation, leak detector and scrubbing systems for protection of the building and the plant.  The chlorine detector systems are Wallace and Tierman leak detection systems.  There is one of these in the scale room and in the storage room positioned to monitor the entire rooms. There is also a chlorine leak detector in the chlorinator room.  It is located at the southeast corner of the room. \n\n\n\nThe ventilation systems which are associated with the chlorine tank storage room are checked every 30 days for operational condition.  The louvers and vents are manually activated for verification of operation every time the lights are turned on before entering room. The leak detection systems are also "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 30914,
      "SummaryText": "checked, calibrated and verified for operation every thirty days.  The caustic scrubber unit is checked twice weekly.  Upon verification of the three units, ventilation, leak detectors, and scrubber, the system is then activated to verify operation.\n\n\n\nAlternative systems are in tact if failure of engineering or administrative controls were to occur.  In the event of a failure of the ventilation system, should there be a leak in the feed room or tank room, the caustic scrubber would still be activated automatically.  Upon investigation of these units, if it is found that the ventilators failed to shut down, the ability to manually override them and to manually shut them down by turning off the power in the motor control center room is available.\n\n\n\nIn the event that there is a malfunctioning leak detector, a number of things could occur.  If a leak detector has a weak cell or a bad battery, the alarm system will be activated.  Upon investigating the alarm, the operator can determine whether it is a true leak or a malfunction of the system using a portable gas monitor.  If it is determined that the leak detector has malfunctioned, the individual leak detector can be manually disconnected.    This does not disarm the other unit that is in place.  The likelihood of having both malfunction is remote.\n\nExecutive Summary    cont.        \n\n\n\n\n\nOperations and procedures are very similar for sulfur dioxide.  The sulfur dioxide tank room and feed room also have ventilation systems.  Sulfur dioxide leak detection is utilized, and there are two leak detector systems located in the sulfur dioxide storage room and one in the feed room.\n\n\n\nIn the event of a sulfur dioxide leak in the feed or tank room, the following systems will be activated.  If a leak detector detects sulfur dioxide gas, the ventilation systems and the alarm systems will be activated.  The alarm system consists of both an audible and visual alarm inside and outside the building, and on the main computer.  The ventilation"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 30914,
      "SummaryText": " systems will shut down when the leak detectors are activated.  \n\n\n\nWest Hickman Waste Water Treatment Plant has a comprehensive and thorough emergency response plan.  In the event of a chlorine or sulfur dioxide leak or spill, all personnel are trained to immediately proceed with the following:\n\n\n\n1. Notify Plant Operations Supervisor Senior and then the Solids Process Supervisor.\n\n\n\n2. Plant Operations, Solids Process Supervisor, or their designee along with Plant Operator on duty will investigate the leak. A minor leak is a release of less than 10 lbs while a major leak is a release of more than 10 lbs.\n\n\n\n3. Minor leak - Plant Operator on duty and Supervisor or designee to repair.\n\n\n\n4. Major leak - initiate chlorine evacuation plan.\n\n\n\nThe Jessamine County Local Emergency Planning Committee in charge of responding to the West Hickman WWTP is familiar with the facility.  To prepare for a chlorine or sulfur dioxide leak, the members of the LEPC are trained annually and go through mock drills at the plant.\n\n\n\nProper equipment and process controls of the plant facilitate a safe environment at West Hickman Waste water Treatment Plant.  To ensure smooth and continuous accident free operation, the LFUCG and its employees are involved with every day processes, training and maintenance.  The LFUCG recognizes the importance of their operations to the environment and to the surrounding community.  To ensure quality management and control, proactive risk management is in effect every hour of the day.\n\n\n\nProper and thorough training of the employees is emphasized greatly.  It is important to have well-trained and skilled people handling the day-to-day operations and maintenance checks at the facility on a daily basis.  Initially, each employee involved in an operating process shall be trained in an overview of the process and in the operating procedures.  For new employees, this shall be done during the new employee orientation process.  Refresher training is given every ye"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 30914,
      "SummaryText": "ar to each employee involved in operating processes to ensure that employees understand and adhere to the current operating procedures.  Monthly safety meetings are held on specific topics to all employees at the facility and five-minute tailgate meetings are held on a weekly basis on safety related issues.  The LFUCG instills the importance of safety and proper procedures to all of its employees.\n\n\n\nExecutive Summary    cont.        \n\n\n\nSafety inspections of the plant are also conducted on a routine basis and are determined and monitored electronically through the LFUCG database.  Once a month, a full safety inspection of the entire plant is conducted.  All records are sent to administration and inspections are kept on a monthly file in the administration building.\n\n\n\nTo date, West Hickman has not had to deal with any offsite consequences related to the facility.  Through preventive maintenance and proactive management the LFUCG will continue to offer this quality operation.\n\n\n\nRMP Validation Errors --- No Data to Report\n\nRMP - West Hickman Creek WWTP\n\n\n\n\n\nLast printed 5/25/2004 2:35 PM        Page 1 of 6\n\n\n\n"
    }
  ]
}