{
  "FacilityID": 30957,
  "FacilityName": "Carpenter Co.-Riverside Division",
  "FacilityStr1": "7809 Lincoln Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Riverside",
  "FacilityState": "CA",
  "FacilityZipCode": "92504",
  "Facility4DigitZipExt": "4442",
  "FacilityCountyFIPS": "06065",
  "LEPC": "Riverside City Fire Department",
  "FacilityLatDecDegs": "33.552970",
  "FacilityLongDecDegs": "-117.242430",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.carpenter.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 96108725,
  "ParentCompanyName": "Carpenter Co.",
  "Company2Name": null,
  "CompanyDUNS": 3109444,
  "Company2DUNS": null,
  "OperatorName": "Stan Pauly",
  "OperatorStr1": "7809 LINCOLN AVENUE",
  "OperatorStr2": null,
  "OperatorCity": "RIVERSIDE",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92504",
  "OperatorZipCodeExt": "4442",
  "FTE": 373,
  "OtherEPAFacilityID": "92504RCRPN7809",
  "EPAFacilityID": "100000132224",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-02-27 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-05-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-05-24 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-05-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 33.927306,
  "FRS_Long": -117.405358,
  "FRS_Description": "WELL",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 44956,
      "AltID": "Polyuretahne Foam Manufac",
      "FacilityID": 30957,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 59348,
          "ProcessID": 44956,
          "ChemicalID": 77,
          "Quantity": 710000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 45941,
          "ProcessID": 44956,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 30957,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-02-05 00:00:00",
    "ERTrainingDate": "2004-03-08 00:00:00",
    "CoordinatingAgencyName": "City of Riverside Fire Department",
    "CoordinatingAgencyPhone": "9097825295",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 30957,
      "SummaryText": "Carpenter Co. Riverside (Carpenter) manufactures flexible slabstock polyurethane foam (Prime Pour Process) and is one of the process that utilizes Toluene diisocyanate (unspecified isomer) (TDI) a RMP regulated substance as the prime ingredient. The second flexible slabstock polyurethane foam manufacturing process called (Rebond Porcess) uses an commercial 80:20 TDI blend (80 wt% 2,4 TDI and 20 wt% 2,6 TDI) with scrap/recycled polyurethane foam to produce carpet underlay padding. No other RMP-regulated substances are used at this facility.\n\n1 Accidental Release Prevention and Emergency Response Policies.\nIt is the policy of Carpenter Co. to comply fully with all federal, state and local rules and regulations regarding proper handling, use, storage, and emergency response preparedness to prevent accidental release of chemicals toxic or otherwise.  Furthermore, Carpenter is committed to protecting the health and welfare of both its employees and the surrounding community.  To achive this goal procedures, policies, prenventive maintenance and training is provided.  Safety depends on the manner in which  TDI handled combined with (1) the safety devices inherent in the design of this facility, (2) the safe handling procedures and check lists that are used and (3) the training imparted to our personnel.  In addition regular audits and inspections are conducted to ensure our personnel are aware of the safety requirements and implementing the procedures.\n\nCarpenter's Emergency Response Program is based on and to comply with OSHA Hazardous Waste and Emergency Operations (HAZWOPER) regulation (29 CFR 1910.120) including the City of Riverside Fire Department Business Emergency Plan, state and local regulations. The emergency response plan includes procedures for notification to the Riverside Fire Department (local AA).\n\n2.The stationary source and regulated substances handled.\n\nThe Carpenter Co. operation in Riverside, CA, is located at 7809 Lincoln Avenue and occupies a 618,1"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 30957,
      "SummaryText": "00 square feet building on 39.8 acres in an industrial-zoned area surrounded by industrial and residential neighbors.  The Plant is bound by Jefferson Street on the West, Lincoln Avenue on the South and Grace Street on the East. \n\nCarpenter manufactures polyurethane foam for use in furniture, bedding, carpet cushion underlay and other applications.  The manufacturing process entails the use of TDI as a reactant to produce the foam.  TDI is received by railcar and occasionally by tanker trucks and is stored in three indoor storage tanks. The TDI is pumped from the storage tanks to the pouring line through a strainer, heat exchanger and filter prior to entry into the mix head where it is mixed and reacts with other Catalyst and Amines to produce  polyurethane foam as slabs. The foam is moved to a large rack storage system for curing.  After curing, it is sent to cutting stations where it is cut to the size and shape specified by our customers.  The facility is monitored 24 hrs by security personnel and access to the palnt area is restricted to authorized facility employees,management personnel, and contractors accompanied by plant personnel.  TDI is the only substance handled at this facility that is regulated under EPA Risk Management Program (RMP). The maximum inventory of TDI is 710,000 lbs (assumed to be two (2) railcars,with 190,000 lbs/rail car) and three (3) storage tanks (110,000 lbs. each). This exceeds the TDI threshold of 10,000 lbs.\n\n3. The worst-case release scenario and the alternative release scenario, including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\nWorst-case Release Scenario: Assessment and modeling was conducted for a worst-case release of TDI from Carpenter, Riverside, CA plant. Worst-case was assumed to be an immediate release of a railcar quantity (190,000 lbs) of TDI into a graded embankment that directs the release into a diked engineered containment area. During the winter months, th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 30957,
      "SummaryText": "e TDI railcar is pre-heated to a maximum temperature of 110 F before unloading the railcar.  For the purpose of modelling the higher temperature of 110 F has been used.  Due to the high boiling point and a low vapor pressure of TDI, the resulting plume is very dilute with a density close to air - a neutrally buoyant plume.  This is confirmed by The EPA RMP Offsite Consequence Analysis Guidance Document which indicates that TDI will have a neutrally buoyant plume.  Using the equations found in the EPA guidance, the duration of release is estimated to be over 2 yrs.        .                                                                                                 \nThe Model selected is based on the type of release anticipated. In Carpenter's case, we anticipate a very large pool of material at ambient temperature and pressure with a very low vapor pressure that will result in a slow, steady release over an extended period of time.  Although there may be a concentrated vapor area in the middle of the pool immediately above the surface of the liquid, the emissions will be very dilute. The Society of Plastic Industry (SPI) in conjunction with U.S. EPA RMP Guidance for Offsite Consequence Analysis model specifically for TDI was used to identify the Endpoint Distance.  In particular, equation D-1 of the guidance document was used to estimate pool evaporation based upon vapor pressure correleation published by NIST.  A Gaussian plume model was used to determine the endpoint distance based on the evaporation rate. Based on the modeling results no emissions of TDI over the toxic endpoint are expected. The distance to the toxic endpoint concentration of 0.007 gms/m3 is less than 165 feet, which is well within the facility. The nearest facility boundary is approximately 300 feet. \n\nAlternative Release Scenario:  Not required\n\n4.  The general accidental release prevention program and the specific prevention steps.\n\nThis facility complies with EPA¿s Accidental Release Preve"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 30957,
      "SummaryText": "ntion Rule; CALEPA¿s CalARP Program and all applicable state codes and regulations.\n\n5.  Five-year accident history.\n\nNo accidental TDI release has occurred that qualify for listing in the EPA¿s required five-year accident history report. \n\n6.  The Emergency Response Program.\n\nCarpenter has coordinated the Emergency Response Program with Riverside Fire Department (local AA) emergency HAZMAT team.  A thorough HAZOP review of the TDI process was completed with representatives from the fire department and the local community in November 1997 to comply with the State of California Risk Management Prevention Plan (RMPP) update.  The local hospital and industrial clinic has been provided with information regarding medical treatment to TDI exposure.\n\n7. Planned changes to improve safety.\n\nCarpenter prepared a State required RMPP in 1997 consequently, changes to improve safety were documented during the RMPPdevelopment process and all reccomendations have been implemented.  In addition continious improvements are performed as and when new technology and processes become available.  Carpenter is commited to provide a safe and environmentally responsible working conditions to all the employees and the surrounding community."
    }
  ]
}