{
  "FacilityID": 3128,
  "FacilityName": "Wabash Alloys, L.L.C",
  "FacilityStr1": "4525 W. Old Highway 24",
  "FacilityStr2": null,
  "FacilityCity": "Wabash",
  "FacilityState": "IN",
  "FacilityZipCode": "46992",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18169",
  "LEPC": "Wabash County LEPC",
  "FacilityLatDecDegs": "40.278667",
  "FacilityLongDecDegs": "-86.111139",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A5",
  "LatLongDescription": "PP",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 2457617,
  "ParentCompanyName": "Connell, L.L.C",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Wabash Alloys, L.L.C",
  "OperatorStr1": "4525 W. Old 24 P.O. Box 466",
  "OperatorStr2": null,
  "OperatorCity": "Wabash",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46992",
  "OperatorZipCodeExt": "0466",
  "FTE": 438,
  "OtherEPAFacilityID": "46992WBSHLOLDUS",
  "EPAFacilityID": "100000038489",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-08 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Wabash Alloys, Wabash, Indiana",
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-17 00:00:00",
  "ErrorReportDate": "1999-06-17 00:00:00",
  "ReceiptDate": "1999-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 1,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 40.78936,
  "FRS_Long": -85.87694,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3503,
      "AltID": "Aluminum Demagging",
      "FacilityID": 3128,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 3745,
          "ProcessID": 3503,
          "ChemicalID": 62,
          "Quantity": 110000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 3573,
          "ProcessID": 3503,
          "NAICSCode": "331314",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1171,
              "Process_NAICS_ID": 3573,
              "SafetyReviewDate": "1999-02-26 00:00:00",
              "PHA_Date": "1994-11-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-10 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-02-26 00:00:00",
              "TrainingReviewDate": "1999-02-26 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-10 00:00:00",
              "EquipmentInspectionDate": "1999-06-10 00:00:00",
              "EquipmentTested": "Connections, Vaporizers, Regulators, Piping, Valves, Ejectors",
              "ChangeMgmtDate": "1999-06-10 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-10 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-02-26 00:00:00",
              "AuditCompletionDate": "1999-06-10 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-02-26 00:00:00",
              "HotWorkPermitReviewDate": "1999-02-26 00:00:00",
              "ContractorSafetyReviewDate": "1999-02-26 00:00:00",
              "ContractorSafetyEvalDate": "1999-02-26 00:00:00",
              "CBI_Flag": 1,
              "Description": "    Prevention of a release is a core component of the Wabash, LLC Risk Management Program.  This program is designed to insure proper work practices and an on-going mechanical integrity program.  The primary methods used by this facility are a part of the Process Safety Management Program as follows:\n    A.  Written Plan of Action - Process Safety Information.\n    This part of the program is one of the most involved and included the development of a written plan of action regarding the implementation of employee participation in the program.  In accordance with a specific schedule outlined by the standard, as per 29 CFR 1910.119, Wabash Alloys has completed a compilation of written process safety information concerning the process and operations involved with Chlorine of these standards of operating procedures.  For purposes of defining a process covered under this program, the use of Chlorine in the demagging system has been considered \"a process,\" whereas a production or usage system/function is considered an \"operation.\"   By identifying each functional operation, a team was able to ascertain the potential and develop preparation plans in the case of a release.  This compilation of information is to enable Wabash Alloys and the employees involved in the operations related to Chlorine to identify and understand the hazards posed by these processes.  This process safety information includes information pertaining to the toxicological and physical hazards of the chemical listed.\n    B.  Hazard Analyses/Abatement Schedule.\n    This analysis is the heart of Wabash Alloys ' process safety management or Risk Management release prevention program.  The safety and health staff, engineering and maintenance personnel, and certain operational personnel performed an initial process hazard analysis (hazard evaluation) on each operation within the chlorine process.  The analysis was completed by a team with expertise in the operations.  The team included employees who have experience and knowledge specific to the operations of handling and using the chemicals at each of the process operations.  A system was developed and is maintained to promptly address the team's findings and recommendations by the formation of a PSM/RMP committee.  Also, a written schedule of when these actions were to be completed has been developed, indicating by whom and when.  The hazard analyses will be updated as needed and at least every five (5) years.\n    This analyses involved a review of each operation of the process to address steps for each operating phase, operating limits, safety and health considerations, and safety systems and their functions.  The assessment also included information concerning the emergency action plans related to the process; development and implementation of safe work practices in the format of Job Safety Analysis also in regards to the control of entrance and exit of personnel in the process areas; pre-startup safety; mechanical integrity of equipment; inspection and testing, correction of deficiencies in equipment, planned or unexpected changes to the process, equipment, and procedures to the processes.\n    C.  Written Operating Procedure.\n    Wabash Alloys has developed and implemented written operating procedures to provide clear instructions for safely conducting activities involved in the processes at each operation by our employees, consistent with the process safety information and to address steps for each handling phase, limitations, safety and health considerations, and safety systems and their functions.  Other written documentation of standard operating procedures as a part of this program is included in the following documents:\nMechanical Integrity Study of Process Equipment\nPreventive Maintenance Program\nWritten Emergency Response Plan\nEmployee Emergency Action and Evacuation Plan\n    D.  Training.\n    Process Safety Management\n    Each employee involved in operations within the process where Chlorine is received, processed, or used at the facility has been trained in an overview of the process and in the operating procedures as outlined by 29 CFR 1910.119.  Refresher training is provided no less than every three years and more often if necessary.  Training includes:\n    a.  Emphasis on the specific safety and health hazards;\n    b.  Emergency operations in the case of a release including shutdown; and\nc. Safe work practices applicable to the employee's job tasks.\nE.  Mechanical Integrity\nAlso, each maintenance person who has responsibilities to perform maintenance on the process components receives training on an as needed basis, but no less than every three years.\nF.  Emergency Response\nA team of individuals has been trained and is equipped as a HAZMAT team.  The team is equipped with Self-Contained Breathing Apparatuses, Level A suits and monitoring equipment to respond in an offensive manner.\n    A record of the training, which contains the identity of the employee, the date of training, and the means, used to verify that the employee understood the training is completed and maintained.\n    G. Contractors.\n    Designated personnel have specific responsibilities related to the use of contractors who perform maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to areas where the Chlorine is received, stored, or processed in the facility.  These responsibilities include specific requirements in selection of contractors regarding the contractor's safety performance and programs; the provision of information concerning the emergency action plans related to the process; development and implementation of safe work practices regarding the control of entrance and exit of contract employers and contract employees in the process areas, periodic evaluation of the contractor related to safety management at the process; maintenance of certain records related to contractor employee injury and illness; development of written procedures for any new processes, and provision of training to employees.  \n    Contractors performing work on or adjacent to equipment or processes in which Chlorine is present must have clearance from the Maintenance Supervisor prior to beginning operations.  Each contractor must also complete the Wabash Alloys Visitor and Contractor Safety Rules form prior to entry into the facility.\n    In those cases where contractors will perform work directly to or on the process equipment in which the Chlorine is present, the Safety Coordinator and Maintenance Supervisor provide an orientation section to them prior to beginning operations.  This orientation includes an introduction to the Wabash Alloys Process Safety Management Program, information concerning the toxicological and physical hazards of Chlorine, and the emergency response plan in the case of an incident involving a release.  Upon completion, the contractor is issued a permit by the Maintenance Supervisor to begin work.\n    H  Inspection and Testing.\n    A program has been developed for inspection and testing, correction of deficiencies in equipment, quality assurance, management of changes in the handling of the Chlorine, and procedures to the process, and compliance audits.\n(1) Mechanical Integrity Program and Assessment - To insure the integrity of the mechanical components of the chlorine process, a professional engineer, in collaboration with Wabash, LLC personnel has developed an On-going Written Mechanical Integrity Program.  This development included a thorough assessment of the process in an attempt to assess the age and present integrity of the component parts.  This assessment included the identification of the component parts for comparison with the manufacturer's specification for maintenance and replacement with \"like in-kind components\" on a scheduled basis.  In addition, updated Piping and Instrument Diagrams were completed.\n(2)  Equipment Preventive Maintenance and Quality Assurance Program - In an effort to maintain the mechanical integrity and to complete repairs of the equipment in the process, the Maintenance Supervisor oversees a Preventive Maintenance Program.  \n(3)  Management of Change - To insure that proper safety precautions are initiated when change in the operations of the process occurs, the PSM/RMP committee will meet to discuss the planned changes before authorization is given.  The committee will address the following issues prior to approval of a change in the process:\n7 The technical basis for the proposed change\n7 Impact of the change on employee safety and health,\n7 Modifications to operating procedures\n7 Necessary time period for the change\n If changes are decided upon, training for personnel in the operation is provided.  Also, any changes to be made are evaluated by performing a Hazard Operability Study to identify any hazards and/or actions that must be taken.  Additionally, if a change covered by these procedures results in a change in the process safety information, such information will be updated accordingly.  \n     (4)  Pre-startup safety review - To insure that proper safety precautions are initiated when shut-down and startup of the systems occurs after such things as renovations or major repairs, the PSM/RMP committee will meet to discuss the changes.  The committee will decide if the changes are significant enough to require a change in the process safety information.  If the modification is significant enough to require such a change the committee will confirm the following:\n7 Construction and equipment are in accordance with design specifications;\n7 Safety, operating, maintenance, and emergency procedures are in place and are adequate\n7 A process hazard analysis has been performed for new facilities and recommendations have been resolved or implemented before startup, and modified facilities meet the management of change requirements, and\n7 Training of each employee involved in operating the process has been completed.\n    (5)  Compliance Audits - Compliance audits will be conducted with these operating procedures at least every three years to verify that the procedures and practices developed are adequate and are being followed.  The PSM/RMP Committee will certify that they have evaluated compliance with the provisions of the program.  The compliance audit must be conducted by at least one person knowledgeable in the process and a report of the findings will be developed and documented noting any deficiencies that have been corrected.  The written report of the two (2) most recent audit reports will be retained.\n    I.  Incident investigation \n    A crucial part of the Wabash process safety management and release prevention program is a thorough investigation of incidents to identify the chain of events and causes so that corrective measures can be developed and implemented.  An investigation will be conducted on each incident, which resulted in, or could reasonably have resulted in a catastrophic release of the Chlorine in the workplace.  Accident Investigations will be conducted by:\nPlant Manager\nSafety Coordinator\nMaintenance Supervisor\n\n    J.  Emergency planning and response \n    The facility Emergency Response Plan will be maintained according to the provisions of 29 CFR 1910.38 and 29 CFR 1910.120 and EPA guidelines.\nA team of individuals has been trained and is equipped as a HAZMAT team.  The team is equipped with Self-Contained Breathing Apparatuses, Level A suits and monitoring equipment to respond in an offensive manner.\n    Meetings with the Local Emergency Planning Committee Chair and local fire-fighting personnel have taken place to insure proper implementation of emergency response operations should a release occur. \n    K.  Hot Work Permits \n    In accordance with 29 CFR 1910.252, authorization is required from a designated person before cutting or welding is permitted in areas not specifically designed for such purposes.  Based on fire potentials of the plant facility, areas are established for cutting and welding and procedures for a permit for other areas.  Prior to welding or cutting in other than established areas, any Wabash Alloys employee or contract employee must acquire a written permit.\nL.  Monitoring Devices\nAir monitoring devices to measure the concentration of Chlorine are located at the storage vehicle, in the vaporizer room, and at the furnaces.  If for some reason the concentration of chlorine equals or exceeds 5ppm an audible and visual alarm in the production area engages.  Also, an alarm in the production supervisor's office alerts personnel of the concentration.\nActions to be taken should the alarm engage are a part of the facility's written Emergency Response Plan and subjects covered during initial and refresher HAZMAT training.",
              "_chemicals": [
                {
                  "PrimaryKey": 1313,
                  "PreventionProgram3ID": 1171,
                  "ProcessChemicalID": 3745
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 3128,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-02-26 00:00:00",
    "ERTrainingDate": "1999-11-01 00:00:00",
    "CoordinatingAgencyName": "Wabash County Emergency Mgmt Ag",
    "CoordinatingAgencyPhone": "2195633181",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3128,
      "SummaryText": "     Accidental release prevention and emergency response policies at Wabash\nThe policy of Wabash Alloys, is to develop those programs necessary to protect the health of its employees against on-the-job hazards which may cause sickness or injury now or in the future.  Also, as the operator of a facility at which substances may be used that in uncontrolled situations could cause harm to the public and damage to the environment, we will strive for environmental excellence with a commitment to continual improvement, pollution prevention and compliance with legislative requirements.  The Risk Management Program (RMP) is one of these programs.\n     Each employee in areas where the RMP is applicable will be knowledgeable of the related policies and procedures and the supervisors or a designated person is required to insure that they understand them.  Employees and supervisors are required to comply with our policies and are subject to corrective action in those cases determined to indicate willful violation.\n    A written plan of action regarding the implementation of employee participation in the program has been developed as a part of our Release Prevention Program as specified by 29 CFR 1910.119.  A compilation of safety information to enable Wabash Alloys and the employees involved in the chlorine operations to operate safety has been accumulated.  This process safety information includes information pertaining to the toxicological and physical hazards of the chemical listed.  This plan of action includes information pertaining to the technology of the processes, and information pertaining to any equipment used in the processes.\n     A complete hazard analysis and study of the chlorine systems' mechanical integrity has been completed on the chlorine receipt, storage, and utilization operations have been completed.  This analysis was completed by safety and health staff, engineering and maintenance personnel, and certain operational personnel.  This analyses involved a re"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3128,
      "SummaryText": "view of each operation of the processes to address steps for each operating phase, operating limits, safety and health considerations, and safety systems and their functions.  The assessment also included information concerning the emergency action plans related to the process; development and implementation of safe work practices regarding the control of entrance and exit of personnel in the process areas; pre-startup safety; mechanical integrity of equipment; inspection and testing, correction of deficiencies in equipment, planned or unexpected changes to the process, equipment, and procedures to the processes.\n     A system was developed and is maintained to promptly address the team's findings and recommendations.  The hazard analyses will be updated as needed and at least every five (5) years.\n    Wabash Alloys has developed and implemented written operating procedures to provide clear instructions for safely conducting activities involved in the processes at each operation by our employees, consistent with the process safety information and to address steps for each handling phase, limitations, safety and health considerations, and safety systems and their functions.  Other written documentation of standard operating procedures as a part of this program is included in the following documents:\nJob Safety Analyses\nMechanical Integrity Study of Process Equipment\nPreventive Maintenance Program\nWritten Emergency Response Plan\nEmployee Emergency Action and Evacuation Plan\n    Each employee involved in operations within the processes where the chlorine is received, processed, or used at the facility has been trained in an overview of the processes and in the operating procedures as outlined by OSHA regulations.  Refresher training is required every three years, and more often if necessary.  Training includes:\n    a.  Emphasis on the specific safety and health hazards;\n    b.  Emergency operations in the case of a release including shutdown; and\n    c.  Safe work practices applicabl"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3128,
      "SummaryText": "e to the employee's job tasks.\n    Designated personnel have specific responsibilities related to the use of contractors who perform maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to areas where the Chlorine is received, stored, or processed in the facility.  These responsibilities include specific requirements in selection of contractors regarding the contractor's safety performance and programs; the provision of information concerning the emergency action plans related to the process; development and implementation of safe work practices regarding the control of entrance and exit of contract employers and contract employees in the process areas, periodic evaluation of the contractor related to safety management at the process; maintenance of certain records related to contractor employee injury and illness; development of written procedures for any new processes, and provision of training to employees.  \n    Contractors performing work on or adjacent to equipment or processes in which Chlorine is present must have clearance from the Maintenance Supervisor prior to beginning operations.  Each contractor will also complete the Wabash Alloys Divisional Visitor and Contractor Safety Rules form prior to entry into the facility.\n    In those cases where contractors will perform work directly to or on the process equipment in which the Chlorine is present, the Safety Coordinator and Maintenance Supervisor will provide an orientation section to them prior to beginning operations.  This orientation will include an introduction to the Wabash Alloys Process Safety Management Program, information concerning the toxicological and physical hazards of Chlorine, and the emergency response plan in the case of an incident involving a release.  Upon completion, the contractor will be issued a permit by the Maintenance Supervisor to begin work.\nThe Wabash facility and the Chlorine Process\n    Wabash Alloys provides employment for 438 workers in Wabash, Indi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3128,
      "SummaryText": "ana.  This facility is one of eight other Aluminum recycling plants in the United States owned by Connell Ltd.  As a manufacturer of aluminum ingots its products are sold globally under its corporate company, Connell, Ltd, 1 International Place, Fort Hill Square, Boston Massachusetts.\n    The facility is located in Wabash, Indiana.  The Wabash Alloys facility is located at 4525 W Old Highway 24, Wabash, Indiana 46992.  The site is approximately 73 acres in size.  The site is serviced with electricity, water, natural gas, and sewer lines.  \nOperation Description\nChlorine\n    The site process involves the sorting, grading, processing (removing organics via a rotary kiln), melting, and alloying of metals for sale.  As part of the sorting process, large aluminum scrap is shredded or crushed, and ferrous metals are removed using a maseparation process.  A dryer with a secondary combustion unit and baghouse is used to remove impurities from the aluminum scrap such as moisture, paints and resins.\n    The sorted aluminum is charged into one of four furnaces where the metal is melted.  Once melted, various additives are used to modify the composition and hence the physical characteristics of the metal.  The metal is degassed by bubbling nitrogen through the molten metal.   Magnesium is removed by bubbling chlorine through the melt to form magnesium chloride.  Materials kept on-site for the process are aluminum, magnesium, zinc, copper, silicon, sodium, beryllium, and strontium.  Approximately 8,000,000 pounds of these materials are on-site at any given time.\n    Once the molten product is prepared, the melt is either poured and cooled as ingots or sows, or is transferred to heated crucibles for shipment as a molten material.  Particulate emissions from the crusher are controlled with a baghouse.  The emissions from the dryer are treated first using a secondary combustion unit, and then with a baghouse.  Emissions from melters, ingot and sow molding processes, and dross cooling operation"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 3128,
      "SummaryText": "s are controlled using a baghouse.\n    Chlorine is received at the facility in 55-ton rail cars.  The tanker is connected into piping through which chlorine as a liquid flows to a vaporizer at a pressure of 150 psi. \n     The vaporizer heats the chlorine to the vapor state by a recirculated hot water electric heater, which is thermostatically controlled.  Chlorine gas exits the vaporizer through a regulator and into a piping manifold.  Each furnace has its own chlorine supply pipe and flowmeter, which regulates the pressure.\n     At each particular furnace the chlorine gas passes a shut off valve, then through another flowmeter, and then through a needle valve where its flow is regulated by the furnace operator to the molten metal pump.  Close to the needle valve is the tubing connection that connects to a carbon lance, which feeds the gas to the pump housing.  Here the chlorine reacts with magnesium and aluminum to demag and clean the aluminum alloy.\nPropane\n    Propane is stored in a 13,000 gallon tank on the east side of the facility.  Transferred through piping over the building, the gas is pumped to two 1,000 gallon tanks at a fueling station.  The fuel is used for fueling industrial trucks.\nWorst-case release scenario and alternative release scenario\nChlorine\n    As a part of the Wabash Alloys proactive program concerning the hazards of chlorine to its' workers and the surrounding public, its staff has conducted a thorough hazard assessment.\n    For the hazard assessment and the RMP, populations potentially affected are defined as those within a circle that has as its center the point of release and its radius the distance to the toxic or flammable endpoint.  Owners or operators may use Census data to define this population.  The presence of schools, hospitals, other institutions, public arenas, recreational areas, and large commercial and industrial developments that can be identified on street maps within this circle must be noted.  The presence of environmental recepto"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 3128,
      "SummaryText": "rs within this circle must also be listed.  The EPA has defined environmental receptors as natural areas such as national or state parks, forests, or monuments; officially designated wildlife sanctuaries, preserves, refuges, or areas; and Federal wilderness areas, that can be exposed to an accidental release.\n    One worst case scenario for chlorine was decided upon as the complete rapid loss of a 55 tons from the tanker car during a one-minute time frame.  The only likely causes for such an incident is felt to be from a natural disaster or a derailment of the tanker car.\n    The worst case scenario for chlorine was decided as the complete rapid loss of 55 tons of chlorine during a one-minute time frame. The following information was determined using the Automated Resource for Chemical Hazard Incident Evaluation (ARCHIE) model, based on the stability class F, 4.5 mph wind speed, and a toxic vapor level of 3ppm for chlorine.  This resulted in a release rate of 110,000 lbs/min, and an end point of 29.61 miles from the spill point during summer season at 90 degrees F.  \n    As an alternative case scenario it was decided that the possibility would include damage to a 1\" pipe, probably at the connection station where the facility is connected to the chlorine tanker car.  The following information was determined using the Automated Resource for Chemical Hazard Incident Evaluation (ARCHIE) model, based on the stability class F, 4.5 wind speed, and a toxic vapor level of 3ppm for chlorine.  This resulted in an end point of .24 miles from the spill point.\nPropane\n    One worst-case scenario for Propane was decided as the loss of propane because of the rupture of a 13,000 gallon tank.  The following information was determined using the Automated Resource for Chemical Hazard Incident Evaluation (ARCHIE) model, based on the stability class F, 4.5 mph wind speed. \n    The primary purpose of release modeling is to provide emergency preparedness personnel with estimation methods that may be used"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 3128,
      "SummaryText": " to assess the vapor dispersion, fire, and explosion impacts associated with episodic discharges of hazardous materials into the terrestial (i.e. land) environment.  The modeling is also intended to facilitate a better understanding of the nature and sequence of events that may follow an accident and their resulting consequences.\n    This release-modeling project is to assess fire and explosion impacts associated with the release of propane from a 13,000 gallon tank located on the east portion of the property.  The fuel is used as fuel for industrial trucks.  The fuel is delivered by wheeled vehicle piped to the tank then piped to two 1000 gallon tanks at the fueling station.\n    Four models were used to analyze the consequences of a Propane release.  These include Liquid Pool Fire Model, Flame Jet Model, Fireball Thermal Radiation Vapor Model, and Cloud or Plume Fire Model.\nGeneral accidental release prevention program and chemical-specific prevention steps\n    Prevention of a release is a core component of the Wabash, LLC Risk Management Program.  This program is designed to insure proper work practices and an on-going mechanical integrity program.  This program also insures compliance with 29 CFR 1910.38, 1910.120, 1910.1200, 40 CFR, Part 68, Part 112, and Part 260.\n    Wabash Alloys has developed and implemented written operating procedures to provide clear instructions for safely conducting activities involved in the processes at each operation by our employees, consistent with the process safety information and to address steps for each handling phase, limitations, safety and health considerations, and safety systems and their functions.  Other written documentation of standard operating procedures as a part of this program is included in the following documents:\nMechanical Integrity Study of Process Equipment\nPreventive Maintenance Program\nWritten Emergency Response Plan\nEmployee Emergency Action and Evacuation Plan\nJob Safety Analysis\nTraining\nEach employee involved in "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 3128,
      "SummaryText": "operations within the process where Chlorine is received, processed, or used at the facility has been trained in an overview of the process and in the operating procedures as outlined by 29 CFR 1910.119.  Refresher training is provided no less than every three years and more often if necessary. \nMechanical Integrity\nAlso, each maintenance person who has responsibilities to perform maintenance on the process components receives training on an as needed basis, but no less than every three years.\nEmergency Response\nA team of individuals has been trained and is equipped as a HAZMAT team.  The team is equipped with Self-Contained Breathing Apparatuses, Level A suits and monitoring equipment to respond in an offensive manner.\n    A record of the training, which contains the identity of the employee, the date of training, and the means, used to verify that the employee understood the training is completed and maintained.\n    Contractors.\n    Designated personnel have specific responsibilities related to the use of contractors who perform maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to areas where the Chlorine is received, stored, or processed in the facility.  These responsibilities include specific requirements in selection of contractors regarding the contractor's safety performance and programs; the provision of information concerning the emergency action plans related to the process; development and implementation of safe work practices regarding the control of entrance and exit of contract employers and contract employees in the process areas, periodic evaluation of the contractor related to safety management at the process; maintenance of certain records related to contractor employee injury and illness; development of written procedures for any new processes, and provision of training to employees.  \nFive-year accident history\n    In the past five years, there have been no releases that resulted in deaths or significant property damage o"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 3128,
      "SummaryText": "n site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\nEmergency response program\n        Due to the receipt, usage, and storage of Chlorine in large quantities, Wabash Alloys takes a proactive approach to the protection of its employees, the public, and the environment.  In consideration of the hazardous effects that Chlorine may have on human health and the environment the following outlines the facilities prevention and emergency response plans:\n    Written Emergency Response Plan\n    Offensively Trained & Equipped Emergency Action Team in accordance with 29 CFR 1910.120\n    Development of a Written Implementation Plan of Action\n    Conduction of Hazard Analysis on routine and periodic basis\n    Development of and documentation of safe work practices\n    Initial and periodic training of employees\n    Conduction of pre-startup safety reviews\n    Conduction of Compliance Audits\n    Conduction of incident investigations\n    Contractor Program Safety Program\n    Hot Work Permit Program\n    Process Safety Management & Chemical Accidental Release Prevention Committee\n    Mechanical Integrity & Preventive Maintenance Program\n    Determination and planning for Worst-Case and Alternative Case Release Scenarios\n    Continual evaluation for methods to improve facility safety - Safety Committee\n    Meetings with the Local Emergency Planning Committee and Fir Department\n\nPlanned changes to improve safety\n    In an attempt to insure a continual improvement in the facility worker protection and release prevention programs, training concerning this safety and environmental program and others is conducted for eight hours each month.  This training requires the attendance by all personnel whose job may have any relationship to the chlorine operations."
    }
  ]
}