{
  "FacilityID": 31378,
  "FacilityName": "Hasa Inc.- Pittsburg",
  "FacilityStr1": "1251 Loveridge Road",
  "FacilityStr2": null,
  "FacilityCity": "Pittsburg",
  "FacilityState": "CA",
  "FacilityZipCode": "94565",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06013",
  "LEPC": "Contra Costa C Health Services",
  "FacilityLatDecDegs": "38.018056",
  "FacilityLongDecDegs": "-121.854167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "hasainc@hasapool.com",
  "FacilityDUNS": 9656075,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Hasa Inc.",
  "OperatorStr1": "23119 Drayton Street",
  "OperatorStr2": null,
  "OperatorCity": "Saugus",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91350",
  "OperatorZipCodeExt": null,
  "FTE": 40,
  "OtherEPAFacilityID": "94565HSNC 1251L",
  "EPAFacilityID": "100000157386",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-03-21 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-11 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 38.018056,
  "FRS_Long": -121.854167,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 45539,
      "AltID": null,
      "FacilityID": 31378,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 60126,
          "ProcessID": 45539,
          "ChemicalID": 62,
          "Quantity": 180000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 46540,
          "ProcessID": 45539,
          "NAICSCode": "325188",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 26097,
              "Process_NAICS_ID": 46540,
              "SafetyReviewDate": "2004-04-16 00:00:00",
              "PHA_Date": "2004-04-16 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-11-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-05-07 00:00:00",
              "TrainingReviewDate": "2003-02-05 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-05-07 00:00:00",
              "EquipmentInspectionDate": "2004-04-13 00:00:00",
              "EquipmentTested": "Railcar air padding system, Railcar unloading system, Bleach Plant Module, Scrubber system, Chlorine sensor shutdown system",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2004-05-05 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2002-06-25 00:00:00",
              "AuditCompletionDate": "2002-06-26 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-05-06 00:00:00",
              "HotWorkPermitReviewDate": "2004-03-09 00:00:00",
              "ContractorSafetyReviewDate": "2004-05-06 00:00:00",
              "ContractorSafetyEvalDate": "2004-05-06 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 38142,
                  "PreventionProgram3ID": 26097,
                  "ProcessChemicalID": 60126
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 31378,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-04-05 00:00:00",
    "ERTrainingDate": "2003-10-03 00:00:00",
    "CoordinatingAgencyName": "Contra Costa County Health Services",
    "CoordinatingAgencyPhone": "9256462286",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 31378,
      "SummaryText": "Executive Summary - Risk Management Program (RMP)\n\nPittsburg Facility\n\n\nHasa manufactures sodium hypochlorite and distributes other chlorine-based disinfectants for protection of potable and waste water facilities; disinfection of sewage and waste water; disinfection of dairy premises and meat processing plants; bleaching and disinfection of laundry; disinfection of hospital operating rooms and related areas; egg cleaning and sanitization; washing solutions for fresh fruits and vegetables; and disinfection of water contained in swimming pools, spas, hydrotherapy tubs, and recreational water.  ¿Recreational water¿ is a relatively new term and includes water systems in amusement parks with water slides.  Sodium hypochlorite, commonly known as ¿bleach¿, is manufactured by reacting liquefied chlorine with dilute caustic solution under controlled conditions of temperature and pressure.\n\nAlong with many other segments of the American economy, Hasa recognizes there is a new reality, which requires a heightened level of vigilance and increased communication with law enforcement and security agencies.  Hasa has taken proactive measures to upgrade its security so that its products will continue to be manufactured, stored and transported in a manner that protects the public¿s health and safeguards our environment.\n\nChlorine has been part of our country¿s public health defenses for over 100 years.  As such, chlorine chemistry is part of nation¿s first line of defense against terrorism.  Chlorine-based disinfectants are used by 98% of modern water purification plants to kill bacteria and viruses.  This is an essential factor in delivering safe water to homes for drinking, cooking, and bathing.  On top of the every day protection, chlorine also effectively kills many potential biological warfare agents.  \n\nIn the event of a terrorist attack using an airborne biological warfare agent, bleach can be used to decontaminate surfaces subject to such attacks.  Chlorine chemistry is also"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 31378,
      "SummaryText": "indispensable to the manufacture of vinyl bags, which contain donated, bullet proof vests, and gas masks that are used by police officers and our troops in the field, as well as the safety gear that is employed daily by firefighters throughout the nation.\n\nHasa remains committed to the safe manufacture and distribution of its products that are essential to our economy, our way of life, and our national security needs.  Hasa supports policies designed to ensure that America¿s roads, skies, railways, and shipping remain as secure thoroughfares for commerce and travel.  Hasa is committed to doing its part in this time of national emergency to promote public safety and security, and we are working cooperatively with other industries and government agencies on these issues of critical importance.\n\nAs mentioned above, Hasa manufactures commercial, institutional, industrial, and household ¿bleach,¿ also known by the chemical name ¿sodium hypochlorite¿ by reacting liquefied chlorine with dilute caustic solution under controlled conditions.  Liquefied chlorine is the only material on-site, which is regulated under the California Accidental Release Prevention Program (CalARP) and California Occupational and Safety Health Administration Process Safety Management (Cal/OSHA PSM) programs. Hasa also repackages and distributes a variety of compounds for disinfection and treatment of potable and recreational water, wastewater, and sewage. \n\nPolicy\n\nHasa continuously evaluates its operations to ensure that the highest levels of safety, protection of human health, and protection of the environment have been attained. Hasa maintains a scientific and technical staff to meet these public and environmental needs. The facility has been constructed in accordance with nationally recognized standards of good practice.  Construction plans and comments were reviewed and approved by independent professional engineers, the City of Pittsburg, and Contra Costa County Fire Protection District prio"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 31378,
      "SummaryText": "r to commencement of operations in 1997. \n\nHistory of the Facility\n\nPrior to 1997, previous operators, Stauffer Chemical Company and Crossfield Chemical Company, both of which manufactured metasilicate cleaning compounds by reacting caustic soda with silica. Crossfield Chemical Company discontinued operations approximately five years before Hasa acquired the facility. During that time the plant was not in use.  \n\nHasa¿s first manufacturing facility opened in 1964 at Saugus, California.  Subsequently, Hasa expanded the business through acquisitions and construction of additional plants. Hasa acquired the swimming pool sodium hypochlorite manufacturing and distribution division of Purex and all operations of the GPS Division of All Pure Chemical Company, itself a division of Pioneer Chemical Company. The Purex and GPS operations were consolidated at the Saugus plant. Two new plants were constructed: the one in Eloy in 1982 (Phoenix area), Arizona; the other here in Pittsburg. The manufacture and unloading processes at all plants are essentially identical.  During the past forty years Hasa facilities have never experienced a chlorine release.\n\nThe liquefied chlorine unloading system and bleach manufacturing module at Saugus survived two major earthquakes with no structural damage or loss of contents: the one in Sylmar in 1972; the other with an epicenter in Northridge in 1994. The unloading system and bleach-manufacturing module survived the earthquakes without damage, and manufacture of sodium hypochlorite solutions was restarted without any system repair or modification after appropriate safety reviews.\n\n\n\n\n\nPittsburg Facility\n\nThe unloading system and bleach-manufacturing module at the Pittsburg facility are state-of-the-art installations with redundant active and passive mitigation safety controls in place. There are chlorine gas sensors located strategically throughout the facility. If chlorine gas is detected, an automatic fail-safe-to-close valve system immediat"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 31378,
      "SummaryText": "ely closes the valves on the railroad tank car, which contains chlorine. Hasa unloads millions of pounds of liquefied chlorine annually at the three sodium hypochlorite solutions manufacturing facilities. In the past forty years Hasa has unloaded more than 5,000 railroad tank cars containing liquefied chlorine without any loss of contents.\n\nRelationship of Federal and State RMP and PSM Requirements\n\nHasa is subject to both the Federal Risk Management Program (RMP) and the State CalARP programs, which have similar, but not identical regulatory requirements.\n\nPrevention Program\n\nHasa is subject to the Prevention Program 3.  The program consists of sections on Employee Participation, Process Safety Information ¿PSI¿, Process Hazard Analysis ¿PHA¿, Operating Procedures, Training, Outside Contractor Requirements, Pre-Start up Review ¿PSR¿, Mechanical Integrity, Hot Work Permits, Management of Change, Incident Investigation, Emergency Planning and Response, and Compliance Audits.\n\nEmergency Response\n\nHasa has in place an emergency response program in the event of a release of chlorine. Hasa HAZMAT employees are trained to respond to leakage in accordance with DOT requirements. Hasa has on site a Chlorine Institute Emergency Kit C, which contains fittings, hoods and devices to respond to and mitigate unlikely leaks from tank cars.\n\nPlanned Changes to Improve Safety\n\nHasa continually monitors and evaluates safety equipment and procedures.  At the present time there are no planed changes to improve safety or to change procedures, since the chlorine unloading system and bleach manufacturing module at the Pittsburg facility are already state-of-the-art installations with redundant active and passive mitigation safety controls in place.  Hasa may periodically replace pipe, piping, valves, motors, and related items with pipe, piping, valves, motors, and related items, which meet the original design specifications, i.e., are identical with the original items.  \n\nFive-Year Acciden"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 31378,
      "SummaryText": "t History\n\nHasa has experienced no releases of chlorine at the Pittsburg facility since production commenced in January 1997."
    }
  ]
}