{
  "FacilityID": 31566,
  "FacilityName": "OREGON WASTEWATER TREATMENT PLANT",
  "FacilityStr1": "4657 DUPONT ROAD",
  "FacilityStr2": null,
  "FacilityCity": "OREGON",
  "FacilityState": "OH",
  "FacilityZipCode": "43616",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39095",
  "LEPC": "Lucas County LEPC",
  "FacilityLatDecDegs": "41.681389",
  "FacilityLongDecDegs": "-083.439444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PF",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "CITY OF OREGON",
  "Company2Name": null,
  "CompanyDUNS": 20260287,
  "Company2DUNS": 0,
  "OperatorName": "CITY OF OREGON",
  "OperatorStr1": "4657 DUPONT ROAD",
  "OperatorStr2": null,
  "OperatorCity": "OREGON",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43616",
  "OperatorZipCodeExt": null,
  "FTE": 17,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000082876",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-03-25 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 41.68134,
  "FRS_Long": -83.44224,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 45782,
      "AltID": null,
      "FacilityID": 31566,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 60428,
          "ProcessID": 45782,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 46798,
          "ProcessID": 45782,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 26257,
              "Process_NAICS_ID": 46798,
              "SafetyReviewDate": "2004-04-21 00:00:00",
              "PHA_Date": "2004-05-05 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2005-04-15 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-04-28 00:00:00",
              "TrainingReviewDate": "2004-04-21 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-04-21 00:00:00",
              "EquipmentInspectionDate": "2004-04-01 00:00:00",
              "EquipmentTested": "Chlorinators, Vacuum Regulator, Piping and Valves, Injectors, Instrumentation, Alarms, Ventilation, Leak Detector, Weigh Scale, Monorail and Hoists.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2004-04-21 00:00:00",
              "PreStartupReviewDate": "1999-11-12 00:00:00",
              "ComplianceAuditDate": "2004-04-21 00:00:00",
              "AuditCompletionDate": "2007-05-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-04-21 00:00:00",
              "HotWorkPermitReviewDate": "2004-04-21 00:00:00",
              "ContractorSafetyReviewDate": "2004-04-21 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 38365,
                  "PreventionProgram3ID": 26257,
                  "ProcessChemicalID": 60428
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 31566,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "OREGON FIRE DEPARTMENT",
    "CoordinatingAgencyPhone": "4196987019",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 31566,
      "SummaryText": "EXECUTIVE SUMMARY\n\n     The Oregon Wastewater Treatment Plant is owned and operated by the City of Oregon, Ohio.  Oregon is located along the shores of Maumee Bay at the western end of Lake Erie.  The plant, which was built in 1977, is designed to treat eight million gallons of raw sewage daily, and as much as thirty-six million gallons per day during wet weather conditions. \n     The plant operates under a permit issued by the Ohio and United States Environmental Protection Agencies.  The permit requires that the plant remove 90% or greater of  the pollutants - biochemical oxygen demand and suspended solids.  The plant?s effluent must also meet quality standards for phosphorous, coliform bacteria, chlorine, and heavy metals before it may be discharged to Lake Erie.\nAs part of the purifying  process, Oregon uses chlorine to disinfect the treated water prior to discharging it to Maumee Bay.  Chlorine is a very good disinfecting agent, and has been used to help purify water for over one-hundred years.\n     Chlorine is also listed as a regulated toxic substance in  40 CFR Part 68 of the Clean Air Act. Because of this listing, the Oregon Wastewater Treatment Plant must develop and comply with  a Risk Management Plan (RMP).  Oregon?s plan was developed over an eight month period.  Included in the plan are sections dealing with Hazard Assessment, Prevention Program and Emergency Response Program.  \n\nHAZARD ASSESSMENT\n     The Hazard Assessment is made up of three parts; Worst Case Analysis, Alternative Release Analysis and a Five Year Accident History.\n     The Worst Case Analysis is a scenario which  supposes that there is a chlorine release from the plant, of extreme severity.  It assumes a one ton cylinder of chlorine is ruptured, outside, under the worst possible weather conditions.  This scenario also supposes that all two-thousand pounds of  chlorine are released  within a ten minute time period.  While performing the calculations for this scenario, it is assumed th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 31566,
      "SummaryText": "at none of the plants safety systems work and that there are no mitigating factors which could reduce the severity of the release.  It is truly the worst case scenario.\n     The Alternative Release Scenario  is a more realistic model of what could happen if there were a serious release of gas.  This model assumes that a leak develops in one of the chlorine gas lines, within the chlorine building, and allows sixty pounds of gas to be released to the atmosphere over a period of 30 minutes.\n     The Five Year Accident History  requires a listing of all accidents, involving the release of chlorine, which resulted in either death, injury, evacuation, property damage or environmental damage.  Oregon has an excellent safety record; there have been no reportable accidents within the last five years.\n\nPREVENTION PROGRAM\n     The most important part of the Risk Management Plan is the Prevention Program.  The Prevention Program consists of twelve elements, all designed to minimize the risk of an accidental release of chlorine.  The elements are as follows:\n     Process Safety Information is maintained at the plant.  Process Safety Information includes Material Safety Data Sheets,  records describing process flow, process chemistry, safe operating limits, maximum intended inventory, and detailed process design information.\n     A Process Hazard Analysis is performed at least once every five years. This provides an understanding of the process hazards and is performed using the generally accepted methodologies of What If or Checklist Analysis.\n     Operating Procedures are developed, implemented and maintained.  These include procedures for startup, shutdown, emergency, and temporary operations.\n     Training is provided for plant staff.  This includes formal initial and refresher training for all employees working with chlorine.  Included is instruction on the chlorine process, operating procedures, hazards, emergency response procedures and safe work practices.\n     Mechanical"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 31566,
      "SummaryText": " Integrity is an element which focuses on the maintenance,  preventive maintenance, inspection  and testing of equipment used in the chlorinating process.\n     Management of Change prevents incidents caused by changes in process chemicals, technology, equipment, or procedures.  It requires a fundamental examination of any change in the process.\n     Prestartup Reviews are performed on any new or newly revised  processes to ensure that equipment meets design specifications, all procedures and training have been implemented, and hazard analysis recommendations have been resolved.\n     Compliance Audits are performed at least once every three years to verify that Prevention Program elements are being effectively implemented.\n     Incident Investigations are performed on incidents which causes or could have caused an emergency situation.  \n     Employee Participation is a critical aspect of the Process Hazard Analysis and in implementing other elements of the Risk Management Program.\n     Hot Work Permits are used for authorizing welding and brazing activities in the chlorine building.\n     Contractors  are informed of the hazards of working around the chlorine facilities and are trained in emergency response.\n\nEMERGENCY RESPONSE PROGRAM\n     The Emergency Response element of RMP requires that facilities have a planned response that they can implement in the event of an accidental release of gas.  Oregon has had emergency response plans for many years.  In the event of an emergency, Oregon will work closely with the Fire Department, Police Department, and Local Emergency Planning Committee (LEPC).  Additionally, Oregon has mutual aid pacts with other local Fire Departments, and area industries which are equipped with highly trained Hazardous Chemical Spill Response Teams.\n     In addition to emergency response plans, Oregon has had emergency drills in the past and has plans for more drills in the near future.\n\nCOMMUNITY AWARENESS\n     Besides preparation of the Risk Man"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 31566,
      "SummaryText": "agement Plan, Oregon participated in a hazard communications group, consisting of area industries, who?s goal was to raise awareness about hazardous chemicals in the community.\n     Working under the auspices of the Local Emergency Planning Committee, the Group provided information to the community by developing and distributing various brochures dealing with specific industries, chemicals, and the LEPC.  Moreover, the Group reached out to the public hosting an informational dinner for elected area officials, and presenting community educational events at the local mall and a city festival.\nFinally, members of the Communications Group gave presentations to community groups and organizations in an effort to raise public awareness about this issue."
    }
  ]
}