{
  "FacilityID": 31596,
  "FacilityName": "Western Wisconsin Ag Supply",
  "FacilityStr1": "411 East Business Way",
  "FacilityStr2": null,
  "FacilityCity": "East Ellsworth",
  "FacilityState": "WI",
  "FacilityZipCode": "54011",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55093",
  "LEPC": "Pierce County LEPC",
  "FacilityLatDecDegs": "44.721000",
  "FacilityLongDecDegs": "-092.465278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.wwas.com",
  "FacilityEmailAddress": "www.as@agpartners.net",
  "FacilityDUNS": null,
  "ParentCompanyName": "Ag Partners Coop",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Mike Lansing",
  "OperatorStr1": "411 East Business Way",
  "OperatorStr2": null,
  "OperatorCity": "East Ellsworth",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54011",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000001614",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-10-10 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2024-05-29 00:00:00",
  "DeRegistrationEffectiveDate": "2024-05-01 00:00:00",
  "AnniversaryDate": "2009-06-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 44.725833,
  "FRS_Long": -92.459444,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 45814,
      "AltID": "Anhydrous Ammonia Storage",
      "FacilityID": 31596,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 60460,
          "ProcessID": 45814,
          "ChemicalID": 56,
          "Quantity": 140000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 46833,
          "ProcessID": 45814,
          "NAICSCode": "115116",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 17702,
              "Process_NAICS_ID": 46833,
              "SafetyReviewDate": "2002-12-19 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "Yes",
              "FR_ASTM": "Yes",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2002-12-19 00:00:00",
              "ChangeCompletionDate": "2003-01-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-12-19 00:00:00",
              "TrainingReviewDate": "2004-03-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-12-19 00:00:00",
              "EquipmentInspectionDate": "2002-12-19 00:00:00",
              "EquipmentTested": "Pre-fill Inspection completed",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 18470,
                  "PreventionProgram2ID": 17702,
                  "ProcessChemicalID": 60460
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 31596,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2002-12-19 00:00:00",
    "ERTrainingDate": "2004-03-30 00:00:00",
    "CoordinatingAgencyName": "Pierce County LEPC",
    "CoordinatingAgencyPhone": "7153864719",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 31596,
      "SummaryText": "General Executive Summary for Western Wisconsin Ag Supply\n1.Accidental Release Prevention and Emergency Response Policies\nWe at Western Wisconsin Ag Supply are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n2.The Stationary Source and the Regulated Substances Handled\nOur facility¿s primary activities encompass Storage and dispensing of Anhydrous Ammonia for Agricultural purposes.  We have 1 regulated substances present at our facility.  This substance is  Ammonia (anhydrous).  \n\n3.The Worst Case Release Scenario and the Alternative Release Scenario, including administrative controls and mitigation measures to limit the distances for each reported scenario\nTo evaluate the worst case scenario and alternative release scenario, we have used information provided by the EPA.  Scenarios were computed for Anhydrous Ammonia using the RMP Comp program.  Data inputted into the RMP Comp program was based on EPA¿s RMP requirments.  The following paragraphs provide details of the chosen scenarios.\nThe worst case release scenario submitted for Program 2  toxic substances as a class involves a catastrophic release of Anhydrous Ammonia from the bulk storage tank.  In this scenario 140000 lb. of Ammonia (anhydrous) is released.  The anhydrous ammonia released is in a gaseous form over a 10 minute release period.  The release is assumed to take place in conditions which include, class F atmoshpheric stability and 1.5 m/s windspeed.  The RMP Comp results for Anhydrous Ammonia are a maximum distance to endpoint of 5.6 miles corresponding to a toxic endpoint of 200ppm (0.14 mg/l).\nThe alternative release scenario for Ammonia"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 31596,
      "SummaryText": "(anhydrous) involves a release from Anhydrous Ammonia Storage Tank.  The scenario involves the release of 14000 lb. of Anhydrous Ammonia in a gaseous form averaged over 10 minutes from a break in a pipe leading from or to the Anhydrous Ammonia storage tank.  It is assumed that the pipe leaks for10 minutes before automatic or manual intervention stops the flow of ammonia.  Using a windspeed of 3 meters per second and stability class DRMP Comp concludes the maximum distance to endpoint of 0.9 miles corresponding to a toxic  endpoint of 200ppm (0.14mg/l).\n4.The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.    The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\nProcess Safety Information\nWestern Wisconsin Ag Supply maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  Industry standard methodology is used to complete the hazard analysis.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of at lest every 5 years or if any significant process changes occur.  Any findings related to the hazard analysis are addressed in a timely manner. \nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Western Wisconsin Ag Supply maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 31596,
      "SummaryText": ", emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\nTraining\nWestern Wisconsin Ag Supply has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least annually and more frequently as needed.\nMechanical Integrity\nWestern Wisconsin Ag Supply carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\nManagement of Change\nWritten procedures are in place at Western Wisconsin Ag Supply to manage changes in process chemicals, technology, equipment and procedures.   Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Western Wisconsin Ag Supply.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\nCompliance Audits\nWestern Wisconsin Ag Supply conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being impl"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 31596,
      "SummaryText": "emented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\nIncident Investigation\nWestern Wisconsin Ag Supply promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\nEmployee Participation\nWestern Wisconsin Ag Supply truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility¿s implementation of the RMP rule, including information resulting from process hazard analyses in particular.\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Western Wisconsin Ag Supply has a strict policy of informing the contractors of known potential hazards related the contractor¿s work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n5.Five-year Accident History\nWestern Wisconsin Ag Supply has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n6.Emergency Response Plan\nWestern Wisconsin Ag Supply carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 31596,
      "SummaryText": "of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\nHudson WI/Jack Colvard director is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n7.Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Annual tank inspections, annual employee training and industry standard updates are some of the major steps we have taken to improve safety at our facility."
    }
  ]
}