{
  "FacilityID": 31604,
  "FacilityName": "James W. Jardine Water Purification Plant (JWPP)",
  "FacilityStr1": "1000 East Ohio Street",
  "FacilityStr2": null,
  "FacilityCity": "Chicago",
  "FacilityState": "IL",
  "FacilityZipCode": "60611",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17031",
  "LEPC": "Chicago Department of Fire",
  "FacilityLatDecDegs": "41.893333",
  "FacilityLongDecDegs": "-087.605833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "LF",
  "FacilityURL": "http://www.cityofchicago.org/watermanagement",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 119500346,
  "ParentCompanyName": "City of Chicago Department of Water Management",
  "Company2Name": null,
  "CompanyDUNS": 1749605,
  "Company2DUNS": 0,
  "OperatorName": "Chicago Dept. of Water Management",
  "OperatorStr1": "1000 East Ohio Street",
  "OperatorStr2": null,
  "OperatorCity": "Chicago",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60611",
  "OperatorZipCodeExt": null,
  "FTE": 400,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000045505",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-26 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-08-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 41.89336,
  "FRS_Long": -87.60933,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 45822,
      "AltID": "Chlorine Process - CP1",
      "FacilityID": 31604,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 60468,
          "ProcessID": 45822,
          "ChemicalID": 62,
          "Quantity": 308000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 46841,
          "ProcessID": 45822,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 17708,
              "Process_NAICS_ID": 46841,
              "SafetyReviewDate": "2003-01-07 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2002-05-02 00:00:00",
              "ChangeCompletionDate": "2002-05-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-01-07 00:00:00",
              "TrainingReviewDate": "2003-01-07 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-01-07 00:00:00",
              "EquipmentInspectionDate": "2004-06-15 00:00:00",
              "EquipmentTested": "Chlorine equipment is inspected daily before new containers are placed in service and on a regular basis in accordance with OEM recommendations.",
              "ComplianceAuditDate": "2003-01-07 00:00:00",
              "AuditCompletionDate": "2004-06-21 00:00:00",
              "IncidentInvestigationDate": "2001-01-02 00:00:00",
              "InvestigationChangeDate": "2001-05-02 00:00:00",
              "MostRecentChangeDate": "2004-02-06 00:00:00",
              "CBI_Flag": 0,
              "Description": "Processes not eligible for Program 1 (processes with no public receptors within the distance to an endpoint from a worst-case release and with no accidents with specific offsite consequences within the past five years) or subject to Program 3 (any process not eligible for Program 1 and subject to OSHA PSM regulations) are designated as Program 2, which imposes limited hazard assessment requirements and minimal prevention and emergency response requirements.  USEPA developed the Program 2 Prevention program by identifying the basic elements that are the foundation of sound prevention practices - safety information, hazard review, operating procedures, training, maintenance, compliance audits and incident investigation.  \n\nJWPP is a municipal organization not subject to OSHA regulation.   However, JWPP has implemented a program that is similar to an OSHA Process Safety Management (PSM) program for the chlorine process.  The implementation of the program includes employee education in the hazards of chlorine and measures (such as process safety information, hazard analysis and regular training) that can reduce employee and community exposure to chlorine releases.  The plan includes a regular preventive maintenance program (mechanical integrity) for the chlorine system components, and a program for both pre-startup safety reviews and management of changes to the chlorine system.  The program also includes operating procedures for the safe operation of the system, specific requirements for safe work practices (such as safe approaches to welding and similar hot work), and safety requirements for contractors who may be hired to work on the system.  The plant has a procedure in place for investigating incidents to ensure root causes are identified and corrective actions are taken to minimize the potential for recurrence of incidents.  The program also has a procedure for conducting compliance audits to ensure that it (the program) is properly implemented at the facility.  The written program incorporates the facility's emergency response plan and places special emphasis on handling releases of chlorine and coordination of emergency response with the Local Emergency Planning Committee, which is the City of Chicago Department of Fire.  \n\nThe JWPP program for safely managing the chlorine feed process adequately satisfies all the requirements of the Program 2 Prevention program.  Further details may be made available to appropriate entities on written request.",
              "_chemicals": [
                {
                  "PrimaryKey": 18476,
                  "PreventionProgram2ID": 17708,
                  "ProcessChemicalID": 60468
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 31604,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-01-21 00:00:00",
    "ERTrainingDate": "2004-04-23 00:00:00",
    "CoordinatingAgencyName": "City of Chicago Department of Fire",
    "CoordinatingAgencyPhone": "3127477247",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 31604,
      "SummaryText": "CHLORINE RISK MANAGEMENT PROGRAM (RMP)\nCITY OF CHICAGO\nDEPARTMENT OF WATER\n\nJames W. Jardine Water Purification Plant (JWPP)\nJune 21, 2004\n\nEXECUTIVE SUMMARY\n\nIntroduction\n\nThe James W. Jardine Water Purification Plant (JWPP) treats water to potable drinking standards for the City of Chicago and many surrounding communities.  The plant uses chlorine to disinfect water from Lake Michigan and stores more than the threshold quantity of 2,500 lbs of chlorine onsite.  The disinfection process is the only process at JWPP subject to United States Environmental Protection Agency (USEPA) Risk Management Program (RMP) regulations codified in 40CFR Part 68.  Chlorine is an easily liquefiable greenish-yellow gas with a pungent, irritating odor.  It is listed by the USEPA as a regulated toxic substance for release prevention.  Chlorine is safe to use as a disinfectant for drinking water under regular plant conditions when handled with appropriate care.\n\nJWPP Chlorine Process\n\nLiquid chlorine is trucked to the plant site in 1-ton (2,000 lbs) pressurized containers by an outside vendor.  The containers are unloaded and stored in an enclosed area prior to use.  Liquefied chlorine in the individual containers is changed to gas-phase chlorine with evaporators.  Chlorine gas is mixed with water at individual application points for disinfection as part of the water treatment process.\n\nJWPP Release Prevention and Emergency Response Policy\n\nThe City of Chicago Department of Water Management (CDWM) in concert with JWPP management is committed to manage and operate the plant in accordance with relevant USEPA regulations and general good operating practices to ensure minimum risk of a chlorine release from the disinfection process.  The CDWM has voluntarily implemented a Process Safety Management (PSM) program, similar to the Occupational Safety and Health Administration (OSHA) PSM plan, for the JWPP chlorine process although it is not explicitly subject to this federal program.  In order t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 31604,
      "SummaryText": "o ensure periodic monitoring and continual evaluation of the RMP / PSM program elements being implemented at the plant, the CDWM has instituted an emergency response (ER) organizational structure within the Department and JWPP.  Along with their regular duties, members of this structure have additional RMP / PSM-related responsibilities for the long-term management of the RMP / PSM program.\n\nWorst-case Release Scenario\n\nAs required by USEPA regulations, the worst-case release scenario was assumed to be the complete loss of the contents of a 1-ton chlorine container during unloading operations that are performed in an enclosed receiving area adjoining the plant structure.  In this analysis no passive mitigation measures were assumed.  The USEPA guidance for defining a worst-case release scenario for unmitigated release of gas is to estimate the release rate over a 10-minute period of the largest quantity resulting from a pipe or vessel failure.  Thus, the chlorine emission rate from the worst-case release scenario used was the loss of 2,000 lbs of chlorine averaged over a 10-minute period, i.e., 200 lbs/min.  USEPA?s public-domain RMP*Comp model was used to determine the distance to the toxic endpoint of 0.0087 mg/l (or 3 ppm).  The toxic endpoint distance does go offsite.  It should be noted that the potential offsite impact due to a release is greatly minimized on account of the location of JWPP which is bounded by Lake Michigan on the north and east.  Since almost 75 percent of the area within the circle of influence, defined by the distance to the toxic endpoint as the radius, is over Lake Michigan, potential offsite impacts are greatly reduced.\n\nJWPP employees thoroughly inspect every chlorine container for potential leaks and overall structural integrity upon delivery and prior to process hookup.  Chlorine sensors and a system of emergency alarms at strategic locations around the chlorine process initiate the emergency response procedures (i.e., release abateme"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 31604,
      "SummaryText": "nt and evacuation) that includes activation of the emergency caustic scrubbers to neutralize potential chlorine releases.  This minimizes the chance that a container will fully discharge its contents in a release and minimizes the potential for an offsite impact.\n\nAlternative Release Scenario\n\nThe following three most likely alternative scenarios (ranked in order of probability of occurrence) were identified:\n      Case (1): Container valve failure;\n      Case (2): Shear of pigtail containing liquid chlorine; and\n      Case (3): Over-pressurization of rupture disk\n\nThe above alternative releases were modeled using USEPA?s public-domain RMP*Comp model to determine the maximum distance to the toxic endpoint of 0.0087 mg/l (or 3 ppm).  Effects of both passive mitigation (due to the building enclosure) and active mitigation afforded by the JWPP emergency caustic scrubber system were included in the analysis.  The maximum toxic endpoint distance does go offsite, but only by a few hundred feet.  It should be noted that any potential offsite impact due to a release is greatly minimized due to JWPP?s location, which is bounded by Lake Michigan on the north and east.\n\nAs noted above, JWPP employees thoroughly inspect every connection from the chlorine container to the liquid piping for potential leaks and overall structural integrity prior to hookup.  In addition, JWPP has regular operation and maintenance procedures for evaluating and replacing, if required, container valves and rupture disks.  Also, the plant has chlorine sensors and a system of emergency alarms at strategic locations around the chlorine process that initiate the emergency response procedures (i.e., release abatement and evacuation) that include activation of the emergency caustic scrubbers to neutralize potential chlorine releases.  This minimizes the chance for a discharge of quantities of chlorine which could result in an offsite impact.\n\nRelease Prevention Program\n\nJWPP is a municipal organization not "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 31604,
      "SummaryText": "subject to OSHA regulations.  However, JWPP has implemented a safety management program for the chlorine process similar to an OSHA Process Safety Management (PSM) program (codified in 29CFR Part 1910.119).  The scope of the PSM program encompasses various facets of release prevention; e.g., it engenders employee participation, increases employee awareness about the hazards of handling chlorine, establishes safe standard operating procedures and enhances access to process safety information.  In December 1998, JWPP performed a PSM audit and a HAZOP process hazards analysis (PHA) on the chlorine system with the help of outside consultants in order to review existing operating procedures, equipment maintenance schedules, operational safeguards and identify action items to render the process safer.  Following the PHA, JWPP developed a written PSM program along with an updated O&M (Operations and Maintenance) Manual with the help of outside consultants.  The written PSM program provides the procedural backbone for safe operability functions (i.e., continual review of safe operating procedures, review of mechanical integrity of equipment, improved maintenance schedules, increased training, better access to process safety information and hazard awareness for both employees and onsite contractors, and effective emergency response planning), and allows JWPP to maintain, review and evaluate the program on a periodic basis.\n\nThe CDWM completed a major upgrade of the JWPP chlorine system equipment piping and safety system in 2001.  New redundant equipment and piping were installed to allow frequent inspections and maintenance of the system. The entire chlorine process area, including storage and unloading areas are now enclosed to contain leaks.  A new automated chlorine scrubber system was installed to neutralize potential leaks.  These system upgrades complement the organizational and procedural aspects of the prevention program and minimize the risk of release of chlorine f"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 31604,
      "SummaryText": "rom the JWPP process.\n\nFive-year Accident History\n\nJWPP has been operational since 1964.  Since that date there have been no serious onsite injuries, no offsite injuries and no offsite environmental damage due to a chlorine release.  No releases have occurred in the five year period since the last Risk Management Plan submittal in June 1999.\n\n\nEmergency Response Program\n\nSince JWPP has adopted the safe management practices similar to the OSHA PSM program, the plant has updated existing procedures for Emergency Planning and Response to conform to applicable PSM regulations.  JWPP has adapted the PSM Emergency Response Plan so that it also satisfies RMP Part 68 requirements.  \n\nJWPP has a well delineated emergency response (ER) organization under the command of the emergency response coordinator (ERC) with a set of clearly defined responsibilities and procedures for ER team members.  ER team members are regularly evaluated, receive updated training and conduct practice emergency response drills.  Besides onsite training and practice, ER team members are responsible for coordinating emergency response activities (e.g., agency notifications) with local emergency responders such as the Chicago Fire Department, Illinois Emergency Management Agency (IEMA) and the National Response Center (NRC) through established channels of communication.  The Emergency Response Plan contains detailed notification procedures to be followed by ER team members.\n\nJWPP has detailed onsite evacuation procedures customized for the plant in the event of a release of chlorine.  JWPP is equipped with appropriate emergency response equipment in readiness for immediate application.  The Local Emergency Planning Committee (i.e., the Chicago Fire Department) is responsible for addressing all offsite emergency activities. \n\nThe City of Chicago Department of Water Management (CDWM) and JWPP management are committed to supporting the emergency response (ER) organization and its prescribed functions.  ER "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 31604,
      "SummaryText": "team members are drawn from the existing employee pool and the organizational concept fosters pride and emphasizes concerns for safe operation of the plant.  The well defined ER organization at JWPP operating in conjunction with the Chicago Fire Department alleviates safety concerns about handling chlorine at the plant.\n\nChanges to Improve Safety\n\nAs discussed above, the CDWM has recently completed a major upgrade of the chlorine system equipment piping and safety system and modifications to the plant wide communication systems.  New redundant equipment and piping have been installed to allow frequent inspections and maintenance of the system.  The entire chlorine process area, including storage and receiving areas have been enclosed to contain chlorine leaks.  New automated chlorine scrubber systems were installed to neutralize potential chlorine leaks.  Thus, in addition to new and improved training and organizational changes, upgrades to the chlorine system demonstrate the commitment to safety that the CDWM has made to both plant employees and the surrounding community."
    }
  ]
}