{
  "FacilityID": 31620,
  "FacilityName": "Dallas County Park Cities MUD Treatment Plant",
  "FacilityStr1": "1811 Regal Row",
  "FacilityStr2": null,
  "FacilityCity": "Dalllas",
  "FacilityState": "TX",
  "FacilityZipCode": "75235",
  "Facility4DigitZipExt": "2398",
  "FacilityCountyFIPS": "48113",
  "LEPC": "Dallas County LEPC",
  "FacilityLatDecDegs": "32.838611",
  "FacilityLongDecDegs": "-096.870556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 10494870,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 10494870,
  "Company2DUNS": 0,
  "OperatorName": "Dallas County Park Cities MUD",
  "OperatorStr1": "1811 Regal Row",
  "OperatorStr2": null,
  "OperatorCity": "Dalllas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75235",
  "OperatorZipCodeExt": "2398",
  "RMPContact": "Larry McDaniel",
  "RMPTitle": "General Manager",
  "FTE": 23,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000004345",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-08-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-06-26 00:00:00",
  "DeRegistrationEffectiveDate": "2006-06-01 00:00:00",
  "AnniversaryDate": "2009-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 32.83681,
  "FRS_Long": -96.87102,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 45858,
      "AltID": null,
      "FacilityID": 31620,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 46877,
          "ProcessID": 45858,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 60557,
          "ProcessID": 45858,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 560557,
          "ProcessID": 45858,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 31620,
      "SummaryText": "EXECUTIVE SUMMARY\n\nDALLAS COUNTY PARK CITIES MUD\nRISK MANAGEMENT PROGRAM\n\nINTRODUCTION\n\nThis document and the accompanying appendices contain all required information to update the June, 1999, Dallas County Park Cities Municipal Utility District?s (DCPC MUD?s) Risk Management Plan (RMP).  This complies with provisions of 40 CFR 68 and includes an Executive Summary, RMP Data Elements, and Certification Statement (68.155 through 68.185).  Supporting documentation can be found in the appendices of this plan.\n\n\nEXECUTIVE SUMMARY\n\n1.0 RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe DCPC MUD facility in Dallas, Texas has an excellent record in preventing and minimizing releases of chlorine.  This facility has a thorough emergency training program for on-site emergency responders.\n\nThe emergency response policies at this facility ensure that there is emergency response coverage 24 hours per day, 7 days per week.  There are also adequate provisions for coordination with outside agencies, such as with the Dallas County Fire Department, in the event of an emergency.  More detailed information can be found on the facility?s emergency response program in Appendix D.\n\n\n2.0 PROCESS DESCRIPTION AND REGULATED SUBSTANCES\n\nAt this location the DCPC MUD treats water for the cities of Highland Park and University Park, Texas.  The SIC code for the primary process at this facility is 4941.  The plant is equipped for raw water intake, treating, storing, and distributing the treated water.\n\nDCPC MUD has one regulated substance under 40 CFR 68, chlorine, at this location.  Chlorine is used as a disinfectant in the treating of water.  The chlorine threshold for triggering applicability to 40 CFR 68 is 2,500 pounds.  The maximum quantity of chlorine stored on-site is 24,000 pounds.  Thus, 40 CFR 68 is applicable to the PCMUD water treatment facility.  More detailed information on system specifics can be found in Appendix C.\n\n3.0 WORST CASE AND ALTERNATIVE RELEASE SCENARIOS\n\nA worst-c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 31620,
      "SummaryText": "ase and an alternative case release scenario were developed for this update.  However, in accordance with guidance provided in EPA?s April 9, 2004, regulation modifications for 2004 RMP updates, this information is intentionally omitted from this Executive Summary.\n\n\n4.0 GENERAL ACCIDENTAL RELEASE PRECAUTION PROGRAM\n\nThe DCPC MUD facility carries out consistent operation and maintenance of its chlorine equipment utilizing only fully trained personnel in this area.  DCPC MUD management enforces consistent operation through use of discipline for operational deviations.\n\n5.0 FIVE-YEAR ACCIDENT HISTORY\n\nThe review of this facility?s accident history includes the following range of dates: June 1, 1999 through June 1, 2004.  During this time, no accidental releases of chlorine have occurred resulting in offsite consequences or injury to any of the facility?s personnel or equipment.\n\nIn accordance with EPA?s April 9, 2004, regulation modifications for 2004 RMP updates, new requirements for updating RMPs following a reportable chlorine release are now in place.  New policies have been developed by DCPC MUD that will cause a resubmission of the RMP within six months of the occurrence of a reportable chlorine release.\n\n\n6.0 EMERGENCY RESPONSE PROGRAM\n\nAs mentioned earlier, this facility has developed an Emergency Response Program in which plant employees are divided into various management and response teams.  There are 5 in-plant contacts for a type of emergency found in the Emergency Response Plan (Appendix D).  There are also back-up personnel in the event that the primary incident response personnel cannot be contacted.  The emergency response plan includes information about the frequency of employee emergency response training as well as a detailed description of the training content.  There are also specific procedures to follow in the event of a chlorine emergency.\n\nAt the discretion of the Incident Commander, the Dallas County Fire Department and the LEPC will be call"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 31620,
      "SummaryText": "ed to provide back-up emergency responders and equipment. Additionally, DCPC MUD management at its discretion will contact a local emergency response firm designated in its Emergency Response Plan in the event of a chlorine emergency, when warranted by management.\n\nIn accordance with EPA?s April 9, 2004, regulation modifications for 2004 RMP updates, new requirements emergency response contacts are now in place.  New policies have been developed by DCPC MUD that will cause a correction submission for the RMP for any emergency contact phone numbers that change within 30 days of the contact change.\n\n\n7.0 PLANNED CHANGES TO IMPROVE SAFETY\n\nBased on the hazard review and prevention evaluation completed for chlorine a list of action items was developed and is being considered by DCPC MUD management to determine if implementation is to be accomplished.  The most notable planned changes include possible conversion to a non-gaseous form of chlorine."
    }
  ]
}