{
  "FacilityID": 31701,
  "FacilityName": "AIR LIQUIDE AMERICA, LP",
  "FacilityStr1": "19 STEEL ROAD WEST",
  "FacilityStr2": null,
  "FacilityCity": "MORRISVILLE",
  "FacilityState": "PA",
  "FacilityZipCode": "19067",
  "Facility4DigitZipExt": "3615",
  "FacilityCountyFIPS": "42017",
  "LEPC": "Bucks County LEPC",
  "FacilityLatDecDegs": "40.175500",
  "FacilityLongDecDegs": "-074.769722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "P1",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 3312600,
  "Company2DUNS": 0,
  "OperatorName": "AIR LIQUIDE AMERICA, LP",
  "OperatorStr1": "19 STEEL ROAD WEST",
  "OperatorStr2": null,
  "OperatorCity": "MORRISVILLE",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19067",
  "OperatorZipCodeExt": "3615",
  "RMPContact": "JOHN BORZIO",
  "RMPTitle": "PLANT MANAGER",
  "FTE": 35,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000131038",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "OP-09-0126",
  "SafetyInspectionDate": "2003-09-25 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 40.17598,
  "FRS_Long": -74.76685,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 45943,
      "AltID": "SILANE SYSTEM",
      "FacilityID": 31701,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 46964,
          "ProcessID": 45943,
          "NAICSCode": "32512",
          "_desc": {
            "NAICS_CODE": "32512",
            "NAICS_DESCRIPTION": "Industrial Gas Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 60645,
          "ProcessID": 45943,
          "ChemicalID": 152,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 152,
            "ChemicalName": "Silane",
            "CASNumber": "7803-62-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 560645,
          "ProcessID": 45943,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 45944,
      "AltID": "HYDROGEN CHLORIDE SYSTEM",
      "FacilityID": 31701,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 46965,
          "ProcessID": 45944,
          "NAICSCode": "32512",
          "_desc": {
            "NAICS_CODE": "32512",
            "NAICS_DESCRIPTION": "Industrial Gas Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 60646,
          "ProcessID": 45944,
          "ChemicalID": 54,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 54,
            "ChemicalName": "Hydrogen chloride (anhydrous) [Hydrochloric acid]",
            "CASNumber": "7647-01-0",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 560646,
          "ProcessID": 45944,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 45945,
      "AltID": "CHLORINE  SYSTEM",
      "FacilityID": 31701,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 46966,
          "ProcessID": 45945,
          "NAICSCode": "32512",
          "_desc": {
            "NAICS_CODE": "32512",
            "NAICS_DESCRIPTION": "Industrial Gas Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 60647,
          "ProcessID": 45945,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 560647,
          "ProcessID": 45945,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 31701,
      "SummaryText": "The following details the prevention and emergency response plans and policies for Air Liquide America L.P. and its Morrisville, PA. plant location.\n\nAIR LIQUIDE ? CORPORATE RESPONSE PLANS AND POLICIES\n\nThe Air Liquide Morrisville, PA plant is part of  Air Liquide America LP which is headquartered in Houston, Texas.\n\nSafety is Air Liquide?s primary concern. Safety for its employees and safety for the chemicals that it handles. Air Liquide is a member of the American Chemistry Council (ACC) with a commitment to meet all the code requirements of the Responsible Care Program.  The corporation supports its own nationwide Emergency Response Program with trained responders strategically positioned in all parts of the United States to respond to chemical emergencies. Air Liquide is also a member of COMPGEAP. This organization combines the response resources of many companies across the United States should a member company need a assistance in an emergency situation.\n\nAir Liquide is also a member of the Compressed Gas Association (CGA) . CGA is an organization recognized worldwide for its primary mission of safety in the compressed gas industry. Air Liquide actively participates in many of the CGA specialized committees and functions that CGA conducts\n\nAIR LIQUIDE  - MORRISVILLE, PA PLANS AND POLICIES\n\nThe Air Liquide Morrisville, PA plant adheres to the corporate safety policies and has supplemented these policies with their own local policies, programs, and procedures to ensure the highest level of safety is maintained within its operations.\n\nThe Air Liquide Morrisville, PA plant `s primary activity is the filling of compressed gas cylinders with a variety of different products. Some of these products are very familiar to the public. Helium, carbon dioxide, and oxygen are a few examples of products well known by the public. The properties of products filled at the Morrisville Plant range from non-reactive and non-toxic to highly reactive and highly toxic. The products th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 31701,
      "SummaryText": "at fall under RMP reporting requirements and are used at the Morrisville Plant are chlorine, hydrogen chloride, and silane.\n\nThe Morrisville plant?s primary activity is to fill product ( liquefied and non-liquefied compressed gases) from a bulk source into compressed gas cylinders. This type of activity is commonly referred to as repackaging. Therefore the Morrisville Plant?s activity is described as a  ?re-packager of compressed gases?.  \n\nThe Morrisville plant location fully supports the Responsible Care Program that Air Liquide has endorsed.\n\nThe Morrisville location maintains its own team of emergency responders to handle emergencies both on property as well as off property which includes customer sites. The ER team utilizes a fully equipped trailer that can be sent for emergencies outside the plant. On plant property a stand ? alone building has been designated as a command post center where ER equipment is stored and emergencies can be addressed. It also includes all the key contact information to communicate to outside agencies and local authorities.\n\nThe Morrisville Plant also has an Off ? Site Emergency Response Plan that is approved annually by the Local Emergency Planning Committee (LEPC). The plan details the essential actions to take should an emergency occur. \n\nThe Morrisville plant is also subject to the requirements of OHSA?s Process Safety Management (PSM) Program that calls for Hazardous Communication training for each employee. Other key elements of the PSM Program that the Morrisville plant utilizes are Management of Change and Pre Startup Safety Reviews.\n\nThe Morrisville Plant is also an active member of the local Community Mutual Aid Committee. This organization is comprised of local chemical companies and emergency service groups in the area such as the LEPC, fire departments, hospitals, and first aid squads. This organization provides a way to maintain communication between the groups and brings all members up to date on regulatory changes, l"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 31701,
      "SummaryText": "ocal issues, and updates in emergency response techniques and equipment. Included in the organization?s activities is an annual emergency response scenario drill that allows members to utilize their training. The scenario is followed with a critique of the event.\n\nThe Morrisville Plant has been ISO 9002 certified since 1994. It has been recently certied to the updated version of this standard called ISO 9001/ 2000. This is a certification of the quality system by an independent third party auditor which is performed on an annual basis. Key elements that must be adhered to with this standard and also directly enhance the safety performance of the plant include document control, training, calibration of process equipment, and traceability of product.\n\nCorporate headquarters recently conducted a Security Vulnerability Assessment Audit of the Morrisville Plant to ensure it has the appropriate security safeguards in place. An action plan was developed from the audit results to enhance the plant security and all these actions have been completed.\n\nThe Morrisville has had no reportable  accidental releases for the last 5 years. In addition, there has never been a lost time accident since the plant opened in 1990. \n\nThe Morrisville plant maintains an MSDS for all chemicals handled at the location. Employee training on product knowledge is accomplished through MSDS reviews, specific process training sessions, monthly safety meetings, and the review of standard operating procedures. All training is documented and tracked per the ISO 9001/ 2000 Standard and Hazardous Communication Program requirements.\n\nStandard operating procedures specify stringent leak testing  of cylinders and process systems. These leak tests include the use of a helium mass spec leak detector capable of seeing leaks beyond the ability of the human eye. This ensures that product will not be accidently released once it is introduced into a system or package.\n\nSafety teams comprised of Morrisville personnel"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 31701,
      "SummaryText": "  perform monthly safety inspections. Items noted for correction are documented and tracked and must be completed within a specific time frame depending on the severity level of the item noted."
    }
  ]
}