{
  "FacilityID": 31726,
  "FacilityName": "Cacique, Inc.",
  "FacilityStr1": "14940 Proctor Ave.",
  "FacilityStr2": null,
  "FacilityCity": "City of Industry",
  "FacilityState": "CA",
  "FacilityZipCode": "91746",
  "Facility4DigitZipExt": "3219",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.027424",
  "FacilityLongDecDegs": "-117.972107",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 70936554,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Gilbert L. De Cardenas",
  "OperatorStr1": "P.O. Box 91270",
  "OperatorStr2": null,
  "OperatorCity": "City of Industry",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91715",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Clement",
  "RMPTitle": "General Manager",
  "FTE": 215,
  "OtherEPAFacilityID": "019999003297",
  "EPAFacilityID": "100000057626",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-11 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 34.02816,
  "FRS_Long": -117.97154,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 45991,
      "AltID": "Cheese Manufacturer",
      "FacilityID": 31726,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 47013,
          "ProcessID": 45991,
          "NAICSCode": "311513",
          "_desc": {
            "NAICS_CODE": "311513",
            "NAICS_DESCRIPTION": "Cheese Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 60701,
          "ProcessID": 45991,
          "ChemicalID": 56,
          "Quantity": 19000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 560701,
          "ProcessID": 45991,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 31726,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nCacique, Inc. employs one refrigeration system for cheese processing and chilled storage.  Cacique, Inc.?s senior management is not only committed to offer a superior service but to also maintain a safety and environmental program to promote a safe environment for all its employees and the surrounding communities.  Cacique, Inc.?s safety and environmental policies are administered by the General Manager.  These programs include hazard communications, lockout/tagout, Hazardous Materials Emergency Business Plan, employee safety manuals, manufacturers documentation, Emergency Action Plan, as well as the Risk Management Plan.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Cacique, Inc. facility is located at 14940 Proctor Avenue in the City of Industry, California, which is approximately 1.5 miles north of the CA-60 Freeway.  The facility and the refrigeration system began operation in 1962.  The area immediately surrounding the facility is urban.\n\nThe primary business of Cacique, Inc. is the production of cheese.  In order to conduct operations, the facility maintains a refrigeration system containing approximately 19,000 pounds of anhydrous ammonia, a regulated substance.  The refrigeration system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, and then back to high pressure liquid) in order to provide refrigeration for cheese processing and chilled storage.  Typical operating conditions range from 23 psig on the low pressure side of the system to 160 psig on the high side of the system.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nIn order to operate the ammonia refrigeration system, the facility complies with the following risk management regulations:\n\n1) OSHA's Process Safety Management (PSM);\n2) EPA's Risk Management Program (RMP); and\n3)"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 31726,
      "SummaryText": " OES California Accidental Release Prevention (CalARP) Program.\n\nThese regulations impose numerous requirements on the facility to ensure the safety of the public and on-site workers.  The following summarizes the key compliance programs that have been implemented by Cacique, Inc. to prevent the accidental release of ammonia from the facility.  The Operating Procedures program ensures that the ammonia system is operated in a safe manner.  The Training program ensures that personnel fully understand how to perform their jobs in a safe manner.  The Mechanical Integrity program ensures that the ammonia system is in proper working condition based upon routine testing, inspections, and maintenance according to manufacturer's specifications and industry standards.  The Management of Change program ensures that process modifications are implemented in a safe manner.  The Pre-Startup Safety Review program ensures that adequate safety measures are in place before ammonia is introduced into a process.  The Hot Work Permit program ensures that Cacique, Inc. 's employees and contractors perform hot work (e.g. welding) in a safe manner.  The Contractor Safety program ensures that contractors understand the hazards of ammonia and must take specified precautions to safely complete job requirements.\n\nIt is important to note that the refrigeration system has been designed with several safety features to prevent the accidental release of ammonia.  For example, the compressors are equipped with safety mechanisms that will cause the units to shut down if operating conditions exceed designated safety limits.  Also, level indicators, alarms, and switches are installed in key points within the system to monitor the supply of liquid ammonia and to ensure that a vessel is not overfilled.  The facility has installed ammonia sensors in the Engine Room.  The ammonia detection system in the Engine Room has two setpoints: local alarm and engine room refrigeration equipment shutdown.\n\n\nFIVE YEAR "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 31726,
      "SummaryText": "ACCIDENT HISTORY\n\nBased upon the Cacique, Inc. Hazard Assessment Update Report (05/23/2004), there have been no reportable releases of ammonia at the facility over the past five years (May 1999 - May 2004.)\n\n\nEMERGENCY RESPONSE PROGRAM\n\nThe facility has an Emergency Action Plan (plan) in effect at the facility.  This Plan was designed to meet the following objectives:  \n\n? save lives;\n? minimize and avoid injuries;\n? protect the environment; and\n? minimize property damage.\n\nThe Plan provides the notification procedures and evacuation routes for emergencies that may arise at the facility.  This Plan is reviewed and updated at least once per year to ensure compliance with the PSM and RMP regulations.  Facility personnel receive annual training regarding the emergency procedures.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nIn June 1995, the refrigeration system was thoroughly examined for safety hazards by way of a Process Hazard Analysis (PHA).  In addition, Revalidations of the initial Process Hazard Analysis was added in February 1999 and May 2004.  The 2004 PHA Revalidation consisted of a:\n\n? review of system modifications;\n? series of safety checklists; and\n? review of system operation.\n\nThe mitigation measures include additional labeling on system equipment and enhancements to the ammonia detection equipment.  All recommendations resulting from the revalidation study are due to be completed by May 2005."
    }
  ]
}