{
  "FacilityID": 31735,
  "FacilityName": "The Dow Chemical Company, Tracy, CA site",
  "FacilityStr1": "400 Gandy Dancer Drive",
  "FacilityStr2": null,
  "FacilityCity": "Tracy",
  "FacilityState": "CA",
  "FacilityZipCode": "95377",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06077",
  "LEPC": "San Joaquin County OES",
  "FacilityLatDecDegs": "37.708333",
  "FacilityLongDecDegs": "-121.425000",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.dow.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5092820,
  "ParentCompanyName": "The Dow Chemical Company",
  "Company2Name": null,
  "CompanyDUNS": 1381581,
  "Company2DUNS": null,
  "OperatorName": "The Dow Chemical Company",
  "OperatorStr1": "400 Gandy Dancer Drive",
  "OperatorStr2": null,
  "OperatorCity": "Tracy",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95377",
  "OperatorZipCodeExt": null,
  "FTE": 21,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000186363",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-03-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-15 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-02-03 00:00:00",
  "DeRegistrationEffectiveDate": "2008-08-01 00:00:00",
  "AnniversaryDate": "2009-06-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 37.708333,
  "FRS_Long": -121.425,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46001,
      "AltID": null,
      "FacilityID": 31735,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 60711,
          "ProcessID": 46001,
          "ChemicalID": 125,
          "Quantity": 125000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 47023,
          "ProcessID": 46001,
          "NAICSCode": "32615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 26379,
              "Process_NAICS_ID": 47023,
              "SafetyReviewDate": "2004-06-08 00:00:00",
              "PHA_Date": "2004-08-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Layer of Protection Analysis",
              "PHACompletionDate": "2003-09-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Air stripper on carbon beds",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Foam suppression capability",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-06-01 00:00:00",
              "TrainingReviewDate": "2004-05-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Learn@Dow.now",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Learn@dow.now",
              "MaintenanceReviewDate": "2003-11-14 00:00:00",
              "EquipmentInspectionDate": "2003-11-07 00:00:00",
              "EquipmentTested": "Relief devices",
              "ChangeMgmtDate": "2004-04-04 00:00:00",
              "ChangeMgmtReviewDate": "2004-05-15 00:00:00",
              "PreStartupReviewDate": "2004-06-10 00:00:00",
              "ComplianceAuditDate": "2003-11-14 00:00:00",
              "AuditCompletionDate": "2005-12-31 00:00:00",
              "IncidentInvestigationDate": "2004-06-02 00:00:00",
              "InvestigationChangeDate": "2004-08-31 00:00:00",
              "ParticipationPlansReviewDate": "2003-02-01 00:00:00",
              "HotWorkPermitReviewDate": "2004-06-01 00:00:00",
              "ContractorSafetyReviewDate": "2004-03-01 00:00:00",
              "ContractorSafetyEvalDate": "2004-03-31 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 38550,
                  "PreventionProgram3ID": 26379,
                  "ProcessChemicalID": 60711
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 31735,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-06-09 00:00:00",
    "ERTrainingDate": "2004-06-14 00:00:00",
    "CoordinatingAgencyName": "Tracy Fire Department",
    "CoordinatingAgencyPhone": "2098314575",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 31735,
      "SummaryText": "Executive Summary for The Dow Chemical Company Tracy CA site\n\n1.\tAccidental Release Prevention and Emergency Response Policies\nThe Tracy facility of The Dow Chemical Company (hereinafter ¿Tracy Facility¿) is strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n2.\tThe Stationary Source and the Regulated Substances Handled\nThe Tracy  facility¿s primary activities encompass manufacturing rigid polyurethane foam insulation in flat board stock.  Due to the environmental regulations requiring the facility to discontinue the use of hydrochlorofluorocarbons (HCFC¿s), which are known ozone depleting substances, the facility will be replacing it with a hydrocarbon blend.  This is the only regulated substance at our facility and the plant has a maximum storage capability of 125,000 pounds.  The hydrocarbon will serve as our blowing agent.  The site does not handle regulated toxic materials. \n\n3.\tThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nThe Tracy  facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1998 Edition.    The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nThe Tracy facility maintains detailed records of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.  The process safety information includes MSD sheets,"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 31735,
      "SummaryText": "reactive chemicals information, materials of construction, pipe specs, piping and instrument diagrams, and chemical compatibility data. \n\nProcess Hazard Analysis\nThe Tracy  facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The facility utilizes Layers of Protection Analysis (¿LOPA¿) and checklist techniques to complete these analyses.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval.  Any findings related to the hazard analysis are addressed in a timely manner.  \n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, the Tracy facility maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nThe Tracy facility has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Training includes topics on hot work, energy control, hazard communication, worst case scenarios, PPE, process overview, and emergency response. Refresher training is provided as needed.\n\nMechanical Integrity\nThe Tracy facility carries out documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offer"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 31735,
      "SummaryText": "ed specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at the Tracy facility to manage changes in process chemicals, technology, equipment and procedures.  These procedures are regularly reviewed and revised, as appropriate. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at the Tracy facility.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nThe Tracy facility conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out using an established schedule. . Any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nThe Tracy facility promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  Incident reports are retained for a minimum of 5 years.\n\nEmployee Participation\nThe Tracy facility  believes that process safety management and accident prevention is a team effort.  Employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facilit"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 31735,
      "SummaryText": "y¿s implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, the Tracy facility hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  The facility  has a  policy of informing the contractors of known potential hazards related the contractor¿s work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n4.\tFive-year Accident History\nThe Tracy facility has had an excellent record of preventing accidental releases over the last 5 years.  Due to our release prevention policies, there have been no accidental releases during this period.\n\n5.\tEmergency Response Plan\nThe Tracy facility carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nThe Local Fire Department and San Joaquin County Office of Emergency Services (LEPC) receive copies of our emergency plan. \n\n\n6.\tPlanned Changes to Improve Safety\nThe Tracy facility has implemented several changes to improve the safety of the site.  With the addition of the flammable material, the plant has added LEL monitors to monitor for potential flammable releases.  In addition, the facility is also enhancing site security."
    }
  ]
}