{
  "FacilityID": 31771,
  "FacilityName": "Cholla Water Treatment Plant",
  "FacilityStr1": "4805 West Cholla Street",
  "FacilityStr2": null,
  "FacilityCity": "Glendale",
  "FacilityState": "AZ",
  "FacilityZipCode": "85304",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.590000",
  "FacilityLongDecDegs": "-112.165278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.glendaleaz.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 77523579,
  "ParentCompanyName": "City of Glendale Utilities Department",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Glendale Utilities Dept.",
  "OperatorStr1": "4805 West Cholla Street",
  "OperatorStr2": null,
  "OperatorCity": "Glendale",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85304",
  "OperatorZipCodeExt": null,
  "RMPContact": "Rick Scott",
  "RMPTitle": "Superintendent of Plant Operations",
  "FTE": 28,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000093891",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-06-06 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 33.59,
  "FRS_Long": -112.16528,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46040,
      "AltID": null,
      "FacilityID": 31771,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 47064,
          "ProcessID": 46040,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 60759,
          "ProcessID": 46040,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 560759,
          "ProcessID": 46040,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 31771,
      "SummaryText": "\nExecutive Summary\n\n\n\n\n\nThis document is an update to the Cholla Water Treatment Plant (CWTP) Risk \n\nManagement Program (RMP) that was submitted to U.S. EPA in May 1999.   In \n\naccordance with RMP guidance documents and regulations, all administrative \n\nand operational changes at the facility since 1999 are documented.\n\n\n\nIn June 1996, the U.S. Environmental Protection Agency (EPA) issued Risk \n\nManagement (RM) program regulations (40 CFR, Part 68).  Regulated under the \n\nClean Air Act Amendments (CAAA), Section 112(r), the RMPRMP requires \n\nfacilities that store large amounts of listed hazardous chemical substances to \n\nprepare and implement risk management plans to reduce the probability of \n\naccidental releases and minimize the health risks to the public and the \n\nenvironment.  \n\n\n\nThe RMP regulates 77 listed toxic substances and 63 listed flammable \n\nsubstances.  Of the 140 toxic and flammable chemicals regulated by the RMP, \n\nthe CWTP has only one such listed chemical (anhydrous chlorine) that is used to \n\ndisinfect drinking water provided to the residents of Glendale.  The terms \n\nanhydrous chlorine and chlorine are used interchangeably and specifically refer \n\nto a chemical listed in the RMP regulations.  When used as a disinfectant, \n\nchlorine prevents the spread of waterborne diseases and has been used for \n\nyears in the water treatment industry.  When properly used, chlorine has proven \n\nto be both safe and effective. \n\n\n\nIn addition to the CWTP, the RMP regulations apply to an estimated 7,200 public \n\nand private drinking water and wastewater treatment facilities nationwide where \n\nchlorine and/or ammonia are used as disinfectants.  As with other facilities \n\nacross the U.S., the City of Glendale views the RMP as a vehicle to \n\ncommunicate emergency response procedures to the public and emergency \n\nplanning agencies.  \n\n\n\nMinimizing Risk\n\nThe major driving force in the development of the RMP regulations is reducing \n\nthe risk to public health by minimizin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 31771,
      "SummaryText": "g the potential of a chemical release.  At \n\nCWTP, there is a multi-layer system in place to meet this goal.  As part of the \n\nRMP, operators are trained in dealing with the day-to-day handling of chlorine.  \n\nChlorine detectors are located in areas where chlorine is stored and/or used and \n\nprovide a warning in the event of a release.  Trained personnel respond to \n\nchlorine alarms to assess whether a chlorine release poses an imminent danger \n\nto employees or the public.  While safety features such as a low pressure \n\nchlorine delivery system make a significant release unlikely, in the event that a \n\nrelease does occur, response plans have been developed.  The emergency \n\nresponse plans include assistance from outside agencies, as well as operators \n\ntrained to take appropriate action such as contacting the Glendale Fire \n\nDepartment (GFD).  The GFD's emergency response time is 5 minutes or less. \n\n\n\nManagement Plan\n\nWithin the management and administrative roles of the CWTP, responsibility has \n\nbeen defined to coordinate and implement the RMP.  Overall development and \n\nmanagement of the RMP is the responsibility of the RMP Manager.  The RMP \n\nCoordinator reports to the RMP Manager and is responsible for coordinating the \n\nimplementation of the RMP.  The CWTP Safety Administrator is responsible for \n\nthe overall record keeping of the RMP and reports to the RMP Coordinator.  The \n\nSenior Operator is responsible for the day-to-day implementation of the RMP and \n\nreports to the RMP Manager.  Additional program oversight is provided by the \n\nCity of Glendale's Environmental Resources Administrator and Employee Safety \n\nManager who act as external auditors of the program's implementation and \n\noverall quality.  \n\n\n\nFor the CWTP, the following personnel have been assigned to coordinate and \n\nimplement the RMP:\n\n\n\n    The Superintendent of Plant Operations is the designated RMP  Manager\n\n    The Safety & Security Coordinator is the designated RMP Coordinator\n\n\n\nThe Safety & "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 31771,
      "SummaryText": "Security Coordinator is also the delegated coordinator for the \n\nOccupational Safety and Health Administration (OSHA) Process Safety \n\nManagement (PSM) program in place at CWTP.  The requirements of the PSM \n\nprogram largely parallel RMP requirements.  Because of the similarities in the \n\ntwo programs, the RMP Coordinator will be referred to as the RM/PSM Program \n\nCoordinator throughout this document.\n\n\n\n5-Year Accident History\n\nIn the past 5 years, the there has not been a chemical release at the CWTP \n\nresulting in off-site property damage or health consequences requiring medical \n\ntreatment.  \n\n\n\nChemical Release Prevention Program\n\nThe CWTP has a chemical release prevention program in place for the chlorine \n\nprocess.  This program is required by both the RMP and OSHA PSM regulations.  \n\nThe prevention program for the chlorine process has been in place since 1995.  \n\nKey provisions of the CWTP prevention program are as follows:\n\n\n\n-    Written procedures have been prepared for the covered process, including \n\ndirections for safe start-up and shutdown, operations and emergency \n\nshutdown.\n\n\n\n-    CWTP employees who operate the chlorine system must receive training \n\ninitially and periodically on safe start-up/shutdown, operations, and \n\nemergency shutdown.  \n\n\n\n-    Incidences, including minor releases are investigated to improve the safety of \n\nthe process.  \n\n\n\n-    Once completed, incident investigations are shared with employees.  \n\n\n\n-    Employees participate in a process hazard analysis (PHA) which identifies \n\npotential hazards and ways to improve the safety of the process every five \n\nyears, or when significant changes are made to the process.\n\n\n\n-    The CWTP has a management of change (MOC) program in place that \n\nmandates changes to the chlorine system are reviewed prior to the change to \n\nensure that the change will not compromise safety.\n\n\n\n-    An equipment design and maintenance program is in place that assures \n\nmechanical integrity.  Equipment design and maintenanc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 31771,
      "SummaryText": "e practices are \n\nconsistent with guidance provided by the Chlorine Safety Institute.\n\n\n\n-    A preliminary start-up review is also completed prior to returning the covered \n\nequipment to service after a major change or prior to a new covered process \n\ncoming on-line.  \n\n\n\n-    A hot work permit program is in place. \n\n\n\n-    Contractors who work on or near the RMP process are advised of the \n\nhazards of chlorine, provided evacuation instructions in case an incident \n\noccurs, and must certify that they are qualified to work near hazardous \n\nmaterials.\n\n\n\nEmergency Response Program\n\nThe CWTP has an emergency response program in place for the chlorine \n\nprocess.  This program consists of personnel trained to recognize releases, \n\nassess the situation, and engage the proper emergency response personnel.  \n\nWhen external emergency response is required, plant personnel will notify the \n\nGFD then establish an incident command system that is transferred to the GFD \n\nupon their arrival. Once GFD establishes command, they are supported by \n\nCWTP personnel familiar with the affected process.  The GFD has access to \n\nadditional emergency response resources, including the City of Glendale Police \n\nDepartment, Red Cross, Arizona Department of Environmental Quality, and other \n\nagencies, as needed.\n\n\n\nImprovements Since Last Report Submission\n\nThe CWTP installed an emergency air scrubber adjacent to the chlorine cylinder \n\nroom to limit potential risk of a chlorine release to the surrounding environment.  \n\nThe scrubber was installed in July 2000.  The scrubber removes greater than \n\n99.99% of the toxic vapor in the air stream while maintaining a negative pressure \n\nin the storage room. \n\n\n\n"
    }
  ]
}