{
  "FacilityID": 31853,
  "FacilityName": "The Sherwin-Williams Company-Havre de Grace",
  "FacilityStr1": "1354 Old Post Road",
  "FacilityStr2": null,
  "FacilityCity": "Havre de Grace",
  "FacilityState": "MD",
  "FacilityZipCode": "21078",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24025",
  "LEPC": "Harford County LEPC",
  "FacilityLatDecDegs": "39.537222",
  "FacilityLongDecDegs": "-076.110278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "The Sherwin-Williams Company",
  "Company2Name": null,
  "CompanyDUNS": 4206397,
  "Company2DUNS": 0,
  "OperatorName": "The Sherwin-Williams Company",
  "OperatorStr1": "1354 Old Post Road",
  "OperatorStr2": null,
  "OperatorCity": "Havre de Grace",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21078",
  "OperatorZipCodeExt": null,
  "FTE": 34,
  "OtherEPAFacilityID": "21078CLLCR1354O",
  "EPAFacilityID": "100000067642",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-12-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Havre de Grace",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-04-08 00:00:00",
  "DeRegistrationEffectiveDate": "2005-12-01 00:00:00",
  "AnniversaryDate": "2009-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 39.5353,
  "FRS_Long": -76.11639,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R03",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "no longer has any single flammable substance in the amount of 10,000 pounds",
  "_processes": [
    {
      "ProcessID": 46122,
      "AltID": "Aerosol Warehouse",
      "FacilityID": 31853,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 60854,
          "ProcessID": 46122,
          "ChemicalID": 155,
          "Quantity": 65000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 44640,
              "ProcessChemicalID": 60854,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 44641,
              "ProcessChemicalID": 60854,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 44642,
              "ProcessChemicalID": 60854,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 44643,
              "ProcessChemicalID": 60854,
              "ChemicalID": 130
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 47146,
          "ProcessID": 46122,
          "NAICSCode": "325998",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 31853,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-02-18 00:00:00",
    "ERTrainingDate": "2004-05-01 00:00:00",
    "CoordinatingAgencyName": "Havre de Grace Fire Department",
    "CoordinatingAgencyPhone": "4109391930",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 31853,
      "SummaryText": "Enclosed is The Sherwin-Williams Company (Sherwin-Williams) Risk Management Plan (RMP) submittal for the Havre de Grace production facility. Sherwin-Williams does not believe it was the intent of the Clean Air Act 1990 to cover finished good aerosol storage at plant locations. The regulations and written responses from USEPA are unclear as to whether finished good storage is a regulated process under 40 CFR 68. Sherwin-Williams is submitting this plan for compliance purposes only, and these fillings shall not be construed as an agreement by Sherwin-Williams that these facilities are covered by the rule.  Therefore, Sherwin- Williams reserves its right to withdraw, amend or alter its plan at any time and to refrain from any future filing under this rule.\n\nThe Sherwin-Williams Company is committed to protecting the environment, safety and health of our employees, customers and the public, and will conduct its business operations in a manner that promotes obtainment of these objectives.  Employees at all levels are accountable for assuring high standards of environmental, health and safety compliance and performance. Safety, health and protection of the environment will be maintained as integral aspects of all business activities.\n\nThe Havre de Grace plant uses a variety of chemicals to blend to produce cleaning products, floor finishes, and specialty polymers for consumer, industrial and institutional users. Approximately 97% of the finished products are in liquid form, the balance being a powder. The facility also serves as a distribution warehouse for aerosol products.  The facility has ceased all aerosol filling operations at the site but does store finished aerosol products for distribution. Propane, butane, isobutane and methyl ether (i.e., propellants) are the RMP flammable substances used in the packaging of these aerosols.  When the propellants in each aerosol container are added together, the amount stored on-site is in excess of the threshold quantity.  Ther"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 31853,
      "SummaryText": "e are no listed toxic substances handled at this site in excess of the threshold quantity.\n\nThe worst case scenario is a hypothetical release of any of the hazardous materials listed under RMP rule as determined by the USEPA. The EPA mandates that companies presume the release of the entire quantity of the substance.  Only passive safety controls, such as those controls in place that do not require action by an employee to initiate, can be considered.  An example of a passive safety control is storage of a limited quantity. The worst case scenario presumes none of the site's mechanical controls or safety systems requiring energy or human intervention are operational. \n\nThe worst-case release scenario was determined by EPA to be a vapor cloud explosion. This scenario assumes that the total quantity of the flammable substance in the site's largest storage vessel (an aerosol container) is released into a vapor cloud, which then explodes.  The endpoint for the impact zone was determined by EPA to be an overpressure level of 1 pound per square inch (psi) from the explosion of the vapor cloud. The release scenario evaluated using EPA?s model, RMP*Comp, shows no potential for off-site impacts.\n\nThere has not been an accident or incident that has met the RMP criteria involving propane, butane, isobutane, or methyl ether at the facility during the last five years.  Criteria for RMP reporting are accidents that have resulted in death, injury, significant property damage, evacuation, sheltering in place, or environmental damage.  The warehouse has never had a release that caused off-site injury in its entire history. \n\nThe plant maintains trained employees to handle a variety of emergencies at the site including incipient fires and minor chemical spills. The site has also made arrangements for assistance from the local fire department and other emergency responders to respond to incidents of a larger scale.\n\nThe site continually reviews and, if necessary, improves the safety p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 31853,
      "SummaryText": "rograms and systems at the facility."
    }
  ]
}