{
  "FacilityID": 32104,
  "FacilityName": "Sensient Colors Inc.",
  "FacilityStr1": "2526 Baldwin Street",
  "FacilityStr2": null,
  "FacilityCity": "St. Louis",
  "FacilityState": "MO",
  "FacilityZipCode": "63106",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29510",
  "LEPC": "St. Louis City LEPC",
  "FacilityLatDecDegs": "38.651267",
  "FacilityLongDecDegs": "-090.216508",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 937941052,
  "ParentCompanyName": "Sensient Technologies Corp.",
  "Company2Name": null,
  "CompanyDUNS": 6088884,
  "Company2DUNS": null,
  "OperatorName": "Sensient Technologies Corp",
  "OperatorStr1": "777 East Wisconsin Ave",
  "OperatorStr2": null,
  "OperatorCity": "Milwaukee",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53202",
  "OperatorZipCodeExt": "5304",
  "FTE": 425,
  "OtherEPAFacilityID": "MOD980740120",
  "EPAFacilityID": "100000096834",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-12-18 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Sensient Colors Inc. Risk Management Program",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 38.65084,
  "FRS_Long": -90.21637,
  "FRS_Description": null,
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46459,
      "AltID": "Oleum System",
      "FacilityID": 32104,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 61271,
          "ProcessID": 46459,
          "ChemicalID": 69,
          "Quantity": 68200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 47489,
          "ProcessID": 46459,
          "NAICSCode": "325132",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 32104,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-06-01 00:00:00",
    "ERTrainingDate": "2004-05-26 00:00:00",
    "CoordinatingAgencyName": "St. Louis City L.E.P.C.",
    "CoordinatingAgencyPhone": "3146223391",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32104,
      "SummaryText": "SENSIENT COLORS INC. RMP EXECUTIVE SUMMARY\n\nFacility Overview\n\nSensient Colors Inc.'s St. Louis manufacturing plant produces food, drug and cosmetic colorants; and technical dyes and pigments.  The facility includes chemical reactors, solid/liquid separation equipment, wastewater treatment equipment, and general plant utility systems.  This facility has not been subject to OSHA'a PSM rules based on materials handled.  Low volumes of flammable's are handled at this facility.  Based on the recent EPA RMP regulation, the St. Louis facility is subject to the RMP regulation due to the handling and usage of 20 percent Oleum.  A thorough implementation of the RMO program has been conducted.\n\nRegulated Substances\n\nThe oleum stored inside the confines of the Sensient Colors Inc.'s St. Louis plant is contained in a 4,000-gallon storage tank at room temperature.  The storage tank is housed inside an acid isolation room that has with restricted access.  A two-foot high curb inside the room will contain a spill of over 7,500 gallons and restricts the surface area of any spill to a pool of approximately 500 (504) square feet.  An exhaust fan rated at 2,000 cubic feet per minute ventilates the room.  An emergency a wet scrubber system ventilates the room and is designed to neutralize acid mists or SOx vapors and then exhaust the air through a 10 inch diameter roof vent.\n\nWorst-Case Release Scenario\n\nThe worst case scenario for a toxic release of oleum at this plant involves the spill of the entire contents of the bulk storage (3,500 gallons).  The SO3 fumes would exhaust through the existing room exhaust fan.  Dispersion of SO3 fumes was modeled using BREEZE HAZ DEGADIS+ software.  Using this software for the above scenario, it was determined that the toxic endpoint will never be bet or exceeded at the Oleum Storage Room boundary, thus no impact is feasible for neighboring residents.\n\nAlternate Case Release Scenario\n\nDespite the fact that the worst case scenario did not result i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32104,
      "SummaryText": "n a toxic endpoint, and an alternate case scenario was not required, Sensient Colors Inc. did evaluate an alternate case.  This alternate case assumed that a pipe rupture occurred in one of the reactor areas, and went undetected, resulting in the entire contents of the Oleum Tank spilling onto the production floor.  The SO3 emissions were assumed to exhaust through one or more of the room exhaust fans.  Again it was determined that a toxic endpoint would not be met, and therefore it would not be feasible for any impact to neighboring residents.\n\nFive Year Accident History\n\nThe Sensient Colors Inc. St. Louis plant has not had any accidents within the past five years that required reporting.  This is a testimonial to Sensient Colors Inc.'s diligence in training their staff and the implementation of the release prevention and emergency response procedures.  This also demonstrates the level of competency and awareness displayed by the staff.\n\nAccidental Release and Emergency Response Polices and Programs\n\nThe Sensient Colors Inc. plant has several written policies in addition to the enumerable mechanical systems; to prevent the release of the toxic chemicals used here.  This plant also has policies in place, which govern how to respond to a chemical emergency.  These written plans are kept in highly visible locations throughout the plant, and each employee must review them at least once a year or every time they are revised.\n\nIn the release prevention documents it is clearly stated how spills and containment of spills will be handled for each specific area of the plant.  For each plant section it is stated what mitigation is in place (i.e. dikes, sumps, etc.) to contain a spill in that area. \n\nThe documents also explain how the spills are to be recovered and treated.  Specific tanks are named for the routing of recovered spill chemicals, and what is to be done with the chemicals once they are recovered. Chemicals will either be reclaimed or reprocessed or neutralized an"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32104,
      "SummaryText": "d disposed of.\n\nFor oleum, the release prevention policy reads, \"Any overflow from this area will be caught in a diked area and neutralized.  In case of a leak in one tank the acid will be pumped into the reactor in Building #7 (if empty) and a truck called to unload the remaining acid.\"\n\nThe emergency response documents control what will take place in the event of an emergency.  A chain of command is clearly outlined, responsibilities are stated for each group of employees and an evacuation procedure is defined.  Employees are informed of their individual duties such as where to be for a personnel count and when they may return to work or go home.  Steps to be taken for a specific emergencies are stated including who is to be notified and their telephone numbers.\n\nIn the event of an oleum spill, the emergency response policy specifies the distances of evacuation for spills under 1 gallon and for spills of over 1 gallon.  The employee that discovers the spill will call security and notify them that an oleum spill has occurred, where the spill is and how much oleum has been spilled.  Security will then notify the emergency response team by way of the plant P.A. system.  Security will also call one of the plant supervisors from their list.  The supervisor will report the spill to the local Fire Department, the Local Emergency Response Center, the State Emergency Response Center, the National Response Center, in the event that the spill reaches the public sewer, the St. Louis Metropolitan Sewer District.\n\nThe oleum spill response plan goes into the further detail by giving the nature of the chemical, its physical and chemical properties, and the potential hazards to personnel and equipment.  The plan also describes first aid procedures and sites of exposure.  The personal protective equipment needed to clean up a spill is listed as well as how to stop and contain the spill.  Finally the plan outlines the procedures for the clean-up and reclamation of the spilled oleum."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32104,
      "SummaryText": "Detailed written operating procedures are maintained for all batch processes.  Step-by-step instructions are given with special safety precautions highlighted.  Emergency, temporary, or ESD procedures do not apply to the batch process since all operating steps only proceed step-wise with ongoing checks of the conditions effecting safety.  All operations are ceased in the event that any unsafe conditions should arise.\n\nAdditionally with the implementation of the RMP, training has been initiated for operators, and maintenance personnel.  This supplements the existing contractor training programs.\n\nChemical Specific Prevention Programs\n\nAs a result of the RMP activities, Sensient Colors Inc. performed analysis to determine whether there is any potential for an exothermic run-away reaction to develop.  Lab testing determined the thermodynamics at elevated temperatures of all reactions involving the use of Oleum do not creat a run-away reaction.  \n\nThe Oleum storage tank and piping systems are routinely inspected to determine the wall thicknesses at several locations on the tank and critical points of the piping. This program provides assurance that tank and piping failure will not occur due to localized corrosion.  Records of all inspections are maintained on file by Sensient Colors Inc. maintenance department."
    }
  ]
}