{
  "FacilityID": 32190,
  "FacilityName": "Georgia Gulf Chemicals & Vinyls, LLC - Pasadena",
  "FacilityStr1": "3503 Pasadena Freeway",
  "FacilityStr2": null,
  "FacilityCity": "Pasadena",
  "FacilityState": "TX",
  "FacilityZipCode": "77503",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Southeast Regional LEPC",
  "FacilityLatDecDegs": "29.731667",
  "FacilityLongDecDegs": "-095.154444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 93565653,
  "ParentCompanyName": "Georgia Gulf Corporation",
  "Company2Name": null,
  "CompanyDUNS": 120957840,
  "Company2DUNS": null,
  "OperatorName": "Georgia Gulf Chemicals & Vinyls LLC",
  "OperatorStr1": "P.O. Box 1959",
  "OperatorStr2": null,
  "OperatorCity": "Pasadena",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77501",
  "OperatorZipCodeExt": "1959",
  "FTE": 46,
  "OtherEPAFacilityID": "77501GRGGL3503P",
  "EPAFacilityID": "100000131582",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-06-14 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 29.73,
  "FRS_Long": -95.154722,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46570,
      "AltID": "Cumene Process",
      "FacilityID": 32190,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 61385,
          "ProcessID": 46570,
          "ChemicalID": 155,
          "Quantity": 7900000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 45113,
              "ProcessChemicalID": 61385,
              "ChemicalID": 129
            },
            {
              "FlamMixChemID": 45114,
              "ProcessChemicalID": 61385,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 47601,
          "ProcessID": 46570,
          "NAICSCode": "32511",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 26625,
              "Process_NAICS_ID": 47601,
              "SafetyReviewDate": "2000-02-15 00:00:00",
              "PHA_Date": "2000-03-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-05-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-12-03 00:00:00",
              "TrainingReviewDate": "2003-05-08 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-04-08 00:00:00",
              "EquipmentInspectionDate": "2004-03-11 00:00:00",
              "EquipmentTested": "Tank T-3",
              "ChangeMgmtDate": "2004-06-11 00:00:00",
              "ChangeMgmtReviewDate": "2004-04-21 00:00:00",
              "PreStartupReviewDate": "2004-04-29 00:00:00",
              "ComplianceAuditDate": "2004-04-20 00:00:00",
              "AuditCompletionDate": "2004-10-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-04-20 00:00:00",
              "HotWorkPermitReviewDate": "2004-04-20 00:00:00",
              "ContractorSafetyReviewDate": "2004-04-01 00:00:00",
              "ContractorSafetyEvalDate": "2004-04-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 38876,
                  "PreventionProgram3ID": 26625,
                  "ProcessChemicalID": 61385
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 32190,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-03-15 00:00:00",
    "ERTrainingDate": "2004-06-07 00:00:00",
    "CoordinatingAgencyName": "Southeast Regional LEPC",
    "CoordinatingAgencyPhone": "7134737646",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32190,
      "SummaryText": "RMP Executive Summary for Georgia Gulf Corporation - Pasadena Division\n\n1.  Accidental Release Prevention and Emergency Response Policies\n\nWe are committed to conducting our activities with the highest regard for environmental, health, safety, and community well-being. All applicable laws and regulations are adhered to with special emphasis on environmental and safety standards.  Our comprehensive accidental release prevention program covers areas such as design, installation, operating procedures, maintenance, and employee training.  If a release does occur, our highly trained emergency response personnel are at hand to control and mitigate the effects of the release.\n\n2.  The Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities are the manufacture of cumene, phenol and acetone.  We handle two risk management plan rule substances at our facility, propylene and propane.  We receive and store propylene and propane together as a mixture (P/P mix), so they are covered together as a flammable mixture for purposes of our risk management plan.  The propylene in the P/P mix is used to produce cumene, while the propane passes through our process and is resold.  We bring in P/P mix by tank truck, railcar, and pipeline. Propane is shipped from our facility by pipeline.\n\n3.  The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario \n\nGeorgia Gulf's worst case and alternative release scenarios do not impact any homes, schools, or hospitals.  The scenarios could, however impact our employees and our industrial neighbors. The following paragraphs provide details of the two scenarios.\n\nThe worst case release scenario involves a catastrophic release from a storage sphere.  The sphere is a vessel used for the storage of a pressurized liquefied mixture of propylene and propane feed (P/P Mix).  The scenario involves a releas"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32190,
      "SummaryText": "e of P/P mix, which finds an ignition source, with 10 percent of the quantity released involved in a vapor cloud explosion. \n\nSeveral unlikely events must occur for this worst case scenario to materialize.  The sphere would have to be completely full; the 1 1/4 inch-thick steel walls of the sphere would have to fail instantaneously; all of the liquid material in the sphere would have to form a vapor cloud within 10 minutes; all of our safety systems would have to simultaneously fail; all our personnel would have to do nothing to contain or stop the release; specific weather conditions, which would tend to keep any vapor cloud confined and concentrated, would have to be present.  In the improbable event that each and every one of these conditions was to occur, the maximum distance to an endpoint of 1 psi overpressure would still not reach any homes, schools, or hospitals.  \n\nAlthough the EPA does not allow companies to consider any active safety measures when analyzing the worst case scenario, Georgia Gulf has a number of safety systems in place to prevent a release from ever occurring at the sphere.  The sphere meets strict design and construction standards.  It is constructed of 1 1/4 inch-thick steel and wrapped with a 4-inch-thick layer of insulation to help control the temperature and pressure inside the sphere. To prevent the vessel from over pressuring and releasing, the sphere has two relief valves.  These relief valves are tested every two years.  An automatic isolation valve is located on the discharge of the sphere to shut off flow if there is a rupture downstream of the valve.  Numerous instrument alarms are in place to warn of potential equipment malfunction, including multiple pump malfunction alarms and automatic shutdowns on the sphere pumps.  Remote valves are installed to isolate and limit any release from the sphere, including a check valve on the sphere fill line to prevent reverse flow.  In addition, we have a facility-wide leak detection and rep"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32190,
      "SummaryText": "air program to identify and repair leaks before they could ever result in an emergency.  This program includes scheduled monitoring of pumps, valves, connectors, and other equipment using portable hydrocarbon leak detectors.  When a leak is found, it is repaired and remonitored to verify that it is leak free.\n\nGeorgia Gulf's alternative release scenario involves the failure of a two-inch diameter P/P mix railcar unloading vapor hose.  In the scenario, propylene and propane are released from an unloading hose, followed by a vapor cloud explosion.  Like the worst case scenario, the maximum distance to the endpoint of 1 psi overpressure would not reach any homes, schools, or hospitals.  \n\nGeorgia Gulf has installed safety systems to prevent a railcar unloading hose failure from ever occurring.  The stainless steel-braided hoses used at Georgia Gulf exceed the design and construction requirements for our railcar unloading conditions.  Each unloading hose is tested annually to 1.5 times the design maximum operating pressure, and the hose fittings are replaced whenever indications of visible wear are present.  Railcar grounds are used to prevent any static discharge.\n\nThere is a relief valve on every P/P mix railcar to prevent the railcar and unloading hose from over pressuring.  We have instrument alarms to warn of potential equipment malfunction and equipment shutdowns to shut off flow.  Each station is monitored via closed circuit television on a two minute loop from a continuously manned control room.  An automatic shutoff valve is located on each railcar to shut off flow if the unloading hose fails.  We have multiple remote block valves, check valves, and a control valve that can shut off flow to the railcar unloading line to isolate and limit any release.  An operator is located at all times within 300 feet of the railcars, which will ensure that the release can be manually isolated quickly, limiting the release duration to 10 minutes.\n\n4.  The General Accidental Re"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32190,
      "SummaryText": "lease Prevention Program and the Chemical-Specific Prevention Steps\n\nGeorgia Gulf has put a program in place to meet or exceed every requirement of the accidental release prevention provisions set out in 40 CFR part 68 by the EPA.  The facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition.  Processes at our facility are also subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard under 29 CFR 1910.119.    The following sections briefly describe the main elements of the release prevention program that are in place at our facility.\n\nProcess Safety Information\nGeorgia Gulf maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with our processes.\n\nProcess Hazard Analysis\nSystems are in place to safely manage change as part of our process safety management program.   Comprehensive hazard reviews (where teams of employees examine potential hazards and develop ways to mitigate them) are performed to ensure that hazards associated with our processes are identified and controlled effectively.  The reviews are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at regular intervals.  Any findings related to the hazard analysis are addressed promptly.\n\nOperating Procedures\nIn order to safely conduct activities at our facility, Georgia Gulf maintains detailed written operating procedures.  These procedures cover initial plant startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  They describe the tasks we must perform, safe operating parameters that we must maintain, and safety precautions for operations and maintenance activities.  The procedures are reviewed annually and are readily accessible to our operators.\n\nTraining\nGeorgia Gulf has a formal training"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 32190,
      "SummaryText": "program to ensure that all employees who are operating processes are trained and tested in the operating procedures associated with these processes.   Refresher training is provided at least every three years and more frequently as needed.  During the training, each employee must demonstrate that they have the required knowledge, skills, and abilities to safely carry out their duties and responsibilities as provided in our operating procedures. \n\nMechanical Integrity\nWe have comprehensive preventive maintenance and mechanical integrity programs in place for the entire facility.  The program incorporates industry codes, procedures from federal and state regulations, and instructions provided by equipment manufacturers.  Georgia Gulf carries out documented maintenance checks on process equipment to ensure proper operations.  The inspection and testing for the sphere include a 5-year ultrasonic thickness testing, daily visual inspections by operators, a 5-year visual vessel inspection by an American Petroleum Institute (API) certified inspector, and periodic internal vessel inspections to prevent vessel failure.  Each P/P mix railcar relief valve is tested every five years, and railcar tanks are inspected and pressure tested every 10 years for proper operation.  All maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are used at Georgia Gulf to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel, and other employees whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training with any modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular pra"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 32190,
      "SummaryText": "ctice at Georgia Gulf.  These reviews are used to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup before ever placing equipment into operation.\n\nIncident Investigation\nGeorgia Gulf promptly investigates any incident or near miss that has resulted in, or could reasonably result in a catastrophic release or injury.  These investigations are undertaken within 48 hours to identify the situation leading to the incident as well as any corrective actions to prevent the release or injuries from reoccurring.  Investigation report findings are shared with all employees affected by the findings.  Each investigation report is retained for a minimum of five years.\n\nEmployee Participation\nGeorgia Gulf believes that process safety management and accident prevention is a team effort.  Company employees actively participate in accident prevention and developing our process safety management programs.  In addition, our employees have access to all information created as part of the facility's implementation of the Risk Management Plan rule, including information resulting from process hazard analyses.\n\nContractors\nOur company hires contractors to perform maintenance and construction activities at the facility.  Prior to selecting a contractor, a thorough evaluation of the contractor's safety performance is carried out.  Georgia Gulf has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all of the emergency response procedures should an accidental release occur.\n\n5.  Five-year Accident History\n\nGeorgia Gulf has had an excellent record of preventing accidental releases over the last five years.  Due to our stringent prevention policies, there have been no releases of propane or propylene at our facility during the last five years.   \n\n6.  Emergency Response Plan\n\nGeorgia Gulf has a written emergency response plan to deal wi"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 32190,
      "SummaryText": "th accidental releases of hazardous materials.  The plan includes all aspects of emergency response including first aid and medical treatment, evacuations, notification of regulatory agencies and the public, on and offsite monitoring, as well as post-incident clean up of any affected areas.  The emergency response plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.  We coordinate our emergency plan with the City of Pasadena Office of Emergency Management, our facility's Local Emergency Planning Committee (LEPC).  \n\nTo quickly and effectively respond to emergencies at our facility, Georgia Gulf maintains two mobile 500 gallon foam trailers with trucks onsite, and a water deluge system.  Fixed fire monitors are in place at the sphere, the railcar unloading rack, and throughout the facility to respond to fires.  We have an emergency flare in place to safely combust propane and propylene during upsets or emergencies.  To ensure proper functioning, our emergency response equipment is regularly inspected and serviced. \n\nThe facility has a Whalen alarm system to alert nearby persons during emergencies.  We also have procedures in place to alert the city of Pasadena and surrounding communities during emergencies. \n\nWe employ trained emergency responders, including onsite industrial firefighters, who train annually at the Texas A&M University Industrial Fire Fighting School.  We also have an onsite emergency medical team and an onsite rescue team.  Our hazardous materials response team is 40-hour HAZMAT certified and can respond to incidents both on and offsite.  Additional personnel are on contract to provide emergency response equipment, expertise, and manpower if needed.  We have an emergency communications link to offsite responders through our emergency radio system, which we and our neighboring plants continuously monitor.  In addition to the Pasadena LEPC, we also closely coordin"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 32190,
      "SummaryText": "ate our emergency plan with Channel Industries Mutual Aid (CIMA).  Procedures are in place to quickly notify CIMA by radio or telephone to bring in additional help if required.  CIMA is the largest industry mutual aid organization in the world.  It is a joining together of firefighting, rescue, hazardous materials, and emergency medical manpower and equipment from more than 100 industrial facilities and federal, state, and local emergency response agencies along the Houston Ship Channel for mutual assistance in case of an emergency. \n\nWe conduct quarterly drills on emergency procedures at the facility (fire, medical emergency, plant evacuation, rescue) with our neighboring plants often participating.   Our responders also participate in the annual CIMA Zone 2 Drill, and the annual general membership drill.   \n\n7.  Planned Changes to Improve Safety\n\nWe are continuously working to reduce our accident and release rate, primarily through employee involvement in our 5-year Safety Plan.  Several developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Revalidation of our Process Hazard Analysis and Operator Requalification are continiously improving the safety and knowledge of the process."
    }
  ]
}