{
  "FacilityID": 32266,
  "FacilityName": "Mason Water Treatment Plant",
  "FacilityStr1": "4988 Hamilton Road",
  "FacilityStr2": null,
  "FacilityCity": "Lebanon",
  "FacilityState": "OH",
  "FacilityZipCode": "45040",
  "Facility4DigitZipExt": "9438",
  "FacilityCountyFIPS": "39165",
  "LEPC": "Warren County LEPC",
  "FacilityLatDecDegs": "39.411111",
  "FacilityLongDecDegs": "-084.303833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "larry.moster@gcww.cincinnati-oh.gov",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Cincinnati, Greater Cincinnati Water Works",
  "Company2Name": "City of Mason",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Greater Cincinnati Water Works",
  "OperatorStr1": "5651 Kellogg Avenue",
  "OperatorStr2": "Supply Division Administration",
  "OperatorCity": "Cincinnati",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45228",
  "OperatorZipCodeExt": "1123",
  "RMPContact": "Lawrence Moster",
  "RMPTitle": "Assistant Treatment Superintendent",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000062861",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-05-05 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-02-02 00:00:00",
  "DeRegistrationEffectiveDate": "2005-01-25 00:00:00",
  "AnniversaryDate": "2009-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 39.41111,
  "FRS_Long": -84.30383,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46656,
      "AltID": "Chlorination System",
      "FacilityID": 32266,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 47691,
          "ProcessID": 46656,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 61491,
          "ProcessID": 46656,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 561491,
          "ProcessID": 46656,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32266,
      "SummaryText": "Introduction\n\nPrior to March 2002, the Mason Water Treatment Plant (MWTP) was owned and operated by the City of Mason, Ohio.  Beginning March 1, 2002, the City of Cincinnati, Greater Cincinnati Water Works (GCWW), assumed extended contractual control of and responsibility for all aspects of the operation and maintenance of the MTP.  Therefore, as a revision to the RMP submitted in June 1999 by the City of Mason, the GCWW is listed in this re-submission, section 1.1.b as Parent Company #1; the City of Mason is now listed in section 1.1.c as Parent Company #2.  All sections of the RMP have been reviewed and brought up-to-date by responsible parties of the GCWW prior to this re-submission.  All contacts listed within this RMP, with the exception of those emergency responders listed in the Emergency Action Plan, are those of the GCWW.\n\nA second revision to the June 1999 RMP submission is the elimination of Full Time Equivalent Employees (FTE)as listed in section 1.11.  The MWTP is now operated as a rural, unstaffed, remotely-operated facility under the control of the GCWW Richard Miller Water Treatment Plant, California Control Center.  While the MWTP facility is included in the daily operations, maintenance, and water quality rounds, there are no longer any employees permanently assigned to the site.\n\nUSEPA's Risk Management Program (RMP) Rule (40 CFR 68), published in the Federal Register on June 20, 1996, was developed to assist facilities in preventing accidental releases of highly toxic or flammable chemicals.  The RMP applies to an owner or operator of a stationary source that has more than a threshold quantity of a regulated substance in a process, as determined under section 68.115.\n\nThe USEPA has established three tiers of requirements to reduce the level of effort for facilities with a lower risk of offsite impacts.  These tiers are known as Programs 1, 2, and 3.  Program 1 applies to any process that has not had an accidental release with prescribed offsite c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32266,
      "SummaryText": "onsequences for five years and has no public receptors impacted by a worst-case release.  Program 3 applies to processes in specified industries, and to all processes subject to the OSHA Process Safety Management (PSM) Standard, unless the process is eligible for Program 1.  Program 2 applies to processes not covered by Programs 1 or 3.\nThe GCWW, MWTP, continues to utilize more than a threshold quantity of chlorine (2,500 pounds) in the water treatment process.  Based on the March 1999 revised USEPA RMP Guidance for Wastewater Treatment Plants (WWTPs) (EPA 550-B-98-010), the MWTP is subject to the OSHA Process Safety Management (PSM) Standard and is therefore subject to Program 3 requirements of the RMP Regulation.\n\nBased on 40 CFR Section 68.190 (Updates), the owner or operator of a stationary source shall revise and update the RMP submitted under Sec. 68.150, within five years of its initial submission.  Since the City of Mason submitted it's original RMP in July 1999, this RMP resubmission is to bring the MWTP into compliance with Sec. 68.190 by June 21, 2004.\n\n\nUSEPA's RMP Rule requires that covered facilities prepare an Executive Summary.  The following pages represent the Executive Summary, summarizing the items required as described in 40 CFR 68.155 (a) through (g).\n\nSection 68.155(a) Accidental Release and Emergency Response Policies.\n\nThe MWTP has documented emergency response procedures in place, as documented in the facility's Emergency Action Plan.  This plan has been endorsed by the GCWW, responsible for the operation and maintenance of the MWTP.  The MWTP has procedures in place, including coordination with offsite responders, that must be followed in the event of a chlorine leak.  All personnel involved in handling chlorine are trained with regard to chlorine safety and accident prevention.\n\n\nSection 68.155(b) Stationary Source and Substance Handled.\n\nThe stationary source subject to 40 CFR Part 68 is the chlorination system of the MWTP.  The MWTP is "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32266,
      "SummaryText": "a facility that uses pressure filters to remove iron and manganese from groundwater.  Chlorine from one-ton containers is used for prechlorination and disinfection.  Currently, MWTP has an average daily plant production rate of 1.3 mgd and a design production rate of 7.0 mgd.\n\nLocated in the Filter and Administration Building, the MWTP chlorination system consists of three rooms:  the Chlorine Storage Room, the Chlorine Feed Room, and the Chlorine Scrubber Room.  The western portion of the Chlorine Storage Room contains a loading/unloading area and a storage area, while the eastern portion contains two one-ton chlorine containers that feed chlorine to the chlorinators.  A 2-ton crane with a monorail unloads the one-ton containers from the delivery truck to their appropriate place in the storage area.  The MWTP keeps two backup containers in the storage area and has space for empty one-ton containers on two remaining sets of roller chocks.  The maximum inventory of chlorine in the Chlorine Storage Room and onsite is 4 one-ton containers, approximately 8,000 lbs of chlorine.\n\nAt the MWTP, a vacuum regulator connected directly to the container valve of each active container, feeds chlorine to the chlorinators as a gas.  Vacuum chlorine feed reduces the likelihood of a release into the environment.  The two vacuum regulator valves are then connected into the PVC manifold piping.  Extending from the Chlorine Storage Room to the Chlorine Feed Room, the manifold piping conveys the gaseous chlorine to the six chlorinators and six injectors provided for solution chlorine feed at various process locations.\n\nThe Chlorine Storage Room and Chlorine Feed Room each have a chlorine leak sensor to alert employees of any exposure in the unlikely event of a chlorine leak.  In the Chlorine Feed Room, the chlorine leak sensor is located next to the chlorinators.  In the Chlorine Storage Room, the sensor is located next to the active chlorine containers.  An audible alarm automatically s"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32266,
      "SummaryText": "ounds inside and outside of the building when chlorine levels reach 1 ppm.  The leak sensors also alert the main SCADA system, located in the California Control Center of the GCWW Richard Miller Water Treatment Plant, so that the Emergency Action Plan can be implemented.\n\n \nSection 68.165: Offsite Consequence Analysis.\n\nAs a Program 3 Process with one toxic gas, one worst-case release scenario and one alternative release scenario will be assessed for the MWTP facility.  The MWTP has chosen to use the US EPA Risk Management Program Guidance for Wastewater Treatment Plants (40 CFR Part 68), US EPA 550-B-98-010, October 1998, (WWTP Guidance), as a guide to determine off-site consequences.  This guidance specifically addresses the chemicals commonly found at WWTPs.  The chlorination process for WTPs is similar to the chlorination process at WWTPs.  Therefore, this guidance document is applicable to the MWTP's chlorination process.\n\nThe worst-case release scenario was determined in accordance with the requirements provided in 40 CFR 68.22 and 40 CFR 68.25(b,c).  For the MWTP facility, the worst-case scenario is a total release from one of the one-ton containers of chlorine (greatest amount held in a single vessel).  It is assumed that the container ruptures and its entire content escapes to the air in 10 minutes.  Additionally, the worst-case scenario requires a ground level release height.  The rate of chlorine released for the worst case scenario is 200 pounds per minute.  Using the reference tables in the USEPA RMP Guidance for WWTPs, a toxic endpoint of 3.0 miles was determined for the worst case scenario.  The residential population within a 3.0 mile radius of influence for MWTP plant was determined to be approximately 10,200 people. The radius of influence includes recreation areas, a correctional facility, a hospital, and industrial areas.\n\nThe facility is also required to complete at least one alternative release scenario.  The alternative release scenario was ev"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 32266,
      "SummaryText": "aluated in accordance with the guidelines provided in 40 CFR 68.22 and 40 CFR 68.28.  The alternative release scenario selected was that of a 3/16 inch diameter opening from a leaking valve on the ton cylinder in the Chlorine Storage Room.  Using the guidance for alternative release scenarios of chlorine in the USEPA RMP Guidance for WWTPs, this chlorine vapor release would result in a release rate of 5 pounds of chlorine per minute. The reference tables in USEPA RMP Guidance for WWTP give a distance of 0.1 miles to the toxic endpoint for the alternative scenario.  The residential population within a 0.1 mile radius of influence of the MWTP was determined to be zero.  The radius of influence does not encompass any residences, schools, hospitals, parks, or prisons.  Although the chlorination system is enclosed inside a building and the WTP has a chlorine scrubber, neither of these mitigation systems were considered in the analysis of the alternative-release scenario.\n\n \nSection 68.155(c): Accidental Release Prevention Program.\n\nThe MWTP facility has a documented Prevention Program for the facility Chlorination System that documents release prevention measures.  These prevention measures include elements such as Employee Participation, Process Safety Information, Process Hazard Analysis, Operating Procedures, Training, Contractors, Pre-startup Review, Mechanical Integrity, Hot Work Permits, Management of Change, Incident Investigation, and Compliance Audits.  \n\nThe MWTP is equipped with leak-detection monitoring to decrease response time in the event of a chlorine leak.  One chlorine- leak sensor is located next to the active containers in the Chlorine Storage Room and the other chlorine-leak sensor is located next to the chlorinators in the Chlorine Feed Room.  An audible alarm automatically sounds inside and outside of the building, and the SCADA system alarms at both the MWTP and RMTP Control Center, when chlorine levels reach 1 ppm.  When a level of 3 ppm is detec"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 32266,
      "SummaryText": "ted, the building ventilation system automatically shuts down to contain the chlorine inside the building, and the scrubber system turns on automatically to remove the chlorine from the facility air.  GCWW employees who are involved in chlorine operations are trained in specific procedures regarding handling and storage of chlorine at the facility.\n\n\nSection 68.155(d) Five-Year Accident History.\n\nThe MWTP facility has had no accidental releases of chlorine in the last five years that have resulted in on-site injuries or off-site injuries or other impacts.\n\n\nSection 68.155(e) Emergency Response Program.\n\nThe MWTP has developed an Emergency Action Plan to ensure employee safety as allowed by 40 CFR 68.90(b).  The MWTP facility Emergency Action Plan outlines actions required to respond to a chlorine emergency and has coordinated this plan with both the Warren County Department of Emergency Services and the Turtlecreek Township Fire Department personnel as the first responders in the event of a chlorine emergency.  GCWW employees are not designated first responders to a serious or unplanned chlorine release.  As specified in 40 CFR 68.90(b), the MWTP Emergency Action Plan meets the exception listed, and therefore, the facility is not required to have the Emergency Response Program of 40 CFR 68.95.\n\n\nSection 68.155(f) Safety Improvements.\n \nRecommendations for safety improvements were identified in the Process Hazard Analysis (PHA), which was completed per OSHA 29 CFR 1910.119(e) on May 25, 2004.  Recommended improvements were identified in three main categories: Standard Operating Procedures, Maintenance, and Training.  According to the PSM, any safety improvements will be investigated concerning their impacts on other systems and/or procedures prior to implementation.  Additional recommendations may be made upon review of any accidents and/or when the PHA is updated every five years."
    }
  ]
}