{
  "FacilityID": 32316,
  "FacilityName": "Red Wash 24B Gas Plant",
  "FacilityStr1": "11002 East 17500 South",
  "FacilityStr2": null,
  "FacilityCity": "Vernal",
  "FacilityState": "UT",
  "FacilityZipCode": "84078",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "49047",
  "LEPC": "Uintah County LEPC",
  "FacilityLatDecDegs": "40.196833",
  "FacilityLongDecDegs": "-109.272306",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.Questar.com",
  "FacilityEmailAddress": "Jeff.Ingerson@questar.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Questar Gas Management Company",
  "Company2Name": "Questar Corporation",
  "CompanyDUNS": 9140559,
  "Company2DUNS": null,
  "OperatorName": "Questar Gas Management Company",
  "OperatorStr1": "180 East 100 South",
  "OperatorStr2": "P.O. Box 45601",
  "OperatorCity": "Salt Lake City",
  "OperatorStateFIPS": "UT",
  "OperatorZipCode": "84145",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": "UTD089320402",
  "EPAFacilityID": "100000057092",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "4700021001",
  "SafetyInspectionDate": "2004-04-07 00:00:00",
  "SafetyInspectionBy": "State boiler inspector",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 40.196672,
  "FRS_Long": -109.28061,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "12.2",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46740,
      "AltID": "Natural Gas Compression",
      "FacilityID": 32316,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 61590,
          "ProcessID": 46740,
          "ChemicalID": 155,
          "Quantity": 179111.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 45179,
              "ProcessChemicalID": 61590,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 45180,
              "ProcessChemicalID": 61590,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 45181,
              "ProcessChemicalID": 61590,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 45182,
              "ProcessChemicalID": 61590,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 45183,
              "ProcessChemicalID": 61590,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 45184,
              "ProcessChemicalID": 61590,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 45185,
              "ProcessChemicalID": 61590,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 47775,
          "ProcessID": 46740,
          "NAICSCode": "211111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 32316,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-02-23 00:00:00",
    "ERTrainingDate": "2004-02-23 00:00:00",
    "CoordinatingAgencyName": "Uintah County LEPC",
    "CoordinatingAgencyPhone": "4357815336",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32316,
      "SummaryText": "REDWASH 24B GAS PLANT\nRISK MANAGEMENT PLAN, EXECUTIVE SUMMARY \n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES \n\nQuestar Gas Management Company (QGMC) operates the Red Wash 24B gas plant. The 24B gas plant, located in the Red Wash Unit field, is approximately 20 miles South East of the town of Vernal.  The plant was designed to process 100 mmscfd of natural occurring hydrocarbon gas.  \n\nThe primary activities of the 24B plant involving RMP regulated substances is compressing natural gas for sale to a natural gas pipeline. The gas product in our facility contains methane, ethane, propane, butane, isobutane, pentane, isopentane and heavier hydrocarbon liquids.  Hydrogen Sulfide, water and heavier hydrocarbon liquids are removed from the gas prior to sale so that it is suitable for use by homes and businesses. (The retailer, to enable leak detection by the consumer, adds an odorant to the gas).\n \n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nIt is the policy of QGMC to conduct its business in a socially responsible and ethical manner that protects safety, health and the environment.  The Red Wash Emergency Preparedness and Response Policy involves assessing the hazards and risks of an unplanned incident; developing a plan for managing those hazards and risks; communicating relevant information to employees, contractors and appropriate agencies; and conducting emergency exercises.   \n \n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n \nQGMC encourages employees to participate in all facets of process safety management and accident prevention.  Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a process hazard analysis (PHA) team.  Employees have access to all information created as part of the Red Wash accident prevention program element. \n\nThe 24B gas plant keeps a variety of technical documents that are used to help maintain safe operation of the proces"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32316,
      "SummaryText": "ses.  These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories and equipment design basis/configuration information.  Chemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs).\nFor the compression of natural gas at the 24B gas plant, QGMC has documented safety-related limits for specific process parameters (e.g. temperature, pressure, level, flow,) in the process safety manuals.  QGMC ensures that the processes are maintained within these limits using process controls and monitoring instruments, highly trained personnel and protective instrument systems (e.g. automated shutdown systems).\n\nThe Red Wash 24B plant has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled.  Within this program, each process is systematically examined to identify hazards and that adequate controls are in place to manage these hazards.\n\nThe Red Wash 24B plant maintains written procedures that address various modes of process operations such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, and (5) normal shutdown.  To complement the written procedures for process operations, QGMC has implemented a comprehensive training program for all employees involved in operating the Gas plant. \n\n\nFIVE-YEAR ACCIDENT HISTORY\nThe 24B gas plant has an excellent record of accident prevention.  There have been no releases from the RMP covered processes in the last five years.\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nQGMC maintains a written emergency response program, including the 24B gas plant, which is in place to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32316,
      "SummaryText": "if a flammable substance is accidentally released.  The procedures follow the standard Incident Command System to address all aspects of emergency response, including: proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident cleanup and decontamination requirements.\nIn addition, the plant has procedures that address maintenance, inspection, and testing of emergency response equipment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is reviewed annually and updated when necessary based on modifications made to the gas plant processes or other Red Wash operations.  The emergency response program changes are administered through the MOC process, which includes informing and/or training affected personnel in the changes.\n\nThe overall emergency response program for the Red Wash 24B gas plant is coordinated with the Uintah County Local Emergency Planning Committee (LEPC). The Red Wash gas plant, and other areas of the Red Wash field, conduct periodic emergency drills and invite members of the emergency response community to participate. Copies of QGMC's emergency response plan are available to LEPC members."
    }
  ]
}