{
  "FacilityID": 32353,
  "FacilityName": "Lake City Water Treatment Facility",
  "FacilityStr1": "928 SE Putnam Street",
  "FacilityStr2": null,
  "FacilityCity": "Lake City",
  "FacilityState": "FL",
  "FacilityZipCode": "32025",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12023",
  "LEPC": "District 3 LEPC",
  "FacilityLatDecDegs": "30.185556",
  "FacilityLongDecDegs": "-082.622500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Lake City",
  "Company2Name": null,
  "CompanyDUNS": 20983110,
  "Company2DUNS": 0,
  "OperatorName": "City of Lake City",
  "OperatorStr1": "150 NW Alachua Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Lake City",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32055",
  "OperatorZipCodeExt": null,
  "RMPContact": "Stephen A. Roberts",
  "RMPTitle": "Water Facilities Manager",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000023841",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-11-12 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Disinfection",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-01-13 00:00:00",
  "DeRegistrationEffectiveDate": "2006-01-04 00:00:00",
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 30.18586,
  "FRS_Long": -82.62344,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility does not have more than TQ of any extremely hazardous substance.",
  "_processes": [
    {
      "ProcessID": 46788,
      "AltID": "Chlorination",
      "FacilityID": 32353,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 47825,
          "ProcessID": 46788,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 61654,
          "ProcessID": 46788,
          "ChemicalID": 62,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 561654,
          "ProcessID": 46788,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32353,
      "SummaryText": "The City of Lake City owns and operates the Lake City Water Treatment Facility (WTF), located at 1650 East Putnam Street in Lake City, Florida.\n\nLike the majority of municipal water treatment plants in the United States, gaseous chlorine is used at the Lake City WTF as a disinfectant to destroy pathogenic organisms in the treated water.  The popularity of chlorine as a water disinfectant is mainly due to its effectiveness and ability to provide a measurable residual.\n\nThe same properties that make chlorine valuable as a disinfectant also make it necessary to observe certain safety precautions in handling chlorine as a safeguard to our workers, our community, and the environment.  Chlorine is notably irritating to the eyes, nose, throat and lungs.  More serious human health effects could result from much higher chlorine exposure, such as intense coughing, chest pains, and in extreme cases, death.\n\nLake City's commitment at the WTF is to store, handle and use chlorine in a manner that achieves the needed benefits of disinfection while minimizing both onsite and offsite risks.  This is accomplished by designing a safe process, maintaining the process in optimum working condition, operating safely through documented procedures and extensive training, and providing an emergency response capability to minimize the consequences of a chlorine release, should a process accident ever occur. \n\nAccidental Release Prevention and Emergency Response Policies\n\nIt is Lake City's policy to adhere to all applicable Federal, State of Florida and local rules and regulations.  This specifically includes compliance with the Occupational Safety and Health Administration (OSHA) and Environmental Protection Agency (EPA) rules for chlorine accidental release prevention and emergency response.\n\nThe primary measures for accidental chlorine release prevention are contained in the document entitled Process Safety Management/Risk Management Program for the Lake City Water Treatment Facility.  This"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32353,
      "SummaryText": " process safety management (PSM) document was prepared in conformance with the EPA risk management rules, as well as industry-specific guidelines and best management practices relevant to release prevention.  Lake City's Water Facilities Manager has the responsibility for ensuring that this program is implemented in the workplace as written.\n\nThe WTF emergency response plan relies on a team of onsite trained personnel and, as necessary, offsite mutual-aid groups such as fire and rescue services.  The emergency response plans at the WTF are based on the Incident Command system, where onsite responders work in coordination with local hazardous materials response teams to implement the City and regional response plans. Lake City's personnel receive hazard awareness training to understand how to recognize emergencies and to initiate the Incident Command system.\n\nStationary Source and Regulated Substances Handled\n\nChlorine is received by the facility by truck and is stored in one-ton chlorine cylinders fabricated to Department of Transportation (DOT) specifications.  Upon arrival at the site, all chlorine cylinders are thoroughly inspected and if there is any doubt about the integrity of the cylinder, it is promptly refused.  Once accepted, the cylinders are stored inside a building equipped with a chlorine detector that immediately notifies the operators of a release should a leak occur.  Six cylinders are connected to the disinfection process: three are in-use, and three are as standby.  The standby cylinders will automatically switchover when the in-use cylinders become empty, ensuring continuous disinfection.\n\nThe Worst-Case and Alternative Chlorine Release Scenarios\n\nAs part of the emergency prevention and response efforts, a hazard assessment was conducted in compliance with EPA requirements contained in 40 CFR 68, Subpart B.  The hazard assessment included the development of worst-case and alternative release scenarios. The hazard assessment was recently updated i"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32353,
      "SummaryText": "n accordance with the 40 CFR 68 5-year requirement.  The distance to endpoint calculations were performed using EPA's RMP*Comp model.  The RMP*Comp model was developed specifically for compliance with the accidental release prevention requirement for predicting the travel distance of an accidental release.        \n\nGeneral Accidental Release Prevention Program and Specific Prevention Steps\n\nThe City's PSM document contains 13 essential release prevention elements.  Some of the key accidental release prevention elements of the PSM program are as follows:  \n\n* Process hazard analysis: This analysis was performed for each step in the chlorine process, to identify potential process failure scenarios and the appropriate prevention or response measures.  The process hazard analysis will be updated every 5 years.\n\n* Operating procedures review: The review was conducted to ensure that operators are given clear, written instructions for safely operating the chlorine process.\n\n*Training programs: Training is given to each employee assigned to the process with continuing operator training thereafter, with an emphasis on safe chlorine handling and emergency response. \n\n* Mechanical integrity: The integrity and reliability of the process is maintained by implementing preventive maintenance and routine inspection and testing procedures.\n\n* Incident Investigation: The City investigates within 48 hours any accidents or \"near misses\" that could have resulted in a chlorine release, in order to develop measures to prevent a recurrence.\n\nThe above elements are only part of Lake City's aggressive process safety program.  In addition to the Program 3 elements, the City has established related OSHA safety programs such as hot work and confined space.  These OSHA safety programs apply to both Lake City and contractor employees. \n\nFive-year Accident History\n\nThere have been no accidents involving chlorine at the Lake City WTF in the past five years.  \n\nEmergency Response Program\n\nThe emerge"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32353,
      "SummaryText": "ncy response plan covers all aspects of emergency response including escape procedures and routes, procedures for post-evacuation employee accounting, notification procedures, rescue and medical duties, and response procedures for spills or leaks.  If a major chlorine leak were to occur, the emergency plan requires immediate notification of the regional hazardous materials response teams for assistance, including orderly evacuation or sheltering-in-place of the surrounding community."
    }
  ]
}