{
  "FacilityID": 3238,
  "FacilityName": "AlliedSignal Specialty Wax and Additives Emlenton",
  "FacilityStr1": "1001 Hill",
  "FacilityStr2": null,
  "FacilityCity": "Emlenton",
  "FacilityState": "PA",
  "FacilityZipCode": "16373",
  "Facility4DigitZipExt": "0660",
  "FacilityCountyFIPS": "42121",
  "LEPC": "Venango County LEPC",
  "FacilityLatDecDegs": "41.1775",
  "FacilityLongDecDegs": "-79.716667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "WR",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "AlliedSignal",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "AlliedSignal",
  "OperatorStr1": "101 Columbia Road",
  "OperatorStr2": null,
  "OperatorCity": "Morristown",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07962",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert A. Roberts",
  "RMPTitle": "Process Safety Manager",
  "FTE": 80,
  "OtherEPAFacilityID": "16673QKRSTHILLS",
  "EPAFacilityID": "100000039148",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-05-07 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2000-03-27 00:00:00",
  "DeRegistrationEffectiveDate": "2000-01-28 00:00:00",
  "AnniversaryDate": "2004-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 41.18083,
  "FRS_Long": -79.71889,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3627,
      "AltID": "Deoiler",
      "FacilityID": 3238,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3700,
          "ProcessID": 3627,
          "NAICSCode": "32599",
          "_desc": {
            "NAICS_CODE": "32599",
            "NAICS_DESCRIPTION": "All Other Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3879,
          "ProcessID": 3627,
          "ChemicalID": 56,
          "Quantity": 17000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503879,
          "ProcessID": 3627,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3238,
      "SummaryText": "The AlliedSignal Inc. Emlenton Plant is a manufacturing facility located in Emlenton, Pennsylvania.  It is part of the Specialty Chemicals Business Unit of AlliedSignal Inc.  Headquartered in Morris Township, New Jersey, AlliedSignal is an advanced technology and manufacturing company serving customers worldwide with aerospace and automotive products, chemicals, fibers, plastics and advanced materials.  With 1998 sales of approximately $15 billion, the company ranks among the top 100 of the Fortune 500.  AlliedSignal has approximately 70,500 employees at 300 facilities in 40 countries.  AlliedSignal operates twelve major businesses: Aerospace Equipment Systems, Aerospace Engines, Electronic and Avionic Systems, Aerospace Marketing Sales and Services, Federal Manufacturing and Technologies, Polymers, Specialty Chemicals, Electronic Materials, Consumer Products Group, Turbocharging Systems, Truck Brake Systems and Friction Materials.  More information about AlliedSignal may be found at its Web Page: www.AlliedSignal.com.\n\nIt is the world wide policy of AlliedSignal to design, manufacture and distribute its products and to handle and dispose of materials throughout their life cycle in a manner that protects the environment and safeguards employees, customers and the public from unacceptable risk.  AlliedSignal's complete Health, Safety and Environmental Policy may be found at the AlliedSignal Web Page.\n\nThe AlliedSignal Emlenton Plant participates in the Responsible Care program of the Chemical Manufacturers Association.  The Community Awareness and Emergency Response Code of Responsible Care brings chemical plants and local communities together through communications and cooperative emergency planning. The Process Safety Code of Responsible Care is designed to prevent fires, explosions, and accidental chemical releases.  The code requires safety audits, inspection and maintenance programs, and safety training for employees and contract workers.  Facilities are encoura"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3238,
      "SummaryText": "ged to listen to the concerns of the community and to consider these concerns when designing and implementing process safety systems. \n\n \nThe following seven elements describe policies, activities and information at the AlliedSignal Emlenton Plant which are consistent with and support the requirements of the RMP rule.\n\n1. Accidental release prevention and emergency response policies\n\nIt is the policy of the AlliedSignal Emlenton Plant to operate a safe and environmentally sound facility by identifying and controlling health, safety, and environmental risks related to its operations; by designing its processes to protect people, property and the environment; by conducting and continually reviewing and improving programs for safety, health and environmental excellence; and by establishing processes to assure that all laws and regulations applicable to its operations and products are known and observed.\n\nThe AlliedSignal Emlenton Plant is committed to assuring that accidental release prevention is integrated into the design and operation of processes affected by the RMP rule.  This is accomplished by checking materials compatibility requirements, proper sizing and selection of equipment, providing procedures for monitoring key process conditions, employee training, conducting equipment inspections and preventive maintenance, maintaining communications systems, and observing site security and safety rules.\n\nThe AlliedSignal Emlenton Plant maintains a professionally trained Emergency Response Team, and emergency response equipment and supplies.  The Emergency Response Team meets regularly to review emergency response procedures and conduct drills. The supplies of emergency response equipment are inspected regularly by designated employees to assure availability and adequacy.\n\n2. Stationary source description and regulated substances handled\n\nThe AlliedSignal Inc. Emlenton Plant is a manufacturing facility located in Emlenton, Pennsylvania. The AlliedSignal Emlenton Plant"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3238,
      "SummaryText": " processes fully refined paraffin and micro crystalline waxes from various petroleum distillate feed stocks. Feed stocks are shipped into the facility via tank trucks. Finished products are shipped from the site via the same method. The plant has approximately 83 employees and operates 24 hours per day. The one chemical at the Emlenton Plant that is subject to the RMP regulation is anhydrous ammonia. \nAnhydrous ammonia is a colorless gas with a strong pungent odor. At the Emlenton Plant ammonia is used as a refrigerant to cool the charge stock to the Deoiling Unit. The normal maximum inventory of ammonia at the plant is 17,000 pounds.\n\n3. Worst case scenarios and alternative release scenarios\n\nEPA's Risk Management Program requires the Emlenton Plant to prepare an analysis of a hypothetical worst case release of the chemical covered by the RMP regulation. EPA defines a worst case release as the release of the largest quantity of the chemical from a vessel or process line failure. EPA also assumes that the failure takes place over 10 minutes and that all safety systems fail to operate. In addition, the release must take place during the worst possible weather conditions. For a number of reasons discussed in this submittal, it is extremely unlikely that this event would ever occur.\nThe Emlenton Plant is also required to analyze the impact of an alternative accidental release scenario.\nAt the AlliedSignal Emlenton Plant the one chemical which is currently subject to the RMP rule is ammonia. Ammonia is classified as a toxic under the RMP rule.  \n a) Worst Case Scenarios\nThe worst case scenario for ammonia involves the failure of an ammonia storage tank containing 5,200 pounds of anhydrous ammonia, assuming the vessel is filled to its capacity. The anhydrous ammonia is released as a gas to the atmosphere. The plant is located in a populated area and the cloud formed by the escaping ammonia would reach offsite endpoints and nearby public receptors. \n\nb) Alternative Releas"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3238,
      "SummaryText": "e Scenario\nThe alternative release scenario considered for anhydrous ammonia would involve the failure of a transfer hose being used to offload a tank truck of ammonia. The excess flow valve on the truck would automatically close and limit the amount of ammonia released. This release of ammonia would have an offsite impact.\n\n4. General accidental release prevention program and chemical-specific prevention steps\n\nThe general accidental release prevention program at the AlliedSignal Emlenton Plant consists of 12 elements.  Each of these elements is described below.\n \n4a. Process Safety Information\n\nWritten process safety information is compiled before conducting process hazard analyses for processes using ammonia.  This enables the employees involved in operating these processes to identify and understand the potential hazards associated with the processes.  The information compiled includes data on the safe use and handling of ammonia (e.g., Material Safety Data Sheets), data on the process technology (e.g., Process Flow Diagrams, process chemistry, flow rates and storage capacities, operating limits and evaluation of exceedances), and data on the equipment used in the process (e.g., Piping & Instrument Diagrams, materials compatibility, energy ratings and classification, control devices and emergency systems, ventilation systems, design basis including conformance to applicable codes and standards).  The process safety information is adequate to show compliance of the process design with generally accepted good engineering practices.\n\n4b. Process Hazard Analyses\n\nProcess hazard analyses for the processes involving ammonia have been completed in accordance with 29 CFR 1910.119(e) (OSHA Process Safety Management).  These process hazard analyses are updated and revalidated in accordance with 29 CFR 1910.119(e), and are retained on site for the life of the process.\n\nIn general, one or more of the following methodologies are used to complete each process hazard analysis:"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 3238,
      "SummaryText": " (a) what-if evaluation; (b) checklist; (c) hazard and operability study (HAZOP); (d) failure mode and effects analysis (FMEA); (e) fault tree; (f) process mapping, and; (g) cause and effect matrix.  Each process hazard analysis addresses the process hazards, process incident history, process control devices and detection systems, evaluation of failure of process control devices, equipment location, and human factors.  Each process hazard analysis is performed by a team of employees having experience and knowledge of the process design and operation, and knowledge of how to complete a process hazard analysis.  The Management of Change process (described below) is used to track and document process changes, which occur as a result of recommendations from process hazard analyses.\n\n4c. Operating Procedures\n\nWritten operating procedures are prepared for each of the processes involving ammonia. The operating procedures provide clear instructions for safely conducting activities in the plant.  The procedures are updated to reflect current operating practices, and are certified annually for accuracy.\n\nSpecific information and instructions covered by the operating procedures include startup, normal operation, emergency operation, shutdown, operating limits, operating controls, chemical-specific health and safety information, required personal protective equipment, and use of safety systems.  Written procedures are also provided for specific operations such as lockout/tagout, confined space entry and line breaking.\n\n4d. Training\n\nEmployees currently engaged in operating processes involving ammonia have received training to ensure they have the required knowledge, skills, and abilities to safely carry out the requirements specified in the written operating procedures.  Refresher training is provided every three years at a minimum, or sooner if warranted by changes to operating conditions, equipment or procedures.  If refresher training is required more frequently than every t"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 3238,
      "SummaryText": "hree years, it would be triggered through the Management of Change process (described below).  Training records are maintained for each employee to show the date training was conducted, the material covered by the training, and the means used to verify that the training was understood.\n\n4e. Mechanical Integrity\n\nThe AlliedSignal Emlenton Plant maintains the mechanical integrity of equipment used to process and handle ammonia.  Such equipment includes pressurized vessels, storage tanks, piping systems, pressure relief and vent systems, emergency control devices, pumps, and valves.  Written procedures are established to define the scope and requirements of the mechanical integrity program.  Maintenance employees engaged in carrying out the mechanical integrity program are trained to complete the required tasks in a safe manner.\n\nOne component of the mechanical integrity program includes inspection and testing of covered equipment.  Equipment inspection and testing is conducted in accordance with manufacturer's recommendations and generally accepted good engineering practices.  Records of inspections and testing are maintained to show the date, equipment identification, inspector, type of test or inspection performed, and test results or observations.  If deficiencies are noted during equipment inspection and testing, corrective actions are taken in a timely manner to assure safe operation of the process.  In some cases, equipment inspections are driven by permit requirements as well as the mechanical integrity program. \n\n4f. Management of Change\n\nA Management of Change item is a change (except for replacement in kind) to equipment, process chemicals, technology, procedures, or a change to the facility that will affect a covered process. Work orders for such changes pass through the Safety Department and Engineering to assure that proper materials of construction and good engineering practices are employed. Engineering will make changes to the P & ID's to keep the proc"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 3238,
      "SummaryText": "ess safety information up to date. Process and maintenance personnel are trained prior to start up of a modified process.\n\n4g. Pre-startup Review\n\nPrior to startup of a new process involving ammonia, a pre-startup safety review is conducted to ensure that the equipment and installation meets design specifications, a process hazard analysis has been completed, employee training has been completed, and safety, operating, maintenance, and emergency procedures are in place.\n \n4h. Compliance Audits\n\nSelf-assessed compliance audits for processes involving ammonia are conducted every three years at a minimum to ensure that the elements of the general accidental release prevention program are up to date and are being implemented.  The compliance audits are conducted by a team of employees having experience and knowledge of the covered processes, and knowledge of the program requirements.  Records of the compliance audit reports are maintained to document the results of the audits and corrective actions taken, if necessary.\n\n4i. Incident Investigation\n\nAll incidents, which resulted in, or could have resulted in, a release of ammonia are investigated promptly.  The incident investigation starts with the completion of an Incident Investigation Report prepared by the supervisor on duty at the time of the incident, and is distributed to the incident investigation team.  The incident investigation team is made up of employees having experience and knowledge of the processes affected by the incident, and knowledge of completing incident investigations.  Following the incident investigation, a report is prepared to include the following information: (a) date, time, and location of the incident; (b) employees involved in the incident, and their roles; (c) date of the incident investigation; (d) names of employees on the incident investigation team; (e) description of the incident, including a chronology of events; (f) root causes and contributing causes, including conditions at the "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 3238,
      "SummaryText": "time of the incident, and; (g) recommendations to prevent a recurrence.  Follow-up actions, which are taken as a result of the recommendations in the incident investigation report, are documented, and records of the reports and follow-up actions are maintained for a minimum of 5 years for future reference.\n\n4j. Employee Participation\n\nAll employees at the AlliedSignal Emlenton Plant have opportunities to access and participate in the sharing of information related to process safety for the processes involving ammonia.  Employees in the maintenance and operating areas attend monthly safety meetings to review incidents, learn about new or modified processes, and discuss specific safety awareness topics. Employees routinely have opportunities to participate in other safety processes under the prevention program such as process hazard analyses, management of change, employee training and incident investigations.\n\n4k. Hot Work Permits\n\nThe AlliedSignal Emlenton Plant has established a hot work permit system.  Under the system, a hot work permit must be issued prior to commencing hot work operations.  Hot work operations may include burning, welding, or torch cutting.  The hot work permit indicates the type and method of hot work to be conducted, the equipment the hot work will be performed on, the date, time, and location authorized for the hot work, the presence of fire prevention and protection systems meeting the requirements of 29 CFR 1910.252(a), and signatures of the supervisory employees authorizing the hot work.  A separate hot work permit must be issued for each hot work operation, and a separate hot work permit must be issued for each day.  A copy of the hot work permit must be displayed at the job location while hot work is in progress, and the permit is maintained on file after the completion of the hot work.\n\n4l. Contractors\n\nPrior to retaining contractor services for work in the Emlenton Plant, the contractor's safety performance and program are evaluated. "
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 3238,
      "SummaryText": " This includes a 3 year review of the contractor's Total Case Incident Rate (TCIR), review of OSHA recordable injuries and illnesses and corrective actions, review of Lost Work Day Cases Away (LWDCA) and corrective actions, review of the contractor's safety program including safety policies, training, and medical monitoring, and review of any applicable site-specific health and safety plan (HASP) prepared by the contractor.  The information supplied by the contractor is retained on site while the contractor is engaged in work activities.\nPrior to commencing work on site, each contractor employee receives a safety orientation provided by AlliedSignal.  The safety orientation covers information on the hazards associated with the process areas where the work will be performed, safety procedures and systems to be used, overview of the site emergency response program including specific procedures to be followed in case of emergency, and a review of site safety rules and applicable operating procedures.  A record of each contractor employee's sign-off on the safety orientation is maintained on file at the site, including the date the training was completed.  Once the safety orientation is complete, the contractor is responsible to ensure that each contractor employee performs the assigned work in a manner consistent with the information provided during the safety orientation.  If the contractor assigns new employees to the job after work has commenced, the contractor must also ensure that each new employee receives a safety orientation prior to starting work on site.  Failure of the contractor or any contractor employee to abide by these requirements is grounds for immediate dismissal from the site.\n\n5. Five-year accident history\n\nIn the past 5 years, there have been no accidental releases of ammonia from the AlliedSignal Emlenton Plant, which meet the reporting requirements described in the RMP rule.\n\n6. Emergency response program\n\nThe AlliedSignal Emlenton Plant has an "
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 3238,
      "SummaryText": "emergency response program for the purpose of protecting public health and the environment. The written Emergency Response Plan includes information on employee training in emergency response procedures, procedures to review and update the plan, and procedures for the use, inspection, testing, and maintenance of emergency response equipment.\n\nThe Emergency Response Plan includes procedures for emergency response after an accidental release of ammonia at the plant.  The Emergency Response Plan also includes procedures for administering first aid and emergency medical care as required in case of exposure following a release.  The Emergency Response Plan includes notification procedures for informing the public and outside agencies in case an accidental release occurs.  Outside agencies such as fire departments, local emergency planning committees and state environmental agencies are notified according to regulatory reporting requirements at a minimum, and as necessary to provide or assist with emergency response. \nThe Emergency Response Plan is coordinated with the local emergency planning committees, and information in the plan is readily available to the local emergency response officials for the purpose of developing and implementing the community emergency response plans.  Offsite community response activities are implemented in accordance with the community emergency response plans as developed by the local emergency planning committees.  Representatives from the AlliedSignal Emlenton Plant meet regularly with the local emergency planning committees to review procedures, training requirements, equipment needs, and to conduct emergency response exercises.\nThe facility Emergency Response Plan has been communicated to the Local Emergency Planning Committee and approved by the membership. \n \nEmergency Response Procedure:\n\nThe facility Emergency Response Plan has been communicated to the Local Emergency Planning Committee and approved by the membership. A Tabletop dri"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 3238,
      "SummaryText": "ll was conducted at the facility utilizing all environmental and safety personnel on April 12, 1999.\n\nProcedure:\n\nIn the event of a chemical release\nA.\n1.  The Facility Emergency Coordinator or his representative will contact Venango County Emergency Management by telephone (911).\na.  Advise the nature of the incident (Fire, Explosion, or Hazardous chemical release)\nb.  Advise of materials involved\nc.  Advise if evacuation or shelter-in-place should be initiated and the area to be included\n\n2.  The FEC will then notify SARA notification points\na.  County EMA (LEPC)  814-667-7356\nb.  PA Emergency Response Commission  1-800-424-7362\nc.  National Response Center (If required)  1-800-424-8802\n\n3.  The FEC will then meet emergency response units at the staging area\n\nB.\n1.  Venango County 911 will notify the following:\na.  Emlenton Fire Department (Trip No.)\nb.  Trip first alarm assignment according to run card\nc.  State Police  814-676-6569\nd.  Emlenton Ambulance  724-867-2321\ne.  County EMA Coordinator\n     work  814-437-6871 ext. 192\n     home  814-676-2192\n\nIf local residents are required to remain indoors by the Facility Emergency Coordinator, notify:\n\nf.  WFRA  814-432-2188  to activate Emergency Broadcast System\n\nC.\n1.  Action by Local Fire Department\na.  Respond in accordance with dept. SOP for the particular type of incident\nb.  Report to assigned locations\nc. Other fire departments will respond to staging area or as directed\n\n\nIf an evacuation has been advised:\n\nd.  Dispatch units to alert residents\ne.  Establish initial traffic control points\n\nD.\n1.  Action by Police Department\na.  Assist at traffic control points\nb.  Provide crowd/ spectator control\nIf an evacuation has been advised:\nc.  Dispatch vehicles to alert residents\n\nE.\n1.  Action by Emergency Medical Services\na.  Respond to staging area\n       EMS will report to UnitMart for initial staging\n       Upon request from AlliedSignal, move to lower gatehouse\nb.  Set up a Med. Area\nc.  Advise hospital of sit"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 3238,
      "SummaryText": "uation\nd.  Provide health monitoring for emergency responders\n2.  Second responding ambulance to stand by at Bridgeview Apartments \n                                        \n\n\nMore details of the facility Emergency Response Plan can be accessed through the Venango County LEPC.\n\nPlanned Action to Improve Safety\n\nThe Deoiling Process Unit has recently been reinstrumented with the latest technology in computer operated controls. This improvement has provided the operators a much better means of monitoring the operation of the new ammonia compressor. Area ammonia sensors will notify the operators of an ammonia leak.\n\nAll personnel are trained to operate new equipment per the facility Management of Change process. \n\nSafety and environmental audits are conducted by trained safety and environmental specialists. Audit reports with recommendations and action item lists are reviewed by management staff on a regular basis."
    }
  ]
}