{
  "FacilityID": 3250,
  "FacilityName": "Harris Semiconductor Sector - Mountaintop (HSSM)",
  "FacilityStr1": "125 Crestwood Road",
  "FacilityStr2": null,
  "FacilityCity": "Mountaintop",
  "FacilityState": "PA",
  "FacilityZipCode": "18707",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42079",
  "LEPC": "Luzerne County LEPC",
  "FacilityLatDecDegs": "41.147222",
  "FacilityLongDecDegs": "-75.875",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5995246,
  "ParentCompanyName": "Harris Semiconductor International",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Harris Semiconductor International",
  "OperatorStr1": "2401 Palm Bay Road NE",
  "OperatorStr2": null,
  "OperatorCity": "Palm Bay",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32905",
  "OperatorZipCodeExt": null,
  "RMPContact": null,
  "RMPTitle": "Plant Manager",
  "FTE": 675,
  "OtherEPAFacilityID": "PAD003031846",
  "EPAFacilityID": "100000039353",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-19 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-04-28 00:00:00",
  "DeRegistrationEffectiveDate": "2004-04-15 00:00:00",
  "AnniversaryDate": "2004-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 41.14222,
  "FRS_Long": -75.8938,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3657,
      "AltID": "Epitaxial Growth (EPI)",
      "FacilityID": 3250,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3730,
          "ProcessID": 3657,
          "NAICSCode": "334413",
          "_desc": {
            "NAICS_CODE": "334413",
            "NAICS_DESCRIPTION": "Semiconductor and Related Device Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3910,
          "ProcessID": 3657,
          "ChemicalID": 54,
          "Quantity": 27000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 54,
            "ChemicalName": "Hydrogen chloride (anhydrous) [Hydrochloric acid]",
            "CASNumber": "7647-01-0",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503910,
          "ProcessID": 3657,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3250,
      "SummaryText": "Executive Summary:\nEnvironmental and Safety Policy:\nIt is the policy of Harris Semiconductor Sector- Mountaintop (HSSM) to conduct itself as a good corporate citizen with all Federal, State, and Local environmental laws and regulations, and to comply with Corporate Environmental Policy G-17.  HSSM strives continuously to maintain safe operations and implements safe operating procedures in all processes at the facility.  To this effect, HSSM has developed and implemented an Integrated Compliance Plan (ICP) for compliance with all applicable environmental and safety regulations.\n\nFacility Description:\nThe HSSM facility manufactures Bipolar and MOSFET semiconductor power devices and MIGPs. The facility is located in the Crestwood Industrial Park in Mountaintop, Luzerne County, Pennsylvania.  The contiguous 40-acre facility is bordered by residential townships to the north, industry to the west and south, and woods to the east.  The physical plant covers approximately 6 acres and includes two main manufacturing units referred to as the \"Old building\" and the \"Fab 8\".  HSSM also maintains a chemical laboratory to test devices and perform analysis on process chemicals.  Other major parts of the facility are the Warehouse, and an aboveground storage tank (AST) containing hydrogen.  The facility also incorporates two nitrogen plants, several gas container storage buildings, two facility-operated wastewater treatment units, three ASTs containing oil, waste solvent, and hydrochloric acid, and several other storage buildings.\n\nRegulated Substance(s):\nBased on a comprehensive review, HSSM has identified the following substances regulated by the United States Environmental Protection Agency's (EPA) Risk Management Program (RMP) (regulated substances) at the facility: i) anhydrous hydrogen chloride; ii) chlorine gas; iii) hydrofluoric acid (in mixtures); iv) nitric acid; v) hydrogen; and vi) trichlorosilane.  The maximum quantities available on site (facility-wide) vary with prod"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3250,
      "SummaryText": "uction demand and are between 380 lbs (chlorine) and 79330 lbs (mixture containing hydroflouric acid). Inventory estimates showed that all regulated substances except anhydrous hydrogen chloride are below the threshold quantity (TQ) in any single process for applicability of RMP.  The provisions of the RMP therefore applies only to the process using anhydrous hydrogen chloride\n\nAnhydrous hydrogen chloride is used for cleaning of semiconductor surfaces prior to and after chemical vapor deposition.  The substance is stored in a trailer containing seven manifolded tubular storage tanks.  The substance is delivered to the reactors through a network of piping and control boxes.\n\nWorst-Case Release Scenario:\nThe worst-case release scenario (WCS) was based on catastrophic rupture of the single largest vessel in the process, which was a 3000-lb of anhydrous hydrogen chloride contained in a tubular tank on the trailer.  As per the RMP, the entire quantity of the substance was considered to be released over a 10-minute period. No administrative control or passive mitigation measures are in place and therefore were not considered. RMP default meteorological data was selected and EPA's RMP*COMP software was used for determining the impact distance. The scenario was shown to have an off-site impact.\n\nHSSM believes that the scenario is extremely unlikely.  First, the tank pressure is approximately 615 psig and the tank is designed to withstand much higher pressure.  Second, per the existing process safety management (PSM) practices at the facility for this process, the tanks are regularly inspected and tested for mechanical integrity.  Third, the area is not known to have earthquakes or tornado activities.  Finally, a catastrophic release from such tanks has never been reported in the industry.    \n\nAlternative Release Scenario:\nSeveral alternative release scenarios (ARS) were evaluated for the process.  The scenarios were selected based on process hazard analysis performed by th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3250,
      "SummaryText": "e facility, EPA guidelines, and industry guidelines.  HSSM believes that these scenarios are more likely than the WCS, though still unlikely in view of the on-going PSM practices.  No administrative control was considered.  Credit was taken for 90% removal of the released gas in a continuously operating water scrubber. RMP default meteorological data was selected, and EPA's RMP*COMP software was used for determining off-site impact.  For all ARSs, the distance to the endpoint was less than 0.1 miles, which is the minimum distance used in RMP*COMP.  Though this distance is reported in the plan, HSSM firmly believes that the impact of the ARSs will be less than 0.1 miles and will not extend off-site.\n \nAccident Prevention Program:\nThe HSSM facility has developed and implemented a PSM program for the process using hydrogen chloride.  Regular inspections of all process components are performed by HSSM or the contractor supplying the anhydrous hydrogen chloride tanks.  Safe operating procedures are regularly reviewed and updated whenever necessary.  Both the operators and users are regularly trained in handling anhydrous hydrogen chloride and in emergency response actions.  Gas detectors are installed at all possible areas of release, which will shut off the entire process within 10 seconds of detection of the gas.  In addition, any release within the process equipment will be vented to a water scrubber, which operates continuously.\n\nFive-year Accident History:\nThere had been no history of accidents from the hydrogen chloride storage or delivery process in the last five years. \n\nEmergency Response Program: \nThe facility is not included in the community emergency response plans of Luzerne County.  However, the facility has developed and implemented an emergency response plan that exceeds the requirements of EPA's Integrated Contingency Plan (ICP).  The emergency plan includes emergency and incident notification reporting, emergency health care, emergency response actions,"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3250,
      "SummaryText": " training and drills, and an incident prevention program.  The plan has been updated in December 1998 and will be updated whenever there are changes at the facility that may impact emergency response actions.  Copies of the plan are made available to the local LEPC and fire department (Luzerne County).\n\nSafety Improvements:\nHSSM believes that the processes storing and using anhydrous hydrogen chloride are operated and maintained in a safe manner.  There are no additional plans for changes specific to this process. However, improving safety is an on-going practice at the facility. HSSM plans to take all necessary, realistic, and technically and economically feasible actions to improve safety."
    }
  ]
}