{
  "FacilityID": 32561,
  "FacilityName": "Alan R. Thomas Treatment Plant",
  "FacilityStr1": "3315 SR 442",
  "FacilityStr2": null,
  "FacilityCity": "Edgewater",
  "FacilityState": "FL",
  "FacilityZipCode": "32132",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12127",
  "LEPC": null,
  "FacilityLatDecDegs": "28.950000",
  "FacilityLongDecDegs": "-080.950000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Edgewater",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Rob DeLoach",
  "OperatorStr1": "104 N. Riverside Drive",
  "OperatorStr2": null,
  "OperatorCity": "Edgewater",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32132",
  "OperatorZipCodeExt": "0100",
  "RMPContact": "Rob DeLoach",
  "RMPTitle": "Water Plant Superintendent",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000145602",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-06-21 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-03-22 00:00:00",
  "DeRegistrationEffectiveDate": "2006-12-27 00:00:00",
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 28.95,
  "FRS_Long": -80.95,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-NEAREST INTERSECTION",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "the City no longer uses or stores Chlorine Gas onsite",
  "_processes": [
    {
      "ProcessID": 47038,
      "AltID": "Chlorine",
      "FacilityID": 32561,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 48083,
          "ProcessID": 47038,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 61937,
          "ProcessID": 47038,
          "ChemicalID": 62,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 561937,
          "ProcessID": 47038,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32561,
      "SummaryText": "\n                      RISK MANAGEMENT PLAN\n\n                       EXECUTIVE SUMMARY\n\n                                \n\n                       CITY OF EDGEWATER\n\n                         ALAN R. THOMAS\n\n                     WATER TREATMENT PLANT\n\n                                \n\nBACKGROUND\n\n\n\nThe City of Edgewater Water Treatment Plant (WTP) is firmly committed to providing excellent\n\nservice to its customers while protecting the safety of its neighbors and the surrounding\n\nenvironment.  In order to cleanse the processed water of any bacteria, pathogens, or viruses, the\n\nEdgewater WTP used chlorine to disinfect water at its modern facility located in Edgewater,\n\nFlorida.\n\n\n\nChlorine is one of the best disinfection substances currently produced and has the advantage of\n\nremaining in water as a residual to continue to disinfect any bacteria that may come in contact\n\nwith the water in the pipe lines.  Like other water utilities, the WTP is required to safely store the\n\nchlorine gas.  Chlorine gas is relatively inexpensive and operators are very familiar with handling\n\nchlorine.  Chlorine is stored under pressure in the liquid form in special chlorine cylinders.  A\n\nmaximum of 8 tons of chlorine is typically stored at the water treatment plant, and new deliveries\n\nof chlorine are made monthly.\n\n\n\nChlorine gas is a respiratory irritant and potentially toxic, and to minimize the potential for a\n\nchlorine leak a Risk Management Program has been established by the City of Edgewater Water\n\nTreatment Plant to minimize the risk of chlorine gas release to the surrounding environment. \n\nThe City of Edgewater Water Treatment Facility has never had an accidental chlorine release\n\nwith offsite consequences and in fact, they are in the water treatment business.\n\n\n\nThe absolute worst case scenario as defined by EPA is for the contents of the chlorine container\n\nto be released over a 10 minute period.  A faster or slower release time will likely result in a\n\nsmaller chlorine gas plu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32561,
      "SummaryText": "me.  For the worst case scenario, the wind is nearly calm, the release\n\noccurs at night, the atmosphere is extremely stable, and no actions are taken to stop the leak.  The\n\nmaximum distance this plume could reach and still cause possible long term physical damage to\n\na person who does not evacuate is 3 miles.   An alternative worst case scenario was also analyzed\n\nby the EPA, using more typical release rates, temperature, wind speed, and atmospheric stability. \n\nThis results in a chlorine plume with an endpoint of 0.6 miles assuming no actions are taken to\n\nstop the leak.  For planning purposes, all residents within this distance from the chlorine source\n\nin the direction of the wind will be notified immediately with emergency instructions in the\n\nunlikely event of an uncontrolled release of chlorine gas.   The endpoint distances for the above\n\nscenarios corresponds to 3 parts per million (ppm) chlorine gas in the air.\n\n\n\nThe Environmental Protection Agency (EPA) published 40 CFR, 68, Risk Management Planning\n\n  Accidental Release Prevention Regulations, in June 1996 to implement Section 11 (r)(7) of the\n\nClean Air Act.  Risk Management Plans (RMPs) are required by organizations that exceed a\n\nthreshold amount of a regulated hazardous chemical to help prevent accidents, operate safely,\n\nand to manage the chemicals safely.  The Risk Management Plan will be made available to the\n\npublic so that communities can determine if any additional safeguards should be made. \n\nCompletion of an RMP will also provide the majority of the requirements of the Occupational\n\nSafety and Health Administration (OSHA) Process Safety Management standard enacted in 29\n\nCFR 1190.119.\n\n\n\nThe Risk Management Program established by the City of Edgewater Water Treatment Facility is\n\ndesigned to minimize the risk of a chlorine leak by establishing numerous controls to assess and\n\nprevent any possible hazards.  Some of the measures taken to ensure safety include:\n\n\n\n     ?    Extensive operator tr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32561,
      "SummaryText": "aining on the operation and handling of all chlorine equipment\n\n     ?    Mock chemical emergency drills\n\n     ?    Preventive maintenance and testing program\n\n     ?    Automatic chlorine leak detectors for instantaneous lean notification\n\n     ?    Well designed chlorine system which operates under a vacuum, causing air to leak into\n\n     the system in the vent of a leak\n\n     ?    Maintaining the minimum inventory practical\n\n     ?    Using the latest technology equipment\n\n\n\nThe City of Edgewater Treatment Plant is a modern facility containing reliable equipment.  The professionals\n\noperating the facility are experienced and well trained.  The employees take great pride in serving the City of\n\nEdgewater and are dedicated to providing outstanding, safe service.\n\n"
    }
  ]
}