{
  "FacilityID": 32618,
  "FacilityName": "North District Wastewater Treatment Plant",
  "FacilityStr1": "2575 NE 151 Street",
  "FacilityStr2": null,
  "FacilityCity": "North Miami",
  "FacilityState": "FL",
  "FacilityZipCode": "33160",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12086",
  "LEPC": "District 11 LEPC",
  "FacilityLatDecDegs": "25.918860",
  "FacilityLongDecDegs": "-080.153610",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.miamidade.gov",
  "FacilityEmailAddress": "tmaxw@miamidade.gov",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Miami-Dade Water and Sewer Department",
  "Company2Name": "Miami-Dade County",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Miami-Dade Water and Sewer Dept.",
  "OperatorStr1": "3071 SW 38 Ave",
  "OperatorStr2": null,
  "OperatorCity": "Miami",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33146",
  "OperatorZipCodeExt": null,
  "RMPContact": "Thomas C. Maxwell",
  "RMPTitle": "Assistant Plant Superintendent",
  "FTE": 150,
  "OtherEPAFacilityID": "FLD982163552",
  "EPAFacilityID": "100000094373",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0250600-002-Av",
  "SafetyInspectionDate": "2003-09-23 00:00:00",
  "SafetyInspectionBy": "Dade County GSA Risk Management",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-02-18 00:00:00",
  "DeRegistrationEffectiveDate": "2013-07-09 00:00:00",
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 25.918,
  "FRS_Long": -80.14758,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 47134,
      "AltID": "Wastewater Chlorination",
      "FacilityID": 32618,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 48182,
          "ProcessID": 47134,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 62066,
          "ProcessID": 47134,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 562066,
          "ProcessID": 47134,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32618,
      "SummaryText": "Chlorine is the most commonly used substance for disinfecting treated wastewater.  The Miami-Dade Water and Sewer Department (MDWASD) North District Wastewater Treatment Plant (WWTP) also uses chlorine (for chlorination) for disinfecting treated wastewater to provide safe water discharges to the environment.  Storing and handling large quantities of chlorine can create hazardous situations.  The North District WWTP takes safety obligations in storing and using chlorine as seriously as it takes care in providing the environment safe disinfected water.\n\nThe North District WWTP chlorine handling process is subject to the U.S. Environmental Protection Agency (EPA) Risk Management Program Rule.  This regulation requires submission of a Risk Management Plan (RMP).  An integral part of the RMP is a summary of policies and procedures followed to safely operate the facility, including a description of the possible consequences in case of an accident and the actions, which will be taken, by the facility in an event of an emergency.\n\nThe following information is specifically required in the RMP Executive Summary:\n\n          -  Accidental release prevention and emergency response policies.\n\n          - General facility and regulated substances information.\n\n          - Summary of the accidental release prevention program and chemical-specific prevention steps.\n\n          - Five-year accident history summary.\n\n          - Emergency response program summary.\n\n          - Planned changes to improve safety.\n\nThe above information for the North District WWTP chlorination system is provided below.\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe MDWASD accidental release prevention policy involves a unified approach that integrates proven technology, trains staff in operation and maintenance practices, and uses tested and proven management system practices.  All applicable procedure of the EPA's Prevention Program are adhered to, including key elements such as trai"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32618,
      "SummaryText": "ning, systems management, and emergency response procedures.\n\nThe MDWASD emergency response policy involves the preparation of emergency response plans for hazardous materials which are tailored to each facility and to the emergency response services available in the community, and is in compliance with the EPA Emergency Response Program Requirements.  North District WWTP has prepared an Emergency Response Plan for Hazardous Materials to facilitate coordination and emergency planning with offsite response officials and facilities in the event of an emergency.\n\nGeneral Facility and Regulated Substance Information\n\nThe MDWASD North District WWTP is located at 2575 NE 151 Street, in North Miami, Florida.  North District WWTP is bounded by Sunny Isles Boulevard on the north, the Oleta River on the east, North East 151 Street to the south, and Route 1 to the west.  The treatment plant has a rated capacity of 112 million gallons per day (mgd).  The facility currently stores and uses chlorine, a regulated toxic substance under the EPA rule.  Chlorine is delivered in one-ton containers to the North District WWTP chlorine building.  The chlorine building is divided into a storage room and chlorinator room.  The one-ton containers contain liquid chlorine under pressure.  The chlorine building is equipped to store up to 16 (containers) tons of chlorine.  An estimated 6,400 pounds of chlorine is used per day depending on the season of the year.  The maximum quantity of chlorine present at the North District WWTP at any given time exceeds the listed threshold quantities in the EPA rules.  It also exceeds the listed threshold quantities in the federal Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Standards.\n\nThe pressure from the container forces liquid chlorine through the tubing and into the manifold system.  Downstream of the manifold system, there is a pneumatically actuated automatic shut-off valve.  The valve will also close automatica"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32618,
      "SummaryText": "lly (or manually) when the chlorine sensor senses a leak.  The liquid chlorine flows through the automatic shut-off valve to the evaporators.  At the evaporators, the liquid chlorine is heated and converted into chlorine gas.  The gas then flows from the evaporator through the temperature actuated control valve and the vacuum regulator to the chlorinator.  The chlorinators are used to control the feed rate of the chlorine gas.  The chlorinators are equipped with a gas rotameter and a v-notched orifice for controlling the feed rate.  Injection of the chlorine into the plant water produces the concentrated solution that flows through piping to various injections points in the treatment process.\n\nThe North District WWTP is also provided with a number of safety features to protect the employees and the surrounding community.  The three important safety features are (1) automatic shut-off valves, (2) chlorine leak detection and alarm system, and (3) emergency chlorine gas scrubber system.  The automatic shut-off valves are located immediately downstream of the chlorine containers.  Therefore, if a leak occurs anywhere in the system, (other than in the pigtail or the container itself) the chlorine source can be isolated and the flow of chlorine can be stopped.  The automatic shut-off valves are operated (closed) either automatically due to the detection of chlorine leak by the chlorine sensors or manually by pushing a switch.  Emergency shut-off switches are located inside the chlorine storage room and in the chlorinator room.\n\nThe leak detection system consists of chlorine gas sensors located in both the chlorinator room and the storage room.  The leak detection system is set to activate the alarms and safety processes when a chlorine concentration of 0.5 ppm or higher is detected.  When the leak detection system detects a leak, audible and visual alarms (both local and in the control room) are activated and the automatic shut-off valves closed.  The tripped chlorine ala"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32618,
      "SummaryText": "rm will also cause the intake louvers to close and start the chlorine scrubber system.\n\nOperations personnel can activate the emergency chlorine scrubber system automatically by the chlorine detection system or manually when a chlorine leak is detected.  The scrubber system activates the withdrawal of the contaminated air from the chlorine container storage room and chlorinator room and neutralization of the chlorine gas upon contact with the caustic solution in the scrubber.  In the event of a leak, the scrubber will continue operating until manually turned off. The scrubber is designed to recirculate the air and chlorine gas until the chlorine has been neutralized.\n\nPerimeter fence and security gates surround the North District WWTP.  The plant operates three shifts with employees onsite 34 hours per day, 365 days per year.\n\nThe North District WWTP is provided with a backup emergency power generator that supplies power for the entire facility.\n\nSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nNorth District WWTP is in compliance with Federal and State Process Safety Management requirements.  North District WWTP accidental release prevention program is based on the following key elements:\n\n    - Detailed management system.\n\n   - Comprehensive process safety information that is readily available to staff, emergency responders, \n      and contractors.\n\n   - Comprehensive preventive maintenance program.\n\n   - Performance of process hazard analysis of equipment and procedures with operation \n      and maintenance staff participation and review.\n\n   - Use of state-of-the-art process and safety equipment.\n\n   - Use of accurate and effective operating procedures, written with the participation of the operators.\n\n   - Training of the operators and maintenance staff.\n\n   - Implementation of an incident investigation program.\n\nChemical-specific prevention steps include availability of self-contained breathing apparatus (SCBA), awar"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 32618,
      "SummaryText": "eness of the hazardous and toxic properties of chlorine, presence of chlorine detectors and alarms, emergency chlorine gas scrubber system.\n\nProcess and Chemical Safety Information\n\nComprehensive chemical data have been assembled to include regulatory reporting and action thresholds, health hazard, and chemical exposure limitations, as well as detailed physical properties of chlorine.  This information includes chlorine background information and MSDS sheets.\n\nEquipment safety information was meticulously compiled on the chlorine process.  Specifications for chlorine process are collected and provided in one place for easy reference.  Details such as maximum intended inventory; safe upper and lower temperatures; safe upper and lower pressures; and codes and standards used to design, build, and operate the processes are on file at the facility.\n\nProcess Hazard Analysis\n\nIn 1997, detailed Process Hazard Analysis (PHA) was conducted for the chlorination system equipment and procedures.  To further assess the integrity of the chlorine system operation for the preparation of this RMP, a chlorine system checklist was used to assess the overall general condition of the chlorine system operation and maintenance, including human factors that affect personnel performance and system integrity.  The PHA was updated in 2004 and a list of recommended actions were developed to further improve the chlorine safety and staff is currently evaluating these recommendations.  Staff will document the completion of recommended actions.\n\nOperating Procedures\n\nMDWASD North District WWTP has prepared written operating procedures that provide clear instructions or steps for safely conducting activities relating to the chlorination process.  They are consistent with the chlorine Process Safety Information.  Written operating procedures include: initial startup, normal operations, emergency shutdown, normal shutdown, and start up after emergency shutdown.  In addition, North District WWTP develo"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 32618,
      "SummaryText": "ped Standard Operating Procedures (SOPs) for the following steps in the chlorination process: receipt of chlorine delivery, chlorine cylinder change, and chlorine release/spill response.  Operating procedures will be developed and put in place prior to any new process equipment coming on line or changes made in the handling of chlorine equipment, and reconfiguration of the facilities.\n\nTraining\n\nNorth District WWTP employees presently involved in operating or maintaining the chlorine process are trained in an overview of the process and detailed applicable operating and maintenance procedures.  North District WWTP ensures that each employee newly assigned to the process, is trained and tested to be competent in the operating procedures listed pertaining to their duties.  Each employee (presently involved in operating the chlorine process) has been trained to receive the required knowledge, skills, and abilities to safely carry out the duties and responsibilities, including chlorine emergency response, as provided in the operating procedures.\n\nRefresher training is provided every three years or less to each employee operating the covered process to ensure that the employee understands and adheres to the current operating procedures.  In addition, the North District WWTP ensures that operators are trained in any updated or new procedures prior to startup of a process after a major change as indicated in their Management of Change procedures.\n\nThe North District WWTP prepares and retains records of initial and refresher training, provides certification of the records, which includes the identity of the employee, the date of training, and the signature of the person(s) administering the training.\n\nContractors\n\nMDWASD North District WWTP has procedures and policies in place that specify the information required to be provided to the contractors performing work on the chlorination process, the training requirements for contractor employees, and mechanism to obtain assuran"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 32618,
      "SummaryText": "ce from contractors that they have informed their employees of the appropriate safety rules.  MDWASD North District WWTP is required to provide information and explanations concerning the hazards and processes and obtain and evaluate information regarding the contractor's safety program.\n\nPre-Startup Safety Review and Mechanical Integrity Program\n\nMDWASD North District WWTP has procedures in place to ensure that a pre-startup review is conducted prior to starting up a new covered process or after shutdown event, or prior to starting up modifications to the chlorination process that requires a MOC procedure implementation.\n\nHot Work Permits and Management of Change\n\nThe North District WWTP requires employees and contractors to employ safe work practices when performing \"hot work\" in, on, or around the covered process.  The North District WWTP uses a permitting program to ensure hot work is conducted safely on or near a process involving chlorine.\n\nInternal Compliance Audits\n\nInternal compliance audits will be conducted every 3 years to verify compliance with the programs and procedures contained in the RMP.  The North District WWTP will assemble an audit team that will include personnel knowledgeable in the Risk Management Program rule and in the process.  This team will evaluate whether the prevention program satisfies the requirements of the Risk Management Program rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit will be documented, recommendations resolved, and appropriate enhancements to the prevention program will be implemented.\n\nIncident Investigation\n\nThe North District WWTP investigates all incidents that could reasonably have resulted in a catastrophic release (serious injury to personnel, the public, or the environment) so that similar accidents can be prevented.  An investigation team is assembled and the investigation is initiated within 48 hours of the incident.  The results of"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 32618,
      "SummaryText": " the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.  Information found during the investigation is reviewed by affected staff and added or used to revise operating and maintenance procedures.\n\nFive-year Accident History Summary\n\nThere has been no reportable chlorine releases in the last five years.\n\nEmergency Response Program Summary\n\nThe North District WWTP is a first responder, plant employees respond to chlorine accidental releases.  Depending on the severity of the accidental release, external resources such as the Miami-Dade Fire Department may be solicited to aid in handling chlorine release.  As part of the emergency response program, the North District WWTP has developed and implemented an emergency response plan for the purpose of protecting public health and the environment.\n\nThe emergency response plan has been coordinated with local response agencies (Miami-Dade Fire Department).  The main elements of the emergency response plan are: (1) chlorine response flow chart, responsibilities of various personnel at the facility, duties of on-scene incident commander, site response team, and site safety representative, (2) details of emergency recognition and prevention at the facility, (3) procedures for planning and coordination with off-site emergency response organizations, and (4) details of the training program for all employees involved with the chlorine process.\n\nPlanned Changes to Improve Safety\n\nNumerous changes to improve safety (recommended actions) were previously identified for the chlorine process in 1997 for chlorination system equipment and procedures when a Process Safety Management (PSM) Plans was prepared.  All of these recommended actions have been evaluated for implementation as required.  No changes that would trigger a management of change procedures were recommended in the last five years"
    }
  ]
}