{
  "FacilityID": 32711,
  "FacilityName": "Clark Foam (CalARP)",
  "FacilityStr1": "25887 Crown Valley Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Laguna Niguel",
  "FacilityState": "CA",
  "FacilityZipCode": "92677",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06059",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.557500",
  "FacilityLongDecDegs": "-117.675556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "clrkfoam@pacbell.net",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Clark Foam",
  "OperatorStr1": "25887 Crown Valley Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Laguna Niguel",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92677",
  "OperatorZipCodeExt": null,
  "FTE": 115,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000087078",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-09-25 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-04 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2011-12-08 00:00:00",
  "DeRegistrationEffectiveDate": "2006-05-31 00:00:00",
  "AnniversaryDate": "2009-06-04 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 33.55755,
  "FRS_Long": -117.677326,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "EPA has administratively marked this facility as 'Closed'.",
  "_processes": [
    {
      "ProcessID": 47254,
      "AltID": "Toluene Diisoycanate",
      "FacilityID": 32711,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 62199,
          "ProcessID": 47254,
          "ChemicalID": 44,
          "Quantity": 18400.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 62200,
          "ProcessID": 47254,
          "ChemicalID": 20,
          "Quantity": 4600.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 48303,
          "ProcessID": 47254,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 18320,
              "Process_NAICS_ID": 48303,
              "SafetyReviewDate": "2004-05-26 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "API 650",
              "FR_Comments": null,
              "HazardReviewDate": "2003-07-22 00:00:00",
              "ChangeCompletionDate": "2003-11-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-03-30 00:00:00",
              "TrainingReviewDate": "2003-09-15 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-05-31 00:00:00",
              "EquipmentInspectionDate": "2004-03-30 00:00:00",
              "EquipmentTested": "API-653 Inspection Tank 61",
              "ComplianceAuditDate": "2004-01-27 00:00:00",
              "AuditCompletionDate": "2004-05-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2003-09-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 19111,
                  "PreventionProgram2ID": 18320,
                  "ProcessChemicalID": 62199
                },
                {
                  "PrimaryKey": 19112,
                  "PreventionProgram2ID": 18320,
                  "ProcessChemicalID": 62200
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 32711,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-05-26 00:00:00",
    "ERTrainingDate": "2003-12-15 00:00:00",
    "CoordinatingAgencyName": "Orange County Fire Authority",
    "CoordinatingAgencyPhone": "7147440463",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 32711,
      "SummaryText": "the course of the batch process.  Because much of the TDI is polymerized by the time the batch operating temperature is reached, not considering the polymerization of TDI results in a conservative (high) estimate of the emission rate and the distance to off-site impact if a spill were to occur.\n\nThe Clark Foam alternative scenario involves an unloading accident during tanker truck unloading of TDI. The meteorological conditions for the alternative release scenario were assumed to be a wind speed of 3.0 m/sec (6.7 mi/hr) and neutral conditions (stability class D).  The tanker truck unloading accident does not produce an impact that extends off-site.  Administrative controls in place during TDI tanker truck unloading include detailed operating procedures, standby emergency equipment to prevent the spread of any spill, and multiple Clark Foam personnel monitoring the transfer operation to ensure procedures are followed.  These administrative controls will minimize the off-site impact of any TDI spill that were to occur during TDI delivery.  \n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\nProcess Safety Information\nClark Foam established the surfboard blank industry and is the primary world-wide supplier of TDI-based polyurethane foam surfboard blanks.  With no existing process as a guide, Clark Foam had to develop its TDI-based process, including standards, from the ground-up where none existed.  By default, Clark Foam has established the industry standards for the TDI-based polyurethane foam industry.  The Clark Foam standards were based on numerous sources including existing codes and standards for similar (but not identical) processes and industries.  The effectiveness of the administrative controls and engineering standards developed by Clark Foam is the reflected in the fact that there has not been a release of TDI at the Clark Foam facility since implementing its current tank-based process in 1966.  All of the documents assembled as part of Clark Foam¿s Process S"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32711,
      "SummaryText": "premises and minimize the period of time that TDI is present on-site to reduce the risk of a release.  During batch processing, the exothermic reaction between TDI and polyol releases heat that raises the batch temperature to a design temperature of 140º.  This temperature is maintained for 16-20 hours by continuous injection of polyol.  Once the reaction is complete,  the prepolymer is allowed to cool to and is then transferred to Tank 62 for storage.  As needed, the prepolymer is pumped from Tank 62 to the weighing and mixing station where it is mixed with additional polyols and poured into molds to form polyurethane foam surfboard blanks. \n\nHAZARD ASSESSMENT\nClark Foam conducted a hazard assessment for potential releases of TDI and TDI-bearing resins from its Laguna Niguel facility.  The hazard assessment consisted of an offsite consequence analysis (OCA) following guidance established by EPA for the RMP program (EPA, 1999).  As prescribed by the RMP regulation, the worst-case release scenario is defined as an instantaneous spill of the maximum contents of the largest storage vessel.  For the Clark Foam facility, the worst-case scenario consists of the catastrophic failure of Tank 61 releasing 23,000 lbs of TDI onto the floor of the foam building.  The resulting pool temperature is assumed to be the maximum temperature (140º F) of the Tank 61 contents during a batch processing cycle plus a safety margin of 5º F.  \n\nEmissions from the spill of TDI were computed using the Wu-Schroy liquid pool evaporation model (Wu and Schroy, 1979).  The distance to the downwind toxic endpoint of 1.0 ppm for TDI was estimated using the SLAB dispersion model (Ermak, 1990).  Following RMP guidance, the assumed worst-case wind speed was 1.5 meters/second (m/sec) (3.4 miles per hour [mi/hr]) and the atmospheric stability was stable (F stability class).  The worst-case release scenario is the same as that in the existing 1999 RMP for the facility.  The downwind distance to the toxic e"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32711,
      "SummaryText": "ndpoint for the worst-case scenario is 50 meters (m) (160 feet[ft]).  There are no public or environmental receptors within this toxic endpoint distance of the Clark Foam facility.  The conclusion of no off-site impact to a public or environmental receptor for the worst-case release scenario is the same conclusion as that reached in the existing OCA for the 1999 RMP and prior RMPP plans.\n\nThe probability that the worst-case release scenario can occur is remote. There are only a limited number of plausible accident scenarios that could supply sufficient force to result in the catastrophic failure of Tank 61 or its liquid lines. The tank is physically inaccessible to vehicular traffic and there are no overhead booms or cranes that could cause something to drop onto the tank. The tank is vented to the atmosphere, thus reducing the possibility of pressure buildup that could cause a tank rupture. Tank 61 undergoes regular routine inspection, including ultrasonic wall thickness testing, to detect corrosion.  There are extensive process controls on Tank 61 that significantly reduce the possibility for an uncontrolled exothermic chemical reaction to occur in Tank 61 that could result in an impact to off-site public receptors.  These process controls include multiple temperature and other sensors to ensure proper functioning of equipment and maintain batch temperature, administrative controls that limit access to substances added to the Tank 61, and detailed operating procedures for batch processing of Tank 61.  The seismic analysis performed for the tank as part of the RMP update indicates that the tank is capable of withstanding the expected seismic loads for the Laguna Niguel area without failing. \n\nEach TDI monomer molecule has two reactive isocyanate groups.  During the polymerization process, one or both of the reactive groups on many TDI monomer molecules become linked in a polymer chain. No credit was taken in the OCA for the polymerization of the TDI monomer during"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 32711,
      "SummaryText": "es\nClark Foam has three operating procedures for the handling of TDI in the manufacturing process, covering the handling of TDI from receipt onsite to the point where TDI becomes inert urethane foam.  These procedures are:\n> Receive tank truck of TDI , load Tank 61, and manufacture Prepolymer\n> Manufacture of hydroxyl bearing polyester resin (polyol)\n> Pump Tank 61 to Tank 62\nThese procedures are completed by two independent operators and reviewed by a supervisor.  In addition, Clark Foam has an extensive set of maintenance procedures for the TDI process equipment.  Copies of the operation and maintenance procedures are available in Clark Foam¿s administrative office.\n\nTraining/Certification Programs\nClark Foam has an extensive training program for operations, safety, emergency response, and maintenance to ensure that every employee has the skills to perform his or her job safely and effectively.  \nFormal training is supplemented with informal instruction and discussion of safety issues during monthly Safety Meetings conducted by the Plant Manager.  The employees participate in monthly evacuation drills.  Training records are maintained in the permanent employee file.\n\nCompliance Audits\nIn accordance with Section 2760.8 of the CalARP regulations, a compliance audit must be performed as part of an RMP update.  Previously, a three-year compliance audit was conducted in June, 2002, using an audit checklist.  There were no findings or deficiencies noted in this compliance audit.  A new compliance audit was conducted at the facility on January 27, 2004 as part of the RMP update.  There were no findings or deficiencies noted in this compliance audit.  \n\nIncident Investigation\nClark Foam will follow an established  Incident Investigation Procedure to determine the cause of the incident and implement corrective action.  Recordkeeping forms are provided in the Incident Investigation Procedure.  Completed forms will be kept on-file at the Clark Foam administrative office for"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 32711,
      "SummaryText": "at least five years.\n\nFIVE-YEAR ACCIDENT HISTORY \nWithin the previous five years, there have been no accidents involving TDI that have resulted  that resulted in deaths, injuries, or significant property damage on-site or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\nThere are two different types of TDI spills that have the potential to result in high levels of TDI emissions:\n> Spills that can be handled by qualified Clark Foam personnel with readily available safety equipment.\n> Spills which require outside assistance.  This is a situation in which there are no qualified personnel on site at the time of the spill.  The unqualified staff is instructed to evacuate the area and phone the OCFA.\n\nClark Foam has an Emergency Action Plan which outlines steps to take in an emergency.  The EAP was last updated in May, 2004.  In addition, Clark Foam as agreed with the OCFA on a revised Pre-Plan to be used by emergency response personel in the event of a chemical spill involving TDI at the facility.\n\nMANAGEMENT SYSTEM\nThe Plant Manager has overall responsibility for implementation of the RMP program.  The Plant Manager will delegate individual tasks as necessary to fulfill the RMP requirements.  RMP program documents are maintained in Clark Foam¿s administrative office.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nClark Foam has implemented the below actions since preparation of the 1999 RMP plan. No other process changes are planned at this time.\n> Routine nondestructive testing of the wall thickness on Tank 61 and 62 using ultrasonic detectors to allow early detection and repair of corrosion.\n> Installation of an additional support bracket on the exterior south wall of the foam building near where the TDI delivery pipe   enters the foam building.\n> Installation of a bracket on a support plate above Tank 61 to support the transfer pipe used for transfering prepolymer from Tank 61 t"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 32711,
      "SummaryText": "o 62 at the completion of a prepolymer batch processing cycle.  \n> Agreement with the OCFA of a revised Pre-Plan for use in emergency response by the OCFA.\n> Reduction of the batch process temperature from 160º F to 140º F.\n\nREFERENCES\nErmak, D.L., 1990.  ¿User¿s Manual for SLAB: An Atmospheric Dispersion Model for Heavier-Than-Air Releases¿, Lawrence Livermore National Laboratory, UCRL-MA-105607, Livermore, CA., June.\n\nOCFA, 1999.  ¿Risk Management Program Guidance¿, Orange County Fire Authority, April.\n\nWu, J.M., and J.M. Schroy, ¿Emissions from Spills¿, Proceedings on Control of Specific (Toxic) Pollutants, Florida Section, Air Pollution Control Association, Gainesville, FL, February, 1979."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 32711,
      "SummaryText": "afety program are available for review by all employees in Clark Foam¿s administrative office and are incorporated into this RMP by reference. \n\nThe equipment used in the process has been designed and engineered to the highest standards for this TDI Process.  The materials of construction are compatible with TDI.  The tanks are constructed in accordance with the American Petroleum Institute #650 design standard and  passed an API-653 internal and external inspection in March, 2004.  The batch processing of TDI to manufacture prepolymer is computer controlled using multiple, redundant micro-processors to ensure the safety of the process and the quality of the prepolymer manufactured.  The equipment used in the process has been designed and engineered to the highest standards.  The controls prevent uncontrolled exothermic chemical reactions involving TDI from occurring.  There is extensive redundancy in the controls.\n\nProcess Hazard Analysis\nAn experienced hazard assessment team conducted the Hazard Operability (HazOp) study on July 22, 2003.  The team consisted of individuals experienced in operation and maintenance of the Clark Foam TDI system, hazards analysis, safety management, and environmental, health and safety.  The team consisted of personnel from Clark Foam, OCFA, and ENSR Corporation.  A combination  ¿What If¿ and guideword approach was used. \n\nA total of 79 individual process elements were identified and reviewed during the HazOp.  The individual elements were subsequently ranked on a qualitative basis in terms of five potential probabilities of occurrence and 5 potential risks posed by the element.  The criticality for each joint occurrence of a given probability and risk score followed the risk-probability criticality matrix established by the OCFA in their April, 1999 RMP guidance (OCFA, 1999).   \n\nThe HazOp team did not identify any scenarios during the HazOp with the two highest criticality rankings of Critical or Undesirable. The HazOp team identifi"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 32711,
      "SummaryText": "ed four scenarios that had a criticality ranking of middle ranking, Acceptable with Controls.  All other elements produced a criticality score of Acceptable or Not a Hazard. Clark Foam management has determined that the risks posed by the four Acceptable with Controls scenarios are sufficiently  mitigated and that addition mitigation is not warranted.  Therefore, Clark Foam Management has judged that the risks posed by these four scenarios are acceptable with no further mitigation required.   \n\nSeismic Analysis\nA seismic assessment was conducted under the CalARP Program to provide a reasonable assurance that a release of a regulated substance having offsite consequences would not occur as a result of an earthquake.  This seismic assessment was prepared in accordance with the Guidance for CalARP Seismic Assessments.  This seismic evaluation was qualitative in nature and was based on a site walk-through, and a review of geologic and seismic hazard literature applicable to the site. \n\nThe seismic analysis indicates that the current configuration of the components used for the TDI process at the Clark Foam facility is adequate to withstand the peak earthquake acceleration estimated for the vicinity of the Clark Foam facility.  The potential for other seismic hazards including liquefaction, landslide, tsunamis, or seiches was examined.  The results of this analysis indicated that there is not a significant risk for these other potential seismic-induced hazards at the Clark Foam facility.  No recommendations are necessary for seismic improvements for the Clark Foam TDI process.\n\nExternal Events Analysis\nClark Foam  evaluated each of the potential ¿External Events¿ recommended for evaluation in the Risk Management Program Guidelines issued by OCFA..  ENSR also reviewed security procedures with Clark Foam to identify potential hazards due to terrorism and sabotage.    These external events were judged not to pose undue hazards for the Clark Foam facility\n\nOperating Procedur"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 32711,
      "SummaryText": "Clark Foam has prepared this Risk Management Plan (RMP) Update for its polyurethane foam manufacturing facility in Laguna Niguel in accordance with Section 2745.10 of the California Accidental Release Prevention (CalARP) Program (California Code of Regulations (CCR), Title 19, Division 2, Chapter 4.5) and 40CFR Part 68 of the Environmental Protection Agency (EPA) Risk Management Program.  The RMP plan was last submitted to the Orange County Fire Authority (OCFA) (the Administering Agency) in June 1999.  The update has been prepared within 5 years of the date of the original submittal.  The Clark Foam facility qualifies for a Level 1 CalARP program because the facility has not had a release of hazardous substances in five years that produced a death, injury, or an impact to an off-site receptor; the worst-case accident scenario does not produce an impact at an off-site public receptor, and emergency response procedures are coordinated with the local emergency response agency (OCFA).  However, Clark Foam has voluntarily agreed to prepare a Program Level 2 CalARP plan at the request of the OCFA.\n\nThe following activities were conducted in support of the RMP Update, in accordance with EPA RMP guidance for updates:\n> A three-year compliance audit was conducted by an outside environmental contractor, in accordance with Section 2760.8 of the CalARP regulations.\n> The elements of a Program Level 2 RMP plan were prepared.\n> The Offsite Consequence Analysis was revised using the SLAB model.  For the worst-case and alternative release scenarios, there were no impacts to an off-site public or environmental receptor.  .\n> The seismic analysis for the affected systems was reviewed for changes to the system, and changes to the building codes that may impact affected systems.\n> The Process Hazards Analysis (PHA) for the facility was revised using a combination ¿HazOp / What If¿ analysis method.\n> Clark Foam prepared a new RMP registration submittal to reflect these changes to the R"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32711,
      "SummaryText": "MP.\n\nACCIDENT RELEASE PREVENTION PROGRAM AND EMERGENCY RESPONSE POLICY\nIt is the policy of Clark Foam management to implement the requirements of this RMP.  This RMP was developed in accordance with the CalARP and RMP regulations.  The objective of this program is to minimize the risk of a release of toluene diisocyanate (TDI), a regulated chemical, and, if a release occurs, to minimize the potential impact to Clark Foam¿s employees, the public, and the environment.  This objective will be accomplished by utilizing equipment designed for safe operation; utilizing good operating procedures; providing appropriate training to affected employees; and by coordinating response activities, as necessary, with the on-site and off-site emergency response providers. Clark Foam¿s management is committed to providing the resources necessary to implement this policy.\n\nDESCRIPTION OF THE FACILITY AND AFFECTED PROCESS\nClark Foam manufactures high strength-to-weight ratio surfboard blanks from polyurethane foam at its facility in Laguna Niguel, California.  The North American Industrial Classification System (NAICS) code for the facility is 32615, Urethane and Other Foam Product (except Polystyrene) Manufacturing.  Clark Foam is the major supplier of surfboard blanks to the surfing industry and its blanks are distributed world-wide.  Clark Foam is located at 25887 Crown Valley Parkway in the city of Laguna Niguel, California and covers approximately 2.3 acres.  The facility consists of two single-story buildings.  Commercial businesses and residential neighborhoods surround the facility.\n\nTDI is delivered by tank truck, in quantities of approximately 23,000 pounds (lbs), on a just-in-time basis.  The TDI is converted to a less toxic material called prepolymer by reacting the TDI with a polyester polyol resin (polyol) within 24 hours of delivery.  The use of the just-in-time inventory practice is intended, in part, to minimize the amount of TDI and TDI-bearing resins present on the"
    }
  ]
}