{
  "FacilityID": 32730,
  "FacilityName": "Duchesne Valley Water Treatment Plant",
  "FacilityStr1": "23419 West State Park rd.",
  "FacilityStr2": null,
  "FacilityCity": "Duchesne",
  "FacilityState": "UT",
  "FacilityZipCode": "84021",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "49013",
  "LEPC": "Duchesne County LEPC",
  "FacilityLatDecDegs": "40.193333",
  "FacilityLongDecDegs": "-110.436111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Central Utah Water Conservancy Dist.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Joe F. Williford",
  "OperatorStr1": "23419 West State Park rd.",
  "OperatorStr2": null,
  "OperatorCity": "Duchesne",
  "OperatorStateFIPS": "UT",
  "OperatorZipCode": "84021",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000027106",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-16 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 40.19333,
  "FRS_Long": -110.43556,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 47291,
      "AltID": "Chlorine",
      "FacilityID": 32730,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 62328,
          "ProcessID": 47291,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 48340,
          "ProcessID": 47291,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 27066,
              "Process_NAICS_ID": 48340,
              "SafetyReviewDate": "2004-04-16 00:00:00",
              "PHA_Date": "2003-01-27 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-02-15 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Cl2 Sensors triger computer Alarm and SCADA system which calls nessassary personnel",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-01-04 00:00:00",
              "TrainingReviewDate": "2004-01-04 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-04-21 00:00:00",
              "EquipmentInspectionDate": "2004-02-08 00:00:00",
              "EquipmentTested": "Cl2 Sniffers/SCUBA 4/01/04",
              "ChangeMgmtDate": "2004-04-21 00:00:00",
              "ChangeMgmtReviewDate": "2004-04-21 00:00:00",
              "PreStartupReviewDate": "2004-04-21 00:00:00",
              "ComplianceAuditDate": "2003-01-27 00:00:00",
              "AuditCompletionDate": "2003-02-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-04-20 00:00:00",
              "HotWorkPermitReviewDate": "2003-01-27 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Chlorine",
              "_chemicals": [
                {
                  "PrimaryKey": 39448,
                  "PreventionProgram3ID": 27066,
                  "ProcessChemicalID": 62328
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 32730,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-04-20 00:00:00",
    "ERTrainingDate": "2004-04-20 00:00:00",
    "CoordinatingAgencyName": "Duchesne Co. LEPC",
    "CoordinatingAgencyPhone": "4357381181",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32730,
      "SummaryText": "                       Date of Last Revision:December. 16,1998\n                                                               \n                                                               \n             CENTRAL UTAH WATER CONSERVANCY DISTRICT\n                                 \n              Duchesne Valley Water Treatment Plant\n                    23419 West State Park Rd.\n                      Duchesne Utah 84021\n     1    PURPOSE\n          \n          The purpose of the Duchesne Valley Treatment Plant (DVWTP) Emergency Response\n     Plan (ERP) is to effectively respond to a chlorine release to minimize injuries, lessen the\n     impact in the community, minimize damage to the treatment plant, and provide guidance\n     to local emergency response personnel. All employees at DVWTP are trained in chlorine\n     containment procedures and all are trained in the use of SCBA equipment.\n\n     2.   TYPES OF EMERGENCY\n\n               a.   Chlorine Release\n          \n          In the event of an equipment or human failure, potential sources for chlorine releases are:\n\n                         1.   One Ton chlorine Container\n                         2.   Chlorine supply lines and chlorination equipment.\n                    \n          At this facility, the loss of any utilities including electricity will not increase the potential\n     for a chlorine release.\n\n     3.   SCOPE\n          \n          The scope of this plan includes:\n\n               a.   A chlorine release contained within the plant facilities and controllable  by\n          CUWCD personnel and equipment.\n          \n               b.   A chlorine release affecting or with the potential to affect the area surrounding the\n          CUWCD; such a release would require outside assistance.\n\n     4.   PLANNING FOR HANDLING THE EMERGENCY\n\n          Responsibility:\n\n          The Plant Manager is ultimately responsible for the implementation of the plan.  He is\n     responsible for keeping the plan current and insuring that a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32730,
      "SummaryText": "ll plant employees are properly\n     trained.\n\n     4.1  Initiating the ER   (Emergency Response Plan)\n                    \n          The ERP is initiated by any employee at any time in response to a known or perceived\n     chlorine release. Initiating employee will notify all other personnel at the plant (if any) by\n     best means possible (i.e. intercom, cell phone, two way radio, or in person).  \n\n     4.2  Assembly Area \n\n                    Primary   --Control Room\n\n                    Secondary --Front Gate Area\n\n          Upon receiving notification, each employee is to secure his job and report to the primary\n     assembly area (Control Room).  If inaccessible, the employee should report to the\n     secondary assembly area (Front Gate).  Each employee will be quickly advised as to what\n     is known about the chlorine release.  \n\n          The \"On Duty Operator\" will be responsible for accounting for all employees and visitors. \n     If not present, the senior employee present will be responsible.\n\n          If not present the Plant Manager is to be notified as soon as reasonably possible.\n\n     4.3  Overall Emergency Response Coordination.\n\n          The Plant Manager is the responsible overall emergency response coordinator.  In the\n     absence of the Plant Manager, the On Duty Operator will be responsible.\n\n               a.   Verify that an actual chlorine release exists.\n\n                    If not already known, investigate carefully to verify that the release is real and not\n          a false alarm.  Must follow operating procedures for entering the chlorine room.  \n          Even the slightest smell of chlorine in the air will verify that the chlorine release is\n          present.  Do not proceed into any area that smells of chlorine for any reason\n          without self-contained breathing apparatus (SCBA).\n\n                    Notify all DVWTP employees not present to report to the plant to assist in the\n          containment of a chlorine releas"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32730,
      "SummaryText": "e.\n\n                    Notify the Ashley Valley Treatment Plant that we have a chlorine release and need\n          backup assistance (this is another Central Utah Water Conservancy District\n          (CUWCD)  plant and all employees are also fully trained).  The fire department has\n          also agreed to respond to a request for backup SCBA equipped personnel to act as\n          a safety backup to our men if needed.  AVWTP will use District employees to\n          contain a chlorine leak if reasonably possible but if needed the fire department is to\n          be used as a secondary backup. To request fire department assistance, call 911 and\n          request SCBA equipped backup to our plant personnel who will be doing the\n          actual chlorine release containment.\n\n               b.   Determine the need for a rescue team.\n\n                    Rescue team, if needed, will be made up of trained employees present.  Rescue\n          team members must wear SCBA and follow training and proper procedures to\n          enter the area.\n\n               c.   Determine the need for emergency containment team.\n\n                    The emergency containment team will be made up of trained CUWCD employees\n          from both plants as needed. The senior DVWTP employee present will be the team\n          leader.  Team members must wear SCBA and follow proper procedures. This team\n          will investigate to determine the source and extent of the leak. This team will take \n          actions to make an initial containment of the release if determined reasonable to do\n          so.\n\n               d.   Determine the need for outside assistance and/or notification.\n\n                    As overall emergency response coordinator, the Plant Manager, or in his absence\n          the On Duty Operator, is authorized to notify directly or through delegation, the\n          appropriate outside agencies/neighbors.  This may include the fire department,\n          police/sheriff department, "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32730,
      "SummaryText": "Local Emergency Planning Committee (LEPC),\n          industrial and/or residential neighbors, and anyone else who might provide\n          assistance in responding to the emergency or who might be affected by it.\n\n                    Notify CUWCD management in Orem as soon as it is reasonably possible to do so.\n\n               e.   The On Duty Operator (On Call Operator after hours) is designated backup to the\n          Plant Manager and is responsible for performing all the duties in the event of the\n          unavailability of the Plant Manager.\n                     \n\n     4.4  Telephone Answering\n\n          Any requests from the media are to be referred to the emergency response coordinator. If\n     that person is unavailable, take the person's name, organization, and phone number. \n     Persons assigned to answer the phone are not authorized to discuss the incident with the\n     media or with any other callers except people involved with the emergency response. \n     Simply state \"We have had an emergency.  We are responding to it now (or it is now\n     ended).  Someone from our plant will return your call as soon as possible if you will give\n     me your name, organization, and phone number.  I am not authorized to give you any\n     information.\"  Give your name if asked.\n\n     4.5  Non-Work  Hours Procedures.\n\n          The plant is normally staffed only from 8 a.m. to 4 p.m. seven days a week. The plant is on\n     line 24 hours a day and is fully computerized.  The computers constantly control and\n     monitor the plant and are connected to sensors in the chlorine storage and process areas. \n     The computers monitor for any chlorine release and will react to a release by going into an\n     alarm condition.  The computers are programed to call out to the \"On Call Operator\"\n     during the non-working hours and alert the On Call Operator with a voice message\n     programed to indicate the nature of the plant alarm including a possible chlorine release. \n     U"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 32730,
      "SummaryText": "pon receiving a possible chlorine release alarm, the Operator will then proceed to the\n     plant, alerting all other plant employees by cellular  phone on the way.  All plant\n     employees contacted are to proceed to the plant to give assistance.\n\n     4.6  Outside Assistance\n\n          The overall emergency coordinator will meet or will delegate an available person to meet\n     at the front gate and escort any outside responders notified by the coordinator to assist in\n     the response. If the front gate is not accessible, the responders should be met at the public\n     road upwind of the release.  \n\n     4.7  Media Inquiry\n\n          Media inquiries should be handled, as time permits, by the emergency response\n     coordinator or other CUWCD management personnel.  Arriving media representatives\n     should be allowed to wait at the front gate until escorted into the main office when\n     accessible and time permits. Under no conditions is the front entrance allowed to become\n     blocked to hinder the passage of emergency responders and plant employees.  No one\n     other than plant employees and emergency responders are allowed access to the plant\n     grounds at anytime during the emergency without prior authorization.  \n\n          When time permits, the media should be given background information on chlorine.  When\n     facts are known about the incident and the cause, these should be given to the media. NO\n     ONE OTHER THAN THE PLANT MANAGER OR THE CUWCD TREATMENT\n     OPERATIONS MANAGER OR DESIGNEE IS AUTHORIZED TO RELEASE ANY\n     INFORMATION ABOUT THE INCIDENT TO THE MEDIA.  ANY PERSON\n     DISCUSSING THE INCIDENT WITH THE MEDIA MUST NOT SPECULATE AS\n     TO THE CAUSE OF THE INCIDENT.  IF THE CAUSE IS KNOWN, SO ADVISE\n     THE MEDIA.   IF THE CAUSE IS NOT KNOWN, ADVISE THE MEDIA IT IS\n     UNDER INVESTIGATION.  NORMALLY THE QUANTITY OF CHLORINE\n     EMITTED DURING A RELEASE IS UNKNOWN UNTIL A THOROUGH\n     INVESTIGATION IS COMPLETE.  IF SUCH IS THE CA"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 32730,
      "SummaryText": "SE, SO ADVISE THE\n     MEDIA.\n\n          When dealing with the media remember to be honest, courteous, straight forward, and\n     concerned.  Do not speculate.  Do not give \"off the record\" comments.\n\n     4.8  Shelter/Evacuation\n\n          Even though this facility will be working closely with the LEPC, Fire Department, and\n     other emergency officials, a decision regarding whether to evacuate or to shelter affected\n     outside persons is a difficult one. Generally for us, a significant chlorine release is likely\n     to last for up to one hour before it is contained.\n\n          Therefore, sheltering in place is the normal mode to be utilized during an emergency. \n     While it is unlikely that this facility could have a chlorine release requiring evacuation,\n     nevertheless, we must be prepared for such an eventually.  If it is anticipated that a release\n     cannot be soon contained or is of a massive quantity, the evacuation option should be\n     utilized.  Call 911 and suggest that sheltering of residences within (indicate immediate area\n     or more as needed) and evacuation of others be implemented.  \n\n          4.8.1     Neighboring Residences and Facilities.\n\n          State Park Recreation area and one family on the back road up to the plant.\n\n           A prolonged significant release probably would affect an area beyond the neighboring\n     residencies and facilities of up to1.5 mile radius from the plant.  This would affect\n     approximately1 resident and many recreational transit persons in the area. Many factors\n     such as wind speed, wind direction, weather conditions, and time of day would affect the\n     extent of the area.  \n\n          4.8.2     Responsibility\n\n          These duties are the responsibility of the overall emergency coordinator.  He may choose\n     to delegate some or all of these duties to another competent person.  It is also quite\n     probable that the responding agency or agencies will establish a command post and\n     "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 32730,
      "SummaryText": "appoint a \"Incident Commander\" to assume these responsibilities, especially in regard to\n     those affected areas outside the plant grounds.  \n\n     4.9  CHLOREP - Outside Assistance\n\n          In the event we are unable to contain a release from a ton container, contact the supplier. \n     If assistance cannot be obtained, contact CHLOREP through CHEMTRACT at 1-800-\n     429-9300.  The problem should be described with the required help needed.  Be certain to\n     give your name, phone number, company name, address and other information needed. \n     These contacts are to be made by the emergency response coordinator.\n\n     4.10 Emergency Treatment\n\n          As part of our response plan the DVWTPhas contacted the Ashley Valley Medical Center\n     (DVMC) and we have been assured that the hospital is equipped with the expertise and\n     the equipment to treat a chlorine inhalation injury.  DVWTP has furnished DVMC (at their\n     request) with a copy of The Chlorine Institute pamphlet #63, \"First Aid and Medical\n     Management of Chlorine Exposures\".\n\n          Any injured person suffering from chlorine inhalation should be sent to the hospital.  To\n     the extent possible an injured employee should be accompanied by another employee. \n     Notification to the family should be made as soon as practical by the plant manager or his\n     designee, preferably following contact with the Human Resource Manager.\n\n          As part of training and annual refresher training, all employees are trained in first aid\n     procedures for chlorination contact and exposures, using as a reference chapter 6 of The\n     Chlorine Institute's pamphlet #1, \"The Chlorine Manual\".\n\n\n     5.   OUTSIDE REGULATORY AGENCY NOTIFICATION\n\n          This contact is to be made the CUWCD Treatment Operations Manager if available, or if\n     not available, the Plant Manager.  If both are unavailable, the ranking supervisor at the\n     facility will give the immediate verbal notification.\n\n     5.1  "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 32730,
      "SummaryText": "Verbal Notification\n\n          The law requires that this Facility immediately report any releases of chlorine equal to or\n     greater that ten (10) pounds to the following agencies:\n\n               1.   National Response Center;\n               2.   Local Emergency Planning Committee; and\n               3.   State Emergency Planning Commission.\n\n          Information should include the following:\n\n               1.   Chemical released - Chlorine;\n               2.   Chlorine is on the Extremely Hazardous Substances List;\n               3.   Estimate quantity released.  If not sure, simply state, \"10 pounds or more\";\n               4.   Time and duration of the release;\n               5.   The medium or media into which the release occurred (most likely air);\n               6.   Medical information regarding chlorine. Advise that pre-incident planning has been\n          made with the Tricounty LECP and the DVMC.;\n               7.   Evacuation plans if needed;\n               8.   Name and phone number of the person to be contacted for further information.\n\n          THE AGENCY NOTIFICATIONS ARE TO BE MADE IMMEDIATELY AFTER THE\n     INCIDENT HAS OCCURRED.\n\n     5.2  Written Follow Up.\n\n          As soon as practicable after the release, a follow up written notice is to be provided to\n     these agencies.  The Treatment Operations Manager or his designee will be responsible to\n     provide these written reports.\n\n     5.4  OSHA Notification.\n\n          In the event of a fatality or multiple hospitalization, OSHA is to be notified within 48\n     hours in accordance with OSHA regulations. This notification will be handled by the\n     Human Resource Manager in accordance with CUWCD policies.\n\n     6.   TRAINING\n\n          Refresher training for all personnel will be done annually in accordance with CUWCD and\n     DVWTP refresher training requirements.  Additional training seminars and exercise drills\n     will be conducted as applicable and reasonable to do so in order t"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 32730,
      "SummaryText": "o provide for well\n     trained chlorine operators."
    }
  ]
}