{
  "FacilityID": 32830,
  "FacilityName": "Moses Lake Industries, Inc.",
  "FacilityStr1": "8248 Randolph Road NE",
  "FacilityStr2": null,
  "FacilityCity": "Moses Lake",
  "FacilityState": "WA",
  "FacilityZipCode": "98837",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53025",
  "LEPC": "Grant County LEPC",
  "FacilityLatDecDegs": "47.203333",
  "FacilityLongDecDegs": "-119.293611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.mlindustries.com",
  "FacilityEmailAddress": "Pat Noga (Director Of Manufaturing) jpnoga@mlindustries.com",
  "FacilityDUNS": 144414026,
  "ParentCompanyName": "TAMA Chemicals Co., Ltd.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Moses Lake Industries, Inc.",
  "OperatorStr1": "8248 Randolph Road NE",
  "OperatorStr2": null,
  "OperatorCity": "Moses Lake",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98837",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike Harvey",
  "RMPTitle": "Executive Vice President",
  "FTE": 77,
  "OtherEPAFacilityID": "WAD144414026",
  "EPAFacilityID": "100000177952",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "01AQER-3281",
  "SafetyInspectionDate": "1993-03-04 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 47.2072,
  "FRS_Long": -119.28774,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 47417,
      "AltID": null,
      "FacilityID": 32830,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 48470,
          "ProcessID": 47417,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 62474,
          "ProcessID": 47417,
          "ChemicalID": 113,
          "Quantity": 93000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 113,
            "ChemicalName": "Trimethylamine [Methanamine, N,N-dimethyl-]",
            "CASNumber": "75-50-3",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 62475,
          "ProcessID": 47417,
          "ChemicalID": 98,
          "Quantity": 17000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 562474,
          "ProcessID": 47417,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 562475,
          "ProcessID": 47417,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32830,
      "SummaryText": "Moses Lake Industries, Inc. Risk Management Plan (RMP) Executive Summary\n1. Accidental Release Prevention And Emergency Response Policies\nMoses Lake Industries, Inc. (MLI) is committed to employee, public and environmental safety.  Our comprehensive accidental release prevention program covers design, installation, operating procedures, maintenance, hazard analyses and employee training associated with the processes at our Moses Lake, WA facility.  We comply with all applicable federal, state, and local regulations as well as implement appropriate controls to prevent an accidental release of regulated substances.  If such an accidental release were to occur, procedures are in place to mitigate the release.\nOur emergency response program includes procedures for notification of the local fire department, notification of any potentially affected neighbors, and notification of local, state and federal agencies.  Safety is an essential part of our operations. Safety devices are built into the design of this facility.  Training in safe work practices is provided to our employees.\n2. The Accidental Release Prevention Program And The Chemical Prevention Steps\nMLI has taken all of the necessary steps to comply with the Accidental Release Prevention requirements stipulated by the EPA under 40 CFR Part 68 as well as those of OSHA under the PSM standard 29 CFR 1910.119 and Washington State WAC 296-67.  MLI has been subject to EPCRA 302 notification requirements.  In addition, with the covered RMP process, the facility is subject to EPCRA 313 notification requirements.  Sections 2.a. through 2.l. below briefly describe the elements of the Accidental Release Prevention program that are in place at our facility.\na.  Process Safety Information\nMLI maintains a detailed compilation of Process Safety Information for the TMAC Facility.  This information describes the chemical hazards, operating parameters and equipment design associated with the RMP-covered process.\nb.  Process Hazard "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32830,
      "SummaryText": "Analysis (PHA)\nMLI conducted and will continue to conduct comprehensive studies to ensure that hazards associated with the RMP-covered process are identified and controlled.  The methodology used to carry out the hazard analysis on the covered process was a combination of the Hazard and Operability (HAZOP) Technique and the What-if/Checklist Technique.  A team of qualified personnel with expertise in engineering and operations undertook and will continue to undertake the PHA evaluations.  The studies are and will be led by personnel with knowledge and expertise in the techniques utilized to conduct this hazard analysis.  The PHA evaluations will be revalidated every five years.  Any findings of the team will be addressed in a timely and efficient manner.\nc.  Operating Procedures\nMLI maintains written operating procedures for the RMP-covered facility.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, and normal shutdown.  The information is regularly reviewed and is readily available to operators working in the covered processes.\nd. Training\nMLI has a comprehensive Process Safety Management (PSM) training program in place.  This ensures that employees, whose job tasks are affected by the covered process, are competent in the operating procedures associated with the process.  Refresher PSM training is provided at least every three years and more frequently as needed.\ne.  Mechanical Integrity\nMLI carries out documented maintenance checks on process equipment within the covered RMP process to ensure proper operations.  Process equipment that is examined includes: pressure vessels, storage tanks, piping system and components, relief and vent systems, controls, and pumps.  Trained and qualified personnel carry out maintenance operations.  Any equipment deficiencies identified are corrected in a safe and timely manner.\nf.  Management of Change\nWritten procedures a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32830,
      "SummaryText": "re in place at MLI to manage changes to process chemicals, technology, equipment, and procedures within the RMP-covered process.  Process operators and any employee whose job task is affected by the change are promptly made aware of and trained on the change.\ng.  Pre-startup Safety Reviews\nPre-startup safety reviews related to the covered RMP processes and to modifications in established covered RMP processes are conducted as needed.  These reviews are conducted to confirm that construction, equipment, and operating and maintenance procedures are suitable for safe startup of the process prior to placing the equipment into service.\nh.  Compliance Audits\nMLI will conduct audits on a regular basis, as stipulated in 40 CFR Part 68, to determine whether the provisions set out under the RMP regulation are being properly implemented in the covered RMP process.  These audits are conducted at least every three years and any corrective actions required as a result will be undertaken in a safe and timely manner.  Personnel with expertise in auditing will be utilized to complete the audits.\ni.  Incident Investigation\nIt is MLI's policy to investigate any incident that has resulted in, or could reasonably result in, a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent reoccurrence.  All incident investigation reports are retained for five years.\nj.  Employee Participation\nMLI believes that Process Safety Management and accident prevention is a team effort.  Employees are encouraged through Safety Committee meetings to express their views concerning accident prevention issues and to recommend improvements.  In addition, MLI employees have access to all information created as part of the facility's implementation of the RMP rule.  This includes information pertaining to the Process Hazard Analysis.\nk.  Hot Work Permit\nMLI has a policy in place to safely c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32830,
      "SummaryText": "onduct cutting, welding, or brazing activities in or adjacent to the covered process.\nl.  Contractors\nOn occasion, our facility hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, an evaluation of safety performance of the contractor is conducted.  With the RMP-covered process, MLI has a policy of informing the contractors of known potential hazards related to the contractor's work, applicable provisions of emergency response procedures, and safe work practices in the covered area.\n3.  Five-Year Accident History\nMLI has had no accidental releases that resulted in deaths, injuries, or significant property damage on or off site since the covered process was commissioned in February of  2002.\n4. Emergency Response Plan\nMLI maintains a written Emergency Response Plan to deal with potential accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, and notification of local emergency response agencies and the public.\nThe emergency response equipment is regularly inspected and serviced.  Mock emergency cleanup drills are conducted.  \nThe Grant County Local Emergency Planning Committee (LEPC) is the local emergency response committee with which our Emergency Response Plan has been coordinated.\n5. Planned Changes To Improve Safety\nIt is MLI policy to continually enhance safety and identify areas of improvement.  The company provides the direction and resources (equipment, training and work environment) such that employees and contractors will perform their jobs safely.  Each supervisor is responsible for a safe work environment and sees that each employee is adequately trained to recognize and comply with established safe work practices.  A safety committee, consisting of management and employee representatives, constantly works to improve safety in the workplace.  Each employee is responsible to be alert and "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 32830,
      "SummaryText": "accountable for his or her own actions.  Each employee is trained to notify management of unsafe conditions, training needs, compliance issues and to follow safe work practices."
    }
  ]
}