{
  "FacilityID": 32858,
  "FacilityName": "Technology Park, Union Carbide Corporation",
  "FacilityStr1": "3200 Kanawha Turnpike",
  "FacilityStr2": null,
  "FacilityCity": "South Charleston",
  "FacilityState": "WV",
  "FacilityZipCode": "25303",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "54039",
  "LEPC": "Kanawha Putnam LEPC",
  "FacilityLatDecDegs": "38.358333",
  "FacilityLongDecDegs": "-081.702222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.dow.com/ucc/index.htm",
  "FacilityEmailAddress": "jlguidarini@dow.com",
  "FacilityDUNS": 153018262,
  "ParentCompanyName": "The Dow Chemical Company",
  "Company2Name": null,
  "CompanyDUNS": 1381581,
  "Company2DUNS": 1381581,
  "OperatorName": "A. E. Fowler",
  "OperatorStr1": "3200 Kanawha Turnpike",
  "OperatorStr2": "P. O. Box 8361",
  "OperatorCity": "South Charleston",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "25303",
  "OperatorZipCodeExt": null,
  "FTE": 387,
  "OtherEPAFacilityID": "25303NNCRB32003",
  "EPAFacilityID": "100000160461",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-02-09 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-03-17 13:37:25",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 38.354466,
  "FRS_Long": -81.7072,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": null,
  "HorizontalAccMeasure": "51",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 47455,
      "AltID": "Polyolefins Pilot Plant",
      "FacilityID": 32858,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 62525,
          "ProcessID": 47455,
          "ChemicalID": 119,
          "Quantity": 42000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 62526,
          "ProcessID": 47455,
          "ChemicalID": 115,
          "Quantity": 58000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 62527,
          "ProcessID": 47455,
          "ChemicalID": 129,
          "Quantity": 70000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 62528,
          "ProcessID": 47455,
          "ChemicalID": 95,
          "Quantity": 42000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 48513,
          "ProcessID": 47455,
          "NAICSCode": "54171",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 27155,
              "Process_NAICS_ID": 48513,
              "SafetyReviewDate": "2004-02-01 00:00:00",
              "PHA_Date": "2001-10-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-08-23 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Flammable gas detectors",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-12-16 00:00:00",
              "TrainingReviewDate": "2004-01-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-02-26 00:00:00",
              "EquipmentInspectionDate": "2004-05-03 00:00:00",
              "EquipmentTested": "PSV on purification system",
              "ChangeMgmtDate": "2003-09-15 00:00:00",
              "ChangeMgmtReviewDate": "2004-03-01 00:00:00",
              "PreStartupReviewDate": "2004-04-27 00:00:00",
              "ComplianceAuditDate": "2002-07-01 00:00:00",
              "AuditCompletionDate": "2004-12-31 00:00:00",
              "IncidentInvestigationDate": "2003-04-23 00:00:00",
              "InvestigationChangeDate": "2003-05-02 00:00:00",
              "ParticipationPlansReviewDate": "2003-07-16 00:00:00",
              "HotWorkPermitReviewDate": "2003-01-01 00:00:00",
              "ContractorSafetyReviewDate": "2004-04-05 00:00:00",
              "ContractorSafetyEvalDate": "2004-02-23 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 39561,
                  "PreventionProgram3ID": 27155,
                  "ProcessChemicalID": 62525
                },
                {
                  "PrimaryKey": 39562,
                  "PreventionProgram3ID": 27155,
                  "ProcessChemicalID": 62526
                },
                {
                  "PrimaryKey": 39563,
                  "PreventionProgram3ID": 27155,
                  "ProcessChemicalID": 62527
                },
                {
                  "PrimaryKey": 39564,
                  "PreventionProgram3ID": 27155,
                  "ProcessChemicalID": 62528
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 32858,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-02-09 00:00:00",
    "ERTrainingDate": "2004-03-19 00:00:00",
    "CoordinatingAgencyName": "Kanawha/Putnam LEPC",
    "CoordinatingAgencyPhone": "3047441838",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Clean Air Act, TSCA, UST"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32858,
      "SummaryText": "RISK MANAGEMENT PLAN Executive summary\n\nUNION CARBIDE CORPORATION a wholly owned subsidiary of The Dow Chemical Company\nTECHNOLOGY PARK\n\nSince the last RMP submittal, Union Carbide Corporation (¿UCC¿) became a wholly owned subsidiary of The Dow Chemical Company in 2001.  The Union Carbide facilities at South Charleston, Institute, Technology Park, Massey Yard, and New Yard share leveraged support and management and are collectively called West Virginia Operations (¿WVO¿).\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nWVO is strongly committed to employee, public, and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances. If such a release should occur, our highly trained emergency response personnel are at hand to control and mitigate the effects of the release.  We are also an active member of the Kanawha/Putnam Emergency Planning Committee which provides additional emergency response expertise.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe Technology Park is a 651-acre complex housing pilot plants, research and development laboratories, and an engineering center.  Several administrative changes have occurred at this RMP covered source since the last RMP submittal including a name change from the ¿Union Carbide Technical Center¿ to the ¿Technology Park.¿  In 1999, two separate processes were listed.  Because of administrative changes, these two areas have been combined into one; no actual reduction or elimination of chemicals took place in this consolidation.\n\nWVO currently has 4 RMP regulated substances present in 1 covered pilot plant process at the Technology Park.  No threshold quantities of EPA regulated toxic substances are ha"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32858,
      "SummaryText": "ndled or stored at the Technology Park. WVO does handle and store threshold quantities of the following EPA RMP-regulated flammable substances at the Technology Park:  \n¿ Propylene\n¿ Ethylene\n¿ Isopentane\n¿ 1-Butene\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe Technology Park has experienced no accidental releases as defined by the RMP rule of regulated substances, during this period.\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nWVO¿s general accident prevention program consists of compliance with the EPA RMP rule, OSHA¿s PSM standard, and implementation of internal Operating Discipline Management System and standards.  Key elements include:\n\nProcess Safety Information\nWe maintain detailed records of safety information that describe the chemical hazards, operating parameters and equipment designs associated with all covered processes. Examples include, but are not limited to, Material Safety Data Sheets for all the hazardous chemicals, equipment design specification sheets, and reactive chemicals test results. This information is maintained up-to-date and is available to operating personnel.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified, evaluated, and controlled efficiently.  The methodologies used to carry out these analyses may include: Checklists, What If/Checklists (combined), Hazard and Operability Studies (HAZOP¿s), Reactive Chemical/Process Hazard Analyses, Chemical Exposure Index, Fire & Explosion Index, and Layers of Protection Analyses. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at regular intervals.  Any findings related to the hazard analysis are addressed in a timely manner.  \n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, WVO maintains written operating procedures.  These procedures address various modes of operation such as in"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32858,
      "SummaryText": "itial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nWVO has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided on a continuing basis.\n\nMechanical Integrity\nWVO carries out a documented Planned Preventative Maintenance Program (PPM) which provides checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes, but is not limited to: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, pumps, and compressors.  Maintenance operations are carried out by qualified personnel with training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWVO facilities require management of modifications to process equipment, procedures, raw materials, and processing conditions other than like for like, by identifying, documenting, and reviewing them prior to implementation of changes.   Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and receive training prior to the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted at WVO. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nSelf assessments and audits a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32858,
      "SummaryText": "re conducted on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  Audits are conducted using established schedules and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nWVO promptly investigates any incident that has resulted in, or could reasonably result in a significant release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nWVO believes that process safety management and accident prevention is a team effort.  WVO employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility¿s implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nWVO hires contractors to perform some specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is performed.  WVO has a strict policy of informing the contractors of known potential hazards related to the contractor¿s work and the processes he/she may encounter while on site.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\nThe WVO emergency response program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations, such as accidental releases.  Detailed written emergency response plans are developed and coordinated with the Kanawha/Putnam Emergency Planning Committee and the community.\n\nThe E"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 32858,
      "SummaryText": "R plan includes all aspects of emergency response, including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.  The plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nTo ensure proper functioning, quarterly emergency drills are conducted to enhance skills and tactics for responding to an accidental chemical release.  Critiques are held on drills and actual events.  Emergency response equipment is regularly inspected and serviced. In addition to the on-site emergency squad, WVO staffs a Distribution Emergency Response Team (DERT) in the Kanawha Valley that responds to accidental releases from transportation equipment throughout the continental United States\n\nKanawha/Putnam EPC is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nPursuant to American Chemistry Council (¿ACC¿) standards, the WVO Site has conducted vulnerability assessments and identified opportunities have been implemented.  An independent review of the completed improvements was performed in March 2004."
    }
  ]
}