{
  "FacilityID": 3288,
  "FacilityName": "DuPont Dow Elastomers L.L.C. - Louisville Plant",
  "FacilityStr1": "4242 Camp Ground Road",
  "FacilityStr2": null,
  "FacilityCity": "Louisville",
  "FacilityState": "KY",
  "FacilityZipCode": "40216",
  "Facility4DigitZipExt": "4698",
  "FacilityCountyFIPS": "21111",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "38.217778",
  "FacilityLongDecDegs": "-85.839444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 966339293,
  "ParentCompanyName": "DuPont Dow Elastomers L.L.C.",
  "Company2Name": null,
  "CompanyDUNS": 933194151,
  "Company2DUNS": 0,
  "OperatorName": "DuPont Dow Elastomers L.L.C.",
  "OperatorStr1": "4242 Camp Ground Road",
  "OperatorStr2": null,
  "OperatorCity": "Louisville",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "40216",
  "OperatorZipCodeExt": "1833",
  "RMPContact": null,
  "RMPTitle": "Plant Manager",
  "FTE": 326,
  "OtherEPAFacilityID": "40216DDLSV4242C",
  "EPAFacilityID": "100000041279",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "Not yet issued",
  "SafetyInspectionDate": "1997-10-20 00:00:00",
  "SafetyInspectionBy": "EPA Region IV - Chemical Safety Audit",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2008-02-29 00:00:00",
  "DeRegistrationEffectiveDate": "2008-01-18 00:00:00",
  "AnniversaryDate": "2004-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 38.21184,
  "FRS_Long": -85.84014,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "facility returned the last railcar containing chlorine to its supplier",
  "_processes": [
    {
      "ProcessID": 3698,
      "AltID": "Chlorine railcars (2)",
      "FacilityID": 3288,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3771,
          "ProcessID": 3698,
          "NAICSCode": "325212",
          "_desc": {
            "NAICS_CODE": "325212",
            "NAICS_DESCRIPTION": "Synthetic Rubber Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3954,
          "ProcessID": 3698,
          "ChemicalID": 62,
          "Quantity": 360000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503954,
          "ProcessID": 3698,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3288,
      "SummaryText": "Executive Summary\nRisk Management Plan (RMP)\nDupont Dow Elastomers L.L.C. - Louisville Plant\n\nIntroduction\n\nDupont Dow Elastomers L.L.C. (DuPont Dow) is a global supplier of specialty elastomer products with headquarters in Wilmington, Delaware.  DuPont Dow is a 50/50 joint venture between E. I. Du Pont de Nemours & Co., Inc. (DuPont) and the Dow Chemical Company (Dow).  The joint venture was formed on April 1, 1996, to consolidate the resources, production facilities, technical expertise, and business skills from both companies.  With approximately 1,500 employees worldwide, DuPont Dow offers a wide variety of polymer products that have end-use applications in automotive systems, wire and cable, construction, chemical processing, the general rubber industry, and in high-performance parts with excellent temperature, oil, and chemical resistance.  Examples of the end products that are made with DuPont Dow materials include:\n\n* Coatings - from rainwear to liners for roofs and tanks;\n* Automotive products - from power steering pressure hoses to high-performance timing belts;\n* Wire and cable insulation - from electrical wiring to power transmission cable; and\n* Industrial applications - from protective gloves, O-rings, and gaskets to microwave door enclosures and chemical-resistant hoses.\n\nThe Clean Air Act Amendments of 1990 established a statutory framework for assessing the risks to public health and the environment arising from the use of certain chemicals.  Regulations specifying what facilities must conduct these risk assessments, how to assess the risk, and what data to report were promulgated by the U.S. Environmental Protection Agency.  These regulations are known as the Risk Management Plan (RMP) rule and are published in Part 68 of Title 40 of the Code of Federal Regulations.  This executive summary is provided in compliance with 40 CFR ' 68.155 of the RMP rule.\n\nThe following sections provide a brief overview of the comprehensive risk management activities "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3288,
      "SummaryText": "that have been implemented by DuPont Dow at its Louisville, Kentucky, plant.  Topics include:\n\n* The plant's policies for preventing accidental releases and responding to emergencies\n* The location of the plant, its product, and its use of a substance regulated under the Risk Management Plan rule\n* A description of the assessment of potential consequences of accidental releases of the regulated substance\n* A general overview of the plant's programs to prevent accidental releases and a list of the layers of protection in place to prevent accidental releases of the regulated substance\n* A five-year history of the plant's accidental releases of the regulated substance\n* A description of the plant's emergency response program\n* A list of the changes the plant has planned to make that will improve safety\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe Dupont Dow Louisville Plant is committed to the safe and responsible operation and maintenance of its manufacturing process.  Corporate and site goals are to prevent all accidental releases and process safety incidents.  The Louisville plant has both corporate and local management policies and practices supporting these goals.  Performance against these goals is continually evaluated and communicated.  Achievement of goals is recognized and rewarded in various ways, including financially; the failure to attain the goals is regarded as unacceptable performance and treated accordingly.\n\nBeyond the goal of preventing accidental releases, the site's policy is to respond immediately and appropriately to any accidental releases or process safety incidents that occur.  This response is to minimize the impact of the release or incident on the safety of the work force and the public, and the environment.  To achieve this, members of the work force from all shifts are trained as emergency responders and are available on-site at all times.\n\nSite Identification and Regulated Substance Handled\n\nThe DuPont Dow Louisvi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3288,
      "SummaryText": "lle Plant is located in the Louisville, Kentucky, metropolitan area, on property leased from DuPont.  The address is 4242 Camp Ground Road.  Before the formation of the joint venture, the facility was owned and operated by DuPont.\n\nThe Louisville plant produces Neoprene (polychloroprene) synthetic rubber using chloroprene as its primary raw material.  Neoprene is used in a broad range of automotive, general industrial, aerospace, building construction, household, and consumer applications.  Typical products include CV joint boots, air springs, belts and hoses, electrical cord and cable insulation, bridge bearings, sealants, adhesives, gaskets, inflatable boats, waders, gloves, and soles for shoes and sandals.  DuPont Dow also manufactures Neoprene in La Place, Louisiana, and Kawasaki, Japan.\n\nChlorine, a substance listed as toxic under the Risk Management Plan rule, is used as a raw material at the Louisville plant for the production of a co-monomer used to make certain grades of Neoprene.  Chlorine is the only listed substance at the Louisville facility that is present in amounts above the threshold quantity.  It is delivered to the site in 90-ton railcars.  Only one railcar supplies chlorine to the production process at a time.  The Louisville plant has, at most, two chlorine railcars on-site at any time.\n\nWorst-case Release Scenario and Alternative Release Scenario\n\nThe Louisville plant's worst-case release scenario is taken from the U.S. Environmental Protection Agency's Risk Management Plan rule and the guidance documents prepared by the EPA for conducting off-site consequence analyses.  The EPA defines the worst-case scenario as a hypothetical release of the largest quantity of a regulated chemical in ten minutes, even if this is impossible.  Applying this definition to the DuPont Dow Louisville Plant, the worst-case scenario involves the release of the contents of a full chlorine railcar (180,000 pounds) in a ten-minute period and assumes no reduction from pa"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3288,
      "SummaryText": "ssive mitigation measures.  The chlorine release would reach off-site endpoints and public receptors.  This is unlikely due to the design and construction of the railcars and extensive programs to assure mechanical integrity of the railcars and associated equipment.\n\nThis worst-case scenario underscores the need for rigorous process safety management systems.  It is important to note, however, that none of the prevention and mitigation equipment, practices, and procedures that have been put in place at the DuPont Dow Louisville Plant to prevent or respond to releases such as this are taken into account for the worst-case scenario.\n\nSince the worst-case scenario is so very improbable, it is not a good case to focus on for emergency response planning with the local community.  To make emergency response planning more realistic, the EPA has included the requirement for companies to report an alternative release scenario.  The alternative release scenario provides a picture of what could actually happen if the plant's safety systems were to fail.\n\nThe Louisville Plant's alternative release scenario is similarly based on the EPA's regulations and guidance documents.  In this scenario, a 1/4\" diameter hole develops in the chlorine piping system, releasing 12,000 pounds of chlorine in 60 minutes.  This scenario assumes that the leak location cannot be addressed by the site's active and passive mitigation systems.  The chlorine release would reach an off-site endpoint but would not reach any public receptors.  This is also unlikely because of the layers of protection the facility has in place, as described in the following section.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nDuPont Dow has employed the concepts of accidental release prevention and process safety management since its formation.  Site practices that incorporate these concepts include the following:\n\n* Thorough understanding of process technology, including the safe l"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 3288,
      "SummaryText": "imits of the processes and the proper materials of construction for equipment\n* Proper design and installation of equipment\n* Systematic process hazard reviews to identify and address process hazards\n* Written operating and maintenance procedures\n* Extensive training for all persons who operate or maintain chemical process equipment\n* Mechanical integrity testing for detection of potential equipment problems and preventive maintenance to avoid releases\n* Mechanical quality assurance programs to ensure that the correct spare parts are installed whenever maintenance is performed\n* Procedures to identify and manage both obvious and subtle changes in technology, equipment, and personnel, that could have an effect on the site's safety and environmental performance\n* Pre-startup safety reviews for newly installed or modified equipment\n* Compliance audits to ensure that process safety management principles, procedures, and regulations are effective and properly implemented\n* Investigation of actual and potential incidents to identify and implement corrective actions\n* Participation of all employees in the process safety management system\n* Documented safe work practices, including hot work procedures requiring the issuance of hot work permits\n* Contractor safety management system to ensure that work done by contractors is performed safely and in compliance with DuPont Dow standards\n\nIn addition to the site-wide practices described above, the following items provide multiple layers of protection against accidental releases of chlorine:\n\n* Automatic air-operated valves that can isolate the active railcar (the one currently supplying chlorine to the production process) by remote control if necessary.  These valves have an emergency air supply as a backup for the plant's compressed air system.  The time required to close these valves is approximately five seconds.\n* Interlocks that automatically shut off the chlorine supply in the event of certain process deviations\n* Excess f"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 3288,
      "SummaryText": "low valves that close automatically if the chlorine flow rate indicates a potential line leak\n* Continuous video camera surveillance of the chlorine railcars from the process control room\n* After being placed in the desired location, each chlorine railcar is kept from moving by the railcar's hand brake and by chocks on the wheels.  A motion detector is activated that will automatically close the valves at the active railcar if it is moved.\n* Highly sensitive, state-of-the-art chlorine detectors around the railcar unloading spots and along the chlorine supply line that sound an alarm in the computerized process control system when a leak is detected.  These detectors are checked and calibrated monthly.  In addition, the detectors have a self-test capability that sounds an alarm when the detector element fails.\n* A dedicated emergency scrubber system designed to absorb and neutralize the entire contents of the chlorine supply line plus the amount of chlorine that would go into the process in a ten-minute period.  This provides capacity needed in the event that the automatic shutoff valves at the active railcar fail to operate, requiring an operator to close the valves manually.\n* Valves isolate the chlorine supply line into two sections.  Either section can be vented to the emergency scrubber system, if necessary.  All of the valves in the chlorine supply line can be operated remotely from the process control system.\n* The mechanical integrity of the chlorine supply line is verified by periodic visual inspections and by annual thickness measurements.  All bends in this line are X-rayed annually to detect any evidence of corrosion or erosion that would reduce metal thickness and compromise mechanical integrity of the line.\n* Flexible unloading hoses that connect the railcars to the chlorine supply line are replaced annually.\n* When hoses are disconnected from the railcars, the free ends are covered to keep moisture out of the chlorine line.\n* Extensive training in safe"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 3288,
      "SummaryText": " chlorine unloading procedures is given to all operators who have responsibility for this area.  Operators are recertified through retraining and a written test every three years.\n* Process hazard reviews of the chlorine system are conducted at least every five years.\n\nFive-Year Accident History\n\nSince April 1, 1996, DuPont Dow Louisville Plant has had no accidental releases involving chlorine that resulted in deaths, injuries, or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  From the beginning of the five-year period to April 1, 1996, DuPont operated the site and reported no off-site injuries, evacuations, sheltering in place, property damage, or environmental damage involving chlorine.  During the five-year period, there have been no reportable releases of chlorine.\n\nEmergency Response Program\n\nThe DuPont Dow Louisville Plant has developed and implemented an emergency response program for the purpose of protecting public health and the environment.  This program includes a written emergency response plan, maintained at the site, containing procedures for informing the public and local emergency response agencies in the event of an accidental release.  Documentation of proper first-aid and emergency medical treatment necessary to treat accidental human exposures to regulated substances is included in the plan.  Procedures and measures for emergency response after an accidental release of a regulated substance are also part of the plan.  This plan is coordinated with the community emergency response plan developed by the Louisville and Jefferson County Local Emergency Planning Committee (LEPC).\n\nIn addition, the site's emergency response program includes procedures for the use, inspection, testing, and maintenance of emergency response equipment.  Under the program, training is provided to all employees in procedures relevant to their roles in an emergency situati"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 3288,
      "SummaryText": "on.  The program provides procedures to review and update the emergency response plan to reflect changes at the site, and to communicate the updated plan to employees.\n\nPlanned Changes to Improve Safety\n\nAs part of the plant's process hazards review procedures, the manufacturing process involving chlorine is thoroughly studied on a periodic basis to identify risk reduction opportunities.  As a result of these studies, the plant is currently implementing, or is planning to implement, the following risk reduction measures:\n\n* Upgrade existing chlorine supply line insulation \n* Upgrade safety relief valves on the chlorine supply line\n* Install protective barricades for the chlorine supply line at road crossings in the plant\n* Improve preventive maintenance inspections and procedures\n* Improve training programs\n* Conduct process safety audits to identify any deficiencies in the plant's management systems"
    }
  ]
}