{
  "FacilityID": 32923,
  "FacilityName": "Irons Fork Water Treatment Facility",
  "FacilityStr1": "536 Polk 184",
  "FacilityStr2": null,
  "FacilityCity": "Mena",
  "FacilityState": "AR",
  "FacilityZipCode": "71953",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05113",
  "LEPC": "Polk LEPC",
  "FacilityLatDecDegs": "34.643000",
  "FacilityLongDecDegs": "-094.130528",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "menawtr@earthlink.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Mena Water Utilities",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Mena Water Utilities",
  "OperatorStr1": "701 Mena Street",
  "OperatorStr2": null,
  "OperatorCity": "Mena",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "71953",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000142455",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-01-07 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-05-19 00:00:00",
  "DeRegistrationEffectiveDate": "2014-03-31 00:00:00",
  "AnniversaryDate": "2009-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 34.62693,
  "FRS_Long": -94.1402,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "4.6",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 47545,
      "AltID": "Chlorine",
      "FacilityID": 32923,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 62684,
          "ProcessID": 47545,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 48618,
          "ProcessID": 47545,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 18424,
              "Process_NAICS_ID": 48618,
              "SafetyReviewDate": "2004-06-21 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 1,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2004-06-14 00:00:00",
              "ChangeCompletionDate": "2004-06-14 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-06-14 00:00:00",
              "TrainingReviewDate": "2004-06-14 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-06-14 00:00:00",
              "EquipmentInspectionDate": "2004-06-14 00:00:00",
              "EquipmentTested": "Chlorine ejector system, from feeder on chlorine cylinders to injection feeders.",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "Chlorine is in an enclosed room",
              "_chemicals": [
                {
                  "PrimaryKey": 19217,
                  "PreventionProgram2ID": 18424,
                  "ProcessChemicalID": 62684
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 32923,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-06-14 00:00:00",
    "ERTrainingDate": "2004-06-14 00:00:00",
    "CoordinatingAgencyName": "Office of Emergency Management",
    "CoordinatingAgencyPhone": "4793948141",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32923,
      "SummaryText": "THE ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE AT YOUR FACILITY.\nThe Irons Fork Water Treatment Facility's overall approach to chemical safety is to handle all chemicals in the safest means possible.All chemicals can be handled in a safe manner, and any chemical can produce injury if used in an unsafe manner, whether it be minor or major injury.In developing the emergency plan for the accidental leakage of chlorine gas, the following safety precautions will be taken:\n1. Yearly training on all phases of safety pertaining to chlorine gas.This will include using the chlorine \"B\" kit, utilizing the self contained breathing apparatus (SCBA), and safe handling procedures of the chlorine ton cylinders.\n2. Cross training with area rural fire departments, the City of Mena Fire Department, and law enforcement departments.The cross training is for the education of these departments which will be utilized for the evacuation and isolation of possible contaminated areas within the evacuation area.\n3. Working with the City of Mena Fire Department, which has a first responder team and has had training in hazardous chemicals.This team will assist the Mena Water Department in the event of a hazardous chemical leakage. They will not be responsible for the containment or elimination of the leakage.\n4. Creating a first responder team consisting of personnel from the Mena Water Department.This team will be responsible for the containment and elimination of the chlorine leak.\n5. Attending any safety meetings that may be presented.For example, State meetings, District Meetings,Arkansas Rural Water Association Meetings, and American Water Works Association Teleconferences and other related training events which may confront the safety concerns and issues of chlorine gas leakage.\nYOUR FACILITY AND THE REGULATED SUBSTANCES HANDLED.\nThe Irons Fork Water Facility is the potable water treatment facility for the City of Mena Arkansas, and Rural Water Associations which are connected to "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32923,
      "SummaryText": "and purchase water from the City of Mena Water Department.This treatment facility is responsible for the safe production of a potable water supply to the customers connected to the public water system utilizing specific chemicals into the treatment facility for the purpose of treating the water to exceed the minimum required standards set forth by the State of Arkansas Regulating agency. These chemicals include only one chemical that would impose immediate health threats if leakage occurred. This chemical is chlorine gas, liquified by pressure.Chlorine gas is stored at the treatment facility in two thousand pound (ton) cylinders.This chlorine gas is compressed by pressure to form a liquid; the bottom section of the cylinder is liquid, while the top section is gas. It is the top section (gas) which injects chlorine into our water treatment process, pressure is lowered within the cylinder. This allows more of the liquid chlorine to be \"decompressed into chlorine gas\", which then can be fed into the treatment process by our chlorine feeders.The maximum qauntity of chlorine of one ton is connected to the chlorine feeder, while the other two are used for storage until needed.\nTHE WORST CASE SCENARIO(S) AND THE ALTERNATIVE RELEASE SCENARIO(S)\nA worst case scenario and a general accidental release of chlorine will be treated the same way. It is not known if it will be a worst case scenario until the feed valve on the cylinder is completely closed.If the valve is completely closed and leakage still occurs, the operator will then decide if the leak is large enough to initiate the worst case evacuation plan, or if it will be an alternative release with only the alternative evacuation release area being evacuated.As soon as this determination is made, the operator will evacuate the site and call 911 from a neighborhood residential house and notify operators of a chlorine leakage and either worst case or alternative release. This will allow those responsible for evacuation to t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32923,
      "SummaryText": "ake action without any further information needed.Evacuation and containment or elimination of leakage will be further covered in the emergency response program portion of this emergency plan.\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION AND CHEMICAL SPECIFIC PREVENTION STEPS.\nIn the event an accidental leakage of chlorine gas occurs, the operator on duty should immediately try to isolate the leak by turning the feeder valve to the off position.If immediate elimination of the chlorine leakage is not achieved by this method, the operator should immediately evacuate the site to an area residence, call 911 and notify them of a hazardous chemical leak (chlorine)  at the Irons Fork Water Treatment Facility. The 911 operator would then dispatch the first responder team and notify the rural fire departments, the Mena Fire Department, and Local Law Enforcement Offices in order to begin evacuations. 911 would then notify the chlorine institute (Chemtrek), who will then notify Curtis Thomas of Harcross Chemical ( Chlorine Response Leader ). The Mena Water Department will notify Curtis Thomas as well, as soon as 911 has been notified. Only trained personnel, who are equipped with self contained breathing apparatus (SCBA) should investigate or work to contain or eliminate any leakage that may occur; all other persons should be kept away from the contaminated area. Any leakage from the feeding system can be easily remedied by closing the feed valve on the ton cylinder and isolating the leak to a minimal incident.Yearly maintenance will replace any old or worn feed tubing and will replace parts on the chlorine injector which will wear out or dry rot which could produce the possibility of leakage.Daily inspection of ton chlorine cylinders and testing feed valves for any possible signs of leakage will be a priority of daily duty requirements.This will allow action to be taken before the leak would become a major risk factor.The Mena Water and Sewer Department will be working closely w"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32923,
      "SummaryText": "ith area Rural Fire Departments, The Mena Fire Department, and our Law Enforcement Agencies to ensure that proper training and cross training will take place so that expedient,correct,and safe measures can be taken to limit the amount of chlorine leakage that may occur and to ensure safe and expedient evacuation if this course of action is necessary.After evacuation of residents, they would only be allowed to return to their homes after the air quality has been determined to be safe.This determination will be made by the Mena Fire Department through testing of the air quality.\nFIVE YEAR ACCIDENT HISTORY-We have had zero accidental release of chlorine in the past 5 years.\nTHE EMERGENCY RESPONSE PROGRAM\nThe elements of the Emergency Response Program would be first to notify 911, who would then notify the First Responders with the Mena Fire Departments and Local Law Enforcement Agencies who would assist with evacuation procedures, and then notify Chemtrek (Chlorine Institute), who would then notify Curtis Thomas of Harcros chemical who is the Chlorine Response Leader and would respond to the City of Mena for any assistance he could provide.After notifying 911, the operator would then notify Curtis Thomas of Harcros Chemical for expedient service to try to remedy the problem as quick as possible. The Mena Fire Department would be responsible for conducting the evacuation,all other departments would need to correspond their actions through the Mena Fire Department.After evacuation no personnel will be allowed in the evacuation area unless properly trained for containment and elimination of chlorine leakage. The First Responder Team will consist of personnel from the Mena Water Department and the Mena Fire Department.This team will be responsible for the containment or elimination of the leakage, and will be proficient in utilizing the chlorine \"B\" kit,the useage of self contained breathing apparatus (SCBA),and cardio pulmonary resucsitation (CPR).This team is responsible"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 32923,
      "SummaryText": " for the containment and elimination of the chlorine leak.These personnel will be required to attend any and all training events that would pertain to the containment and elimination of possible chlorine leakage.Public notice would be by local radio stations.This would be done in conjunction with calls from the Mena Water and Sewer Department personnel to each house within the evacuation area, and also while the house to house evacuations are being performed by the local law enforcement agencies (Mena Fire Department will be in charge) with assistance from Rural Fire Departments.\nPLANNED CHANGES TO IMPROVE SAFETY-Planned changes to the Mena Water Department's current program that would improve the safety of the storage site will include required training for Water Department personnel and cross training with the local authorities, Office of Emergency Services,and Rural Fire Departments.Also, cross training with the Mena Fire Department for the First Responder Team.These training and education programs will include the following:\n1. Training on the chlorine \"B\" kit.\n2. Attending all safety meetings possible, state,district, or other.\n3. Training on self contained breathing apparatus (SCBA).\n4. Training with both chlorine \"B\" kit and the SCBA."
    }
  ]
}