{
  "FacilityID": 32970,
  "FacilityName": "Harbor Generating Station",
  "FacilityStr1": "161 North Island Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Wilmington",
  "FacilityState": "CA",
  "FacilityZipCode": "90744",
  "Facility4DigitZipExt": "6303",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.769167",
  "FacilityLongDecDegs": "-118.266667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "www.ladwp.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Los Angeles Department of Water and Power",
  "Company2Name": null,
  "CompanyDUNS": 603080136,
  "Company2DUNS": null,
  "OperatorName": "Department of Water and Power",
  "OperatorStr1": "161 North Island Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Wilmington",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90744",
  "OperatorZipCodeExt": "6303",
  "FTE": 74,
  "OtherEPAFacilityID": "CAD000633180",
  "EPAFacilityID": "100000139673",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "800170",
  "SafetyInspectionDate": "2001-11-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2007-02-13 14:30:05",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 33.7691,
  "FRS_Long": -118.2662,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 47596,
      "AltID": "Ammonia Solution Storage",
      "FacilityID": 32970,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 62741,
          "ProcessID": 47596,
          "ChemicalID": 57,
          "Quantity": 110000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 48669,
          "ProcessID": 47596,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 18448,
              "Process_NAICS_ID": 48669,
              "SafetyReviewDate": "2004-04-01 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "API, UBC, UFC",
              "FR_Comments": "Engineering standards and codes are used in the design and construction of tanks and process piping.",
              "HazardReviewDate": "2004-04-12 00:00:00",
              "ChangeCompletionDate": "2005-04-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-04-12 00:00:00",
              "TrainingReviewDate": "2004-04-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-04-12 00:00:00",
              "EquipmentInspectionDate": "2004-04-01 00:00:00",
              "EquipmentTested": "Ammonia solution tanks, valves, pumps, piping, scrubbers, pressure/vacuum relief valves, ammonia gas detectors, emergency eyewash stations, and personal protective equipment.",
              "ComplianceAuditDate": "2004-03-25 00:00:00",
              "AuditCompletionDate": "2004-06-04 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 19241,
                  "PreventionProgram2ID": 18448,
                  "ProcessChemicalID": 62741
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 32970,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Los Angeles Fire Department",
    "CoordinatingAgencyPhone": "3105487549",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "California Business Plan, CCR Title 19, Sections 2729-2732"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32970,
      "SummaryText": "Aqueous ammonia (ammonia) is the most commonly used substance for reducing\noxides of nitrogen from the electric power generating stations. The Los Angeles Department \nof Water and Power (LADWP) also uses ammonia for reducing the emissions of oxides of \nnitrogen from its Harbor Generating Station (HGS). Storing and handling large quantities of \nammonia can create hazardous situations.  The LADWP takes safety obligations in storing \nand using ammonia as seriously as it takes in power generation. The LADWP Harbor \nGenerating Station ammonia handling process is subject to the U.S. Environmental \nProtection Agency (EPA) Risk Management Program and Plan and also to the California \nAccidental Release Prevention (CalARP) Program.  The facilities subject to the EPA and \nCalARP regulations are required to prepare and update Risk Management Plans (RMPs).  \nThe RMP is to include policies and procedures followed to safely operate the facility and the \nactions which will be taken by the facility in an event of an emergency. LADWP prepared \nand submitted the RMP for the Harbor Generating Station in June 1999.  This RMP is the five \nyear update of the June 1999 RMP.  The following information is specifically required in the \nRMP Update Executive Summary: \n\n* Accidental release prevention and emergency response policies.\n* General facility and regulated substances information.\n* Summary of the accidental release prevention program and chemical-specific \nprevention steps.\n* Five-year accident history summary.\n* Emergency response program summary.\n* Planned changes to improve safety.\n\nThe above information for the Harbor Generating Station is provided below.\n\nAccidental Release Prevention and Emergency Response Policies\n\n      The City of Los Angeles Department of Water and Power accidental release \nprevention policy involves a unified approach that integrates technologies, procedures, and \nmanagement practices. All applicable procedures of the California Accidental Release \nPre"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32970,
      "SummaryText": "vention (CalARP) Program and U.S. Environmental Protection Agency Prevention \nProgram are adhered to.  \n\n      The HGS facility is a non-responding facility, which means that the facility \nemployees will not respond to ammonia accidental release.  Instead, the facility has \ncoordinated with local response agencies (City of Los Angeles Fire Department) to respond \nto any ammonia release that may occur at the HGS facility.\n\nGeneral Description of the Stationary Source and Regulated Substance\n\n      Harbor Generating Station is located at 161 North Island Avenue in Wilmington, \nCalifornia 90744.  The HGS is a gas-fired electricity generating facility that supplies \nelectrical power to the LADWP system.  The facility is managed and operated around the \nclock.  There is a minimum crew of three operators and one shift supervisor.  On a normal \nday shift, there are approximately 74 on-site personnel including Operations, Technical, \nMaintenance, Clerical, and Warehouse staff.\n\n      The facility consists of two main 80-megawatt (MW) natural gas combustion \nturbines.  These combustion turbines exhaust hot gases through two Heat Recovery Steam \nGenerators (HRSG) to produce steam to drive a conventional 80 MW steam turbine.  The \nfacility also has two small combustion turbines that are capable of generating 20 MW each of \npower.  These small turbines are simple cycle gas or distillate oil-fired turbines and are \nutilized for peaking loads only, due to their inefficient heat rate.  The HGS facility also \ninstalled five additional simple cycle gas or distillate oil fired turbines in 2001.  These \ncombustion turbines are capable of generating about 47 MW each of power.\n\n      The main combustion turbines and the five simple cycle turbines installed in 2001 are \nequipped with selective catalytic reduction (SCR) units to control emissions of oxides of \nnitrogen (NOx), a combustion byproduct that is a precursor to ozone.  In the presence of a \ncatalyst housed in the SCR, ammonia (N"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32970,
      "SummaryText": "H3) gas, a reducing agent, is injected into the flue \ngas to react with NOx to form nitrogen gas (N2) and water vapor (H2O) according to the \nfollowing chemical reactions:\n      \n   4 NH3   +   6 NO --> 5  N2   +   6 H2O\n   8 NH3   +   6 NO2 --> 7  N2   +   12 H2O\n   \nAmmonia Process Description\n\n      The ammonia solution storage and supply system (ammonia process) has the dual \nfunction of injecting ammonia for NOx emissions control in each heat recovery steam \ngenerator and exhaust from five simple cycle combustion turbines and also for pH control of \nthe boiler feed water.  The ammonia process consists of three subsystems:\n\n* Ammonia Handling and Storage.\n* Emission Control.\n* Chemical Feed.\n\nAmmonia Handling and Storage\n\n      The aqueous ammonia handling and storage subsystem supplies ammonia solution to \nthe nitrogen oxide emission control catalyst and to the Chemical Feed subsystem. Aqueous \nammonia solution is used instead of anhydrous ammonia because the latter has some serious \ninherent safety hazards requiring significant precautions and safety equipment in handling \nand storing.  The risks and safety related costs of anhydrous ammonia are found to outweigh \nthe higher costs for transportation and storage of ammonia solution.\n\n      Ammonia solution at 29% concentration (29% ammonia and 71% water) is stored in \ntwo 30,000 gallon, aboveground tanks.  The maximum inventory is 25,000 gallons per tank.  \nThe tanks are each 20-foot high cylinders with 18-foot diameters and are surrounded by a \ncontainment system consisting of 6 inch thick, 50 feet long, 30 feet wide, and 3 feet high \nconcrete walls.  Two 0.7-gallon-per-minute (gpm) pumps, each fully redundant, dispense \nammonia solution to the emission control equipment.  Other safety equipment associated \nwith these tanks are: pressure/vacuum relief valves, liquid level alarms, two ammonia vapor \nscrubbers, quick fill connections, vapor recovery and associated piping, seven strategically-\nlocated ammonia vap"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32970,
      "SummaryText": "or detectors, and three emergency eyewash/shower stations.\n\n      Ammonia solution is delivered by truck into the storage tanks through a quick fill \nconnection, located behind safety/collision barriers.  The truck parks within a sloped \ncontainment area, which drains to a sump in the adjacent containment dike. The solution \nunloading to the storage tanks is done through a quick fill connection.  A truck-mounted \nvapor recovery system is connected to the tank vapor recovery system during the unloading.  \nThe storage tanks are equipped with pressure and vacuum relief valves and the tanks are \nmaintained at ambient temperature and atmospheric pressure.\n\n      A redundant dispensing pump is placed into service when either the main pumps fails \nor are out of service for preventative maintenance.  The tanks are protected from direct \nexposure to the sun and contain remote controls of pump and valve operations.  The loading \noperator is provided with a readily accessible water supply to wash spills quickly into the 8-\nfoot trench for rapid containment.  All spills are conveyed to a wastewater sump for \ntreatment prior to discharge.  Flashing lights and audible alarms at the tanks and in the main \ncontrol room are activated when the ammonia gas monitors detect the gas concentration \nabove 20 parts per million in the surrounding area.\n\nEmission Control\n\n      Ammonia solution is pumped from storage tanks to two evaporator and air mixing \nchamber systems, one for each HRSG.  These systems are located outside of the Power \nHouse building, along the southern wall at the southwestern corner.  Heated air is provided to \nthe air-mixing chamber by dilution air fans and heaters.  The air/water vapor/ammonia \nmixture is then piped to the Ammonia Injection Grid (AIG) in the HRSG using an \narrangement of nozzles to assure an even distribution throughout the flue gas.  The flue gas \nenters the SCR bed where the catalyst promotes the reaction.  Flow control valves operated \nas a functio"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 32970,
      "SummaryText": "n of combustion turbine load, the turbine exhaust flow rate, and the final stack \nexhaust nitrogen oxide concentrations control the feed rate of the ammonia solution.\n\nChemical Feed\n\n      Ammonia solution from the storage tanks is automatically fed to a 200-gallon dilution \ntank where the solution is further diluted to 0.3%.  The diluted solution is pumped to the \nboiler feed water system at a flow rate of up to 3 gallon per hour and 300-psig, based on the \nspecific conductivity measurements of the feed water at the boiler feed pump discharge.\nSummary of the Accidental Release Prevention Program and Ammonia \n\nAccidental Release Prevention\n\n      The general LADWP accidental release prevention program is based on the following \nkey elements:\n\n* High level of training of the operators in safe handling of chemicals.\n* Effective preventive maintenance program.\n* Use of state-of-the-art process and safety equipment.\n* Use of accurate and effective operating procedures, written with the participation \nof the operators.\n* Performance of a hazard review of equipment and procedures.\n* Implementation of an auditing and inspection program.\n\nOther specific steps to prevent accidental ammonia releases include:\n* The extensive training of the operators in the safe handling of ammonia, with \nemphasis on the hazardous and toxic properties of the chemical.\n* Required ammonia safe handling training of tank truck drivers from suppliers as \nwell as their equipment preventive maintenance program.\n* The availability of self-contained breathing apparatus (SCBA) at close proximity \nto the storage tanks.\n* The installation of tank liquid levels alarm, pressure levels alarm, \npressure/vacuum relief valve, vapor recovery system, gas scrubbers, and \nammonia gas detectors around the storage area.\n* The installation of secondary containment system and sumps.\n* Water deluge system to dilute and wash spilled ammonia solution into the sumps \nequipped with a high liquid level alarm.\n\nSafety Informa"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 32970,
      "SummaryText": "tion\n\n      Comprehensive chemical data has been assembled to include regulatory reporting and \naction thresholds, health hazard, and chemical exposure limitations, as well as detailed \nphysical properties of ammonia.  This information includes ammonia background \ninformation and MSDS sheets.\n\n      Equipment safety information was compiled on the ammonia process. Specifications \nfor the ammonia process are collected and provided in one place for easy reference. Details \nsuch as maximum intended inventory; safe upper and lower temperatures; and safe upper and \nlower pressures for the ammonia handling facility are on file at the facility.  LADWP also has \nprocedures in place that are triggered to update safety information if there is a major change \nthat makes existing information inaccurate.\n\nHazard Review \n\n      In 1999, a detailed hazard review was conducted for the ammonia facility equipment \nand procedures.  The hazard review was further reviewed in April 2004. This hazard review \nalso included the ammonia injection system for the five simple cycle combustion turbines, \nwhich were installed in 2001. The hazard review will be updated again within a five-year \nperiod or whenever there is major change in the process.  A list of recommended actions was \ndeveloped in April 2004 to further improve the ammonia safety and staff is currently \nevaluating these recommendations. Staff will document the completion of the recommended \nactions.\n\n      A seismic walkthrough was recently completed based on the LEPC Region 1 \nguidance document, and recommendations were provided to LADWP staff for their \nevaluation and implementation. \n\nOperating Procedures\n\n      LADWP has prepared written operating procedures for the Harbor Generating Station \nthat provide clear instructions or steps for safely conducting activities relating to ammonia \ninjection process. They are consistent with the ammonia safety information.  Written \noperating procedures included in the facility's Operation"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 32970,
      "SummaryText": "and Maintenance Manual include: \n\n* Delivery of Ammonia\n* Initial Startup Procedure\n* Normal Operation\n* Normal Shutdown\n* Temporary Operations\n* Emergency Operations\n* Emergency Shutdown\n* Startup Following Emergency Shutdown\n\nTraining \n\n      The LADWP ensures that each employee operating or maintaining the ammonia \nprocess, and each employee newly assigned to this process, is trained and tested for \ncompetency in the operating procedures listed above.  The LADWP employee training \ndocumentation files include training records for each employee assigned to operate or \nmaintain the ammonia injection process. The training ensures that the employee has the \nrequired knowledge, skills, and abilities to safely carry out the duties and responsibilities, \nincluding ammonia emergency response, as provided in the operating procedures.  Employee \ntraining includes as a minimum the following elements:\n\n* Safety Information.\n* Process Technology and Process Equipment, including safety systems.\n* Maintenance Procedures.\n* Operating Procedures for the ammonia system.\n* RMP Program contents.\n* Emergency Response Plan and Procedures.\n\n      Refresher training is provided at least every three years to each employee operating \nthe ammonia injection process to ensure that the employee understands and adheres to the \ncurrent operating procedures.  In addition, LADWP ensures that operators are trained in any \nupdated or new procedures prior to startup of a process after major modifications.  Training \nprograms for the Harbor Generating Station were most recently reviewed on June 2, 2004.\n\nMaintenance \n\n      The LADWP operates a MAXIMO System that generates a task order for \nperformance of the preventive maintenance routine after a designated time past the closing of \nthe previous task order for that maintenance.  Description of the work to be performed is \nincluded with the printed work order.  \n\n      LADWP documents inspection, testing, and maintenance of ammonia injection \nequipme"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 32970,
      "SummaryText": "nt and assures the performance is done in accordance with the recommendations of \nthe manufacturer and industry groups.\nInternal Compliance Audits\n\n      The LADWP certifies every three years (or earlier) that compliance with Program 2 \nPrevention Program requirements are met and that procedures and practices developed are \nadequate and being followed.\n\n      The compliance audit consists of separating the RMP program elements or sections, \nand auditing each element to determine compliance and effectiveness.  For each internal \naudit, the audit team completes a Compliance Audit Certification Page and a Compliance \nAudit Checklist.  The Compliance Audit Certification Page provides process identification, \nthe dates of the audit, team members, and certification by the audit leader and the Plant \nManager.  The Compliance Audit Checklist details the requirements of each RMP element \nand contains questions that may assist with the auditing process. The audit checklist for each \nelement consists of the following three sections:\n\n* Records Review: A review of the RMP written Prevention Program.\n* On-Site Conditions: The audit team reviews the program elements based on \nobservation of the plant conditions and safety practices.\n* Interviews:  The program elements are evaluated by interviewing personnel from \nappropriate functions including operations, maintenance, management, and \ncontractors.\n\n      Team members record RMP program deficiencies identified during the audit on the \nchecklist.\n\nIncident Investigation\n\n      The LADWP incident investigation procedures describe incident reporting, \ninvestigation, and investigation reporting steps to be followed by plant personnel.  The \nincident investigation is started promptly but no later than 48 hours after the event.  The \nLADWP promptly addresses and resolves all recommendations and implements the \nrecommendations in a timely manner to prevent an incident recurrence.  All incident \ninvestigation reports are retained on LADW"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 32970,
      "SummaryText": "P file for at least a period of five years from the \ndate the reports are completed.\n\nFive-year Accident History Summary\n\n      No accidental releases of ammonia gas or solution that meet the reporting \nrequirement of the EPA's RMP have occurred at this facility for the past five years (i.e. after \nJune 1999).\n\nEmergency Response Program Summary\n\n      The HGS facility is a non-responding facility, which means that the facility \nemployees will not respond to aqueous ammonia accidental release.  Instead, the facility has \ncoordinated with local response agencies to respond to any aqueous ammonia release than \nmay occur at the HGS facility.\n\nPlanned Changes to Improve Safety\n\n      As part of the preparation of a Risk Management Program, a hazard review was \nperformed in June 1999 for the ammonia handling system.  The hazard review was \nperformed using the Hazard and Operability (HAZOP) technique and covered both \nequipment and procedures used for the ammonia handling system.  A number of equipment \nand procedural changes were made as part of the implementation of the recommended \nactions.  All the above recommendations have been evaluated and implemented by the \nLADWP. Additional 11 changes to further improve ammonia safety were identified in April \n2004, when the hazard review was completed for the facility. It is expected that these \nrecommendations will be evaluated by December 2004.  The implementation of these \nrecommendations will further improve the safety of the ammonia system."
    }
  ]
}