{
  "FacilityID": 32993,
  "FacilityName": "Stora Enso North America - Water Quality Center",
  "FacilityStr1": "2811 Fifth Avenue North",
  "FacilityStr2": null,
  "FacilityCity": "Wisconsin Rapids",
  "FacilityState": "WI",
  "FacilityZipCode": "54495",
  "Facility4DigitZipExt": "8117",
  "FacilityCountyFIPS": "55141",
  "LEPC": "Wood County LEPC",
  "FacilityLatDecDegs": "44.419722",
  "FacilityLongDecDegs": "-089.834167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.storaenso.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Stora Enso North America, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6130777,
  "Company2DUNS": null,
  "OperatorName": "Stora Enso North America, Inc.",
  "OperatorStr1": "P.O. Box 8050",
  "OperatorStr2": null,
  "OperatorCity": "Wisconsin Rapids",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54495",
  "OperatorZipCodeExt": "8050",
  "FTE": 6,
  "OtherEPAFacilityID": "54494CNSLDNAS",
  "EPAFacilityID": "100000060015",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "03-MHR-242-OP",
  "SafetyInspectionDate": "2002-06-27 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-05-19 00:00:00",
  "DeRegistrationEffectiveDate": "2014-05-14 00:00:00",
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 44.42328,
  "FRS_Long": -89.831663,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 47621,
      "AltID": null,
      "FacilityID": 32993,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 62769,
          "ProcessID": 47621,
          "ChemicalID": 57,
          "Quantity": 38000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 48694,
          "ProcessID": 47621,
          "NAICSCode": "56221",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 32993,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2002-04-08 00:00:00",
    "ERTrainingDate": "2002-04-25 00:00:00",
    "CoordinatingAgencyName": "Wood County LEPC",
    "CoordinatingAgencyPhone": "7154218500",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32993,
      "SummaryText": "Stora Enso North America, Inc. (SENA) is committed to operating in a manner that is safe for SENA workers, the public, and the environment.  As part of this commitment, SENA has established procedures to help ensure safe operation of the processes at its facilities.  SENA's Water Quality Center (WQC) has developed a risk management program (RMP) that complies with the requirements of the Environmental Protection Agency's (EPA's) regulation 40 CFR Part 68, Accidental Release Prevention Requirements:  Risk Management Programs (the RMP rule) and helps to manage the risks of the covered substances and processes.  One of the requirements of the RMP rule is to submit a risk management plan describing the risk management program at WQC.  This document is intended to satisfy the risk management plan requirements of the RMP rule.\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nIn April 1967, SENA adopted a corporate environmental policy that guides the continuous improvement of its environmental performance as it strives to prevent pollution and achieve the objective of operating facilities with minimal environmental impact.  This policy was updated in November 1996.  The corporate environmental policy statement is publicly available on SENA¿s Internet website.  As part of its risk reduction objective, SENA will strive to minimize environmental, health, and safety risks to its employees and the communities in which it operates by employing safe technologies and operating procedures.  SENA will be constantly prepared for emergencies.  SENA will continually inform its employees and public of its progress in safety and environmental issues.\n\nSENA is one of 26 Wisconsin paper companies voluntarily participating in the Wisconsin Paper Council's Pollution Prevention Partnership with the Wisconsin Department of Natural Resources.  As part of this membership, SENA produces an annual report that illustrates SENA and the Wisconsin paper industry's commitment to volun"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32993,
      "SummaryText": "tarily reduce the release of substances that could have adverse environmental impacts.  SENA's Pollution Prevention Partnership Progress Report is available to the public. \nSENA has also pledged to voluntarily align its corporate Environmental Management System to ISO 14001 international standards and to adhere to the American Forest and Paper Association's Environmental Health and Safety Principles.\n\n\nFACILITY DESCRIPTION AND THE REGULATED SUBSTANCES HANDLED\n\nSENA's parent company, Stora Enso Oyj, is domiciled in Finland. It is an integrated paper, packaging and forest products company producing publication and fine papers, packaging boards and wood products, areas in which the Group is a global market leader. Stora Enso's sales totalled EUR 12.2 billion in 2003, and has annual paper and board production capacity of about 15.7 million tonnes, and 7.4 million cubic meters of sawn wood products, including 2.8 million cubic meters of value-added products. Some 44,000 persons are employed in more than 40 countries in five continents. The company's shares are listed in Helsinki, New York and Stockholm.  \n\nStora Enso North America is a Division of Stora Enso Oyj. The Division is North America's leading producer of coated and supercalendered papers for the printing and publishing industries. In addition, Stora Enso North America is a premier producer of speciality papers, and manufactures coreboard products. The Division produces elemental chlorine-free kraft pulp, totally chlorine-free mechanical pulp and recycled pulp from printed, preconsumer and postconsumer scrap paper.  SENA has papermaking operations in Wisconsin Rapids, Stevens Point, Whiting, Kimberly, Niagara and Biron, Wisconsin; Duluth, Minnesota; and Port Hawkesbury, Nova Scotia, Canada.\n\nWQC is a wastewater treatment plant owned and operated by SENA in Wisconsin Rapids, Wisconsin.  This facility treats wastewater generated by the pulp and paper mill operations in the Wisconsin Rapids area.\n\nAmmonia (with a c"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32993,
      "SummaryText": "oncentration of 20% or greater) is the only chemical regulated by the RMP rule that is stored or handled at this facility with a concentration greater than or equal to the concentration de minimis level and a total quantity greater than or equal to the threshold quantity.  The aqueous ammonia is stored in a horizontal aboveground tank with a design capacity of 18,000 gallons.  The ammonia solution has a concentration of 29.4% by weight ammonia.  The maximum amount of ammonia in the solution is 37,883 lbs.  The tank is surrounded by a dike.  The dike is assumed to contain at least 25% of the tank's capacity.  The dike floor is sloped to a drain.  Aqueous ammonia is a toxic liquid and is used as a nutrient for the wastewater treatment plant micro-organisms.\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nAs part of its corporate environmental policy, SENA will continue to protect the environment and the health and well-being of fellow employees and communities by monitoring existing facilities to ensure that they meet all legal requirements through the use of safe technologies and operating procedures.\n\nWQC complies with the prevention and emergency response procedures from all applicable regulations.\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThere have been no accidents at the Water Quality Center in the past five years that resulted in any adverse onsite or offsite impacts.\n\n\nEMERGENCY RESPONSE PROGRAM \n\nSENA has a Corporate Spill Reporting Policy that addresses the notification requirements in the event of an accidental release.  The Corporate Spill Reporting Policy also identifies contacts and notification responsibilities. \n\nWQC has a written emergency response procedure to respond to accidental releases of hazardous substances. \n\n\nPLANNED CHANGES FOR SAFETY IMPROVEMENTS \n\nThis facility will undergo regular scheduled maintenance and update to meet any new or revised applicable regulation and industry standard to continue to operate saf"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32993,
      "SummaryText": "ely."
    }
  ]
}