{
  "FacilityID": 33006,
  "FacilityName": "MW Custom Papers, LLC",
  "FacilityStr1": "Eighth & Hickory Streets",
  "FacilityStr2": null,
  "FacilityCity": "Chillicothe",
  "FacilityState": "OH",
  "FacilityZipCode": "45601",
  "Facility4DigitZipExt": "0997",
  "FacilityCountyFIPS": "39141",
  "LEPC": "Ross County LEPC",
  "FacilityLatDecDegs": "39.326556",
  "FacilityLongDecDegs": "-082.974417",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.meadwestvaco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 4297875,
  "ParentCompanyName": "MeadWestvaco Corporation",
  "Company2Name": null,
  "CompanyDUNS": 102235004,
  "Company2DUNS": null,
  "OperatorName": "MW Custom Papers, LLC",
  "OperatorStr1": "401 South Paint Street",
  "OperatorStr2": null,
  "OperatorCity": "Chillicothe",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45601",
  "OperatorZipCodeExt": null,
  "FTE": 1759,
  "OtherEPAFacilityID": "OHD046428363",
  "EPAFacilityID": "100000084384",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "06-71-01-0028",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "None",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 39.325,
  "FRS_Long": -82.974444,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "4",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 47639,
      "AltID": "Chlorine Dioxide",
      "FacilityID": 33006,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 62789,
          "ProcessID": 47639,
          "ChemicalID": 71,
          "Quantity": 30000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 48712,
          "ProcessID": 47639,
          "NAICSCode": "32211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 27248,
              "Process_NAICS_ID": 48712,
              "SafetyReviewDate": "2002-03-02 00:00:00",
              "PHA_Date": "2003-04-07 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "General Question lists for human factors & facility siting",
              "PHACompletionDate": "2004-06-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "barometric loop back flow prevention",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "partial containment curb & process sewer/waste treatment system",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "personal and portable monitors/alarms",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-03-01 00:00:00",
              "TrainingReviewDate": "2004-06-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-12-01 00:00:00",
              "EquipmentInspectionDate": "2004-05-15 00:00:00",
              "EquipmentTested": "Chlorine Dioxide Generator, storage tanks, pumps, piping, Reboiler",
              "ChangeMgmtDate": "2004-05-21 00:00:00",
              "ChangeMgmtReviewDate": "2002-11-01 00:00:00",
              "PreStartupReviewDate": "2002-03-02 00:00:00",
              "ComplianceAuditDate": "2001-12-06 00:00:00",
              "AuditCompletionDate": "2002-04-01 00:00:00",
              "IncidentInvestigationDate": "2004-03-05 00:00:00",
              "InvestigationChangeDate": "2004-03-05 00:00:00",
              "ParticipationPlansReviewDate": "2001-11-29 00:00:00",
              "HotWorkPermitReviewDate": "2001-12-01 00:00:00",
              "ContractorSafetyReviewDate": "2004-05-01 00:00:00",
              "ContractorSafetyEvalDate": "2004-05-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 39670,
                  "PreventionProgram3ID": 27248,
                  "ProcessChemicalID": 62789
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 33006,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2001-06-01 00:00:00",
    "ERTrainingDate": "2004-02-12 00:00:00",
    "CoordinatingAgencyName": "Ross County LEPC",
    "CoordinatingAgencyPhone": "7402531097",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 33006,
      "SummaryText": "hese documents address (1) physical properties of hazardous substances handled at MW; (2) operating parameters of the equipment at MW; and (3) the technical and design bases, and configuration of the equipment.  MW ensures that this process safety information is available to all MW employees, the local emergency planning committee (LEPC), and the Chillicothe Fire Department.\n \nWhen important information was not available from the design documents, it was developed through special projects, or in the case of operating parameters, during process hazard analysis of the process.  Operating parameters are included in the standard operating procedures to enhance the safe operation of the process.  These documents are used in (1) employee training; (2) performing process hazard analyses; and (3) the monitoring and maintainence of equipment. \n\nMaterial safety data sheets (MSDS) document the physical properties of hazardous substances handled at MW, including regulated substances in covered processes.  MSDSs for hazardous substances handled in each process are available in the process control room so the operators have ready reference to this information.  In addition, MSDSs are provided to the LEPC and the fire department as required for use in developing emergency response plans.\n\nPROCESS HAZARD ANALYSIS\nIn accordance with the Process Safety Management Standard and to help identify process hazards and generate recommendations that might improve the safe operation of the process, MW conducts and recertifies process hazard analysis (PHA) of the regulated process.  PHA review teams composed of personnel with process-specific design, operating and maintainence experience, and a leader with process hazard analysis experience are assembled to analyze the hazards of each regulated process.  MW primarily uses a combination of the hazard and operability (HAZOP) methodology in conjunction with What if?/Checklist techniques to review and report the analysis.  Recommendations and acti"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 33006,
      "SummaryText": "MW CUSTOM PAPERS, LLC - EXECUTIVE SUMMARY\n\nMW Custom Papers, LLC (MW) is committed to operating in a manner that is safe for employees, the public, and the environment.  As part of that commitment, MW  has established management systems to maximize the safety of operating processes at this facility.  One component of this design is a risk management plan (RMP) that guides the safe handling, storage, and usage of regulated hazardous substances at MW and complies with the requirements of the Environmental Protection Agency's (EPA's) regulation 40 CFR part 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule).  \n\nOne of the requirements of the RMP rule is to submit a risk management plan (RMPlan) describing the risk management program at MW.  This document is intended to satisfy the RMPlan requirement of the RMP rule and to provide the public with a description of the risk management program at MW.\n\nThe risk management program at MW consists of three elements:\n\n1) Hazard assessments to analyze and understand (a) the potential for offsite consequences of hypothetical accidental releases and (b) accident and incident investigations that have occurred involving substances regulated by the RMP rule (regulated substances) - see Topics 1.3 and 1.5.\n\n2) Prevention programs to help maintain and safely operate those processes containing more than a threshold quantity of a regulated substance - see Topic 1.4.\n\n3) Emergency planning for public notification and response should an accidental release of a regulated substance from covered processes ever occur - see Topic 1.6.\n\nInformation further describing these elements is provided in this RMPlan.\n\nMW's risk management planning is designed to assure that the facility is maintained and operated in a safe manner.  However, it is only one component of the facility's safety program.  In fact, MW has a comprehensive safety program in place, which directs many levels of safeguards against release of haza"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 33006,
      "SummaryText": "rdous substances to prevent and mitigate injuries and damage from a hazardous substance release.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nMW's safety policies integrate many levels of personal, process, and environmental safety. However, this RMPlan is limited to address those elements of the safety program at MW that are required by the RMP Rule.\n\nMW limits the use of hazardous substances.  \nBefore using a hazardous substance at MW, less hazardous alternatives are considered.   When a hazardous substance must be used, MW thoroughly reviews the potential for this substance to adversely affect employees, the public, and the environment and manages its processes to prevent such effects.\n\nMW prevents releases of the hazardous substances used at the facility. \nMW is committed to the safety of employees, the public, the preservation of the environment, and  the prevention of accidental releases of hazardous substances.  When a hazardous substance is used at MW, the equipment is carefully designed, built, and operated to reduce the likelihood of an accidental release.  In conjunction with best engineering practices, government and industry standards are closely adhered to in the design, construction, and operation of the equipment. \n\nCHEMICAL-SPECIFIC PREVENTION STEPS\nMW follows industry standards (e.g., Department of Transportation [DOT]), National Fire Protection Association [NFPA], The Chlorine Institute, and manufacturers' guidelines) to maximize the safe handling, storage, and usage of all hazardous materials.  For the Chlorine Dioxide process, Process Hazard Analyses (PHAs) are conducted in accordance with the requirements specified by OSHA's Process Safety Management Standard.\n\nMW implements reasonable controls to prevent foreseeable releases of hazardous substances.  If such a release should occur, MW shall also make every attempt to limit damages.  In the event of a significant accidental release, MW maintains a trained and certified hazardo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 33006,
      "SummaryText": "us chemical emergency response program and would evacuate employees and contact local emergency response agencies (LEPC) as necessary to control, contain, and prevent/reduce the consequences of the release.  MW and local emergency response agencies (through the Chillicothe City Fire Department) have established a process to alert the community in the event an offsite consequence exists.\n\nMW Custom Papers, LLC and Regulated Substances\nMW is an integrated paper products company primarily involved in the manufacture of pulp and paper from both hard and softwoods.  MW handles one regulated toxic (no flammable) substance in sufficient quantities to be covered by the RMP rule.\n\nAs part of the manufacturing process at this facility, Chlorine Dioxide is used as a stock bleaching agent in the Pulp Mill and is inventoried at quantities above the EPA threshold limit and is regulated by the RMP rule.  This system is regulated and compliance managed in accordance with OSHA's Process Safety Management Standard.  As such, it is designated as Program Level 3 process for RMP rule compliance purposes.\n\nRegulated Process                Program Level               Substance                                 Quantity\nChlorine Dioxide Storage                3                       Chlorine Dioxide                            18,000 lb\n\nOFFSITE CONSEQUENCE ANALYSES\nMW has performed offsite consequence analyses to estimate the potential for an accidental release of a regulated substance to affect the public or the environment.  The offsite consequence analyses consists of evaluating both worst-case release scenarios and alternative release scenarios.  MW does not expect a worst-case release scenario to ever occur.  The alternative release scenario was selected to aid local emergency planning committee in improving the community emergency response plan.  An alternative release scenario represents a release that (1) might occur at a facility like MW, and (2) would result in the greatest potenti"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 33006,
      "SummaryText": "al offsite consequences if the release occurred.\n\nThe primary objective of performing the offsite consequence analyses is to determine the distance at which certain effects might occur to the public because of an accidental release (called the endpoint distance).  When considering the release of a toxic substance, it is expected that people at the endpoint distance would experience little or no exposure, with no long-term health consequences.  However, the potential for some short-term consequences (e.g., strong eye irritation, or throat irritation), while not likely, does exist.  Some people who are particularly susceptible to the substance released could be incapacitated.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\nMW maintains a number of programs to help prevent accidental releases and ensure safe operation.  The accident prevention programs in place at MW include:\n\nProgram 3 Prevention Program.\nSince 1963, MW has used a prevention program to help prevent accidental releases of hazardous substances.  Beginning in 1992, MW formalized this prevention program for the Chlorine Dioxide Generation and Storage processes to comply with the 14 elements of the OSHA process safety management (PSM) prevention program.  In 1996, in accordance with the EPA RMP rule, one Program 3 proccess was identified.  RMP requirements for this system is essentially the same as OSHA PSM, except that the program also focuses on protecting the public and the environment.  The following sections briefly describe the elements of MW's prevention program that address the RMP rule prevention program and ERP requirements.\n\nMW's Prevention Program for the RMP Program 3 Chlorine Dioxide Generation and Storage process consists of the following 12 elements:\n\nPROCESS SAFETY INFORMATION\nMW maintains a variety of technical documents (e.g., MSDSs, PSM Process Safety information manuals, etc.) that support the safe operation of its processes.  For each regulated process, t"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 33006,
      "SummaryText": "on items resulting from the analysis are documented and tracked to completion.  Responsibility to resolve action items are assigned to unit personnel, and where appropriate, changes to enhance the safety of the process are implemented.\n\nOPERATING PROCEDURES\nMW process safety personnel, engineers, operators, and supervisors work together to develop and maintain operating procedures to define how tasks related to regulated process operations should be safely performed.  The operating procedures (1) are used to train employees and (2) serve as reference guides for appropriate actions to take during both normal operations and process upsets.\n\nTRAINING\nMW provides basic chemical specific HAZCOM training for all employees.  MW trains employees to safely and effectively perform their assigned tasks.  For current hazardous process operations personnel, MW training programs include both initial and refresher training that cover (1) general overview of the process; (2) the properties and hazards of the substances in the process; and (3) a detailed review of the process operating procedures and safe work practices.  Both oral reviews and written tests are used to verify that an employee understands the appropriate level of training prior to working in, on, or around a regulated process.\n\nMECHANICAL INTEGRITY\nMW maintains the mechanical integrity of regulated process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  The MW mechanical integrity program includes (1) an inspection and testing program to help identify equipment deterioration and damage before the equipment fails; and (2) a quality assurance program to help ensure that new and replacement equipment meet the design standards required for each specific process service.  \n\nMANAGEMENT OF CHANGE\nThe MW management of change program evaluates and approves all proposed not-in-kind changes to regulated process chemicals, equipment, and procedures to help ensure that th"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 33006,
      "SummaryText": "e change does not negatively affect safe operations.  For regulated processes, all not-in-kind, non-emergency changes must have prior review and qualified approval before the change can be implemented.  This is to prevent inadvertent consequences of a process change, and to ensure any potential hazards created by the change are proactively recognized and addressed; affected process safety information and procedures are updated; and affected employees are notified of the changes.\n\nPRE-STARTUP REVIEW\nMW performs a safety review of a new or modified process before the process is placed into service to help ensure that the process has been prepared to operate safely.  This review confirms that: \n- Construction and equipment are in accordance with design specifications; \n- Adequate safety, operating, maintenance, and emergency procedures are in place; and\n- Employee training has been completed.\n\nCOMPLIANCE AUDIT\nMW audits regulated processes to be certain that the MW prevention program is effectively addressing the safety issues of its operations.  MW maintains a cross-corporate audit team that includes personnel knowledgeable in PSM, the RMP rule, and in the regulated processes.  This team evaluates whether the prevention program satisfies the requirements of the PSM and RMP standards as well as Corporate health, safety, and environmental policies; and whether or not the prevention program is sufficient to help ensure safe operation of the process.  The findings and recommendations of these audits are documented.  The audit recommendations are the basis for the development and implementation of resolvable action items.\n\nINCIDENT INVESTIGATION\nMW investigates all incidents that could reasonably have resulted in a serious consequence to personnel, the public, or the environment so that similar accidents can be prevented.  MW trains employees to identify and report any incident requiring investigation.  A qualified investigation team will initiate an investigation within 4"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 33006,
      "SummaryText": "8 hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\n\nEMPLOYEE PARTICIPATION \nMW has a written employee participation program for covered processes to help ensure that the safety concerns of MW workers are addressed.  MW encourages active participation of personnel in the prevention program activities of all processes at the facility.  Employees are consulted on and informed about all aspects of the RMP rule prevention program, including PHAs and operating procedures.\n\nSAFE WORK PRACTICES\nCompliance with documented standard safe work practices, including hot work safety, confined space entry, and zero energy potential policies are required operating and maintenance procedures.\n\nHOT WORK PERMITS\nMW has an established hot work management system to control spark and flame-producing activities that could result in fires or explosions in covered processes at the MW facility.  In accordance with OSHA's fire prevention and protection requirements in 29 CFR 1910.252(a), MW implemented a Hot Work Permit Process.  Personnel preparing to perform hot work are required to conduct a pre-work inspection of the area and complete a Hot Work Permit Form.  A MW Area Supervisor (in the work area), must review and approve the completed form before the hot work can begin.  Training in the use of the Hot Work Permit Form is included in the MW safe work practices orientation.\n\nCONTRACTORS  \nMW has a management system in place to help ensure that contractor activities at the MW facility are performed in a safe manner.  The program reviews the safety record of all contractors to help ensure that MW hires only those contractors who can safely perform the desired job tasks.  MW instructs contract supervisors as to the hazards of the process on which they and their employees will work, all MW safe work practices, and MW emergency response procedures.  MW requires that the contractor supervi"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 33006,
      "SummaryText": "sors train each of their employees who will work at MW, before that worker begins work at the facility.  MW periodically reviews contractor's training documents and audits work performance to help ensure safe practices are followed. \n\nCHEMICAL-SPECIFIC PREVENTION STEPS\nIn addition to the required prevention program elements, MW has implemented safety features specific to regulated hazardous substance used at the facility.  The following paragraphs describe some of these safety features.\n\nChlorine Dioxide - To avoid the necessity of transporting large quantities of a hazardous material, MW produces Chlorine Dioxide at the facility and stores it as a dilute aqueous solution.  Chlorine Dioxide is generated on-site using the R8 process in the Chlorine Dioxide generator and piped to an absorber column, where a 1wt% Chlorine Dioxide solution is generated.  A diked area around the storage tank further reduces the consequences of a release.\n\nFIVE-YEAR ACCIDENT HISTORY\nThere has been no accidental releases in the past five years at MW. \n\nEMERGENCY RESPONSE PROGRAMS\nMW's personnel and procedures are prepared to coordinate the activities of the facility and maintain an emergency response team trained in emergency response procedures.  MW periodically conducts emergency response drills, including annual drills coordinated with the local fire department, the first-response emergency team, the Corporate Crisis Management Team, and local emergency response agencies.  MW employees will respond to minor events that do not have the potential for significant effects (e.g., small fires or small leaks).  In the event of a larger fire or release, employees will be evacuated from the area, the MW Emergency Response Team will be responsible for initial response and assessment, and contact with the Chillicothe City Fire Department as necessary.  All MW personnel are trained in evacuation procedures.\n \nMW has established a written emergency response program to help safely respond to accident"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 33006,
      "SummaryText": "al releases of hazardous substances.  The emergency response plan includes procedures for:\n- Informing the local fire department and the public about accidental releases that could reasonably result in offsite consequences;\n- Providing proper first aid and emergency medical treatment to treat accidental human exposure to hazardous substances at MW; \n- Controlling and containing accidental releases of hazardous substances, including the use of emergency response equipment;\n- Inspecting and maintaining emergency response equipment; and\n- Reviewing and updating the emergency response plan.\n\nThe written emergency response plan complies with other federal contingency plan regulations (e.g., the emergency response officials through the local fire department).  MW provides appropriate information to and regularly communicates with the Local Emergency Planning Committee and Chillicothe and Ross County fire chiefs.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nMW constantly strives to improve the safety of these regulated processes.  Through the PSM PHA and Audit programs, incident investigation action items, and ongoing employee participation in all safety programs, the planning and implementation of changes to reduce risk and improve safety is a continuous process.\n\nMW has reviewed (PHA conducted 04/07/2003) the Chlorine Dioxide handling system, upgraded all handling and operating procedures, increased the inspection frequency for chlorine dioxide equipment, and took steps to decrease the traffic near chlorine dioxide equipment.\n\nThese changes reduce the likelihood of a Chlorine Dioxide release caused by degraded equipment or external impact."
    }
  ]
}