{
  "FacilityID": 33077,
  "FacilityName": "Kinston Regional Water Reclamation Facility",
  "FacilityStr1": "2131 Becton Farm Road",
  "FacilityStr2": null,
  "FacilityCity": "Kinston",
  "FacilityState": "NC",
  "FacilityZipCode": "28502",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37107",
  "LEPC": "Lenoir County LEPC",
  "FacilityLatDecDegs": "35.288611",
  "FacilityLongDecDegs": "-077.511944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Kinston",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Kinston",
  "OperatorStr1": "P. O. Drawer 339",
  "OperatorStr2": null,
  "OperatorCity": "Kinston",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28502",
  "OperatorZipCodeExt": "0339",
  "RMPContact": "Scott Stevens",
  "RMPTitle": "Director of Public Services",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000006478",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-08-09 00:00:00",
  "DeRegistrationEffectiveDate": "2011-08-01 00:00:00",
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 35.29111,
  "FRS_Long": -77.5,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 47733,
      "AltID": "Wastewater Treatment",
      "FacilityID": 33077,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 48808,
          "ProcessID": 47733,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 62898,
          "ProcessID": 47733,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 562898,
          "ProcessID": 47733,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 33077,
      "SummaryText": "City of Kinston\nRMP Executive Summary -2004\n\n\nThe City has implemented a comprehensive program to safely manage chlorine at its wastewater treatment plants located in or adjacent to the City. There have been no chlorine incidents in the most recent five-year history period.\n\nIn 1997 and 1998, a Process Safety Management (PSM) program was initiated at the Plants. A PSM Implementation Manual was edited to be site specific for each Wastewater Plant. The Manual was issued to the plants. In 1999 the Manual was expanded to address the EPA Risk Management Program (RMP).\n\nKey items included in the updated manual are:\n\no    A written Management Program defining the positions and individuals responsible for implementing the RMP and PSM regulations\n\no    Written site specific procedures for Employee Involvement, Management of Change, Incident Investigation, Pre-Startup Reviews and Self Audits\n\no    Chlorine safety information as required by the regulations\n\no    Standard Operating Procedures for safe Chlorine Management\n\no    A Mechanical Integrity Program for chlorine equipment \n\no    An Emergency Response Plan to address chlorine emergencies and offsite response and communication\n\nNext, these steps have been continually implemented to maintain compliance with the PMP/PSM program.\n\no    Training on RMP/PSM and its key components including Management of Change, Mechanical Integrity and Incident Investigation;\n\no    Conducting periodically Process Hazards Analyses for the two chlorine processes;\n\no    Implementing the Mechanical Integrity Program for chlorine regulators, controls and material handling equipments such as cranes\n\no    Conducting Self Audits to review compliance with the elements of RMP and PSM\n\no    Conducting periodic Chlorine Response Drills.\n\no    Performing an annual review of our Chlorine Operating Procedures\nIn addition to PSM compliance, the plants have implemented a number of programs to improve the safe handling of chlorine and other chemicals\n\n- The chlorine delivery systems at the plants"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 33077,
      "SummaryText": " have been upgraded to vacuum processes over the past 10 years. This process has proven to greatly reduce leaks by reducing the amount of equipment that is exposed to pressurized chlorine. \n\n- In January 1999, an automatic switchover system was installed on the chlorine cylinders at both plants. This system is designed to automatically switch from an empty to a full chlorine cylinder. This process avoids the need for an operator to manually change the cylinders at anytime, day or night.\n\n- In January 1999, chlorine leak detectors were installed at the chlorine facilities at both plants. This equipment will detect any chlorine leak allowing operators to initiate emergency response\n\nThe city safety coordinator, plant superintendent, chief operator and several plant operators are meeting several times per year to review and update procedures and to maintain compliance with all aspects of the RMP/PSM regulation.\n\nThe Emergency Response Plans (ERP) for the two wastewater treatment plant have been significantly upgraded. In 1997, the ERP were revised to include offsite response and communication. The County LEPC and other local response organizations have been incorporated into the ERP. Where necessary, communication plans have been developed to notify businesses or residences that may be impacted by a release. As noted above periodic emergency response drills are being conducted.\n\nIn addition to RMP and PSM, the organization has an active safety program. The City has an active Safety Committee. The committee meets monthly and its duties include reviewing new safety procedures, accident investigations, safety surveys and safety communications. The Safety and Risk Manager for the City also takes an active role in supporting the Public Services Safety Program. \n\nWithin the Public Services department, there are monthly safety meetings to review an OSHA subject or discuss a safety issue. Routine training is conducted for topics such as:\n\n- Hazard Communications\n\n- Personal Pr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 33077,
      "SummaryText": "otective Equipment\n\n- Lockout/Tagout\n\n- Confined Space\n\nAs a result of our programs, the plants have had an excellent safety record with few recordable injuries over the past three years. As mentioned earlier, there have no reportable chlorine releases from the plants in the last five years.  The city has worked extensively to upgrade its safety program. We plan to continue our emphasis on safety to maintain and improve our safety performance.\n\nReport by:\n                                                               \nDirector of Public Services"
    }
  ]
}