{
  "FacilityID": 33126,
  "FacilityName": "Little River Wastewater Treatment Plant",
  "FacilityStr1": "300 Commission Drive",
  "FacilityStr2": null,
  "FacilityCity": "Laurens",
  "FacilityState": "SC",
  "FacilityZipCode": "29360",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45059",
  "LEPC": "Laurens County EPA",
  "FacilityLatDecDegs": "34.485139",
  "FacilityLongDecDegs": "-082.000333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "AB",
  "FacilityURL": "http://www.lcpw.com",
  "FacilityEmailAddress": "feedback@lcpw.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Commission of Public Works",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Commission of Public Works",
  "OperatorStr1": "P O Box 349",
  "OperatorStr2": "212 Church Street",
  "OperatorCity": "Laurens",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29360",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dennis M. Satterfield",
  "RMPTitle": "Water & Sewer Superintendent",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000023994",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-05-26 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 34.48444,
  "FRS_Long": -81.99889,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 47801,
      "AltID": "Chlorine",
      "FacilityID": 33126,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 48877,
          "ProcessID": 47801,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 63147,
          "ProcessID": 47801,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 563147,
          "ProcessID": 47801,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 33126,
      "SummaryText": "SECTION ONE\n\n\n\nINTRODUCTION\n1.1 Executive Summary\n\nThe Federal Register/Vol.61, No. 120/Thursday, June 20, 1996 amended 40 CFR Part 68 to include the U.S. Environmental Protection Agency's (USEPA) Risk Management Program. This program requires facilities that have a regulated substance above the listed threshold quantities to develop a formal Risk Management Program (RMProgram) and to register and submit a Risk Management Plan (RMPlan).\n\nThe Commission of Public Works - Laurens, South Carolina (the Commission) is subject to this regulation as the owner and operator of the Little River Waste Water Treatment Plant (WWTP) located on Commission Drive, Laurens, Laurens County, South Carolina.  This facility is a stationary source of chlorine (a regulated substance) in excess of 2,500 pounds.\n\nA RMProgram has been developed to meet the intent of the regulations for this facility using Program 3. Information from the Federal Register, AWWA's Compliance Guidance and Model Risk Management Program for Water Treatment Plants, and EPA's Risk Management Program Guidance For Wastewater Treatment Plants (40 CFR Part 68) were used as resources for the development of this program.\n\nThe Little River WWTP uses chlorine in its wastewater treatment process to disinfect the treated wastewater before being discharged into the Little River.  The chlorination process includes the storage of up to two (2) 1-ton cylinders of liquid/gaseous chlorine.  The process is located within a closed building utilizing a vacuum feed system, instrumentation, process specific piping and connection materials.\n\nA hazard assessment was conducted at the facility to determine the past history of accidents or releases of chlorine.  Plant records and interviews with current plant personnel indicated there have been no releases of chlorine in the last five years that resulted in injury, death or property damage. \n\nIn compliance with the regulations, a worst-case release scenario was modeled using the EPA RMPComp d"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 33126,
      "SummaryText": "ispersion model to determine the potential impact of such a release.  The worst-case scenario assumes that a one 1-ton container releases 2,000 pounds of gaseous chlorine over a 10-minute period.  The model predicted that an area within a 3.0 - mile radius of the plant could be adversely affected by such a release.  This area would include public receptors such as schools, hospitals, churches and places of business.\n\nAn alternative-case scenario was also modeled using RMPComp to model the effects of a more probable release.  This scenario involved a valve failure resulting in the release of gaseous chlorine through a 5/16\" diameter opening over a 60-minute period in a closed building.  This simulation results in the release of 424 pounds of chlorine gas to the atmosphere.  RMPComp predicted that areas located within a 0.2- mile radius of the release point could be adversely impacted. \n\n1.2 Overview of EPA Risk Management Regulations\n\nThe EPA Risk Management Program regulations are intended to minimize the potential impacts of accidental releases of extremely hazardous substances. These regulations are applicable to the Little River WWTP because chlorine stored at the facility is in excess of the EPA RMP Threshold amount of 2,500 pounds.\nThe Little River WWTP RMProgram complies with the intent of the EPA regulations by providing information to the utility employees, local emergency preparedness officials, and the affected public to minimize health and safety impacts. The program consists of:\n\na. A management plan.\nb. An employee participation plan.\nc. A hazard assessment.\nd. A prevention program (Program 3).\ne. An emergency response plan.\nf. Public Awareness, and \ng. RMPlan submittal to EPA\n\nThe related Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) rules (29 CFR 1910.119) require comprehensive management systems for the handling of these highly hazardous chemicals. South Carolina has it's own OSHA plan; therefore, the Little Riv"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 33126,
      "SummaryText": "er WWTP is subject to this regulation.\n\n1.3 Goals and Objectives\n\nThe mission of the Little River WWTP is to maintain public health by providing an adequate supply of safe drinking water, free of disease producing organisms and other health related contaminants.  This process involves the addition of certain chemicals that, if released in an uncontrolled manner, may present a risk to public health.  While such incidents are rare, they have occurred at other similar facilities.  Based on a review of the EPA Accidental Release Information (ARIP) database, over 60 accidental releases of RMP regulated chemicals at water and wastewater treatment facilities in the USA were reported between 1986-1995.\n\nState-of-the-art methods for reducing risks associated with utilizing highly mobile toxic chemicals, such as chlorine, have evolved in recent years.  The newer risk management techniques consist of a comprehensive management system designed to promote responsible and disciplined operation, maintenance, and emergency response.\n\nThe overall goal in developing and maintaining the Little River WWTP RMProgram is to reduce the risk to employees and the public of injury or death from the accidental release of chlorine liquid or gas.  The RMProgram is not a substitute for other conventional health and safety programs.\n\nThis document will require periodic updates and modifications.  Changes in key personnel, chlorine vendors and modifications to the treatment process are among the items that require Plan modifications.  Specific items and their respective timetables for Plan modification are included herein.  \n\nSeveral elements of the Risk Management Program directly or indirectly reference plans and procedures contained within other pre-existing documents (i.e. O&M manuals, Process Safety Management Plan, general safety guidelines, etc.).  This document provides a system for incorporating those items performed under separate unrelated plans into the Program.  Documentation of work c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 33126,
      "SummaryText": "ompleted under other programs and procedures is required in order to remain in compliance with the RMP regulations. \n\n A thorough review of the Plan is required for proper implementation."
    }
  ]
}