{
  "FacilityID": 33246,
  "FacilityName": "Geneva Nitrogen LLC",
  "FacilityStr1": "1165 North 1600 West",
  "FacilityStr2": null,
  "FacilityCity": "Orem",
  "FacilityState": "UT",
  "FacilityZipCode": "84057",
  "Facility4DigitZipExt": "2812",
  "FacilityCountyFIPS": "49049",
  "LEPC": "Utah County LEPC",
  "FacilityLatDecDegs": "40.320980",
  "FacilityLongDecDegs": "-111.737733",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3587354,
  "ParentCompanyName": "n/a",
  "Company2Name": "n/a",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Steven R Thompson",
  "OperatorStr1": "1165 North 1600 West",
  "OperatorStr2": null,
  "OperatorCity": "Orem",
  "OperatorStateFIPS": "UT",
  "OperatorZipCode": "84057",
  "OperatorZipCodeExt": "2812",
  "FTE": 31,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000099902",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "DAQE-0688-92",
  "SafetyInspectionDate": "2004-05-24 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-19 00:00:00",
  "ErrorReportDate": "2004-07-19 00:00:00",
  "ReceiptDate": "2004-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-15 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": "2017-08-29 00:00:00",
  "DeRegistrationEffectiveDate": "2017-02-28 00:00:00",
  "AnniversaryDate": "2009-06-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 40.3183,
  "FRS_Long": -111.735,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 47971,
      "AltID": "Anhydrous Ammonia Storage",
      "FacilityID": 33246,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 63335,
          "ProcessID": 47971,
          "ChemicalID": 56,
          "Quantity": 8558812.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 49050,
          "ProcessID": 47971,
          "NAICSCode": "325311",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 27463,
              "Process_NAICS_ID": 49050,
              "SafetyReviewDate": "2004-04-30 00:00:00",
              "PHA_Date": "2005-04-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-04-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Water Cannons",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Video Camera",
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-03-30 00:00:00",
              "TrainingReviewDate": "2004-02-27 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-06-10 00:00:00",
              "EquipmentInspectionDate": "2004-03-14 00:00:00",
              "EquipmentTested": "Ammonia Transfer Pump",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2003-01-23 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2003-01-23 00:00:00",
              "AuditCompletionDate": "2003-12-31 00:00:00",
              "IncidentInvestigationDate": "1998-09-25 00:00:00",
              "InvestigationChangeDate": "1998-12-01 00:00:00",
              "ParticipationPlansReviewDate": "2003-01-23 00:00:00",
              "HotWorkPermitReviewDate": "2003-03-10 00:00:00",
              "ContractorSafetyReviewDate": "2003-01-23 00:00:00",
              "ContractorSafetyEvalDate": "2003-03-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 40082,
                  "PreventionProgram3ID": 27463,
                  "ProcessChemicalID": 63335
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 33246,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-04-29 00:00:00",
    "ERTrainingDate": "2003-09-09 00:00:00",
    "CoordinatingAgencyName": "Utah County Emergency Coordinator",
    "CoordinatingAgencyPhone": "8013708800",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 33246,
      "SummaryText": "EXECUTIVE SUMMARY FOR GENEVA NITROGEN LLC\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nWe at Geneva Nitrogen LLC are strongly committed to employee, public and environmental safety. Our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance demonstrates this commitment, and employee training associated with the processes at our facility. It is our policy to implement approprate controls to prevent possible releases of regulated substances.\n\nWe also have a thorough emergency response plan in place in which our employees and local responders are familiar with through periodic training. Should a release occur that requires emergency response, the Utah County Emergency Coordinator and Orem Fire Department stand to work with us to implemtent this plan and provide highly trained emergency response personnel to control and midigate the effects of the release.\n\nTHE STATIONARY SOURCE AND THE REGULATED SUBSTANCES HANDLED\nOur facility's primary activities encompass Manufacturing of Nitric Acid and Ammonium Nitrate. We have 2 regulated substances present at our facility. These substances include Ammonia (anhydrous) and Nitric Oxide [Nitrogen oxide (NO)]. Ammonia (anhydrous) is used to manufature both Nitric Acid (<80 percent) and Ammonium Nitrate. Nitric oxide is used to manufacture Nitric Acid (<80 percent).\n\nThe maximum inventory of Ammonia (anhydrous) at our facility is 8,561,724 lbs (4,281 tons) while Nitric oxide [Nitrogen oxide (NO)] is present at our facility in a maximum quantity of 9 lbs.\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE CHEMICAL-SPECIFIC PREVENTION STEPS\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 58 of the EPA. This facility was designed and constructed in accordance with the United States Steel Corporation Design Codes. The following sections briefly descr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 33246,
      "SummaryText": "ibe the elements of the release prevention program that is in place at our stationary source for the Program 3 processes at our plant: the Anhydrous Ammonia Storage and Transfer Process.\n\nProcess Safety Information\nGeneva Nitrogen LLC maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently. The methodology used to carry out these analyses is Hazardous and Operability Study (HAZOP). The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of 5 years. Any findings related to the hazard analysis are addressed in a timely manner. The most recent PHA/update was preformed on 03/31/2004.\n\nOperating Procedures\nFor the purposes of safety conducting activities within our covered processes, Geneva Nitrogen LLC maintains written operating procedures. These procedures address various modes of operation such as intial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround. The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nGeneva Nitrogen LLC has a comprehensive training program in place to ensure the employees who are operating processes are competent in the operating procedures associated with the processes. Refresher training is provided at least every three (3) years and more frequently as needed.\n\nMechanical Integrity\nGeneva Nitrogen LLC carries out highly documented maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks includes among others: pressure vessels, storage tanks, piping systems, relief and vent systems"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 33246,
      "SummaryText": ", emergency shutdown systems, controls and pumps. Qualified personnel carry out maintenance operations with previous training in maintenance practices. Futhermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenace checks are corrected in a safe manner.\n\nManagement of Change\nWritten procedures are in place at Geneva Nitrogen LLC to manage changes in process chemicals, technology, equipment and procedures. The most recent review/revision of maintenance procedures was perforemed on 06/10/2003. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-startup safety reviews (PSSR) related to new processes and to to modifications in established processes are conducted as a regular practice at Geneva Nitrogen LLC. A PSSR for Geneva's covered process has not been conducted because the process has not been significantly modified since design. Any PSSR's conducted would confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nGeneva Nitrogen LLC conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. The most recent compliance audit was conducted on 01/23/2003. These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nAccident Investigation\nGeneva Nitrogen LLC promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring. All reports a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 33246,
      "SummaryText": "re retained for a minimum of 5 years.\n\nEmployee Participation\nGeneva Nitrogen LLC truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encuraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasions, Geneva Nitrogen LLC hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a through evaluation of safety performance of the contractor is carried out. Geneva Nitrogen LLC has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\nFIVE-YEAR ACCIDENT HISTORY\nGeneva Nitrogen LLC has had an excellent record of preventing accidental releases over the last 5 years. Due to our stringent release prevention policies, the number of accidental releases has been reduced to a minmum. In the last RMP rule, an accidental release is defined as one that resulted in death, injuries, significant property damage, evacuations, shelter-in-place, or environmental damage.\n\nEMERGENCY RESPONSE PLAN\nGeneva Nitrogen LLC carries a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notificaton of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced. The plan is promptly updated to reflect any pertinent chang"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 33246,
      "SummaryText": "es taking place within our processes that would require a modified emergency response. In addition, we conduct periodic emergency response drills to keep our employees and local responders familiar with the plan.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nseveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program. Installation of Ammonia detection sensors will improve the safety at our facility. We are constantly working to improve our Environmental Health and Safety performance."
    }
  ]
}