{
  "FacilityID": 33332,
  "FacilityName": "Donald K. Shine Water Treatment Plant",
  "FacilityStr1": "16700 New Holland",
  "FacilityStr2": null,
  "FacilityCity": "Holland",
  "FacilityState": "MI",
  "FacilityZipCode": "49424",
  "Facility4DigitZipExt": "5554",
  "FacilityCountyFIPS": "26139",
  "LEPC": "Ottawa County LEPC",
  "FacilityLatDecDegs": "42.854444",
  "FacilityLongDecDegs": "-086.209722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "http://172.16.1.11",
  "FacilityEmailAddress": "mikeaverill@ci.wyoming.mi.us",
  "FacilityDUNS": 79283982,
  "ParentCompanyName": "City of Wyoming, Michigan",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Gerald Caron",
  "OperatorStr1": "16700 New Holland",
  "OperatorStr2": null,
  "OperatorCity": "Holland",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49424",
  "OperatorZipCodeExt": "5554",
  "FTE": 26,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000126295",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-12-29 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-09-30 00:00:00",
  "DeRegistrationEffectiveDate": "2009-09-04 00:00:00",
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 42.85559,
  "FRS_Long": -86.19419,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 48085,
      "AltID": null,
      "FacilityID": 33332,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 63482,
          "ProcessID": 48085,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 49179,
          "ProcessID": 48085,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 27528,
              "Process_NAICS_ID": 49179,
              "SafetyReviewDate": "2004-06-16 00:00:00",
              "PHA_Date": "2003-12-01 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-01-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "vacuum delivery system",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-06-01 00:00:00",
              "TrainingReviewDate": "2003-04-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Hazmat exercises",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-04-01 00:00:00",
              "EquipmentInspectionDate": "2004-03-01 00:00:00",
              "EquipmentTested": "Chlorine hoist",
              "ChangeMgmtDate": "2004-03-01 00:00:00",
              "ChangeMgmtReviewDate": "2003-12-01 00:00:00",
              "PreStartupReviewDate": "2003-12-01 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-12-01 00:00:00",
              "HotWorkPermitReviewDate": "2003-12-01 00:00:00",
              "ContractorSafetyReviewDate": "2003-12-01 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Vacuum regulators are installed on effluent valve for each tank. Piping from this point on is under vacuum instead of pressure from the storage cylinder. If failure of the piping occurs then the vacuum regulator shuts off the flow of product and outside air is drawn into the pipe. The cylinder is isolated from the failure by the regulator, which allows no chlorine to evacuate into the room. Alarms for high or low vacuum are transmitted to an alarm panel, located in the control room, which is manned 24 hours/ day. This replaced a system, which required all the chlorine piping within the process to be under pressure and in the case of a failure a manual shutdown was required.",
              "_chemicals": [
                {
                  "PrimaryKey": 40158,
                  "PreventionProgram3ID": 27528,
                  "ProcessChemicalID": 63482
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 33332,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Ottawa County LEPC",
    "CoordinatingAgencyPhone": "6167384050",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 33332,
      "SummaryText": "Executive Summary\n\nA. FACILITY DESCRIPTION AND NATURE OF REGULATED SUBSTANCES HANDLED\n\nThe primary business of this facility is the treatment of potable drinking water for a resident population of approximately 200,000 persons.    This activity requires the use of chlorine gas as a disinfection agent.  Chlorine, in the form of a liquid under pressure, is delivered to the facility via truck.  The chlorine is stored in one-ton steel cylinders, with 24 cylinders being the maximum number on site at one time.  Chlorine is distributed by piping through a vacuum regulator system to the second floor chlorinator room.  Using chlorinators attached to water injectors the gas is injected under vacuum into a water solution and fed at various points throughout the facilty. \n\nB. ACCIDENTAL RELEASE AND EMERGENCY RESPONSE POLICIES \n\nIt is the general policy of the City of Wyoming Water Treatment Plant to take all precautions and preventative measures necessary to ensure against unplanned releases of any hazardous substances that might prove harmful, either to plant employees, or to persons in the vicinity of the plant facility.  There are numerous structural and administrative safeguards in place, which are intended to prevent hazardous material releases.  Structural elements and mechanical systems are subject to a rigorous inspection and preventative maintenance program to insure proper operating capabilities.  Plant personnel receive extensive training concerning safe handling procedures for the chemicals they utilize in their work, as well as specialized training concerning procedures to follow in the event of an unexpected release of hazardous materials.\n\nIn addition to safety policies unique to the Water Treatment Plant, this facility is also subject to numerous safety policies and guidelines applicable to departments of the City of Wyoming in general.  The general safety program policy for the City states; \" Procedures shall be in accordance with the approved practices incorpo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 33332,
      "SummaryText": "rated in the rules and regulations of the State of Michigan, Department of Labor, Bureau of Safety and Regulation and National Safety Council \".  Compliance with this edict is enforced via implementation of an active City safety program, administered by staff of the Human Resourse Department.\n\nC. MEASURES FOR PREVENTING ACCIDENTAL RELEASES OF HAZARDOUS MATERIALS\n\nThe City of Wyoming Water Treatment Plant is subject to two major regulatory programs, which address the prevention of accidents and injuries from hazardous chemical releases.  The first of these is the Process Safety Management Program (PSM), conducted under authority of the MIOSHA General Industry Rule 91.  The PSM program requires comprehensive assessment and analysis of all chlorine related processes, with the objective of ensuring that all systems are capable of functioning in a safe manner at all times.  The second of these programs, the Hazardous Waste Operations and Emergency Response Program (HAZWOPER) is conducted under authority of the MIOHSA Occupational Health Rules 325.52101 - 52137.  The HAZWOPER Program requires development of a detailed plan outlining all steps, which will be undertaken in the event of a hazardous materials release and, which personnel will be responsible for various actions.  A formal HAZWOPER Plan is currently in effect at the facility, and regular training and test exercises of the plan are conducted by facility staff.\n\nThere are a variety of structural and mechanical safeguards at the facility, which are designed to prevent the release of hazardous materials, and to mitigate the effects of any release that might occur.  Security of the facility is enhanced by perimeter fencing and installation of a security survellance system of the exterior areas of the premises.  A chlorine gas detection system is in place to provide instant warning of any unexpected chlorine release.\n\nD. EMERGENCY RESPONSE PREPARATIONS\n\nBecause of the quantity of chlorine handled by this facility, it"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 33332,
      "SummaryText": " is subject to regulation under authority of Title III of the Superfund Amendments Reauthorization Act, also referred to as the \"Emeregency Preparedness-Community Right-To-Know Act\".  This law requires that the facility, working in cooperation with local governmental agencies and officials, must establish a formal plan for responding to off-site chemical emergency incidents.  The facility has established such an emergency plan, the most current edition of which is dated July 1996.  The plan outlines the nature and quantity of hazardous products stored and used at the facility, the projected areas around the facility, which would be impacted in the event of a release and protective actions that should be taken by public safety officials to ensure the safety of persons within the affected areas.  The plan also contains detailed information regarding emergency contacts that are to be made in the event of a chemical release from the facility.\n\nIn addition to the plan noted above, the facility's emergency plans in response to HAZWOPER program requirements are also of significance.  Although the emergency response measures outlined in the facility's HAZWOPER plan are focused on protecting employees of the facilty, the same measures are effective in preventing chemical releases to the exterior environment as well.\n\nE. FIVE-YEAR ACCIDENT HISTORY\n\nIn the five-year period preceeding the date of this plan, there have been no releases of hazardous substances from the facility, which have produced any off-site effects to persons or properties in the plant vicinity.\n\nF. PROJECTED SAFETY ENHANCEMENTS\n\nProposed exerises with the new Ottawa County Hazmat Team. Planning towards the mitigation of the present hazard by use of a different chlorination agent."
    }
  ]
}