{
  "FacilityID": 33427,
  "FacilityName": "Hay Canyon Amine Plant",
  "FacilityStr1": "24 miles North of Loma",
  "FacilityStr2": null,
  "FacilityCity": "Loma",
  "FacilityState": "CO",
  "FacilityZipCode": "81524",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08045",
  "LEPC": "Garfield County LEPC",
  "FacilityLatDecDegs": "39.499842",
  "FacilityLongDecDegs": "-108.744636",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.encana.com",
  "FacilityEmailAddress": "Cocommunity@encana.com",
  "FacilityDUNS": 51680168,
  "ParentCompanyName": "EnCana Gathering Services (USA) Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "EnCana Gathering Sercices (USA) Inc",
  "OperatorStr1": "1125 Escalante Drive",
  "OperatorStr2": null,
  "OperatorCity": "Rangely",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "81648",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000186657",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 39.499818,
  "FRS_Long": -108.745291,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 48191,
      "AltID": "NGL and Slop extraction",
      "FacilityID": 33427,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 63598,
          "ProcessID": 48191,
          "ChemicalID": 155,
          "Quantity": 150000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 46157,
              "ProcessChemicalID": 63598,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 46158,
              "ProcessChemicalID": 63598,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 46159,
              "ProcessChemicalID": 63598,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 46160,
              "ProcessChemicalID": 63598,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 46161,
              "ProcessChemicalID": 63598,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 46162,
              "ProcessChemicalID": 63598,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 46163,
              "ProcessChemicalID": 63598,
              "ChemicalID": 115
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 49286,
          "ProcessID": 48191,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 33427,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-03-01 00:00:00",
    "ERTrainingDate": "2004-03-01 00:00:00",
    "CoordinatingAgencyName": "Rangely Fire Department",
    "CoordinatingAgencyPhone": "9706758311",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 33427,
      "SummaryText": "and  identification of numerous  potential  and\r\nactual  alarm  conditions.  Plant personnel  are  trained  to\r\nrespond  to remote alarm conditions with both remote and  on-\r\nscene  responses.  Various automatic process  safeguards  and\r\ninterlocks are intended to preclude a release.  If a  release\r\nshould   occur,  these  systems  allow  an  immediate  remote\r\nresponse  from  trained operators as well as  alerting  other\r\npersonnel to the need for an onsite response.\r\n\r\nDescription of the Stationary Source and Regulated Substances\r\nThe Hay Canyon Amine Plant consists of a number of production\r\nunits and/or scrubbers to remove liquids from the natural gas\r\nprocess stream, an amine unit to remove carbon dioxide, and a\r\nJoule-Thompson  (JT)  expansion unit to extract  natural  gas\r\nliquids  (NGL).   On  a  daily basis the  facility  processes\r\napproximately 4 to 5 million standard cubic feet  (MMscf)  of\r\ndehydrated  natural  gas per day and the  JT  expansion  unit\r\nextracts  approximately 800 gallons of  NGL.  The  NGL  is  a\r\nflammable  mixture consisting of multiple regulated flammable\r\nsubstances  including methane, ethane, propane,  butane,  and\r\npentane.    Included  with  the  regulated   flammables   are\r\nadditional non-regulated flammables in the C-6 through  C-10+\r\nrange.   The  NGL  is  stored at ambient  temperatures  in  a\r\npressure  vessel  maintained at  approximately  230  psig  to\r\ncontrol  vapor  release.  The various  production  units  and\r\nscrubbers  remove  produced water  and  condensate  from  the\r\nprocess  stream and direct the liquids to either of  two  (2)\r\n100  barrel  (bbl) vertical atmospheric storage  tanks  (slop\r\ntanks).  The slop liquids mixture contains multiple regulated\r\nflammable  substances  including  methane,  ethane,  propane,\r\nbutane,  and pentane.  Included with the regulated flammables\r\nare additional non-regulated flammables in the C-6 through C-\r\n10+  range. There are no regulated toxic materials stored  at\r\nthis  faci"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 33427,
      "SummaryText": "subject  facility\r\n(see attachment) indicates that the WCS distance to the 1 psi\r\noverpressure endpoint is 0.4 miles.  The figure  included  in\r\nthe consequence analysis presents the location of the subject\r\nfacility  and the boundaries of the WCS consequence endpoint.\r\nAs  indicated, there no public receptors within the  endpoint\r\nboundary,  therefore the facility is eligible for  Program  1\r\nstatus.  As  the  facility  is eligible  for  Program  1,  no\r\nalternative  release scenarios (ARS) were considered  in  the\r\nconsequence analysis.\r\n\r\nGeneral Accidental Release Prevention Program\r\nThe  Hay Canyon Amine Plant is located in a remote area  with\r\nno  identified residential occupancies within more than  one-\r\nhalf  mile  of the locations of regulated flammable  storage.\r\nThere  are  no full-time employees assigned to the  facility.\r\nThe  estimated presence of onsite personnel is 4 to  6  hours\r\nper  day.   As  such,  this facility is considered  to  be  a\r\nnormally unoccupied remote facility (NURF) and is not covered\r\nby the OSHA process safety management (PSM) standard.\r\n\r\nEmployee Participation. All employees are trained in accident\r\nprevention  and  emergency response as part of  their  formal\r\ntraining.  An Emergency Response Plan has been prepared  that\r\nidentifies  specific employee responsibilities and responses,\r\nand  lists  the reporting requirements, names, and  telephone\r\nnumbers for key company personnel.  Employees are expected to\r\nparticipate in the Company's Hazard Identification Program.\r\n\r\nDesign  Codes and Standards.  The facility is newly  designed\r\nand constructed.  The design standards follow the most recent\r\ncode  requirements including, where appropriate, ASTM,  ASME,\r\nAPI, and NEC.\r\n\r\nProcess  Hazard Analysis.  An initial hazard review has  been\r\nperformed  by  facility personnel to identify  major  hazards\r\nthat   might  be  encountered.   This  hazard  identification\r\nincludes  the  following  potential items:  fire,  explosion,\r\noverpr"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 33427,
      "SummaryText": "essurization,    corrosion,   overfilling,    equipment\r\nfailure, and loss of plant utilities.  Following the  initial\r\nhazard  review, periodic updates at least every 5  years  and\r\nafter  any major process change, unplanned event, or  release\r\nwill be conducted.\r\n\r\nVarious process controls are in place to regulate the process\r\nand  prevent  any  unplanned events.  The  process  equipment\r\nincludes  various vents, relief valves, check valves,  manual\r\nshutoffs,  automatic  shutoffs, equipment  interlocks,  level\r\nmonitors,  and  flow  meters  to  maintain  normal   control.\r\nUnexpected excess vapor can be relieved through safety relief\r\nvalves.  Alarm systems continuously monitor the process.  The\r\nmonitoring information can be accessed on-site, and  is  also\r\ntransmitted  to the offsite central Gas Control Center  where\r\nit is monitored by operating personnel 24-hours per day.\r\n\r\nThere  are  no  dikes  or  containment  structures  for   the\r\npressurized   flammable  substance   storage   tanks.    This\r\nprovision  is  intentional  and designed  to  allow  volatile\r\nliquid  spills  to  dissipate and spread  over  the  greatest\r\npossible  area  and  evaporate.   Use  of  dikes  around  the\r\npressure  tanks would contain a liquid pool, and a  resulting\r\npool fire could overheat the pressure tanks causing a greater\r\nhazard than the original evaporating spill.  With respect  to\r\nthe  pressurized  storage tank, no direct mitigation  systems\r\nare  in general use.  No area release monitoring or detection\r\nsystems  are  in  use other than the unit  and  tank  process\r\nalarms  from equipment failure, high level, high temperature,\r\nor high pressure.\r\n\r\nOperator  Training. Operators have written  instructions  for\r\nnormal    operations   and   emergency   responses.     These\r\ninstructions  include  normal  and  emergency   startup   and\r\nshutdown,  as  well  as a variety of special  procedures  for\r\nrestarting  and adjusting various components of the  process.\r\nIn  addition"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 33427,
      "SummaryText": "to  the written procedures, there  are  various\r\nsupplemental  training activities including safety  meetings,\r\ninternet-based  self  instruction, and  on-the-job  training.\r\nTraining   is   verified  by  a  combination  of   documented\r\nexperience,   observational  methods  and   verbal   testing.\r\nTraining   is  documented  in  writing,  and  reinforced   by\r\nrefresher training at least every three years.\r\nContractors.    The  facility uses  various  contractors  for\r\nmajor   plant   modifications  and  for  specific   scheduled\r\npreventative   maintenance   and   unscheduled    maintenance\r\noperations.  Contractors are required to attend a site safety\r\nbriefing   at   the  start  of  any  new  work.   Contractors\r\nperforming  continuing  services  are  required  to   provide\r\ndocumentation of training to facility personnel.\r\n\r\nCompliance Audits.  Compliance audits of the general facility\r\nincluding reporting and recordkeeping, operator, maintenance,\r\nand  contractor compliance will be scheduled as the  facility\r\ncomes  on-line.  To-date, no audits have been performed other\r\nthan those associated with construction quality assurance.\r\n\r\nIncident  Investigation.  Incidents (involving a catastrophic\r\nrelease)   will   be   documented  and   investigated.    The\r\ninvestigation will begin within 48 hours of the release,  and\r\na  written  analysis  of  the cause and  recommendations  for\r\nfuture  prevention will be prepared, discussed with  affected\r\npersonnel,  and retained for a minimum of 5 years.   To-date,\r\nthere have been no catastrophic incidents.\r\n\r\nFive-Year Accident History\r\nThe facility is newly constructed and to-date there have been\r\nno   accidents  involving  regulated  substances  that   have\r\nresulted  in  any  onsite  injuries or  significant  property\r\ndamage or any offsite response.\r\n\r\nEmergency Response Program\r\nA general Emergency Response Plan (ERP) has been prepared for\r\nseveral  EnCana  facilities, including the Hay  Canyon  Amine\r\nPlant.  This"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 33427,
      "SummaryText": "general plan includes specific  actions  for  a\r\nvariety of personnel, ranging from first responder to  senior\r\nmanagement.   There  is a comprehensive  list  of  names  and\r\ntelephone numbers in the ERP for key Hay Canyon personnel and\r\nHay Canyon emergency responders.  The primary response agency\r\nis  the Rangley, Colorado fire department.  In addition,  the\r\nemergency  response  program is  also  coordinated  with  the\r\nGarfield County local emergency planning committee (LEPC)  in\r\nGlenwood  Springs.    The  ERP is periodically  reviewed  and\r\nupdated as conditions require."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 33427,
      "SummaryText": "1\r\nEnCana Hay Canyon RMP                               06/11/04\r\n                      Executive Summary\r\n                   Hay Canyon Amine Plant\r\n            EnCana Gathering Services (USA) Inc.\r\n\r\nRevised June 11, 2004\r\n\r\nAccidental Release Prevention and Response Policies\r\nThe Hay Canyon Amine Plant is a new facility located about 24\r\nmiles  north  of Loma, Colorado. The plant is  located  in  a\r\nrural  area  about 0.4 of a mile from Highway 139  near  mile\r\nmarker  24.   The  plant receives dehydrated natural  gas  by\r\npipeline, removes condensable natural gas liquids (NGLs)  and\r\ncarbon dioxide, and ultimately delivers the natural gas to  a\r\ntransmission pipeline.\r\n\r\nOperators  of  the  facility have an on-going  commitment  to\r\nsafety   and   accident  prevention.   This   commitment   is\r\ndemonstrated by upper managements support of an  active  EH&S\r\nprogram. An employee training program is implemented as  part\r\nof  a  comprehensive EH&S management system and  the  use  of\r\nestablished  design  and construction standards  (API,  ASME,\r\nNEC),  and  the  installation of a state-of-the  art  process\r\ncontrol  and monitoring system.  The facility was constructed\r\nby  skilled  tradesmen who, in many cases, were  required  to\r\ndemonstrate  their skills and pass certification requirements\r\nprior  to  working  on  the project.   On-going  construction\r\ninspection  and  quality assurance procedures included  x-ray\r\nexamination  of welds for additional quality control.   Shop-\r\nfabricated  equipment mounted on skid units were  used  where\r\npossible to minimize field construction.\r\n\r\nAt  this  facility, critical process parameters are monitored\r\nremotely  on  a 24-hour basis using supervisory  control  and\r\ndata acquisition (SCADA) technologies.  This approach enables\r\noperation  without  full-time onsite  personnel.   The  SCADA\r\nsystems permit both automated and operator-directed responses\r\nto  process  conditions  in addition to  providing  immediate\r\nannunciation"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 33427,
      "SummaryText": "lity.  A plot plan of the facility is  included  in\r\nthe offsite consequence analysis for the facility.\r\n\r\nOffsite Consequence Analysis\r\nAt  the subject facility, regulated flammable substances  are\r\ngenerated  and stored as a result of two separate operations;\r\nthe  separation of slop liquids, and the extraction  of  NGL.\r\nThe  slop and NGL storage vessels are not connected,  however\r\nthe  storage  vessels for the two operations are  located  in\r\nclose  proximity.   Due  to the lack of intervening  distance\r\nbetween  the  slop  and  NGL vessels,  a  fire  or  explosion\r\ninvolving   the  vessels  related  to  one  operation   could\r\npotentially  spread  to the storage vessels  for  the  second\r\noperation.   Therefore,  for  the  purpose  of  the   offsite\r\nconsequence analysis, the slop and NGL vessels are considered\r\nto be one process.\r\n\r\nThe  worst-case scenario (WCS) associated with a  release  of\r\nflammable  substances from the subject facility  is  a  vapor\r\ncloud  explosion  (VCE)  involving  the  full  inventory   of\r\nflammable  materials  for  both  the  NGL  and  slop  storage\r\nvessels,  including  flammable  materials  contained  in  the\r\nassociated piping.  The endpoint for the consequence analysis\r\nis  the  extent of the 1 psi overpressure resulting from  the\r\nVCE.\r\n\r\nAt  the  subject  facility,  the total  volume  of  flammable\r\nmaterials  is  27,200 gallons, assuming that  the  associated\r\npiping  contains 3% of the storage volume.  For the WCS,  the\r\nentire flammable material inventory is assumed to release and\r\nignite resulting in a VCE.  There are numerous safety systems\r\nand   administrative  controls  to  prevent  such   releases,\r\nincluding  physical isolation of the tanks,  pressure  relief\r\nvalves, remotely operated shut-off valves, and remote  level,\r\npressure,  and temperature monitoring; however no credit  for\r\nadministrative or passive mitigation measures was  considered\r\nfor evaluating the WCS.\r\n\r\nThe  offsite  consequence analysis for the"
    }
  ]
}