{
  "FacilityID": 33524,
  "FacilityName": "Moreno Valley Regional Water Reclamation Facility",
  "FacilityStr1": "17010 Perris Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Moreno Valley",
  "FacilityState": "CA",
  "FacilityZipCode": "92551",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06065",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.871389",
  "FacilityLongDecDegs": "-117.217389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.emwd.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Eastern Municipal Water District",
  "Company2Name": null,
  "CompanyDUNS": 47789870,
  "Company2DUNS": 47789870,
  "OperatorName": "Eastern Municipal Water District",
  "OperatorStr1": "2270 Trumble Road",
  "OperatorStr2": "PO Box 8300",
  "OperatorCity": "Perris",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92572",
  "OperatorZipCodeExt": "8300",
  "RMPContact": "Anthony Pack",
  "RMPTitle": "General Manager",
  "FTE": 17,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000109893",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "013088",
  "SafetyInspectionDate": "2003-09-15 00:00:00",
  "SafetyInspectionBy": "Cal/OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-08-14 00:00:00",
  "DeRegistrationEffectiveDate": "2018-06-11 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 33.86452,
  "FRS_Long": -117.22502,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 48344,
      "AltID": "Chlorination",
      "FacilityID": 33524,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 49441,
          "ProcessID": 48344,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 63802,
          "ProcessID": 48344,
          "ChemicalID": 62,
          "Quantity": 108000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 563802,
          "ProcessID": 48344,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 33524,
      "SummaryText": "RISK MANAGEMENT PLAN - MORENO VALLEY REGIONAL WATER RECLAMATION FACILITY\n\nEXECUTIVE SUMMARY\n\nEastern Municipal Water District (EMWD) has established a risk management plan according to Federal EPA's (40 CFR Part 68) and California Accidental Release Prevention (CalARP) regulations to enhance already existing safety and emergency response programs.  EMWD is extremely cautious in the handling of all chemicals and is very diligent about safety for its employees, the communities where its facilities are located, and customers.  EMWD staff is well trained and utilizes modern equipment to monitor its facilities to provide safeguards, while effectively employing these useful chemicals.  These chemicals play an important role in water treatment and water reclamation, enabling everyone to lead healthier lives.\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nEMWD has an emergency response plan in effect to handle potential emergency situations at this facility.  This plan was designed to meet the following objectives:\n\n1.) To save lives.\n2.) To minimize and avoid injuries.\n3.) To protect the environment.\n4.) To minimize property damage.\n\nEMWD maintains an on-call Emergency Response Team.  The Emergency Response Plan provides the response organization and notification procedures, evacuation routes, chlorine health hazards and mitigation procedures that will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year and has been reviewed and updated to ensure compliance with the PSM, RMP and CalARP regulations.\n\n\nStationary Source and Regulated Substance\n\nThe Moreno Valley Regional Water Reclamation Facility maintains chlorine on-site for use in disinfecting wastewater treated by the plant.  There is a single chlorination building located at the facility housing the chlorine storage tanks.  Chlorine gas is supplied from the tanks to the chlorinators which regulate the c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 33524,
      "SummaryText": "hlorine feed.  Downstream of the vacuum regulators, the system is operated under vacuum as a safety measure.  The vacuum is created at the chlorinators by water flow through a set of injectors.  In case of a break, the vacuum regulator closes automatically minimizing the quantity of chlorine gas that may escape from the system.  Also, the entire system is connected to the gaseous side of the storage container.  This is also an important safety feature.  The system is also equipped with shutoff mechanisms that close the main valves in case of an emergency.  Chlorine detectors and a scrubber system are provided for the chlorination building to maximize safety and minimize release of any chlorine gas from the storage building into the atmosphere.  The detectors alarm locally and remotely (i.e., notify the duty operator of the plant.)  Also, the signal from the detectors is used to activate the scrubber system.  This system, when activated, draws air from the room where the storage tank and vacuum regulator are located and passes it through a scrubbing medium that consists of sodium hydroxide solution.  If chlorine is present in the room air, it would react with the solution resulting in table salt and water.\n\n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nEMWD has a PSM program in place to manage the handling of chlorine.  The program includes strict requirements for written operating procedures, personnel training, contractor safety, equipment maintenance, incident investigation, process hazard analysis, management of change and periodic review or audit of program elements.  Management of change element addresses proper implementation of system updates to ensure that all changes are reviewed properly by knowledgeable persons, all engineering documents and operating procedures reflect the change, and personnel are trained on the change.   Process Safety Management also requires a pre-startup safety review to ensure that the system is pro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 33524,
      "SummaryText": "perly reviewed before it is put back into service after a major change.  \n\nIn addition to PSM, common industry standards, policies, and procedures are strictly followed.  Also, common practices outlined by the Chlorine Institute are implemented in system design and day-to-day system operation.  \n\n\nFive Year Accident History\n\nThe five-year accident history (June 1999 to June 2004) for the Moreno Valley Regional Water Reclamation Facility reveals that there were no reportable accidents during this period.\n\n\nPlanned Changes to Improve Safety\n\nEMWD is taking additional steps to further public safety.  Several studies have been conducted recently to examine mitigation measures and additional steps to further ensure public safety at the EMWD, Moreno Valley Regional Water Reclamation Facility.  All recommended changes from the Process Hazard Analysis, Pre-Startup Safety Review and Seismic Assessment have been reviewed and implemented."
    }
  ]
}