{
  "FacilityID": 3360,
  "FacilityName": "Cook Family Foods",
  "FacilityStr1": "13825 Wyandotte",
  "FacilityStr2": null,
  "FacilityCity": "Kansas City",
  "FacilityState": "MO",
  "FacilityZipCode": "64145",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29095",
  "LEPC": "Mid-America LEPC",
  "FacilityLatDecDegs": "38.881444",
  "FacilityLongDecDegs": "-94.603111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.conagra.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 148410418,
  "ParentCompanyName": "Conagra, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 7258908,
  "Company2DUNS": 0,
  "OperatorName": "Michael Schlif",
  "OperatorStr1": "13825 Wyandotte",
  "OperatorStr2": null,
  "OperatorCity": "Kansas City",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "64145",
  "OperatorZipCodeExt": null,
  "RMPContact": "Nelson Womack",
  "RMPTitle": "Facilities Engineer",
  "FTE": 225,
  "OtherEPAFacilityID": "64114RMRFD13825",
  "EPAFacilityID": "100000042571",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-12-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Kansas City, MO",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 38.8773,
  "FRS_Long": -94.5984,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3776,
      "AltID": "Refrigeration",
      "FacilityID": 3360,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3850,
          "ProcessID": 3776,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4033,
          "ProcessID": 3776,
          "ChemicalID": 56,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504033,
          "ProcessID": 3776,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3360,
      "SummaryText": "The accidental release prevention and emergency response policies at the plant consist of all regulations that are regulated by OSHA and the PSM program at the facility.  All refrigeration employees and their supervisor are trained in the 40 HAZMAT course to respond to accidental releases.  All refrigeration maintenance personnel go through training on all the SOP's from the PSM program.  These procedures are reviewed yearly to help insure that all problems are corrected.  The preventative maintenance program is periodically reviewed and updated as the monitoring and repair on equipment is performed.  This process has been of great benefit to the plant in finding problems in a timely manner.\n\nThe Cook Family Foods plant in Kansas City, Missouri, is a ham processing facility.  The plant is defined by the EPA as a \"Meat Cutter\" facility.  Final products produced include: smoked or cured products.  The regulated substance used at this facility that meets threshold quantities is anhydrous ammonia.  Ammonia is used as a manufacturing aid in the refrigeration process.  Refrigeration is used in processing and storing of the meat and meat products.  The total calculated amount of anhydrous ammonia in the facility is equal to 28,000 pounds.  This combined total is the result of equipment and piping within the plant.\n\nThe worse case scenario for this facility is a rupture in the low pressure accumulator resulting in a loss of the entire contents of 12,813 pounds of ammonia.  This loss will occur within 10 minutes and the spilled liquid will vaporize at room temperature releasing gas to the building envelope and to 7the atmosphere.  The American Industrial Hygiene Association (AIHA) has determined that the maximum airborne concentration below which it is believed that nearly all individuals can be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3360,
      "SummaryText": "ction for anhydrous ammonia is 200 parts per million (ppm).  Under the worse-case weather conditions with dispersion into an urban area, the distance that the release would travel before it no longer causes a health threat is 1290 meters (.80 mile).  It is very unlikely that a release of this magnitude could happen because of the safety programs at the facility.\n\nThe alternative release scenario or more likely release of ammonia would be a failure of a relief valve.  This release would require 5,000 pounds of ammonia over a period of 60 minutes be discharged to affect any other adjacent properties.  The facility has never had this size of a release, and it is unlikely that such a release would occur with the safety programs in place.\n\nThe Cook Family Foods facility is in compliance with all OSHA PSM rules and this RMP rule requirements.  The procedural and managerial steps that are in place are a preventative measure to accidental release prevention as well as maintenance and training programs that are in place.\n\nThere have been no releases at this facility in the past five years that have resulted in death, injuries, or property damage on site or in death, injuries, evacuations, sheltering in place, property damage, or environmental damage offsite.\n\nThe Cook Family Foods facility has an emergency response plan on file with the local emergency planning committee (LEPC).  The facilities HAZMAT team conducts regular drills and training of specialized personnel.  The policies for reporting spills and releases is documented in the \"Policies and Procedures\" manual updated by the Corporate Environmental Operations office.\n\nThe ammonia compressor rooms of this facility are not protected by monitoring systems at this time.  The facility will continue with HAZMAT training of plant personnel as a deterrent to toxic release danger."
    }
  ]
}