{
  "FacilityID": 3368,
  "FacilityName": "Monfort Inc.",
  "FacilityStr1": "100 N 8th Ave",
  "FacilityStr2": null,
  "FacilityCity": "Greeley",
  "FacilityState": "CO",
  "FacilityZipCode": "80631",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08123",
  "LEPC": "Weld County LEPC",
  "FacilityLatDecDegs": "40.443611",
  "FacilityLongDecDegs": "-104.6925",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.conagra.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 48124978,
  "ParentCompanyName": "ConAgra, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 7258908,
  "Company2DUNS": 0,
  "OperatorName": "Eric Cahoy",
  "OperatorStr1": "100 N 8th Ave",
  "OperatorStr2": null,
  "OperatorCity": "Greeley",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80631",
  "OperatorZipCodeExt": null,
  "RMPContact": "Doug Kayl",
  "RMPTitle": "Plant Engineer",
  "FTE": 2609,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000041643",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-03-23 00:00:00",
  "SafetyInspectionBy": "fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Greeley, CO (Beef)",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 40.43397,
  "FRS_Long": -104.69082,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3784,
      "AltID": null,
      "FacilityID": 3368,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3858,
          "ProcessID": 3784,
          "NAICSCode": "311611",
          "_desc": {
            "NAICS_CODE": "311611",
            "NAICS_DESCRIPTION": "Animal (except Poultry) Slaughtering"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4041,
          "ProcessID": 3784,
          "ChemicalID": 56,
          "Quantity": 158000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504041,
          "ProcessID": 3784,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3368,
      "SummaryText": "The accidental release prevention and emergency response policies at the plant consist of all regulations that are regulated by OSHA and the PSM program at the facility.  All refrigeration employees and numerous supervisors are trained in the 40 HAZMAT course to respond to accidental releases.  All refrigeration maintenance personnel go through training on all the SOP's from the PSM program.  These procedures are reviewed yearly to help insure that all problems are corrected.  All refrigeration maintenance personnel are currently scheduled to go through ammonia refrigeration school to teach them the operations and safety.  The school is located in Greeley, Colorado and is part of the local community college.  The preventative maintenance program is periodically reviewed and updated as the monitoring and repair on equipment is performed.  This process has been of great benefit to the plant in finding problems in a timely manner.\n\nThe Monfort, Inc. plant in Greeley, Colorado, is a beef slaughter and processing facility.  The plant is defined by the EPA as a \"Complex Slaughter\" facility.  Final products produced include: meant products, edible tallow, inedible tallow, dried blood, meat and bone meal, and brined hides.  The regulated substance used at this facility that meets threshold quantities is anhydrous ammonia.  Ammonia is used as a manufacturing aid in the refrigeration process.  Refrigeration is used in processing and storing of the meat and meat products.  The total calculated amount of anhydrous ammonia in the facility is equal to 158,000 pounds.  This combined total is the result of equipment and piping in two separate systems within the plant.\n\nThe worse case scenario for this facility is a rupture in the high pressure receiver outside the plant refrigeration equipment room resulting in a loss of the entire contents of 45,090 pounds of ammonia.  This loss will occur within 10 minutes and the spilled liquid will vaporize at room temperature releasing gas to "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3368,
      "SummaryText": "the atmosphere.  The American Industrial Hygiene Association (AIHA) has determined that the maximum airborne concentration below which it is believed that nearly all individuals can be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action for anhydrous ammonia is 200 parts per million (ppm).  Under the worse-case weather conditions with dispersion into an urban area, the distance that the release would travel before it no longer causes a health threat is 3340 meters (2.08 miles).\n\nThe Monfort, Inc. facility is in compliance with all OSHA PSM rules and this RMP rule requirements.  The procedural and managerial steps that are in place are a preventative measure to accidental release prevention as well as maintenance and training programs that are in place.\n\nThere have been no releases at this facility in the past five years that have resulted in death, injuries, or property damage on site or in death, injuries, evacuations, sheltering in place, property damage, or environmental damage offsite.\n\nThe Monfort, Inc. facility has an emergency response plan on file with the local emergency planning committee (LEPC).  The facilities HAZMAT team conducts regular drills and training of specialized personnel and the local fire department personnel.  The policies for reporting spills and releases is documented in the \"Policies and Procedures\" manual updated by the Corporate Environmental Operations office.\n\nThe ammonia compressor rooms of this facility are protected by monitoring systems.  Alarms and warning devices were installed in December of 1998.  The facility will continue with HAZMAT training between plant personnel and the local fire department as a deterrent to toxic release danger."
    }
  ]
}