{
  "FacilityID": 33948,
  "FacilityName": "Titanium Metals Corporation",
  "FacilityStr1": "8000 West Lake Mead Dr.",
  "FacilityStr2": null,
  "FacilityCity": "Henderson",
  "FacilityState": "NV",
  "FacilityZipCode": "89015",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "32003",
  "LEPC": "Clark County LEPC",
  "FacilityLatDecDegs": "36.043000",
  "FacilityLongDecDegs": "-114.993000",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A6",
  "LatLongDescription": "AB",
  "FacilityURL": "www.timet.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 41829318,
  "ParentCompanyName": "Titanium Metals Coporation",
  "Company2Name": null,
  "CompanyDUNS": 41829318,
  "Company2DUNS": null,
  "OperatorName": "Titanium Metals Corporation",
  "OperatorStr1": "8000 West Lake Mead Dr.",
  "OperatorStr2": null,
  "OperatorCity": "Henderson",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89015",
  "OperatorZipCodeExt": null,
  "FTE": 425,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000072404",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "00019",
  "SafetyInspectionDate": "2004-04-02 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 36.040246,
  "FRS_Long": -114.993966,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 48914,
      "AltID": "1",
      "FacilityID": 33948,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 64498,
          "ProcessID": 48914,
          "ChemicalID": 51,
          "Quantity": 2200000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 50033,
          "ProcessID": 48914,
          "NAICSCode": "331419",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 28003,
              "Process_NAICS_ID": 50033,
              "SafetyReviewDate": "2004-05-18 00:00:00",
              "PHA_Date": "2005-06-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-09-28 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-12-01 00:00:00",
              "TrainingReviewDate": "2004-05-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-03-23 00:00:00",
              "EquipmentInspectionDate": "2004-05-20 00:00:00",
              "EquipmentTested": "KT-850 Vacuum Pump Performance Test",
              "ChangeMgmtDate": "2004-05-28 00:00:00",
              "ChangeMgmtReviewDate": "2003-02-20 00:00:00",
              "PreStartupReviewDate": "2003-10-29 00:00:00",
              "ComplianceAuditDate": "2004-04-02 00:00:00",
              "AuditCompletionDate": "2004-04-15 00:00:00",
              "IncidentInvestigationDate": "2004-05-12 00:00:00",
              "InvestigationChangeDate": "2004-06-15 00:00:00",
              "ParticipationPlansReviewDate": "2004-03-23 00:00:00",
              "HotWorkPermitReviewDate": "2003-09-01 00:00:00",
              "ContractorSafetyReviewDate": "2004-05-20 00:00:00",
              "ContractorSafetyEvalDate": "2003-09-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 40756,
                  "PreventionProgram3ID": 28003,
                  "ProcessChemicalID": 64498
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 33948,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-05-18 00:00:00",
    "ERTrainingDate": "2004-05-18 00:00:00",
    "CoordinatingAgencyName": "Clark County LEPC",
    "CoordinatingAgencyPhone": "7024555710",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 33948,
      "SummaryText": "Titanium Metals Corporation (TIMET)\nRMP Executive Summary &\nPrevention Program Summary\n\nEPA Identifier #:  1000 0007 2404\nBAR CODE #:  MRM-1999-2-006853-7\n\n\nTable of Contents\n\n1.0  TIMET Henderson Facility RMP: Executive Summary\n       1.1 EPA RMP and the Nevada CAPP program\n       1.2 Facility Description and Covered Processes\n       1.3 TIMET's Approach to Safety\n\n2.0 TIMET Hazard Assessment Results\n       2.1 Offsite Consequence Analysis (OCA) Summary\n             2.1.1 Worst Case Scenario\n             2.1.2 Alternative Release Scenario\n       2.2 Five Year Accident History\n\n3.0 TIMET Henderson Facility Prevention Program\n       3.1 Safety Information\n       3.2 Process Hazard Analysis\n       3.3 Operating Procedures and Safe Work Practices\n       3.4 Training\n       3.5 Maintenance\n             3.5.1 Mechanical Integrity Training\n       3.6 Incident Investigation\n       3.7 Compliance Audits\n       3.8 Chemical Specific Prevention Steps\n       3.9 Additional Prevention Programs\n             3.9.1 Employee Participation\n             3.9.2 Contractor Safety\n             3.9.3 Management of Change\n             3.9.4 Pre-Startup Safety Reviews (PSSRs)\n\n4.0 Emergency Response Program Summary\n\n5.0 Management Systems\n\n**************************************************************************************\n\n1.0 TIMET Henderson Facility RMP: Executive Summary\n\nThe federal Risk Management Program (40 CFR Part 68) requires Titanium Metals Corporation (TIMET) \nto submit a Risk Management Plan (RMP) for any processes containing regulated substances above \nthreshold quantity (TQ) at the Henderson Facility.  The TIMET Henderson, Nevada, Facility (the Facility) \nhandles hazardous materials onsite, and recognizes a responsibility to safely operate the Facility in order to protect the surrounding community, employees, contractors, and the environment.  TIMET has taken a \nproactive stance to promote the overall safe operation of the processes, with programs to prevent accidents \nfro"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 33948,
      "SummaryText": "t management and controls.\n-  Process unit process safety information is typically contained in the both the unit operations files and the\n    central engineering files.\n-  The process safety information is available to all employees either electronically or in hard copy form\n    upon request.\n-  Written process safety information is required for each of the three process safety categories.  At this\n     facility, these include process chemicals, process technology and process equipment.\n-  Process chemical information: Process chemical information includes: toxicity, permissible exposure\n   limits  (PELs), physical data, reactivity data, corrosivity data, thermal and chemical stability and the            \npotential effects of accidental mixing of different chemicals.  This information is nominally contained in MSDS records.\n-  Process Technology Information: Process technology includes block flow or simplified process flow\n    diagrams, process chemistry, maximum intended inventories and safe upper and lower limits for key\n    process variables.  Also, an evaluation is required for the consequence of deviations.  This information \n    is nominally contained in the Unit Process Flow Diagrams.  Consequences from deviating from the\n    operating limits were discussed in the unit PHAs, and are clearly documented in the Standard Operating \n    Procedures for each unit.\n-  Process Equipment Information: Process equipment includes pressure vessels and storage tanks, piping\n   systems including valves, relief and vent systems and devices, emergency shutdown systems, controls\n   (including monitoring devices, sensors, alarms, and interlocks) and pumps.  This information is \n   nominally kept in the process and project engineering files, and the maintenance and inspection files.\n\nAs reference, the information required for process equipment includes: materials of construction, piping \nand instrumentation diagrams, electrical classifications, relief system design and design ba"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 33948,
      "SummaryText": "m occurring, planning for emergencies, and maintaining the equipment needed if an emergency does \noccur.  The RMP is a document that formalizes existing programs and procedures so that these programs \nmay be reviewed more efficiently.\n\nThe RMP consists of two parts required for submittal:\n\n-  RMP Executive Summary, Prevention Program Summary, and Management System\n-  RMP Data Elements\n\nThe RMP effort at the Facility was divided into three steps.  First, the Facility determined which processes \nwere covered by the RMP Regulation.  The results of this study are published in the report titled \nMaximum Inventory Determination. Located at the facility. The inventory determination measured the \nquantities of regulated substances to determine which processes are subject to RMP.  Next, the Facility \nconducted the required Hazard Assessment as defined by 40 CFR Part 68.  The Hazard Assessment \nmodeled accidental release scenarios that provided TIMET and the local emergency responders insight \nabout the potential for onsite processes to affect the surrounding community and the environment.  A \nsummary of the Hazard Assessment is provided in Section 2.  Finally, a summary of the RMP effort is \nprovided in this document.  It contains the Executive Summary, a synopsis of the Prevention Program, and \nan organizational chart of the Management Systems in place to implement and maintain the Facility's risk \nmanagement measures.  The Executive Summary and Data Elements are submitted to Local Emergency Planning Committee (LEPC) and the Federal EPA as part of the Risk Management Plan requirements.\n\n1.1 EPA RMP and the Nevada CAPP program\n\nThe Federal RMP regulation specifies three program levels based on the hazards of the processes and the \ndegree of compliance program required. Under the Federal EPA RMP regulation, the TIMET titanium \nproduction process is subject to Program Level 2 for titanium tetrachloride. Under the separate, but similar, \nNevada CAPP program, the TIMET titaniu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 33948,
      "SummaryText": "m production process is subject to Tier A Program Level 3 for \ntitanium tetrachloride and chlorine.  As such, TIMET has complied with most stringent requirements of \nboth programs, which meets with the RMP Program Level 3.  Therefore, for the purposes of streamlining \nthe required submission documents for both agencies, TIMET is submitting as Program Level 3 for the \nFederal RMP Submission, for titanium tetrachloride. A separate submission document will also be supplied \nto the Nevada Department of Environmental Protection for the Tier A Program Level 3 processes for \ntitanium tetrachloride and chlorine.\n \n1.2  Facility Description and Covered Processes\n\nThe TIMET Henderson plant produces titanium metal sponge and ingots. The Facility is divided into five \nmain process areas: Titanium Tetrachloride Production; Titanium Tetrachloride Storage; Titanium Sponge \nProduction; Titanium Ingot Production; and Magnesium Recovery.\n\nThe principal materials produced at the TIMET facility include titanium tetrachloride (TiCl4), titanium \nsponge, titanium fines, titanium ingots, and magnesium chloride. \nPrincipal raw materials used at the facility include chlorine, petroleum coke, magnesium and rutile. TIMET \noperates 24 hours per day, seven days per week. \n\nThe facility produces titanium sponge and ingots from rutile (primarily titanium dioxide) by a series of \nchemical processes, which include chlorination, purification, reduction with magnesium metal, and vacuum \ndistillation. The titanium sponge (so named because of its appearance) is crushed, pressed into compacts \nand then melted into ingots in vacuum arc remelt furnaces.\n\nIn the Titanium Tetrachloride Production Unit, titanium tetrachloride (TiCl4) is produced by reacting rutile \nore with chlorine. Chlorine and titanium tetrachloride are the two listed substances which are required to be reported in the RMP. The resulting TiCl4 is purified and is either stored in the Titanium Tetrachloride \nStorage Unit or sold and shipped"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 33948,
      "SummaryText": "offsite in railcars and tank trucks.  To make titanium, the TiCl4 is reduced \nin the Vacuum Distillation Process Unit using magnesium to yield a raw titanium sponge and magnesium \nchloride.  The solid titanium sponge is further processed into titanium ingots. The magnesium chloride is \nprocessed to recover the chlorine and magnesium for reuse in the process in the Magnesium Recovery Unit.\n\nTIMET also operates an ingot plant, which consists of blending, welding and ingot melting operations. \nThere are also areas for storing raw materials and products, scrap reclamation, transportation and \nmaintenance operations that support the manufacturing process, a quality assurance laboratory and \nadministrative offices. The Henderson Technical Laboratory (HTL) is also located within the main plant \narea, south of the manufacturing facilities. HTL conducts various testing and developmental work \nassociated with titanium production. \n\nTitanium tetrachloride and chlorine are regulated substances, each with RMP threshold quantities of 2500 \npounds.  The maximum inventory calculation determined that only titanium tetrachloride is handled in \namounts greater than the threshold quantity.  The process units within the titanium tetrachloride process, \nwhich is subject to RMP Program Level 2, are the Chlorination Unit, Titanium Tetrachloride Purification \nUnit, Titanium Tetrachloride Storage Unit, and the Vacuum Distillation Unit.\n\nTIMET recognizes its duty to also ensure the safe handling of chlorine and titanium tetrachloride, and \ntherefore the Prevention Program is generally applied to all areas of the facility handling chlorine, \nincluding titanium tetrachloride production and storage.\n\n\n1.3 TIMET's Approach to Safety\n \nTIMET places a priority on the safety of its employees and contractors, and the wellbeing of the \nsurrounding community and the environment.  TIMET is compliant with the State of Nevada's Chemical \nAccident Prevention Program (CAPP) requirements, NRS  459.380 throug"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 33948,
      "SummaryText": "h 459.3874 of the Nevada \nRevised Statutes (NRS).  This program is similar in structure to the OSHA Process Safety Management \nregulation (29 CFR 1910.119), and the Prevention Program portion of the RMP.   \n\nCompliance with the Nevada CAPP program is directed by the Plant Manager, and is upheld by the \nindividual engineering, operations, and Health, Safety & Environmental Affairs (HSEA) department managers.  The person responsible for the implementation of the CAPP program, the HSEA manager, is also responsible for the compliance to the RMP regulation.  This organizational structure ensures complete and efficient compliance with both regulations.\n\nThe Safety Engineer is responsible for implementation of Safe Work Practices and the Emergency \nPlanning and Response Program.  Both of these programs are part of the Nevada CAPP and RMP \nprograms. A Safety Committee comprised of operations, maintenance, engineering and safety department \npersonnel ensure that the Safe Work Practices and Emergency Response procedures are uniformly followed plant wide.  This ensures that operations staff with the opportunity to work in multiple process units follow the same set of safe practices standards.\n\nTIMET is also certified to comply with the ISO 9002 standard to ensure quality products.  The same \nmanagement systems that apply to processes that affect product quality are also generally applied to all \nprocesses and operations.  This broad-based application of a single management system ensures that all \noperations are continually evaluated and improved.\n**************************************************************************************\n\n2.0 TIMET Hazard Assessment Results\n\n2.1 Five Year Accident History\n\nThe RMP rule requires facilities to compile a 5-Year Accident History for all RMP regulated substances in \ncovered processes at the Facility.  As part of the ongoing Nevada CAPP Program, the Facility documents \nand tracks all incidents and near misses that occur within the Facili"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 33948,
      "SummaryText": "ty. \n\nRMP requires facilities to report any incident from a covered process involving a regulated substance and \nresulting in any of the following:\n\n- Onsite deaths, injuries, or significant property damage\n- Offsite deaths, injuries, property damage, evacuations, sheltering-in-place, or environmental damage\n\n**************************************************************************************\n\n3.0 TIMET Henderson Facility Prevention Program\n\nThe following is a summary of the general accident prevention program in place at the TIMET Henderson \nFacility.  The Prevention Programs required for Program Level 2 facilities are as follows:\n\n-  Safety Information\n-  Process Hazard Analysis\n-  Operating Procedures\n-  Maintenance\n-  Incident Investigation\n-  Compliance Audits\n\nThe CAPP standard for the TIMET facility requires the development of Prevention \nPrograms similar to that of the RMP Program Level 3.  Therefore, TIMET \nhas also implemented the following programs:\n\n-  Management of Change\n-  Pre-Startup Safety Review\n-  Employee Participation\n-  Hot Work Permit\n-  Contractor Safety\n\nThis summary addresses each of the RMP Program elements and describes the management system in \nplace to implement the accident prevention program.  Each section below contains a brief summary of the \nprevention program elements.  \n\n3.1 Safety Information\n\nThe Facility provides complete and accurate information concerning all covered processes.  This \ninformation is essential for having an effective process safety management program and for conducting \nthorough process hazards analysis.  This includes information regarding process chemicals, process \ntechnology and process equipment.\n\nGeneral guidelines are as follows:\n\n-  Key process safety information is kept in a central location within the facility, however clear\n    ownership exists for making sure the information is current, accurate and kept up to date through the\n    management of change process.  This includes a system for documen"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 33948,
      "SummaryText": "sis, ventilation \nsystems, design codes and standards used, and safety systems (interlocks, detection or suppression \nsystems).\n\nThis facility assures that existing equipment still utilized that was originally designed to previous codes, \nstandards and practices no longer in use, is considered safe to operate based on either (1) successful prior operation, (2) documentation that the equipment meets current codes and standards or by (3) performing an engineering analysis.  To verify this fact, a strenuous inspection/testing program is being performed in accordance with the applicable codes and standards.\n\nKey Process Technology definitions are:\n\n-  Process chemistry - This information describes the intended chemical reactions needed to generate the\n   products.  It will typically include a description of the feedstocks, chemical equations, process\n   conditions affecting chemical reactions and whether the reactions are endothermic or exothermic. This\n   information is included in Process Engineering Files and the Project Engineering Files.\n-  Maximum intended inventories - This is the total volume of the vessels and piping in the affected process\n   system.  The working inventory of the large vessels is calculated rigorously\n   and kept with the RMP\n   Coordinator.\n-  Safe upper and lower limits - The PSI limits are the maximum equipment limits that cannot be exceeded\n   or violated without consequence. Operating beyond the safe operating limits requires a Management of\n   Change request (MOC).  This ensures that appropriate engineering reviews are performed to determine\n    if it is safe to operate at the new limits. The Safe upper and lower limits is documented on the Piping and\n    Instrument Diagrams, the Standard Operating Procedures, and in the Nevada CAPP Assessment of Risk\n    through the Analysis of Hazards reports for each unit.\n-  Consequences of deviation - This effort clearly identifies the consequence of deviating outside the PSI\n    limits.  These acti"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 33948,
      "SummaryText": "ons are normally identified during the development of the process hazard analyses,\n    and are documented in the Standard Operating Procedures.\n\nKey process equipment definitions are:\n\n-  Materials of construction - This is typically information that shows which materials were used .\n-  Relief system design and design basis - This is information that provides the rationale for providing \n   safety  relief valves (PSVs) at certain locations, the selection of the size of the relief valve, the \n   establishment of  PSV setpoints and criteria used in designing the inlet and outlet piping of the PSV.  \n-  Ventilation system design - This is information such as airflow calculations and  equipment sizing\n    calculations.\n-  Design codes - This is information that references the codes and standards used to form the design\n    basis of the process.  This is a combination of industry standards and facility specific standards.  Some\n    of the more common codes used are ANSI, ASTM, NFPA, and ASME.\n-  Safety systems - This is information that fully describes all of the safety systems at the facility.  This\n    includes control interlocks, relieving control valves, hazardous disposal systems such as flares, deluge\n   and spray systems and ambient detectors.\n\nThe process safety information is in place for existing processes according to the \nCAPP/RMP guidelines. The preparation of materials for the process hazards analyses by the PHA team leader will identify any shortcomings in information.  The PHA team will then initiate a \nrequest for generating the deficient information to assure that the PHAs are completed properly. Updating \nof documents is completed through the established management of change request process.  This assures that the process safety information is always current.\n\nEach area manager is responsible for their area Process Safety Information.\n \n\n 3.2 Process Hazard Analysis\n\nTIMET has a comprehensive program to help ensure that hazards associated with the vari"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 33948,
      "SummaryText": "ous processes are identified and controlled.  Within this program, each covered process unit is systematically examined to \nidentify hazards and ensure that adequate controls are in place to manage these hazards.  The PHA team \nidentifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and makes suggestions for additional prevention and/or mitigation measures when the team believes such \nmeasures are necessary.\n\nTIMET primarily uses the hazard and operability (HAZOP) analysis technique to perform these \nevaluations.  HAZOP analysis is recognized as one of the most systematic and thorough hazard evaluation \ntechniques and is accepted by EPA, OSHA, and Nevada Dept of the Environment.  Other techniques \nutilized less frequently are What-If or Checklist Analysis.\n\nAll areas of the Facility covered by the regulation are subjected to a hazard evaluation.  The evaluation \nidentified and evaluated the hazards involved in the process.  The hazards will be controlled based on the \nextent of the hazards, the number of potentially affected employees, the age of the process, and the \noperating history of the process.\n\nHazard evaluation methods are selected based on the complexity of the process to be analyzed and the \npurpose of the analysis.  The methodology for new facilities will be selected based on the nature of the \nhazards involved, and the complexity of the process.\n\nAll hazard evaluations include:\n\n-  Identification of process hazards\n-  Review of previous incidents that had a potential for catastrophic consequences in the workplace.\n-  Review of procedures, process monitoring and control instrumentation including alarms and detection\n    hardware.\n-  Determine the consequences of the failure of equipment and control instrumentation.\n-   Evaluate the level of safeguards present to prevent, detect, or mitigate the identified hazards\n-  Review facility siting.\n-  Review the consequences of human error\n-  Review of global occurr"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 33948,
      "SummaryText": "ences or events, such as power failure, earthquake, or vehicle impact.\n\nThe process hazard analysis are be performed by teams of individuals with knowledge and experience in \nprocess operations, safety and design.  The team leader will be knowledgeable in the specific methodology being used.\n\nThe team's findings and recommendations will be assigned a level of potential risk, given a prompt \nmanagement review, assigned a priority, given an expected completion date, assigned to a person \nresponsible for completing the necessary action and then entered into the facility tracking system.\n\nAt five-year intervals, each hazard review will be updated and revalidated by a team.  All Incident Reports, \nManagement of Change requests, and Capital Projects since the last evaluation will be reviewed as part of \nthe revalidation process.\n\nThe Environmental Engineer is responsible for tracking the process hazard analysis and the completion of study \nrecommendations.\n\n\n3.3 Operating Procedures and Safe Work Practices\n\nThe Operating Procedures Element develops and implements written operating procedures that provide \nclear instructions for safely conducting activities in each covered process.  The tasks and procedures must \nbe appropriate, clear, consistent and communicated with the employees.  This program is designed to \nsatisfy the Nevada CAPP regulation, RMP Requirements, and meet all parts of the Compliance Guidelines \nCPL 2-2.45A.  Operating procedures are the responsibility of the Departmental Managers.\n\n General guidelines are as follows:\n\n-  The operating procedures address steps for each operating phase, operating limits, safety and health\n     considerations and safety systems and their functions.\n-  The operating procedures are consistent with the process safety information regarding the process\n    equipment.\n-  Employees are involved in developing and reviewing the procedures. \n-  All procedure modifications require a Management of Change request\n-  The procedures are e"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 33948,
      "SummaryText": "asily accessible for all affected personnel. Document management practices are\n     used to control all paper copies to ensure each distributed document is the most recent version.\n\nThe procedures developed include the following brief summaries to define what these terms mean at this \nfacility.  The following are typical applications but do not limit the application of the rule to these examples \nand definitions:\n\n-  Initial startup - Include commissioning of a new facility or system or for a facility that has undergone\n    major changes.\n-  Normal operations - Includes procedures for a facility or system that is operating within the safe\n    operating envelope for temperature, pressure, etc. per engineering criterion.\n-  Temporary operations - Includes a controlled change to normal procedures that can be used to satisfy\n     a maintenance or operational requirement.\n-  Emergency operations - Includes procedures that are required to avoid, prevent, minimize control or\n    contain a condition that would otherwise become critical or threaten safe operations.  This will include,\n    but not limited to troubleshooting procedures for loss of air, electrical power, cooling water and steam,\n    uncontrolled reaction, etc.\n-   Normal shutdown - Includes, but is not limited to, shutdowns for a turnaround, to repair a specific\n     problem, to put a unit into a safe holding point or standby mode until feed can be reestablished, etc.\n-  Startup - Includes procedures to start up after a turnaround, take the unit from a standby to operating\n    mode or to start up after an emergency shutdown.\n \nThe procedures follow a specific format to assure that the intent of the regulation is clearly met in the areas of operating limits, safety and health considerations and safety systems and their functions.  Specific features contained in the procedures are:\n\n-  A specific purpose and numbering system to uniquely identify each procedure.\n-  Clear health and safety considerations and requir"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 33948,
      "SummaryText": "ed references to MSDS information.\n-  Cautions, notes, and warnings to clearly identify deviations or hazards that could cause personnel\n     injury or equipment damage.  Recommended steps to take to avoid or react to these deviations.\n-  Inclusion of safety systems and instrumentation.\n \nThe procedures are developed and reviewed by individuals experienced in the process involved.  \nSpecifically the review sequence is as follows:\n\n-  An experienced individual, such as a Foreman or Process Engineer, writes the draft procedure.  The \n   procedure follows standard TIMET format.\n-  The procedure is submitted to an Operator, Foreman, HSEA Manager, or other \n    affected persons for review\n-  Final comments are included, as appropriate, and the procedure is issued as revision 0.  Any changes\n    to the procedure fall under the authority of appropriate Area Supervisor or Department Manager.\n-   The managers who are responsible for authorizing procedures are:  HSEA Manager, Process Engineering Manager, Quality Manager, and the appropriate Department Manager.\n-  Training on the new or revised procedures follows facility training guidelines.\n \nContinual feedback is supplied from the operators to the Foremen, Area Supervisors, or Department \nManagers as procedures are used and deficiencies or ambiguities are found.  This action takes place \nthrough verbal and/or written means.\n\nPeriodic auditing of procedures is conducted by the Department Manager or a delegate and documented to \nverify the procedure accuracy.  This effort also identifies any additional training needs.  Typically, this \nauditing is performed during the normal course of daily activities and does not require any additional or \npractice procedures.  However, annual reviews are performed on operational departmental SOPs to ensure accuracy and compliance to the Nevada CAPP and RMP regulations.\n\nTIMET provides a safe and healthful work place for the workers at the Facility, contractors, visitors, and \nthe community"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 33948,
      "SummaryText": "surrounding the Facility.  Safe work practices are in place to ensure that common hazardous activities are conducted safely and routinely.  These procedures (and others), along with training of affected personnel and contractors, form a system to help ensure that operations and maintenance activities are performed safely.  Examples of standard safe work practices at TIMET include: \n       \nForklift Operation                                  Worksaver Operation\nConfined Space Entry                           Lock, Tag & Try\nEmployee Orientation                            Visitor Policy\nRespiratory Program                             Personal Protective Equipment\nFall Protection                                        Hazard Identification\nManagement of Change                        Incident Investigation\nLine Opening/Breaking                          Pre-Startup Safety Review\nHot Work Permit                                    Contractor Safety Program\nBloodborne Pathogen                            Hazard Communication Program\nWork Permit Policies & Procedures\n \nIn addition to the Safe Work Practices listed above, TIMET conducts regular inspections to ensure \ncompliance with Federal, State, and local regulations, and Company loss control requirements.\n \n 3.4 Training\n\nThe intent of this element is to ensure that the materials processed in this facility are handled in a consistent and safe manner.  This is accomplished by having well trained operators and mechanical personnel.  An effective training program will help operators understand the nature and causes of problems arising from the process operations and will increase the employee's awareness with respect to the hazards of a particular process thereby preventing unplanned catastrophic incidents.\n\nTIMET has developed and maintained a comprehensive training program that \nprovides operators with the materials and instruction necessary to ensure that the process units are operated in a safe, efficient and environmental"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 33948,
      "SummaryText": "ly sound manner. The Dept. Managers has overall responsibility for the training program. \n\nTIMET conducts training to ensure that employees have the knowledge, skills, and ability to perform their \ntasks safely and effectively.  The Training Program outlines the requirements and responsibilities for \nestablishing training needs, developing training plans, conducting training, and keeping training records.\n\nIn general, the training program covers:\n\n-  Employee Orientation\n-  Process Overview\n-  Indoctrination\n-  Safety & Health\n-  Area Specific\n-  Job Specific\n-  Emergency Response\n-  Plant Fundamentals\n-  Certification\n-  Management of Change\n-  Refresher Training\n-  Annual Training Plan\n-  Trainer Qualifications/Responsibilities\n-  Plant Training Annual Review.\n\nAll training utilize positive feedback to assure the employee has a good understanding and has \ncomprehended the training provided.  This shall be achieved through both objective and subjective \nassessment.  TIMET maintains records of training, as well as the means used to verify that the employee \nunderstood the training.\n\nThe following is a summary of the operator training program.  The following approach is used to meet the \nRMP standards and to adhere to industry and facility polices:\n\n-  Fundamentals Training: This training program is completed for all new operators.  Included in the \n   curricula  is instruction on (1) the facility organization, (2) general safety, health and environmental \n   standards, (3) general facility rules, (4) process fundamentals, (5) facility process equipment and, (6) \n   overall facility operation. \n-  Process Specific Training: This training is to provide new or experienced operators with the knowledge\n   necessary to master the job duties specific to the operator's job assignment.  This training is\n   accomplished through the use of an operator training guide which includes modules on (1) Introduction\n   and daily rounds, (2) Unit Safety, (3) Unit process overview, (4)"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 33948,
      "SummaryText": "grity requirements for all covered equipment.\n\nSafety, Health, and Environmental Duties:  Although the maintenance personnel are not operating the \nprocess units, their job duties require that they be knowledgeable on the nature of the process chemicals, \nand how to respond to abnormal situations involving hazardous chemicals. This includes responding to \nleaks and spills, wearing and maintaining personnel protective equipment, and housekeeping \nresponsibilities.\n\nAdministrative Duties:  Maintenance personnel are trained to develop and revise maintenance procedures, \ndocument testing and inspection performed; document changes requires as a result of testing and \ninspection.  Issues such as submitting new procedures for approval are also covered.\n\nThe format for the training modules are presented as follows:\n\n-  Classroom sessions utilizing visual aids, videos, charts, drawings, and guest instructors, as applicable.\n-  Field demonstration training to provide hands on familiarity with Mechanical Integrity procedures,\n    inspection, and testing.\n-  Practical training to provide knowledge in how to develop and complete Mechanical Integrity testing \n   forms  and documentation, Preventive Maintenance forms and documentation.\n\nDuring the training sessions, the maintenance personnel will receive reference material corresponding to \nthe training provided, and Mechanical Integrity policies and procedures. \n\nThe same policies as applied to Operator Training for determining the nature of the training, the personnel \nto be trained, and training documentation, and competency testing is also applied to the Mechanical \nIntegrity training. \n \n\n3.6 Incident Investigation\n\nThe purpose of the incident investigation program is to learn the basic causes of incidents.  The Incident \nInvestigation Program covers all incidents and near miss incidents that occur at the facility.  Examples of \nincidents or near misses covered by this policy but not limited to are: occupational injuries an"
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 33948,
      "SummaryText": "d illness, \nproperty damage or loss, and environmental incidents such as spills and releases.\n\nThe purpose of this guideline is to ensure that effective incident reporting and investigation procedures are \ncarried out efficiently.  To be effective, all investigations are conducted in a timely, organized and objective \nmanner.  The purpose of an investigation is not to fix blame, but rather to determine the facts surrounding \nthe incident, present the findings and conclusions, and make recommendations for corrective actions that \nwill prevent a similar occurrence in the future.  All serious incidents will be investigated by an incident \ninvestigation team.\n\nThe Incident Investigation is initiated by the Departmental Foreman or Departmental Supervisor.  The \nDepartmental Manager is responsible for ensuring corrective actions are taken, and the TIMET Safety \nEngineer has the overall responsibility for ensuring the investigation is performed to CAPP and RMP \nstandards, and that all recommendations are addressed in a timely manner.\n\nAn Incident Investigation team is convened for each incident, and will include personnel applicable to the \nparticular incident.  At a minimum, the team consists of at least the Foreman responsible for the area under \ninvestigation, employees involved in the incident, and witnesses to the incident. Other team members may \ninclude the Manager or Area Supervisor, Union Representative, Safety Engineer, and Plant Resources, \ndepending on the level of severity of the incident. .  If the incident involves a contractor, a contractor \nrepresentative may also be part of the team. Other team members may be appointed as needed to conduct a thorough and effective investigation.\n\nInvestigation must be started within 48 hours of the incident.  The \nForeman on duty completes an Incident Investigation Report for all incidents occurring in his or her \ndepartment within this timeframe. The report must contain at least the following:\n\n-  Name of equipment invol"
    },
    {
      "ESSeqNum": 20,
      "FacilityID": 33948,
      "SummaryText": "ved\n-  Name of personnel involved\n-  Date and time of incident / date and time incident reported\n-  Location of the incident\n-  Description of the incident\n-  Immediate and basic cause(s)\n-  Recommendations for controlling or correcting the immediate and basic causes.\n-  Any photographs, drawings and sketches, as necessary, to help explain the incident.\n-  Other details required by RMP\n\nThe report is reviewed by the Plant Manager, Department Manager, and HSEA Manager, and distributed to \nthe appropriate departments, including Medical, Operations, and Safety.  The Safety Department is \nresponsible for ensuring that the applicable Department Manager receives a copy of the report.  The \nDepartment Managers discuss the report as appropriate with their departments.  RMP requires that all \naffected personnel and contractors are made aware of incident investigation report findings.\n\n\n3.7 Compliance Audits\n\nTo help ensure that the accident prevention program is functioning properly, TIMET periodically conducts \nan audit to determine whether the procedures and practices required by the accident prevention program are being implemented.\n\nThe facility will retain the two most recent compliance audits.\n\n\nThe Environmental Engineer is responsible for implementing the Compliance Audit portion of the \nPrevention Program.\n\n\n3.8 Chemical Specific Prevention Steps\n\nThe accident prevention program summarized previously is applied to the Program 2 process at the \nFacility. Collectively, these prevention program activities help prevent potential accident scenarios that \ncould be caused by equipment failures and human errors.\n\nSome of the administrative programs to prevent, detect or mitigate an incident at the Facility are presented \nbelow.  Specific safety equipment and procedures, known as safeguards, are in place at the Facility.  These safeguards are listed as part of the Process Hazard Analyses, process safety information, and in the operating procedures.  Some examples of safeguar"
    },
    {
      "ESSeqNum": 22,
      "FacilityID": 33948,
      "SummaryText": "CAPP will be provided to the \ncommittees.  Employee involvement in aspects of RMP/CAPP activities will be a specific item to be \nreviewed.  Practices that have been successful at TIMET will continue (e.g., employee participation).  \n\nThese are formalized as required by RMP/CAPP in the following:\n\n-  Process Safety Information: This is information deemed essential for Process Hazard Analyses studies,\n    training purposes, operating procedures, etc.  As the information is developed or updated, an employee\n    knowledgeable in the specific process is be asked to assist the review to ensure the information is\n    accurate and precise.\n-  Process Hazard Analysis: All process hazard analysis studies require that an employee knowledgeable \n    in the specific process be a member of the study team.  In addition, TIMET requires that an employee\n    representative be included in the PHA.  If a study must be completed by other than facility personnel,\n    then a review team including an employee knowledgeable in the specific process will be formed to\n    review the study findings.\n-  Operating Procedures: Employees knowledgeable in specific processes will participate in initial and\n    periodic reviewed of the operating procedures.  Knowledgeable employees will also participate in\n    subsequent periodic reviews of operating procedures.\n-  Training:  The Plant Training Steering Team consists of representatives from all levels of the TIMET\n     organization.  The team is responsible for developing the training programs, and recommending specific\n    types and forms of training, as well as the frequency of refresher training.  Modifications to existing\n    training programs will be reviewed with this team, and the composition of the team requires employee\n    representation from various appropriate groups within TIMET.\n-  Pre-Startup Safety Reviews: Employees knowledgeable in the process will participate in all applicable\n    stages of the PSSR process.  Documentation for the r"
    },
    {
      "ESSeqNum": 21,
      "FacilityID": 33948,
      "SummaryText": "ds are:\n\nRelease Prevention\n-  Preventative Maintenance\n-  Inventory control\n-  Safety Interlocks and fail safe control devices\n-  Emergency power\nRelease Detection\n-  Hydrogen Chloride  & Chlorine perimeter detectors\n-  Process area chlorine monitors\n-  Process area carbon monoxide monitors\n-  Facility alarm system to notify personnel in case of emergency\n\nRelease Containment/Control\n-  Overpressure protection for all pressure vessels\n-  Manual and automatic valves to permit isolation of the process\n-  Automated shutdown systems for specific process parameters\n-  Containment around storage tanks to contain liquid materials\n-  Fume elimination preventing carryover of TiCl4 to atmospheric combustion stack.\n-  Chlorine scrubbing towers are used to remove any unreacted Cl2 gas.\n-  Tank vapor recovery system to contain hazardous tank vapors\n-  Operating procedures and list of safe operating limits\n-  Flow limitation devices\n\nRelease Mitigation\n-  Trained emergency response personnel\n-  Safety Showers / Eyewashes\n-  Personal protective equipment (e.g., respiratory protection, eye protection)\n \n\n3.9  Additional Prevention Programs\n\nIn addition to the prevention programs listed in Sections 3.1 to 3.7, TIMET also complies with the Nevada \nCAPP program to implement additional Prevention Program 3 elements.  A brief summary of these \nprograms is provided here.\n\n3.9.1 Employee Participation\n\nThe intent of this element is to involve employees in the development and implementation of the various \nRMP/CAPP element compliance activities.  This involvement is intended to be a cooperative, interactive \neffort that will bring together the best resources at the facility to achieve a sound loss prevention program.  \n\nThe facility Safety Committee and Emergency Response Steering Committees are the primary forum for \ndiscussing and assuring employee participation with the individual elements of the RMP/CAPP standard.  \nAs necessary, an update on the conduct of elements pertaining to RMP/"
    },
    {
      "ESSeqNum": 23,
      "FacilityID": 33948,
      "SummaryText": "emaining stages will be available for review.\n- Mechanical Integrity: A team that includes individuals with appropriate expertise will address aspects off\n    the mechanical integrity provisions of the standard.  Maintenance and Inspection personnel with\n    requisite knowledge and expertise are members of this team.\n- Incident Investigation: TIMET's practice to include employee representatives in the conduct of any formal\n    incident investigation.  This practice continues and is adequate to meet all requirements of the \n    RMP/CAPP standard. TIMET also communicates the finding of the incident investigation to any \n    affected employees.\n\nAll employees will have access to process hazard analyses and other information developed under the \nrequirements of RMP/CAPP rules.  Employees or representatives that require access to information not \nreadily available at their work site may make arrangements through their supervisor and the proprietor of \nthe information for an opportunity to review this information.\n\n3.9.2 Contractor Safety\n\nIt is the TIMET philosophy that all injuries are preventable.  This applies to all personnel on the Henderson \nsite whether they are TIMET employees or Contractor employees.  This policy is intended to evaluate, \nmonitor, and control contractor safety performance within the plant facility.  The system includes pre-\naward safety evaluation of contractors, contractor safety orientation, required contractor activities to \npromote safety, periodic contractor safety audits, monitoring of contractor injury/illnesses, and on-the-job \nand post-job evaluations.\n\nContractors are trained by onsite personnel about the hazards of the process, safety procedures and \nequipment requirements, and the emergency response procedure onsite prior to commencement of work.  \nAll contractors scheduled to work at TIMET will receive General Safety Orientation to the plant, and \nProcess Overview training specific to the area in which the work will be performed.  T"
    },
    {
      "ESSeqNum": 25,
      "FacilityID": 33948,
      "SummaryText": "n MOC is required when changing operating conditions outside of the\n   established limits (including test runs).\n\nAs a minimum, the MOC approval process must consider the following:\n\n- Technical basis for the change.\n- Health and safety considerations.\n- Impact on procedures (operating, maintenance, and safe practices).\n- Codes and standards.\n- Necessary time period for the change.\n- Justification of the change versus risk.\n\nGeneral guidelines for a MOC request are as that all employees and contract employees are trained to \nunderstand the concept of MOC.  They are expected to use these principles in their daily activities.  They \nare taught to understand what is meant by change, and recognize and identify such changes.\n\nMOC principles apply to both permanent and temporary changes.\n\nThe MOC process is a communications loop to assure that the change is approved, all process safety \ninformation and procedures have been changed as necessary, and training completed.  The MOC process \ncan take the form of one of the following:\n\n- Minor Change\n- Moderate Change\n- Major Change\n\nWhile an MOC request can be initiated by anyone, overall implementation of MOC is the responsibility of \nthe HSEA Manager.  Department Managers ensure the department personnel are trained in the use of the \nMOC process, and that MOCs in their area receive the appropriate review. \n\n3.9.4 Pre-Startup Safety Reviews (PSSRs)\n\nThe purpose of this program is to systematically ensure the safety of new and significantly modified \nfacilities before placing those facilities into service.  PSSR checks that process equipment and plant \npersonnel are ready to safely start and maintain process operations.  This is a final check that all important \nconsiderations have been taken into account before start-up.\n\nThis program is designed to satisfy the RMP requirements regulation and meet all parts of the \ncompliance guidelines.  The scope of the review process is as follows for all new facilities or modified \nfacilit"
    },
    {
      "ESSeqNum": 26,
      "FacilityID": 33948,
      "SummaryText": "ies where a change in the PSI has occurred:\n\n- Construction and equipment in accordance with design standards\n- Safety, operating, maintenance and emergency procedures are in place and accurate \n- For new facilities, a PHA was performed and recommendations resolved or implemented before startup.\n- Modified facilities meet MOC requirements\n- Training of employees involved in operating the process is complete.\n- The Area Production Supervisor or delegate is responsible for the PSSR\n\nThe Department Managers implement and maintain the PSSR program for their specific area.  Other plant \npersonnel may assist in PSSRs by performing specific verifications and reviews in their areas of expertise.  The Engineering Manager coordinates the PSSR activities as required by the Management of Change program, or other regulatory requirements at the facility.\n**************************************************************************************\n******************************************\n\n4.0  Emergency Response Program Summary\n\nTIMET's Emergency Planning and Response Program provides resources for planning for and response to \nemergencies at the facility.  TIMET contributes to the community by protecting the plant and neighbors \nfrom the potentially damaging effects of emergency situations.  The Emergency Response Plan has been \ncoordinated with the Local Emergency Planning Committee (LEPC), and reviewed by members of \nsurrounding industrial community.\n\nThe facility design, maintenance, operating procedures, and training provide for risk minimization before \nan accident can occur.  In spite of all these things, emergencies can arise, sometimes through forces beyond control.  The Emergency Response Plan, along with training and drills, is designed to prepare the facility to recognize emergency situations of various types and react promptly and correctly to minimize any ill effects.  Local, State, and Federal safety rules dictate that the facility study and understand the principles and"
    },
    {
      "ESSeqNum": 24,
      "FacilityID": 33948,
      "SummaryText": "he Safety \nOrientation includes Rules of Conduct, Emergency Procedures, HazCom, Nevada CAPP Program, \nRespiratory Protection, and Personal Protective Equipment.\n\nA Visitor/Contractor Safety Orientation Card is issued to each contract employee, and documents that \nhe/she has received and understood the information provided by TIMET.\n\nPrior to starting work, contractors performing operations at the Facility must complete the Pre-Work \nSafety Review Checklist.  Contractors must also provide basic safety training to their own employees as \nrequired by State and Federal Regulations.  Contractors are advised of TIMET's communication program.\n\nThe Contractor safety and health program requirements are commensurate with the type of work, \nassociated risk, potential exposure of employees, and cost benefit analysis.  Contractors that are at a greater risk of exposure to hazards, such as maintenance Contractors in process areas, will require a program and plan that is different from those in lower risk activities such as janitorial, delivery materials, or engineering. \n\nContractor Safety and contractor evaluation is the responsibility of the Maint. Manager.\n\n3.9.3 Management of Change\n\nThe intent of this procedure is to assume that all modifications to equipment, procedures, raw materials and processing condition other than replacement in kind are safe.\n\nThis policy applies when one of the following changes are made:\n\n- Process chemical or feed stock change.  An MOC is needed when making a change in process\n  chemicals or process unit feed stocks that falls outside a defined range of properties.\n- Process technology.  An MOC is required when changes to the method of processing the chemicals are\n   proposed. \n- Equipment change. An MOC is needed when making changes to process facilities and other than\n   replacement in kind.\n- Process Systems and Controls. An MOC may be needed when changes are made to maintenance,\n   operating or emergency procedures.\n- Operating Procedures. A"
    },
    {
      "ESSeqNum": 28,
      "FacilityID": 33948,
      "SummaryText": "course of normal operations by the local area\n                              operators \n                           * Does not pose an offsite impact; \n                           * Does not exceed Reportable Quantities (RQ) or is not required  to be reported by \n                              regulations.\n\nLevel 2               * Any incident requiring an organized TIMET ERT response from outside the local \n                             facility or area where the incident occurs \n                           * Does not pose an offsite impact; \n                           * Exceeds the Reportable Quantity (RQ) limits or is required to be reported by regulations.\n\nLevel 3               * Any incident requiring an organized TIMET ERT response from outside the local \n                              facility or area where the incident occurs \n                          * Poses an offsite impact\n                          * Large chemical release, which exceeds the Reportable Quantity (RQ) limits or is required\n                             to be reported by regulations\n\nAll employees and contractors are provided with General Awareness training.  Additional training is \nprovided to operations staff to enable active response to site emergencies.\n**************************************************************************************\n\n5.0  Management Systems\n\nThe Plant Manager is ultimately responsible for implementation of the risk management measures set forth \nin this document.  The Henderson Environmental Engineer is responsible for upkeep of the Risk \nManagement Plan and Hazard Assessment, and all supporting documentation.  The individual departments \nassigned in Section 3.0 above implement each element of the Prevention Program.\n\nContact Name\nCraig Wilkinson - Western Regional Director, HSEA\n702-564-2544 ext. 453"
    },
    {
      "ESSeqNum": 27,
      "FacilityID": 33948,
      "SummaryText": "specifics covered in this preplanning effort and fully understand all roles in the plan.\n\nThe purpose of this Emergency Plan is to provide a cohesive procedure for coordinating effective response procedures by all plant personnel in order that danger to employees, contractors, the general public and the environment may be lessened in the unlikely event of an emergency.\nThe Emergency Plan is also intended to meet the emergency planning requirements of the following \nregulations:\n\nNevada's Chemical Accident Prevention Program                NRS 459.380 - 459.3874\nEPA's Risk Management Program Regulation                        40 CFR Part 68\nEPA Notification Requirements                                              40 CFR Part 302.6\nEPA Emergency Release Notification                                    40 CFR Part 355.40\nNevada OSHA                                                                       NRS 618\nOSHA's Emergency Action Plan Regulation                          29 CFR 1910.38 (a);\nOSHA's HAZWOPER Regulation                                           29 CFR 1910.120;\nEPA's Resource Conservation and                                       40 CFR part 264, Subpart D\nRecovery Act Contingency Planning Requirements              40 CFR Part 265, Subpart D, &\n                                                                                               40 CFR 279.52.\n\nTIMET also utilizes perimeter monitors and process monitors to aid in expediting a response to a leak.  \nPerimeter monitors are annunciated in the security office, and the security personnel contact the on-shift \nIncident Commander. The Incident Commander  determines the level of response required for the incident: \nincidents are categorized as follows:\n\nEmergency Response Levels\nLevel                Severity\n---------------------------------------------------------------------------------------------------------------------------------\nLevel 1               * A minor incident that can be handled in the"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 33948,
      "SummaryText": "Specific unit equipment, and (5)\n   Emergency Procedures.\n-  Job Specific Training: This training is to provide new or experienced operators with the skill to master \n   the job duties specific to the operator's classification.  This includes training on all relevant operating\n   procedures necessary for them to safely and effectively perform the duties associated with their \n   specific job assignment.\n-  Refresher/Requalification Training: This training is designed to maintain the qualified operator's\n    knowledge at a level that assures the operator's duties are performed in a safe and effective manner. \n    This is accomplished through review of procedures, equipment, MOCs and training on new or modified\n    unit equipment or systems.\n-  Compliance Training: This training is to provide the employees with necessary safety, health and\n    environmental knowledge to meet the intent mandated by law.\n\nFormat:  Various techniques will be used for the training sessions.  They will be presented in following \nmanner:\n\n-  Classroom sessions utilizing visual aids, videos, charts, drawings, and guest instructors, as applicable.\n-  Field training to provide hands on familiarity with new and modified equipment and systems as they \n   are introduced to operating units.\n-  Control room procedural and systems reviews on an ongoing basis, to provide operator refresher and\n    systems review training.\n-  Training packages and discussion review sessions during monthly safety meetings.  A compliance\n    training matrix is developed annually to assure that each employee receives the necessary training\n\nRefresher training is an ongoing process, which will be summarized at least every three years.  All \nemployees are encouraged to provide input through their the Training Steering Committee regarding the \nfrequency of refresher training.\n\n3.5 Maintenance\n\nThe objective of the Maintenance Program is to assure the mechanical integrity, safe, reliable operation and \nrepairs to equipment"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 33948,
      "SummaryText": "; to document the condition of pressure vessels, heat exchangers, boilers, pipes, and \nother process equipment; and to comply with applicable State and Federal regulations.  The Maintenance \nprogram includes a Preventive Maintenance program, and Inspection program, and a Testing program.  The \nManager of the Engineering and Maintenance Department is responsible for the Mechanical Integrity \nProgram.\n\nThe Maintenance Program ensures that the Facility uses appropriate inspection and testing methods to \ndetermine the condition of pressure vessels, heat exchangers, boilers, pipes and other process equipment; recommend necessary repairs; perform proper preventive maintenance; assure quality of new fabrication / construction; and assure fitness for service of maintenance materials and spare parts.  Equipment covered by this Program is listed in a computer database maintained by the Maintenance Department. \n\nInspection and testing shall be conducted per the codes and standards to which the equipment was design, and good engineering practices.\n\nInspection and testing (NDE / NDT) methods used may include (but are not limited to) any of the \nfollowing:\n\n-  ultrasonic\n-  radiography\n-  hardness\n-  visual\n-  metallagraphy\n \nDeterminations made from inspections may include any of the following:\n-  suitability for continued service\n-  nature of corrosion and corrosion rates\n-  replacement date\n-  vessel reinspection date (based on calculated remaining life)\n-  condition of internal / external insulation and / or coatings\n-  condition of foundation and anchor bolts\n-  condition of fireproofing\n\nThe information regarding the Maintenance program for all areas is contained within the Computerized \nMaintenance Management System (CMMS) maintained by the Maintenance Department.  \nA team of engineers and maintenance personnel ensure that the information contained within this \ndatabases, such as testing methods and frequency, comply with good engineering practices.\n\n3.5.1 Mechanical Integ"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 33948,
      "SummaryText": "rity Training \n\nIn addition to the general training provided for all facility employees, the Mechanical Integrity training \nprogram is specifically designed to train Maintenance personnel on issues specifically relating to the \ninspection, testing, and maintenance of process equipment.  \n\nThe intent of the Mechanical Integrity training program is to ensure that all equipment that is integral to \nprocessing or storing hazardous materials is maintained in a consistent, reliable manner.  This is \naccomplished by having maintenance personnel who are educated in the requirements for mechanical \nintegrity of the facility equipment.\n\nThe Maintenance and Engineering Department has developed \na comprehensive training program to accompany the testing and inspection program as described above. \nTIMET provides the training to ensure that all maintenance employees have the knowledge, skills, and \nability to fully implement the mechanical integrity program.  \n\nThe Mechanical Integrity Training Program outlines the objectives of the maintenance personnel regarding \ntheir core competencies.  The Mechanical Integrity Training Program includes:\n\n-  Regulatory requirements for Mechanical Integrity\n-  Categorizing process equipment types\n-  Application and format of maintenance procedures\n-  Requirements for inspection, testing and documentation of process maintenance activities\n-  Requirements for correcting equipment deficiencies\n-  Quality assurance requirements for new plants and equipment\n\nThe topics for the inspection and testing program include the following:\n\nRoutine Job Duties:  This covers subjects such as communication between shifts, how to handle work \norders; ordering parts and materials and how to perform routine scheduled testing and inspection \nrequirements such as crane repairs, installing conduit, etc.\n\nNon-Routine Job Duties:  This covers testing and inspection of critical equipment as scheduled, including \nthe specific steps required to complete the mechanical inte"
    }
  ]
}