{
  "FacilityID": 34017,
  "FacilityName": "M&M/Mars-Burr Ridge",
  "FacilityStr1": "660 79th Street",
  "FacilityStr2": null,
  "FacilityCity": "Burr Ridge",
  "FacilityState": "IL",
  "FacilityZipCode": "60521",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17043",
  "LEPC": "Dupage County LEPC",
  "FacilityLatDecDegs": "41.746667",
  "FacilityLongDecDegs": "-087.931333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3250685,
  "ParentCompanyName": "Mars, Incorporated",
  "Company2Name": null,
  "CompanyDUNS": 3250685,
  "Company2DUNS": 0,
  "OperatorName": "Masterfoods USA",
  "OperatorStr1": "15W660 79th Street",
  "OperatorStr2": null,
  "OperatorCity": "Burr Ridge",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60527",
  "OperatorZipCodeExt": null,
  "RMPContact": "James Neumann",
  "RMPTitle": "Technical  Manager",
  "FTE": 225,
  "OtherEPAFacilityID": "60521DVNTR15W",
  "EPAFacilityID": "100000038513",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-05-06 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Burr Ridge Facility",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 41.74505,
  "FRS_Long": -87.94443,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 49012,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 34017,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 50133,
          "ProcessID": 49012,
          "NAICSCode": "31152",
          "_desc": {
            "NAICS_CODE": "31152",
            "NAICS_DESCRIPTION": "Ice Cream and Frozen Dessert Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 64607,
          "ProcessID": 49012,
          "ChemicalID": 56,
          "Quantity": 100000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 564607,
          "ProcessID": 49012,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34017,
      "SummaryText": "1. Facility Description and Regulated Substance\n\nMasterfoods USA, a division of Mars, Incorporated (hereinafter \"the Company\") operates a premium ice cream and confectionery products manufacturing facility in Burr Ridge, Illinois.  The production of ice cream products requires the use of sophisticated refrigeration technology.  The plant utilizes anhydrous ammonia, which is the most widely-used refrigerant in production-scale facilities that require reliable refrigeration capacity.  The facility has more than a threshold quantity of anhydrous ammonia, as specified in the Risk Management Plan (\"RMP\") regulations adopted by the U.S. Environmental Protection Agency (\"EPA\"), in its refrigeration systems. \n\n2. Accidental Release Prevention and Emergency Response Policies\n\nThe Company is strongly committed to the safety of all persons that work in the plant, as well as to the protection of the surrounding environment and community.  The Burr Ridge facility has committed substantial resources to the engineering and design of its refrigeration systems to minimize the likelihood of accidental releases and to minimize the risk to Company associates, the local community, and the surrounding environment.  This commitment is demonstrated by the plant's comprehensive accidental release prevention program, which covers such areas as design, installation, contractor selection, operating procedures, predictive and preventative maintenance, inspection and employee training.  Controls and instrumentation (alarms, pager alert system and automatic shutdown devices) are also utilized to prevent any potentially unsafe condition.  If a release does occur, plant personnel are trained and equipped to provide an almost instantaneous response, and when necessary, to coordinate with local emergency response teams to control and mitigate the effects of the release. \n\n3. The General Accidental Release Prevention Program\n\nThe plant complies with all applicable federal, state, and local accident pr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34017,
      "SummaryText": "evention regulations and codes, including the OSHA PSM rule.  Notably, the plant maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.  The facility also regularly conducts comprehensive studies using a Checklist, What-if/Checklist approach to ensure that hazards associated with all processes are identified and controlled efficiently.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at regular intervals.  Any findings related to the hazard analysis are addressed in a timely manner.  The plant maintains and adheres to written operating procedures. These procedures are regularly reviewed and made readily accessible to operators involved in the affected processes.  The plant has a comprehensive training program in place to ensure that the responsible associates are competent in the operating procedures associated with these processes. The plant conducts regular, documented maintenance checks on process equipment to ensure proper operations.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner. \n\n4. Five-year Accident History\n\nDuring the past five years, there have been no accidental releases of ammonia resulting in death, injuries, or significant property damage onsite, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n5. Emergency Response Program\n\nThe plant has a written emergency response plan to respond to accidental releases of anhydrous ammonia. The plan is designed to minimize the potential for adverse effects of chemical exposure on human health through a combination of containment, control, evacuation procedures, and the use of personal protective equipment.  The plan addresses all aspects of emergency response including first aid and medical treatment, evac"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34017,
      "SummaryText": "uations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas. The plant supports an internal Emergency Organization that receives yearly training and participates in mock release scenarios. To ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.  The plant has coordinated its emergency planning efforts with the local, Tri-State Fire Department. \n\n6. Planned Changes to Improve Safety\n\nSeveral developments and findings have resulted from the implementation of the various elements of the plant's accidental release prevention program.  The Company is committed to constant improvement in this area.  No changes to current plans and procedures are contemplated at this time.  Regular, periodic reviews of safety and release prevention and preparedness measures will continue to occur."
    }
  ]
}