{
  "FacilityID": 34011,
  "FacilityName": "Georgia Gulf Chemicals & Vinyls, LLC - OKC Plant",
  "FacilityStr1": "5200 SE 59th Street",
  "FacilityStr2": null,
  "FacilityCity": "Oklahoma City",
  "FacilityState": "OK",
  "FacilityZipCode": "73135",
  "Facility4DigitZipExt": "4536",
  "FacilityCountyFIPS": "40109",
  "LEPC": "Oklahoma County LEPC",
  "FacilityLatDecDegs": "35.400833",
  "FacilityLongDecDegs": "-097.432778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "P2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ggc.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 115359416,
  "ParentCompanyName": "Georgia Gulf Corporation",
  "Company2Name": null,
  "CompanyDUNS": 120957840,
  "Company2DUNS": 0,
  "OperatorName": "Georgia Gulf Chemicals & Vinyls",
  "OperatorStr1": "5200 SE 59th Street",
  "OperatorStr2": null,
  "OperatorCity": "Oklahoma City",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "73135",
  "OperatorZipCodeExt": "4536",
  "RMPContact": "J.M. Huckabay",
  "RMPTitle": "EHS Manager",
  "FTE": 46,
  "OtherEPAFacilityID": "OKD071226344",
  "EPAFacilityID": "100000094284",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-10-23 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-06-27 00:00:00",
  "DeRegistrationEffectiveDate": "2009-01-01 00:00:00",
  "AnniversaryDate": "2009-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 35.4025,
  "FRS_Long": -97.42972,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 49003,
      "AltID": "PVC Resin Production",
      "FacilityID": 34011,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 50124,
          "ProcessID": 49003,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 64598,
          "ProcessID": 49003,
          "ChemicalID": 101,
          "Quantity": 6000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 101,
            "ChemicalName": "Vinyl chloride  [Ethene, chloro-]",
            "CASNumber": "75-01-4",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 564598,
          "ProcessID": 49003,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34011,
      "SummaryText": "The Georgia Gulf - Oklahoma City Plant has a long history of safe operation in the Oklahoma City community.  Our employees work hard every day to provide a safe work place and protect the environment both inside and outside of our fences.\n\nPlant Information\n\nThe Oklahoma City Plant produces Polyvinyl Chloride (PVC) resin.  Although there are many different uses for PVC, the Oklahoma City Plant product is used primarily by the vinyl siding and PVC pipe markets.\n\nThe Oklahoma City Plant produces PVC resin by polymerizing vinyl chloride monomer (VCM).  After the polymerization step is complete, the resin is dried and stored for shipping to our customers.  Most of the vinyl chloride monomer that we consume is shipped to us by rail from the Georgia Gulf vinyl chloride plant in Lake Charles, Louisiana.  Vinyl chloride monomer is gas at normal conditions, but is kept under pressure and handled as a liquid much the same way that propane gas is handled.  At certain concentrations, VCM is flammable and we have many safety systems in place to deal with this hazard.\n\nAccident History\n\nNo incidents have occurred at the Oklahoma City Plant requiring reporting under the EPA Risk Management Plan.\n\nAccident Prevention\n\nAccident prevention is a large part of every job at the Oklahoma City Plant.  We work hard to make sure that our systems, procedures and people are all working together to prevent accidents from occurring.  To ensure safe operations of our plant, we have many systems in place including:\n\n? Two independent gas detection systems (air monitors)\n? Routine program audits for improvement\n? Relief valves for relieving excess pressure\n? Tank containment systems\n? Computer process control systems\n? Equipment corrosion monitoring programs\n? Formal Equipment Inspection Programs\n? Automatic heat detector shut down system\n? Automatic (fail closed) isolation valve systems \n? Formal incident reporting and investigation system\n? Vibration Monitoring to predict equipment life and plan"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34011,
      "SummaryText": " maintenance\n? Quality Assurance and Control Processes\n? Emergency back-up power supply\n? Management of Change procedures with complete reviews, including hazard analysis and pre-startup safety reviews\n? Infrared testing of electrical and heat-producing equipment\n? Thermal oxidizer for combusting vinyl chloride vapors\n? Computer-based maintenance planning and tracking system\n? Process-qualified personnel\n? Extensive Maintenance Procedures\n? Extensive Operating and Emergency Shut Down Procedures\n? Preventative and Predictive Maintenance Programs\n? Detailed employee training courses with testing and skill examinations\n? Automatic deluge (water spray) systems, sprinkler systems, and fire pumps\n? Extensive safety, health, and environmental programs and procedures including the ACC Responsible Care Program.\n\nEmergency Response\n\nAlthough we hope we never respond to an emergency, the Oklahoma City Plant actively prepares for the unexpected.  Our emergency preparedness efforts focus on four key areas:\n\nPersonnel ? The Oklahoma City Plant is protected by a 12-member volunteer emergency Response Team (ERT) comprised of employees from various plant departments.  The ERT provides fire suppression, confined space/industrial rescue, emergency medical, and hazardous materials response services.  In addition to on-site training, outside courses are an integral part of team training. Members attend Emergency Medical Training at Oklahoma City Community College and Fire/Rescue Training at Refinery Terminal Fire Company in Corpus Christi, TX. \n\nResources - Fixed emergency equipment at the Oklahoma City Plant includes an emergency siren and pager system to alert responders, two diesel powered emergency generators, one diesel powered emergency air compressor, automatically-activated diesel powered fire pumps, automatic deluge (water spray) systems, automatic sprinkler systems, smoke detector system, two gas detector systems, and an automatic heat detector shut down system.  Portable equi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34011,
      "SummaryText": "pment includes fire monitors, hose lines, fire extinguishers, hand-held gas detectors, firefighter protective clothing and breathing apparatus, confined space/rope rescue equipment, emergency medical care supplies, and hazardous materials response equipment. \n\nPlanning/Drills ? The Oklahoma City Plant has an extensive Emergency Response Plan for on-site incidents.  The plan was developed in coordination with the Oklahoma County Local Emergency Planning Committee and the Oklahoma City Fire Department.  \n\nEmergency drills and exercises are a must to ensure member skills are maintained at peak efficiency and equipment and procedures function as expected.  The plant conducts regular drills and exercises to ensure the emergency system undergoes continuous improvement.  \n\nResponse Alliances ? The plant works closely with the Oklahoma City Fire Department, Oklahoma County Local Emergency Planning Committee, Oklahoma County Department of Emergency Management and the Oklahoma City Department of Emergency Management to ensure that sufficient resources will be available during an emergency.  Outside responders have participated in plant pre-planning and familiarization sessions in the event that they are called on to provide assistance.\n\n\nThe Georgia Gulf Oklahoma City Plant is proud of the fact that we have never experienced a hazardous material release resulting in impact on our neighbors.  With our safety systems and employees working every day to prevent chemical accidents, we are confident that this record of safe operation will continue in the future."
    }
  ]
}