{
  "FacilityID": 34022,
  "FacilityName": "Circle S Foods, Inc.",
  "FacilityStr1": "253 Butterball Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Teachey",
  "FacilityState": "NC",
  "FacilityZipCode": "28464",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37061",
  "LEPC": "Duplin County LEPC",
  "FacilityLatDecDegs": "34.755833",
  "FacilityLongDecDegs": "-078.051944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Circle S Ranch",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Circle S Foods, Inc.",
  "OperatorStr1": "253 Butterball Rd",
  "OperatorStr2": null,
  "OperatorCity": "Teachey",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28464",
  "OperatorZipCodeExt": null,
  "RMPContact": "Russell  Williams",
  "RMPTitle": "Plant Manager",
  "FTE": 411,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000120834",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-05-19 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-03-13 00:00:00",
  "DeRegistrationEffectiveDate": "2017-02-27 00:00:00",
  "AnniversaryDate": "2009-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 41.83265,
  "FRS_Long": -88.03288,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility Accident. Fire Destroyed Main Building",
  "_processes": [
    {
      "ProcessID": 49021,
      "AltID": null,
      "FacilityID": 34022,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 50142,
          "ProcessID": 49021,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 64617,
          "ProcessID": 49021,
          "ChemicalID": 56,
          "Quantity": 40711.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 564617,
          "ProcessID": 49021,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34022,
      "SummaryText": "1.0  RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nFacility Name:  Circle S Foods, Inc. \n\nThe Circle S Foods facility in Teachey, NC has a good record in preventing releases of anhydrous* ammonia.  As part of our release prevention program, the plant has implemented a preventive maintenance program.  More information about these aspects of the prevention program is discussed in Section 4.0 of this executive Summary.\n\nThe facility has implemented an Emergency Action/Response Plan which provides information and guidance to safely deal with an ammonia release.  This emergency response program is all encompassing, covering all facets of known or potential emergency situations which could possibly develop such as fire, medical, hazardous materials, bomb threats, and acts of nature.  The emergency response policies at the facility ensure that there is emergency response coverage 24 hours - 7 days per week.\n\n*From this point in the Executive Summary, anhydrous ammonia will be synonymous with ammonia.\n\n2.0  PROCESS DESCRIPTION AND REGULATED SUBSTANCES\nThe Circle S Foods facility eviscerates turkeys and produces whole turkey products for retail sale.  The NAICS code for the processes at this facility is 311615.  Many areas of the plant are refrigerated to preserve the meat products.  Circle S Foods has one regulated substance under 40 CFR 68:  ammonia.  Ammonia is used as a refrigerant in the refrigeration of the products in the various areas of the plant.\n\nThe ammonia threshold for triggering applicability to 40 CFR 68 is 10,000 pounds.  The total quantity of ammonia stored in the refrigeration process is documented as approximately 40,711 pounds.  The process exceeds the threshold quantity of 10,000 pounds as set by 40 CFR 68 and thus is regulated by the Risk Management Program.\n\nAmmonia is classified as a Group 2 Refrigerant per ASHRAE Standard 34-1989.  The dominant characteristic of this chemical is its toxicity.  It is a self-alarming chemical by its distinctive "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34022,
      "SummaryText": "pungent odor.  Due to this odor, persons exposed to ammonia vapor will not voluntarily stay in areas of even small concentrations.  Ammonia will burn at a very narrow and high range of concentrations accompanied with a high ignition temperature.  Although ammonia is not poisonous, it is corrosive to human tissue.  Ammonia is readily absorbed into the moisture of the skin and, at high concentrations, can cause severe burns.\n\nThe risks to persons in an accidental release of ammonia include:\n\n1.  Corrosive attack of skin and other tissue (including lung tissue)\n2.  Freezing of skin and other body tissue when contacted by liquid ammonia.\n3.  Eye contact.\n\n\n4.0 GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nCircle S Foods has developed an OSHA (PSM) program for their ammonia refrigeration system.  At Circle S Foods, ammonia falls under the RMP Program 3 Prevention Program which is identical to the OSHA PSM program.  EPA has said that if the process is in compliance with OSHA PSM, then it is in compliance with RMP Program 3.  Thus, Circle S Foods' ammonia PSM system has been reviewed and the PSM system elements are being implemented for the RMP document.\n\nListed below are the key aspects of the ammonia prevention program:\n\nThe Circle S Foods facility uses a Computerized Maintenance Management System (CMMS) for control scheduling and accomplishment of preventive maintenance on components of the refrigeration system.  The scope of preventive maintenance (PM) and testing/inspection (T/I) for refrigeration components is based on individual vendor recommendations and generally accepted engineering practices with regard to types of preventive maintenance and inspections and their recommended frequencies.  Individual work tasks for each type of PM and T/I associated with the refrigeration system are being created.  These tasks are included on the individual work order generated by CMMS.  This system ensures that each operator mechanic is aw"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34022,
      "SummaryText": "are of the pertinent safety precautions required for a PM procedure as well as the step-by-step actions required to complete the procedure.  The operator/mechanic and their supervisor sign off on the completed work order.  If specific results of each PM and T/I are not completed satisfactorily, the operator/mechanic will note it on the work order, and a follow-up work order is generated to address the specific deficiency.\n\n5.0  FIVE YEAR ACCIDENT HISTORY\n\nThe review of the facility's accident history includes the following range of dates:  June 1, 1999 - June 21, 2004.  According to 40 CFR 68.42(a), there have been no accidental releases at this facility.\n\n6.0  Emergency Response Program\n\nAs mentioned previously, the Circle S Foods facility has developed an Emergency Action/Response Plan.  The emergency plan is a detailed document which discusses the role of employees in an emergency situation.  The plan outlines specific procedures for evacuations of plant personnel.\n\nThe Emergency Action Plan contains specific information regarding: purpose, local emergency phone numbers, coordination with local authorities, training, emergency response plan outline, organization, communication, site security, USDA notification, plant evacuation plan, emergency evacuation routes, visitors/contractors, news media, evacuation drills, and critique of emergency response, hazardous substances, rescue and medical duties, emergency recognition and prevention, decontamination, PPE and emergency equipment, and EPA release reporting procedures.\n\n7.0  PLANNED CHANGES TO IMPROVE SAFETY\n\nBased on the completed Process Hazard Analysis (PHA) update for ammonia and a 5 year Mechanical Integrity Audit, a list of action items to improve safety was developed and their status monitored to ensure that implementation is accomplished.  An example of safety improvements made at the plant is discussed below:\n\nThe facility has completed several projects to improve the safety and efficiency of the ammonia r"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 34022,
      "SummaryText": "efrigeration system.  These include the replacement of a Screw Compressor and an Ice Machine.  The Ice Machine replacement reduced the amount of equipment inside the facility and the hazards associated with them.  Additionally, unused rechillers and associated piping have been removed from the facility processing areas."
    }
  ]
}