{
  "FacilityID": 34047,
  "FacilityName": "Vitafoam, Incorporated",
  "FacilityStr1": "1665 South Veterans Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Tupelo",
  "FacilityState": "MS",
  "FacilityZipCode": "38804",
  "Facility4DigitZipExt": "1767",
  "FacilityCountyFIPS": "28081",
  "LEPC": "Lee County LEPC",
  "FacilityLatDecDegs": "34.235944",
  "FacilityLongDecDegs": "-088.684556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 627990252,
  "ParentCompanyName": "Vita Incorporated",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Vitafoam Incorporated",
  "OperatorStr1": "P.O. Box 1767",
  "OperatorStr2": null,
  "OperatorCity": "Tupelo",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "38802",
  "OperatorZipCodeExt": "1767",
  "FTE": 130,
  "OtherEPAFacilityID": "MSD981030984",
  "EPAFacilityID": "100000038149",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "154000046",
  "SafetyInspectionDate": "2004-04-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 34.233511,
  "FRS_Long": -88.686922,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 49054,
      "AltID": "Foam Manufacturing",
      "FacilityID": 34047,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 64653,
          "ProcessID": 49054,
          "ChemicalID": 77,
          "Quantity": 450000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 50175,
          "ProcessID": 49054,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 18922,
              "Process_NAICS_ID": 50175,
              "SafetyReviewDate": "2003-02-01 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "Yes",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "In-house",
              "FR_Comments": null,
              "HazardReviewDate": "2004-02-01 00:00:00",
              "ChangeCompletionDate": "2004-02-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Detection for TDI release",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Pressure Sensors",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Security Guard",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-02-01 00:00:00",
              "TrainingReviewDate": "2004-02-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Overall safety training session",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Oral question and answer demonstration",
              "MaintenanceReviewDate": "2004-02-01 00:00:00",
              "EquipmentInspectionDate": "2004-04-13 00:00:00",
              "EquipmentTested": "IH Testing",
              "ComplianceAuditDate": "2003-02-01 00:00:00",
              "AuditCompletionDate": "2003-02-28 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 19745,
                  "PreventionProgram2ID": 18922,
                  "ProcessChemicalID": 64653
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 34047,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-03-01 00:00:00",
    "ERTrainingDate": "2004-05-01 00:00:00",
    "CoordinatingAgencyName": "Lee  County Emergency Planning Comm",
    "CoordinatingAgencyPhone": "6628419020",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34047,
      "SummaryText": "RMP Report For Vitafoam Incorporated\n\nExecutive Summary\n\n§68.155 \n(a) Accidental Release Prevention & Emergency Response Policies\n\nVitafoam Incorporated (Vitafoam) is committed to protecting facility personnel, the public, and the environment from any workplace and accidental release hazards.  Appropriate responses to releases of toluene diisocyanate (TDI) are documented in Section 7 (Emergency Response) of the Risk Management Program document.  Safety, environmental protection, and risk management programs are fully implemented and coordinated with community emergency responders for emergency planning and response efforts.\n\n(b) Stationary Source and Regulated Substances Handled\n\nVitafoam is a flexible polyurethane foam manufacturing facility located in Tupelo, Mississippi.  As a result of the manufacturing process, the regulated chemical TDI is present at the facility at greater than 10,000 pounds.  The facility has one covered process that requires the facility to meet Program 2 requirements of the Risk Management Program (RMP) regulations.\n\nTDI is delivered to the facility via railcars and offloaded into storage tanks.  In the process, TDI is used in the production of polyurethane foam.  The facility manufactures polyurethane foam by the vigorous mechanical mixing of polyols with TDI along with water, catalyst, and surfactants.  The resultant polymetric network is expanded with carbon dioxide which is formed in the reaction between the water and TDI.\n\n(c) General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nProcess Safety Information ¿ Up-to-date process safety information is maintained for use by employees operating the covered process in accordance with 40 CFR 68.48, including the following:\n¿The MSDS for TDI that contains toxicity information, permissible exposure limits, physical data, reactivity data, thermal and chemical stability data and synergistic effects from mixing process flows.\n¿Block flow diagrams for the covered pr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34047,
      "SummaryText": "ocess.\n¿Process chemistry and maximum intended inventory data for the covered process.\n¿Safe operating limits and evaluation of consequences of deviations from these limits for the covered process.\n¿Covered process equipment information consisting of materials of construction; piping and instrumentation diagrams (P&IDs); electrical classification; relief system design and design basis; ventilation system design; design codes and standards employed; and safety systems (interlocks, detection or suppression systems).\n\nProcess Hazard Analysis ¿ A Process Hazard Analysis (PHA) has been performed for the TDI covered process at Vitafoam in accordance with 40 CFR 68.50.  The hazard review was performed using What-If/Checklists.  The hazard review identified the hazards associated with the regulated TDI process; causes of potential accidental release scenarios; safeguards used to prevent accidental releases; and methods used to detect, monitor or control accidental releases.  Any issues identified during the PHA were documented and will be resolved in a timely manner.  The hazard review will be revalidated and updated once every five years following the completion of the initial hazard review.\n\nOperating Procedures ¿ Detailed and up-to-date process operating procedures have been developed and are maintained for the covered process in accordance with 40 CFR 68.52.  Operating procedures provide clear instructions for safely conducting activities involving the covered process in a manner consistent with process safety information and are readily accessible to employees involved in the covered process.  Operating procedures are reviewed annually to ensure that they remain current and accurate.  Operating procedures cover each operating phase of the covered process including initial system startup, normal operation, temporary operations, emergency shutdown and conditions when required, emergency operations, normal shutdown and startup following a turnaround or emergency shutdown."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34047,
      "SummaryText": "Operating procedures also incorporate or reference relevant process safety information including the following:\n¿Process operating limits (including consequences of deviations and steps to correct or avoid such deviations).\n¿Safety and health considerations (including properties and hazards of covered chemicals, precautions necessary to prevent exposure, control measures to be taken upon physical contact or airborne exposure, quality control for raw materials, and control of regulated substance inventories).\n¿Safety systems and their functions.\n\nTraining ¿ New employees working with a covered process receive initial training in accordance with 40 CFR 68.54.  The training includes an overview of the process and emphasizes process operating procedures, safe work practices, health and safety hazards, and emergency operations including shutdown.  Those employees already involved in operating or maintaining a covered process prior to June 21, 1999, have been certified in writing as having ¿the required knowledge, skills, and abilities to safely carry out the duties and responsibilities as specified in the operating procedures.¿  Refresher training is provided, at minimum, every three (3) years to all employees involved in working with the covered process.  Documentation is maintained for each employee to ensure that he or she received and understood the required training.\n\nMechanical Integrity ¿ A maintenance program has been developed in accordance with 40 CFR 68.73 for covered process equipment.  Employees involved with the maintenance of covered process receive additional training, which includes an overview of the process, its hazards, and applicable procedures to ensure that the employees can perform the job in a safe manner.  Written procedures have been developed to ensure that covered process equipment is properly maintained, tested, and inspected at regular, scheduled intervals and that such activities are thoroughly documented.  Maintenance, inspections and t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 34047,
      "SummaryText": "esting procedures and frequencies are consistent with applicable manufacturer¿s recommendations and follow accepted engineering practices.  Any equipment deficiencies identified during maintenance, inspection or testing are corrected in a safe and timely manner.  The mechanical integrity program also includes a quality assurance program.\n\nManagement of Change ¿ Vitafoam has established and implemented written procedures to manage changes to process chemicals, technology, equipment, procedures; and changes that affect the covered process.  These procedures assure that appropriate considerations are addressed prior to any change.  Employees involved in operating a process and maintenance and contract employees whose job tasks will be affected by a change in the process are informed of, and trained in, the change prior to startup of the process or affected part of the process.  If a change results in a change in the process safety information, such information is updated accordingly.  If a change in the process results in a change in the operating procedures or practices, such procedures or practices will be updated accordingly.\n\nPre-startup Review ¿ Vitafoam performs a pre-startup review according to 40 CFR 68.77 when the modification is significant enough to require a change in the process safety information.\n\nCompliance Audits ¿ RMP compliance is confirmed through safety audits that are performed at least once every three (3) years in accordance with 40 CFR 68.58.  The audits are completed by at least one person knowledgeable in the process.  A report of the findings is generated following the audit, and all deficiencies and/or recommendations are promptly addressed and the resolution is documented.  The two (2) most recent safety audit reports are maintained at the facility.\n\nIncident Investigation ¿ Specific incident investigation, reporting, and documentation procedures have been implemented and are followed in accordance with 40 CFR 68.60 in response to any inci"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 34047,
      "SummaryText": "dent involving the covered process that did or could have reasonably resulted in a catastrophic release of a regulated substance.  Under EPA RMP, a catastrophic release is defined as a major uncontrolled emission, fire, or explosion involving one or more regulated substances that present imminent and substantial endangerment to public health and the environment.  The incident investigation procedure is initiated as soon as possible and no later than forty-eight (48) hours following any incident.  A team is established to perform the incident investigation and always includes at least one person knowledgeable in the process, a contract employee if the incident involves work by a contractor, and other persons with appropriate qualifications to investigate an accident.  Following the investigation, a written report is prepared summarizing the following information, at a minimum:  date of the incident; date the investigation began; description of the incident and any contributing factors; and any recommendations resulting from the investigation.  When completed, all affected personnel including the contract employees review the report.  Incident investigation reports are maintained at the facility for a minimum of five (5) years.\n\nEmployee Participation ¿ Vitafoam has developed a written plan of action regarding the implementation of employee participation.  The facility has consulted with employees on the conduct and development of process hazards analyses and on the development of the other elements of process management.  Vitafoam provides employees access to process hazard analyses, operation procedures, and to all other information required to be developed under 40 CFR, Part 68.\n\nHot Work Permit ¿ Vitafoam issues a hot work permit for hot work operations conducted on or near the covered process.\n\nContractors ¿ Vitafoam, when selecting a contractor, obtains and evaluates information regarding the contract owner or operator¿s safety performance and programs.  Vitafoa"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 34047,
      "SummaryText": "m informs the contract owner or operator of the known potential toxic release hazards related to the contractor¿s work and the covered process.  Vitafoam explains to the contract owner or operator, the applicable provisions of the Emergency Response Program.  Vitafoam has developed and implemented safe work practices consistent with 40 CFR 68.69(d), to control the entrance, presence, and exit of the contract owner or operator and contract employees in the covered process areas.  Vitafoam periodically evaluates the performance of the contract owner or operator in fulfilling their obligations as specified below.\n\nContract owners or operators assure that each contract employee is trained in the work practices necessary to safely perform his/her job.  Contract owners or operators assure that each contract employee is instructed in the known potential toxic release hazards related to his/her job and the covered process and the applicable provisions of the emergency action plan.  Contract owners and operators document that each contract employee has received and understood the training required.  Contract owners and operators are required to have records of the identity of the contract employee, the date of training, and the means used to verify that the employee understood the training.  The contract owner or operator assures that each contract employee follows the safety rules of Vitafoam, including the safe work practices required by 40 CFR 68.69(d).  The contract owner or operator advises Vitafoam of any unique hazards presented by the contract owner or operator¿s work, or of any hazards found by the contract owner or operator¿s work.\n\n(d) Five-year Accident History\n\nUnder the EPA RMP regulations, an accidental release is defined as a release of a regulated substance that ¿resulted in deaths, injuries, or significant property damage off-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.¿  Within the pa"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 34047,
      "SummaryText": "st five (5) years, Vitafoam has not had any accidents that meet these requirements.\n\n\n(e) Emergency Response Program\n\nVitafoam has developed and implemented an Emergency Response (ER) program for the purpose of protecting public health and the environment.  This program includes the following elements:\n\n1.Procedures for informing the public and local emergency response agencies (Lee County LEPC) about accidental releases;\n2.Documentation of proper first-aid and emergency medical treatment necessary to treat accidental human exposures; and\n3.Procedures and measures for emergency response after an accidental release of a regulated substance.\nThe ER program includes procedures for the use of emergency response equipment and for its inspection, testing, and maintenance; training for employees is provided periodically.  The ER Plan procedures are reviewed and updated, as appropriate, to reflect changes at Vitafoam and ensure that employees are informed of changes.\n\n(f) Planned Changes To Improve Safety\n\nIn an effort to improve safety and to reduce the risk of accidental releases, changes to the RMP and the facility have been implemented.  These improvements were identified either as a risk reduction measure during the hazard review or as a result of an improved RMP and the dedication to an inherently safer process."
    }
  ]
}