{
  "FacilityID": 34102,
  "FacilityName": "Colorado Fuel Manufacturers, Inc.",
  "FacilityStr1": "1629 21Road",
  "FacilityStr2": null,
  "FacilityCity": "Fruita",
  "FacilityState": "CO",
  "FacilityZipCode": "81521",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08077",
  "LEPC": "Mesa County LEPC",
  "FacilityLatDecDegs": "39.233333",
  "FacilityLongDecDegs": "-108.649972",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "P2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.fmoik.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Fuel Managers, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 33114703,
  "Company2DUNS": null,
  "OperatorName": "Colorado Fuel Manufacturers, Inc.",
  "OperatorStr1": "1493 Highway 6&50",
  "OperatorStr2": null,
  "OperatorCity": "Fruita",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "81521",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000102578",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-11-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 39.233685,
  "FRS_Long": -108.643567,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 49122,
      "AltID": "Natural Gas Frac.",
      "FacilityID": 34102,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 64727,
          "ProcessID": 49122,
          "ChemicalID": 155,
          "Quantity": 1701500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 47067,
              "ProcessChemicalID": 64727,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 47068,
              "ProcessChemicalID": 64727,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 47069,
              "ProcessChemicalID": 64727,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 47070,
              "ProcessChemicalID": 64727,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 50248,
          "ProcessID": 49122,
          "NAICSCode": "454312",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 34102,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Grand Junction Fire Department",
    "CoordinatingAgencyPhone": "9702441400",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34102,
      "SummaryText": "Colorado Fuel Manufacturers, Inc.\n\nExecutive Summary\n\n=============================================================================================\n\nColorado Fuel Manufacturers, Inc. (CFMI) operates as a natural gas liquids fractionation plant, which processes natural gas liquids that are trucked into the facility by independent trucking firms.  The NGLs are unloaded into storage tanks prior to being processed.  Once the product is introduced into the fractionization system, certain chemicals, known as light ends are removed from the NGLs.  Those chemicals include ethane, used as plant fuel-gas, as well as propane and butane, which are sold commercially.  \n\nOnce the light ends are removed from the NGLs, the remaining liquid is termed natural gasoline.  The natual gasoline is a low octane fuel that is transported to a gasoline blending facility as a blend stock for producing no-lead gasoline.\n\nRisk to the public from the CFMI facility is extremely low, primarily due to the location of the plant.  The plant is situated approximately two miles from any family dwelling and about 5 miles from the nearest town. In the event of a release or a fire, the people most likely to be effected would be CFMI employees.  In the event of a large chemical release or fire, employees are trained to shutdown the plant if practible, notify other persons in the area (i.e. truck drivers, contract employees), and leave the plant to go to the predetermined rally point.  In the fall of 2002, personnel from the County's Designated Emergency Response Agency, the Grand Junction Fire Department, arrived to conduct a facility review.  The results were presented to the Local Emergency Planning Committee.  At the LEPC meeting, the DERA representative stated that in an emergency situation, he believed that the CFMI plant would not pose a threat to the community or the general public.\n\nCFMI employs an excellent method to minimize risk at its facility.  The CFMI facility uses a Leak Detection And Rep"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34102,
      "SummaryText": "air (LDAR) plan to conduct monthly inspections of all potential fugitive emission sources, such as pumps, valves, compressors, emergency relief valves and connectors.  There are over 1,300 points checked during a typical inspection.  When a leak is discovered, a work order is written up and the first attempt of repair usually occurs within 48 hours.  Leaks at CFMI's facility are minimal.  The results from testing are reported to the Colorado Department of Public Health an Environment, who administers the program for the EPA.\n\nTo minimize the possibility of accidents at our facility, all operations employees are trained on all operational procedures, including emergency procedures.  A facility safety inspection (predicated on our SPCC plan) occurs semi-annually and involves the Plant Manager, the Environmental Manager and a Plant Operator.  Any problems that are discovered are quickly resolved.  \n\nCFMI has a commitment to safety.  This is demonstrated by the recent inspection conducted by the Occupational and Safety Section of Colorado State University.  Such an inspection is conducted only when requested by a small business (less than 150 employees) and when the business agrees to correct any imminent danger hazards without delay and serious hazards in a timely manner.  The business must provide a report of actions taken in regard to any hazard identified.  After inspecting the facility, the inspectors recommended that CFMI apply for the Safety and Health Achievement Recognition Program (SHARPs) award.  The inspectors stated that although only a few are awarded, CFMI was an excellent candidate for the award, which is recognized by OSHA.  OSHA does not inspect a SHARP's facility, unless a serious violation occurs.  Contained in the summary of the inspection is the following, CFMI is making every effort to provide a safe and healthy workplace.  Very few serous hazards were identified during our surveys.  The written programs we reviewed were excellent, as were th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34102,
      "SummaryText": "e training records.  Also, Perhaps the most remarkable quality of CFMI's health and safety culture is their management commitment.\n\nNo one is more concerned about the safety of the plant; it's employees and the surrounding community than CFMI.  Our intention is to remain vigilant because of the hazardous nature of our business and do all that is possible to operate in a safe and environmentally sound manner."
    }
  ]
}