{
  "FacilityID": 34360,
  "FacilityName": "Cliffside Steam Station",
  "FacilityStr1": "573 Duke Power Road",
  "FacilityStr2": null,
  "FacilityCity": "Cliffside",
  "FacilityState": "NC",
  "FacilityZipCode": "28024",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37161",
  "LEPC": "Cleveland&Rutherford Co LEPC",
  "FacilityLatDecDegs": "35.217222",
  "FacilityLongDecDegs": "-081.761111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "duke-energy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6996052,
  "ParentCompanyName": "Duke Energy",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Duke Energy",
  "OperatorStr1": "573 Duke Power Rd",
  "OperatorStr2": null,
  "OperatorCity": "Mooresboro",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28114",
  "OperatorZipCodeExt": null,
  "RMPContact": "Reginald King",
  "RMPTitle": "Engineering Manager",
  "FTE": 120,
  "OtherEPAFacilityID": "28024DKNRGDUKEP",
  "EPAFacilityID": "100000178559",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "04044T21",
  "SafetyInspectionDate": "2002-03-06 00:00:00",
  "SafetyInspectionBy": "NC OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Anhydrous Ammonia - SCR - 04 Requested informaton",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-04-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 35.4312,
  "FRS_Long": -80.93734,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 49578,
      "AltID": "Ammonia Injection System",
      "FacilityID": 34360,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 50706,
          "ProcessID": 49578,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 65284,
          "ProcessID": 49578,
          "ChemicalID": 56,
          "Quantity": 406000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 565284,
          "ProcessID": 49578,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34360,
      "SummaryText": "INTRODUCTION\n\nIn response to the requirements of Federal EPA, this Risk Management Plan has been developed for the Cliffside Steam Station (CSS) located in Cliffside, NC.  CSS is owned and operated by Duke Energy.\n\nPLANT AND PROCESS INFORMATION\n\nCSS has installed a new anhydrous ammonia system as a component supporting selective catalytic reduction (SCR) of the plant's boiler emissions.  Ammonia vapor (in the presence of the SCR catalyst) reduces NOx compounds to elemental nitrogen and water to reduce the total NOx effluent emitted from the plant.\n\nThe anhydrous ammonia system is comprised of two storage tanks, each with a capacity of 45,000 gallons, along with feed pumps and vaporizing equipment.  The two tanks will be administratively controlled such that their aggregate capacity will not exceed 80,000 gallons.  The total quantity of ammonia exceeds threshold quantities which invoke the requirements of the Risk Management regulations.\n\nACCIDENTAL RELEASE PREVENTION MEASURES\n\nCSS is committed to public safety, employee safety, continued reliable operation, and regulatory compliance.  Based on this commitment, the Regional Manager has overall responsibility for the development and implementation of the Risk Management Program.  A management system has been developed with clearly defined accountability and responsibility for the Risk Management Program.\n\nTo help ensure that any serious chemical releases do not occur, CSS maintains a release prevention program which is focused on protecting the public and plant employees from the hazards associated with an accident or release involving ammonia.  This multifaceted program includes the use of:\n\nAmmmonia gas detection and alarms to rapidly alert operators to any problems;\n\nProcess instrumentation and interlocks which will shutdown the system and isolate ammonia supplies to the plant if process conditions (such as flow, temperature, and pressure) are not within their appropriate safe operating ranges;\n\nProcess safety info"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34360,
      "SummaryText": "rmation which documents the safe design of the process system;\n\nProcess hazards analysis to evaluate the chemical and process hazards and make recommendations for safety improvements;\n\nWritten operating procedures to ensure the system is operated safely;\n\nMaintenance, inspection, and testing of system components to ensure that they are safe for continued use;\n\nSafe work practices to ensure that employees working on and around the processes are aware of the hazards, can perform their job duties safely, and know the actions to be taken in an emergency;\n\nIncident Investigation procedure to investigate accidents and \"near-misses\" to determine root causes and make needed safety improvements;\n\nTraining on all aspects of the program, operations, maintenance, chemical hazards, emergency response, and related aspects to ensure employees are continually aware of what is required to operate the system safely; and\n\nPeriodic compliance audits to ensure that the management system and prevention programs are working as they should.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThere is no specific accident history for the ammonia system as this is a new installation.\n\nCSS has previously and will continue to handle ammonia in a smaller capacity system (below EPA threshold quantity) for flue gas conditioning.  The accident history for this existing use was reviewed for comparative purposes.  Within the past five years, CSS has had no accidental releases that resulted in injuries or property damage.  The plant has maintained an excellent safety record throughout its operating history and has never had any major chemical release that could have had adverse effects on the public.\n\nEMERGENCY RESPONSE\n\nIn the event that an ammonia release does occur, CSS has an emergency response program that coordinates emergency response with the appropriate off-site agencies including the Rutherford and Cleveland County Emergency Planning and Management agencies and the Cliffside Fire Department.  CSS maintains a 24/7"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34360,
      "SummaryText": " emergency response team on-site with the appropriate number of members, training, and equipment to actively respond to and take action necessary to secure credible releases of ammonia that might occur.  Additionally, there are a number of emergency operations procedures in place which detail the appropriate emergency actions that would help mitigate the effects of releases.\n\nMAINTAINING A SAFE OPERATION\n\nDuke Energy and Cliffside Steam Station will continually work to safely manage the hazards of the ammonia system to protect the communities we serve and the employees, vendors and visitors at the station.  The Risk Management Program will be maintained to reduce the risk of accidental releases through training, procedures, equipment maintenance, and safe work practices.  Periodically, CSS will audit the program, review the Process Hazard Analysis, coordinate wth community emergency response organizations, and will update the program as needed to assure safe and efficient control and management of the anhydrous ammonia system."
    }
  ]
}