{
  "FacilityID": 34448,
  "FacilityName": "CITY OF PORTSMOUTH WATER TREATMENT PLANT",
  "FacilityStr1": "4862 GALLIA ST",
  "FacilityStr2": null,
  "FacilityCity": "PORTSMOUTH",
  "FacilityState": "OH",
  "FacilityZipCode": "45662",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39145",
  "LEPC": "Scioto County LEPC",
  "FacilityLatDecDegs": "38.754167",
  "FacilityLongDecDegs": "-082.916667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "CITY OF PORTSMOUTH",
  "OperatorStr1": "728 2ND ST, RM 1",
  "OperatorStr2": null,
  "OperatorCity": "PORTSMOUTH",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45662",
  "OperatorZipCodeExt": null,
  "RMPContact": "ASST. DIR OF WATER FILTRATION PLANT",
  "RMPTitle": "ASST DIR OF WATER/FILTRATION PLANT",
  "FTE": 13,
  "OtherEPAFacilityID": "7300111",
  "EPAFacilityID": "100000044926",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-02-04 00:00:00",
  "SafetyInspectionBy": "Consultant",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "COMPLETE",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-08-25 00:00:00",
  "DeRegistrationEffectiveDate": "2009-08-17 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 38.7547,
  "FRS_Long": -82.92466,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 49678,
      "AltID": "CHLORINE",
      "FacilityID": 34448,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 50806,
          "ProcessID": 49678,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 65416,
          "ProcessID": 49678,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 565416,
          "ProcessID": 49678,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34448,
      "SummaryText": "Our commitment to the members of our community, including our families, children, friends, visitors, and guests, is based upon our respect for our environment, commitment to improving our natural resources, and providing a safe and comfortable place for our residents to live for years to come.  We pledge to continue to make our community one that our residents are proud to call home.\n\nThis process is one of dozens of regulatory requirements that our managers and employees are committed to meeting so that we can ensure the ready availability of safe, healthy drinking water (and an effective sanitation system) for our residents.  These requirements include, among the many others, specialized training, education, and experience, the following of carefully prescribed procedures, the performance of laboratory tests, and ensuring that the water and sewer systems meets stringent requirements for safety, quality, purity, and mechanical integrity.\n\nWithout the active support of our employees we could not meet, let alone exceed, these requirements.  We are indebted to their commitment to our precious natural resources, to the environment, and to the communities they call home.\n\nAs part of our commitment to the safety and well-being of our employees and to the members of the community we serve, we are pleased to describe our efforts to not only meet, but to exceed, the requirements set by the Ohio Environmental Protection Agency.\n\nOur water treatment facility presently uses chlorine to disinfect our water and to make it suitable for consumption.   We routinely test our water to make sure it meets the EPA's tough criteria.\n\nWe receive our chlorine in one ton containers.  In general, we maintain no more than 8 containers on site at any one time in order to ensure that we do not run out of chlorine.  This redundancy is required by the EPA to protect the water source, and therefore the public, from possible contamination.\n\nOnce the chlorine comes onto our property we follow carefu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34448,
      "SummaryText": "lly considered procedures to ensure that the chlorine is safely moved to our enclosed storage room.  This room is used only for storing and using our chlorine.  It is constructed of fire resistant materials and is designed to contain the contents of our containers in the event of a leak.  This room has special alarms designed to immediately alert us to the smallest leak.  Because of the possibility for a leak in this area, only trained employees handle or move the chlorine.  We recently installed upgraded detectors to further improve our alarm system.\n\nThe process of getting chlorine out of the storage container and into the water is a simple procedure for our employees.  Once a container is empty our specially trained employees shut off the supply, disconnect the regulator from the empty container, and reconnect to a new container that is full of chlorine.  They check to make sure the container has no leaks (using ammonia) and turn the system back on.  If a leak occurs, the most common way to fix it is to shut off the supply.  Our trained employees know how to perform this shut-off procedure and others like it, just in case. They maintain the specialized equipment they might need to use near-by.\n\nOnce the chlorine supply is turned back on, the chlorine is sent to the water supply through specially manufactured and purchased equipment that automatically ensures that the right amount is provided to our water, and ultimately to our community.  This equipment is inspected and maintained by our trained maintenance people.  For more complicated repairs we have the manufacturer or other specialists come in to help us.  \n\nAs part of our responsibility in this process, we have carefully examined our method of handling the chlorine and other chemicals, including reviewing and revising what we can, or must, do in an emergency.  To assist us in the process we enlisted the aid of a consulting firm to provide a source of specialized knowledge and to help us to take an honest loo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34448,
      "SummaryText": "k at ourselves.  While we felt that we were doing a fine job of using our chemicals, they were able to suggest ways for us to improve.  This commitment to doing better is an important part of our process of ensuring the safety of our employees, neighbors, and the environment.  We will take an impartial look at ourselves on an annual basis to continue to improve.\n\nIn spite of all of the effort that we have invested in improving the process of handling chlorine in our facility, we know that the risk of a chlorine leak, although small, is still possible.  We have sought the aid of our local community fire and emergency responders, as well as our local emergency planning committee, to devise plans to ensure that the people of our community are protected in the event that the unlikely does occur.  \n\nWe have cooperated fully with our local fire department and other responders to ensure that they are aware of  possible events and we have co-developed, and will continue to cooperatively refine, a plan for making sure that people and the environment in our community are protected.\n\nIn the future we may consider other ways to ensure the safety of the drinking water of our community.  Although some other methods are presently available now, we have not been able to justify spending the operating funds that we have been so gratefully entrusted with by our citizens.  \n\nThe residents of our community are welcome to contact us to learn more about our regulatory compliance efforts, our chemical safety and handling methods, and our vision for providing safe drinking water into the future."
    }
  ]
}