{
  "FacilityID": 34447,
  "FacilityName": "Water Quality Control Facility",
  "FacilityStr1": "229 Northside Drive",
  "FacilityStr2": null,
  "FacilityCity": "Danville",
  "FacilityState": "VA",
  "FacilityZipCode": "24540",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51143",
  "LEPC": "City of Danville LEPC",
  "FacilityLatDecDegs": "36.561944",
  "FacilityLongDecDegs": "-079.363889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "gmanville@amwater.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Danville, VA",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Danville, Virginia",
  "OperatorStr1": "P.O. Box 3300",
  "OperatorStr2": null,
  "OperatorCity": "Danville",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "24541",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jerry L. Gwaltney",
  "RMPTitle": "City Manager",
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000128596",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-05-28 00:00:00",
  "SafetyInspectionBy": "Fire Dept./HazMat Team",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 36.56056,
  "FRS_Long": -79.36306,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "4",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 49676,
      "AltID": "Chlorine",
      "FacilityID": 34447,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 50804,
          "ProcessID": 49676,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 65414,
          "ProcessID": 49676,
          "ChemicalID": 62,
          "Quantity": 88000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 565414,
          "ProcessID": 49676,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 49677,
      "AltID": "Sulfur Dioxide",
      "FacilityID": 34447,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 50805,
          "ProcessID": 49677,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 65415,
          "ProcessID": 49677,
          "ChemicalID": 49,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 565415,
          "ProcessID": 49677,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34447,
      "SummaryText": "1. EXECUTIVE SUMMARY  68.155\nAmerican Water Services operates the Danville, Virginia Water Quality Control Facility under contractual agreements with The City of Danville.\n1.1. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES     (a)\nThe American Water Services Danville Plant accidental release prevention policy involves a unified approach that integrates technologies, procedures and management practices.  Our prevention program complies with all applicable procedures of the U.S. Environmental Protection Agency (EPA) Risk Management Program (RMP) 40 CFR-68,  Prevention Program.  We are also in compliance with the like policies of the US Occupational Safety and Health Administration (OSHA) Process Safety Management Program (PSM) 29 CFR 1910.119.\n1.1.1. MANAGEMENT SYSTEM  (a)(1)\n American Water Services, with the City of Danville, has a management system in place which oversees the implementation and on-going use of the RMP elements.  This program, along with other American Water Services policies, eliminates and/or reduces the likelihood of a hazardous chemical release at the plant.\n1.1.2. PREVENTION PROGRAM LEVEL 3  (a)(2)\n American Water Services maintains policies, procedures and systems as part of their prevention program.  The program addresses each of  the EPA Program Level 3-listed 12 elements, plus  RMP elements needed to implement the program, and the like elements in place in the plants? OSHA PSM program.  These are maintained in American Water Services Document Management System (DMS) document control system.\n1.2. AMERICAN WATER SERVICES STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED AT THE DANVILLE, VIRGINIA SITE  (b)\nThe American Water Services Plant employs 30 full-time employees engaged in wastewater treatment plant and pumping station operations.  Chlorine is used as part of the wastewater treatment manufacturing process.\n 1.2.1. SITE DESCRIPTION  (b)(1)\n The site is owned by the City of Danville and operated by American Water Service"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34447,
      "SummaryText": "s.  The site is located at 229 Northside Drive, Danville, Virginia.  The 20-acre site is boarded by the Dan River on the south.   City of Danville property surrounds the rest of the wastewater plant site.  Highway 29 is just west of the site and Highway 58 is north of the site.\n The Plant includes both a chlorine and sulfur dioxide storage and distribution systems contained in a specially designed process building. The boundaries of the chlorine system and adjacent sulfur dioxide system are subject to the RMP regulation.  The subject processes include the bulk chlorine and sulfur dioxide storage, feed, and control building with the associated vent make up and exhaust systems.\n1.2.2. REGULATED SUBSTANCE:   CHLORINE (b)(2)\n Chlorine is the first of two regulated substances on site which exceeds the EPA 40 CFR-68 rule threshold quantity.  The American Water Services chlorine process was installed as part of the process of purifying wastewater to permit discharge into the Dan River.  The chlorine is received, stored, and distributed through four process control systems, which feed the chlorine into a water stream.  This chlorinated water is then used to disinfect the wastewater.\n Chlorine is an EPA-and OSHA-listed toxic chemical.  It is an irritant and it is corrosive.  Chlorine is a halogen with the formula Cl2.  It is a chlorinating or oxidizing agent that is not flammable.  It has a 1 ppm OSHA ceiling Permissible Exposure Limit (PEL) and a NFPA health rating of 3, severe; with immediate and delayed health hazards.  Chlorine is not a carcinogen.\n1.2.3. REGULATED SUBSTANCE: SULFUR DIOXIDE (b) (2)\n Sulfur dioxide is the second regulated substance on site which exceeds the EPA 40 CFR-68 rule threshold quantity.  The American Water Services dechlorination process was installed as part of the process of purifying wastewater to permit discharge into the Dan River.  The sulfur dioxide used to dechlorinate is received, stored, and distributed through two process control syste"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34447,
      "SummaryText": "ms, which feed the sulfur dioxide into a water stream. This sulfonated water is then used to scavenge excess chlorine in the treated wastewater.\n  Sulfur dioxide is an EPA-and OSHA-listed toxic chemical.  It is an irritant and it is corrosive.  Sulfur dioxide is a gas or liquid under pressure with the formula S02.  It is a dechlorinating or oxidizing agent that is not flammable.  It has a 2 ppm OSHA Permissible Exposure Limit (PEL) and a NFPA health rating of 3, serious; with immediate and delayed health hazards.  Sulfur dioxide is not a carcinogen.\n1.3. WORST AND ALTERNATIVE CASE RELEASE SCENARIOS  (C)\nFour offsite consequence analyses were conducted which include two chlorine release scenarios and two identical sulfur dioxide release scenarios.  The first is a \"worst case release\".  The second is a more probable \"alternative release scenario\".  The first scenario used for both chlorine and sulfur dioxide is defined by EPA, which states that \"the shall assume that the    maximum quantity in the largest vessel    is released as a gas over 10 minutes\"  due to an unspecified failure.  The alternative scenario is defined as \"more likely to occur than the worst-case scenario\".\n   Atmospheric dispersion modeling was performed to determine the distance traveled by the chlorine or like sulfur dioxide released before its concentration decreases to the \"toxic endpoint.\"  The EPA selected endpoint for chlorine is 0.0087 mg/L which equals 3 ppm. The end point for sulfur dioxide is 0.78mg/L, which also equals 3 ppm.  The 3 ppm endpoint is the Emergency Response Planning Guideline Level 2 (ERPG-2).  This is defined by the American Industrial Hygiene Association (AIHA) as the \"maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual?s ability to take protective action.\"  The residential popula"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 34447,
      "SummaryText": "tion within a circle with a radius corresponding to the toxic endpoint distance for both chlorine and sulfur dioxide was defined, \"to estimate the population potentially affected.\"\n1.3.1. WORST CASE   (C)(1)\n Atmospheric dispersion modeling for the worst case scenario was performed using the EPA assumptions.  Results demonstrate a distance of 1.30 miles to the toxic endpoint for both chlorine and sulfur dioxide.  The residential population that could potentially be affected by the release is estimated at 503 people.\n1.3.2. ALTERNATIVE CASE   (C)(2)\n The alternative release scenario involves the failure of the pipe system or evaporator up to the vacuum check regulator of the high pressure system connected to one of four, one-ton containers. This failure is equal to creating a 1/16 inch diameter hole in either a pipe tube, evaporator, a pipe, or even the container in the vapor space.  Modeling using the EPA wastewater guidance demonstrated the rate of chlorine release is 20.0 lb./min.  The toxic endpoint distances determined is 0.20 miles.  The number of public receptors that would be impacted by this release is 0.\n1.4. ACCIDENTAL RELEASE PREVENTION PROGRAM  (D)\nThe American Water Services accidental release prevention program is based on OSHA?s PSM program and EPA?s RMP Level 3 prevention program.  The PSM program has been in place and effectively used for several years.  It is part of the plants operating culture.  There are two parts to the program.  The first is the general overall site program.  The second is the chemical-specific actions for either chlorine or sulfur dioxide within the site program.  This is coordinated with the Danville, Virginia Fire Department, which has a HazMat team.\n1.4.1. GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM   (d)(1)\n Facility-wide, many elements of the prevention program are used for all operations. The overviews of these written programs are listed below:\n? American Water Services has detailed process safety information on each"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 34447,
      "SummaryText": " of its operations. \n? The DMS document control system is integral to the management of change for all operations on site.  \n? Training is the backbone of employee knowledge, job operations and is ongoing in each area.  Employee training in operations and maintenance emphasizes awareness of the hazardous and toxic properties of all chemicals used. \n? Maintenance and preventive maintenance are used for all operations making mechanical integrity a part of each piece of equipment. \n? Incident investigations of accidents and near-miss incidents ensure we learn from each event as well as correct the causes of the incident. \n? Employees participate in all aspects of the plant as listed below under emergency response. \n? Safe work practices are used throughout the facility including:  1) Hot Work Permits, 2) Lock Out Tag Out Permits, 3) Vessel Entry Permits, 4) Site Security, and 5) Breaking Into Chemical Lines. \n? Contractors must meet AmericanAnglian?s high safety and technical standards as part of their selection and ongoing evaluations.  AmericanAnglian demands training of contractors to our standards. \n 1.4.2. SPECIFIC RESPONSE PROGRAM  (d)(2)\n1.4.2.1. Chlorine-and Sulfur Dioxide-Specific Policies and Procedures\nChemical-specific prevention features of the facility include the policies and procedures listed above and those of the chlorine or sulfur dioxide specific program.  These include:\n? Specific procedures for the operation of the chlorine/sulfur dioxide building and rooms. \n? Completion of a Pre-startup Safety Review prior to start-up of the modified chlorine or sulfur dioxide systems. \n? Specific emergency response procedures for chlorine or a sulfur dioxide release as outlined below under emergency response. \n? Specific training in the properties, hazards, handling requirements, and leak repair for chlorine or sulfur dioxide. \n? Finally, the details of both facility and equipment design are key to the safe operations of either the chlorination or dechlorinatio"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 34447,
      "SummaryText": "n systems. \n1.4.2.2. Facility Design\nThe facility and support equipment of the chlorine and sulfur dioxide storage, feed,  and control building meet and exceed design codes standards and good engineering practices.  The building feed and control rooms for both chlorine and sulfur dioxide are equipped with temperature control and vent make-up.  In the event of a chlorine leak the vent system automatically comes on.  All the vent air and any fumes are first diluted and then removed from the room by the vent systems.\n1.4.2.3. The System\nThe chlorination systems and like sulfur dioxide system design has four distinct zones or types of pipe design or specification for chlorine is:\n? High pressure liquid chlorine\n? High pressure vapor chlorine\n? Vacuum pressure vapor chlorine\n? Chlorinated water liquid system.\n The pipe design for sulfur dioxide is: \n? High pressure liquid S02\n? High pressure vapor S02\n? Vacuum pressure vapor S02\n? Sulfonated water liquid system.\nBoth the high pressure liquid and vapor systems are designed to three times the normal high pressure of the DOT shipment container.  Materials are primarily of steel construction or like materials, which are compatible with (corrosive resistant to) anhydrous chlorine and sulfur dioxide.\nThe vacuum system is designed to operate at 13 to 60 inches of water vacuum pressure (less than atmospheric pressure).  The piping and fittings are made of chemical resistant PVC, glass or like materials.  The system is designated to 150 psig pressure or complete vacuum.\nBoth water systems are made of steel and PVC pipe, and like compatible materials.  The system is designed for chlorinated or sulfonated water at 150 psig containing low ppm levels of either chemical.\nAll the vessels, valves, pipe, fitting, instruments, etc are specifically designed for either chlorine or sulfur dioxide service.\nThere is a dual sensor chlorine monitor in both the chlorine scale feed room and evaporator control room.  These detect the pressure of ch"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 34447,
      "SummaryText": "lorine plus alarm locally and in the separate plant operation control room with a light and audible alarm.\nThere is a dual sensor sulfur dioxide monitor in both the sulfur dioxide scale feed room and evaporator control room.  These detect the pressure of sulfur dioxide plus alarm locally and in the separate plant operation control room with a light and audible alarm.\n1.5. FIVE-YEAR ACCIDENT HISTORY  (E)The Danville Plant has had no accidental releases of chlorine in the past five years per EPA 40 CFR 67.42 (a).\n1.5.1. CHLORINE PROCESS SYSTEM\n The Danville Plant has had no accidental releases of chlorine in the past five years per EPA 40 CFR 67.42 (a).\n1.5.2. SULFUR DIOXIDE PROCESS  SYSTEM\n The Danville Plant has had no accidental releases of sulfur dioxide in the past five years per EPA 40 CFR 67.42 (a).\n1.6. EMERGENCY RESPONSE PROGRAM  (F)\nEmergency response procedures are contained in the American Water Services Contingency Plan (Emergency Response Plan).  The plan includes an emergency response \"decision tree\" as well as a site plus public notification plan.  Emergency response drills and drill evaluations are conducted annually by the operating department.  Emergency operation and response procedures are also reviewed at that time.  The most recent drill as of this report was conducted with the local HazMat fire and rescue team in April 05, 2001.\n   The emergency response program (contingency plan) is coordinated (reviewed by) with the Danville Fire Department, and its HazMat team plus coordinates with Local Danville?s Emergency Response Committee (LEPC).  Copies of the program are given to key local agencies including: fire, medical, rescue, waste management, and police departments in Danville.  Besides the specific emergency response program, key elements of the prevention programs are incorporated in the operating culture of the American Water Services plant.\n   The Contingency Plan procedures detail the actions and responses to either a chlorine or sulfur di"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 34447,
      "SummaryText": "oxide spill (release).  The plan includes training of all chlorination/dechlorination-area operators,  The primary response team include the Danville fire, rescue, and HazMat Team.  All of these respond to severe chlorine or sulfur dioxide leak situations.  Actions include catastrophic, severe, and moderate leaks.  Both a chlorine and sulfur dioxide \"B\" Kits are maintained on site to aid in stopping leaks.  Public notification is facilitated through the City police and County Sheriff Departments.\n1.6.1. PERSONNEL  (F)(1)\n Personnel are the key resources of American Water Services prevention program. Our employees make up the operators and operation first responder emergency response teams.  American Water Services fosters a high level of involvement in every aspect of the chlorine system operations including participation in :\n? Chlorine /sulfur dioxide PSM/RMP safety teams, \n? Development of the operation procedures, \n? Hazard evaluations, and \n? On-going training of the operators and other involved staff.\n1.7. CHANGES TO IMPROVE SAFETY  (g)\nChanges to improve safety (recommended actions) were identified in the site of September 20, 2002 internal re-audit of the PSM program to meet requirements of the Risk Management Prevention Program.  These critical recommended actions have now been evaluated and implemented as required.  American Water Services continually reviews implemented and potential safety improvements for all of its operations.  Currently, the American Water Services management team and PSM/RP safety team are reviewing potential upgrades to the existing design of the chlorine and sulfur dioxide operations to make the system even safer and to prevent a release or minimize the consequences in the event of a chlorine or sulfur dioxide release."
    }
  ]
}