{
  "FacilityID": 34480,
  "FacilityName": "City of Tampa - Howard F. Curren AWTP",
  "FacilityStr1": "2700 Maritime Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Tampa",
  "FacilityState": "FL",
  "FacilityZipCode": "33605",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12057",
  "LEPC": "District 8 LEPC",
  "FacilityLatDecDegs": "27.925833",
  "FacilityLongDecDegs": "-082.435278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "AO",
  "LatLongDescription": "AB",
  "FacilityURL": "http://www.tampagov.net",
  "FacilityEmailAddress": "Ralph.Metcalf@ci.tampa.fl.us",
  "FacilityDUNS": 59071860,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Tampa - Wastewater Dept.",
  "OperatorStr1": "306 E. Jackson Street, 6E",
  "OperatorStr2": null,
  "OperatorCity": "Tampa",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33602",
  "OperatorZipCodeExt": null,
  "RMPContact": "Daniel A. Page",
  "RMPTitle": "Wastewater Technical Supervisor",
  "FTE": 156,
  "OtherEPAFacilityID": "59-1101-1138",
  "EPAFacilityID": "100000081635",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0570373-012-AV",
  "SafetyInspectionDate": "2000-01-04 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 27.92583,
  "FRS_Long": -82.43392,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 49710,
      "AltID": "Chlorination",
      "FacilityID": 34480,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 50841,
          "ProcessID": 49710,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 65452,
          "ProcessID": 49710,
          "ChemicalID": 62,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 565452,
          "ProcessID": 49710,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 49711,
      "AltID": "Dechlorination",
      "FacilityID": 34480,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 50842,
          "ProcessID": 49711,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 65453,
          "ProcessID": 49711,
          "ChemicalID": 49,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 565453,
          "ProcessID": 49711,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34480,
      "SummaryText": "1. Accidental release prevention and emergency response policies:\n\nAt the Howard F. Curren Advanced Wastewater Treatment Plant (HFC AWTP), both chlorine and sulfur dioxide are handled at levels above the United States Environmental Protection Agency (USEPA) threshold.  The quantity of chemicals stored at the plant make it necessary to observe certain safety precautions in handling to prevent unnecessary human exposure, to reduce the threat to personal health of chemical maintenance workers as well as co-workers, and to reduce the threat to nearby members of the community.  It is the policy of the HFC AWTP to adhere to all applicable Federal and state rules and regulations. Safety depends upon the manner in which chlorine and sulfur dioxide are handled, combined with the safety devices inherent in the design of this facility, the safe handling procedures that are used, and the training of personnel.\n\nThe HFC AWTP's accidental release prevention program involves a unified approach that integrates technologies, procedures, and management practices.  All applicable procedures of the USEPA Prevention Program are adhered to.  The HFC AWTP's emergency response plan includes procedures for notification of the local fire authority and notification of any potentially affected neighbors.\n\n2. The stationary source and regulated substances handled.\n\n   -  The regulated substances handled at this facility are chlorine and sulfur dioxide.\n\n   -  The primary purpose of this facility is to treat the wastewater from the City of Tampa Service Area. Both chlorine and sulfur dioxide are received in 90-ton rail cars and stored at either the chlorine unloading station or the sulfur dioxide unloading station.  Access to the site is restricted to authorized facility employees, authorized management personnel, and authorized contractors.\n \n   -  The maximum amount of chlorine that can be stored at this plant is 270,000 pounds (lbs). However, the average daily amount is 115,000 pounds. The ma"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34480,
      "SummaryText": "ximum amount of sulfur dioxide that can be stored at this plant is 270,000 pounds. However, the average daily amount is 115,000 pounds.\n\n3. The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\nWorst-Case Release Scenario:\n\n   -  Worst-Case Scenario - The USEPA states that \"the owner shall assume that the ? maximum quantity in the largest vessel ? is released as a gas over 10 minutes.\"  At the HFC AWTP, this would be the failure of the largest sulfur dioxide storage vessal.  When filled to the greatest amount allowed, the scenario would release 180,000 pounds of sulfur dioxide.  \n\n   -  Atmosperic dispersion modeling was performed to determine the distance traveled by the sulfur dioxide released before its concentration decreases to the \"toxic endpoint\" selected by the USEPA.  The maximum centerline downwind distance up to which the USEPA \"toxic endpoint\" or \"level of concern concentration\" of 3 parts per million per volume (ppm) was determined to be 16.0 miles using USEPA's RMP*Comp modeling program.  The \"level of concern concentration\" is defined by the USEPA to be the \"maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\"  The RMP*Comp model assumes the same weather conditions throughout the entire area of concern.  The National Oceanic and Atmospheric Administration (NOAA) believes that the long time and distance of travel makes steady meteorological conditions unlikely and results are not sufficiently representative of expected conditions when the distance is greater then 6.2 miles.\n\n   -  No mitigation was considered.\n\n   -  The residential population within the 16-mile radius defined above is 1,042,000"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34480,
      "SummaryText": " people.  However, only the population within an elliptical plume extending downwind of the release point is potentially affected.  The plum area is approximately 6% of the area of the full circle.  The data source used for this estimate was the Pinellas County 2000 census data and the Hillsborough County 2002 projected census data.\n\nAlternative Release Scenario: \n\n   -  Alternative Scenario - The USEPA states that the scenario shall be \"more likely to occur than the worst-case release ? and that it will reach an endpoint off-site.\"  At the HFC AWTP, this would be the release of sulfur dioxide or chlorine through a 1-inch hole in the pipe, possibly due to a broken line.  Both the sulfur dioxide and chlorine systems have excess flow valves that will shut off the flow into the system when the flow reaches 15,000 pounds per hour (lbs/hr).  Therefore, the maximum flow in the system is 250 pounds per minute (lbs/min).  For sulfur dioxide, the scenario would release 2,500 pounds over an average of 10-minutes. For chlorine, the scenario would also release 2,500 pounds over an average of 10-minutes.\n\n   -  Atmospheric dispersion modeling was performed to determine the distance traveled by the sulfur dioxide or chlorine released before its concentration decreased to the \"toxic endpoint\" selected by the USEPA.  The maximum centerline downwind distance up to which the USEPA \"toxic endpoint\" or \"level of concern concentration\" of 3 ppm for sulfur dioxide was determined to be 0.5 miles.  For chlorine, the maximum centerline downwind distance up to which the USEPA \"level of concern concentration\" of 3 ppm was also determined to be 0.5 miles.  This release has the possibility of extending beyond the facility boundary.\n\n   -  Three types of passive mitigation were considered for these scenarios.  Both alternative release scenarios could occur within an enclosed building.  Also, both of the buildings have drains and ventilation. \n\n   -  The residential population within the 0.5 mile"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 34480,
      "SummaryText": " radius defined above is zero.  The area immediately surrounding the HFC AWTP is industrial.  The data source used for this estimate was the Hillsborough County 2002 projected census data.  \n\n4. The general accidental release prevention program and the specific prevention steps. \n\nThe HFC AWTP's general accidental release prevention program complies with the USEPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.\n\nThe HFC AWTP's general accidental release prevention program contains four parts: designing for safety, maintaining safe operations, operating safely, and auditing our operations.\n\nDesigning for safety:\n\n   -  Rail car construction meets federal guideline 49CFR179.102\n   -  Excessive-flow check valve prevents rapid release of rail car contents\n   -  Redundant or backup safety systems are part of design\n   -  Remote sensing device to detect leaks\n   -  Valves and equipment are tagged and numbered\n\nMaintaining safe operations:\n\n   -  Safety reviews for all changes\n   -  Maintenance personal trained on the job by standards set by the Chlorine Institute\n   -  Preventative maintenance program conducted by qualified technicians\n   -  Equipment checked on a routine schedule\n   -  Frequent walk-through inspections by maintenance personnel \n\nOperating safely:\n\n   -  Written operating procedures and operational standards based on hazard analysis\n   -  Established shut-down procedures\n   -  Standby generator available for backup power\n   -  Leak sensors monitored in control room\n   -  Operators present during loading and unloading of rail cars\n\nAuditing our operations:\n\n   -  Critical equipment/instrumentation tested and inspected weekly to assure proper operation\n   -  Pre-startup safety reviews on new or modified equipment \n   -  Process hazard analysis conducted regularly \n   -  Design changes reviewed for proper design \n   -  Investigation and follow-up of all accidents and incidents\n\n5. Five-year accident history. \n\nThe HF"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 34480,
      "SummaryText": "C AWTP has not had a reportable accident in the last five years.\n\n6. The emergency response program.\n\nThe HFC AWTP's emergency response program is based upon training and preparation.\n\n   -  Written plant site Emergency Preparedness Plan\n   -  On-site inspection of facility by Hazmat Team\n   -  Emergency response equipment including self-contained breathing apparatus (SCBA) and chemical suits located on site\n   -  All chlorine and sulfur dioxide operators trained in emergency response and emergency plant shut-down procedures\n   -  Chlorine and sulfur dioxide unloading site and procedures inspected by manufacturer's Technical Support Specialist\n   -  Member of District VIII Local Emergency Planning Committee (LEPC)\n\nThe HFC AWTP is a first responder.  This means that the treatment plant employees respond to chlorine and sulfur dioxide releases.  If a release were to occur, the facility would also call 911, which would contact Tampa Fire Rescue, Office of Emergency Management, and the LEPC.  The HFC AWTP also has a facility-wide alarm and response network monitored by a SCADA computer system.  The facility site alarm would activate to warn on-site personnel, and emergency remote shut-down procedures in place would be activated.  If the release were to have the potential to affect the general public, the Office of Emergency Management would sound an alarm for the area.  We have discussed this program with the District VIII Local Emergency Planning Committee and Tampa Fire Rescue. \n\n7. Planned changes to improve safety.\n\nThe HFC AWTP is evaluating the installation of video surveillance cameras at the sulfur dioxide and chlorine railcar unloading facility.  These cameras will allow the facility to be monitored from the treatment plant's process control center.  The process control center is manned 24 hours a day, seven days a week."
    }
  ]
}