{
  "FacilityID": 34522,
  "FacilityName": "Water Pollution Control Facility",
  "FacilityStr1": "300 East 8th Street",
  "FacilityStr2": null,
  "FacilityCity": "Greeley",
  "FacilityState": "CO",
  "FacilityZipCode": "80631",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08123",
  "LEPC": "Weld County LEPC",
  "FacilityLatDecDegs": "40.424741",
  "FacilityLongDecDegs": "-104.677629",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.ci.greeley.co.us",
  "FacilityEmailAddress": "dingemat@ci.greeley.co.us",
  "FacilityDUNS": 82649583,
  "ParentCompanyName": "City of Greeley",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Greeley",
  "OperatorStr1": "300 East 8th Street",
  "OperatorStr2": null,
  "OperatorCity": "Greeley",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80631",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tom Dingeman",
  "RMPTitle": "Wastewater Treatment Plant Supt.",
  "FTE": 23,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000127668",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "95WE739",
  "SafetyInspectionDate": "2004-05-24 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-03-01 00:00:00",
  "DeRegistrationEffectiveDate": "2006-03-01 00:00:00",
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 40.42361,
  "FRS_Long": -104.67667,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 49782,
      "AltID": null,
      "FacilityID": 34522,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 50915,
          "ProcessID": 49782,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 65557,
          "ProcessID": 49782,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 565557,
          "ProcessID": 49782,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34522,
      "SummaryText": "40CFR ? 68.155   Executive Summary\n\na)  The City of Greeley Water Pollution Control Facility (WPCF) accidental release prevention policy involves a unified approach that integrates advanced technologies, standardized operating procedures, personal training requirements, self-auditing and recordkeeping procedures, and a top-down management commitment to safe chlorine handling practices.  The Greeley Water Pollution Control Facility Emergency Response policy involves utilization of, and cooperation with off-site responders to address potential chlorine-related issues. \n\nb)  The Greeley Water Pollution Control Facility is located in Greeley, Colorado along the Cache La Poudre River.  The facility receives and treats all wastewater from residential, commercial, and industrial dischargers that are within the City?s service area.  The facility has a disinfection building that maintains one-ton chlorine containers, three chlorinators, vacuum piping, and various safety equipment.  All electrical panels are located in a separate room in the disinfection building.  An inventory of four one-ton chlorine containers is regularly maintained on-site in the dedicated disinfection building.   The facility operates 24 hours per day, 365 days per year.  At least one plant operator is always on duty and addresses alarms and monitors overall facility security.  Plant operators and maintenance mechanics have been trained and certified in the operation and maintenance of the chlorination equipment.  Only incidental (i.e., known and immediately controllable) chlorine-related events are handled by plant staff.  Local hazardous response personnel from the Union Colony Fire & Rescue Authority respond to all other emergency events.\n\nc)   The facility performed the required off-site consequence analyses (?OCA?) for the agency-defined ?worst-case? and ?alternate? release scenarios.  The facility utilized the OCA guidance for chlorine published by the United States Environmental Protection Agency"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34522,
      "SummaryText": " (?EPA?) in the Risk Management Program Guidance for Wastewater Treatment Plants (40 CFR Part 68).  \n\nd)  The Greeley Water Pollution Control Facility accident release prevention program is based on the following elements:\n\nAdvanced process and safety equipment;\nA chlorine gas detector alarm in the disinfection building that triggers at concentrations greater than one part per million.  (The alarm system will alert the plant operator on duty via a personal pager, and activate a flashing light located on the top of the administration building, an audible horn located at the disinfection building, and the facility?s computer control center);\nStandardized operating procedures;\nTraining of plant operators and maintenance personnel in the chlorine process;\nPreventive maintenance program for chlorine process equipment;\nHazard review of chlorine process equipment and procedures;\nAuditing and inspection program;\nInvestigation program (which will investigate future incidents that could reasonably result in a chlorine release); and \nPersonal protective equipment, including self-contained breathing apparati (SCBA's).\n\ne)  No accidental releases of chlorine have occurred at the Greeley Water Pollution Control Facility in the past five years.  \n\nf)  The Greeley Water Pollution Control Facility Emergency Response Program utilizes local hazardous response personnel to respond to emergencies at the plant.  The Weld County Office of Emergency Management and the local Union Colony Fire & Rescue Authority (UCFRA) have reviewed the Greeley facility's program.  All personnel will review these procedures on an annual basis.  The program has consisted of periodic discussions and exercises with the UCFRA emergency response team.  A chlorine ?B? kit for one-ton containers is also maintained and kept on the plant site for use only by the emergency response team, if it is ever needed.\n\ng)  Within the past 5 years, the Greeley Water Pollution Control Facility has implemented several changes in"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34522,
      "SummaryText": " its chlorine process, including the purchase of a new chlorine gas detector (that has a continuous chlorine concentration readout scale and is mounted outside of the building where the operator can safely monitor what is going on inside the chlorine room), and the use of checklists for: chlorine deliveries, maintenance inspections, the disinfection and scrubber buildings, and all SCBA equipment.  Additionally, all plant supervisors have completed STOP (Safety Training Observation Program), which is designed to enhance employee awareness about performing their jobs in a more safe manner and how to recognize potential safety hazards. The Greeley facility also has a chlorine scrubber that is designed to safely contain and neutralize the contents of a full one-ton container.  Adding an uninterrupted power supply unit to protect the chlorine detector was done in 1999.  A comprehensive refresher chlorine training session with all risk management participants was conducted on April 15, 2003.\n\nh)  Within the past year, the Greeley Water Pollution Control Facility has installed an improved security system for the disinfection area, including an alarm system for each door, reinforced metal screens over windows, and steel bars to strengthen the locked bay doors.  Personal entry into the chlorine room will automatically trigger the alarm system (and operator paging system) unless a pass code is quickly entered on a keypad located just inside the room.  In 2002, the treatment facility installed perimeter fencing around the treatment facility, and in 2003 added automated security gates at each main entrance.  Entry through these gates is only via a pass code that must be entered on a keypad.  Security monitors are also located at each main gate.  Plant visitors are required to first \"check in/sign in\" at the Administration Building once they have received access through the main gates.  Security signage has been posted on the perimeter fencing and at the main gates.\n\ni)  In Marc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 34522,
      "SummaryText": "h 2003, a feasibility level study to evaluate other wastewater disinfection alternatives was conducted.   Presently, the Greeley Water Pollution Control Facility is pursuing engineering design services for ultraviolet disinfection.  The design for the UV system should be completed by September 2004.  Installation of the UV system is anticipated in 2005."
    }
  ]
}