{
  "FacilityID": 34563,
  "FacilityName": "Schlegel Systems, Inc.",
  "FacilityStr1": "1555 Jefferson Road",
  "FacilityStr2": null,
  "FacilityCity": "Rochester",
  "FacilityState": "NY",
  "FacilityZipCode": "14692",
  "Facility4DigitZipExt": "3197",
  "FacilityCountyFIPS": "36055",
  "LEPC": "Monroe County LEPC",
  "FacilityLatDecDegs": "43.085833",
  "FacilityLongDecDegs": "-077.586667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": "www.Schlegel.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 8865466,
  "ParentCompanyName": "Unipoly",
  "Company2Name": null,
  "CompanyDUNS": 8865466,
  "Company2DUNS": 0,
  "OperatorName": "Schlegel Systems Inc.",
  "OperatorStr1": "1555 Jefferson Road",
  "OperatorStr2": null,
  "OperatorCity": "Rochester",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14692",
  "OperatorZipCodeExt": "3197",
  "FTE": 310,
  "OtherEPAFacilityID": "14692SCHLG1555J",
  "EPAFacilityID": "100000023235",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-11-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-06-11 00:00:00",
  "DeRegistrationEffectiveDate": "2019-05-01 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 43.08583,
  "FRS_Long": -77.58722,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 49830,
      "AltID": "TDI Storage",
      "FacilityID": 34563,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 65624,
          "ProcessID": 49830,
          "ChemicalID": 77,
          "Quantity": 45000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 50963,
          "ProcessID": 49830,
          "NAICSCode": "325211",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 34563,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-05-20 00:00:00",
    "ERTrainingDate": "2004-04-13 00:00:00",
    "CoordinatingAgencyName": "Monroe County LEPC",
    "CoordinatingAgencyPhone": "5854730710",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34563,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAt Schlegel Systems, Inc., we are committed to operating and maintaining all of our processes (especially those using hazardous\nsubstances including toluene diisocyanate) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n* A description of our facility and use of substances regulated by EPA's RMP regulation\n* A summary of results from our assessment of the potential off-site consequences from accidental chemical releases\n* An overview of our accidental release prevention programs\n* An accident history for accidental releases of chemicals regulated by EPA's RMP rule\n*An overview of our emergency response program\n* An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\n* The certifications that EPA's RMP rule requires us to provide\n* The detailed information (data elements) about our risk management plan\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\nOur facility produces polyurethane foam seals and gaskets for doors and windows, and electromagnetic shielding gaskets for use in the electronics industries using a variety of chemicals and processing operations.  We also produce textile products.  In our gasket and seal manufacturing processes, we use Toluene Diisocyanate (TDI) that EPA has identified as having the potential to cause significant off-site consequences in the event of a substantial accidental release:\n\nToxics                                        Storage Mechanism and Quantity\n\nToluene Diisocyanate (TDI)         6000 Gallon Bulk Storage Tank\n\nOur "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34563,
      "SummaryText": "accidental release prevention programs and our contingency planning efforts help us effectively manage the hazards that are posed to our employees, the public and the environment by our use of toluene diisocyanate.\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nWe take a systematic, proactive approach to preventing accidental releases of hazardous chemicals including toluene diisocyanate.  Our management systems address each of the key features of successful prevention programs, including:\n\n*  Process Safety Information\n*  Process Hazard Analysis\n*  Chemical Unloading Procedures\n*  Training and Emergency Response Team Training\n*  Mechanical Integrity\n*  Management of Change\n*  Chemical Safety\n*  Compliance Audits\n*  Incident Investigation\n*  Employee Participation\n*  Hot Work Permit Program\n*  Contractors\n\nAs part of our prevention efforts, we have implemented the following chemical specific prevention steps:\n\n*  All mechanical and electrical systems are checked prior to the delivery and unloading of bulk chemicals\n*  A minimum of 2 properly trained Schlegel employees, plus the bulk tank delivery driver, are utilized when unloading bulk chemicals\n*  All personnel communicate directly using hand held communication devices\n*  The inventory of the chemical bulk storage tank is checked both mechanically and electronically to prevent overfilling of the storage tank\n*  The chemical unloading area is diked in the event of a spill or release\n*  The chemical unloading connections are labeled, color coded and sized to only fit the hose for unloading of toluene diisocyanate\n*  An unloading checklist form is required to be completed each time a delivery of bulk chemicals is received\n*  Appropriate personal protective equipment is provide to all Schlegel employees involved in the chemical unloading procedure\n\nThese individual elements of our prevention program work together to prevent accidental chemical releases.  Schlegel Systems, Inc. "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34563,
      "SummaryText": "and our employees are committed to the standard that these management systems set for the way we do business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\n\nFIVE YEAR ACCIDENT HISTORY\n\nWe keep records for all significant accidental chemical releases that occur at our facility.  The following is a brief summary of accidental chemical release involving materials covered under EPA's RMP rule during the last 5 years:\n\n*  We have not had any significant releases of toluene diisocyanate (TDI) during the last 5 years\n\nIf an incident were to occur, we would conduct a formal incident investigation to identify and correct the root cause(s) of the event.\n\nEMERGENCY RESPONSE PROGRAM\n\nWe maintain an integrated contingency plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning.  Our program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, we coordinate our plan with the Town of Henrietta Fire Department.\n\nWe have an in-house emergency response team consisting of approximately 43 employees who have received specific training on how to respond to chemical spills.  This training has included scenarios on releases of Toluene Diisocyanate in a variety of conditions.  We have 11 complete Scott Air Pack SCBA units, and numerous spare air cylinders, as well as a completely stocked and mobile spill response cart.  Team members meet quarterly to review hazardous materials issues, and train with the Scott Air Packs yearly.  In the event of a spill, Schlegel Systems, Inc. has contracts with outside environmental firms to assist in clean up if required.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe following is a list of improvements that we are planning to implement at the facility to help prevent or better respond to accidental chemical rel"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 34563,
      "SummaryText": "eases:\n\n*  Relocation of Toluene Diisocyanate (TDI) monitors to facilitate faster response times in the event of a leak or spill\n*  Installation of pressure sensors to enable more rapid leak detection in the TDI closed loop system\n\nCERTIFICATIONS\n\nBased on the criteria in 40 CFR 68.10, the distance to the specified endpoint for the worst case accidental release scenario for the following process(es) is less than the distance to the nearest receptor:\n\n*  A complete release of TDI from our on-site bulk chemical storage tank\n\nWithin the past 5 years, the process(es)  has had no accidental release that caused offsite impacts provided in the RMP rule (40 CFR 68.10(b)(1).  No additional measures are necessary to prevent offsite impacts from accidental releases.  In the event of fire, explosion or a release of a regulated substance from the process(es), entry within the distance to the specified endpoints may pose a danger to public emergency responders.  Therefore, public emergency responders should not enter this area except as arranged with the emergency contact indicated in the RMP.  The undersigned certifies that, to the best of my knowledge, information, and belief, formed after reasonable imquiry, the information submitted in this RMP plan is true, accurate, and complete.\n\nSignature:\n\nTitle:Operations Manager\n\nDate:June 18, 2004\n\nRMP DATA ELEMENTS\n\nThe following pages present additional information about our risk management program that EPA's RMP rule has asked us to provide.  This information is categorized as follows:\n\n*  Registration\n*  Chemical Bulk Storage Tank Inspection Form\n*  Chemical Bulk Unloading Checklist and Form\n*  Best Management Practices Plan\n*  Emergency Response Program"
    }
  ]
}