{
  "FacilityID": 34575,
  "FacilityName": "Effluent Treatment Plant - Anhydrous Ammonia",
  "FacilityStr1": "100 Wisconsin River Drive",
  "FacilityStr2": null,
  "FacilityCity": "Port Edwards",
  "FacilityState": "WI",
  "FacilityZipCode": "54469",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55141",
  "LEPC": "Wood County LEPC",
  "FacilityLatDecDegs": "44.328333",
  "FacilityLongDecDegs": "-089.880000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 202169744,
  "ParentCompanyName": "Domtar A.W. Corp.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Domtar A.W. Corp.",
  "OperatorStr1": "100 Wisconsin River Drive",
  "OperatorStr2": null,
  "OperatorCity": "Port Edwards",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54469",
  "OperatorZipCodeExt": null,
  "FTE": 12,
  "OtherEPAFacilityID": "WID980613319",
  "EPAFacilityID": "100000132625",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-10-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-06-13 00:00:00",
  "DeRegistrationEffectiveDate": "2019-01-10 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 44.33917,
  "FRS_Long": -89.85903,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 49845,
      "AltID": null,
      "FacilityID": 34575,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 65660,
          "ProcessID": 49845,
          "ChemicalID": 56,
          "Quantity": 85850.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 50978,
          "ProcessID": 49845,
          "NAICSCode": "322121",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 28562,
              "Process_NAICS_ID": 50978,
              "SafetyReviewDate": "2004-06-09 00:00:00",
              "PHA_Date": "2004-06-09 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-06-01 00:00:00",
              "TrainingReviewDate": "2003-12-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-10-04 00:00:00",
              "EquipmentInspectionDate": "2004-04-15 00:00:00",
              "EquipmentTested": "valves",
              "ChangeMgmtDate": "2003-05-22 00:00:00",
              "ChangeMgmtReviewDate": "2003-05-22 00:00:00",
              "PreStartupReviewDate": "1999-04-30 00:00:00",
              "ComplianceAuditDate": "2002-10-11 00:00:00",
              "AuditCompletionDate": "2003-10-11 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2002-10-15 00:00:00",
              "HotWorkPermitReviewDate": "2003-06-15 00:00:00",
              "ContractorSafetyReviewDate": "2004-06-01 00:00:00",
              "ContractorSafetyEvalDate": "2004-05-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "This system consists of a pressurized 85,850 pounds capacity storage tank with a 1-inch diameter feed line to effluent treatment plant process.",
              "_chemicals": [
                {
                  "PrimaryKey": 41489,
                  "PreventionProgram3ID": 28562,
                  "ProcessChemicalID": 65660
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 34575,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-05-03 00:00:00",
    "ERTrainingDate": "2004-05-28 00:00:00",
    "CoordinatingAgencyName": "Wood County LEPC",
    "CoordinatingAgencyPhone": "7154218500",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34575,
      "SummaryText": "The Executive Summary is attached in a file named \"RMPnh4.txt\".\nDomtar A.W. Corp. - Wisconsin Operations\n\nRisk Management Plan\n\nAnhydrous Ammonia - Effluent Treatment Plant\n\n\n\n\n\n1.    Executive Summary\n\n\n\nDomtar A.W. Corp.'s (Domtar) Effluent Treatment Plant is committed to operating in a manner that is safe for Domtar's workers, the public, and the environment.  As part of this commitment, Domtar has established a system to help ensure safe operation of the hazardous chemical processes at this facility.  One component of this system is a Risk Management Program (RMP) that helps manage the risks at the facility and addresses compliance with the requirements of the Environmental Protection Agency's (EPA) Regulation 40 CFR 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP Rule).  One of the requirements of the RMP Rule is to submit a Risk Management Plan (RMP) describing the Risk Management Program at Domtar.  This document is intended to satisfy the RMP requirements of the RMP Rule and to provide the public with a description of the Risk Management Program at the facility.  This submittal is being provided to satisfy the five-year update requirement.\n\n\n\nThe Risk Management Program at the facility consists of four elements:\n\n\n\n1. A hazard assessment to help understand (a) the potential off-site consequences of hypothetical accidental releases and (b) accidents that may have occurred during the last five years associated with the use of the substances regulated by the RMP rule (Anhydrous Ammonia) - see topic 1.3;\n\n\n\n2. A prevention program to help maintain and safely operate the processes containing more than the threshold quantity of the regulated substances (covered processes) - see topic 1.4;\n\n\n\n3. An emergency response program to help respond to accidental releases of the regulated substances from the covered processes - see topic 1.6; and \n\n\n\n4. A management system that delineates responsibility for implementing and maintaining the Ris"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34575,
      "SummaryText": "k Management Plan.\n\n\n\nInformation further describing these elements is provided in this RM Plan.\n\n\n\nAlthough the Risk Management Program at the facility helps provide assurance that the facility is maintained and operated in a safe manner, it is only one component of the safety program at Domtar.  In fact, the facility has a comprehensive safety program in place establishing many levels of safeguards that are designed to minimize the potential for the release of any hazardous substance and injuries and damage resulting from the release of a hazardous substance.\n\n\n\nDomtar minimizes the potential releases of the hazardous substances used at the facility. When hazardous substances are used at the facility, the equipment is carefully designed, built, and operated to reduce the likelihood of an accidental release. Industry and government standards are closely adhered to in design, construction, and operation of the equipment.\n\n\n\nDomtar limits damage from a release, if such a release occurs. The facility trains workers to respond to upset conditions, reducing the consequences of a release if it occurs. In addition, the facility is working with the Local Emergency Planning Commission (LEPC) to help ensure that injuries and/or environmental damage will not occur in the event that a release does occur.\n\n\n\nThe safety programs at Domtar consist of a number of elements, only, some of which are required by the RMP Rule.  This Risk Management Plan is primarily intended to describe those parts of the safety program at the facility that are required by the RMP Rule.\n\n\n\n1.1    Accidental Release Prevention and Emergency Response Policies\n\n\n\nDomtar is committed to the safety of workers and the public, as well as the preservation of the environment through the prevention of accidental releases of hazardous substances.  The facility implements reasonable controls to prevent foreseeable releases of the hazardous substances.  These controls include training programs for personnel; programs "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34575,
      "SummaryText": "to help ensure safety in the design, installation, operation, and maintenance of the processes; and programs to evaluate the hazards at the facility.\n\n\n\nIn the event of an accidental release, the facility will control and contain the release in a manner that will be safe for workers and will help prevent injury to the public and/or the environment. Domtar provides response training for upset conditions to facility personnel, designates an emergency response coordinator to oversee response activities, and coordinates response efforts with the local emergency response organizations.\n\n\n\nIn order to effectively implement these policies, the facility has established a management system directed by the General Manager, Wisconsin Operations.\n\n\n\n1.2    Domtar A.W. Corp. (Domtar) Wisconsin Operations and Our Regulated Substance\n\n\n\nDomtar's Wisconsin Operations owns and operates a wastewater treatment facility used jointly by the Nekoosa Mill and the Port Edwards Mill.  The facility treats effluent from both mills.  Anhydrous ammonia is used as a nutrient in the wastewater treatment.  The anhydrous ammonia is stored under pressure (215 pounds per square inch, gage), as a liquid, in a 17,170-gallon capacity tank (water capacity), with administrative controls in the process safety information and operating procedures limiting storage to 85% of capacity.  Maximum storage is 85,850 pounds at the density of 5 #/gal.  The nutrient is fed to the aeration basin via a submerged transfer line.  The covered process, as defined by the OSHA PSM process boundary, includes the storage tank and 1-inch diameter transfer line.\n\n\n\n1.3    Off-Site Consequence Analysis\n\n\n\nDomtar performed an off-site consequence analysis to estimate the potential for an accidental release of the regulated substance to affect the public or the environment.  The off-site consequence analysis consists of evaluating both a worst-case release scenario and an alternative release case scenario.  The facility does not expect a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 34575,
      "SummaryText": " worst-case release scenario to ever occur. An alternative release scenario represents a release that (1) might occur at a facility like the Domtar wastewater treatment plant and (2) would result in an off-site consequence if the release occurred.  The alternative release scenarios will help the Local Emergency Planning Committee improve the community emergency response plan.\n\n\n\nThe main objective of performing the off-site consequence analysis is to determine the distance at which certain effects might occur to the public because of an accidental release (called the endpoint distance).  The following effects could occur at the endpoint distance:  At distances less than the endpoint distance, the effects would be greater; at distances greater than the endpoint distance, the effects would be less.\n\n\n\nWhen considering the release of a toxic substance, such as anhydrous ammonia, most people at the endpoint distance would be able to walk away from the exposure without any long-term health consequences, although some short-term consequences (e.g., strong eye or throat irritation) are likely.\n\n\n\nThe RMP Rule includes specific requirements for the worst-case and alternative release scenarios that must be reported by Domtar.  These requirements include:\n\n\n\n* One worst-case release scenario for a toxic substance in a Program Level 3 process (one scenario representing anhydrous ammonia), and \n\n* One alternative release scenario for each toxic substance in a Program Level 3 process (one scenario representing anhydrous ammonia).\n\n\n\nThe following information summarizes the off-site consequence analysis performed by Domtar.\n\n\n\n1.3.1 Program Level 3 Process - Anhydrous Ammonia Wastewater Treatment System\n\n\n\nThe worst-case release scenario for the Anhydrous Ammonia Wastewater Treatment System is the failure of the storage tank, releasing 85,850 pounds of the toxic material as a gas over a 10-minute period.  The predicted impact distance where concentrations are greater than the tox"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 34575,
      "SummaryText": "ic endpoint, extends beyond the Domtar facility property.  The RMP*Comp Model predicts an impact to a distance of 5.4 miles.  The estimated population within a circle of this radius is 9,200.  Several public receptors are also located within this distance (e.g., several industrial facilities, several public and private elementary schools and high schools, several nursing homes, several churches, several recreational parks, and numerous subdivisions). There are also several environmental receptors.\n\n\n\nThe alternative release scenario for anhydrous ammonia is a break in the one-inch diameter transfer line from the bottom of the storage tank, releasing gaseous ammonia for a period of 15 minutes before workers detect and shut down the process.  Considering the tank is under pressure (215 pounds per square inch, gage), and there are no pumps used, the choked flow formula (equation D-11 in the OCA Guide) is used to calculate the release rate from the tank.  According to Table 4-4, this rate is 2,231 pounds per minute, resulting in the release of  33,458 pounds of anhydrous ammonia, which, due to its buoyancy in air and low boiling point, is assumed to vaporize quickly and form a gaseous jet release at ground level. The maximum distance to the toxic endpoint for anhydrous ammonia for the alternative release scenario is 0.80 mile using the RMP*Comp Model.  The estimated population within a circle of this radius is 650.  Several public receptors are also located within this distance; e.g., another industrial facility, a recreational park, and subdivisions.  There are also several environmental receptors.\n\n\n\n1.4 Accidental Release Prevention Program\n\n\n\nDomtar has always used a prevention program to help prevent accidental releases of hazardous substances.  Beginning in 1992, the facility formalized this prevention program for the Anhydrous Ammonia Wastewater Treatment System to comply with the 14 elements of the Occupational Safety Administration and Health Administration's ("
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 34575,
      "SummaryText": "OSHA's) Process Safety Management (PSM) Prevention Program.  In 1996, the EPA RMP Rule established that a Program Level 3 Prevention Program would become a requirement for this process as well. The facility's Program Level 3 Prevention Program under the RMP Rule is essentially the same as the OSHA PSM Program, except that the program also focuses on protecting the public and the environment.\n\n\n\n1.4.1 The following sections briefly describe the elements of the Nekoosa Operations Program Level 3 Prevention Program that addresses the EPA RMP Rule prevention program requirements for the Anhydrous Ammonia Wastewater Treatment System.\n\n\n\n1. Employee Participation   The facility has developed a written employee participation program for the covered process to help ensure that the safety concerns of Nekoosa employees are addressed.  The facility encourages active participation from personnel in the development and maintenance of the prevention program activities of all processes at the facility.  Employees are consulted on, and informed about, all aspects of the RMP Rule prevention program, including the development of Process Hazard Analysis and Operating Procedures.\n\n\n\n2. Process Safety Information   The facility maintains a variety of technical documents that are used to help ensure the safe operation of the process.  The documents address (1) the hazards of the chemicals used in the process, (2) the technical data of the process, and (3) the design basis and configurations of the equipment used in the process.  The facility ensures that this process safety information is maintained, accurate, and available to all Nekoosa employees, and the Local Emergency Planning Committee (LEPC).  All of the information and documentation for the RMP Prevention Program is maintained in the PSM/RMP Center at the facility.\n\n\n\nMaterial safety data sheets (MSDS) document the physical and chemical properties of the hazardous substances handled at the facility, including non-regulated substa"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 34575,
      "SummaryText": "nces in the covered process.  MSDS for hazardous substances handled in each process are available in the control rooms so the operators have ready reference to this information.  In addition, MSDS are provided to the LEPC and/or Plant Emergency Response teams for use in helping formulate emergency response plans\n\n\n\nMany of the operating parameters are included in the technical information to help with the safe operation of the process.  These documents are also used (1) to train employees, (2) to perform process hazard analyses, and (3) to help maintain the equipment to the design specification.\n\n\n\n3. Process Hazard Analysis   Domtar/Nekoosa performs and periodically updates process hazard analyses (PHAs) of the covered processes to help identify process hazards and generate recommendations that might improve the safe operation of the process.  A team composed of personnel with engineering and process operating experience and a team leader with experience in performing process hazard analyses is assembled to analyze the process.  The facility primarily uses the \"What If /Checklist'\" technique, to perform this analysis.  The PHA team prepares a written report describing the results of the analysis, including recommendations. Responsibility for resolving the recommendations is assigned to personnel and, when appropriate, changes to enhance the safety of the process are implemented.\n\n\n\n4. Operating Procedure   Domtar's operators, supervisors, and engineers work together to develop and maintain accurate operating procedures to define how tasks related to process operations should be safely performed.  The operating procedures (1) are used to train employees and (2) serve as reference guides for appropriate actions to take during both normal operations and upset operating conditions.  The operating procedures include:\n\n\n\n-    Steps for safely conducting activities;\n\n\n\n-    Applicable process safety information, such as safe operating limits and                consequences of p"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 34575,
      "SummaryText": "me cases, the facility has developed such information through special projects. Additionally, operating limits, maximum intended inventories, and consequences of deviations not available from engineering design documentation were developed as part of PHAs.\n\n\n\nThe facility also maintains the following information pertaining to equipment in the regulated processes (as well as for many of the non-regulated processes):\n\n\n\n* Materials of construction;\n\n* Piping and instrument diagrams (P&IDs);\n\n* Electrical classification;\n\n* Relief system design and design basis;\n\n* Ventilation system design;\n\n* Design codes and standards employed;\n\n* Material and energy balances for processes built after 5/26/92; and \n\n* Safety systems (interlocks, detection, or suppression systems).\n\n\n\nAgain, most of this information comes from the engineering design documents for the processes, as well as from the facility's own maintenance files. Whenever required information was not available, the facility obtained the information from equipment vendors and plant engineering. In conjunction with the equipment information collection efforts, the facility documented that the equipment complies with recognized and generally accepted good engineering practices.\n\n\n\n\n\n\n\n3.0 PROCESS HAZARD ANALYSIS\n\n\n\nIn accordance with 40 CFR 68.67 of the RMP Rule, the facility uses process hazard analyses (PHAs) to systematically identify, evaluate, and control process hazards. The most important products of the PHA are recommendations for reducing the most significant risks of accidental chemical releases.  The facility ensures that all recommendations from the PHAs are resolved appropriately, and the facility ensures that information from the PHAs (including recommendation resolutions) is communicated to all potentially affected employees.\n\n\n\n3.l    Process Hazard Analysis Details\n\n\n\nThe facility conducts systematic PHAs of the regulated processes and other hazardous processes at the facility according to an established "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 34575,
      "SummaryText": "rocess deviations; and \n\n\n\n-     Safety and health considerations, such as chemical hazards, personal protective equipment requirements, and actions to take if exposure to a hazardous substance occurs.\n\n\n\nThe facility personnel develop and maintain operating procedures that cover all phases of the operations, including initial start-up, normal operations, normal shutdown, emergency shutdown, start-up following a standby condition or emergency shutdown, and temporary operations.  The facility reviews and certifies the operating procedures annually.\n\n\n\n\n\n5. Training   Domtar trains employees to safely and effectively perform their assigned tasks. The facility training program for process operators includes both the initial training and refresher training that covers (1) a general overview of the process, (2) the properties and hazards of the substance in the process, and (3) a detailed review of the process operating procedures and safe work practices.  Written tests and oral reviews are used to verify that the employee understands the training materials before the employee can operate the process.\n\n\n\nThe operators are consulted annually about the frequency of the training and the materials to be used for the training.  Recommendations from the operators are reviewed and changes to the training are implemented as appropriate.\n\n\n\n6. Contractors   Domtar has established a program to help ensure that contractor activities at the facility are performed in a safe manner.  The program reviews the safety record of all contractors to help ensure that the facility only hires contractors who can safely perform the desired job tasks.  Domtar explains to the contract supervisors and contract employees, the hazards of the process on which they and their employees will work, the facility safe work practices, and the emergency response procedures for the facility.  The facility requires that the contractor supervisors train each of their employees who will work on or near a covered pro"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 34575,
      "SummaryText": "cess before that employee begins work at the site.  The facility periodically reviews contractors' training documents and work performance to ensure that safe practices are followed.\n\n\n\n7. Pre-startup Safety Reviews   Domtar performs a safety review of new or modified equipment in the covered process before the process is placed into service to help ensure that the process has been prepared to operate safely. This review confirms that:\n\n\n\n-    Construction and equipment are in accordance with design specifications;\n\n\n\n-    Adequate safety, operating, maintenance and emergency procedures are in place;\n\n\n\n-    Employee training has been completed; and \n\n\n\n-    For a covered process, a PHA has been performed if the process is new or management of change requirements have been completed if an existing process has been modified.\n\n\n\nA pre-startup safety review checklist is completed to document the review and to ensure that the appropriate issues have been addressed.\n\n\n\n\n\n8. Mechanical Integrity   Domtar maintains the mechanical integrity of the covered process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  The facility mechanical integrity program includes (1) an inspection and testing program to help identify equipment deterioration and damage before the equipment fails and (2) a quality assurance program to help ensure that new and replacement equipment meet the design standards required for service in Nekoosa covered processes.  The facility mechanical integrity program also includes:\n\n\n\n-    Specifications for inspection and testing of process equipment;\n\n\n\n-    Specifications for replacement parts and equipment;\n\n\n\n-    Standard maintenance procedures for inspecting, testing, and maintaining process equipment;\n\n\n\n-    Procedures for safe work practices such as lockout/tag out, hot work and confined space entry;\n\n\n\n-    Training of maintenance personnel; and \n\n\n\n-    Documentation of maintenance activity.\n\n\n\n9. Hot Work Permit   Domtar h"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 34575,
      "SummaryText": "as established a hot work permit program to control spark or flame-producing activities that could result in fires or explosions in covered processes at the facility.  The facility reviewed OSHA's fire prevention and protection requirements in 29 CFR 1910.252(a) and created a Hot Work Permit form to comply with these requirements. Personnel who are to perform hot work are required to fill out the Hot Work Permit form.  T he supervisor reviews the completed form before work can be initiated.\n\n\n\n10. Management of Change   The Domtar \"management of change\" program evaluates and approves all proposed changes to chemicals, equipment, and procedures for a covered process to help ensure that the change does not negatively affect safe operations.  Process changes that are determined to be a replacement in kind are allowed without completing a \"management of change\" form.  All other changes must be confirmed through the full \"management of change\" program to help ensure that inadvertent consequences of the process changes are prevented, safety consequences of the changes are addressed, affected process safety information and operating procedures are updated, and affected employees are notified of the changes.\n\n\n\n11. Incident Investigations   Domtar investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented.  The facility trains employees to identify and report any incident requiring investigation.  An incident investigation team is assembled, and the investigation is initiated within 48 hours of the incident.  The results of the investigations are documented, recommendations are resolved, and appropriate process enhancements are implemented.\n\n\n\n12. Compliance Audits   Domtar audits the covered processes to be certain that the facility's prevention program is effectively addressing the safety issues of the operations.  The facility assembles an audit team that inclu"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 34575,
      "SummaryText": "des personnel knowledgeable in the RMP Rule and in the process, and this team evaluates whether the prevention program satisfies the requirements of the RMP Rule and, also whether the prevention program is sufficient to help ensure safe operations of the process.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n\n\n\n1.5 Five-Year Accident History\n\n\n\nThere have been no accidental releases of anhydrous ammonia in the past five years that resulted in deaths, injuries or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.  The secondary treatment system was started up in 1976 using anhydrous ammonia as a nutrient for the organisms that cleanse the process water.  Since start-up, there have been no accidental releases that caused injury, damage or off-site consequences for this 28-year period.\n\n\n\n1.6 Emergency Response Programs\n\n\n\nDomtar/Nekoosa has established a written Emergency Response Program to help safely respond to accidental releases of hazardous substances. The Emergency Response Plan includes procedures for:\n\n\n\n- Informing the local response organizations and the public about accidental releases that could reasonably result in off-site consequences;\n\n\n\n- Providing proper first aid and emergency medical treatment to treat accidental human exposure to hazardous substances at the facility;\n\n\n\n- Controlling and containing accidental releases of hazardous substances, including the use of emergency response equipment;\n\n\n\n- Inspecting and maintaining emergency response equipment; and \n\n\n\n- Reviewing and updating the Emergency Response Plan.\n\n\n\nThe facility maintains an Emergency Response Team (HAZMAT Team) trained in these emergency response procedures.  All the facility personnel are trained in evacuation procedures. The facility periodically conducts emergency response drills, in"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 34575,
      "SummaryText": "cluding an annual drill coordinated with the local fire department.\n\n\n\nThe written Emergency Response Plan complies with other federal contingency plan regulations and will be communicated to local emergency response officials through the Local Emergency Planning Committee.  The facility maintains a regular dialogue with the local emergency response organizations and provides appropriate information to them.\n\n\n\n2.    REGISTRATION\n\n\n\nFacility:  Wastewater Treatment Plant\n\nSafety Management:\n\n\n\n\n\n\n\n\n\nName\n\nDomtar A.W. Corp.\n\n\n\n\n\nAddress 1\n\n(Fire No.)  405 Church Avenue\n\nDate of Last Inspection:\n\n\n\nAddress 2\n\n\n\nInspection Performed By:\n\n\n\nCity\n\nNekoosa\n\n\n\n\n\nCounty\n\nWood\n\nOSHA\n\n10/1/2003\n\nState\n\nWisconsin\n\nEPA\n\n8/21/96\n\nZip Code\n\n54457\n\nState EPA\n\n3/16/04\n\nLatitude deg\n\n044\n\nFire Department  \n\n2003\n\nLatitude min\n\n19\n\nCorporate  \n\n9/2003\n\nLatitude sec\n\n42\n\n\n\n\n\nLongitude deg\n\n089\n\n\n\n\n\nLongitude min\n\n52\n\nCovered By:\n\n\n\nLongitude sec\n\n48\n\n\n\n\n\nD&B No. \n\n20-216-9744\n\nOSHA PSM\n\nYes\n\nEPA Identifier\n\nWID980613319\n\nEPCRA Section 302\n\nYes \n\nNo. of Employees\n\n20\n\nCAA Title V Operating Permit\n\nNo\n\n\n\n\n\n\n\n\n\n\n\n\n\nPart 68 Implementation:\n\n\n\nOwner/Operator:\n\n\n\n\n\n\n\n\n\nContact Name  Daniel O. Cummins\n\n\n\nName\n\nDomtar A. W. Corp.\n\nTitle PSM/RMP Coordinator\n\n\n\nAddress\n\n100 Wisconsin River Drive\n\n\n\n\n\n\n\n\n\n\n\n\n\nCity\n\nPort Edwards\n\nEmergency Contact:\n\nState\n\nWisconsin\n\n\n\nZip Code\n\n54469\n\nName:   Daniel O. Cummins\n\n\n\nTelephone No.\n\n715-887-5293\n\nTitle:     PSM/RMP Coordinator\n\n\n\n\n\n\n\nTelephone No. 715-887-5515\n\n\n\n\n\n\n\n24-Hour Telephone No.           \n\n         715 - 886 - 7376\n\nNekoosa Load Dispatcher\n\nParent Company:\n\n\n\n\n\n\n\n\n\n\n\n\n\nName\n\nDomtar Inc.\n\n\n\n\n\nD&B No.\n\n20-216-9744\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nProcess:  Anhydrous ammonia Solution System\n\n\n\nDescription\n\nBoundaries\n\nComments\n\n\n\nCovered\n\nExempt\n\nOperating\n\nLevel\n\nEligible\n\nPSM\n\nNAICS\n\nYes\n\nNo\n\nYes\n\n3\n\n3\n\nYes\n\n322121\n\nThe facility treats effluent from the Nekoosa and Port Edwards mills.  Anhydrous ammonia is used as a nutrient in the wastewater treatment at the tr"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 34575,
      "SummaryText": "eatment plant.  The anhydrous ammonia is stored under pressure (215 pounds-per-square-inch, gage), as a liquid, in a 17,170-gallon capacity tank (water capacity), with administrative controls limiting storage to 85% of capacity.  Maximum storage is 85,850 pounds.  The nutrient is fed to the aeration basin via submerged transfer lines.  \n\n\n\nThe covered process, as defined by the OSHA PSM process boundary, includes the storage tank and 1 inch diameter transfer line.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSubstances\n\nCAS No.\n\nCovered\n\nQuantity (lbs.)\n\nExempt\n\nIn ERP\n\nComment\n\n\n\n\n\nAnhydrous ammonia\n\n7664-41-7\n\nYes\n\n85,850\n\nNo\n\nYes\n\n\n\n\n\n\n\nProcess\n\nProgram \n\nLevel\n\nEligible \n\nLevel\n\nAccident \n\nHistory\n\nW-C \n\nScenario\n\nResponse \n\nCoordination\n\nPSM \n\nCovered\n\nSIC \n\nTargeted\n\nAnhydrous Ammonia Wastewater Treatment System\n\n3\n\n3\n\nNo\n\nYes\n\nYes\n\nYes\n\nNo\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n3.OFF-SITE CONSEQUENCE ANALYSIS\n\n\n\n\n\n\n\nSubstances Released:\n\nSubstance\n\nCAS No.\n\nHazard\n\n\n\nAnhydrous Ammonia \n\n7664-41-7\n\nToxic\n\n\n\n\n\n\n\n\n\n\n\nScenario:\n\n\n\nSubstance Released:\n\n\n\nName\n\nRupture of the Anhydrous Ammonia Storage\n\nSubstance\n\nAnhydrous Ammonia\n\nEvent Type\n\nToxic Release\n\nCAS No.\n\n7664-41-7\n\nScenario Type\n\nWorst Case Scenario\n\nHazard\n\nToxic\n\nMethodology\n\nRMP*Comp\n\n\n\n\n\nTopography \n\nRural\n\n\n\n\n\nSelected\n\nYes\n\n\n\n\n\n\n\n85,850#\n\n\n\n\n\nRelease:\n\n\n\nMeteorology:\n\n\n\n\n\n\n\nWind Speed\n\n1.5 m/s\n\n\n\n\n\nTemperature\n\n25.0 (C\n\nDuration\n\n10.0 min.\n\nStability Class\n\nF\n\nPhysical State\n\nLiquid boiling to gas\n\nRelative Humidity\n\n50.0 %\n\nDistance to Endpoint\n\n5.4 miles\n\n\n\n\n\nDistance to Closest Public Receptor\n\n0.6 miles\n\n\n\n\n\n\n\nScenario Description\n\nBasis for Assumptions\n\nMeteorology Justification\n\nEPA OCA Summary\n\nRupture of the Storage Tank\n\nThe Rule requires analysis to be based on loss of storage in ten minutes.\n\nSpecified by EPA for worst case\n\nDistance to endpoint:  5.4 miles\n\n\n\nToxic endpoint: 0. 14   mg/l  \n\n\n\nEPA RMP*Comp Model used.\n\n\n\nRelease rate to atmosphere: 8,590 lb/min\n\n\n\nSubstances Released:\n\nSubstance\n\nCAS No.\n\nMass Frac"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 34575,
      "SummaryText": "tion\n\n\n\nAnhydrous ammonia \n\n7664-41-7\n\n100%\n\n\n\n\n\n\n\n\n\n\n\nScenario:\n\n\n\nMixture:\n\n\n\nName\n\nPipeline break\n\nName\n\nAnhydrous ammonia\n\nEvent Type\n\nToxic Release\n\nHazard\n\nToxic\n\nScenario Type\n\nAlternative Scenario\n\nHazard of Interest\n\nAnhydrous ammonia\n\nMethodology\n\nRMP*Comp\n\n\n\n\n\nTopography \n\nRural\n\n\n\n\n\nSelected\n\nYes\n\n\n\n\n\n\n\n\n\n\n\n\n\nRelease:\n\n\n\nMeteorology:\n\n\n\nQuantity   \n\n33,465 lbs.\n\nWind Speed\n\n3.0 m/s\n\nRate   \n\n2,231 #/min\n\nTemperature\n\n25.0 (C\n\nDuration  \n\n15 min.\n\nStability Class\n\nD\n\nPhysical State  \n\nLiquid, vaporizing to gas\n\nRelative Humidity\n\n50.0 %\n\nDistance to Endpoint  \n\n0.8 mile\n\n\n\n\n\nDistance to Closest Public Receptor\n\n0.6 mile\n\n\n\n\n\n\n\nScenario Description\n\nBasis for Assumptions\n\nMeteorology Justification\n\nEPA OCA Summary\n\n15-minute failure of one-inch transfer line from pressurized (215-psig) storage tank.  This allows anhydrous ammonia to be released for 15 minutes until an employee can isolate the tank and stop the flow.\n\nUsing the choked flow formula in equation D-11 from the EPA OCA guide, a release rate from the pressurized tank of 2,231 lb/min will be assumed to last for the duration of the release.  The ammonia system is very simple and other than a tank failure, a pipeline failure has the next most severe consequences.   There were no recorded releases in the five-year accident history to provide potential alternate scenarios.\n\nGuidance from EPA OCA guideline for alternative scenarios: 3 m/s speed, D stability.\n\nDistance to endpoint: 0.8 mile\n\n\n\nToxic endpoint:    0.14  mg/l)\n\n\n\nEPA  RMP*Comp Model used.\n\n\n\n\n\n\n\n\n\n4.    PROGRAM LEVEL 3 PREVENTION PROGRAM\n\n\n\n\n\nPrevention Program Data Elements\n\n\n\nAnhydrous Ammonia Wastewater Treatment System\n\n\n\nNAICS code:    322121\n\n\n\nSubstances\n\nCAS No.\n\nAnhydrous ammonia\n\n7664-41-7\n\n\n\nThe date that safety information was last reviewed:    \n\nPHA April 30, 1999\n\n\n\nThe completion date of the most recent PHA or update:     June 11, 2004\n\nPHA Technique Used:\n\n    What-If    No\n\n    Checklist    No\n\n    What-If Checklist    Yes\n\n    HAZOP    No\n\n    Fault Tree Analy"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 34575,
      "SummaryText": "sis    No\n\n    FMEA    No\n\n    Other\n\n\n\nThe expected completion date of any changes resulting from the PHA:    December 31, 2004\n\n\n\n\n\nMajor Hazards Identified:\n\n    Toxic release    Yes\n\n    Fire    Yes\n\n    Explosion    Yes\n\n    Runaway reaction    Yes\n\n    Polymerization    No\n\n    Overpressurization    Yes\n\n    Corrosion    Yes\n\n    Overfilling    Yes\n\n    Contamination    Yes\n\n    Equipment failure    Yes\n\n    Loss of utilities (cooling, air, etc.)    Yes\n\n    Earthquake    Yes\n\n    Floods (floodplain)    Yes\n\n    Tornado    Yes\n\n    Hurricanes    No\n\n\n\nPrevention Program Data Elements\n\n\n\n\n\nProcess Controls in Use:\n\n    Vents    Yes\n\n    Relief Devices    Yes\n\n    Check valves    Yes\n\n    Scrubbers    No\n\n    Flares    No\n\n    Manual shutoffs    Yes\n\n    Automatic shutoffs    Yes\n\n    Interlocks    Yes\n\n    Alarms and procedures    Yes\n\n    Keyed bypass    Yes\n\n    Emergency air supply    Yes\n\n    Emergency power    No\n\n    Back-up pump    No\n\n    Grounding equipment    Yes\n\n    Inhibitor addition    No\n\n    Rupture disks    No\n\n    Excess flow device    No\n\n    Quench System    No\n\n    Purge System    No\n\n\n\n\n\nMitigation System in Use:\n\n    Sprinkler system    No\n\n    Dikes    No\n\n    Fire walls    No\n\n    Blast walls    No\n\n    Deluge system    No\n\n    Water curtain    No\n\n    Enclosure    No\n\n    Neutralization    No\n\n\n\n\n\nMonitoring/Detection System in Use:\n\n    Process area detectors    Yes\n\n    Perimeter monitors    No\n\n\n\nPrevention Program\n\n\n\n1.0 INTRODUCTION\n\n\n\nAt Domtar, the Wastewater Treatment facility takes a systematic, proactive approach to preventing accidental releases of hazardous chemicals.  The management systems address each of the key features of successful accident prevention programs including:\n\n\n\n(    Process safety information (PSI)\n\n(    Process hazard analysis (PHA)\n\n(    Operating procedures (OP)\n\n(    Training (Trg)\n\n(    Mechanical integrity (MI)\n\n(    Management of change (MOC)\n\n(    Pre-startup review (PSSR)\n\n(    Compliance audits (CA)\n\n(    Incident investigation (II)\n\n(    Employee participation (EP)\n\n(    Hot work permit (HW)\n\n(    Contractors (Contr).\n\n\n\nThese individual elements of the accident prevention program work together to prevent accidental chemical releases.  The company and employees are committed to the standard that these m"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 34575,
      "SummaryText": "anagement systems set for the way the facility does business, and have specific accountabilities and controls to ensure that the facility is meeting their own high standards for accident prevention.\n\n\n\n2.0 PROCESS SAFETY INFORMATION\n\n\n\nIn accordance with 40 CFR 68.65 of the RMP Rule, the facility systematically controls the creation, updating, and retention of written documentation associated with the process chemicals, process technology, and process equipment.  This information is essential for supporting all of the other elements of the Risk Management Program.  The facility also uses this information directly to ensure that the equipment is suitable for its intended use.\n\n\n\n\n\n\n\n2.1 Process Safety Information Details\n\n\n\nThe facility maintains the following chemical process information for each regulated substance in a covered process as well as for other hazardous materials in both covered, and non-covered, processes:\n\n\n\n* Toxicity information;\n\n* Permissible exposure limits;\n\n* Physical data;\n\n* Reactivity data;\n\n* Corrosivity data;\n\n* Thermal and chemical stability data; and \n\n* Hazardous effects of inadvertent mixing of different materials that could foreseeably occur.\n\n\n\nThe facility uses material safety data sheets (MSDS) to provide most of the process chemical information.  Whenever required information, such as corrosivity data or hazardous effects of inadvertent mixing is not available in MSDS, the facility develops the missing data from other sources and provides it in separate documents.\n\n\n\nThe facility maintains the following required process technology information:\n\n\n\n* Block flow or simplified process flow diagram;\n\n* Process chemistry;\n\n* Maximum intended inventory;\n\n* Safe upper and lower limits for parameters, such as temperature, pressure, flow, or composition; and \n\n* Evaluation of the consequences of deviations from established operating limits.\n\n\n\nMost of this information comes from the engineering design documents for the processes, but in so"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 34575,
      "SummaryText": "schedule.  This schedule ensures that the facility (1) address each process in a prioritized order (based on the extent of process hazards, the number of potentially affected employees and/or off-site population, the age of the process, and the operating history of the process); and, (2) update/revalidate each PHA at least every five years (or more often if necessary because of process changes).  The facility also conducts PHAs of all new processes before those processes are placed in service.\n\n\n\nThe facility primarily uses the \"What-If /Checklist\" technique to perform PHAs, although the facility can use other EPA/OSHA-approved techniques when they are more appropriate for specific applications.\n\n\n\nThe facility PHA teams are composed of personnel with engineering and process operating experience, including at least one person who has knowledge and experience in the process to be evaluated and a PHA team leader trained in the application of the hazard evaluation technique used for the PHA.\n\n\n\nThe facility has a system in place to promptly resolve PHA team findings and recommendations, and communicate findings/recommendation resolutions to potentially affected personnel.\n\n\n\nPHAs are implemented in a written report for each analysis soon after the analysis meetings are completed.  The managers review and resolve the PHA recommendations after receiving the report.  The facility maintains a written action plan tracking the resolution status of each recommendation, including an assigned individual responsible for resolving each recommendation and a target completion date.  The facility documents the final resolution of each recommendation, and advises the PHA team of any recommendations that are rejected.\n\n\n\n\n\n4.0 OPERATING PROCEDURES\n\n\n\nIn accordance with 40 CFR 68.69 of the RMP Rule, the facility uses operating procedures to define how process-related job tasks assigned to personnel should be performed to avoid incidents.  The facility uses these procedures to (1) train"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 34575,
      "SummaryText": " employees before they perform tasks in the field, (2) serve as reference guides for personnel performing tasks, and (3) specify what to do if a process upset or operating emergency occurs.\n\n\n\n4.1    Operating Procedure Details\n\n\n\nThe facility's engineers, operators, and shift supervisors work together to develop and maintain operating procedures for all phases of operations including:\n\n\n\n* Initial start-up;\n\n* Normal operations;\n\n* Temporary operations;\n\n* Emergency shutdown, including the conditions under which emergency shutdown is required and assignment of shutdown responsibility to qualified operators to ensure that emergency shutdown is executed in a safe and timely manner;\n\n* Emergency operations;\n\n* Normal shutdown; and \n\n* Start-up following a turnaround or after an emergency shutdown.\n\n\n\nThe facility development teams use PSI, information from process designers/equipment manufacturers, and their own experience to create and validate the procedures.\n\n\n\nThe procedures address the following information:\n\n\n\n* Steps for safely conducting activities;\n\n* Safe operating limits;\n\n* Consequences of process deviations, as well as steps required to correct or avoid such deviations;\n\n* Safety and health considerations including, (1) properties of, and hazards presented by, the chemicals used in the process, (2) precautions necessary to prevent exposure, including engineering controls, administrative controls, and personal protective equipment, (3) control measures to be taken if physical contact or airborne exposure occurs, (4) quality control for raw materials and control of regulated substance inventory levels, and (5) any special or unique hazards; and \n\n* Safety systems and their functions.\n\n\n\nIn addition to the process-specific procedures, the facility also develops and maintains more widely applicable safe work practices addressing issues such as lockout/tag out, confined space entry, opening process equipment or piping, and control over entry to processes.  These "
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 34575,
      "SummaryText": "safe work practices apply to employees and contractors.\n\n\n\nThe facility has a formal review process to approve procedures and changes to procedures. Furthermore, the facility annually reviews existing procedures, makes any needed revisions, and certifies the procedures as current and accurate.  Changes to procedures are communicated to all affected employees.  The facility keeps procedures in locations that are readily accessible to employees who may need the procedures.\n\n\n\n\n\n5.0 TRAINING\n\n\n\nIn accordance with 40 CFR 68.71 of the RMP Rule, the facility trains employees to safely perform their assigned tasks.  The training program includes initial training, as well as periodic refresher training and training updates when major process/equipment changes are made.  As part of the training, the facility includes provisions for ensuring that employees understand the training (written tests, field demonstrations, etc.).\n\n\n\n5.1 Training Details\n\n\n\nThe facility provides the operators with initial and refresher training, which includes a general overview of the process, properties of chemicals in the process, and safety and health hazards, as well as a detailed understanding of the process operating procedures and safe work practices.  The facility provides initial training to new operators before they are allowed to work independently as operators.\n\n\n\nPeriodically, at least every three years, the facility provides the operators with refresher training that, depending on job classification, can include operating procedures training, equipment-specific training, and/or advanced (beyond HAZCOM) chemical-specific training.  The refresher training courses emphasize process overview information, safe work practices, operating procedures that are rarely used, such as emergency shutdown, emergency operation and start up following an emergency shutdown, and any operating issues requested by the shift group.  The operators are consulted annually on the frequency of refresher training"
    },
    {
      "ESSeqNum": 20,
      "FacilityID": 34575,
      "SummaryText": ", and their input is documented and considered when preparing training schedules.\n\n\n\nAll training is certified by some form of evaluation to verify that the completed training has been understood.  The facility may use physical demonstration of skills, oral reviews using a one-on-one format, or written tests, or a combination of those methods, as appropriate.  The facility does not allow resumption of work until minimum testing requirements are met.\n\n\n\nAll training is documented and includes the employee's name, date of training, and the means used to verify that the employee understood the training.\n\n\n\n\n\n6.0 MECHANICAL INTEGRITY\n\n\n\nIn accordance with 40 CFR 68.73 of the RMP Rule, the facility maintains the mechanical integrity (MI) of the process equipment using an inspection and testing program and a quality assurance program, and ensures that the equipment is designed and installed correctly so that it operates properly.  The facility trains maintenance personnel in the hazards of the process, and also provides additional training on procedures for maintaining the ongoing integrity of the process equipment so that job tasks are performed safely.\n\n\n\n6.1 Mechanical Integrity Details\n\n\n\nThe facility considers all process-related equipment and safety systems that are critical for preventing and/or mitigating releases of regulated substances to be covered by the MI program. Examples include:\n\n\n\n* Pressure vessels and storage tanks;\n\n* Piping systems, including valves;\n\n* Relief and vent systems and devices;\n\n* Emergency shutdown systems; and \n\n* Controls, such as monitoring devices, sensors, alarms, and interlocks pumps.\n\n\n\nThe MI program uses preventive maintenance activities to identify equipment that is deteriorating and needs repair or replacement before failure occurs.  This program also specifies the repairs (or parts replacement) needed to return deteriorated equipment to acceptable specifications.  The facility maintains written procedures that support the MI "
    },
    {
      "ESSeqNum": 21,
      "FacilityID": 34575,
      "SummaryText": "program as follows:\n\n\n\n* Standard maintenance procedures describe the methods that mechanics use to perform repairs, replacements, and installations.\n\n\n\n* Procedures for safe work practices and safety policies specify safe practices for performing maintenance tasks, such as lockout/tag out, hot work, confined space entry, line or equipment opening, and control over entry for a covered process by plant and/or contract maintenance personnel.\n\n\n\n* The inspection, testing, and preventive maintenance procedures describe the methods used by mechanics to perform inspections, tests, and preventive maintenance tasks on process equipment. These procedures follow generally accepted good engineering practices. The equipment inspection and testing frequency is based on mean time to failure estimates provided by the manufacturer, adjusted by the facility's own experience.\n\n\n\nThe facility documents all inspection, testing, and preventive maintenance activities including:\n\n\n\n* Date of inspection, test, or preventive maintenance;\n\n* Person performing the activity;\n\n* Equipment identifier;\n\n* Description of the activity performed; and \n\n* Results of the activity (including any deficiencies noted).\n\n\n\nThe facility identifies equipment deficiencies through the inspection, testing, and preventive maintenance activities or from routine operating and maintenance tasks and corrects them promptly.  If the facility cannot immediately correct identified equipment deficiencies, the facility implements protective measures to ensure safe operation until repairs can be made.\n\n\n\nThe facility has a quality assurance program that addresses new facilities, equipment, maintenance materials, and spare parts.  The program seeks to verify proper fabrication of new equipment, proper installation of new or repaired/replaced equipment, and use of suitable maintenance materials and spare parts in the preventive maintenance and repair tasks.\n\n\n\nThe facility has a comprehensive training program covering all MI"
    },
    {
      "ESSeqNum": 22,
      "FacilityID": 34575,
      "SummaryText": " issues.  The program uses the procedures described previously.  For example, all mechanics, maintenance supervisors, and maintenance engineers are trained on hazards for all RMP-covered processes and on safe work practices.  The maintenance personnel also receive training on safe maintenance procedures, preventive maintenance practices, and special skills requiring craft certification.  All training, as described above, occurs before employees perform tasks in RMP-covered areas independently.\n\n\n\n\n\n7.0 MANAGEMENT OF CHANGE\n\n\n\nIn accordance with 40 CFR 68.75 of the RMP Rule, the facility evaluates and approves all proposed changes (i.e., modifications that are not replacements in kind) to covered process chemicals, technology, equipment, and procedures prior to implementation through the management of change (MOC) program.  This program helps ensure that inadvertent or unintended changes are prevented, that any safety and health impacts are addressed, that affected procedures are updated, and that employees and contract employees are informed of, and trained in, the approved changes.  The facility uses this close scrutiny of all changes to help ensure that changes do not adversely impact employees, public safety, or the environment.\n\n\n\n7.1 Management of Change Details\n\n\n\nThe facility analyzes each proposed change and confirms that:\n\n\n\n* The technical basis for the change is appropriate;\n\n* The safety and health impacts of the change are understood and appropriate controls are in place;\n\n* The procedures are modified as appropriate for the change;\n\n* The permissible time period is established for temporary changes; and\n\n* The change is authorized by appropriate personnel.\n\n\n\nThe MOC procedure contains a step-by-step description of the confirmation process. It defines and provides examples of changes and replacements in kind.  Also, it describes, in detail, the requirement for each confirmation step based on the type of change being considered.  The facility uses a Man"
    },
    {
      "ESSeqNum": 23,
      "FacilityID": 34575,
      "SummaryText": "agement of Change Form to document each step in the confirmation process. Changes that pass the confirmation criteria are communicated to the employees who are affected by the change before the change is implemented.  When approved changes require updates to the process safety information and/or operating procedures, the facility revises these documents and trains employees on these changes before operations resume.  All training is documented as formal operator training.\n\n\n\n8.0 PRE-STARTUP REVIEW\n\n\n\nIn accordance with 40 CFR 68.77 of the RMP Rule, the facility performs pre-startup safety reviews as a final check to ensure the safety of a new or modified process before it is placed in service.\n\n\n\n8.1 Pre-Startup Review Details\n\n\n\nThe facility performs pre-startup reviews on new stationary sources and on modified stationary sources when the modification is significant enough to require a change in the process safety information.  The pre-startup review is completed before regulated substances are brought into the process and only after the facility has confirmed that:\n\n\n\n* Construction and equipment are in accordance with design specifications;\n\n* Safety, maintenance, operating, and emergency procedures are in place and are adequate;\n\n* PHAs have been performed on new stationary sources and all recommendations have been resolved;\n\n* MOC requirements have been satisfied for modified processes; and \n\n* Training has been completed (and documented) for affected employees.\n\n\n\nThe facility uses a Pre-Startup Safety Review Checklist as an aid in documenting the performance of the pre-startup reviews. .The Checklist contains a list of safety questions covering process considerations that must be addressed prior to start up.  The person responsible for the project prepares the Pre-Startup Safety Review Checklist and Approval Form and provides the names of the reviewer responsible for confirmation of each of the pre-startup review safety questions.  Each reviewer signs off on "
    },
    {
      "ESSeqNum": 24,
      "FacilityID": 34575,
      "SummaryText": "the Checklist and Approval Form when satisfied that all assigned safety questions are complete and no problems exist.  All reviewers must sign off on the Pre-Startup Safety Review Checklist and Approval Form before start-up can be authorized.\n\n\n\n\n\n9.0 COMPLIANCE AUDITS\n\n\n\nIn accordance with 40 CFR 68.79 of the RMP Rule, the facility audits the RMP-covered processes to be certain that the prevention programs are effective.  The compliance audit program seeks to confirm that RMP prevention program practices for the covered process are consistent with written programs, that the programs adequately address all requirements of the RMP regulations, and that management systems are in place to ensure continued compliance.\n\n\n\n\n\n9.1    Compliance Audit Details\n\n\n\nThe facility conducts and certifies compliance audits of the prevention program for RMP-covered processes at least every three years.  The facility integrates these audits into PSM audits.  The audit teams consist of a team leader and an appropriate number of team members based on the size and complexity of the processes to be audited.  The audit team collectively possesses the following skills and knowledge:\n\n\n\n* Ability to understand the prevention program requirements of the RMP regulation (49 CFR Part 68);\n\n* Capability to conduct interviews and collect audit data;\n\n* Capability to document audit results; and \n\n* Knowledge of the process to be audited.\n\n\n\nThe audit team members receive training in RMP regulatory requirements, interview techniques, and methods for data collection before participating in an audit.  They use a protocol or a check sheet that contains a series of questions that systematically address each requirement of the RMP regulation.  The team leader assigns each auditor specific RMP elements to cover in the audit. Information obtained through field observations, interviews, and document review is documented, and deficiencies or non-compliances are identified.  At the conclusion of the audit, the a"
    },
    {
      "ESSeqNum": 25,
      "FacilityID": 34575,
      "SummaryText": "udit team prepares a report that identifies any specific non-compliance issues that need to be addressed.\n\n\n\nThe facility promptly reviews the audit findings, determines an appropriate response for each finding, assigns responsibility for implementation of a corrective action, and assigns a target completion date.  The corrective actions are placed in a tracking system and progress is monitored quarterly until open issues are resolved.  The facility retains the two most recent audit reports.\n\n\n\n\n\n10.0 INCIDENT INVESTIGATION\n\n\n\nIn accordance with 40 CFR 68.81 of the RMP Rule, the facility performs incident investigations to help ensure that incidents with catastrophic magnitude or potential are thoroughly investigated, root causes are identified and corrected, and relevant findings are communicated throughout the organization to help prevent a recurrence.\n\n\n\n10.1 Incident Investigation Details\n\n\n\nThe facility investigates all incidents (including near misses) that result in, or could reasonably have resulted in, a large uncontrolled release of a regulated substance, serious injuries to employees or the public, and/or damage to the environment.  The facility trains employees to identify occurrences requiring investigation and to notify the appropriate person should such an event occur.  If the incident meets RMP-classification criteria, the facility initiates an investigation within 48 hours. The facility assembles an investigation team consisting of:\n\n\n\n* At least one person knowledgeable in the process or activity involved;\n\n* A contract employee if the incident or near miss incident involved the work of a contractor or had acute, adverse health effects on contract employees; and \n\n* Others with appropriate knowledge and skills to thoroughly investigate and analyze the event.\n\n\n\nThe facility trains investigation team leaders in investigation techniques, including root cause analysis.  The investigation team follows a written investigation protocol that addresses the"
    },
    {
      "ESSeqNum": 26,
      "FacilityID": 34575,
      "SummaryText": " key steps of fact-finding, determination of cause, and development of recommendations/actions to be taken.  From the raw data collected, the incident investigation team prepares the text for an incident summary report, which contains:\n\n\n\n* Date and time of the event;\n\n* Date and time the investigation started;\n\n* Description of the event;\n\n* Identification of contributing factors and root causes; and \n\n* Recommendations from the investigation.\n\n\n\nThe facility resolves the report recommendations and develops action plans that are tracked to completion.  The facility reviews the incident investigation report and action plan items with employees (and contract employees, as appropriate) who work in the affected area and/or perform job tasks relevant to the investigation findings.  The facility accomplishes this review by discussing the event at the next safety meeting or in shift meetings.  The facility retains incident reports for at least five years.\n\n\n\n11.0 EMPLOYEE PARTICIPATION\n\n\n\nIn accordance with 40 CFR 68.83 of the RMP Rule, the employee participation plan helps ensure that all employees have appropriate involvement in developing and implementing the RMP.\n\n\n\n11.1 Employee Participation Details\n\n\n\nThe facility has a written employee participation program that meets RMP requirements. In this document, the facility describes, in detail, the many different ways that employees participate in each element of the RMP regulations.  The facility periodically updates this document as changes occur.\n\n\n\nThe facility consults with employees and their representatives on ways to improve participation in the RMP.\n\n\n\n12.0 HOT WORK PERMITS\n\n\n\nIn accordance with 40 CFR 68.85 of the RMP Rule, the facility uses a hot work permit program to ensure that OSHA's fire prevention and protection precautions, specified in 29 CFR 1910.252(a), are in place before hot work (work involving electric or gas welding, cutting, brazing, or similar flame or spark-producing operation) begins on or n"
    },
    {
      "ESSeqNum": 27,
      "FacilityID": 34575,
      "SummaryText": "ear an RMP-covered process.\n\n\n\n12.1    Hot Work Permit Details\n\n\n\nThe facility studied OSHA's fire prevention and protection regulation in 29 CFR 1910.252(a) and developed a procedure that addresses these requirements.  The facility also created a Hot Work Permit Form to document job requirements, the dates for the hot work, and the object on which the work is to be performed.   New employees are trained on the hot work permit procedure as part of the safe work practices orientation.   The Manager of Safety audits completed Hot Work Permit Forms to ensure that any errors in preparation or approval are identified and brought to the attention of those involved to prevent recurrence.\n\n\n\n\n\n13.0 CONTRACTORS\n\n\n\nIn accordance with 40 CFR 68.87 of the RMP Rule, the facility has a contractor screening procedure to help ensure that the facility hires and uses only contractors who accomplish the desired job tasks without compromising the safety and health of plant employees, the public, or the environment.\n\n\n\n\n\n13.1    Contractor Details\n\n\n\nThe facility has a detailed contractor safety program that applies to contractors performing maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to an RMP-covered process.  This program does not apply to contractors providing incidental services that do not influence process safety.\n\n\n\nThe facility selects contractors based on prior site work history and on information that they are required to provide as part of the bid process.  The bid information includes their current safety programs (i.e., safety organization, employee education and training, and accident prevention program) and their prior safety performance (i.e., OSHA injury rates, property loss experience, regulatory compliance history, and worker's compensation insurance experience).  Bidders that do not provide all of the requested information, that do not have the desired skills, or that have an unsatisfactory safety record, are dropped from further "
    },
    {
      "ESSeqNum": 28,
      "FacilityID": 34575,
      "SummaryText": "consideration.  Contractors that meet the safety requirements are then judged on who can do a quality job at the lowest cost.  If a contractor currently working in the plant is under consideration, the facility reviews recent safety evaluations and safety records to verify satisfactory job performance before the facility authorizes the purchase order.\n\n\n\nThe facility provides a safety orientation for Contractor Supervisors and Contractor Employees before they begin work on site.  The facility uses the orientation meeting to familiarize contractors with the type of operations and associated hazards in the areas in which they will be working.  The facility provides copies of the Contractor Safety Manual, which contains plant safety rules/policies, safe work practices, a material hazards summary, and an outline of emergency actions for contractors.  The facility provides MSDS for the hazardous materials that may affect the contractor work area, copies of plant safe work practices and policies, and emergency response actions associated with the contractor's work.  The facility then takes the Contractor Supervisors on a tour of the job site to point out the hazards discussed in the meeting, introduce personnel with whom they will communicate, and show where medical attention may be provided.\n\n\n\nThe facility requires contractors to perform the following tasks to help ensure process safety:\n\n\n\n* Train each of their employees in the work practices necessary to safely perform the contracted work;\n\n* Ensure that each of their employees follows the plant safety rules and safe work practices;\n\n* Report to the facility's staff any hazards created or found by their employees at the job site;\n\n* Provide access and responses to the facility's personnel who may appear at the job site to evaluate contractor safety performance; and \n\n* Provide information on contract employee job site injuries/illnesses to the facility's designated representative.\n\n5.    EMERGENCY RESPONSE PROGRAM\n\n\n\nEme"
    },
    {
      "ESSeqNum": 29,
      "FacilityID": 34575,
      "SummaryText": "rgency Response Data Elements\n\n\n\nDo you have a written emergency response plan?\n\nYes\n\nDoes the plan include specific actions to be taken in response to an accidental release of a regulated substance?\n\nYes\n\nDoes the plan include procedures for informing the public and local agencies responsible for responding to accidental releases?\n\nYes\n\nDoes the plan include information on emergency health care?\n\nYes\n\nThe date of the most recent review or update of the emergency response plan:\n\nSept. 02\n\nThe date of the most recent emergency response training for employees:\n\n12/15/03\n\n\n\nLocal Agency with which the Plan is Coordinated:\n\nAgency: Local Emergency Planning Committee\n\n Phone Number:  715-421-8500\n\n\n\n\n\nSubject To:\n\n    OSHA 1910.38    Yes\n\n    OSHA 1910.120    Yes\n\n    Clean Water Act/SPCC    Yes\n\n    RCRA    Yes\n\n    OPA-90    No\n\n    State EPCRA Rules/Law    Yes\n\n\n\nEmergency Response Program\n\n\n\n1.0 INTRODUCTION\n\n\n\nIn accordance with 40 CFR 68.90 and 68.95 of the RMP Rule, Domtar's Nekoosa Operations maintains a Comprehensive Emergency Response Plan (CompERP), which consolidates all of the various federal regulatory requirements for emergency response planning. The CompERP provides the essential planning for effectively protecting workers, the public, and the environment during emergency situations. Furthermore, the facility coordinates the plan with applicable community emergency response plans and local responders.\n\n\n\n2.0 EMERGENCY RESPONSE PLAN ELEMENTS\n\n\n\nDomtar's Emergency Response Plan was developed using a comprehensive emergency response plan guidance and addresses all of the elements of a comprehensive, integrated plan, including:\n\n\n\n( Plan introduction\n\n- Purpose and scope\n\n- Table of contents\n\n- Current revision date\n\n- General facility identification information\n\n( Core plan elements\n\n- Discovery\n\n- Initial response\n\n- Sustained actions\n\n- Termination and follow-up actions\n\n( Supplementary information\n\n- Facility and locality information\n\n- Notifications\n\n- Response management system\n\n- Inciden"
    },
    {
      "ESSeqNum": 30,
      "FacilityID": 34575,
      "SummaryText": "t documentation\n\n- Training and exercises/drills\n\n- Response critique, plan reviews, and modification process\n\n- Prevention\n\n- Regulatory compliance and cross-reference matrixes\n\n\n\nThe facility has designed a strategy for implementing these elements to work together to provide effective planning for, and control of, emergency response actions.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n2.1 Plan Introduction\n\n\n\nThe Plan begins with a brief overview of facility operations and describes the physical area and nature of hazards/events to which the plan is applicable.  This overview helps plan users quickly assess the relevance of the plan to particular types of emergencies in specific locations.  The facility maintains a list of applicable emergency response regulations to be certain that the facility meets the regulatory obligations.  The facility also maintains a brief profile of the facility and its key personnel to facilitate rapid identification of key administrative information that may be needed during an emergency.\n\n\n\n2.2 Core Plan Elements\n\n\n\nThe core of the Plan focuses on the range of emergency response actions from discovery of an incident through termination and follow-up actions at the end of emergency response.\n\n\n\n2.2.1 Discovery\n\n\n\nThe facility emphasizes recognition, basic assessment, and initial reporting/notification of incidents by employees in the plan.  The facility's goal is to ensure that all employees effectively identify and report incidents for further response action under the plan.\n\n\n\n2.2.2 Initial Response\n\n\n\nThe facility Plan outlines detailed procedures and protocols for initial responses to reported incidents that vary according to incident types.  Specific initial response issues that the facility will address are included in the Plan:\n\n\n\n* Internal/external notifications;\n\n* Response management systems;\n\n* Preliminary assessment of the situation;\n\n* Objectives and priorities for response to specific incidents (such as tactical planning, mitigation actions, and res"
    },
    {
      "ESSeqNum": 31,
      "FacilityID": 34575,
      "SummaryText": "ources required for response);\n\n* Implementation of a tactical plan; and \n\n* Mobilization of resources.\n\n\n\n2.2.3 Sustained Actions\n\n\n\nThe facility Plan addresses the transition from initial response tasks to sustained response actions where more prolonged mitigation and recovery are in progress under a response management structure.\n\n\n\n2.2.4 Termination and Follow-Up Actions\n\n\n\nFinally, the Plan addresses how and when a response action ends (and potentially other regulatory requirements begin).  The Plan also outlines demobilization of response resources (including decontamination), as well as follow-up activities such as incident investigation, response critique, Plan review, and follow-up reports.\n\n\n\n\n\n2.3 Supplementary Information\n\n\n\nThe facility uses supplementary information to the Plan to provide key supporting information for conducting emergency response under the core plan, as well as to document compliance with regulatory requirements.  This supplementary information (1) augments the Plan with information too detailed for direct inclusion in the Plan, and (2) highlights linkages with other internal/external response plans.\n\n\n\n2.3.1 Facility and Locality Information\n\n\n\nThis section, contained in a separate binder, provides detailed information for responders about the layout of the facility and the surrounding environment through the following:\n\n\n\n* Facility maps;\n\n* Facility drawings; and \n\n* Facility description/layout, including identification of facility hazards, vulnerable resources, and populations on and off the facility that may be impacted by an incident.\n\n\n\n2.3.2 Crisis Communications Handbook\n\n\n\nThis supplementary information section details the process of making people aware of an incident, including:\n\n\n\n* Internal notifications;\n\n* Community notifications; and\n\n* Federal and state agency notifications.\n\n\n\n2.3.3 Response Management System\n\n\n\nThis section of the Emergency Response Plan contains a general description of the facility's response man"
    },
    {
      "ESSeqNum": 32,
      "FacilityID": 34575,
      "SummaryText": "agement system, as well as specific information necessary to guide or support the actions of each response management function. The facility addresses all response management functions in the Incident Command Structure, including:\n\n\n\n* Command;\n\n* Operations;\n\n* Planning; and \n\n* Logistics.\n\n\n\nThis section focuses on roles and responsibilities, as well as the location of supporting lists, records, and other documentation.\n\n\n\n2.3.4 Incident Documentation\n\n\n\nThis section is located in the Mill PSM Policy Manual and contains the facility's procedures for performing incident investigations.  The policy also identifies where the facility's incident history for the facility is kept.\n\n\n\n2.3.5 Training and Exercises/Drills\n\n\n\nThis section of the emergency response manual contains a description of the emergency response training and exercise program used at the facility.  This section also identifies where training records are kept.   The mill policy manual for PSM also specifies in the training element where training records are kept.\n\n\n\n2.3.6 Response Critique, Plan Review, and Modification Process\n\n\n\nThis section, contained in the HAZMAT Manual, outlines the procedures for updating the Plan based on critiques of incidents/exercises (lessons learned) and formal reviews of the Plan.  It includes procedures for critiquing an actual or simulated response.  This section is part of the continuous improvement philosophy at the facility.\n\n\n\n2.3.7 Prevention\n\n\n\nThe prevention elements for RMP are identical with the mandatory elements of PSM.  The Mill PSM Policy Manual states the implementation, responsibilities and record keeping for each element.  This policy manual outlines the facility's management systems and implementation efforts for preventing incidents.  This Manual provides references to where further details on the prevention efforts can be found.\n\n\n\n2.3.8 Regulatory Compliance and Cross-Reference Matrixes\n\n\n\nThis annex documents how the elements of the Emergency Respon"
    },
    {
      "ESSeqNum": 33,
      "FacilityID": 34575,
      "SummaryText": "se Program satisfy applicable emergency response requirements.  Paragraph I in the Nekoosa Hazmat/Emergency Response Manual introduction cites the regulatory requirements and how they are met through training and inclusion of necessary elements.\n\n\n\n\n\n\n\n3.0 COORDINATION\n\n\n\nThe facility coordinates the emergency response plans with local emergency planning committees and other emergency response officials, providing all of the information they request for inclusion in community emergency response plans.  The local fire chief and police chief and the director of emergency government are invited to crisis communications training refreshers.  A copy of the facility Risk Management Plan is kept on file with the County emergency government.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n6.  CERTIFICATION\n\n\n\n\n\n\n\n\n\n\n\nDomtar A.W. Corp.  \n\nWastewater Treatment Plant\n\nAnhydrous Ammonia System\n\n\n\n\n\n\n\n\n\n\n\nGeneral Certification. To the best of my knowledge, information, and belief formed after reasonable inquiry, the information submitted in this RM Plan is true, accurate, and complete.\n\n\n\nName:        \n\n\n\nSignature:    \n\n\n\nTitle:        \n\n\n\nDate:        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nManagement System - Effluent Treatment Plant Site\n\n\n\n1.0 OVERALL RESPONSIBILITY\n\n\n\nThe General Manager, Wisconsin Operations has the overall responsibility for ensuring that the facility operates in a safe and reliable manner.  This responsibility includes overseeing the implementation of the elements of our Risk Management Program by the managers with the specific responsibilities listed in the following section.  To ensure that our risk Management Program is appropriately developed and implemented, the General Manager, Wisconsin Operations has delegated the responsibility for the development, implementation, and integration of the EPA RMP elements and the elements of OSHA's PSM Program as required under 40 CFR 68.15 of the RMP rule to his staff as noted and has the responsibility to hold them accountable for compliance.\n\n\n\nThe PSM/RMP Coordinator serves as the chai"
    },
    {
      "ESSeqNum": 34,
      "FacilityID": 34575,
      "SummaryText": "rman of the facility's PSM/RMP Committee.  This Committee is comprised of members with responsibilities for developing and managing specific elements of the Risk Management and Process Safety Management Programs. \n\n\n\nThe following sections identify the specific responsibilities for each aspect of the Risk Management and Process Safety Management Programs.\n\n\n\n2.0 HAZARD ASSESSMENTS\n\n\n\nThe Manager of Environmental & Manufacturing Services, in coordination with the Production Manager, Pulp & Power, has the responsibility for (1) ensuring that off-site consequence analyses for each regulated process are consistently performed and documented in accordance with 40 CFR 68.20 through 68.39 and (2) selecting the scenarios that will be reported in the facility RM Plan as required under Section 68.165 of the RMP Rule.  The Manager of Safety and the Production Manager, Pulp & Power are also responsible for ensuring that the accident history for each covered process is appropriately documented and maintained in accordance with 40 CFR 68.42 and 68.168 of the RMP Rule.\n\n\n\n3.0 PREVENTION PROGRAMS\n\n\n\nThe General Manager, Wisconsin Operations has the responsibility for ensuring that the facility has an integrated, effective, and compliant prevention program that meets EPA RMP (40 CFR 68.65 through 68.87 of the RMP Rule) and OSHA PSM requirements.\n\n\n\n\n\n3.1 Process Safety Information\n\n\n\nThe responsibility for process safety information (PSI) (40 CFR 68.65 of the RMP Rule) is divided into three areas. The Manager of Environmental & Manufacturing Services has responsibility for process chemical information, the PSM/RMP Coordinator has responsibility for process technology information, and the Manager of Maintenance & Engineering has responsibility for equipment information.  The Production Manager, Pulp & Power has the responsibility of ensuring that all of this information is readily accessible for use.\n\n\n\n3.2 Process Hazard Analysis\n\n\n\nIn accordance with 40 CFR 68.67 of the RMP Rule, t"
    },
    {
      "ESSeqNum": 35,
      "FacilityID": 34575,
      "SummaryText": "he Production Manager, Pulp & Power has the responsibility for ensuring that process hazard analyses (PHAs) are scheduled, conducted, and documented by trained personnel for all regulated processes. The Production Manager, Pulp & Power identifies candidate PHA team leaders from within the facility and ensures that they receive appropriate training before leading PHAs.  Other members of the PSM/RMP Committee are responsible for (1) ensuring that the information and personnel necessary to conduct PHAs are available according to the PHA implementation schedule and, (2) resolving recommendations that are assigned to their respective areas.\n\n\n\n3.3 Operating Procedures\n\n\n\nIn accordance with 40 CFR 68.69 of the RMP Rule, the Production Manager, Pulp & Power has the responsibility for ensuring that complete and accurate operating procedures are in place for all regulated processes in the waste treatment plant operations.  The Manager of Safety develops and maintains the facility's safe work practices.\n\n\n\n3.4 Training\n\n\n\nIn accordance with 40 CFR 68.71 of the RMP Rule, the Production Manager, Pulp & Power has the responsibility for (1) ensuring that operations employees receive and understand training applicable to their specific jobs and the associated processes and, (2) documenting the training. The Manager of Safety has the responsibility for ensuring that all facility employees receive and understand training in safe work practices applicable to their jobs.  The Manager of Human Resources has the responsibility for documenting the training.  (The Manager of Maintenance & Engineering addresses training for maintenance workers under the mechanical integrity program.)\n\n\n\n3.5 Mechanical Integrity\n\n\n\nIn accordance with 40 CFR 68.73 of the RMP Rule, the Manager of Maintenance & Engineering has the responsibility for the overall mechanical integrity program, with specific emphasis on written procedures, maintenance training, the equipment and instrumentation inspection/testing "
    },
    {
      "ESSeqNum": 36,
      "FacilityID": 34575,
      "SummaryText": "program and documentation, and equipment deficiency resolution.  The Manager of Maintenance & Engineering and the Manager of Purchasing work together to define and maintain appropriate quality assurance procedures for all types of equipment acquisitions, installations, and/or repairs.\n\n\n\n3.6 Management of Change\n\n\n\nIn accordance with 40 CFR 68.75 of the RMP Rule, the Production Manager, Pulp & Power has the responsibility for the overall management of change (MOC) program in the regulated processes.\n\n\n\n3.7 Pre-Startup Review\n\n\n\nIn accordance with 40 CFR 68.77 of the RMP Rule, the Production Manager, Pulp & Power has the responsibility for the overall pre-startup safety review program for the regulated processes in the pulp and power area. This program is closely related to the MOC program.\n\n\n\n3.8 Compliance Audits\n\n\n\nIn accordance with 40 CFR 68.79 of the RMP Rule, the Production Manager, Pulp & Power has the responsibility for ensuring that compliance audits regularly occur (and are documented) to verify that the prevention program is working and meets EPA/OSHA requirements.\n\n\n\n3.9 Incident Investigation\n\n\n\nIn accordance with 40 CFR 68.81 of the RMP Rule, the Production Manager, Pulp & Power has the responsibility for designing the incident investigation program. The PSM/RMP Coordinator is responsible for tracking resolution of investigation findings and recommendations.  The Production Manager, Pulp & Power also has the responsibility of ensuring that only trained personnel lead the investigations.  The Production Manager, Pulp & Power has the responsibility for ensuring that all incidents in his/her areas are reported and investigated, and the investigation findings are resolved, documented, and communicated to affected personnel.\n\n\n\n3.10 Employee Participation\n\n\n\nIn accordance with 40 CFR 68.83 of the RMP Rule, the Production Manager, Pulp & Power has the responsibility of involving employees in the planning and implementation of the facility's prevention progra"
    },
    {
      "ESSeqNum": 37,
      "FacilityID": 34575,
      "SummaryText": "m elements.\n\n\n\n3.11 Hot Work Permits\n\n\n\nIn accordance with 40 CFR 68.85 of the RMP Rule, the Production Manager, Pulp & Power, working closely with the Manager of Maintenance & Engineering, has the responsibility of developing and maintaining the facility's hot work permit program.\n\n\n\n3.12 Contractors\n\n\n\nIn accordance with 40 CFR 68.87 of the RMP Rule, the Manager of Maintenance & Engineering has the overall responsibility for the contractor program.  However, the Manager of Safety is responsible for ensuring that the requirements of the safety program are implemented in the areas of responsibility.\n\n\n\n\n\n\n\n4.0 EMERGENCY RESPONSE PROGRAM\n\n\n\nIn accordance with 40 CFR 68.90 and 68.95 of the RMP Rule, the Manager of Safety is responsible for (1) designing, implementing, and maintaining the facility's Emergency Response Plan, (2) ensuring that all associated training is conducted and documented as necessary, and (3) responding to local emergency planners/responders when questions arise.\n\n\n\n5.0 RISK MANAGEMENT PLAN PREPARATION AND SUBMISSION\n\n\n\nThe PSM/RMP Coordinator is responsible for preparing the RM Plan for the facility.  After review and approval by the Production Manager, Pulp & Power and the General Manager, Wisconsin Operations, the PSM/RMP Coordinator will submit the RM Plan as required under 40 CFR 68.150 through 68.185 of the RMP Rule.\n\n\n\n6.0 RISK MANAGEMENT PLAN COMMUNICATION\n\n\n\nThe Manager of Safety, in coordination with the Production Manager, Pulp & Power, has the responsibility of providing RM Plan information (other than the required EPA submission) to employees and the public as required under 40 CFR 68.210 of the RMP Rule. The RM Plan documentation will be maintained in the PSM/RMP Center.\n\n\n\n\n\n\n\n        \n\n\n\nD.O. Cummins\n\nEnvironmental Coordinator\n\nPage 1 of 41\n\nRMP Anhydrous Ammonia, WTP\n\nJune 17, 2004\n\n\n\n\n\n\n\n\n\nFacility Report\n\n\n\nProcess and Substance Coverage Report\n\n\n\nProgram Level Report\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}