{
  "FacilityID": 34774,
  "FacilityName": "Hawthorne Army Depot",
  "FacilityStr1": "1 South Maine Avenue",
  "FacilityStr2": "U.S. Route 95 North",
  "FacilityCity": "Hawthorne",
  "FacilityState": "NV",
  "FacilityZipCode": "89415",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "32021",
  "LEPC": "Mineral County LEPC",
  "FacilityLatDecDegs": "38.545667",
  "FacilityLongDecDegs": "-118.654861",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "Janice Peterson",
  "FacilityEmailAddress": "Janice.G.Peterson@us.army.mil",
  "FacilityDUNS": 7913486,
  "ParentCompanyName": "Day & Zimmermann Hawthorne Corporation",
  "Company2Name": "Day & Zimmermann Incorporated",
  "CompanyDUNS": 7913486,
  "Company2DUNS": 0,
  "OperatorName": "Day Zimmermann Hawthorne Corporatio",
  "OperatorStr1": "1 South Maine Avenue",
  "OperatorStr2": "U.S. Route 95 North",
  "OperatorCity": "Hawthorne",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89415",
  "OperatorZipCodeExt": null,
  "RMPContact": "Cliff Cichowlaz",
  "RMPTitle": "General Manager",
  "FTE": 453,
  "OtherEPAFacilityID": "NV1210090006",
  "EPAFacilityID": "100000150855",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "AP-9711-0863",
  "SafetyInspectionDate": "2002-08-13 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-05-07 00:00:00",
  "DeRegistrationEffectiveDate": "2010-03-01 00:00:00",
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 38.55571,
  "FRS_Long": -118.6489,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Source Physically Removed",
  "_processes": [
    {
      "ProcessID": 50097,
      "AltID": "Drinking Water Treatment",
      "FacilityID": 34774,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 51231,
          "ProcessID": 50097,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 66078,
          "ProcessID": 50097,
          "ChemicalID": 62,
          "Quantity": 4300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 566078,
          "ProcessID": 50097,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34774,
      "SummaryText": "1.  Accidental Release Prevention and Emergency Response Policies:\nHawthorne Army Depot (HWAD) is a Government Owned Contractor Operated (GOCO) facility.  Day and Zimmermann Hawthorne Corporation (DZHC) is the contractor for HWAD.  DZHC, handles chlorine, in amounts which are considered to be hazardous by the U.S. Environmental Protection Agency (EPA).\n\nIt is DZHC's policy to comply with all local, State, and Federal rules and regulations.  Safety and environmental concerns are a high priority for DZHC, therefore, DZHC has its own emergency responders for the HWAD.  There is a mutual aid agreement between DZHC's emergency responders and the local emergency responders (Hawthorne Volunteer Fire Department and Mineral County Emergency Response Team).\n\nThe accidental release, prevention, and emergency response policies are a unified approach that integrate technologies, procedures, and management practices.  The emergency response policy includes a response plan specific to the particular processes.  DZHC provides training to its employees as well as emergency responders in the following disciplines; the National Fire Protection Association (NFPA), Occupational Safety and Health Administration (OSHA), Hazardous Materials (HazMat), Hazardous Communications (HazComm), and Hazardous Waste Operations and Emergency Response (HAZWOPER), Level 3 Technician training course specifically for the emergency responders, Level 5 Incident Scene Commanders specifically for the emergency responders, and regular fire and emergency drills specifically for the emergency responders.\n\n\n2.  The Stationary Sources and Regulated Substances Handled:\n\nDZHC has one process that is subject to the RMP Rule.  \n\nChlorine is used to decontaminate the drinking water used at the HWAD.  There are a total of 4,300 pounds of chlorine located at the Black Beauty Reservoir at any given time which are stored in two 2,000 pound tanks and two 150 pound cylinders.\n\n\n3.  The General Accidental Release Prevention P"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34774,
      "SummaryText": "rogram and the Specific Prevention Steps:\n\nChlorine   There is a Process Safety Management program and a Hazard Analysis Program in place.\n\nOperator training:   Operators are trained in self contained breathing apparatus.  Annual seminars are attended for continued education to maintain certification of operating a drinking water system using chlorine disinfection.  Operators are certified in potable water disinfection by the State of Nevada.  Operators are HazMat and HazComm trained as required by EPA and they have had OSHA training.  Operators are also trained to assist emergency responders as needed. \n\nPreventive Maintenance Program:  There is a preventative maintenance (PM) program in place to minimize the chance of accidental releases due to equipment failure.  As part of the PM program there are audible alarms that are relayed to the guard operation center and monitored 24 hours a day.  There are daily visual checks and readings, weekly maintenance to all chlorine monitoring equipment, and all alarm systems are checked on a monthly basis.  In addition, all chlorine tubing heads are rebuilt and replaced annually and all tubing is replaced annually to prevent any leaks.\n\nAccurate and Effective Operating Procedures:   There are complete sets of operating procedures in place.  The procedures address normal operations, as well as steps to be taken during upset conditions and safety precautions to be observed during all operational phases.\n\nPeriodic Hazard Reviews of Equipment and Procedures:  The hazard reviews of equipment and procedures are on an annual basis and when major physical changes are made to the process.\n\nAuditing and Inspection Program:   The chlorine tanks are provided by a commercial source.  The commercial source inspects the tanks prior to delivery to the HWAD.  Tanks are visually inspected as they arrive at the HWAD by the operators authorized to remove and install the chlorine tanks.  These tanks are replaced every thirty to ninety days.  The ch"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34774,
      "SummaryText": "lorination building is also inspected daily.  The State of Nevada has inspected the chlorination facility and has been impressed with the alarm system technology for chlorine leak detection.\n\nPhysical Security:   HWAD is a physically secure facility.  Access to the chlorinator is controlled on a posted military installation.  The chlorine is inside a locked building and access is controlled by operational personnel only.  The area is also monitored by roving security guards.\n\n\n4.  Five Year Accident History:\n\nNo accidental releases of chlorine, as defined by the RMP Rule, have occurred over the past five years.\n\n\n5.  The Emergency Response Program:\n\nDZHC has an effective emergency response program and team to ensure quick response in the event of any hazardous release.  The DZHC Fire Department includes a staff of 24, and operates on alternating 24 hours shifts of seven (7) people each.  The Fire Chief, Chief Inspector, and one additional Firefighter work Four (4) - Ten (10) hour days.  All personnel are certified as hazardous technical level three (3) and confined space rescuers.  Additionally, Fire Department members are certified as emergency medical technicians, all Officers are hazardous material Incident Command certified.  The Fire Department conducts all Hazardous Materials Technician Training for the Emergency Response Team (ERT).  There are approximately fifteen (15) volunteer ERT employees outside the Fire Department that are trained to hazardous technician Level three (3).  The ERT is activated at the discretion of the incident commander.  The department has one (1) Incident Command vehicle, three (3) fire engines, two (2) ambulances, one (1) HazMat pickup with trailer, and a mass casualty/rescue trailer.  The DZHC Medical Clinic is available for treatment of non critical situations and victims can be transferred to a full service hospital via ambulance or airlifted to a larger hospital in serious cases.  Security maintains a 24 hour dispatch center for "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 34774,
      "SummaryText": "Security and the Fire Department.  All alarms are received at the dispatch center and then dispatched to the Fire Department by pager, radio, or telephone.  All emergency responders are trained extensively in chlorine incidents.\n\n\n\n6.  Planned Changes to Improve Safety:\n\nDZHC is continually looking for new innovative ideas for water disinfection.  Meetings and improvement discussions will also continue as they currently are unless changes are required (i.e. the need for improvements or the discontinuation of a process).  DZHC will continue to follow local, state, and federal rules and regulations as well as our own stringent rules and regulations.  Improvements are continuously being made to our emergency responders on the mitigation of a major incident or disaster."
    }
  ]
}