{
  "FacilityID": 34785,
  "FacilityName": "Del Monte Fresh Produce, Inc.",
  "FacilityStr1": "1810 Academy Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Sanger",
  "FacilityState": "CA",
  "FacilityZipCode": "93657",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.691359",
  "FacilityLongDecDegs": "-119.553101",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "CO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Oscar Chawdhry",
  "OperatorStr1": "1810 Academy Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Sanger",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93657",
  "OperatorZipCodeExt": null,
  "FTE": 70,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000186942",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-06 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2021-01-15 00:00:00",
  "DeRegistrationEffectiveDate": "2020-12-23 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 36.692851,
  "FRS_Long": -119.554133,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility Sold",
  "_processes": [
    {
      "ProcessID": 50110,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 34785,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 66100,
          "ProcessID": 50110,
          "ChemicalID": 56,
          "Quantity": 32000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 51244,
          "ProcessID": 50110,
          "NAICSCode": "311991",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 28715,
              "Process_NAICS_ID": 51244,
              "SafetyReviewDate": "2004-05-18 00:00:00",
              "PHA_Date": "2005-06-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-05-13 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-06-14 00:00:00",
              "TrainingReviewDate": "2004-06-14 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": "Grandfathering",
              "MaintenanceReviewDate": "2004-06-14 00:00:00",
              "EquipmentInspectionDate": "2004-06-09 00:00:00",
              "EquipmentTested": "Compressors",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2004-06-14 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-05-18 00:00:00",
              "HotWorkPermitReviewDate": "2004-06-14 00:00:00",
              "ContractorSafetyReviewDate": "2004-06-14 00:00:00",
              "ContractorSafetyEvalDate": "2004-06-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 41771,
                  "PreventionProgram3ID": 28715,
                  "ProcessChemicalID": 66100
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 34785,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-04-14 00:00:00",
    "ERTrainingDate": "2002-10-01 00:00:00",
    "CoordinatingAgencyName": "Fresno County Human Services",
    "CoordinatingAgencyPhone": "5594453271",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34785,
      "SummaryText": "Risk & Process Safety Management Program\n\nPreface ¿ Executive Summary\n\nfor\n\nDel Monte Fresh Produce\n1810 Academy Avenue\nSanger, California 93657\n(559) 875-5000\nFAX (559) 875-1301\n\nEPA Facility ID#: Applied For\n\nApril 14, 2004\n\nPrepared by:\n\nCalifornia Controlled Atmosphere\n39138 Road 56\nDinuba, California 93618\n559-591-8874\nwww.calca.com\n \nTable of Contents for Preface ¿ Executive Summary\n\n1. THE  DEL MONTE FRESH PRODUCE, RISK & PROCESS SAFETY MANAGEMENT PROGRAM\n2. DESCRIPTION OF AMMONIA SYSTEM\n3. GENERAL ACCIDENT RELEASE & AMMONIA SPECIFIC PREVENTION STEPS\n4. FIVE YEAR ACCIDENT HISTORY\n5. EMERGENCY ACTION PLAN\n6. PLANNED CHANGES TO IMPROVE SAFETY\nAPPENDIX A:  LETTERS OF CERTIFICATION\nAPPENDIX B:  RMP*SUBMIT PRINTOUT\n \n¿Living Document¿ Approach To Regulatory Compliance\n\nThis program is intended to meet the spirit and intent of the California Accidental Release Prevention Program (CalARP), CCR Title 19, Chapter 4.5 and the California Process Safety Management Program, CCR Title 8, Section 5189 as enforced by the local Certified Unified Program Agency and the Fed/EPA.  \n\nThis program is intended to be a ¿living document.¿  As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible. To accomplish this elements have been organized in a way that is consistent with the corporate organization, how frequently different elements are accessed, and who needs to refer to the program.  The order of elements within this organization is not the same as they are listed in the regulations, and in some cases portions of elements may be found in more than one location.  Therefore, for the purposes of auditing and regulatory review the following table is provided to provide concordant information regarding the program and the required regulatory elements. \n\n1. THE  DEL MONTE FRESH PRODUCE, RISK & PROCESS SAFETY MANAGEMENT PROGRAM\nThis is to inform all interested persons, including employees, that Del Monte Fresh Produce h"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34785,
      "SummaryText": "as prepared a unified Risk & Process Safety Management Program.  The program is in compliance with California¿s Accidental Release Prevention (CalARP) Program (in California CCR Title 19, Chapter 4.5 Program Level 3 Elements.  At the Federal level, Title 40 CFR Part 68), and California OSHA¿s ¿Process Safety Management (PSM) of Acutely Hazardous Materials¿ standard (in California CCR Title 8, Section 5189, ¿Process Safety Management of Acutely Hazardous Materials,¿ and Federally Title 29 Code of Federal Regulations (CFR) 1910.119).  This program has been prepared to address the risks involved with the presence of anhydrous ammonia in an amount in excess of 10,000 lbs., which is contained in our refrigeration system. \n\nOur program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of anhydrous ammonia. Overall, the program is designed to prevent accidental fatalities, injuries and illnesses and avoid physical property damage.\n\nOur company has an exemplary safety record, one that we are quite proud of. Our company has many policies and procedures in place to promote overall plant, worker and public safety.  We have: (1) prepared a unified program based on the PSM plan to meet CalARP obligations as well; (2) reorganized the program so that it meshes more closely with general Del Monte Fresh Produce business practices; and (3) reviewed plan documentation forms and responsibilities.  The unified Risk & Process Safety Management Plan sets forth rules, procedures, and practices that will help our employees protect themselves and our neighbors.\n\n2. DESCRIPTION OF AMMONIA SYSTEM\nDel Monte Fresh Produce operates a food processing facility and cold storage for fresh produce.  Our facility has one  ammonia system which currently requires a charge of 32,000 lbs.  The system provides refrigerating capacity to two processing rooms, multiple cold storage and controlled"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34785,
      "SummaryText": "atmosphere storage rooms, a hallway and a loading dock area.  There is also a hydrocooler on sight which has been disconnected from the system and is no longer in use.\n\nThe systems operate as follows.  High pressure liquid from our main receiver is piped to each cold room, where it passes through an expansion valve into low temperature & pressure accumulator vessels.  From the accumulators, cold liquid ammonia is circulated through evaporator coils.  As heat is absorbed, the liquid ammonia vaporizes to form low temperature & pressure gas which is returned to the accumulator vessel.  The ammonia vapor is returned from the accumulator vessels through a suction return line to our engine room, where it passes through a compressor.  The high pressure discharge from the compressor is sent to a water cooled condenser where the high pressure gas ammonia is cooled, liquified and returned to our receiver. \n\nThe facility was originally built in 1979 by professional refrigeration engineers in accordance with standard design, and installation of ammonia mechanical refrigerating systems.  It was also built in compliance with the Uniform Mechanical Code and Uniform Building Code applicable at the time of construction. The system contains numerous safety devices including sensors which stop the compressors if temperatures or pressures exceed or drop below established limits, and safety relief valves which vent ammonia gas to the atmosphere if the pressure in the system exceeds their set point.  Lastly, an emergency ¿dump box¿ contains valves to vent ammonia if necessary.\n\nThe ammonia system at our facility consists of vessels which are interconnected, or which are co-located such that a release of ammonia could impact the ability to operate vessels that are not directly connected.  Therefore, we are treating our facility as a single process.\n\n3. GENERAL ACCIDENT RELEASE & AMMONIA SPECIFIC PREVENTION STEPS\nThe ammonia refrigeration systems at the  Del Monte Fresh Produce facility a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 34785,
      "SummaryText": "re an integral part of the overall business.   The system contains a total charge of approximately 32,000 lbs. It is extremely important that it is maintained and operated in a safe and efficient manner.  Management is committed to making sure that all employees are made aware of the potential danger of an ammonia leak.\n\nOur refrigeration personnel monitor the ammonia refrigeration system/process and keep an active journal of all procedures and transactions that pertain to ammonia.  In addition, the system/process is checked weekly by our outside refrigeration contractor, California Controlled Atmosphere. \n\nWe inform our employees of the dangers of an accidental release of ammonia in monthly safety meetings.  New employees are made aware of the potential risk of ammonia in an employee orientation meeting.  During these meetings we also discuss preventative measures, such as evacuation, in order to be prepared for a release.\n\nOur ammonia refrigeration system was designed and built by professional refrigeration engineers in accordance with ANSI/IIAR 2-1992 ¿Standard for Equipment, Design, and Installation of Ammonia Mechanical Refrigerating Systems.¿  It was also built in compliance with the Uniform Building Code and Uniform Mechanical Code applicable at the time of construction.\n\n4. FIVE YEAR ACCIDENT HISTORY\nDel Monte Fresh Produce has not had any reportable accidents within the last five years.\n\n5. EMERGENCY ACTION PLAN\nThis facility¿s emergency response program is based on the Cal/OSHA requirements for Emergency Action Plans (in California CCR Title 8, Section 3220, ¿Emergency Action Plans.¿  Federally, Title 29 CFR 1910.38 and 1910.119), HAZWOPER (standard (in California CCR Title 8, Section 5192, ¿Hazardous Waste Operations and Emergency Response,¿ and Title 29 CFR 1910.120). \n\nStrategically, we will respond defensively to a release.  Under this plan our ammonia refrigeration personnel will take whatever steps are necessary to bring a release under control. The"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 34785,
      "SummaryText": "first priority will be to operate the ammonia system to bring a release under control safely, from a distance, without donning personal protective equipment. To better prepare for this type of action, initial training to the defensive level (First Responder, Operations Level) as defined in the HAZWOPER regulations will take place within the next year. All response activities would be done in coordination with the local fire department and the Fresno Fire Department Hazardous Materials Response Team.\n\n6. PLANNED CHANGES TO IMPROVE SAFETY\nOur company has an outstanding safety record, one that we are quite proud of.  Many policies and procedures have been implemented to promote overall plant, worker and public safety.  Nevertheless, Del Monte Fresh Produce continually strives to improve in all areas, including safety.  Preparation of this Risk & Process Safety Management Program has been the primary recent improvement, and implementation of the program is our plan for improved safety in the near future.\n\nThe Risk & Process Safety Management Program has been written so that program elements are aligned with Del Monte Fresh Produce business practices rather than the order presented in the law.  Thus, Safe Operating Procedures are grouped together for the benefit of our system operator.  Safe Operating Policies are grouped together so that appropriate office staff may administer them.  The Emergency Action Plan is now separated out and distributed widely through the plant for easy reference.  \n\nThe Risk & Process Safety Management Program documentation forms and company policy forms pertaining to employee, contractor, and community safety have been carefully reviewed so as to prevent unnecessary complexity and redundancy.  Our operator assisted in the writing of Standard Operating Procedures, and they are presented in a format that is easy to use.  \n\nFor the future, Del Monte Fresh Produce now thinks of the Risk & Process Safety Management Program as a ¿living document¿."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 34785,
      "SummaryText": "It is an interactive framework that guides safe action for Del Monte Fresh Produce employees, but allows for feedback and continual improvement.  Through the Risk & Process Safety Management Program Del Monte Fresh Produce will continue to profit while maintaining overall plant, worker and public safety."
    }
  ]
}