{
  "FacilityID": 34952,
  "FacilityName": "Town of Selbyville Wastewater Treatment Facility",
  "FacilityStr1": "Polly Branch Road",
  "FacilityStr2": "P.O. Box 106",
  "FacilityCity": "Selbyville",
  "FacilityState": "DE",
  "FacilityZipCode": "19976",
  "Facility4DigitZipExt": "0106",
  "FacilityCountyFIPS": "10005",
  "LEPC": "Sussex LEPC",
  "FacilityLatDecDegs": "38.471333",
  "FacilityLongDecDegs": "-075.218500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "selbyvil@compucenter.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Town of Selbyville",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Town of Selbyville",
  "OperatorStr1": "Polly Branch Road",
  "OperatorStr2": "P.O. Box 106",
  "OperatorCity": "Selbyville",
  "OperatorStateFIPS": "DE",
  "OperatorZipCode": "19976",
  "OperatorZipCodeExt": "0106",
  "RMPContact": "F. James Burk, Jr.",
  "RMPTitle": "Manager of Operations",
  "FTE": 4,
  "OtherEPAFacilityID": "DE0020010",
  "EPAFacilityID": "100000060275",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-06-16 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 38.47133,
  "FRS_Long": -75.2185,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 50301,
      "AltID": "Effluent Chlorination",
      "FacilityID": 34952,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 51437,
          "ProcessID": 50301,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 66324,
          "ProcessID": 50301,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 566324,
          "ProcessID": 50301,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34952,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe Town of Selbyville (TOWN) Wastewater Treatment Facility's (WWTF)  accidental release prevention policy incorporates a unified approach that integrates technologies, procedures, and management practices.  The facility attempts to adhere to all applicable prevention programs, procedures and requirements established by the U.S. Environmental Protection Agency (EPA) and the State of Delaware Department of Natural Resources and Environmental Control (DNREC). The WWTF emergency response policy involves the preparation of response plans which are tailored to the WWTF and to the emergency response services available from the community.\n\nThe WWTF utilizes chlorine to disinfect the wastewater effluent as the flow is discharged into a force main. The treated wastewater effluent is ultimately discharged to the Atlantic Ocean via an ocean outfall owned and maintained by Sussex County.  The chlorination facility at the WWTF consists of a ton container storage area with two weight scales, automatic transfer switch, two automatic flow paced chlorinators, two vacuum ejectors, two vacuum regulated container valves and two rotometers.  The entire system will only operate when the piping is under a negative atmospheric pressure.  The WWTF stores a maximum of four one ton containers on site.  Two one ton containers are placed on scales and connected to the vacuum system. Only one container is turned on; when that container reaches a weight below 500 pounds the second container is turned on.  The treatment facility is manned seven days a week. Wastewater operators respond to any trouble alarm after the normal 6:30 a.m. to 3:30 p.m. work day.\n\nThe offsite consequence analysis includes consideration of two chlorine release scenarios, identified as \"worst case release\" and \"alternative\" scenarios.  The first scenario is defined by EPA, which states that \"the owner or operator shall assume that the ... maximum quantity in the largest vessel ... is released as a gas ove"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34952,
      "SummaryText": "r 10 minutes,\" due to an unspecified failure.  The alternative scenarios is defined as \" more likely to occur then the worst case release scenario.\n\nAtmospheric dispersion modeling has to be performed to determine the distance traveled by the chlorine released before its concentration decreases to the \"toxic endpoint\" selected by EPA of 3 parts per million, which is the Emergency Response Planning Guideline Level 2 (ERPG-2).  This is defined by the American Industrial Hygiene Association (AIHA) as the \"maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action\".  The residential population within a circle with a radius corresponding to the toxic endpoint distance has to be defined, \"to estimate the population potentially affected\".\n\nThe worst-case release scenario for the Town's wastewater treatment facility involves a failure of a one ton container as defined by EPA.  Utilizing EPA's modeling program RMP*Comp Ver. 1.06, assumptions of wind speed of 1.5 meters/second - air stability at Class F - and air temperature of 77 degrees F. defined the estimated distance to toxic endpoint at 0.9 miles. The alternative case scenario is based on a small leak of one eighth inch diameter in the tubing which is normally under vacuum.  This would result in the estimated distance to toxic endpoint at <0.1 miles with the wind speed of 3.0 meters per second - air stability at Class D and air temperature of 77 degrees F. \n\nThe chlorination system at the wastewater treatment facility is comprised of a vacuum system.  The vacuum is induced by a water pressurized injector.  The vacuum created causes a vacuum regulator mounted on the ton container to open and dispense chlorine into the pressurized water.  Loss of water pressure or a rupture in any of the vacuum tubing "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34952,
      "SummaryText": "causes the chlorine vacuum regulator to close off the chlorine supply.\n\nThe accidental release program consists of operator training, preventative maintenance, and safety handling of the chlorine.  The Town regularly maintains the system by sending components of the vacuum system directly to the manufacturer of the equipment for testing and repair.  The Town also has an emergency repair kit to use in case of an emergency.  In addition to the Selbyville Fire Department for response to a chemical emergency, Mountaire Poultry of Delmarva, Inc. has a trained hazardous materials response team available should a problem arise.  \n\nThe use of chlorine gas for disenfection of the wastewater effluent has been in operation since March 1989 when the facility first went on line.  To date (June 2004) no accidential releases of chlorine gas have occurred at this facility.l"
    }
  ]
}