{
  "FacilityID": 35071,
  "FacilityName": "Mallinckrodt Inc.",
  "FacilityStr1": "8801 Capital Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Raleigh",
  "FacilityState": "NC",
  "FacilityZipCode": "27616",
  "Facility4DigitZipExt": "3116",
  "FacilityCountyFIPS": "37183",
  "LEPC": "Wake County LEPC",
  "FacilityLatDecDegs": "35.900590",
  "FacilityLongDecDegs": "-078.561640",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 97722284,
  "ParentCompanyName": "Mallinckrodt Inc.",
  "Company2Name": null,
  "CompanyDUNS": 47021092,
  "Company2DUNS": 47021092,
  "OperatorName": "Mallinckrodt Inc.",
  "OperatorStr1": "675 McDonnell Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Hazelwood",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "63042",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tim Roberts",
  "RMPTitle": "Environmental Coordinator",
  "FTE": 240,
  "OtherEPAFacilityID": "27604MLLNC8801N",
  "EPAFacilityID": "100000106235",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-05-25 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "RM Plan for Anydrous Ammonia (P3) & Hydrogen (P1)",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-10-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 35.89891,
  "FRS_Long": -78.55842,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "5.5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 50552,
      "AltID": "Liquid Hydrogen Storage/D",
      "FacilityID": 35071,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 51698,
          "ProcessID": 50552,
          "NAICSCode": "325192",
          "_desc": {
            "NAICS_CODE": "325192",
            "NAICS_DESCRIPTION": "Cyclic Crude and Intermediate Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 66626,
          "ProcessID": 50552,
          "ChemicalID": 149,
          "Quantity": 11922.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 149,
            "ChemicalName": "Hydrogen",
            "CASNumber": "1333-74-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 566626,
          "ProcessID": 50552,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 50553,
      "AltID": "Anhydrous Ammonia Storage",
      "FacilityID": 35071,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 51699,
          "ProcessID": 50553,
          "NAICSCode": "325192",
          "_desc": {
            "NAICS_CODE": "325192",
            "NAICS_DESCRIPTION": "Cyclic Crude and Intermediate Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 66627,
          "ProcessID": 50553,
          "ChemicalID": 56,
          "Quantity": 293760.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 566627,
          "ProcessID": 50553,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35071,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAt the Mallinckrodt Pharmaceutical Plant in Raleigh, Wake County, North Carolina, we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n *  A description of our facility and use of substances regulated by EPA's RMP regulation\n  *  An overview of our accidental release prevention programs\n *  A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\n *  An overview of our emergency response program\n *  An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\n *  The certifications required by EPA's RMP rule\n *  The detailed information (called data elements) about our risk management program\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\nOur facility produces para-aminophenol and acetaminophen using a variety of chemicals and processing operations.  Acetaminophen is a pain-relief medication for use by the pharmaceutical industry.  In our processes, we use the following chemicals that EPA has identified as having the potential to cause off-site consequences in the event of a substantial accidental release:\n\nToxics\n\nAnhydrous Ammonia:  Anhydrous Ammonia is used as a neutralizer for an acidic phase in one of our process steps for manufacturing para-aminophenol.  [Subject to Program Level 3.]\n\nFlammables\n\nHydrogen:  Hydrogen is used in the hydrogenation phase of one of our process steps for manufacturing para-aminophenol. "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35071,
      "SummaryText": "  The process is very similar to the hydrogenation processing step used to make salad dressing or mayonnaise by food manufacturers.  [Subject to Program Level 1.]\n \nOur accidental release prevention programs and our contingency planning efforts help us effectively manage the hazards that could potentially be posed to our employees, the public, and the environment if one of these were mishandled or otherwise involved in an accident.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nWe take a systematic, proactive approach to preventing accidental releases of chemicals.  Our management systems address each of the key features of successful prevention programs including:\n\n *  Process safety information\n *  Process hazard analysis\n *  Operating procedures\n *  Training\n *  Mechanical integrity\n *  Management of change\n *  Pre-startup review\n *  Compliance audits\n *  Incident investigation\n *  Employee participation\n *  Hot work permit\n *  Contractors\n\nAs part of our prevention efforts, we have implemented the following chemical-specific prevention steps:\n\n* A process hazard analysis (PHA) on both the ammonia system and the hydrogen system and made changes to the equipment, instruments, and operating procedures to minimize the potential for incidents;\n* Routine inspection of storage tanks and equipment (ammonia and hydrogen systems);\n* Initial and ongoing training for personnel working with the hydrogen and ammonia systems;\n* Review of major changes using engineers, supervisors, and operators before new equipment is started;\n* Review of operating procedures using operators, supervisors, and engineers to make sure procedures are current and to clarify anything confusing or that could be misinterpreted; and\n* Ongoing resolution of recommendations from the most recent PSM/RMP audits and PHA reviews on the ammonia system.\n\nWe currently have the following chemical-specific emergency and/or preventive equipment:\n\n* Excess flow valves at outl"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35071,
      "SummaryText": "et piping on the liquid hydrogen tanks;\n* Excess flow valves throughout all liquid ammonia lines;\n* Level controls on the ammonia and hydrogen tanks;\n* A containment berm around the anhydrous ammonia storage tanks;\n* Ammonia detection sensors throughout the anhydrous ammonia system;\n* High pressure and high liquid level alarms on the liquid ammonia storage tanks;\n* Remotely-activated emergency isolation valves in the liquid ammonia lines;\n* Remotely-activated water curtain system to mitigate ammonia vapors during an accidental release at the liquid ammonia storage tanks, the ammonia unloading station, and the ammonia vaporizers; and\n* Water monitor nozzles located at the ammonia storage tanks.\n \nThese individual elements of our prevention program work together to prevent accidental chemical releases.  Our company and our employees are committed to the standard that these management systems set for the way we do business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\n\nThis site is operated using a team approach designed to enhance communication and interaction between individuals and functional groups at the site and to improve performance in all aspects of our business.  Acting under the direct authority of the Plant Manager, the site's RMP Coordinator (who also functions as the site?s PSM Coordinator) works closely with the site's management team to facilitate and oversee the implementation of the various elements of the Risk Management Program by various functional groups or teams at the site.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nWe keep records of all significant accidental chemical releases that occur at our facility.  During the past five years there were no accidental chemical releases involving materials covered under the EPA's RMP rule that resulted in serious injuries, significant property damage, or environmental damage either on site or off site.\n\nEMERGENCY RESPONSE PROGRAM\n\nWe hav"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35071,
      "SummaryText": "e a written Emergency Response Plan that includes the requirements of OSHA and the EPA for the safety and protection of our employees and the community.  Our program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, we coordinate our plan with Wake County's local emergency response plan.  Mallinckrodt is a founding member of the Wake County Local Emergency Planning Committee and continues to be very actively involved.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe following is a list of actions that we are planning to implement at the facility to help prevent and/or better respond to accidental chemical releases:\n\n* Conduct a functional exercise of our emergency plan involving external emergency responders and the local community.\n* Continue to work with the Raleigh Fire Department and other emergency responders to insure that external personnel are familiar with our site, our safety improvements, and future Emergency Plan changes."
    }
  ]
}