{
  "FacilityID": 35140,
  "FacilityName": "Kyger Bakery Products",
  "FacilityStr1": "7575 Georgetown Road",
  "FacilityStr2": null,
  "FacilityCity": "Indianapolis",
  "FacilityState": "IN",
  "FacilityZipCode": "46268",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18097",
  "LEPC": "Marion County LEPC",
  "FacilityLatDecDegs": "39.889722",
  "FacilityLongDecDegs": "-086.242222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "harlanbakeries.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Kyger Bakery Products",
  "OperatorStr1": "7575 Georgetown Road",
  "OperatorStr2": null,
  "OperatorCity": "Indianapolis",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46268",
  "OperatorZipCodeExt": null,
  "RMPContact": "Darla Carlisle",
  "RMPTitle": "Safety Manager",
  "FTE": 120,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000187031",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-05-05 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-10-18 00:00:00",
  "DeRegistrationEffectiveDate": "2013-09-01 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Sale of facility & covered process (refrigeration) to Con Agra Foods See Contact",
  "_processes": [
    {
      "ProcessID": 50640,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 35140,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 51788,
          "ProcessID": 50640,
          "NAICSCode": "311813",
          "_desc": {
            "NAICS_CODE": "311813",
            "NAICS_DESCRIPTION": "Frozen Cakes, Pies, and Other Pastries Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 66718,
          "ProcessID": 50640,
          "ChemicalID": 56,
          "Quantity": 21000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 566718,
          "ProcessID": 50640,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35140,
      "SummaryText": "KYGER BAKERY PRODUCTS\n\nRISK MANAGEMENT PROGRAM PLAN\nExecutive Summary\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe accidental release prevention and emergency response policies at Kyger Bakery Products? Indianapolis, Indiana facility are engrained in the fundamentals of the process safety prevention program.\n\nAt the Indianapolis, Indiana facility anhydrous ammonia is kept in inventory and is considered hazardous by the Environmental Protection Agency (EPA).  The same properties that make this chemical valuable as a refrigerant also make it necessary to observe specific safety precautions.  These safety precautions are exercised in the operation and maintenance of the refrigeration system to control human environmental exposure in an effort to reduce the overall threat to workers as well as the surrounding communities.\n\nIt is Kyger?s policy to adhere to all applicable federal, state, and local laws, rules, and regulations.  However, the safe handling of ammonia is paramount at Kyger.  Standards and recommended practices governing the safe handling of ammonia are used to ensure that a reasonable level of risk reduction is maintained.  Investigation of inherently safer technologies, and failsafe design applications are a few of the continuous improvements being studied.  Safety depends upon management commitment, the manner in which ammonia refrigerant is handled, the safety devices inherent to the refrigeration system design, operating procedures and philosophies, and the training of Kyger workers.\n\n Kyger believes that accountability for safety reaches throughout all levels of management.  Senior management's commitment and dedication to continued safe-operating practices is clearly evident in Kyger?s organization structure and employee empowerment.  \n\nExtensive improvements have been made to safety and health programs like the prevention program (process safety and risk management), emergency preparedness and response, and training.\n\nAddition"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35140,
      "SummaryText": "ally, Kyger believes employee involvement is the cornerstone to continued safe operations.  This is known as employee ownership and its success is portrayed through lower injury rates, fewer incidents, and improved efficiencies at the plant.\n \n\nThe Emergency Preparedness and Response Plan outlines procedures for warned and unwarned emergencies that may occur at the plant.  Warned emergencies are usually tornadoes, heavy snowstorms, or conditions that are reasonably predictable.  Unwarned emergencies usually consist of onsite emergencies such as a spill, fire/explosion, or a chemical release.  As a responsible company, Kyger coordinates emergency response activities and training with the local emergency management organizations.  This ensures prompt mitigation actions during incidents.\n\nFacility description and regulated substances handled\n\n Kyger Bakery Products is a domestic producer of processed food products.  The Indianapolis, Indiana plant site covers approximately 5 acres and the facility grounds are approximately 34 total acres within the Indianapolis City limits.  It is located at 7575 Georgetown Road in Indianapolis, Indiana, Marion County.\n\nThere are approximately 120 employees at the plant site. \n\nOnly one chemical covered by 40 CFR Part 68 is inventoried at the Indianapolis site.  This substance is present in quantities greater than the threshold quantity identified by the RMP regulation and therefore is included in our risk management program.\n\nAmmonia (anhydrous)- Ammonia is used as a refrigerant at the plant.  It is received into the plant by truck, however deliveries of ammonia are infrequent.  One of the primary refrigeration vessels is the Low Low Temperature Recirculator vessel. This vessel has a maximum inventory of 4,136 pounds that is controlled through administrative procedures.  However, during a pump down condition, the entire ammonia inventory of 21,000 pounds may be stored in the vessel. The refrigeration system at the facility has a total"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35140,
      "SummaryText": " capacity of approximately 21,000 pounds of anhydrous ammonia.\n\nAccidental release program & chemical-specific prevention steps\n\n Kyger contracted with an outside consulting firm to assist in the refinement of the prevention program tailored exclusively to ammonia refrigeration operations.  This prevention program was designed around mechanical integrity and training aspects.  The primary objective of the prevention program is to ensure complete containment of ammonia through safe operation and maintenance of the refrigeration system.\n\n Kyger has completed a process hazard analysis (PHA) of the new ammonia refrigeration system.  A PHA was conducted in February 2004 and resulted in 17 recommendations.  The recommendations generated during this review were prioritized using a standardized Risk Rank Matrix method.\n\nFive year accident history\n\nKyger has a very comprehensive Incident Reporting and Investigation procedural process.  This process is defined and explained in the prevention program procedures.  Basically, an incident occurs when a deviation from expected performance is experienced.\n\nIndividuals knowledgeable in refrigeration operation or the equipment being investigated lead formal incident investigations.  Root cause and corrective actions are determined and formal reports are prepared.  Progress regarding corrective action on all investigated incidents is tracked through final resolution.\n\nKyger is a new facility, therefore it has not had an accidental release of ammonia within the past five years that resulted in an onsite injury or adversely affected the community.\n\n\nEmergency response Program\n\n Kyger?s emergency action plan has been designed to address likely incidents arising from our ammonia refrigeration system.  The emergency plan is a vital part of Kyger?s overall prevention program.   Kyger continues to plan for the unplanned ammonia release while striving to adhere to the latest mechanical integrity and inherently safer technologies.\n\n\nPlanned im"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35140,
      "SummaryText": "provements to reduce risk\n\nIn accordance with its risk management program, Kyger conducts continuous self-examination evaluations designed to identify and assess process/operational risk employees and the community.  One of the primary aspects of the risk management program is the empowerment of each employee with the responsibility for continuous safe operations.  \n\nThe ammonia refrigeration employs a programmable logic controller as a means to control ammonia emissions and inadvertent ammonia releases to the atmosphere.  An audio, visual, olfactory leak detection and repair program that requires multiple checks per day will control refrigeration system emissions.  In addition, ammonia detectors are strategically located throughout the machine rooms to quickly detect any releases."
    }
  ]
}