{
  "FacilityID": 35181,
  "FacilityName": "Cherokee Nitrogen Company",
  "FacilityStr1": "P.O. Box 250, 1080 Industrial Drive",
  "FacilityStr2": null,
  "FacilityCity": "Cherokee",
  "FacilityState": "AL",
  "FacilityZipCode": "35616",
  "Facility4DigitZipExt": "0250",
  "FacilityCountyFIPS": "01033",
  "LEPC": "Colbert County LEPC",
  "FacilityLatDecDegs": "34.805000",
  "FacilityLongDecDegs": "-087.936944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 57203135,
  "ParentCompanyName": "LSB Industries, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 46860979,
  "Company2DUNS": 0,
  "OperatorName": "Cherokee Nitrogen Company",
  "OperatorStr1": "P.O. Box 250; 1080 Industrial Drive",
  "OperatorStr2": null,
  "OperatorCity": "Cherokee",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35616",
  "OperatorZipCodeExt": "0250",
  "RMPContact": "Mike Hester",
  "RMPTitle": "Regulatory Affairs Coordinator",
  "FTE": 90,
  "OtherEPAFacilityID": "35616LRCHNHIGHW",
  "EPAFacilityID": "100000099877",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "701-0013",
  "SafetyInspectionDate": "2003-07-31 00:00:00",
  "SafetyInspectionBy": "TN & Associates (for EPA)",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Re-submission of RMP for this facility",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP Pro",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 34.80583,
  "FRS_Long": -87.93917,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 50691,
      "AltID": "Letdown Area - Ammonia",
      "FacilityID": 35181,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 51840,
          "ProcessID": 50691,
          "NAICSCode": "325311",
          "_desc": {
            "NAICS_CODE": "325311",
            "NAICS_DESCRIPTION": "Nitrogenous Fertilizer Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 66783,
          "ProcessID": 50691,
          "ChemicalID": 56,
          "Quantity": 25235004.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 566783,
          "ProcessID": 50691,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 50692,
      "AltID": "Urea",
      "FacilityID": 35181,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 51841,
          "ProcessID": 50692,
          "NAICSCode": "325311",
          "_desc": {
            "NAICS_CODE": "325311",
            "NAICS_DESCRIPTION": "Nitrogenous Fertilizer Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 66784,
          "ProcessID": 50692,
          "ChemicalID": 57,
          "Quantity": 24069.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 566784,
          "ProcessID": 50692,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 50693,
      "AltID": "Ammonium-Nitrate Solution",
      "FacilityID": 35181,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 51842,
          "ProcessID": 50693,
          "NAICSCode": "325311",
          "_desc": {
            "NAICS_CODE": "325311",
            "NAICS_DESCRIPTION": "Nitrogenous Fertilizer Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 66785,
          "ProcessID": 50693,
          "ChemicalID": 57,
          "Quantity": 50137.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 566785,
          "ProcessID": 50693,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35181,
      "SummaryText": "Executive Summary for the Cherokee Nitrogen Company Facility\n\n1.0    Accidental Release Prevention and Response Policies\n\nWe at Cherokee Nitrogen are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n2.0    Cherokee Nitrogen Company and Regulated Substances \n\nOur facility's primary activities encompass the manufacture of ammonia and related processes. Ammonia is a natural part of the life process.  It is produced internally by all humans and mammals to process essential proteins. Ammonia is one of the most widely used industrial chemicals in the world, and is commonly used to purify water and refrigerate foods.\n\nThe company is a supplier to the fertilizer industry by manufacturing fertilizer grade ammonium nitrate, ammonium nitrate solutions, and other fertilizer products.  Cherokee Nitrogen markets its fertilizers to distributors, dealers, national farm retail chains, regional farm cooperatives, and other fertilizer producers for ultimate sale and delivery to farmers. \n\nWe have two regulated substances present at our facility.  These substances include anhydrous ammonia and aqueous ammonia. Anhydrous ammonia is used to manufacture nitric acid (<80 percent).  Aqueous ammonia is contained within the urea and ammonium nitrate solutions.  Typically, the facility manufactures two types of ammonium nitrate solutions: industrial-grade (83 weight percent) ammonium nitrate solution, and a high pressure solution consisting of 24 to 25 percent ammonia and 69 to 70 percent ammonium nitrate. The industrial grade ammonium nitrate is used as a primary building block for commercial explosives and blasting agents.  Without this "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35181,
      "SummaryText": "product, the mining of precious metals and gems, coal for power and concrete for construction would be much less safe and much more expensive.\n\nAs this RMP will illustrate, our accidental release prevention programs and our emergency response planning efforts help us effectively manage any potential hazards posed by these regulated substances.\n\n3.0    Accidental Release Prevention Program \n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with ASME, Section 8, 1955 and 1979 editions.    The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\n3.1    Process Safety Information\n\nCherokee Nitrogen maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\n3.2    Process Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is HAZOP.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of every five years.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA/update was performed on 11/30/2001.\n\n3.3    Operating Procedures\n\nFor the purposes of safely conducting activities within our covered processes, Cherokee Nitrogen maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35181,
      "SummaryText": "processes.\n\n3.4    Training\n\nCherokee Nitrogen has a comprehensive training program in place to ensure that employees operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every three years and more frequently as needed.\n\n3.5    Mechanical Integrity\n\nCherokee Nitrogen carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps.  \n\nMaintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n3.6    Management of Change\n\nWritten procedures are in place at Cherokee Nitrogen to manage changes in process chemicals, technology, equipment and procedures.  The most recent review/revision of Management of Change procedures was performed on 05/17/2004.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\n3.7    Pre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Cherokee Nitrogen.  The most recent review was performed on 10/08/2003.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n3.8    Compliance Audits\n\nCherokee Nitrogen conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The most recent complia"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35181,
      "SummaryText": "nce audit was conducted on 07/31/2003.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n3.9    Incident Investigation\n\nCherokee Nitrogen promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of five years.\n\n3.10    Employee Participation\n\nCherokee Nitrogen truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\n3.11    Contractors\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Cherokee Nitrogen has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n4.0    Chemical Specific Prevention Steps\n\n4.1    Anhydrous Ammonia\n\nSeveral process controls are in place to prevent and/or mitigate accidental releases of anhydrous ammonia.  These controls include vents, relief valves, check valves, manual and automatic shut-offs, interlocks, alarms, emergency back-up power, back-up pumps, rupture disks, excess flow devices, and water canons.  \n\n4.2    Aqueous Ammonia\n\nSeveral"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 35181,
      "SummaryText": " process controls are likewise in place to prevent and/or mitigate accidental releases of aqueous ammonia.  These controls include vents, relief valves, check valves, manual and automatic shut-offs, interlocks, alarms, back-up pumps, and excess flow devices.\n\n5.0    Five-year Accident History\n\nThe following is a brief summary of significant accidental chemical releases involving materials covered under EPA's RMP Rule during the previous five years.\n\n5.1    Anhydrous Ammonia\n\nDuring the past five years, Cherokee Nitrogen Company has not had an accidental anhydrous ammonia release resulting in on-site or off-site consequences, including deaths, injuries, significant property damage, environmental damage, off-site evacuation, or sheltering in place.\n\n5.2    Aqueous Ammonia\n\nDuring the past five years, Cherokee Nitrogen Company has not had an accidental aqueous ammonia release resulting in on-site or off-site consequences, including deaths, injuries, significant property damage, environmental damage, off-site evacuation, or sheltering in place.\n\n6.0    Emergency Response Programs\n\nCherokee Nitrogen maintains a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.  To ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nColbert County LEPC is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n7.0    Planned Changes to Improve Safety\n\nCherokee Nitrogen Company continually strives to improve and upgrade operating procedures, replace or maintain equipmen"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 35181,
      "SummaryText": "t, and develop and implement safety improvement projects.  Several developments and findings have resulted from the implementation of the various elements of our accidental release prevention program. Some of the major steps taken to improve safety at our facility include: installation of security/safety cables on all overhead chain operated valves; American Red Cross CPR and AED training; semi-annual third party safety inspections and audits with corrective action and follow up; establishing safety goals; plant wide monthly safety awareness meetings which focus on safety needs and input from all employees, and\nincrease in site security measures.\n\nThese activities are implemented and reflect current practices established at Cherokee Nitrogen. \n\n"
    }
  ]
}