{
  "FacilityID": 35191,
  "FacilityName": "Honeywell Electonic Materials - Salt Lake City",
  "FacilityStr1": "4603 West 2100 South",
  "FacilityStr2": null,
  "FacilityCity": "Salt Lake City",
  "FacilityState": "UT",
  "FacilityZipCode": "84120",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "49035",
  "LEPC": "West Valley City LEPC",
  "FacilityLatDecDegs": "40.723611",
  "FacilityLongDecDegs": "-112.000278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PP",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 131188583,
  "ParentCompanyName": "Honeywell International Inc.",
  "Company2Name": null,
  "CompanyDUNS": 2326734,
  "Company2DUNS": 0,
  "OperatorName": "Honeywell International Inc.",
  "OperatorStr1": "4603 West 2100 South",
  "OperatorStr2": null,
  "OperatorCity": "Salt Lake City",
  "OperatorStateFIPS": "UT",
  "OperatorZipCode": "84120",
  "OperatorZipCodeExt": null,
  "RMPContact": "Nigel Winters",
  "RMPTitle": "Plant Manager",
  "FTE": 20,
  "OtherEPAFacilityID": "84120THLTG4603W",
  "EPAFacilityID": "100000063361",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-07-08 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 40.72546,
  "FRS_Long": -111.99916,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 50704,
      "AltID": null,
      "FacilityID": 35191,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 51853,
          "ProcessID": 50704,
          "NAICSCode": "331419",
          "_desc": {
            "NAICS_CODE": "331419",
            "NAICS_DESCRIPTION": "Primary Smelting and Refining of Nonferrous Metal (except Copper and Aluminum)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 66798,
          "ProcessID": 50704,
          "ChemicalID": 51,
          "Quantity": 130000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 51,
            "ChemicalName": "Titanium tetrachloride  [Titanium chloride (TiCl4) (T-4)-]",
            "CASNumber": "7550-45-0",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 566798,
          "ProcessID": 50704,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35191,
      "SummaryText": "\nRMP2004Submit\nExecutive Summary\nHoneywell Salt Lake City Plant\n\nAbout Honeywell\nThe Salt Lake City plant is a manufacturing facility located in Utah.  It is part of the Specialty Materials business group of Honeywell International Inc.\n\nHoneywell is a $23 billion diversified technology and manufacturing leader, serving customers worldwide with aerospace products and services; control technologies for buildings, homes and industry; automotive products; turbochargers; and specialty materials.  Headquartered in Morris Township, N.J., Honeywell?s shares are traded on the New York, London, Chicago and Pacific Stock Exchanges. \n\nHoneywell Specialty Materials, also based in Morris Township, N.J., is a Honeywell business group and a global leader in providing high-performance specialty materials such as fluorocarbons, specialty films, advanced fibers, customized research chemicals and intermediates.\n\nHealth, Safety and Environment/Responsible Care\nHoneywell is committed to managing health, safety and the environment as a core business value. The company also integrates health, safety and environmental management into all aspects of our businesses as a competitive advantage in achieving profitable growth and accelerated productivity.\n\nHoneywell participates in the Responsible Care program of the American Chemistry Council. Established in 1988, Responsible Care is a voluntary program focused on achieving improvements in environmental, health and safety performance beyond levels required by the U.S. government\n\nIn addition to detailing practices for the safe use of materials and requiring audits, the Responsible Care initiative requires its member and partner companies to develop mechanisms for outreach with the communities in which they operate. Community Advisory Panels (CAP) serve as important links between chemical facilities and their neighboring communities. \n\nHoneywell Salt Lake City Plant\nThe Honeywell Salt Lake City plant is a primary Titanium Metal manufacturing fac"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35191,
      "SummaryText": "ility that has approximately 22 employees. The plant?s products are used to make sputter targets for the electronics industry and powder metallurgical parts.  \n\nOne of the materials used by the facility is Titanium Tetrachloride, which is on the RMP Rule's list of regulated substances.  The Honeywell Salt Lake City plant's storage and use of Titanium Tetrachloride exceeds the specified threshold 2,500 lbs., as defined by the EPA?s RMP Rule.  \n\nIn accordance with the requirements of the RMP Rule, a description of the following six elements is provided for the Honeywell Salt Lake City plant: \n\n1) Accidental Release Prevention and Emergency Response Policies: \nIt is the policy of the Honeywell Salt Lake City plant to operate a safe and environmentally sound facility by identifying and controlling health, safety, and environmental risks related to its operations; by designing its processes to protect people, property and the environment; by conducting and continually reviewing and improving programs for safety, health and environmental excellence; and by establishing processes to assure that all laws and regulations applicable to its operations and products are known and observed.  The accidental release prevention and emergency response policy associated specifically with the plant's use of Titanium Tetrachloride involves the integration of safety devices and technologies inherent in the design of the process, safe operational procedures and management practices, operator training, the preparation and testing of site emergency response plans, the maintenance of onsite emergency response equipment and coordinating our efforts and resources with local emergency response services, and communicating with the community. \n\n2) Description of the Facility and the Regulated Substance Handled: \nThe Salt Lake City plant manufactures high purity titanium. The manufacturing process includes the utilization of Titanium Tetrachloride (TTC). Titanium is produced by the reduction of TT"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35191,
      "SummaryText": "C using sodium. Further processing includes crushing, leaching, rinsing, drying and product sizing. \n\n\n3) The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps:  \nThe TTC systems were built in accordance with the design code and specification as recommended by a supplier. The supplier has over 20 years experience in the storage and handling of TTC.  The systems include many built in safety devices including level alarms, high level cutouts, safety vents, spare vessels for holding material and pressure relief devices. A foam spray system is installed at the offloading and bulk storage to mitigate fume emission in the event of a release.\n\nStandard operating procedures and checklists are in place and are updated as needed. Operators performing TTC operations must be certified. Certification is in accordance with established ISO 9000 procedures and includes classroom training, on the job training, a written test, and a demonstration of ability (practical test) \n\nA preventative maintenance program is used for testing and replacing components of the system as needed. Safety critical devices and the foam spray system are tested periodically to verify that they function correctly. Certain components are scheduled for periodic replacement, as appropriate. A schedule is used for physical inspection on the tanks and transfer lines as part of the mechanical integrity program.\n\n4) The Five Year Accident History:  \nThere have been no accidental releases involving Titanium Tetrachloride in the last five (5) years.\n\n5) The Emergency Response Plan:  \nThe Honeywell Salt Lake City plant has agreed with the local emergency response provider that the provider will perform emergency response for the facility. The plant is incorporated into the local fire department?s emergency response program, and the plant has provided the fire department with a copy of the plant emergency response plan.\n\nA close working relationship has been established with the loca"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35191,
      "SummaryText": "l fire department.  Regular tours of the facility are provided for familiarization with the chemical storage locations and the potential hazards.\n\n6) Planned Changes to Improve Safety:  \nAdditional video cameras are to be installed to allow remote monitoring of the process areas where Titanium Tetrachloride is stored or processed. Alarms to detect any release are also to be installed. This information will be relayed to a new control room, which will also be provided with the means to activate the emergency shutdown procedures in the event of a release."
    }
  ]
}