{
  "FacilityID": 35210,
  "FacilityName": "Gulbrandsen Chemicals Inc.",
  "FacilityStr1": "183 Gulbrandsen Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Orangeburg",
  "FacilityState": "SC",
  "FacilityZipCode": "29115",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45075",
  "LEPC": "Orangeburg County LEPC",
  "FacilityLatDecDegs": "33.436389",
  "FacilityLongDecDegs": "-080.855000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "gulbrandsen.com",
  "FacilityEmailAddress": "gci@gulbrandsen.com",
  "FacilityDUNS": 604088849,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Eric Smith",
  "OperatorStr1": "183 Gulbrandsen Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Orangeburg",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29115",
  "OperatorZipCodeExt": null,
  "RMPContact": "Erik Ebersole",
  "RMPTitle": "Plant Manager",
  "FTE": 70,
  "OtherEPAFacilityID": "29115GLBRNHWY21",
  "EPAFacilityID": "100000038764",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-11-03 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 33.43627,
  "FRS_Long": -80.84593,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) PRECISE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 50723,
      "AltID": "Basic Inorganic Chemicals",
      "FacilityID": 35210,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 51872,
          "ProcessID": 50723,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 66818,
          "ProcessID": 50723,
          "ChemicalID": 62,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 566818,
          "ProcessID": 50723,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35210,
      "SummaryText": "Gulbrandsen Chemicals, Inc. is a leader in the chemical Chemicals industry and has always been committed to protecting associates, the community, and the environment from highly hazardous incidents through safely operating our facility.\n\nFacility Overview:  Gulbrandsen Chemicals, Inc. owns and operates a chemical Chemicals plant located in Orangeburg, South Carolina.  The facility is regulated under RMP due to on-site chlorine storage in excess of the RMP applicability threshold of 2,500 pounds.  Chlorine is used for the production of anhydrous aluminum chloride at the facility.  Chlorine is stored in a 90-ton railcar having a capacity of 180,000 pounds. \n\nChemical Safety Overview:  The facility's overall approach and commitment to chemical safety is demonstrated by 1) the existing management, training, procedure and maintenance systems already in place at the facility, and 2) the hazard assessment, prevention program and emergency response provisions implemented specifically for chlorine in response to the RMP requirements.  The management structure and oversight to ensure safety is documented in the facility's RMP and includes compliance with applicable regulations, codes and standards (OSHA PSM Standard and US EPA 40 CFR 68).\n\nFive-Year Accident History:  Due to our excellent accident release prevention programs, Gulbrandsen has had no RMP reportable accident/release of chlorine within the five years proceeding RMP submittal.  \n\nPrevention Program:  The facility has implemented a Program Level 3 Prevention Program for chlorine, as required by the RMP rule, in accordance with the US EPA guidance.  These prevention program provisions are specifically intended to minimize the probability and/or consequence of any accidental chlorine release from the facility and include such measures as process hazards analysis, operating procedures, training, contractors, pre-startup safety, mechanical integrity, hot work permit, management of change, incident investigation, emerge"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35210,
      "SummaryText": "ncy planning and response, and compliance audits.  The facility prevention program is an ongoing system based on periodic training, incident investigations, audits, procedure revisions, and RMP updates as required to reflect facility change and RMP requirements.\n\nEmergency Response Program:  The facility's Emergency Response Program has been perfected to produce the maximum effective response in the least amount of time.  The facility has coordinated response with the Emergency Operation Center to ensure that they will respond to any accidental release from the chlorine system.  The facility has also established its own Emergency Response Reference Guide, which outlines six groups that will handle the response activities, including the Emergency Team, the Repair Team, the First Aid and Rescue Team, the Evacuation Team, the Communication Team, and the Environmental and Clean-Up Team.  \n\nSafety Management and Changes:  The facility is committed to ensuring its operations are safe and in accordance with all RMP requirements, and has established a senior manager responsible for RMP development, implementation, and compliance.  This manager is committed to maintaining the safety of the RMP covered chlorine systems through active adherence to the appropriate procedures and codes.  To ensure that the appropriate changes occur as necessary to maintain/improve safety, ongoing hazard reviews, training, audits, maintenance and investigations will be conducted as required by RMP.  Updates to the RMP will be completed as necessary in response to these activities.\n\nSummary:  As documented in this submittal, the RMP for the facility has been completed in accordance with all 40 CFR 68 requirements and the facility has certified compliance.  Gulbrandsen takes pride in and is committed to conducting business in strict conformity with all applicable laws in a safe and responsible manner.  The very highest priority is placed on the health and safety of Gulbrandsen's associates and the "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35210,
      "SummaryText": "community in which we conduct business."
    }
  ]
}