{
  "FacilityID": 3546,
  "FacilityName": "Reichhold, Inc.",
  "FacilityStr1": "3150 Fiberglass Road",
  "FacilityStr2": null,
  "FacilityCity": "Kansas City",
  "FacilityState": "KS",
  "FacilityZipCode": "66115",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20209",
  "LEPC": "Wyandotte County LEPC",
  "FacilityLatDecDegs": "39.163611",
  "FacilityLongDecDegs": "-94.616389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "UN",
  "FacilityURL": "reichhold.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7118144,
  "ParentCompanyName": "Reichhold, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1220904,
  "Company2DUNS": 0,
  "OperatorName": "Reichhold, Inc.",
  "OperatorStr1": "3150 Fiberglass Road",
  "OperatorStr2": null,
  "OperatorCity": "Kansas City",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66115",
  "OperatorZipCodeExt": null,
  "RMPContact": "Paul J. Oppliger",
  "RMPTitle": "Site Leader",
  "FTE": 28,
  "OtherEPAFacilityID": "KSD007118144",
  "EPAFacilityID": "100000043375",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-11 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-09-27 00:00:00",
  "DeRegistrationEffectiveDate": "2019-09-19 00:00:00",
  "AnniversaryDate": "2004-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 39.14489,
  "FRS_Long": -94.61738,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4095,
      "AltID": "Resin Manufacture",
      "FacilityID": 3546,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4177,
          "ProcessID": 4095,
          "NAICSCode": "32521",
          "_desc": {
            "NAICS_CODE": "32521",
            "NAICS_DESCRIPTION": "Resin and Synthetic Rubber Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4363,
          "ProcessID": 4095,
          "ChemicalID": 29,
          "Quantity": 790000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504363,
          "ProcessID": 4095,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3546,
      "SummaryText": "Risk Management Plan:\n\n\nExecutive Summary\n\nAs a participating member of the Chemical Manufacturers Association (CMA), Reichhold, Inc., is committed to the Responsible Care (r) program and to operating facilities in a manner that is safe for our employees, the community and the environment.  As part of this commitment, Reichhold has established a Risk Management Program that helps the company to identify and communicate risks associated with our operations.  As part of this commitment, we have established controls to prevent accidental releases from occurring. Despite these measures, should an accidental release of a hazardous material occur, we have also developed specific plans for each facility to reduce the effects of potential releases upon our employees and the general public. We have also developed site-specific plans for emergency response that involve both our employees and local emergency service providers.\n\n\nDescription of Source and Regulated Substances\n\nReichhold, Inc. operates 24 facilities in North America.  We produce a wide variety of polymers and resins found in many household items.  This particular facility produces various materials found in latex paints, construction products, adhesives and other common items.  We use several chemicals to manufacture these products.  One of these chemicals is subject to the RMP regulation.  \n\nReichhold uses vinyl acetate to make polymers that go into items like latex paint.  We have the capacity to store 790,000 pounds of vinyl acetate in a storage vessel, but typically we have approximately 370,000 pounds or less on hand at any one time.\n\n\nOffsite Consequence Analysis\n\nGeneral Accidental Release Prevention Program\n\nTo help Reichhold, Inc. achieve its EHS goals, this site is dedicated to continuous improvement of its comprehensive environmental, health, and safety program, which includes compliance with the Occupational Safety and Health Administration's (OSHA) Process Safety Management regulation (29 CFR 1910.1"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3546,
      "SummaryText": "19).\n\nEmployees at this facility are highly trained, knowledgeable, and skilled, which results in a workforce that is very capable in their job performance.  These employees are then supported with numerous sources of information about:\n1. Their Job - Operating Procedures, Emergency Procedures, and Safe Work Practices\n2. The chemicals they use - Material Safety Data Sheets, Exposure Limits and Exposure Prevention, and Process Chemistry\n3. The processes which the operate - Equipment Design and Construction Information, Safe Operating Limits, and the Consequences and Correction of Process Upsets.\n\nThe quality of both our employees and the supporting information, along with active involvement of the employees at all levels of the organization, all come together to provide a strong foundation for the Environmental, Health, and Safety programs for this facility.  Traditional programs such as Hot Work, Confined Space, Lockout/Tagout, and Line Break benefit from the high level of employee involvement; however, these resources and the involvement of our employees are critical for programs such as Process Hazard Analysis, Management of Change, Incident Investigation, and Emergency Response.  It is through these programs that the potential hazards of the process are identified, corrected, reviewed, and/or mitigated.\n\nTwo additional programs that strengthen our Environmental, Health, and Safety programs are our Contractor Management and Internal Auditing.  Contractors and their employees are treated as though they are our own employees while performing work at our site.  They are trained on our processes and procedures, they will be expected to follow our programs and procedures, and they are held to the same standards of performance as we hold our own employees. \n\nRegular audits are done to determine the facility's implementation and operation under these programs.  These audits are then used to determine where additional efforts, program changes, or training needs to be impl"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3546,
      "SummaryText": "emented to ensure that we are meeting the intent and requirements of our environmental, health, and safety programs.\n\n\nWorst Case Release Scenario and Alternative Release Scenario\n\nReichhold's worst-case scenario is the release of the entire contents of a 100,000-gallon storage tank of vinyl acetate monomer, releasing 790,000 lbs. of this material into a concrete containment dike.  This assumes the material is vaporized in 21.7 hours and the vapor travels a distance of 1.9 miles (RMP-Comp).\n\nThe worst -case release has a potential impact on 12,368 people living in 4,814 households (Landview III software).\n\nThe alternative release scenario would be a vinyl acetate monomer transfer line leak releasing 9,600 lbs. of vinyl acetate monomer during a one-hour period.  The vapors would travel approximately 0.2 miles before dropping below the ERPG concentration (RMP-Comp).\n\nNo persons living in permanent or rental properties around the plant would be effected (Landview III Software).\n\nThe vinyl acetate storage tank is protected from overfill by air interlock system.  If the tank reaches high level, an alarm will sound and the unloading pump will shutdown.\n\nThis mechanical interlock, combined with unloading procedures and a daily inventory of the tank, make a major release from this system unlikely.\n\nFive Year Accident History\n\nThis facility has a good safety record.  All incidents with the potential to cause any injury or damage are investigated.  The regulations require the reporting of events involving regulated substances that result in deaths, injuries or significant property damage on site or known deaths, injuries, evacuations, sheltering-in-place, property damage or environmental damage off site.  There have been no releases in the last five years that require reporting under the RMP program.\n\n\nEmergency Response Program\n\nThe site has a comprehensive emergency response plan, which is coordinated with local emergency response organizations and includes a notification l"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3546,
      "SummaryText": "ist.  Drills involving all plant personnel and contractors are conducted annually at a minimum.\n\nTransportation of hazardous materials (inbound raw materials as well as outbound finished products) within the local area is included in planning activities.  The Emergency Response Plan considers chemical distribution, safety, and emergency response capabilities of local agencies by utilizing TRANSCARE(r), state, and regional networks.  \n\n\n\nPlanned Changes to Improve Safety\n\nReichhold constantly strives to improve the safety of its processes through its incident investigation program and solicitation of safety suggestions from its workers.\n\nPlans to improve the overall safety of the site includes:\n\n1. Installation of a new computer control system to automatically monitor valve positions to ensure hazardous materials are not spilled.\n\n2. Upgrade tank gauges to electronic measurement devices that will tie into the computer control system and alarm on high level.\n\n3. Ongoing improvement in Operator Training.\n\n4. Pursuit of OSHA VPP Star status."
    }
  ]
}