{
  "FacilityID": 35489,
  "FacilityName": "City of Waukgen Water Treatment Plant",
  "FacilityStr1": "360 East Seahorse Drive",
  "FacilityStr2": null,
  "FacilityCity": "Waukegan",
  "FacilityState": "IL",
  "FacilityZipCode": "60085",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17097",
  "LEPC": "Lake County LEPC",
  "FacilityLatDecDegs": "42.361806",
  "FacilityLongDecDegs": "-087.819500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Waukegen",
  "OperatorStr1": "360 East Seahorse Drive",
  "OperatorStr2": null,
  "OperatorCity": "Waukegan",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60085",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jeff Musinski",
  "RMPTitle": "Water Division Director",
  "FTE": 23,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000100277",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 42.36894,
  "FRS_Long": -87.82209,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51151,
      "AltID": "22131",
      "FacilityID": 35489,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52309,
          "ProcessID": 51151,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 67510,
          "ProcessID": 51151,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 567510,
          "ProcessID": 51151,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35489,
      "SummaryText": "Executive Summary\n\n1.  Accidental Release Prevention and Emregency Response Policies\n\nWe at the City of Waukegan Water Treatment(Filtration) Plant are strongly committted to employee, public and environmental safety.  This commitment is inherent to a compehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible relases of regulated substances.  Unforeseeably, if such a release does occur, we are completely coordinated with emergency responders to provide highly trained emergency response personnel to control and mitigate the effects of the release.\n\n2.  The Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities encompass production of potable water.  Disinfection of water via chemical means is of utmost importance in the water production process.  To assist in th disinfection process, we have the following regulated substance present at our facility.\n\nSubstance:  Chlorine\n\n3.  Accident History\n\nThe City of Waukegan Water Treatment Plant has not had any reportable accidents in the last \nfive years.  \n\n4.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nThe City of Waukegan Water Treatment Plant has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68 and the OSHA PSM standard under 29 CFR 1910.119, 29 CFR 1910.38, and EPCRA 302.  The following sections briefly describe the elements of our prevention program that are in place at our facility.\n\nProcess Safety Information\nThe faciity maintains a detailed record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nThe Plant conducts studies to en"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35489,
      "SummaryText": "sure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is a combination of \"what-if\" questions and a detailed checklist.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of every 5 years, or more frequently if necessary.  Any findings from the Process Hazard Analysis are subsequently addressed. The most recent Process Hazard Analysis update was completed on May 3, 2004.\n\nOperating Procedures\nThe Plant maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is readily accessible to operators involved with the process.  The most recent review of of operating procedures was completed on June 1, 1999.\n\nTraining\nThe facility has a comprehensive training program in place to ensure that employees that are operating the processes are competent in the operating procedures associated with the processes. New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided annually and more frequently as needed.\n\nMechanical Integrity\nThe Facility carries out documented maintenance checks on process equipment to ensure proper functioning.  The most recent equipment inspection of all chlorination process equipment was completed on April 13, 1999.Process equipment examined by these checks includes among others; storage tanks, piping systems, relief and vent systems, alarms, controls and pumps.  \n\nMaintenance operations are carried out by qualified personnel with previous training in maintenance practices.  The most recent review of maintenance procedures was completed on June"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35489,
      "SummaryText": " 1, 1999.  Additional specialized training are offered to these qualified personnel as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.  \n\nManagement of Change\nWritten procedures are in place at the facility to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-Startup Reviews\nPre-startup safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at the facility.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nThe Facility conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every three years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.  The most recent compliance audit was completed on May 3, 2004. All changes resulting from this compliance audit are expected to be complete by December 31, 2004.\n\nIncident Investigation\nThe Facility promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of five years.\n\nEmployee Participation\nThe Facility considers process safety management and accident prevention as a team effort.  Employees are strongly encouraged to express their views concerning accident prevention issues and"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35489,
      "SummaryText": " to recommend improvements.  In addition, our employeeshave access to all information created as part of the facility's implementation to both the PSM standard and RMP rule.  The most recent revision of of employee participation plans was completed on May 3, 2004.\n\nContractors\nOn occasion, the Facility hires contractors to conduct speicalized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is conducted. The Facility has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.  The most recent revision or contractor safety procedures was completed on June 1, 1999.\n\n5.  Emergency Response Plan\n\nThe Facility utilizes a written emergency action plan to deal with accidental releases of hazardous materials.  The plan includes aspects of emergency response including adequate first aid and medical treatment, evacuations, and notification of local emrgency response agencies and the public.  The most recent review of the Facility's Emergency Response Plan was completed on XXXXXXX and the most recent training Emergency Response training for the Facility's employees was completed on XXXXX.\n\nThe chlorine process is included in the community emergency response plan.  The agency responsible as the first responder to any chlorine emergencies at the Facility is the Waukegan Fire Department at telephone number:  847.599.5410.  All Waukegan firefighters/parametics are qualified as first responders.\n\nIn addition, both the chlorine storage room and the chlorinator room are monitored by detection/alarm devices.  In the  event of a leak, the detection system sets off both an audible and visual alarm within the filtration plant."
    }
  ]
}