{
  "FacilityID": 3549,
  "FacilityName": "Hilltop Water Treatment Plant",
  "FacilityStr1": "6962 Highway 281 South",
  "FacilityStr2": null,
  "FacilityCity": "Mineral Wells",
  "FacilityState": "TX",
  "FacilityZipCode": "76067",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48363",
  "LEPC": "Palo Pinto  LEPC",
  "FacilityLatDecDegs": "32.708056",
  "FacilityLongDecDegs": "-98.105833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Mineral Wells",
  "OperatorStr1": "PO Box 339",
  "OperatorStr2": null,
  "OperatorCity": "Mineral Wells",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76068",
  "OperatorZipCodeExt": null,
  "RMPContact": "Lance Howerton",
  "RMPTitle": "City Manager",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000043507",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-09 00:00:00",
  "SafetyInspectionBy": "Texas Municipal League",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 32.70806,
  "FRS_Long": -98.10583,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4099,
      "AltID": null,
      "FacilityID": 3549,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4181,
          "ProcessID": 4099,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4367,
          "ProcessID": 4099,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504367,
          "ProcessID": 4099,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3549,
      "SummaryText": "The management of the City of Mineral Wells Public Works Department and operating personnel of the Hilltop Water Treatment Plant are fully committed to the safe handling and use of chlorine. Chlorine is recognized as the preferred agent for disinfecting public water supplies and the Hilltop Water Treatment facility utilizes chlorine solely for this purpose. The facility utilizes chlorine cylinders in one-ton capacity cylinders with a maximum of eight cylinders stored at the facility.\n\nThe EPA Risk Management Program Rule requires that covered facilities handling chlorine evaluate a Worst-Case Scenario for one-ton chlorine cylinders that assumes a sudden catastrophic  cylinder failure with atmospheric conditions classified as the most stable of possible conditions (F Stability). The facility's worst-case scenario has been developed utilizing all assumptions required by the EPA Risk Management Program Rule and scenario modeling information from the American Water Works Association's (AWWA) \"Compliance Guidance and Model Risk Management Program for Water Treatment Plants.\" The worst-case scenario assumes an ambient temperature of 110 degrees F. which is the highest temperature recorded in the area during the previous 3 years based upon climatological data for the greater Fort Worth, Texas area. Due to the characteristics of the terrain, the topography has been classified as Rural for purposes of evaluating the worst-case scenario. Use of the AWWA scenario modeling information indicates that a worst-case scenario, involving a catastrophic failure of a chlorine cylinder and other assumptions required by the EPA Risk Management Program Rule, would have off-site public impact.\n\nAn Alternative Release Scenario (ARS) for chlorine has also been evaluated. The scenario assumes the release of chlorine gas from a single cylinder through a 5/16-inch diameter valve opening due an incident such as a tubing failure, bad connection, or valve failure. The ARS involves a 317 pound rele"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3549,
      "SummaryText": "ase of chlorine at a maximum average sustained release rate of 10.5 pounds per minute and a 60 minute release duration. The ARS also assumes Class D  atmospheric stability, wind speed of 3.0 meters per second, relative humidity of 50%, and a temperature of 77 degrees F. The topography is classified as Rural for purposes of evaluating the ARS. \n\nScenario modeling information from the AWWS's \"Compliance Guidance and Model Risk Management Program for Water Treatment Plants\" was utilized in evaluating the ARS. Use of AWWA guidelines, with the assumptions as specified in the previous paragraph, indicates the ARS would have off-site public impact.\n\nThe EPA Risk Management Program Rule requires that covered facilities report the number of accidental chlorine releases during the past five years. The Hilltop Water Treatment Plant has experienced zero (0) chlorine releases during the past five years. \n\nThe Hilltop Water Treatment facility is attended at all times with trained operators, including personnel who are recognized as Certified WaterTreatment Plant Operators. To help ensure the safety of chlorine operations, the facility maintains the following information and programs: chlorine safety information, hazard reviews, operating procedures, maintenance procedures, training, and compliance audits. \n\nThe facility maintains an emergency action plan that includes instructions for immediately requesting assistance from the City of Mineral Wells Fire Department in the event of an emergency release of chlorine and for making appropriate notifications to public agencies. A chlorine cylinder repair kit is maintained at the plant to facilitate timely mitigation of any cylinder leaks that may occur.  Information has been provided to the Palo Pinto County LEPC for coordinating the facility's plans with the community emergency response plans. The facility continually strives to improve the safety of its operations. Current improvement actions include continued emergency preplanning w"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3549,
      "SummaryText": "ith the City of Mineral Wells Fire Department."
    }
  ]
}