{
  "FacilityID": 35536,
  "FacilityName": "Cagles Keystone Foods, LLC",
  "FacilityStr1": "Rt 4 Box 439",
  "FacilityStr2": null,
  "FacilityCity": "Albany",
  "FacilityState": "KY",
  "FacilityZipCode": "42602",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21053",
  "LEPC": "Clinton LEPC",
  "FacilityLatDecDegs": "36.760028",
  "FacilityLongDecDegs": "-085.178611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Cagles Keystone Foods, LLC",
  "OperatorStr1": "Rt 4 Box 439",
  "OperatorStr2": null,
  "OperatorCity": "Albany",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "42602",
  "OperatorZipCodeExt": null,
  "FTE": 1604,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000129942",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-01-07 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 36.760028,
  "FRS_Long": -85.178611,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51226,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 35536,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 67628,
          "ProcessID": 51226,
          "ChemicalID": 56,
          "Quantity": 32000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 52386,
          "ProcessID": 51226,
          "NAICSCode": "311615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 29399,
              "Process_NAICS_ID": 52386,
              "SafetyReviewDate": "2004-03-23 00:00:00",
              "PHA_Date": "2004-06-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-12-16 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Hand held monitors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-12-09 00:00:00",
              "TrainingReviewDate": "2004-03-04 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-05-01 00:00:00",
              "EquipmentInspectionDate": "2004-05-17 00:00:00",
              "EquipmentTested": "Compressors",
              "ChangeMgmtDate": "2002-11-06 00:00:00",
              "ChangeMgmtReviewDate": "2004-05-01 00:00:00",
              "PreStartupReviewDate": "2003-03-05 00:00:00",
              "ComplianceAuditDate": "2004-02-03 00:00:00",
              "AuditCompletionDate": "2004-06-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-05-01 00:00:00",
              "HotWorkPermitReviewDate": "2004-05-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2004-06-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 42691,
                  "PreventionProgram3ID": 29399,
                  "ProcessChemicalID": 67628
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 35536,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-10-01 00:00:00",
    "ERTrainingDate": "2004-01-20 00:00:00",
    "CoordinatingAgencyName": "Clinton County LEPC",
    "CoordinatingAgencyPhone": "6063879243",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35536,
      "SummaryText": "Executive Summary\n\n1.\tAccidental Release Prevention and Emergency Response Policies\nCagles Keystone Foods is strongly committed to employee, public and environmental safety.  Our comprehensive process safety management program demonstrates this commitment.  The program is designed to prevent the occurrence and minimize the consequences of a significant release of anhydrous ammonia.  Our facility operates under detailed written procedures.  Employees are trained to safely operate the refrigeration system and know its limits.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such releases do occur, our emergency response team is trained to stop the release and mitigate any spilled chemical.  The facility¿s Emergency Response Plan (ERP) is reviewed annually with local emergency response personnel.  A chemical spill and release plan specific to anhydrous ammonia is included in the facility¿s ERP.  The chemical spill plan establishes specific policies and procedures to ensure the safe and timely evacuation of employees and the surrounding community.  The Clinton County Volunteer Fire Department will provide assistance if needed.\n\n2.\tFacility and Regulated Substances Handled\nCagles Keystone Foods is a slaughter and poultry processing facility.  Anhydrous ammonia is the RMP regulated substance present at the facility.  The ammonia is used extensively in the refrigeration system.  \n\n3.\tThe General Accidental Release Prevention Program and Chemical Specific Prevention Steps\nOur facility has taken the necessary steps to comply with the accidental release prevention requirements set out under EPA¿s 40 CFR Part 68.  In addition, our facility is subject to the following OSHA standards:\n§\t29 CFR 1910.38\t\n§\t29 CFR 1910.120\n§\t29 CFR 1910.165\n§\t29 CFR 1910.119\nCagles Keystone Foods has developed a process safety management program for the hazardous chemical - anhydrous ammonia.  The program is structured on t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35536,
      "SummaryText": "he elements described by the OSHA 1910.119 Appendix C.  The elements of the PSM program are employee participation, process safety information (PSI), process hazard analysis (PHAs), standard operating procedures, training, contractors, pre-startup safety review, mechanical integrity, management of change, incident investigation, emergency planning and response.  CKF has implemented several environmental and safety programs that correspond and enhance the PSM program.  Thus, PSM is one program in a comprehensive safety management system at this facility.  \nThe elements of the PSM program are described briefly below.\nProcess Safety Information ¿ detailed safety information that describes the chemical hazards, operating parameters of the system, and equipment designs and specifications.\n\nProcess Hazard Analysis ¿ comprehensive studies to identify hazards associated with the regulated chemical and system control methods.  The methodology used to carry out these analyses is the What If-Checklist.  A team of qualified personnel undertakes the studies with expertise in engineering and process operations.  The studies are revalidated every five years or whenever management of changes warrants a new study.\n\nStandard Operating Procedures ¿ written operating procedures that guide startup, normal operations, temporary operations, emergency operations, emergency shutdown, and normal shutdown.  Information is reviewed routinely and available to every operator.\n\nTraining ¿ Cagles Keystone Foods has a comprehensive training program in place for operators and refrigeration mechanics.  Refrigeration mechanics, safety director, and members of the local fire department train annually under the guidelines of OSHA¿s 1910.120 hazardous waste operations and emergency response.  General awareness information is provided to every employee during orientation to comply with guidelines of OSHA¿s 1910.1200 Hazard communication.\n\nMechanical Integrity ¿ The refrigeration system¿s maintenance progr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35536,
      "SummaryText": "f OSHA¿s PSM rule and other regulatory programs that correspond with the particular job.\n\n4.\tFive Year Accident History\nCagles Keystone Foods has been operating since November 1998.  We have had no reportable releases of anhydrous ammonia.  We hope to continue this outstanding record.   \n\n5.\tEmergency Response Program\nCagles Keystone Foods has a detailed emergency response plan.  The purpose of the plan is to protect employees from serous injury, loss of life, and minimize property loss in the event of an emergency.  The plan identifies specific emergencies including, fire, severe weather, bomb threat, and hazardous chemical spills.  The plan is reviewed with local emergency response personnel annually.  Local personnel include members of surrounding fire departments, city police, county police, state police, hospitals, and ambulance services.  Local response personnel are invited to the facility to formally review the plan and tour the facility.  The chemical spill plan identifies surrounding neighbors in the event of a community evacuation.  A handout including the chemical spill plan, list of neighbors, msds sheets, etc. is provided at the annual meeting.  \n\n6.\tPlanned changes to Improve Safety\nCagles Keystone Foods is committed to improving our safety record each year.  We have a safety committee made up of various members of management.  Each member is responsible for one safety topic such as emergency response.  Each year we alternate the members of the committees to keep ideas new and attitudes fresh.  We have annual training planned for the emergency response team.  We also plan to continue coordinating with local emergency response personnel."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35536,
      "SummaryText": "am is operated from a software program.  The program generates daily preventative maintenance orders that are completed by refrigeration mechanics.  Inspections and process control operations are scheduled on the software program as well.  Follow up reports are generated to ensure the daily work orders are followed through to completion.  Any equipment deficiencies identified during maintenance/inspection checks are corrected in a safe and timely manner.\n\nManagement of Change ¿ written procedures to manage changes in process operations, technology, equipment, procedures, and chemicals.  Process operators, and mechanics and all other employees affected by a change in a process are promptly made aware of and trained to deal with the changes.  \n\nPre-Startup Reviews ¿ formal meetings conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits ¿ conducted on a regular basis to determine compliance with the provisions of the RMP Rule.  Audits are scheduled for every 3 years and corrective actions are undertaken in a safe and prompt manner.\n\nIncident Investigation ¿ Cagles Keystone foods promptly investigates any incident that has resulted in or could reasonably result in a catastrophic release of a regulated substance.  Corrective actions are identified and implemented to prevent future problems from reoccurring.  \n\nEmployee Participation\nCagles Keystone Foods believes that process safety management and accident prevention is a team effort.  Employees are encouraged to express their views and ideas concerning accident prevention, operation procedures, and recommendations for improvements.  \n\nContractors Safety Program\nRoutinely, contractors will be hired to perform specialized maintenance or construction activities.  Contractors must meet the requirements of our Contractor Safety Program.  The program has strict guidelines that reflect the requirements o"
    }
  ]
}