{
  "FacilityID": 35600,
  "FacilityName": "Dillman Waste Water Treatment Plant",
  "FacilityStr1": "100 West Dillman Road",
  "FacilityStr2": null,
  "FacilityCity": "Bloomington",
  "FacilityState": "IN",
  "FacilityZipCode": "47403",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18105",
  "LEPC": "Monroe County LEPC",
  "FacilityLatDecDegs": "39.092397",
  "FacilityLongDecDegs": "-086.551352",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 70711239,
  "ParentCompanyName": "City of Bloomington Utilities",
  "Company2Name": null,
  "CompanyDUNS": 70711239,
  "Company2DUNS": 0,
  "OperatorName": "City of Bloomington Utilities",
  "OperatorStr1": "1969 South Henderson Street",
  "OperatorStr2": null,
  "OperatorCity": "Bloomington",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "47401",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Drake",
  "RMPTitle": "Plant Manager",
  "FTE": 23,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000078248",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-04-29 00:00:00",
  "DeRegistrationEffectiveDate": "2009-04-22 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 39.0935,
  "FRS_Long": -86.54939,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51324,
      "AltID": null,
      "FacilityID": 35600,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52489,
          "ProcessID": 51324,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 67758,
          "ProcessID": 51324,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 567758,
          "ProcessID": 51324,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35600,
      "SummaryText": "The Risk Management Plan (RSM) for the Dillman Waste Water Treatment Plant was originally prepared and submitted in June 1999.  The RMP for this facility has been updated to meet the 5 year update requirement by the U.S. Environmental Protection Agency.  Updated changes to the 1999 RMP include: 1) the requirement that information on reportable chemical accidents be added to the RMP within 6 months of the accident date; 2) the requirement that changes to the emergency contact information be reported within 1 month; 3) the removal of the original requirement to include a brief description of the off-site consequence analysis (OCA) in the Executive Summary of the RMP; and 4) the addition of 3 data elements to the RMP consisting of: emergency contact e-mail addresses if the addresses exist; b) the purpose and type of any submission that revises or otherwise affects the previously filed RMP; and c) the name, address, and telephone number of the contractor/consultant who prepared the updated RMP.\n\n\nDillman Waste Water Treatment Plant and Regulated Substances Handled\n\nThe Dillman Waste Water Treatment Plant (Dillman WWTP) treats approximately 10.5 million gallons daily of wastewater for the City of Bloomington.  The processes at the plant include mixing, sedimentation control, flocculation, filtration, aeration, clarification, and chlorination of wastewater from the City of Bloomington .  The wastewater chlorination process uses gaseous phase chlorine.  The only regulated substnce used at the plant is chlorine.  The facility purchases pressurized cylinders that are filled with 2,000 pounds of liquified chlorine.  A total of 20,000 pounds of chlorine could be stored at the plant at any one time.\n\n\nAccidental Release Program and Chemical-Specific Prevention Steps\n\nThe Dillman WWTP  is covered by the Emergency Planning and Right-to-Know (EPCRA) program and the OSHA Process Management Plan requirements.  The only substance representing a hazard to humans and the environment is"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35600,
      "SummaryText": " the potential toxic release of chlorine gas.  Potential releases of chlorine gas could occur from pressurized cylinders damaged during unloading and potential release from material failure of the vacuum relief valve on each gas cylinder.  The facility has the following process controls in place to reduce the risk of chlorine: vessel relief valves, manual shutoff controls, automatic shutoffs, gas detection alarms, and rupture disks.  When the outer access doors to the gas cylinder storage room are closed, the chlorine storage building provides significant passive control and mitigation of chlorine gas escape from the facility.  Pursuant to U.S. EPA guidance, the storage building passive control could reduce the rate of chlorine gas release to the environment by approximately 55%.  Chlorine gas leaks can be detected through the use of chlorine gas sensors within the storage room area and in the chlorination process room.\n\n\nAccidental Release and Emergency Response Policies\n\nThe City of Bloomington has a strong committment to the protection of the public and environment from releases of hazardous chemicals from any of its facilities.  The individual facility managers are responsible for safe operating and maintenance of all potentially hazardous treatment processes as well as the enforcement of emergency response policies.  Guidance and policies for the handling of accidental releases of hazardous substances at its facilities are provided by: 1) a Process Safety Management Plan (June 1999); and a 2) Comprehensive Emergency Response Plan (under the direction of the Monroe County LEPC).  All personnel that work with facilities process equipment using hazardous substances, receive training in safety and emergency response procedures.  \n\n\nFive-Year Accident History\n\nThe Plant Manager of the Dillman WWTP has stated that the facility has not had any reportable releases of chlorine gas during the past 5 years.\n\n\nEmergency Response Program\n\nThe Dillman WWTP facility is includ"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35600,
      "SummaryText": "ed in the Comprehensive Emergency Response Plan as prepared by the Monroe County Local Emergency Planning Commission.  All employees of the City of Bloomington Utilities Department are trained in emergency response procedures and practices on the job on a regular basis by qualified senior staff and management.  The facility currently does not conduct emergency response drills.  The facility staff has been properly trained in accordance with procedures specified in the Process Safety Management Plan and the Risk Management Plan."
    }
  ]
}