{
  "FacilityID": 35607,
  "FacilityName": "South Mesquite Regional Wastewater Treatment Plant",
  "FacilityStr1": "3500 Lawson Road",
  "FacilityStr2": null,
  "FacilityCity": "Mesquite",
  "FacilityState": "TX",
  "FacilityZipCode": "75149",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48113",
  "LEPC": "Dallas County LEPC",
  "FacilityLatDecDegs": "32.708333",
  "FacilityLongDecDegs": "-096.541667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "North Texas Municipal Water District",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "North Texas Municipal Water Dist.",
  "OperatorStr1": "P.O. Box 2408",
  "OperatorStr2": null,
  "OperatorCity": "Wylie",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75098",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ken Wesson",
  "RMPTitle": "Wastewater Systems Manager",
  "FTE": 17,
  "OtherEPAFacilityID": "TX0047431",
  "EPAFacilityID": "100000147218",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-06-11 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-06-26 00:00:00",
  "DeRegistrationEffectiveDate": "2020-04-24 00:00:00",
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 32.7125,
  "FRS_Long": -96.55297,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51333,
      "AltID": "Chlorination of Effluent",
      "FacilityID": 35607,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52498,
          "ProcessID": 51333,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 67770,
          "ProcessID": 51333,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 567770,
          "ProcessID": 51333,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 51334,
      "AltID": "Dechlorination of Effluen",
      "FacilityID": 35607,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52499,
          "ProcessID": 51334,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 67771,
          "ProcessID": 51334,
          "ChemicalID": 49,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 567771,
          "ProcessID": 51334,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35607,
      "SummaryText": "FACILITY DESCRIPTION\nThe North Texas Municipal Water District is a regional entity that treats water, wastewater, and solid waste for four counties in the north Texas area. The South Mesquite Regional Wastewater Treatment is located in Mesquite, at 3500 Lawson Road. The facility is owned and operated by the North Texas Municipal Water District (NTMWD). The plant is an aerobic wastewater treatment plant that serves approximately 124,523 people with wastewater services. The treatment plant uses chlorine for disinfection of the wastewater before it is discharged to the receiving stream. Currently a maximum of 32,000 pounds of chlorine and 18,000 pounds of sulfur dioxide can be found on site depending of the time of year and volume of water being treated. No other chemicals located onsite are of sufficient inventory to be included in the RMProgram.\n\nSAFETY AND EMERGENCY RESPONSE POLICIES\nThe NTMWD has developed a safety handbook that is read by all employees upon their employment. By having new employees read the safety handbook during employee orientation they immediately realized the importance the NTMWD places on having a safe workplace. A copy of the handbook is maintained at the facilities for reference to safety policies that are included. The handbook includes a mission statement at the beginning that states, ?NTMWD promotes accident and injury prevention to protect the employees and citizens we serve through a training and awareness program?. This statement is signed by the NTMWD Executive Director and supported by management personnel.   \n\nThe NTMWD also trains all field personnel in chemical awareness so they can understand the substance they are working around. In the awareness training classes not only are the chemicals discussed that are included in the RMProgram, but other chemicals are discussed that each employee may encounter during their routine duties. MSDS sheets can be found on the plant site that alerts the employees to the dangers of chemical hand"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35607,
      "SummaryText": "ling and protective clothing requirements. \n\nThe NTMWD has trained personnel to respond to a chemical release. The technician level operators are on call twenty-four hours a day to respond to any emergency. Equipment including SCBAs, PPE clothing, and chlorine repair kits are located in an emergency response vehicle in the event of a release. \n\nAll new employees work with a senior operator to train in all aspects of the job. A new employee is not permitted to work alone until supervisory personnel are satisfied with his/her knowledge of their job duties. The training includes a number of on the job skills of which chemical handling and job safety are stressed. \n\nThe NTMWD has developed and included in the Vulnerability Assessment study a plan detailing emergency response to various weather related conditions, and security threats. Management has set up a command center that will be activated in the event of an emergency condition that would include a chemical release. \n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMCIAL-SPECIFIC PREVENTION STEPS\nNTMWD?s is committed to safety at the South Mesquite Regional Wastewater Treatment Plant and has long emphasized the importance of safety in storing and using regulated toxic substances. NTMWD has used the 40 CFR 68 requirements as an opportunity to further refine its safety program and strengthen its emergency response procedures. NTMWD has developed a certified technician emergency response team to repair a chemical release that might occur at this facility. \n\nThe NTMWD has installed detection equipment onsite that in the event of a leak it will notify the plant operator. The plant operator will then contact the NTMWD Control Room. Upon notification, the Control Room Operator will notify the NTMWD emergency response team and the local emergency responders (Mesquite Fire Department). The sensors are check and calibrated by the NTMWD Technical Services department to assure proper operation. \n\nFIVE-YEAR ACCIDENT HISTORY\nNTM"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35607,
      "SummaryText": "WD?s has demonstrated its commitment to managing risk associated with chlorine and sulfur dioxide as demonstrated by its excellent track record with these chemicals. The South Mesquite Regional Wastewater Treatment Plant has not experience an accidental release of chlorine or sulfur dioxide within the past five years. \n\nEMERGENCY REPONSE PROGRAM\nThe NTMWD has developed an emergency response plan that is a joint effort between the NTMWD emergency response team and the local fire department. The NTMWD currently has twelve technical level responders that can respond to a chemical release. This team is composed of experienced operations personnel that work with chlorine or sulfur dioxide on a daily basis. Their experience of working and handling this chemical is invaluable if a repair would be required. The NTMWD has also trained two employees as Incident Commanders to direct the repair and work with the NTMWD Safety Officer during an emergency response. \n\nAs part of the emergency response program operations personnel are trained in chemical awareness. This training allows them to identify the potential for a hazardous release and what is expected of them if such an incident where to occur. As with any prevention program the expectation is not to have a chemical release of any type. This awareness level training details what an operator can safely due to help prevent a release or minimize a release if the situation were to occur. \n\nThe technician level operator receives a forty-hour course that prepares them in the event of a chemical release. As part of the emergency response team, personnel receive medical exams to monitor their physical condition and also must undergo a respirator fit test. Periodic training is required to be part of the team in the event emergency action is required. \n\nThe NTMWD periodically meets with the local fire department at the Wastewater Plant site so they can become familiar with the plant site and the locations where chlorine is stored. A "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35607,
      "SummaryText": "map of the facility has been presented to the fire department detailing the storage location of each chemical. The Mesquite Fire Marshall has requested that in the event of a chemical release that the NTMWD emergency response team makes any necessary repairs and Mesquite Fire Department is in charge of evacuations if required. This should insure that the emergency response plan is carried out efficiently and safely.\n\nIMPROVING SAFETY\nThe NTMWD is investigating using an outside contractor to assist the NTMWD emergency response team, and the local fire department in the event of a chemical release. It is felt that contracting with a contract emergency response team would add another level of safety to protect our employees and the community. The NTMWD will review and respond to the latest hazardous survey and correct any deficiencies noted."
    }
  ]
}