{
  "FacilityID": 35612,
  "FacilityName": "Cleveland Chlorinator Facility",
  "FacilityStr1": "29 Old Windsor Road",
  "FacilityStr2": null,
  "FacilityCity": "Hinsdale",
  "FacilityState": "MA",
  "FacilityZipCode": "01235",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25003",
  "LEPC": "Raymond Risley",
  "FacilityLatDecDegs": "42.474167",
  "FacilityLongDecDegs": "-073.118889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "dsantolin@pittsfieldch.com",
  "FacilityDUNS": 557453669,
  "ParentCompanyName": "City of Pittsfield DPU",
  "Company2Name": null,
  "CompanyDUNS": 84069624,
  "Company2DUNS": null,
  "OperatorName": "Bruce Callingwood",
  "OperatorStr1": "70 Allen Street",
  "OperatorStr2": null,
  "OperatorCity": "Pittsfield",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "01201",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000113263",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-04-30 00:00:00",
  "SafetyInspectionBy": "DEP - Sanitary Survey",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 42.473322,
  "FRS_Long": -73.117914,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51342,
      "AltID": "Chlorination",
      "FacilityID": 35612,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 67780,
          "ProcessID": 51342,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 52507,
          "ProcessID": 51342,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 19678,
              "Process_NAICS_ID": 52507,
              "SafetyReviewDate": "2004-06-09 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2004-06-09 00:00:00",
              "ChangeCompletionDate": "2005-06-09 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "SCADA system installed in year 2000.",
              "OpProceduresReviewDate": "2003-04-10 00:00:00",
              "TrainingReviewDate": "2002-06-06 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-06-09 00:00:00",
              "EquipmentInspectionDate": "2004-02-28 00:00:00",
              "EquipmentTested": "Chlorinators, Ejector, Injectors, Vacuum Regulators",
              "ComplianceAuditDate": "2002-06-02 00:00:00",
              "AuditCompletionDate": "2005-06-09 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2004-06-09 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 20579,
                  "PreventionProgram2ID": 19678,
                  "ProcessChemicalID": 67780
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 35612,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-01-09 00:00:00",
    "ERTrainingDate": "2003-03-30 00:00:00",
    "CoordinatingAgencyName": "Hinsdale/Pittsfield Fire Department",
    "CoordinatingAgencyPhone": "4136552533",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35612,
      "SummaryText": "If a facility handles, manufactures, uses in a process or stores any of the toxic or flammable substances listed in 40 CFR §68.130 above the specified threshold quantities, the facility is required to develop and implement a Risk Management Program.  The Risk Management Program rule was issued and is administered by the U.S. Environmental Protection Agency (EPA). This rule, \"Chemical Accident Prevention Provisions\" (Part 68 of Title 40 of the Code of Federal Regulations (CFR)), applies to a wide variety of facilities that handle, manufacture, store or use toxic and/or highly flammable substances.\nThe City of Pittsfield owns and operates the Cleveland Chlorinator Facility located at 29 Old Windsor Road in Hinsdale, Massachusetts.  The purpose of the facility is to generate chlorinated solution, which is used to disinfect the Pittsfield water supply.  The Cleveland Chlorinator Facility currently stores up to 6,000 pounds of chlorine in three one-ton containers.  The chlorinator facility is a dedicated building less than one mile away from the water treatment plant which is located next to the Cleveland Reservoir.  Since the Cleveland Chlorinator Facility stores more than 2,500 pounds of chlorine, the facility is required to comply with the requirements of 40 CFR Part 68.\nThe goal of Part 68 - the Risk Management Program - is to prevent accidental releases of substances that can cause serious harm to the public and the environment from short-term exposures and to mitigate the severity of releases that do occur. The 1990 Amendments to the Clean Air Act (CAA) require EPA to issue a rule specifying the type of actions to be taken by facilities to prevent accidental releases of hazardous chemicals into the atmosphere and to reduce their potential impact on the public and the environment. Part 68 is that rule. \nThe phrase \"Risk Management Program\" refers to all of the requirements of Part 68, which must be implemented on an on-going basis. The phrase \"Risk Management Plan"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35612,
      "SummaryText": "(RMP)\" refers to this document as well as the registration information submitted to EPA.\nIn general, Part 68 requires that:\n* Covered facilities must develop and implement a Risk Management Program and maintain documentation of the program at the site. The Risk Management Program will include an analysis of the potential offsite consequences of an accidental release, a five-year accident history, a release prevention program and an emergency response program.\n* Covered facilities also must submit registration information (RMP Submit), to EPA no later than June 21, 1999 or the date on which the facility first has more than a threshold quantity, whichever is later and every five years thereafter.\n* Covered facilities also must continue to implement the Risk Management Program and update their RMPs periodically or when processes change, as required by the rule.\nThe plan contains the Policies and Procedures used at The Cleveland Chlorinator Facility to assure continued compliance with EPA Risk Management Program.  Most of the sections in this plan follow a standard format that includes the purpose, organization, responsibilities and authorities, as well as general step-by-step instructions. \nMost procedures contain information on document control and filing.  Typically, documents are periodically revised through the procedures outlined in Section 9, MANAGEMENT OF CHANGE.  The Risk Management Program Coordinator (RMPC) is the person authorized to revise these Policies and Procedures.  \nAll employees are strongly encouraged to review these Policies and Procedures.  The manual is available for review by any employee at any time; see the RMPC for a review copy of the manual.  Any recommendation to improve a document's accuracy or effectiveness in assuring employee, visitor and contractor safety can be directed to the RMPC.\nSection 2 - Management System\nThe implementation and management responsibilities for the Plan must be clearly defined.  This section discusses various du"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35612,
      "SummaryText": "ties that must be addressed in order to fulfill the intent of the Plan.  This section also describes the responsibilities associated with each duty.  The facility Water Superintendent, is responsible for the implementation of this Risk Management Plan and is identified throughout this document as the (RMPC).\nSection 3 - Hazard Assessment\nA major component of the Plan is the assessment of impact associated with the accidental release of the hazardous material(s) in question.  This section evaluates both the worst-case release as well as alternative releases that are specific to the site.\nThe analysis focused on the impact to neighboring areas called receptors.  Receptors include residences, schools, parks, prisons, commercial buildings, etc.  Graphic as well as tabulated exhibits help to define the impact of accidental releases.  These scenarios were recalculated for the five year anniversary updating population and receptor information.\nBased on guidelines provided by EPA in the 2004 RMP Submit Instruction Manual, release scenario information is not provided in this Executive Summary.\nSection 4 - Process Safety Information\nProcess Safety Information (PSI) is a repository for information related to the safety of a process.  Three major subjects addressed in this section are: \n* The hazards of the chemicals and the process (physical properties, toxicity and exposure limits, fire and explosion characteristics, reactivity data, thermal and chemical stability, corrosivity data).\n* The process technology (process chemistry, process flow diagrams, safe operating limits, maximum intended inventories, consequences of deviation).\n* Equipment information (piping and instrumentation diagrams, material and energy balances, safety systems involved, materials of construction, electrical classification, relief system design and design basis, ventilation system design and design basis, design codes and standards employed).  This information is used as a reference during Process Haza"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35612,
      "SummaryText": "rds Analyses.\nDocumentation is found primarily in the Material Safety Data Sheets (MSDS).  The MSDS are filed alphabetically at The Cleveland Chlorinator Facility.\nSection 5 - Process Hazard Analysis\nProcess Hazard Analysis (PHA) is a systematic approach toward evaluating the safety of a process.  PHAs must address the hazards of a process, previous incidents having potential for serious consequences, engineering and administrative controls, facility siting, human factors and an evaluation of the range of exposures if controls fail.  If there is more than one process, a schedule for completing PHAs must be formulated and be based on the extent of process hazards, the number of potentially affected employees, the age of the processes and the operating history of the process.  Employees must have input into the prioritization of PHAs and this schedule must be fully communicated to all employees.  PHAs must follow a standard methodology, such as a What If/Checklist Analysis and be performed by a cross-functional team with at least one person who is familiar with the process, at least once every five years.  A system for addressing, resolving, documenting and communicating all recommendations in a prompt manner must also be in place.\nTypical documentation should include information on how PHA studies were prioritized, employee briefings on the PHAs, a copy of each PHA file index and evidence of how PHA recommendations were completed.  These PHA files should include the pertinent process safety information.\nThe last PHA performed under the RMP program was conducted on June 9, 2004.  The PHA was facilitated by Michael Matilainen, Certified Safety Professional / Certified Industrial Hygienist, of Tighe & Bond.  In attendance were operations personnel from the facility and the RMPC.  The results of the PHA were reviewed by the RMPC prior to final approval and incorporation into the RMP.\nSection 6 - Operating Procedures\nOperating procedures are instructions that outline how"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 35612,
      "SummaryText": "to safely operate a process consistent with Process Safety Information.  They must be appropriate, clear, consistent and well communicated.  Procedures must address steps for each operating phase, operating limits and health and safety considerations.  Procedures must be accessible and certified to be correct at least annually.  Safe work procedures must exist for hot work, lock-out/tag-out, confined space entry, opening process equipment/piping and controlling entry to chlorine storage and distribution areas, for both employees and contractors.\nTypical documentation should include evidence that employees had input to the content and format of Operating Instructions, an index of all Operating Instructions, completed Confined Space Entry permits, completed Lock-out/Tag-out Program audit forms, etc.  Copies of the Operating Instructions are kept in the Operating Procedure File.\nOperating procedures in this document were developed by Tighe & Bond in association with information provided by the facility's operators.  The operating procedures were reviewed by the RMPC prior to implementation and incorporation into this document.  Since the development of the original RMP in 1999, the RMPC and operators at the Cleveland Chlorinator have revised and updated the procedures as operations at the facility have changed.\nSection 7 Employee Training Program\nInitial training must be provided for employees involved with Risk Management Program processes that covers an overview of the process, specific safety and health hazards, emergency operations including shutdown and other safe work procedures that may be applicable.  For existing employees, the employer must document that operators have the required knowledge and do not need initial training.  Refresher training must be provided periodically that covers understanding and adherence to current operating procedures.  Records must be kept that verify that an employee has received and understood the training; these records must inc"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 35612,
      "SummaryText": "lude employee identification, date of training and method of verification.\nDocumentation is found primarily in the Training Files.  This file should contain evidence that employees had input into retraining frequency and other aspects of the training program.\nSection 8 - Mechanical Integrity Program\nWritten procedures have been developed for maintaining the ongoing integrity of process equipment.  Mechanical Integrity (MI) applies to pressure vessels and storage tanks; piping systems and their components; relief and vent systems and associated devices; emergency shutdown systems; controls (sensors, alarms, interlocks); and pumps.  Employees involved with MI must be trained in an overview of the process and in specifics of the job task.  Inspection/testing must be performed using generally recognized and accepted good engineering practices, at a frequency consistent with manufacturer's recommendations or good engineering practices (or more frequently if warranted).  Inspections must be documented and include date, person performing test, equipment identifier, test description and results of test or inspection.  Deficiencies outside acceptable limits must be corrected before further use or corrected in a safe and timely manner, provided that the hazards of continued operation are properly addressed.  Employers must certify that new equipment is fabricated and installed in a suitable manner for the process and in accordance with manufacturer's instructions and design specifications.  Employers must certify that maintenance materials, spare parts and equipment are suitable for the process.\nDocumentation is found primarily in the Training and Maintenance files.  The Training File should contain all maintenance personnel training records; the Maintenance files should contain all inspection records, deficiency reports, etc.\nPittsfield Water Department certifies that the chlorine system was designed in accordance with recognized engineering standards at the time of original"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 35612,
      "SummaryText": "construction and subsequent renovations or modifications.  The chlorine system at the Cleveland Chlorinator Facility was inspected during the Process Hazard Analysis.  Pittsfield Water Department follows the manufacturer's recommendations for maintenance and inspection.\nSection 9 - Management of Change\nA system is used to properly manage changes to process chemicals, technology, equipment and procedures.  The Management of Change (MOC) form must include the technical basis for the change; impact of the change on employee safety & health; modifications to operating procedures; modifications to Process Safety Information; time period involved; and authorization requirements.  Employees and contractors must be informed of the change prior to implementation.\nTypical documentation should include MOC worksheets (including employee review sheets) and documentation from any training meetings required for a particular MOC.\nSection 10 Pre-Startup Safety Review\nPre-Startup Safety Review (PSSR) is a review of new or significantly modified facilities prior to introducing a highly hazardous chemical to the process.  The review includes confirmation that construction and equipment are in accordance with design specifications; that safety, operating, maintenance and emergency procedures are in place; that the action items have been addressed; and that training of employees is complete.\nTypical documentation should include any specific training performed for hazard review team members prior to their participation in a preliminary hazard review or pre-startup safety review.  The review documentation is filed in the PSSR File and should include evidence of how recommendations were implemented.  These files should also include any pertinent process safety information.\nSection 11 - Compliance Audits\nEmployers must certify that they have evaluated facility compliance with the Risk Management Program at least every 3 years.  Certification involves verification that procedures and practic"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 35612,
      "SummaryText": "es for Risk Management Program elements are adequate and are being followed.  The audit must be performed by a team, with at least one person who is knowledgeable in the process.  A report must be generated that documents deficiencies and corrections.\nTypical documentation should include completed compliance audits, including evidence of how recommendations were implemented and attendance sheets from any meetings conducted to review the audit findings with employees.\nSection 12 - Incident Investigation\nA thorough investigation of any incident that could or did result in a catastrophic release of highly hazardous chemicals must take place within 48 hours of the incident.  This investigation must identify the chain of events and causes of the incident and include corrective measures that can be developed and implemented.  A team must perform the investigation with at least one person knowledgeable in the process and others who have appropriate knowledge and experience.  A representative of the contractor or the chemical supplier must also be part of the team if either were involved in the incident.  A complete incident report must be developed and a system must be in place that addresses and communicates recommendations in a timely manner.\nTypical documentation should include completed Investigation Report Forms, including evidence of how action items were implemented and attendance sheets from any meetings conducted to review the incident with employees.\nSection 13 - Employee Participation\nThis section outlines how employees participate in the development of the facility's Risk Management Program.  Employers must train their employees and inform them of findings from incident investigations and Process Hazards Analyses and of any relevant safety and health issues.  Employees must have access to all information developed in conformance with the Risk Management Program.\nCleveland Chlorinator Facility personnel have been involved in many facets of the RMP implementation"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 35612,
      "SummaryText": "program including:\n* Training and education;\n* Process Hazard Analysis;\n* Review of operating procedures.\nSection 14 - Hot Work Permit\nThis is a permit system for any heat producing work performed at the Cleveland Chlorinator Facility.  It includes hot work operations (e.g., welding, cutting, etc.) conducted on or near a covered process as described in the operating procedures.  The permit satisfies the requirements of OSHA 1910.252(a), fire prevention and protection.  The permit must indicate date(s) and object involved with the hot work.  The permit must be kept on file while hot work proceeds.\nSection 15 - Contractor Safety\nEmployers must inform contractors of known potential fire, explosion or toxic release hazards; explain applicable provisions of the emergency action plan; develop/implement safe work practices that control the presence, entrance and exit of contract employees in covered chlorine storage and distribution areas; periodically evaluate contractor safety performance; and maintain a contractor injury and illness log.  This applies to contractors working in or around Risk Management Program-covered processes that perform maintenance or repairs, help with facility turnarounds or major renovations or do specialty work (e.g., chemical suppliers, instrumentation service contractors).  Employers must obtain and evaluate contractor safety performance and programs.\nTypical documentation should include criteria for evaluating contractor safety programs, how the criteria were applied, any on-site monitoring performed while contractors were working and actions taken when contractor deficiencies were found.\nSection 16 - Emergency Response Program\nAn emergency action plan for the entire facility is required that satisfies the requirements of OSHA 1910.38 and 1910.120.  The plan must include procedures for handling small releases of hazardous chemicals.  Employees must be aware of the plan and trained in specific procedures.  The regulations require a written pl"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 35612,
      "SummaryText": "an that addresses emergency escape procedures; procedures for employees who remain to operate critical equipment; procedures to account for all personnel; rescue and medical duties; means of reporting emergencies; and a list of persons or departments who can answer any questions.  Further, the regulations requires an alarm system (or, in lieu of a dedicated alarm system a documented method for informing employees of an emergency); an evacuation procedure; and training for new employees and for employees who are affected by any changes to the plan.\nTypical documentation should include critiques from any drills conducted, including evidence of how any recommendations were implemented and attendance sheets from any meetings conducted to review the response effort with employees.\nThe Hinsdale Fire Chief, Larry Turner and Local Emergency Planning Committee (LEPC) Chair, Raymond Balduc, were contacted to evaluate municipal response to hazardous materials incidents.  It was reported that the Pittsfield Water Department has consistently submitted Tier II chemical inventory reports to the Hinsdale Fire Department in accordance with EPA Emergency Planning and Community Right to Know Act.\nSection 17 - Confidentiality Statement\nEmployers must disclose all information necessary to comply with the RMP and the Risk Management Program to those persons completing PSI, PHAs, operating procedures, incident investigations, emergency planning and response and compliance audits.  If confidential business information status must be maintained, the employer can enter into confidentiality agreements with the appropriate employees.\nTypical documentation should include copies of any confidentiality statements or correspondence with any employees.\nAs described earlier, portions of the Plan that are forwarded as part of EPA registration submission will be made public.\nEPA has made provisions to prevent disclosure of proprietary process information or formulations.  In order to obtain Confidenti"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 35612,
      "SummaryText": "al Business Information (CBI) status for such proprietary information, the facility must submit justification to EPA as to why the information is proprietary.  At this time, Pittsfield Water Department has not claimed CBI status for any of the information submitted to EPA on the Cleveland Chlorinator Facility.\n\nRMP Executive Summary \t\tTighe&Bond\n\nCity of Pittsfield Water Department\t\tPage: 1\n40 CFR 68: Risk Management Program\t\tJune 2004"
    }
  ]
}