{
  "FacilityID": 35668,
  "FacilityName": "Westbank Sewage Treatment Plant",
  "FacilityStr1": "3501 East Canal Street",
  "FacilityStr2": null,
  "FacilityCity": "New Orleans",
  "FacilityState": "LA",
  "FacilityZipCode": "70131",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22071",
  "LEPC": "New Orleans Emergency Response",
  "FacilityLatDecDegs": "29.908333",
  "FacilityLongDecDegs": "-089.966944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "jhuerkamp@swbno.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Sewerage & Water Board of New Orleans",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sewerage & Water Board of NO",
  "OperatorStr1": "625 Joseph Street",
  "OperatorStr2": null,
  "OperatorCity": "New Orleans",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70165",
  "OperatorZipCodeExt": null,
  "RMPContact": "Marcia St. Martin",
  "RMPTitle": "Interim Executive Director",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000031734",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-07-30 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-01-05 00:00:00",
  "DeRegistrationEffectiveDate": "2016-12-28 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 29.91975,
  "FRS_Long": -89.95919,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51422,
      "AltID": "Disinfection",
      "FacilityID": 35668,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52590,
          "ProcessID": 51422,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 67876,
          "ProcessID": 51422,
          "ChemicalID": 62,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 567876,
          "ProcessID": 51422,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35668,
      "SummaryText": "SEWERAGE & WATER BOARD OF NEW ORLEANS\n\nWestbank Sewage Treatment Plant\nNew Orleans, Louisiana\n\nLDEQ Facility ID #4688\n\nEXECUTIVE SUMMARY\nFOR \nTHE RISK MANAGEMENT PLAN\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nAccidental Release Prevention:  Both the Sewerage & Water Board (S&WB) and it?s Contractor, Veolia Water North America Operating Services (VWNAOS) are committed to the safe operation of the Westbank Sewage Treatment Plant (WBSTP).  Continuous review of standard operating procedures (SOPs) and mechanical integrity programs help to ensure that the chlorine system is operated and maintained in a safe manner.  VWNAOS provides formal training for all operators and maintenance personnel focusing on chlorine safety.  The Hazardous Material (HAZMAT) Team of the New Orleans Fire Department (NOFD) conducts annual site visits of the plant to review and familiarize themselves with the chlorine system.\n\nEmergency Response Policies:  Operators at the WBSTP will not respond to leaks beyond their ability to control through the use of valves.  In the event of such release, plant personnel will evacuate with the exception of the plant supervisor or chief operator who will remain on site to activate the New Orleans City?s emergency system.  The NOFD will be the first responders for any emergency response.  They will establish a safe perimeter and begin public notification until the HAZMAT Team of the NOFD arrives to contain the release.  This facility is included in the Local Emergency Planning Committee?s community emergency response plan.\n\n\nWestbank Sewage Treatment Plant\n\nThe WBSTP is a 20-million gallons per day trickling filter plant and services the entire West Bank of Orleans Parish.  Treated effluent from the plant is discharged to the Mississippi River.  Disinfection of the effluent is accomplished by injecting chlorine into the effluent box directly behind split box #1.  Chlorine is stored in a maximum of nine one-ton cylinders.  The plant is owne"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35668,
      "SummaryText": "d by the S&WB but is operated and maintained by a private contractor, VWNAOS.  Located on the West Bank of the Mississippi River in Orleans Parish, the facility is close to the Plaquemines Parish to the South and near the English Turn community to the East.\n\n\nGeneral Accidental Release Prevention Program and Chlorine Release Prevention\n\nThe WBSTP is subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) rule.  The PSM incorporates several elements that aid in operating a safe plant and in reducing the possibility for off-site releases.  Among the critical elements that have been reviewed and updated are the SOPs, Mechanical Integrity Program, and Training Program.  These three programs have a significant impact on the continued safe operation of the chlorine system.\n\n\nFive-Year Accident History\n\nThere have been no accidents, as defined in 40 CFR 68.42, at the WBSTP in the last five (5) years.\n\n\nEmergency Response Program\n\nAs described above, personnel at the WBSTP will not act as responders to uncontrollable releases of Chlorine.  Rather, the Emergency Action Plan will be implemented which notifies the City?s HAZMAT Team who will contain chlorine releases beyond the ability of plant personnel.  The WBSTP is included in the community emergency response plan for the City of New Orleans.\n\n\nPlanned Changes to Improve Safety\n\nThe S&WB and VWNAOS took the following actions at the Westbank STP to mitigate the consequences of an uncontrolled release of chlorine:\n\n?    Installed additional process alarms\n?    Installed indicators of chlorine release in the operator control room\n\nThe WBSTP currently utilizes gaseous chlorine as a disinfectant.  Recognizing the obvious safety hazards and accidental release consequences based on our long years of experience in working with gaseous chlorine and as identified by the RMP, the S&WB has investigated a number of possible solutions to these problems.\n\nAt the time the original RMP was developed, t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35668,
      "SummaryText": "he S&WB did not have specific first-hand knowledge of, or experience with alternative disinfection processes, their operation or use histories.  In fact, many processes now becoming more commonplace were refined and made more practical as a result of RMP requirements.  Since the initial RMP was developed the S&WB has investigated a number of commercially available on-site gaseous chlorine and sodium hypochlorite generation processes, from large to small volume generation.  These were compared to the cost and practicality of providing enclosures and vapor scrubbers for on-site gaseous chlorine storage and use.  The relative costs and safety considerations led the S&WB to select sodium hypochlorite as the chemical of choice for disinfection at the WBSTP.  This decision was based on evaluation studies conducted at the WBSTP by Tulane University, onsite demonstration projects conducted by equipment manufacturers at the S&WB?s Algiers Water Purification Plant, and plant visits by S&WB staff to similar municipal facilities.  The developing knowledge within the water and wastewater industry since the RMP process was first initiated has also yielded valuable knowledge relative to alternative disinfectant use.\n\nThe S&WB plan is to initially provide sodium hypochlorite storage tanks and handling equipment utilizing recommended safety procedures for hypochlorite storage and handling at the WBSTP.  Sodium hypochlorite will be delivered to the plant storage tanks until a determination is made of the cost effectiveness of on-site generation versus bulk purchase.  In any event, storage tanks must be provided whether the chemical is generated onsite or delivered.\n\nThe S&WB is now working with VWNAOS to have the tanks installed and convert the plant disinfection processes to sodium hypochlorite disinfection.  Once this conversion has occurred, the risk scenario developed under the initial RMP of a catastrophic release will no longer be of concern."
    }
  ]
}