{
  "FacilityID": 35680,
  "FacilityName": "Sara Lee Foods - Zeeland Facility",
  "FacilityStr1": "8300 96th Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Zeeland",
  "FacilityState": "MI",
  "FacilityZipCode": "49464",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26139",
  "LEPC": "Ottawa County LEPC",
  "FacilityLatDecDegs": "42.915028",
  "FacilityLongDecDegs": "-086.023806",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6025274,
  "ParentCompanyName": "Sara Lee Corporation",
  "Company2Name": null,
  "CompanyDUNS": 5213962,
  "Company2DUNS": 0,
  "OperatorName": "John McAndrew",
  "OperatorStr1": "8300 96th Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Zeeland",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49464",
  "OperatorZipCodeExt": null,
  "RMPContact": "Anne McManus",
  "RMPTitle": "Environmental Coordinator",
  "FTE": 737,
  "OtherEPAFacilityID": "49464BLMRF83009",
  "EPAFacilityID": "100000124867",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-13 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 42.91978,
  "FRS_Long": -86.02254,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51434,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 35680,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52603,
          "ProcessID": 51434,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 67924,
          "ProcessID": 51434,
          "ChemicalID": 56,
          "Quantity": 181500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 567924,
          "ProcessID": 51434,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35680,
      "SummaryText": "Background Data\n\nIn accordance with Title 40 of the Code of Federal Regulations Chapter 68 (40 CFR 68) promulgated by the Environmental Protection Agency (EPA), Sara Lee Foods ? Zeeland submits this Risk Management Plan (RMP) for operations at their Zeeland, Michigan facility. Sara Lee Foods operations include the processing of meat products (hot dogs and lunchmeat) for public consumption packaged under the familiar brand names such as Sara Lee, Mr. Turkey, and Ball Park Franks.  Sara Lee Foods has been in operation at this location since 1936 providing quality meat products and over 1,000 jobs to the local community.\n\nAccidental Release Prevention and Emergency Response Policy\n\nSara Lee Foods is committed to protecting the health of its employees, the surrounding community, and the environment. It is Sara Lee?s policy to maintain a safe and healthy workplace, protect the environment, and comply with all applicable regulations, including 40 CFR 68 and, as applicable, Occupational Safety and Health Organization (OSHA) Process Safety Management (PSM) regulations promulgated as Title 29 of the Code of Federal Regulations, Chapter 1910, Section 119 (29 CFR 1910.119), and OSHA?s Hazardous Operations and Emergency Response regulations (29 CFR 1910.120).\n\nStationary Sources and Regulated Substances\n\nSara Lee Foods is required to maintain low temperatures in the food processing areas of the plant that are within standards required by the United States Department of Agriculture (USDA) to ensure quality in the final products. Sara Lee Foods also operates freezers and coolers for product storage. The facility uses anhydrous ammonia (the 112(r) regulated substance) as a refrigerant to maintain the 550,000 sq.ft. facility within the required range of operating temperatures and to operate the freezers and coolers. The refrigeration system consists of receivers, compressors, evaporators, condensers, and piping.  Anhydrous ammonia is present in the facility refrigeration system in "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35680,
      "SummaryText": "a quantity greater than its 10,000 pound threshold, as established in the 112( r) regulations.  \n\nRelease Scenarios\n\nIn accordance with 40 CFR Subpart B, Sara Lee Foods evaluated off-site consequences for releases of anhydrous ammonia.  Both a worst case scenario and an alternate case scenario were developed.\n\nAccidental Release Prevention Program\n\nTo prevent and mitigate accidental releases of anhydrous ammonia, Sara Lee has implemented certain precautionary measures, including process / equipment controls, procedures, preventative maintenance programs, employee training and auditing.  In addition, Sara Lee?s ammonia refrigeration system is designed and constructed in accordance with accepted industry standards and good engineering practices. \n\nSara Lee has also developed and implemented a PSM program pursuant to OSHA regulations and as such, has evaluated the system for the potential of anhydrous ammonia releases.   Some of the controls installed to prevent catastrophic releases of ammonia are process equipment (vents, pressure relief valves, backup pumps, and manual shutoffs) and automated controls (automatic shut-offs, ammonia leak detection system, and electrical distribution system grounding).  In addition, Sara Lee has trained approximately 60 team members to respond to potential ammonia releases (HazMat team).\n\nSara Lee has developed standard operating procedures for all employees and contractors that have contact with the ammonia refrigeration system that incorporate safety measures into the procedures.  These safety procedures were developed by refrigeration system operators and are reviewed periodically by the operators during weekly PSM training sessions.  Process safety information for the refrigeration system is reviewed during these weekly meetings as well.  Sara Lee encourages employee participation in development of the control measures used at the plant by means of meetings and training sessions.  Pursuant to written management of change procedures"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35680,
      "SummaryText": " established by Sara Lee, any changes to the operating procedures are to be communicated to affected employees.\n\nSara Lee understands that maintaining the refrigeration system in good working order is essential to preventing accidental releases; therefore Sara Lee has implemented a preventative maintenance program.  The preventative maintenance program is scheduled, documented and managed using a computer maintenance management software system to ensure that regular maintenance occurs on the system.  Also, to ensure the mechanical integrity of critical refrigeration system components, regular inspections and testing is conducted.\n\nTo ensure that Sara Lee?s control measures are effective in maintaining the safe operation of the plant, regularly scheduled audits are performed on the ammonia refrigeration system:\n\n? In accordance with the PSM program, Sara Lee conducts detailed PSM compliance audits at least every three years that incorporate review of process safety information, process hazard analysis, operating procedures, training programs, system mechanical integrity, management of change, pre-start up review procedures, compliance audit procedures, incident investigation procedures, employee participation programs, hot work permit procedures, and contractor safety procedures.\n\n? Sara Lee?s insurance carrier also conducts independent audits on a regular basis.\n\nFive-Year Accident History\n\nOver the last five years, Sara Lee has not experienced an accidental off-site release of anhydrous ammonia from the ammonia refrigeration system.\n\nEmergency Response Program\n\nSara Lee has documented emergency response procedures in a document entitled OFF-SITE RESPONSE STANDARD OPERATING PROCEDURES FOR SARA LEE FOODS (SOP) in order to facilitate response efforts in the event of an off-site anhydrous ammonia release.  Included in the SOP are measures to be taken internally by Sara Lee as well as measures to be taken by off-site response agencies.\n\nSara Lee has trained approximatel"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35680,
      "SummaryText": "y 60 on-site personnel to respond to accidental ammonia releases.  These personnel are trained in accordance with 29 CFR 1910.120, OSHA?s Hazardous Waste Operations and Emergency Response regulations according to their duties and function.  These personnel receive initial training and annual update training thereafter.  As an additional training exercise, a simulation of an emergency release with off-site effects was conducted with the entire emergency response system.  This involved coordination between Sara Lee?s Hazmat team and multiple local fire, ambulance and police departments; as well as two local hospitals (with Air-Med units).  The simulation was critiqued and changes made to the SOP as appropriate.   \n\nTo assure that the local governmental response agencies are familiar with Sara Lee?s emergency response procedures, Sara Lee has submitted copies of the SOP for review and approval by the local agencies.  The following local agencies have reviewed and approved Sara Lee?s SOP:\n\n? Olive Township Supervisor,\n\n? Olive Fire Department,\n\n? Ottawa County LEPC\n\n? State Emergency Planning Commission (SERC) \n\nTo plan for an ammonia release with off-site effects, Sara Lee?s SOP includes procedures/equipment to mitigate the release, procedures to inform local response agencies, transportation maps for response agencies, evacuation route maps, and procedures for public communication.\n\nIn the event of an anhydrous ammonia release with off-site effects, the general public will be warned using the following methods:\n\n? GRAIL (Grand Rapids Area Information Link) System\n\n? Broadcast message via the Ottawa County Central Dispatch\n\n? Police and fire vehicles equipped with public address systems, and\n\n? Door-to-door notification of residents by emergency response agencies (if deemed necessary).\n\nAs backup measures, Sara Lee has arranged emergency response assistance with a local clean-up contractor.  The fire department has also arranged for back-up assistance from another loca"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 35680,
      "SummaryText": "l environmental clean-up contractor.\n\nPlanned Changes to Improve Safety\n\nAs part of Sara Lee Foods? continuous efforts to improve the safety of the system, we continue to implement system updates and modification ? including equipment / piping replacements and relocations to safer locations.  We also continue to revise / update operating procedures as needed and perform regular ammonia safety training."
    }
  ]
}