{
  "FacilityID": 35734,
  "FacilityName": "Morningstar Foods (City of Industry - South)",
  "FacilityStr1": "17380 Railroad Street",
  "FacilityStr2": null,
  "FacilityCity": "City of Industry",
  "FacilityState": "CA",
  "FacilityZipCode": "91748",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.001201",
  "FacilityLongDecDegs": "-117.926483",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5104815,
  "ParentCompanyName": "Dean Foods",
  "Company2Name": null,
  "CompanyDUNS": 929182210,
  "Company2DUNS": 0,
  "OperatorName": "Dean Foods",
  "OperatorStr1": "2515 McKinney Avenue, Suite 1200",
  "OperatorStr2": null,
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75201",
  "OperatorZipCodeExt": null,
  "RMPContact": "Art Thomas",
  "RMPTitle": "Plant Manager",
  "FTE": 110,
  "OtherEPAFacilityID": "CAD983576950",
  "EPAFacilityID": "100000187264",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-02-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-08-01 00:00:00",
  "DeRegistrationEffectiveDate": "2006-07-24 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51510,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 35734,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52684,
          "ProcessID": 51510,
          "NAICSCode": "31151",
          "_desc": {
            "NAICS_CODE": "31151",
            "NAICS_DESCRIPTION": "Dairy Product (except Frozen) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 68026,
          "ProcessID": 51510,
          "ChemicalID": 56,
          "Quantity": 2500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 568026,
          "ProcessID": 51510,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35734,
      "SummaryText": "MORNINGSTAR FOODS\nCITY OF INDUSTRY - SOUTH\nRISK MANAGEMENT PROGRAM \nAnhydrous Ammonia Refrigeration System\n\nRevised June 2004\n\nEXECUTIVE SUMMARY\n\nDean Foods Corporation is a leading manufacturer and distributor of fresh milk and related dairy products, shelf stable and refrigerated foods and beverage product, frozen food product, coffee and plastic containers.  The company products are distributed throughout the United States.  Morningstar Foods (Morningstar) is a subsidiary of Dean Foods Corporation.\n\nMorningstar City of Industry-South Facility prepared a Chemical Risk Management Program in general accordance with state and federal regulations.  The state risk management regulations, also referred to as the California Accidental Release Prevention (CalARP) program, are codified in California Code of Regulations (CCR), Title 19, Section 2735.1, et. Seq.  The Federal Environmental Protection Agency (EPA) also regulates facilities with certain toxic and flammable substances.  The regulations are codified in Title 40 of the Code of Federal Regulations (CFR), Part 68. \n\nMorningstar prepared the RMP/CalARP to satisfy regulatory requirements and to demonstrate a commitment to evaluate and improve anhydrous ammonia handling systems and practices at the facility.  Morningstar incorporated many advanced safety features into the ammonia refrigeration system at the facility as part of the original system construction and subsequent system modifications.  Morningstar will continue to improve ammonia-handling safety through the implementation of the prevention program elements of the RMP/CalARP.  In the unlikely event that a chemical release does occur at the facility, Morningstar personnel are trained in the appropriate evacuation procedures and will work closely with the county fire department haz-mat response team.\n\nThe City of Industry-South Facility is located at 17380 Railroad Street, City of Industry, CA 91748.  The surrounding area primarily consists of industrial and co"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35734,
      "SummaryText": "mmercial businesses.\n\nThe plant was built in 1978.  The single story facility has 98,767 square feet situated on a 7.7-acre site.  The plant produces sour cream, oil-based salad dressings, dairy and non-dairy aerosol toppings, dips, and sauces.  \n\nAnhydrous ammonia is used in the refrigeration system at the facility.  The refrigeration system contains approximately 2,500 pounds of anhydrous ammonia.  The system provides cooling for the solos and ice builders.  The desired temperatures are maintained by controlling the flow of ammonia with manually and electrically operated valves, float switches, and compressor controls.\n\nThe RPM/CalARP regulations require a review of the five-year accident history at a regulated facility.  This facility reported no accidental releases of ammonia within the past five years.\n\nThe RPM/CalARP regulations require a review of the accidental release prevention program and chemical specific prevention steps used by the facility.  Many safety features have been incorporated into the ammonia refrigeration system to prevent system failures and to mitigate potential releases.  The safety features include but not limited to the following:\n\n? emergency shutdown systems\n? pressure relief valves on vessels and compressors.\n? Engine room is equipped with ammonia detection system and ventilation system\n? Many of the ammonia pipes, valves and components are labeled\n? A fire sprinkler system is installed in the plant.\n\nIn addition to the physical features of the ammonia refrigeration system at the facility, Morningstar has extensive administrative controls in place to maintain safe operation of the system.  Administrative controls include, but are not limited to, training programs for system operators and mechanics, emergency training, a hot work permit program, a lockout/tagout program, a contractor safety program, incident investigation program, mechanical integrity and inspection program. \n\nMorningstar recognizes that the RMP/CalARP program is a co"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35734,
      "SummaryText": "ntinuous process for evaluating, monitoring, and improving anhydrous ammonia handling operations at its facility.  As such, this document, related attachments, and program elements will evolve as Morningstar continues their ongoing focus and dedication of risk minimization and safety improvement for their employees and surrounding community.   Morningstar will submit revised information if a change occurs that is considered significant and requires resubmission under the regulations.  However, minor improvements/modifications to the RMP/CalARP, related attachments, and program elements will be incorporated consistent with Morningstar?s internal review practices, and Morningstar will maintain the most current versions on site.  Thus, the most current version of the RMP/CalARP Program and related documents and elements maintained on site may vary slightly from the information in submittals made to EPA and other regulatory agencies"
    }
  ]
}