{
  "FacilityID": 35755,
  "FacilityName": "DSM Nutritional Products, Inc.",
  "FacilityStr1": "1000 County Road 227A",
  "FacilityStr2": null,
  "FacilityCity": "Freeport",
  "FacilityState": "TX",
  "FacilityZipCode": "77541",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48039",
  "LEPC": "Brazoria County LEPC",
  "FacilityLatDecDegs": "29.012778",
  "FacilityLongDecDegs": "-095.363333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.nutraacess.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 160147252,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "DSM Nutritional Products",
  "OperatorStr1": "1000 County Road 227A",
  "OperatorStr2": null,
  "OperatorCity": "Freeport",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77541",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ann Jackson Rhodes",
  "RMPTitle": "S&E Compliance Lead",
  "FTE": 54,
  "OtherEPAFacilityID": "77541HFFMN1000",
  "EPAFacilityID": "100000074803",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-23 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 29.01333,
  "FRS_Long": -95.36333,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51543,
      "AltID": "Beta Carotene",
      "FacilityID": 35755,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52717,
          "ProcessID": 51543,
          "NAICSCode": "325411",
          "_desc": {
            "NAICS_CODE": "325411",
            "NAICS_DESCRIPTION": "Medicinal and Botanical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 68065,
          "ProcessID": 51543,
          "ChemicalID": 96,
          "Quantity": 11468.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 96,
            "ChemicalName": "Acetylene  [Ethyne]",
            "CASNumber": "74-86-2",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 68066,
          "ProcessID": 51543,
          "ChemicalID": 56,
          "Quantity": 54180.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 568065,
          "ProcessID": 51543,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 568066,
          "ProcessID": 51543,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35755,
      "SummaryText": "DSM Nutritional Products Inc. (DNP) Feerport Site, located at 1000 County Road 227, Freeport, Texas is a manufacturer of raw beta-carotene.  The plant comprises 770.5 acres of land located off of Highway 332.  The facility is located about 50 miles south of Houston, Texas and was initially constructed by Roche Vitamins in the early 1990s.  The operations changed hands in 2003 when Roche made a decision to revise its business strategies and to divest the Vitamins and Fine Chemical activities.  DSM purchased the division and incorporated it into their Nutritional Products Group.\n\nDNP's Freeport Operations is highly automated and is currently the largest producer of beta-carotene (pro-vitamin A) in the world.  Surrounded by other large chemical plants, Freeport Operations is ideally situated for chemical operations.  Regulated substances used or stored at this facility are anhydrous ammonia (54,180 pounds) and acetylene (11,468 pounds).\n\nThe DNP Freeport site believes that prevention is the key element of all activites and measures have been incorporated to ensure safety and environmental protection.  All levels of employees have the responsibility to exercise maximum care and good judgement in protecting the environment.  It is the intent of the management of this plant to protect the environment while maintaining an effective operating plant.  It is the responsibility of each employee to comply with this policy.  We believe that environmental protection is an integral part of and in no manner separated from, the operations of this plant.  In recognition of this and in the interest of appropriate management practices, we will constantly work toward: Proper operation of this plant in order to protect the environment, consistent adherence to required operating pracitices and procedures designed to prevent environmental incidents, conscientious observance of all federal, state and corporate environmental standards, minimization of the generation of all waste materials, a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35755,
      "SummaryText": "nd where feasible, dedication to reuse and recylce.  \n\nThe facility used PHAST, an industry specific guidance, to create the worst case and alternative release scenarios.  ERPG-2 is defined as the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing developing irreversible or other serious health effects or symptoms which would impair an individual's ability to take protective action.  PHAST was used to develop a worst case scenario and alternative scenario for both anhydrous ammonia and acetylene.\n\nThe site is currently goverend by OSHA's Process Safety Management Standard and has agreed to participate in the OSHA Voluntary Protection Program.  Employees participate in all elements of these programs.  OSHA conducted an on-site review of the facility during the week of April 19, 2004.  The site is anticipating approval as a VPP Star Site upon the completion of four 90-day contingency items.  In addition, the Freeport site obtained ISO 9002 certification in 1996, which has been successfully maintained to current day.  The site achieved certification to the revised ISO Quality Standard (ISO 9001:2000) and added certification to the Environmental Standard (ISO 14001:1996) to its list of accomplishments in 2003.\n\nThe site has not any accidental releases of ammonia or acetylene in the past five years.  The site maintains an active role in the community emergency response activities as a member of the Industiral CAER group, the County LEPC, and by maintianing routine contact with Freeport Fire Department.  The plant conducts routine training in the emergency response procedures and conducts drills at least quarterly.  Notification of the community and the public is handled through the Industrial CAER group which maintains sirens, telephone communication, a radio station, as well as other communication means.  Further community communications tools are evaluated by these organizations"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35755,
      "SummaryText": " on a routine basis.\n\nCustomer satisfaction, worker safety, maintaining an environmentally friendly operation and sustainable development are critical elements of the site's business philosphy and has enable the site to obtain acceptance in the community.  Continual improvement is utilized by the site to pursue operational excellence.  Being a true manufactureing center of excellence, Freeport is committed to the safety of our employees as well as the protection of our environment and community."
    }
  ]
}