{
  "FacilityID": 35781,
  "FacilityName": "Marcellus Water Treatment Plant",
  "FacilityStr1": "2460 Lawrence Road",
  "FacilityStr2": null,
  "FacilityCity": "Marcellus",
  "FacilityState": "NY",
  "FacilityZipCode": "13108",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36067",
  "LEPC": "Onondaga County LEPC",
  "FacilityLatDecDegs": "42.955278",
  "FacilityLongDecDegs": "-076.339444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.ocwa.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 70860432,
  "ParentCompanyName": "Onondaga County Water Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Onondaga County Water Authority",
  "OperatorStr1": "Northern Concourse",
  "OperatorStr2": null,
  "OperatorCity": "Syracuse",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13211",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mr. Michael E. Hooker",
  "RMPTitle": "Executive Director",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000052578",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-08-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-06-25 00:00:00",
  "DeRegistrationEffectiveDate": "2009-06-19 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 42.95773,
  "FRS_Long": -76.33957,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51577,
      "AltID": "Water Disinfection",
      "FacilityID": 35781,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52752,
          "ProcessID": 51577,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 68116,
          "ProcessID": 51577,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 568116,
          "ProcessID": 51577,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35781,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RELEASE POLICIES AT FACILITY - The Onondaga County Water Authority (OCWA) has prepared this submittal under the requirements of the Risk Management Planning (RMP) Program (40 CFR 68).  OCWA is comitted to ensuring the safety of their employees, local residents, and potential environmental receptors through the implementation of safe chlorine utilization practices, procedures, and measures.\n\nFACILITY DESCRIPTION AND REGULATED SUBSTANCES HANDLED - OCWA utilizes chlorine in bulk (1-ton chlorine cylinders) at their Marcellus Water Treatment Plant (WTP) for water disinfection.  At the Marcellus WTP, the water is treated using polyaluminum chloride (PAC) and powdered activated carbon (PACT), followed by mixed media filtrations.  The Marcellus WTP has a design capacity of 20 million gallons per day (MGD), however, the facility is typically operated well below this capacity.  Within the Marcellus WTP, chlorine can be administered at three locations as follows: (1) at the raw water supply; (2) at the mixed-media filters; and, (3) at the potable water supply.  The plant uses chlorine for disinfection, taste and odor control, and for maintaining chlorine residuals with the water distribution system.\n       The Marcellus WTP operates 24-hours a day, seven days a week.  The facility is manned 16 hours per day (from 7 a.m. to 11 p.m.) using two shifts (facility is unmanned from 11 p.m. to 7 a.m.).  Alarms at the Marcellus WTP are connected to an autodialer system and/or the Supervisory Control and Data Acquisition (SCADA) system which is located at OCWA's Mattydale, New York Northern Concourse operations (OCWA's Northern Concourse facility is manned 24-hours a day).  Access to the facility is restricted by fencing.\n       The Only RMP-\"regulated\" substance utilized at the facility is gaseous chlorine.  The facility maintains a maximum of 14,000 pounds or (7) 1-ton cylinders on hand at any given time.  \n\nGENERAL ACCIDENTAL RELEASE PREVEN"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35781,
      "SummaryText": "TION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION SYSTEMS -  OCWA has implemented a number of passive and activie mitigation measures in an effort to reduce the probability or minimize the impacts of a gaseous chlorine release.  These measures include: (1) chlorine cylinders are maintained in a building which would contain minor releases and dramatically reduce the impacts of a catostrophic release; (2) OCWA has developed and implemented standard operating procedures (SOPs) for the delivery of chlorine cylinders and the testing and hook-up of chlorine cylinders; (3) OCWA has intalled a leak detection system in the Chlorine Storage Room (the chlorine \"sniffers\" are tested on a routine basis, using hypochlorite); (4) the facility is equipped with heat sensitive monitors (the fire alarm system is connected to the facility's dial-out system; (5) OCWA maintains emergency safety/response equpment at the facility (equipment includes: air packs, chlorine cylinder repair kits, safety shower, eyewash station, and fire extinguishers; (6) chlorine cylinders have a number of design considerations aimed at reducing the likelihood of a significant, uncontrolled release (these include protective dome covers over the cylinder valve and fusible plugs to protect from overpressurization due to exposure to heat); (7) the Chlorine Storage Room is a non-smoking area (in addition, no flammable materials are maintained in the Chlorine Storage room); (8) the Marcellus Fire Department has been notified of the presence of chlorine cylinders (OCWA has a coordinations agreement with the Fire Department); (9) OCWA has a developed and implemented a Process Safety Management (PSM) Program which aims at reducing the potential for a significant chlorine release; (10) the facility maintains a back-up generator with automatic switchover capabilities (ensures uninteruppted electrical service of chlorine protective equipment; (11) the facility maintains a portable chlorine detector which can be utilized to d"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35781,
      "SummaryText": "efine the extent of a plume in the event of a chlorine release; (12) all facility operators are certified and are familiar with the operation of the chlorine system and the use of the health and safety equipment; (13) OCWA has incorporated certain design and operational procedures to limit the potential for a chlorine release (e.g., all chlorine piping is chemically-compatible and properly supported; rotometers in the chlorinators are recessed to avoid damage due to impact; a vacuum eduction system is in-place to prevent the escape of chlorine gas; pigtail connections are replaced regularly; etc.); (14) the facility is manned 16-hours per day; during un-manned hours, alarms would sound at the SCADA system located at OCWA's Northern Concourse facility(which is manned 24-hours per day); (15) OCWA has implemented a Preventive Maintenance program for the generator, compressor, pumps, leak detection system; and (16) chlorine cylinders are maintained within \"chocks\" in the Chlorine Room to limit the potential for impact/damage.\n       These protective measures limit the potential for significant impact to the local populations/environment.\n\nFIVE YEAR ACCIDENT HISTORY - -OCWA has not had any accidents from their Marcellus Water Treatment Plant operations which would be \"reportable\" under 40 CFR 68.42 (\"reportable\" accidents are incidents which have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage).\n\nEMERGENCY RESPONSE PROGRAM - OCWA has established a coordination agreement with the Town of Marcellus Fire Department (Fire Department has agreed to respond to any incidents and provide notifications, as applicable, to local residents).  In addition to the coordination agreement, OCWA has developed a formal \"Emergency Response Plan\" as an element of their Process Safety Management (PSM) Program.  The following major elements are addressed on the \"Em"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35781,
      "SummaryText": "ergency Response Plan\": (a) escape routes and procedures; (b) procedures for post-evacuations employee accounting; ( c) preferred means to report emergencies ; (d) emergency coordinators; (e) outside clean-up contractors; (f) emergency equipment; (g) coordination agreement; (h) alarm systems; and (i) reporting requirements.\n       In addition, facility personnel conduct spill response drills/training in accordance with the requirements specified under 29 CR 1910.119.\n\nPLANNED CHANGES ON CHLORINATION SYSTEM - Through the implementaion of their PSM Program, OCWA has identified a number of modifications (both equipment and procedural) aimed at providing additional safety of the chlorine system at the Marcellus WTP.  These modifications have been/are currently being implemented."
    }
  ]
}