{
  "FacilityID": 35940,
  "FacilityName": "Celanese Chemical Division, Bay City Site",
  "FacilityStr1": "Highway 3057, 10 mi SW of Bay City",
  "FacilityStr2": null,
  "FacilityCity": "Bay City",
  "FacilityState": "TX",
  "FacilityZipCode": "77404",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48321",
  "LEPC": "Matagorda County LEPC",
  "FacilityLatDecDegs": "28.861667",
  "FacilityLongDecDegs": "-096.020833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 26040709,
  "ParentCompanyName": "Celanese Ltd..",
  "Company2Name": null,
  "CompanyDUNS": 947592879,
  "Company2DUNS": 0,
  "OperatorName": "Celanese Chemical, Bay City Site",
  "OperatorStr1": "Highway 3057, 10 mi SW of Bay City",
  "OperatorStr2": null,
  "OperatorCity": "Bay City",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77404",
  "OperatorZipCodeExt": "0509",
  "RMPContact": "Hugh D. Billings",
  "RMPTitle": "EHSA and Shipping Services leader",
  "FTE": 180,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000096932",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0-01628",
  "SafetyInspectionDate": "2002-04-09 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 28.85389,
  "FRS_Long": -96.02806,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51805,
      "AltID": "Vinyl Acetate Process",
      "FacilityID": 35940,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52980,
          "ProcessID": 51805,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 68453,
          "ProcessID": 51805,
          "ChemicalID": 29,
          "Quantity": 4101000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 68454,
          "ProcessID": 51805,
          "ChemicalID": 104,
          "Quantity": 421000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 104,
            "ChemicalName": "Acetaldehyde",
            "CASNumber": "75-07-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 568453,
          "ProcessID": 51805,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 568454,
          "ProcessID": 51805,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 51806,
      "AltID": "Butanol Process",
      "FacilityID": 35940,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52981,
          "ProcessID": 51806,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 68455,
          "ProcessID": 51806,
          "ChemicalID": 129,
          "Quantity": 15730.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 129,
            "ChemicalName": "Propylene  [1-Propene]",
            "CASNumber": "115-07-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 568455,
          "ProcessID": 51806,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35940,
      "SummaryText": "EXECUTIVE SUMMARY FOR CELANESE\nBAY CITY PLANT FACILITIES\n \n ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAt the Celanese Bay City Plant (BCP) we are committed to operating and maintaining all of our processes in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n *  A description of our facility and use of substances regulated by EPA's RMP regulation\n *  An overview of our accidental release prevention programs\n *  A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\n *  An overview of our emergency response program\n *  An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\n\n\nTHE STATIONARY SOURCE AND THE REGULATED SUBSTANCES\n\nThe BCP is situated in a rural area of Matagorda County several miles away from any residences.  Our facility produces commodity organic chemicals using a variety of chemicals and processing operations.  Some of these products include Vinyl Acetate, Butyl and Propyl Alcohol's, Heptanoic and Pelargonic Acid, n-Propyl Acetate, n-Butyl Acetate, and Isobutyl Acetate.  In our processes, we use the following chemicals that the EPA has identified as having the potential to cause significant offsite consequences in the event of a substantial accidental release:\n \nToxics\n\nVinyl acetate monomer is our main product. It is produced in the Vinyl Acetate Process, and is used largely in the manufacturing of adhesives and paints.  These materials are subsequently used for safety glass for automobiles, in floorings and rigid PVC pipe.  About 4MMlbs are store"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35940,
      "SummaryText": "d on site in nitrogen inerted atmospheric storage tanks. \n \nFlammables\n\nAcetaldehyde is an impurity in the production of vinyl acetate.  It is separated and sold in the merchant market.  About 400M lbs. of acetaldehyde is stored on site as a liquid in pressurized spheres.  The standard operating procedure limits the inventory in the spheres to 50%. \n \n Propylene is another substance covered by the RMP rule.  It is a feedstock used in the Butanol process for the manufacture of butyl alcohol. Liquid propylene is supplied by pipeline.  About 16M lbs is contained in the piping within the plant fence boundary.\n\nOur accidental release prevention programs and our contingency planning efforts help us effectively manage the hazards that are posed to our employees, the public, and the environment by our use of these chemicals.\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE CHEMICAL-SPECIFIC PREVENTION STEPS\n\nOur accidental release prevention programs and our contingency planning efforts help us effectively manage the hazards that are posed to our employees, the public, and the environment by our use of these chemicals.\n\nThe following chemical-specific prevention steps are taken to prevent accidental releases: \nPropylene chemical-specific prevention steps:\n     ? Propylene piping has remote isolation system \nAcetaldehyde chemical-specific prevention steps:\n     ? Use of mounted water spray around the acetaldehyde spheres for fire protection\n     ? Sphere has remote isolation capabilities.\nVinyl acetate chemical-specific prevention steps:\n     ? Use of nitrogen blanketing in storage tanks to avoid flammability\n     ? Use of PBQ additive to inhibit polymerization\n     ? Bulk storage is located away from processing areas in  tank farm areas with secondary\n       Containment sufficient to handle spills.\n     ? Remote activated firewater monitors and emergency response equipment is readily available.\n\nThese individual elements of our prevention program work together to pre"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35940,
      "SummaryText": "vent accidental chemical releases.  Our company and our employees are committed to the standard that these management systems set for the way we do business, and we have specific accountabilities and controls to ensure that we are meeting the requirements of the law and our own internal standards for accident prevention.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nWe keep records for all significant accidental chemical releases that occur at our facility.  During the past five years there has not been a release involving materials covered under EPA's RMP rule that resulted in deaths, injuries, or significant property damage on site, or offsite injuries, evacuations, sheltering in place, property damage or environmental damage.   \n\nEMERGENCY RESPONSE PLAN\n\nThe BCP Emergency Plan provides procedures and guidelines for an orderly and safe response to emergency situations.  Our program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  The Emergency Plan includes response for protection of employees, the environment, community and equipment resulting from hazardous releases of chemicals, including vinyl acetate, acetaldehyde and propylene.  The Emergency Plan provides instructions for notifying the Local Emergency Planning Commission (LEPC) immediately when appropriate.  There are also emergency drills conducted by the site along with community first responders, sheriff's department and hospital.\n\nA Community Alert network (CAN) computer phone system is in place that will notify residents by phones in the affected area about a release that could impact them, what happened and what to do.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nAs a result of the PHAs (Process Hazards Analyses) that are conducted periodically on each of the units of the plant, recommendations to improve the prevention of, and response to accidental chemical releases are generated, and the plant addresses the recommendations that are"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35940,
      "SummaryText": " made. \n\nThe following is a list of improvements that are being evaluated or implemented at the BCP to help prevent and better respond to accidental chemical releases:\n    -  Modify the instrumented control system to prevent overpresssuring the propylene feed vaporizer upon reactor shutdowns.\n    -  Evaluate installation of a nuclear level device on T-117 Acid Vaporizer to prevent loss of feed to the VA process.\n\nThe following initiatives focus on improving mechanical reliability to reduce the likelihood of failures that could potentially result in a chemical release:\n    -  Upgrade the  vibration monitoring instrumentation on C-93 Recycle Gas Compressor in the VA process, \n    -  Improve vibration monitoring on C18 and C-103 reciprocating compressors,\n    -  Study frequency monitoring on motor bearings to better predict failures.\n    -  Conduct detailed Root Cause Analysis on significant incidents and mechanical reliability issues.\n-   Implement process safety best practices through common  Celanese work practices  such as MOC and Energy Isolation.\n-  Continue to improve centralized corporate training initiatives  such as  the Safety Integrated System training initiative."
    }
  ]
}