{
  "FacilityID": 35964,
  "FacilityName": "City of Fargo Wastewater Treatment Plant",
  "FacilityStr1": "3400 NORTH BR0ADWAY",
  "FacilityStr2": null,
  "FacilityCity": "FARGO",
  "FacilityState": "ND",
  "FacilityZipCode": "58102",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38017",
  "LEPC": "Cass County LEPC",
  "FacilityLatDecDegs": "46.924806",
  "FacilityLongDecDegs": "-096.787361",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": "wwtp@ci.fargo.nd.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Fargo",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Fargo",
  "OperatorStr1": "3400 North Broadway",
  "OperatorStr2": null,
  "OperatorCity": "Fargo",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58102",
  "OperatorZipCodeExt": null,
  "RMPContact": "Peter Bilstad",
  "RMPTitle": "Wastewater Plant Superintendent",
  "FTE": 16,
  "OtherEPAFacilityID": "ND0022870",
  "EPAFacilityID": "100000086042",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-10-03 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-08-26 00:00:00",
  "DeRegistrationEffectiveDate": "2019-08-20 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 46.92333,
  "FRS_Long": -96.7875,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51831,
      "AltID": "Program Level",
      "FacilityID": 35964,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 53006,
          "ProcessID": 51831,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 68482,
          "ProcessID": 51831,
          "ChemicalID": 49,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 68483,
          "ProcessID": 51831,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 568482,
          "ProcessID": 51831,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 568483,
          "ProcessID": 51831,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35964,
      "SummaryText": "Release prevention and emergency response policies\nThe City of Fargo(City) takes and active role in prevention accidental releases at it's wastewater treatment facility by ensuring that its employees are properly trained in the safe operation and maintenance of processes subject to the Part 68 rule. This training includes the safe handling of regulated substances under the rule. The City has also developed and maintained a risk management policy that contains general safety rules. Though these rules do not specifically address the covered processes and their regulated substances, compliance with the general rules significalntly reduces the potential for accidental releases of the regulated substances. This facility complies with industry-standard practices for wastewater treatment plants that use sulfur dioxide and chlorine in bulk. As for emergency response, the City has established and maintains procedures for emergency notification and response. These are reviewed with employees on a periodic basis and revised to accommodate changes in staffing when they occur. In general, the City would deal only with releases of a small amount of a regulated substance. If the release is determined to be large or if the chemical is stored outside or has migrated outside for a release indoors, the City would immediately notify the City of Fargo Fire Department.\nFor releases that are judged to require the expertise and resources of an established hazardous materials(HAZMAT) team, the facility would call on the services of the jointly operated team comprised of personnel from the cities of Fargo, North Dakota and Moorhead, Minnesota.\nCity management understands its duty to provide a safe working environment at this facility and to take measures to prevent accidents that may have an effect on the surrounding community. This understanding is reflected in procedures described in this document. \n\nFacility and regulated substance\nThe City of Fargo WWTP treats all sewage from the City of"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35964,
      "SummaryText": " Fargo and some communities outside the city limits. It does this through as series of physical and chemical treatment operations that include bar screens, vortex grit removal, pre-aeration, seven primary clarifiers, three B.O.D. trickling filters, two intermediate clarifiers, two nitrification filters, one final clarifier, a chlorine contact mixing vault, detention chamber and sulfur dioxide dechlorination. The effluent is then discharged in the Red River. The designed capacity of the plant is 15 million gallons per day. The regulated substances stored, handled, and used at this facility are sulfur dioxide and chlorine. The chlorine and sulfur dioxide are stored in one ton containers with a maximum intended inventory of 8 containers of chlorine & 4 containers of sulfur dioxide on site. All containers are stored inside the chlorination building. Chlorine and sulfur dioxide are stored and used on site from April 1 to October 31 for disinfection and dechlorination requirements. All containers are removed fron the site from November 1 to March 31.\n\nAccidental release prevention program\nThe facility's prevention program for both sulfur dioxide and chlorine complies with EPA's 40 CFR part 68 rule for program 2 processes, to maintain this compliance, the City has in place many procedural and techonological saveguards. The procedural safeguards include an employee-training program and operation and maintenance procedures for those employees involved in operation the covered processes. The technological safeguards include controls, sensors, alarms, and industry-standard systems. All of these serve to prevent unintended releases of sulfur dioxide and chlorine. Should the prevention program fail to prevent a release, the WWTP is equipped with engineering controls designed to minimize the effect of the release on the surrounding community. For chlorine and sulfur dioxide, the storage containers are kept inside of a building to mitigate the effects of a release. The plant also "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35964,
      "SummaryText": "has a scrubber capable of neutralizing one ton of chlorine, the amount stored in the largest single container onsite. The scrubber is maintained on a regular basis to ensure proper operation if needed during a chlorine release. As with chlorine, the equipment in the sulfur dioxide process is operated and maintained by personnel properly trained in the hazards of the chemical and the process.\n\nFive-year accident history\nWithin the last five years, this facility has not had an accident involving sulfur dioxide or chlorine that caused deaths, injuries, property or environmental damage, evacuations, or sheltering in place.\n\nEmergency response program\nThis facility has established and maintains an emergency action plan that is coordinated with local response agencies, such as the City Fire Department and the local HAZMAT team,  which is shared with the City of Moorhead, Minnesota. The goals of the plan are to protect onsite emplyees from the hazardous effects of the release and to minimize the effects of releases on the general public. The program is routinely reviewed and updated to reflect personnel and regulatory changes. It is also submitted to the Fire Department for review and comment. City emplyees handle incidental releases of sulfur dioxide and chlorine and trained and equipped to do so.\n\nPlanned changes to improve safety\nIdeas for changes to improve safety are actively sought from employees. Employee meetings that focus on safety issues are held regularly at this facility. Employees are encouraged and trained to recognize hazards and present ideas to eliminate them or to minimize the potential consequences of those hazards. During the development of the risk management plan, hazard reviews were conducted with key employees to meet the pevention program requirements. During these sessions, recommendations were made for the purpose of improving safety and prevention accidental chemical releases. Each recommendaton has been or is being considered and evaluated for"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35964,
      "SummaryText": " implementation. This evaluation process will provide all affected employees with a heightened awareness of safety issues related to the covered process."
    }
  ]
}