{
  "FacilityID": 35982,
  "FacilityName": "Northampton Borough Municipal Authority WTP",
  "FacilityStr1": "5880 Roosevelt Street",
  "FacilityStr2": null,
  "FacilityCity": "Whitehall",
  "FacilityState": "PA",
  "FacilityZipCode": "18052",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42077",
  "LEPC": "Lehigh County LEPC",
  "FacilityLatDecDegs": "40.700000",
  "FacilityLongDecDegs": "-075.517778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Northampton Borough Municipal Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Northampton Borough Muni. Auth.",
  "OperatorStr1": "1 Clear Springs Drive",
  "OperatorStr2": null,
  "OperatorCity": "Northampton",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "18067",
  "OperatorZipCodeExt": "0156",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000092071",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-06-19 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-04-08 00:00:00",
  "DeRegistrationEffectiveDate": "2009-04-01 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 40.7,
  "FRS_Long": -75.51778,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "1",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51878,
      "AltID": null,
      "FacilityID": 35982,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 68572,
          "ProcessID": 51878,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 53053,
          "ProcessID": 51878,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 19785,
              "Process_NAICS_ID": 53053,
              "SafetyReviewDate": "2004-03-19 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "NEC, UBC, ASHRAE, UFC",
              "FR_Comments": null,
              "HazardReviewDate": "2004-03-19 00:00:00",
              "ChangeCompletionDate": "2004-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-03-19 00:00:00",
              "TrainingReviewDate": "2004-03-19 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Home Study",
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-03-19 00:00:00",
              "EquipmentInspectionDate": "2004-02-04 00:00:00",
              "EquipmentTested": "Chlorine Feed Equipment",
              "ComplianceAuditDate": "2000-12-20 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "The prevention program in place involves daily inspection of equipment, routine preventative maintenance, and frequent testing of the gas detector and alarm systems. Chlorine containers in use are on scales for daily measurement of chlorine consumption and for inventory purposes. The chlorine storage and feed rooms contains gas detectors for alarm purposes. Standard operating and emergency procedures are in place. The Northampton Borough Municipal Authority has delegated emergency response to the local fire department, and the county LEPC and HAZMAT response teams. The LEPC off-site Emergency Response Plan from SARA III is the de facto emergency response plan for this site. Incident Chain of command is listed in this document. Water Treatment Plant Operators are trained in chlorine safety and in routine operations. A Chlorine Institute \"B\" kit is available to provide for repair of one-ton cylinder leaks. Both SCBA and PPE are provided for operators. As part of the RMP, internal audits will be performed on an annual basis.",
              "_chemicals": [
                {
                  "PrimaryKey": 20695,
                  "PreventionProgram2ID": 19785,
                  "ProcessChemicalID": 68572
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 35982,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2003-09-09 00:00:00",
    "ERTrainingDate": "2004-06-19 00:00:00",
    "CoordinatingAgencyName": "Lehigh County Emergency Management",
    "CoordinatingAgencyPhone": "6104375252",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35982,
      "SummaryText": "The Northampton Borough Municipal Authority (NBMA) owns and operates a potable water treatment system and distribution system for the Borough of Northampton, Pennsylvania, and surrounding communities.  The water treatment plant located at 5880 Roosevelt Street., Whitehall, PA, 18052 processes up to 6.0 million gallons per day of water drawn from the Lehigh River and Spring Mill Dam to yield potable water.  Treatment processes include pretreatment, coagulation, flocculation, sedimentation, filtration and chlorine disinfection.  This plan addresses chlorine used in the treatment process.  The plant is operated 24 hours per day, all year.  The water treatment plant includes a chlorine storage room, which contains up to four one-ton cylinders (8,000 pounds) of chlorine liquified under pressure, a hoist, scale(s). Vacuum regulators and a gas detector/alarm unit.  A chlorine feed room is located adjacent to this storage room and has a pre, post and spare chlorinator.  Thechlorination system uses remote-vacuum-actuated feed lines and has vacuum regulator attached directly to the chlorine container gas valves, mitigating against high-pressure gas releases through the chlorinator system/  Water treatment operators regularly check the room and its equipment, inventorying the rate of chlorine use and adjusting the feed rate as necessary.  Off-Site Consequence Analysis.  The off-site consequence analysis includes two chlorine release scenarios, one \"worst-case\" and one \"alternative-case.\"  The first scenario is defined by the regulations as the \"maximum quantity in the largest vessel\" being released \"as a gas over ten minutes.\"  due to an unspecified failure.  The alternative-case scenario is defined as \" more likely to occur than the worst-case scenario.\"  Atmospheric dispersion modeling was performed using the RMP*Comp program distributed by the Chemical Emergency Preparedness and Prevention Office of the EPA.  This model determined the distance traveled by the chlorine relea"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35982,
      "SummaryText": "sed until its concentration decreases to the \"toxic endpoint\" selected by EPA of 3 ppm.(0.0087 mg/L.) which is the Emergency Response Planning Guideline Level 2, defined by the American Industrial Hygiene Association as the \"maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective aciton.\"  The residential population within a circle with a radius corresponding to the toxic endpoint distance has to be defined \"to estimate the population potentially affected.\"  The worst-case release scenario at the Northampton Borough Municipal Authority Treatment Platn involves a failure of one chlorine container, or a 2,000 pound release.  The off-site consequence analysis was performed under the prescribed EPA conditions of all volume released as gas within a ten minute period, to an ERPG-s endpoint radius of 3.00 miles according to the RMP*Comp model.  Within the 28.3 square-mile area bounded by this circle reside 33,725 people who may be affected by the release.  The alternative-case scenario chosen involves a leak from a faulty gasket installation between the ton container and the vacuum regulator.  The RMP*Comp model was run assuming a 10 minute duration release at 0.5 pounds per minute, which yielded a distance to endpoint of 0.1 miles and an impacted area of twenty acres surrounding the facility.  The meterological conditions used were taken from the Guidance to be stability calss d and wind speed of 3.0 m/sec.  Approximatgely 30 people would be affected by this release.  Accidental Release Prevention.  The Northampton Borugh Municipal Authority's water treatment plant accidental release preveniton program is based upon the following elements:  1.  High level of training for the operators.  2.  Preventative maintenance program for equipment.  3.  Use of state-"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35982,
      "SummaryText": "of-the-art process and safety equipment.  4.  Use of accurate and effective operating procedures, written with the participation of the operators.  5.  Performance of a hazard review of the equipment and procedures.  6.  Implementation of an auditing and inspection program.  Chemical-specific prevention steps include availability of self-contained breathing apparatus (SCBA) personal protection equipment (PPE), awareness of the hazards and toxic properties of chlorine ans the presence of a chlorine gas detector.  Five Year Accident History.  No accidental release of chlorine has occurred at this facility in the past five years.  Emergency Response Program.  The facility has an emergency response program which as been reviewed and coordinated by the Lehigh County Local Emergency Planning Committee (LEPC).  This program includes and emergency repsonse decision tree and a notificaiton plan.  Emergency response drills will be conducted with the fire companies, and the operation and redsponse procedures will be reviewed and updated on a regular basis.  Planned Facilities to Improve Safety.  Facilities to improve safety (recommended acitons) were made following a May 5, 1999, inspection of the disinfeciton systems by the consulting engineer.  These recommendation included additional signage, vent line modificaitons, high temperature alarm in storage room, egress provisions and ventilation modifications.  To comply with local codes, it is alos recommended to install a fire suppression system and chlorine scrubber system."
    }
  ]
}