{
  "FacilityID": 35991,
  "FacilityName": "Hazleton City Authority - Roan Filtration Facility",
  "FacilityStr1": "400 East Arthur Gardner Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Hazleton",
  "FacilityState": "PA",
  "FacilityZipCode": "18201",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42079",
  "LEPC": "Luzerne County LEPC",
  "FacilityLatDecDegs": "40.934722",
  "FacilityLongDecDegs": "-075.956667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G5",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Randy J. Cahalan",
  "OperatorStr1": "400 East Arthur Gardner Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Hazleton",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "18201",
  "OperatorZipCodeExt": null,
  "FTE": 41,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000187326",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 40.935925,
  "FRS_Long": -75.9605,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "200",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51890,
      "AltID": null,
      "FacilityID": 35991,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 68584,
          "ProcessID": 51890,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 53069,
          "ProcessID": 51890,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 29874,
              "Process_NAICS_ID": 53069,
              "SafetyReviewDate": "2004-06-17 00:00:00",
              "PHA_Date": "2004-09-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-06-17 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-06-17 00:00:00",
              "TrainingReviewDate": "2004-06-17 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-07-17 00:00:00",
              "EquipmentInspectionDate": "2004-06-01 00:00:00",
              "EquipmentTested": "Chlorinators, vacuum regulators, pressure reducing valves, isolation valves, SCUBA equipment",
              "ChangeMgmtDate": "2003-07-01 00:00:00",
              "ChangeMgmtReviewDate": "2004-06-17 00:00:00",
              "PreStartupReviewDate": "2004-06-17 00:00:00",
              "ComplianceAuditDate": "2004-06-17 00:00:00",
              "AuditCompletionDate": "2004-09-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-06-17 00:00:00",
              "HotWorkPermitReviewDate": "2004-06-17 00:00:00",
              "ContractorSafetyReviewDate": "2004-06-17 00:00:00",
              "ContractorSafetyEvalDate": "2004-06-17 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 43390,
                  "PreventionProgram3ID": 29874,
                  "ProcessChemicalID": 68584
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 35991,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-04-01 00:00:00",
    "ERTrainingDate": "2004-06-01 00:00:00",
    "CoordinatingAgencyName": "Hazleton Fire Department",
    "CoordinatingAgencyPhone": "5704591252",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35991,
      "SummaryText": "The City of Hazleton, Pennsylvania owns and operates a Water Treatment Plant (WTP) which is physically located in Hazleton, Pennsylvania.  At the time of revision (June 2004) of the RMP, the WTP is operated for the Hazleton City Authority under a contract with American Water Services, Inc.  American Water Services, Inc. has developed a RisK Management Program (RMP) for the control of catastrophic releases of extremely hazardous substances at the WTP.  The RMP builds on the commitment of both the Hazleton City Authority and American Water Services to the protection of its neighbors, its employees and the control of the potential for such a release.\n\nThe US Environmental Protection Agency (EPA) issued the Chemical Accident Prevention rule (40 CFR 68) in June 1996.  This rule requires any facility with a process that involves more than a threshold quantity (TQ) of some 140 hazardous compounds to prepare a risk management plan (RMP).  The RMP applies to the use of Chlorine, which has a TQ of 2500 pounds and is used for disinfection of drinking water at the WTP. American Water Services continues to maintain a maximum amount of 20,000 pounds of Chlorine on site. This RMP is being submitted by June 21, 2004.\n\nAmerican Water used chlorine stored in 2000 pound pressurized steel cylinders for disinfection of drinking water.  At any given time, up to four such sylinders may be tied into the process, with an additional six cylinders in storage available to go on line.  Chlorine is delivered to the WTP on as as-needed basis.  Although the chlorine exists as a liquid under pressure inside the cylinders, it is passed into the disinfection process as a gas to be applied at various points within the WTP.  The WTP has an active chlorine leak detection system linked to an alarm and ventilation system in place and operational in those indoor areas of the WTP where gaseous chlorine could likely be present.\n\nThe RMP summarizes existing documentation used by American Water Services, Inc."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35991,
      "SummaryText": "for the WTP and supplements the procedures described in other Hazleton City Authority documents such as general adminstrative guidelines and safety and health manuals.  The RMP addresses American Water Services, Inc's management procedures, hazard assessment, prevetion program and emergency and emergency response program (ERP) that are consistent with EPA's Chemical Accident Prevention rule.  Each major element of the Chemical Accident Prevention rule is addressed in the RMP in detail.  American Water Services, Inc.'s Plant Manager is the primary person for the operator responsible for implementing the provisions of the Chemical Accident Prevention rule for the WTP.\n\nAmerican Water Service, Inc. conducted an analysis of chlorine release potential at the WTP.  This analysis present results of the worse case release scenario as required by 40 CFR 68.25 and an alternative case release scenario as required by 40 CFR 68.28 and public receptors are potentially affected by each scenario.  However, over the last five years no release meeting the provision of 40 CFR 68.42(a) has occurred at the WTP.\n\nThe prevention program of the RMP includes a Process Safety Management/Risk Management document with 14 sections. Management System, Employee participation, Process Safety Information, Process Hazards Analysis, Operating Procedures, Training, Contractor Safety, Pre-Startup Safety Review, Mechanical Integrity, Hot Work Permit (Although American Water does not consider these permits applicable at ths time since outside Contractors are not utilized presently), Management of Change, Incident Investigation, Emergency Planning and Response, Compliance Audits.  Additionally has (MIT) Maintenance.  Inspection, Testing Schedule and Codes and Standards Table for this faciltity.\n\nChlorine is an acute toxin that can cause respiratory distress at relatively low concentrations, and can even cause death at higher concentrations.  The chlorine handling equipment (scrubber) at the WTP has design"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35991,
      "SummaryText": "ed to safely contain chlorine but in the event of an accidental chlorine release, a chlorine detection and alarm system will alert personnel at the WTP to the need for an emergency response.\n\nAmerican Water Services, Inc. conducted a process hazard analysis of the chlorine process.  The process hazard analysis team consisted of American Water Services personnel knowledgable in process operation and maintenance and knowledgeable in the process hazard analysis process.  The process hazard analysis team used a what-if / checklist technique and recommendations were compiled and are being  implemented.\n\nAmerican Water Services, Inc. had developed standard operating procedures (SOPs) that provide system description, specifications and operating steps for the chlorine system.  The SOPs address the start-up, shutdown, inspections, temporary operation, emergency procedures and trouble-shooting.  SOPs to provide for mechanical integrity of the chlorine process equipment rely on manufacturer's recommended approaches.  The RMP contains details of this approach.\n\nOur prevention measures include the use of:\n\n-chorine detectors and alarms to rapidly alert operators to any problems;\n-process safety information to document the safe process design;\n-process hazards analyses to evaluaate the chemical and process hazards;\n-operating procedures to ensure that the system is operated safely;\n-maintenance, inspection and testing to ensure that the system is maintained according to applicable standards and manufacturer's recommendations;\n-training, hot work permits (if ever required), contractor safety and employee participation programs to ensure that all employees and contractors working on and around the processes are aware of the hazards, can perform their job duties safely and know the actions to be taken in an emergency;\n-management of change and prestartup safety reviews to ensure that changes are documented, analyzed and kept within the design basis;\n-incident investigation proced"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35991,
      "SummaryText": "ure to investigate each incident and near misses to detemine root causes and make needed safety improvements;\n-and periodic safety audits to ensure that our programs are working as they should to protect both employees and the public.\n\nWithin the last five years, the Hazleton Water Plant has not had any accidental releases that resulted in injuries or property damage.  The plant has maintained an excellent safety record throughout its operating history and has never had a major chlorine release.\n\nIn the event that a chlorine release does occur, the Hazleton Water Plant has an emergency response program that coordinates emergency response with the Local Emergency Planning Committee.  If such a release did occur, plant personnel would contact  the local emergency reponders (Hazleton City Fire Department) who would dispatch a trained HAZMAT team to the site to handle the chlorine release.  For all but minor releases of chlorine, American Water Services, Inc. intends to rely on the Hazleton City Fire Department for response to an accidenal release of chlorine including providing incident command, local area evacuation and shelter-in-place notifications and coordination with other appropriate agencies.  American Water Services personnel are responsible for initial notification of the Fire Department of a release and for facility evacuation and accounting for WTP employees in the event of a major chlorine release.\n\nWe continually work to safely manage the hazards of chlorine to protect our employees and the community we serve.  The Risk Mangement Program will be maintained to reduce the risk of accidental releases and each year we will conduct training, review procedures, maintain the equipment and follow safe work practices.  Periodically, we will audit our program, review our Process Hazard Analysis and coordinate with the community emergency response organization.  We will also be assessing further safety enhancements to the facility over the next few years and makin"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 35991,
      "SummaryText": "g recommendations to the Hazleton City Authority accordingly."
    }
  ]
}