{
  "FacilityID": 36176,
  "FacilityName": "Brunswick Cellulose",
  "FacilityStr1": "1400 West Ninth Street",
  "FacilityStr2": "Post Office Box 1438",
  "FacilityCity": "Brunswick",
  "FacilityState": "GA",
  "FacilityZipCode": "31521",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13127",
  "LEPC": "Brunswick-Glynn County LEPC",
  "FacilityLatDecDegs": "31.176111",
  "FacilityLongDecDegs": "-081.517500",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "IO",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 2270239,
  "ParentCompanyName": "Brunswick Cellulose, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 139638923,
  "Company2DUNS": null,
  "OperatorName": "Brunswick Cellulose",
  "OperatorStr1": "1400 West Ninth Street",
  "OperatorStr2": "Post Office Box 1438",
  "OperatorCity": "Brunswick",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31521",
  "OperatorZipCodeExt": null,
  "FTE": 782,
  "OtherEPAFacilityID": "31520BRNSWWEST9",
  "EPAFacilityID": "100000020639",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "2631-127-0003-V",
  "SafetyInspectionDate": "2002-10-02 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "June 2004 5-yr Update Submission",
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-05-04 15:01:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 31.173147,
  "FRS_Long": -81.519247,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 52127,
      "AltID": "Chlorine Dioxide Solution",
      "FacilityID": 36176,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 68891,
          "ProcessID": 52127,
          "ChemicalID": 71,
          "Quantity": 86000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 53312,
          "ProcessID": 52127,
          "NAICSCode": "325188",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 29996,
              "Process_NAICS_ID": 53312,
              "SafetyReviewDate": "2004-03-31 00:00:00",
              "PHA_Date": "2004-06-04 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-09-04 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-01-29 00:00:00",
              "TrainingReviewDate": "2004-05-19 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Independent Study",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": "Peer Review",
              "MaintenanceReviewDate": "2003-03-01 00:00:00",
              "EquipmentInspectionDate": "2004-05-20 00:00:00",
              "EquipmentTested": "South ClO2 Storage Tank",
              "ChangeMgmtDate": "2004-02-18 00:00:00",
              "ChangeMgmtReviewDate": "2004-05-21 00:00:00",
              "PreStartupReviewDate": "2004-02-18 00:00:00",
              "ComplianceAuditDate": "2003-11-03 00:00:00",
              "AuditCompletionDate": "2004-07-19 00:00:00",
              "IncidentInvestigationDate": "2004-02-28 00:00:00",
              "InvestigationChangeDate": "2004-02-28 00:00:00",
              "ParticipationPlansReviewDate": "2004-05-18 00:00:00",
              "HotWorkPermitReviewDate": "2003-06-10 00:00:00",
              "ContractorSafetyReviewDate": "2004-05-27 00:00:00",
              "ContractorSafetyEvalDate": "2003-05-28 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 43572,
                  "PreventionProgram3ID": 29996,
                  "ProcessChemicalID": 68891
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 36176,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-02-12 00:00:00",
    "ERTrainingDate": "2003-06-01 00:00:00",
    "CoordinatingAgencyName": "Glynn County-Brunswick LEPC",
    "CoordinatingAgencyPhone": "9122675678",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 36176,
      "SummaryText": "1.    Executive Summary\n\nBrunswick Cellulose, Inc. (BCI) is committed to operating in a manner that is safe for its workers, the public, and the environment. As part of this commitment, the company has established a system to help ensure safe operation of the hazardous chemical processes at this facility. EPA's Risk Management Program (RMP) requires a submission of a plan describing its Risk Management Program, and this document is intended to satisfy those requirements (per 40 CFR 68).\n\nThe Risk Management Program at the facility consists of a hazard assessment, a prevention program and an emergency response program.  The RMP is only one component of a more comprehensive safety program at the BCI facility.  This plan is only intended to describe those parts of the safety program at the facility that are required by the RMP rule.\n\n1.1    Accidental Release Prevention and Emergency Response Policies\n\nThe facility implements reasonable controls to prevent foreseeable releases of the hazardous substances. These controls include training programs for personnel; programs to help ensure safety in the design, installation, operation, and maintenance of the processes; and programs to evaluate the hazards at the facility.\n\nIn the event of an accidental release, the facility will control and contain the release in a manner that will be safe for workers and will help prevent injury to the public and/or the environment.  In order to effectively implement these policies, the facility has established a management system directed by the General Manager.\n\n1.2    BCI and Our Regulated Substance\n\nBrunswick Cellulose, Inc. is a pulp mill primarily involved in the manufacture of bleached, kraft pulp.  As a part of the bleaching operation, Chlorine Dioxide (ClO2) is used and stored in sufficient quantities to be covered by the RMP rule. The Chlorine Dioxide Solution System, which includes the generation, storage and distribution of chlorine dioxide, is considered the RMP covered process"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 36176,
      "SummaryText": "and is in Program Level 3 with a threshold quantity of approximately 86,000 lbs. during peak operations.\n\n1.3    Off Site Consequence Analysis\n\nAn off site consequence analysis was performed to estimate the potential for an accidental release of chlorine dioxide to affect the public or the environment. The off site consequence analysis consisted of evaluating both the worst-case release scenario and alternative release case scenario. The main objective of performing the off site consequence analysis was to determine the distance at which certain effects might occur to the public because of an accidental release (called the end point distance).  \n\n1.4 Accidental Release Prevention Program\n\nBCI has always used a prevention program to help prevent accidental releases of hazardous substances, but it formalized this prevention program for the Chlorine Dioxide Solution System to comply with the 14 elements of the Occupational Safety and Health Process Safety Management (PSM) prevention program in 1992. In 1996, the EPA RMP rule established that a Program Level 3 Prevention Program would become a requirement for this process as well. \n\nThe following sections briefly describe the elements of the BCI Program Level 3 Prevention Program:\n\n1. Employee Participation The facility has developed a written employee participation program which encourages active participation from personnel in the development and maintenance of the prevention program. Employees are consulted on, and informed about, the RMP rule and development of PHA's and operating procedures.\n\n2. Process Safety Information The facility maintains a variety of technical documents that are used to help ensure the safe operation of the processes. The documents address the hazards of the chemicals used in the process and the design and operation of the equipment used in the processes.  Documents such as material safety data sheets (MSDS) report the physical and chemical properties of the hazardous substances handled at"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 36176,
      "SummaryText": "the facility and are available to all employees and the Emergency Response Team. \n  3. Process Hazard Analysis.  BCI performs and periodically updates process hazard analyses (PHAs) of the covered processes to help identify process hazards and generate recommendations that might improve the safe operation of the process. A team composed of personnel with engineering and process operating experience and a team leader with experience in performing process hazard analyses is assembled to analyze the process. The facility primarily uses the \"Hazard and Operability\" (HAZOP) and/or \"What If'\" technique, supplemented with checklist, to perform this analysis. The PHA team prepares a written report describing the results of the analysis, including recommendations which could enhance the safety of the process.\n\n4. Operating Procedures. BCI operators, supervisors, and engineers work together to develop and maintain accurate operating procedures to define how tasks related to process operations should be safely performed on an annual basis. The operating procedures are used to train employees and serve as reference guides for appropriate actions to take during both normal operations and upset (initial startup, normal and emergency shutdowns, temporary operations and startup following a standby condition) operating conditions. \n\n5. Training. BCI trains employees to safely and effectively perform their assigned tasks. The facility training program for process operators includes both the initial training and refresher training that covers the properties and hazards of the substance in the process and safe work practices.  Tests are used to verify comprehension of the training material.  Operators are consulted annually about the materials to be used for the training and changes are implemented if appropriate.\n\n6. Contractors.  BCI has established a program to help ensure that contractor activities at the facility are performed in a safe manner. The program reviews the safety recor"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 36176,
      "SummaryText": "d of all contractors to help ensure that the facility only hires contractors who can safely perform the desired job tasks.  BCI explains to the contract supervisors the hazards of the process on which they and their employees will work and requires that the contractor supervisors train each of their employees who will work on or near a covered process before that employee begins work at the site. \n\n7. Pre-startup Safety Reviews.  BCI performs a safety review of new or modified equipment in the covered process before the process is placed into service to help ensure that the process has been prepared to operate safely. This review confirms that construction and equipment operations are in accordance with design specifications and adequate safety and emergency procedures are in place.  A checklist is completed to document the review and to ensure that the appropriate issues have been addressed.\n\n8. Mechanical Integrity.  BCI maintains the mechanical integrity of the covered process equipment to help prevent equipment failures that could endanger workers, the public, or the environment. The facility mechanical integrity program includes an inspection and testing program to help identify equipment deterioration and damage before the equipment fails and a quality assurance program to help ensure that new and replacement equipment meet the design standards required for service in BCI covered processes. \n\n9. Hot Work Permit.  BCI has established a hot work permit program to control spark or flame-producing activities that could result in fires or explosions in covered processes at the facility for personnel who will perform such work. The facility reviewed OSHA's fire prevention and protection requirements in 29 CFR 1910.252(a) and created a Hot Work Permit form to comply with these requirements. \n\n10. Management of Change.  The BCI \"management of change\" program evaluates and approves all proposed changes to chemicals, equipment, and procedures for a covered process to he"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 36176,
      "SummaryText": "lp ensure that the change does not negatively affect safe operations. Process changes that are determined to be replacements in kind are allowed without completing a \"management of change\" form. All other changes must be confirmed through the \"management of change\" program to help ensure that inadvertent consequences of the process changes are prevented, safety consequences of the changes are addressed, affected process safety information and operating procedures are updated, and affected employees are notified of the changes.\n\n11. Incident Investigations.  BCI investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented.  The results of the investigations are documented, recommendations are resolved and appropriate process enhancements are implemented where required.\n\n12. Compliance Audits.  BCI audits the covered processes to be certain that the facility's prevention program is effectively addressing the safety issues of the operations.  An audit team that includes personnel knowledgeable in the RMP rule and in the process is assembled and evaluates if the program is sufficient to help ensure safe operations of the process. The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented where required.\n\n1.5    Five - Year Accident History-\n\nThere have been no significant releases of chlorine dioxide solution in the previous 5 years\n\n1.6    Emergency Response Programs\n\nBCI has established a written emergency response program to help safely respond to accidental releases of hazardous substances. The emergency response plan includes procedures for informing the local response organizations and the public about accidental releases that could reasonably result in off site consequences.  It can also provide proper first aid and emergency medical treatment to treat accidental human expo"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 36176,
      "SummaryText": "sure to hazardous substances at the facility if needed.  The team is trained in all aspects of emergency response and rescue, periodically conducts drills and will coordinate at least one annually with the local fire department, and maintains its equipment on-site. \n\nThe written emergency response plan complies with other federal contingency plan regulations and will be communicated to local emergency response officials through the Local Emergency Planning Committee. The facility will maintain a regular dialogue with the LEPC to ensure that the plan is adequate to address emergencies which may arise.\n\n1.7\tPlanned Changes to Improve Safety\n\nBCI has established safety procedures in place and plans to continue those safe work practices.  BCI has recently reviewed reactive chemical safety and will be working toward implementing additional safety procedures to address this area in the future."
    }
  ]
}