{
  "FacilityID": 36452,
  "FacilityName": "SARA LEE Foods - New London",
  "FacilityStr1": "N3620 County HWY D",
  "FacilityStr2": null,
  "FacilityCity": "New London",
  "FacilityState": "WI",
  "FacilityZipCode": "54961",
  "Facility4DigitZipExt": "9600",
  "FacilityCountyFIPS": "55087",
  "LEPC": "Outagamie County LEPC",
  "FacilityLatDecDegs": "44.371944",
  "FacilityLongDecDegs": "-088.735833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.saralee.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 39125570,
  "ParentCompanyName": "SARA LEE CORPORATION",
  "Company2Name": null,
  "CompanyDUNS": 5213962,
  "Company2DUNS": null,
  "OperatorName": "SARA LEE CORPORATION",
  "OperatorStr1": "N3620 County HWY D",
  "OperatorStr2": null,
  "OperatorCity": "New London",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54961",
  "OperatorZipCodeExt": "9600",
  "FTE": 1209,
  "OtherEPAFacilityID": "54961HLLSHCOUNT",
  "EPAFacilityID": "100000091492",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-07-25 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 44.371944,
  "FRS_Long": -88.735833,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "600",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 52535,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 36452,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 69491,
          "ProcessID": 52535,
          "ChemicalID": 56,
          "Quantity": 131600.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 53729,
          "ProcessID": 52535,
          "NAICSCode": "311612",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 30267,
              "Process_NAICS_ID": 53729,
              "SafetyReviewDate": "2003-09-30 00:00:00",
              "PHA_Date": "2004-02-25 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2005-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-02-11 00:00:00",
              "TrainingReviewDate": "2003-01-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-02-14 00:00:00",
              "EquipmentInspectionDate": "2004-06-28 00:00:00",
              "EquipmentTested": "All Major Equipment",
              "ChangeMgmtDate": "2003-09-30 00:00:00",
              "ChangeMgmtReviewDate": "2002-01-16 00:00:00",
              "PreStartupReviewDate": "2004-03-10 00:00:00",
              "ComplianceAuditDate": "2001-12-04 00:00:00",
              "AuditCompletionDate": "2002-03-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-11-07 00:00:00",
              "HotWorkPermitReviewDate": "2004-06-11 00:00:00",
              "ContractorSafetyReviewDate": "2004-05-06 00:00:00",
              "ContractorSafetyEvalDate": "2003-12-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 44010,
                  "PreventionProgram3ID": 30267,
                  "ProcessChemicalID": 69491
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 36452,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-10-31 00:00:00",
    "ERTrainingDate": "2004-04-29 00:00:00",
    "CoordinatingAgencyName": "Outagamie County LEPC",
    "CoordinatingAgencyPhone": "9208325464",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 36452,
      "SummaryText": "employees and contractors that have contact with the ammonia refrigeration system that incorporate safety measures into the procedures.  These safety procedures were developed by refrigeration system operators and are reviewed on an annual basis by means of a SOP review session.  Process safety information for the refrigeration system is reviewed during these annual meetings as well.  SARA LEE Foods ¿ New London encourages employee participation in development of the control measures used at the plant by means of the annual procedures review.  Any changes to the operating procedures are communicated to affected employees following written management of change procedures established by SARA LEE Foods ¿ New London.\n\nSARA LEE Foods ¿ New London understands that maintaining the refrigeration system in good working order is essential to preventing accidental releases; therefore SARA LEE Foods ¿ New London has implemented a Preventative Maintenance (PM) program.  The Preventative Maintenance program is scheduled, documented and managed to ensure that regular maintenance occurs on the refrigeration system.  Also, to ensure the mechanical integrity of critical refrigeration system components, auditing is conducted every 5 years by a certified refrigeration contractor.\n\nTo ensure that SARA LEE Foods ¿ New London¿s control measures are effective in maintaining the safe operation of the plant, regularly scheduled audits are performed on the ammonia refrigeration system:\n\n-In accordance with the PSM program, SARA LEE Foods ¿ New London conducts detailed PSM compliance audits every three years that incorporates review of process safety information, process hazard analysis, operating procedures, training programs, system mechanical integrity, management of change, pre-start up review procedures, compliance audit procedures, incident investigation procedures, employee participation programs, hot work permit procedures, and contractor safety procedures.\n-In addition, SARA LEE Foods"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 36452,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\nBackground Data\n\nIn accordance with Title 40 of the Code of Federal Regulations Chapter 68 (40 CFR 68) promulgated by the Environmental Protection Agency (EPA), SARA LEE Foods ¿ New London submits this Risk Management Plan (RMP) for operations at their New London, Wisconsin facility.  SARA LEE Foods ¿ New London¿s operations include the processing of meat products (hot dogs, sausages, hams and deli meats) for public consumption packaged under the familiar brand names of Hillshire Farm and Deli Select.  SARA LEE Foods ¿ New London has been in operation at this facility for over 50 years providing quality meat products and over 1,000 jobs to the local community.\n\n\nAccidental Release Prevention and Emergency Response Policy\n\nSARA LEE Foods ¿ New London is committed to protecting the health of its employees, the surrounding community, and the environment; therefore it is SARA LEE Foods ¿ New London¿s policy to manage a safe and healthy workplace, protect the environment, and maintain compliance with safety, health, and environmental regulations: 40 CFR 68 as well as Occupational Safety and Health Organization (OSHA) Process Safety Management (PSM) regulations promulgated as Title 29 of the Code of Federal Regulations Chapter 1910, Section 119 (29 CFR 1910.119), and OSHA¿s Hazardous Operations and Emergency Response regulations (29 CFR 1910.120).\n\n\nStationary Sources and Regulated Substances\n\nSARA LEE Foods ¿ New London is required to maintain low temperatures in the food processing areas of the plant that are within standards required by the United States Department of Agriculture (USDA) to ensure quality in the final products.  SARA LEE Foods ¿ New London uses anhydrous ammonia (a 112(r) regulated substance) as a refrigerant to maintain the 500,000 ft2 facility within the required range of operating temperatures.  Anhydrous ammonia is an industry-standard refrigerant for meat processing plants.  SARA LEE Foods ¿ New London¿s refrigeration system con"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 36452,
      "SummaryText": "sisting of receivers, compressors, evaporators, condensers, and piping can contain quantities of anhydrous ammonia over the 10,000 pound threshold.  This process is a Program 3 process as defined by the Risk Management Program rule (40 CFR Part 68).\n\n \nWorst Case and Alternate Release Scenario\n\nAnhydrous Ammonia\n\nIn accordance with 40 CFR Subpart B, SARA LEE Foods - New London evaluated consequences for releases of Anhydrous Ammonia.  Both a worst-case scenario and an alternate-case scenario were developed.\n \n\nAccidental Release Prevention Program\n\nAnhydrous Ammonia\n\nThe ammonia refrigeration system is designed and constructed in accordance with ANSI/IIAR 2-1992 Standards for Equipment, Design, and Installation of Ammonia Mechanical Refrigerating Systems.  To prevent and mitigate accidental releases of anhydrous ammonia, SARA LEE Foods ¿ New London has implemented several precautionary measures, such as process/equipment controls, standard operating procedures, preventative maintenance programs, employee training and audit programs.  \n\nSARA LEE Foods ¿ New London maintains a ¿no odor¿ policy.  The ¿no odor¿ policy instructs employees that detect an ammonia odor to call the Utilities Maintenance staff and the Utilities Maintenance staff must respond immediately to the call to address the situation.\n\nSARA LEE Foods ¿ New London has implemented and is in compliance with OSHA¿s PSM regulations and as such, has evaluated and engineered for anhydrous ammonia releases.   Some of the controls installed to prevent catastrophic releases of ammonia are process equipment (vents, pressure relief valves, backup pumps, and manual shutoffs) and automated controls (automatic shut-offs, ammonia leak detection system, and electrical distribution system grounding).  In addition, SARA LEE Foods ¿ New London has trained approximately 37 personnel to respond to potential ammonia releases (HazMat team).\n\nSARA LEE Foods ¿ New London has developed Standard Operating Procedures (SOP) for all"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 36452,
      "SummaryText": "has implemented auditing by the local fire department or Department of Commerce on an annual basis\n\n\nFive-Year Accident History\n\nOver the last five years, SARA LEE Foods ¿ New London has not experienced an accidental release of anhydrous ammonia causing any on-site death, injury or significant property damage, or known off-site death, injury, property damage, environmental damage, evacuations or sheltering in place.\n\n\nEmergency Response Program\n\nSARA LEE Foods ¿ New London has developed a comprehensive emergency response program designed to protect both employees and the community in the event of a release.  This program is fully described in a document entitled EMERGENCY RESPONSE & SPILL PREVENTION CONTROL & COUNTERMEASURES PLAN (ERSPCC) in order to facilitate response efforts in the event of off-site releases of anhydrous ammonia.  Included in the ERSPCC are measures to be taken internally by SARA LEE Foods ¿ New London as well as measures to be taken by off-site response agencies.\n\nSARA LEE Foods ¿ New London has trained approximately 37 on-site personnel to respond to accidental releases of regulated substances.  These personnel are trained in accordance with 29 CFR 1910.120, OSHA¿s Hazardous Operations and Emergency Response regulations according to their duties and function.  These personnel receive initial training and annual update training thereafter. SARA LEE Foods ¿ New London stages mock release incidents annually to test the skills of the HazMat team, determine the team¿s readiness, and identify areas of improvement.\n\nTo assure that the local governmental response agencies are familiar with SARA LEE Foods ¿ New London¿s emergency response procedures, SARA LEE Foods ¿ New London has submitted copies of the ERSPCC for review and approval by the local agencies.  The following local agencies have reviewed SARA LEE Foods ¿ New London¿s ERSPCC:\n\n\n-Outagamie County Local Emergency Planning Committee (LEPC)\n-State Emergency Response Commission\n-New London Fire"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 36452,
      "SummaryText": "Department\n-New London Police Department\n-Outagamie County Sheriff\n-New London Family Medical Center\n-Appleton Medical Center\n-Appleton Hazardous Materials Response Team\n\nTo pre-plan for an anhydrous ammonia release with off-site effects, SARA LEE Foods ¿ New London¿s ERSPCC includes procedures/equipment to mitigate the release, procedures to inform local response agencies, evacuation procedures, and procedures for public communication.\n\nIn the event of an anhydrous ammonia release with off-site effects, the general public will be warned by the Local Emergency Planning Committee (LEPC) according to the facility¿s off-site plan which is updated on an annual basis by the LEPC.  Any significant changes to the ERSPCC will be communicated to the agencies listed above.\n\nPlanned Changes to Improve Safety\n\nAs a part of SARA LEE Foods ¿ New London¿s continuous efforts to improve the performance of its safety systems, several changes are planned at the facility to improve safety and prevent anhydrous ammonia releases.  These changes are scheduled to be implemented by 2005 and include refrigeration piping upgrades and relocation of piping to the roof of the facility."
    }
  ]
}