{
  "FacilityID": 36508,
  "FacilityName": "MarkWest Hydrocarbon, Inc. - Boldman Facility",
  "FacilityStr1": "6072 Hurricane Road",
  "FacilityStr2": null,
  "FacilityCity": "Pikeville",
  "FacilityState": "KY",
  "FacilityZipCode": "41501",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21195",
  "LEPC": "Pike LEPC",
  "FacilityLatDecDegs": "37.532500",
  "FacilityLongDecDegs": "-082.616389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.markwesthydrocarbon.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 361716277,
  "ParentCompanyName": "MarkWest Hydrocarbon, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "MarkWest Hydrocarbon, Inc.",
  "OperatorStr1": "6072 Hurricane Road",
  "OperatorStr2": null,
  "OperatorCity": "Pikeville",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "41501",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000175641",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2024-12-17 00:00:00",
  "DeRegistrationEffectiveDate": "2024-12-17 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 37.5326,
  "FRS_Long": -82.616266,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 52637,
      "AltID": "NGL Storage",
      "FacilityID": 36508,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 69658,
          "ProcessID": 52637,
          "ChemicalID": 155,
          "Quantity": 556800.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 52107,
              "ProcessChemicalID": 69658,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 52108,
              "ProcessChemicalID": 69658,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 52109,
              "ProcessChemicalID": 69658,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 53832,
          "ProcessID": 52637,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 30357,
              "Process_NAICS_ID": 53832,
              "SafetyReviewDate": "2001-02-20 00:00:00",
              "PHA_Date": "2001-02-20 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-08-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Computerized call-out system",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-01-21 00:00:00",
              "TrainingReviewDate": "2000-09-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-07-22 00:00:00",
              "EquipmentInspectionDate": "2002-11-01 00:00:00",
              "EquipmentTested": "Storage Tank inspection",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2000-09-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2000-09-01 00:00:00",
              "AuditCompletionDate": "2001-12-31 00:00:00",
              "IncidentInvestigationDate": "2003-04-17 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-02-20 00:00:00",
              "HotWorkPermitReviewDate": "2003-06-01 00:00:00",
              "ContractorSafetyReviewDate": "2003-04-23 00:00:00",
              "ContractorSafetyEvalDate": "2000-09-26 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 44158,
                  "PreventionProgram3ID": 30357,
                  "ProcessChemicalID": 69658
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 36508,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2001-01-01 00:00:00",
    "ERTrainingDate": "2001-01-01 00:00:00",
    "CoordinatingAgencyName": "Pike County LEPC",
    "CoordinatingAgencyPhone": "6068869157",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 36508,
      "SummaryText": "Updated Risk Management Plan\r\nExecutive Summary\r\n\r\nMarkWest Hydrocarbon, Inc. - Boldman Facility\r\n\r\n1.\tAccidental Release Prevention and Emergency Response Policies\r\n\r\nThe MarkWest Hydrocarbon, Inc. (MarkWest) - Boldman facility located in Pikeville, Kentucky is strongly committed to employee, public, and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program that covers such areas as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is the policy of MarkWest to implement appropriate controls to prevent the possible release of regulated substances.  Unforeseeably, if such a release does occur, MarkWest is completely coordinated with the Pike County, Kentucky Local Emergency Planning Committee (LEPC) which provides emergency response personnel to control and mitigate the effects of the release.\r\n\r\n2.\tThe Stationary Source and the Regulated Substance Handled\r\n\r\nThe primary function of the MarkWest facility encompasses natural gas liquid (NGL) extraction.  NGL is the one substance present at the facility that is regulated by Risk Management Plan (RMP) regulations.  This flammable substance is a mixture comprised of propane, normal butane, isobutane, and natural gasoline (pentanes and hexanes).\r\n\r\nThe NGL is extracted from a natural gas transmission pipeline.  Once extracted, the NGL is stored in two 60,000-gallon capacity pressure vessel (A11 and A12).  The Y-Grade is then transferred offsite via tank truck.\r\n\r\nThe total quantity of product stored in the vessels is administratively controlled to ensure that the vessels are not filled above 80% of full capacity.  Additionally, pressure relief devices provide added assurance that the vessels are not over-filled to pressures above 250 pounds per square inch (psi).  These controls are in place to prevent the potential for over-pressurization which could cause structural damage to the vessels"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 36508,
      "SummaryText": "and lead to a release.\r\n\r\nBased on the administrative controls described above, the maximum inventory present at the facility would be equal to 80% of the total 120,000-gallon capacity: 96,000 gallons (the equivalent of 556,800 pounds) of NGL.\r\n\r\n\r\n\r\n3.\tThe Worst Case Release Scenario and Alternative Release Scenario\r\n\r\nThe parameters of the offsite consequence analyses for this MarkWest facility were based on the requirements set forth in the RMP rules outlined in 40 CFR 68.25 (e), Worst-case release scenario-flammable, and 40 CFR 68.28, Alternative release scenario analysis.  The worst case and alternative case radii of effect were determined utilizing RMP*Comp software provided by the EPA.\r\n\r\n4.\tThe General Accident Release Prevention Program and the Chemical-Specific Prevention Steps\r\n\r\nMarkWest has taken all the necessary steps to comply with accidental release prevention requirements sets out under 40 CFR Part 68 of the EPA regulations.  The facility is subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard under 29 CFR 1910.119.\r\n\r\nThe following briefly describes the elements of the release prevention program in place at the MarkWest Boldman facility.\r\n\r\nProcess Safety Information\r\n\r\nMarkWest maintains a detailed record of written safety information that describes the chemical hazards, operating parameters, and equipment designs associated with all processes.\r\n\r\nProcess Hazard Analysis\r\n\r\nMarkWest conducts comprehensive studies to ensure that the hazards associated with the processes at the facility are identified and controlled efficiently.  The HAZOP methodology is used to carry out these analyses.  The studies are undertaken by a team of qualified personnel in engineering and process operations and are revalidated at regular intervals.  Any findings related to the hazard analyses are addressed in a timely manner.\r\n\r\nOperating Procedures\r\n\r\nFor the purpose of safely conducting activities within covered"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 36508,
      "SummaryText": "processes, MarkWest maintains written operating procedures.  These procedures address various modes of operation such as initial start up, normal operations, temporary operations, emergency shutdown, normal shutdown, and startup after turn around.  The information is regularly reviewed and is readily accessible to operators involved with the process.\r\n\r\n\r\nTraining\r\n\r\nMarkWest has a comprehensive training program in place to ensure that the employees operating processes are completely competent in the operating procedures associated with the processes.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided as needed.\r\n\r\nMechanical Integrity\r\n\r\nThe integrity of mechanical operations at MarkWest is ensured through documented maintenance checks on process equipment.  Process equipment examined by these checks include among others: pressurized storage vessels, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\r\n\r\nManagement of Change\r\n\r\nWritten procedures are in place at MarkWest to manage changes in process chemicals, technology, equipment, and procedures.  Process operators, maintenance personnel, or any other employees whose job tasks are affected by a modification in process conditions are promptly made aware of and are trained on the specifics of the modification.\r\n\r\nPre-Startup Reviews\r\n\r\nPre-startup safety reviews related to new processes and to modifications in established processes are conducted as required.  These reviews are conducted to confirm that construction, equipment, operating, and maintenance procedu"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 36508,
      "SummaryText": "res are suitable for safe startup prior to placing equipment into operation.\r\n\r\nCompliance Audits\r\n\r\nMarkWest conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out every three years as required by RMP regulations (40 CFR 68.58) and any corrections required as a result of the audits are undertaken in a safe and timely manner.\r\n\r\n\r\n\r\n\r\nIncident Investigation\r\n\r\nMarkWest investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident, as well as any corrective actions needed to prevent the release from reoccurring.  All reports are retained for a period of five years.\r\n\r\nEmployee Participation\r\n\r\nMarkWest believes that successful PSM and accident prevention programs require a team effort.  Company employees are encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, MarkWest employees have access to all information created as part of the facility¿s implementation of the RMP program, in particular, information relating to and resulting from process hazard analyses. \r\n\r\nContractors\r\n\r\nPeriodically, MarkWest hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of the safety performance of the contractor is undertaken.  MarkWest has a strict policy of informing contractors of known potential hazards relating to the contractor¿s work and the associated processes.  Contractors are also informed of all procedures for emergency response should an accidental release of a regulated substance occur.\r\n\r\n5.\tFive Year Accident History\r\n\r\nMarkWest has had an excellent record of preventing accidental releases over the last five years.  Due to stringent release prevention policies, there have been no"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 36508,
      "SummaryText": "accidental releases during this period.\r\n\r\n6.\tEmergency Action Plan\r\n\r\nA written emergency action plan to deal with accidental releases of regulated substances is retained at the MarkWest facility.  The plan includes all aspects of emergency response including medical treatment, evacuations, and notification of local emergency response agencies and the public.\r\n\r\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within processes that would require a modified emergency response.\r\n\r\nThe Pike County, Kentucky LEPC is the local emergency response agency with which our emergency response plan has been coordinated and verified.\r\n\r\n7.\tPlanned Changes to Improve Safety  \r\n\r\nOne major development has resulted form the implementation of the various elements of this accidental release program: installation of process area gas detectors.  This modification will improve safety at the facility.  This change occurred in November of 2001.\r\n\r\n8.\tConclusion\r\n\r\nMarkWest Hydrocarbon, Inc. has taken all necessary measures required by EPA and OSHA regulations to ensure the continued safe operations of the MarkWest - Boldman facility.  The Risk Management Plan provided herein summarizes the active release prevention program that is currently in place at the facility.  This risk management program illustrates MarkWest¿s commitment to employee, public, and environmental safety.  In the unforeseeable event that a release does occur, MarkWest¿s emergency action plan combined with the assistance of the Pike County, Kentucky LEPC provide assurance that such an event will be successfully and safely mitigated."
    }
  ]
}