{
  "FacilityID": 36564,
  "FacilityName": "FARMERS RANCHERS COOPERATIVE  AINSWORTH-ANHYDROUS",
  "FacilityStr1": "West U.S. Highway 20",
  "FacilityStr2": null,
  "FacilityCity": "Ainsworth",
  "FacilityState": "NE",
  "FacilityZipCode": "69210",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31017",
  "LEPC": "Brown County LEPC",
  "FacilityLatDecDegs": "42.550778",
  "FacilityLongDecDegs": "-099.890889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G6",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Farmers Ranchers Cooperative",
  "OperatorStr1": "102 South Main",
  "OperatorStr2": null,
  "OperatorCity": "Ainsworth",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "69210",
  "OperatorZipCodeExt": null,
  "RMPContact": "Keith Erickson",
  "RMPTitle": "General Manager",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000080075",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-02-12 00:00:00",
  "SafetyInspectionBy": "Insurance Company",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 42.55078,
  "FRS_Long": -99.89089,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) STANDARD POSITION (SA ON)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 52732,
      "AltID": "Product Storage",
      "FacilityID": 36564,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 53928,
          "ProcessID": 52732,
          "NAICSCode": "49313",
          "_desc": {
            "NAICS_CODE": "49313",
            "NAICS_DESCRIPTION": "Farm Product Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 69820,
          "ProcessID": 52732,
          "ChemicalID": 56,
          "Quantity": 410000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 569820,
          "ProcessID": 52732,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 36564,
      "SummaryText": "FARMERS RANCHERS COOPERATIVE                                                             AINSWORTH,  NE\n                          Company Name                                                                           Plant Location\n\n102 South Main, Ainsworth, NE 69210     \n                          Mailing Address\n\nRisk Management Plan  - EXECUTIVE SUMMARY\n\nFacility Policy:\n\nThe management and employees operating each of our facilities are committed to the prevention of\nany accidental release of hazardous material transported or stored on our locations.  In the event an\naccidental release should occur, we are prepared to work with our Local Fire Company(s), \nEmergency Response Personnel, and other appropriate authorities deemed applicable depending on\nthe specific incident, to best mitigate any release and to minimize the impact of the release to people\nand the environment.\n\nFacility Information:\n\nThe primary activity of our company is NAICS code 422910 \"Farm Supply Wholesaler\" because we\nare engaged in providing \"agricultural inputs\" that include the receiving, storage, and reloading of\nAnhydrous Ammonia for delivery to farmers in our area.  The NAICS code we feel most applicable\nfor receiving, storing, and reloading is # 493130 \"farm product warehousing and storage\".  Although\nAnhydrous Ammonia is the only product subject to the EPA Risk Management Plan at this time, it\nshould be noted that we also handle Propane for both agricultural uses and home heating, which is\nunder consideration as a listed substance.  We include Propane (as well as all crop protectents and\npetroleum products) in our planning, training, and maintenance programs,  however only the\nAnhydrous Ammonia facilities will be included in this report.    \n\nAnhydrous Ammonia is received, stored, and distributed for direct application to farm fields during\nthe early and fall months.  During the balance of the year little if any product transfer occurs.   \nThe maximum quantity handled at a given time wou"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 36564,
      "SummaryText": "ld be the off loading of a semi-trailer vehicle\ntank.\n\nThe facility is operated on an \"as needed\" basis with staff present only during the receiving and\nreloading of product for delivery.  Total annual hours for these needs do not meet the 2,080 hour\nrequirement to qualify as a \"full time employee\" on site.  Rounding the fraction of these total hours\nto one significant digit produces one \"full time employee\" for item number 1.11. Our facilities have\nadequate lighting, and are inspected  at various times of day and night throughout the year.   Time\nexpended for these inspections is not included in our staffing calculation.\n\nWorst-case release scenario:\n\nThe \"worst-case release scenario\" is considered to be the release of the total contents of our largest\nAnhydrous Ammonia tank.  The maximum quantity released based on 85 % tank capacity as limited\nby design standards, and the distance to the endpoint (point of dispersion to 200 ppm) miles based on\nEPA's RMP -Comp Program (Version 1.06), as well as possible public and environmental receptors\nwithin the area have been provided to the County LEPC (Local Emergency Planning Committee) to\nassist them in their planning.   \n\nAlternative release scenario:\n\nThere has not been an actual release of Anhydrous Ammonia during the last 5-years at the site.  We\nbelieve the most likely release would be caused by a break in a transfer hose.  Transfer hoses are\nprotected by manual,  self closing excess flow , and \"pull away\" valves so our alternative release\nscenario is based on the loss of contents from the largest hose used (off loading transportation\nequipment).  The distance to the endpoint (point of dispersion to 200 ppm), as well as, environmental and public\nreceptors has been provided to the County LEPC.\n\nAccidental Release Program:\n\nOur Anhydrous Ammonia accidental release program is based on guidelines found in the American\nNational Standards Institute, Inc. (ANSI) standard K-61.1 \"Safety Requirements for the Storage and\nHandlin"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 36564,
      "SummaryText": "g of Anhydrous Ammonia; and the U.S. Occupational Safety and Health Administration\n(OSHA) standard 29CFR 1910.111 \"Storage and Handling of Anhydrous Ammonia\".   We conduct\nannual employee training on the safe handling, transportation and distribution of Anhydrous\nAmmonia, and have installed safety equipment including, but not limited to: Excess flow valves,     \nbarriers to avoid damage by trucks or other vehicles, and security locks to prevent tampering when\nthe site is unattended.   We also maintain routine contact with our local fire department and\nemergency response personnel; and have provided for and/or participated with them in safety training\nexercises on Anhydrous Ammonia.  We have developed an Emergency Action Plan for employees,\ncustomers, and visitor protection in event of fire, explosion, tornado, and other acts of god that\ninitiates evacuation, emergency medical care, contacts for assistance, etc. for all areas of our\ncompany including the Anhydrous Ammonia facility included in this plan.  The primary emergency\ncoordinator is listed in the Registration Section of this document.  Any of the following additional\nindividuals may be contacted in the event the primary emergency coordinator cannot be reached:\n\n                           Name             Work Phone         24-Hr. Phone                            \n  \n     Brian Springer                                  (402) 387-2323      (402) 387-1089 \n\nFive - Year Accident History:\n\nThere has not been a release of Anhydrous Ammonia within the past five years that has caused any\ndeath, injuries, or significant property damage at the facility; nor to our knowledge has resulted in\noffsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n\nEmergency Response Program:\n\nThis facility is included in the written Community Emergency Response Plan as prepared by  the\nLocal Emergency Planning Committee (LEPC), and the Nebraska Emergency Management Agency\n(NEMA) (former Nebr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 36564,
      "SummaryText": "aska State Civil Defense Agency).  We also include these materials in our own\nEmergency Action Plan in accordance with OSHA Standard 29CFR 1910.38.   We have provided\nState and Local authorities all Community Right-to-Know information requested as well as that\nrequired under SARA Title III  (EPCRA).  Our written employee safety programs include pre-\nemergency planning and employee training in accordance with OSHA standards, and are offered for\nreview at any time by our Local Emergency Planning Committee (LEPC) to ensure they conform to\nthe community plan(s).  We actively encourage participation in our Anhydrous Ammonia and\nPropane training programs by the local fire department(s), local emergency response team,\ncommunity planners, etc. that may be expected to respond to an incident at our site.  \n\nPlanned changes to improve safety:\n\nSafety improvement is an on-going process at all of our facilities.  Periodic evaluations are\nperformed to assess the maintenance of safe conditions.  There are no additional specific\nrecommendations for implementation at this time. \n\nAdditional Information:\n\nFor  additional information, response to questions, or comments,  please contact:      \n\n\nThe General Manager          at     (402) 387-2811   .\n\n{end}"
    }
  ]
}