{
  "FacilityID": 36657,
  "FacilityName": "Cloverdale Foods Company",
  "FacilityStr1": "3015 34th Street N.W.",
  "FacilityStr2": null,
  "FacilityCity": "Mandan",
  "FacilityState": "ND",
  "FacilityZipCode": "58554",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38059",
  "LEPC": "Morton County LEPC",
  "FacilityLatDecDegs": "46.512500",
  "FacilityLongDecDegs": "-100.555000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 61445813,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Larry Huether",
  "OperatorStr1": "3015 34th Street N.W.",
  "OperatorStr2": null,
  "OperatorCity": "Mandan",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58554",
  "OperatorZipCodeExt": null,
  "RMPContact": "Larry Huether",
  "RMPTitle": "Plant Engineer",
  "FTE": 275,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000073074",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-11-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-10 00:00:00",
  "ErrorReportDate": "2004-08-10 00:00:00",
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 46.857,
  "FRS_Long": -100.93047,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 52850,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 36657,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 54048,
          "ProcessID": 52850,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 69958,
          "ProcessID": 52850,
          "ChemicalID": 56,
          "Quantity": 15566.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 569958,
          "ProcessID": 52850,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 36657,
      "SummaryText": "\n \n\n\n\n\n\n\n\nCloverdale Foods Company\n\nRMP Executive Summary\n\nBy: Larry Huether, Plant Engineer\n\nDate: 6-18-2004\n\n\n\nCloverdale Foods has been one of the leaders in our region for commitment to safety \n\nprograms for many years with very strong support from our CEO/President, T.J. Russell.\n\nCraig Engelhard, our Safety Manager, is a member of the AMI, American Meat Institute, \n\nsafety committee. During these conferences, they have addressed topics of Process Safety \n\nManagement for Ammonia Refrigeration, electrical safety, written SOP's dealing with \n\nthreat and risk. And I plan on joining the IIAR this summer. We have a very good \n\nrelationship with our local OSHA office, and have favorably united on different programs \n\nwith them to create and maintain a safe facility as possible. To show another example for \n\nour commitment to our employees, we were the first food processing facility in the \n\nUnited States, to allow NIOSH to review our practices and procedures and used their \n\nrecommendations to help our company be more efficient with proper procedures. We \n\nhave monthly safety meetings that cover different safety topics. This will range from \n\nammonia within our facility to safety awareness at home. Being a ready-to-eat food \n\nprocessor, food safety is an on going procedure on a daily basis.\n\n\n\nTraining is also considered to be very important at Cloverdale. Our Safety Manager has \n\nattended numerous safety seminars, and myself, Larry Huether, have completed the \n\nPSM/RMP schooling at Garden City Community College in Garden City, Kansas. I \n\nattended this school in May, I felt before attending that we had a very good RMP \n\nprogram, after the schooling, I learned on how I can even make it better.\n\nWe also had a RMP audit by E.P.A. auditors from the Denver, Colorado office on May 8, \n\n2002. After this audit, we updated our existing PHA, process safety information and the \n\nmechanical integrity program.\n\n\n\nHere are some of the topics discussed at our monthly safety meetin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 36657,
      "SummaryText": "gs:\n\nJanuary 2004 ? Human health and stretching\n\nFebruary 2004 ? Emergency Evacuation/Ammonia release MSDS injuries\n\nMarch 2004 ? Health and Medical increases in cost\n\nApril 2004 ? Safety Video, Stop and Think, look what could happen by taken short cuts\n\nMay 2004 ? General Safety Rules hand book\n\nJune 2004 ? Safety Video Blink You could loose your hand, How injuries affect the           \n\nothers around you  \n\n\n\nOn an annual basis we meet with our local fire department. During this time we tour the \n\nentire facility, discuss anything that might be a danger to our facility or employees and \n\nrevisit our emergency response program. \n\nOur emergency response program is: if we have a leak that is 50 ppm, we are trained to \n\nwear a MSA gas mask, if the leak reaches 300 ppm, all employees evacuate the building. \n\nAt this time we contact our local fire department and inform them of an ammonia leak. \n\nOur fire department will then contact a local gas refinery company, Tesoro, which has \n\ntrained personnel with the proper attire to respond to hazardous chemicals. During our \n\norientation for new employees and monthly safety meetings, our employees have been \n\nexplained where to congregate once leaving the building, depending on wind direction. \n\nAnd all supervisors have been trained on being accountable for the employees working in \n\ntheir department. The maintenance department has a hand held ammonia detector located \n\noutside the facility, which will be used to monitor the level of ammonia before reentering \n\nthe building.\n\n\n\nThe system in place for ammonia detection is a Manning leak detection system. All of \n\nour ammonia compressors and vessels are in one room; therefore the detector is in the \n\ncompressor room with the display outside in the maintenance shop area. If there is a leak, \n\nan alarm will sound in the shop, allowing any personnel to see the level of leak in the \n\ncompressor room without entering the compressor room. If any individual is in the \n\ncompressor room"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 36657,
      "SummaryText": " and a leak is present, there is an orange light warning that the level is \n\n50 ppm, employees have been trained at this point, a MSA is required. If the level gets \n\n300 ppm, a complete evacuation of the facility is required.\n\n\n\nAll of our ammonia valve stations that control the evaporators inside the building are \n\nlocated outside on the roof. Therefore, if there are any leaks in any room, excluding the \n\ncompressor room, it can be quickly isolated and controlled.\n\n\n\nAs stated earlier, we are a food manufacturing facility that produces sausage products, \n\nfranks, hams and bacon. All of the anhydrous ammonia is used for refrigeration. The \n\nreceiver, accumulators, and compressors are all located on the southeast corner of the \n\nbuilding with an outside door in this room. We have approximately 15,600 #'s of \n\nammonia in our systems. We have three separate systems in our facility. 1. a high suction \n\nthat we use for processing rooms, 2. a medium suction that we use for product holding \n\ncoolers, and 3. a low suction that is used for two blast freezers. There are room \n\ntemperatures that need to be met to comply with our local U.S.D.A. regulations.\n\n\n\nWe have an intense preventative maintenance program established not only for the \n\nammonia system, but also for all systems and equipment. This program ensures that all of \n\nthe ammonia equipment and vessels along with its safety controls are operational and in \n\nrunning condition. Our PHA has been updated to comply with OSHA 29 CFR 1910.119 \n\nand to meet the requirements of 40 CFR 68.67. During the audit, it was felt we were \n\noverly general on some items. Since then, we have broke it down even further to identify \n\nvariations that present any unique hazards to our equipment, piping, human factors, etc?\n\n\n\nThe Mechanical Integrity Program was also revised and updated as required by 40 CFR \n\n68.73. Before the audit our pipes and valves were not identified properly as \n\nANSI/ASHRAE 15,1994, Safety Code for Mechanical Refr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 36657,
      "SummaryText": "igeration, Sec. 11.2.2 \n\nrequires. An identification scheme was established and working well. Our pressure relief \n\nvalves were all changed to meet the five-year maximum.\n\n\n\nWe have not had any major accidental releases, there have been minor releases, such as \n\nvalve packing gland leaks, etc, and all of these leaks were identified and repaired \n\nimmediately during our daily or weekly preventative checks.\n\n\n\nAs stated earlier, employee training is mandatory at our company. All of my refrigeration \n\ntechnicians have gone through a classroom training conducted by an external company, \n\nthis same company has installed 100 % of our ammonia refrigeration. During this \n\nclassroom training, we videotaped the entire training and we are presently using this as \n\none of our training tools for future technicians.\n\n\n\n"
    }
  ]
}