{
  "FacilityID": 36662,
  "FacilityName": "HUSKER COOP          SCHULYER BRANCH",
  "FacilityStr1": "1119 ROAD E",
  "FacilityStr2": null,
  "FacilityCity": "SCHULYER",
  "FacilityState": "NE",
  "FacilityZipCode": "68661",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31037",
  "LEPC": "Colfax County LEPC",
  "FacilityLatDecDegs": "41.451667",
  "FacilityLongDecDegs": "-097.042222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "HUSKER COOP",
  "OperatorStr1": "P. O. BOX 1129",
  "OperatorStr2": null,
  "OperatorCity": "COLUMBUS",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68601",
  "OperatorZipCodeExt": "1129",
  "RMPContact": "Richard Richey",
  "RMPTitle": "GENERAL MANAGER",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000143016",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-03-24 00:00:00",
  "SafetyInspectionBy": "Cooperative Mutual Ins.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-05-27 00:00:00",
  "DeRegistrationEffectiveDate": "2014-05-17 00:00:00",
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 41.74306,
  "FRS_Long": -97.25225,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 52855,
      "AltID": "Product Storage",
      "FacilityID": 36662,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 54053,
          "ProcessID": 52855,
          "NAICSCode": "49313",
          "_desc": {
            "NAICS_CODE": "49313",
            "NAICS_DESCRIPTION": "Farm Product Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 69964,
          "ProcessID": 52855,
          "ChemicalID": 56,
          "Quantity": 550000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 569964,
          "ProcessID": 52855,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 36662,
      "SummaryText": "Company Name:              Husker Co-op  -  SCHUYLER  -  Anhydrous Ammonia\nMailing Address:             P.O. Box   1129     Columbus  NE  68601\n\nRisk Management Plan  - EXECUTIVE SUMMARY\n\nFacility Policy:\n\nThe management and employees operating each of our facilities are committed to the prevention of any accidental release of hazardous material transported or stored on our locations.  In the event an accidental release should occur, we are prepared to work with our Local Fire Company(s),  Emergency Response Personnel, and other appropriate authorities deemed applicable depending on the specific incident, to best mitigate any release and to minimize the impact of the release to people and the environment.\n\nFacility Information:\n\nThe primary activity of our company is  NAICS code 422510, \"establishments primarily engaged in operating county or terminal grain elevators\", however we are also engaged  in providing \"agricultural inputs\" that include the receiving, storage, and reloading of Anhydrous Ammonia for delivery to farmers in our area.  The NAICS code we feel most applicable for receiving, storing, and reloading is # 493130 \"farm product warehousing and storage\".  Although Anhydrous Ammonia is the only product subject to the EPA Risk Management Plan at this time, it should be noted that some of our locations  also handle Propane  for  both agricultural uses and home heating, which is under consideration as a listed substance.  We include Propane (as well as all crop protectents and petroleum products) in our planning, training, and maintenance programs, however only the Anhydrous Ammonia facilities will be included in this report.    \n\nAnhydrous Ammonia is received, stored, and distributed for direct application to farm fields during the early and fall months.  During the balance of the year little if any product transfer occurs .  \nDuring some years, depending on pricing, availability, and needs; for approximately one week per year, Anhydrous Ammonia may be incl"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 36662,
      "SummaryText": "uded in a process ( T- reactor ) of blending to make a 10-34-0 starter grade of liquid fertilizer.   During this period, we may have two to four rail tanker cars on track.\n\nThe maximum quantity stored in pressurized permanent storage vessels at the location described is 550000   Lbs. The maximum on site vessel size is   18,377  Gallons, storing    78,102  Lbs.  The maximum quantity handled at a given time would be the off loading of a rail tank car (ranging from 156,000 to 198,000 lbs)., or a semi-trailer vehicle tank holding 40,000 to 42,000 lbs.\n\nThe facility is operated on an \"as needed\" basis with staff present only during the receiving and reloading of product for delivery.  Total annual hours for these needs do not meet the 2,080 hour requirement to qualify as a \"full time employee\" on site, therefore item number 1.11 is Zero.   We do however, have several employeees on site thruout the year that are trained in the care and storage of Anhydrous ammonia.\n\nOur facilities have adequate lighting, and are inspected  at various times of day and night throughout the year.   Time expended for these inspections is not included in our staffing calculation.\n\nWorst-case release scenario:\n\nThe \"worst-case release scenario\" is considered to be the release of the total contents of our largest Anhydrous Ammonia tank.  The maximum quantity released based on 85 % tank capacity as limited by design standards, the distance to the endpoint (point of dispersion to 200 ppm)  miles based on EPA's RMP -Comp Program (Version 1.06), as well as possible public and environmental receptors within the area have been provided to the County LEPC (Local Emergency Planning Committee) to assist them in their planning.   \n\nAlternative release scenario:\n\nThere has not been an actual release of Anhydrous Ammonia during the last 5-years at the site.  We believe the most likely release would be caused by a break in a transfer hose.  Transfer hoses are protected by manual,  self closing excess flow , "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 36662,
      "SummaryText": "and \"pull away\" valves so our alternative release scenario is based on the loss of contents from the largest hose used (off loading transportation equipment).  \n\nAccidental Release Program:\n\nOur Anhydrous Ammonia accidental release program is based on guidelines found in the American National Standards Institute, Inc. (ANSI) standard K-61.1 \"Safety Requirements for the Storage and Handling of Anhydrous Ammonia; and the U.S. Occupational Safety and Health Administration (OSHA) standard 29CFR 1910.111 \"Storage and Handling of Anhydrous Ammonia\".   We conduct annual employee training on the safe handling, transportation and distribution of Anhydrous Ammonia, and have installed safety equipment including, but not limited to: Excess flow valves,  Breakaway couplers at risers,  Emergency shut-off valves,  Barriers to avoid damage by trucks or other vehicles, and Lock outs to prevent tampering when the site is unattended.   We also maintain routine contact with our local fire department and emergency response personnel; and have provided and/or participated in safety training exercises on Anhydrous Ammonia.  We have developed an Emergency Action Plan for employees, customers, and visitor protection in event of fire, explosion, tornado, and other acts of god that initiates evacuation, emergency medical care, contacts for assistance, etc. for all areas of our company including the Anhydrous Ammonia facility included in this plan.  The primary emergency coordinator is listed in the Registration Section of this document.  Any of the following additional individuals may be contacted in the event the primary emergency coordinator cannot be reached:\n\n           Name                             Phone:    Work                       Home  \n\n           Kent Meyer                                 402-352-5370        402-615-2176           \n           David A. Jarecki                            402-993-2236         402-993-6650\n\nFive - Year Accident History:\n\nThere has not been a releas"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 36662,
      "SummaryText": "e of Anhydrous Ammonia within the past five years that has caused any death, injuries, or significant property damage at the facility; nor to our knowledge have resulted in offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\nEmergency Response Program:\n\nThis facility is included in the written Community Emergency Response Plan as prepared by  the Local Emergency Planning Committee (LEPC), and the Nebraska Emergency Management Agency (NEMA) (former Nebraska State Civil Defense Agency).  We also include these materials in our own Emergency Action Plan in accordance with OSHA Standard 29CFR 1910.38.   We have provided State and Local authorities all Community Right-to-Know information requested as well as that required under SARA Title III  (EPCRA).  Our written employee safety programs include pre-emergency planning and employee training in accordance with OSHA standards, and are offered for review at any time by our Local Emergency Planning Committee (LEPC) to ensure they conform to the community plan(s).  We actively encourage participation in our Anhydrous Ammonia and Propane training programs by the local fire department(s), local emergency response team, community planners, etc. that may be expected to respond to an incident at our site.  \n\nPlanned changes to improve safety:\n\nSafety improvement is an on-going process at all of our facilities.  Periodic evaluations are performed to assess the maintenance of safe conditions.  There are no additional specific recommendations for implementation at this time. \n\nAdditional Information:\n\nFor  additional information, response to questions, or comments,  please contact:      \n\n         Lynn Anderson, Asst. Gen. Mgr.  Columbus, NE        Phone 402-563-3636                                          .\n\n{end}"
    }
  ]
}