{
  "FacilityID": 36724,
  "FacilityName": "H.B. Fuller - Covington Plant",
  "FacilityStr1": "12110 Harland Drive N.E.",
  "FacilityStr2": null,
  "FacilityCity": "Covington",
  "FacilityState": "GA",
  "FacilityZipCode": "30014",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13217",
  "LEPC": "none",
  "FacilityLatDecDegs": "33.617778",
  "FacilityLongDecDegs": "-083.831389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.hbfuller.com",
  "FacilityEmailAddress": "nate.ranford@hbfuller.com",
  "FacilityDUNS": 152845020,
  "ParentCompanyName": "H.B. Fuller",
  "Company2Name": null,
  "CompanyDUNS": 6159776,
  "Company2DUNS": 6159776,
  "OperatorName": "H.B. Fuller",
  "OperatorStr1": "P.O.Box 64683",
  "OperatorStr2": null,
  "OperatorCity": "St. Paul",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55164",
  "OperatorZipCodeExt": "0683",
  "FTE": 40,
  "OtherEPAFacilityID": "30014FULLE12110",
  "EPAFacilityID": "100000060836",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-02-06 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-12 16:32:08",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 33.617778,
  "FRS_Long": -83.831389,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 52924,
      "AltID": "VAM Storage",
      "FacilityID": 36724,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 70037,
          "ProcessID": 52924,
          "ChemicalID": 29,
          "Quantity": 1600000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 54130,
          "ProcessID": 52924,
          "NAICSCode": "32552",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 30512,
              "Process_NAICS_ID": 54130,
              "SafetyReviewDate": "2008-09-05 00:00:00",
              "PHA_Date": "2008-09-05 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2010-10-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-09-05 00:00:00",
              "TrainingReviewDate": "2008-09-05 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-09-05 00:00:00",
              "EquipmentInspectionDate": "2009-05-15 00:00:00",
              "EquipmentTested": "Reactor 5",
              "ChangeMgmtDate": "2009-04-28 00:00:00",
              "ChangeMgmtReviewDate": "2007-03-23 00:00:00",
              "PreStartupReviewDate": "2009-04-28 00:00:00",
              "ComplianceAuditDate": "2008-06-10 00:00:00",
              "AuditCompletionDate": "2010-06-10 00:00:00",
              "IncidentInvestigationDate": "2009-03-19 00:00:00",
              "InvestigationChangeDate": "2009-08-28 00:00:00",
              "ParticipationPlansReviewDate": "2008-11-28 00:00:00",
              "HotWorkPermitReviewDate": "2008-10-21 00:00:00",
              "ContractorSafetyReviewDate": "2008-11-28 00:00:00",
              "ContractorSafetyEvalDate": "2008-11-28 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 44386,
                  "PreventionProgram3ID": 30512,
                  "ProcessChemicalID": 70037
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 36724,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-03-18 00:00:00",
    "ERTrainingDate": "2009-06-10 00:00:00",
    "CoordinatingAgencyName": "Covington Fire Department",
    "CoordinatingAgencyPhone": "7703852100",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 36724,
      "SummaryText": "02 notification requirements.  The following sections briefly describe the current elements of the release prevention program in effect for the VAM polymerization process.\n\nProcess safety information\nOur facility maintains records on safety information that describes the chemical hazards, operating parameters, and equipment designs associated with all covered processes.\n\nProcess hazards analysis\nOur facility conducts safety studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is the What if/Checklist combined.  The studies are undertaken by a team of facility personnel with expertise in engineering and process operations and are revalidated whenever necessary.  All findings related to the hazard analysis are addressed in a timely manner.\n\nOperating procedures\nFor the purposes of safely conducting activities within our covered process, the Covington plant maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, sequence of raw material additions, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and readily accessible to operators involved in the process.\n\nTraining\nThe plant has a training program in place to ensure that employees are competent in operating procedures associated with the VAM utilizing process.  Refresher training or operational evaluations are provided at least every year and more frequently as needed.\n\nMechanical Integrity\nThe facility carries out documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks include pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps.  Qualified personnel carry out maintenance operations.  These employees ar"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 36724,
      "SummaryText": "e offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of change\nWritten procedures are in place at the Covington plant to manage changes in process chemicals, technology, equipment, and procedures.  Process operators, maintenance personnel, or any other employee whose job tasks are affected by a modification in process conditions are promptly informed and retrained if necessary.\n\nPre-startup reviews\nPre-startup safety reviews related to new processes and to modifications in established operations are conducted at the Covington plant.  These reviews are conducted to confirm that construction, equipment, operating, and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nThe company conducts audits on a regular basis to determine whether the provisions set out under the RMP and PSM rules are being implemented.  These audits are carried out at least every 3 years and any corrective actions required are undertaken in a safe and prompt manner.\n\nIncident investigation\nThe Covington plant promptly investigates any incident that has resulted in a reportable release of VAM.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee participation\nThe plant believes that process safety management and accident prevention is a team effort.  Employees are encouraged to express their views during monthly safety meetings concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the OSHA Hazard Communications, PSM, and RMP rules, including information resulting from the process hazards analysis.\n\nContractors\nOn occasion, the plant hir"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 36724,
      "SummaryText": "Executive Summary\n\n1.0 Accidental release prevention and emergency response policies \nWe, at the H.B. Fuller's Covington plant, are committed to employee, public, and environmental safety.  Our various accidental release prevention programs covering areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility demonstrate our commitment.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances as well as adhere to all applicable federal and state regulations.\n\n2.0 The stationary source and the regulated substance handled\nThe facility's primary activity involves the polymerization of several monomers including Vinyl Acetate Monomer (VAM) and the production of water-based emulsions.  VAM is a key ingredient in the production of our emulsions and it is also a Clean Air Act Amendments (CAA) section 112(r) regulated substance. The maximum amount of VAM stored in the three storage tanks is 702,000 pounds. VAM is received by truck and railcar transport and stored in three storage tanks. The raw material is subsequently metered through a series of pipes and pumps and is ultimately polymerized in the manufacturing process.  Other chemicals are combined with the polymerized monomer such as water, stabilizers, initiators, and post additives to produced the finished product emulsion.  Access to the site is restricted to authorized facility employees, management personnel and contractors.  Visitors are escorted while touring the plant. \n\n3.0 The general accidental release prevention program and chemical-specific prevention steps\nOur Covington facility has taken all the necessary steps to comply with the accidental release prevention requirements described in 40 CFR part 68.  Our emulsion manufacturing process utilizing VAM is subject to the OSHA Process Safety Management (PSM) standard under 29 CFR 1910.119.  Our facility is also subject to EPCRA section 3"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 36724,
      "SummaryText": "es contractors to conduct specialized maintenance and construction activities.  The Covington plant maintains a policy of informing the contractors of known potential hazards related to the contractors work and operation within our facility.  Contractors are also informed of all procedures for emergency response should an accidental release of VAM occur.\n\n4.0 Five-year accident history\nThis facility has had an excellent record in preventing accidental releases.  Due to our various release prevention programs, there has been no reportable accidental releases (as defined in 40 CFR 68.42) during the last 5 years. \n\n5.0 The emergency response program\nThe Covington plant carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and available medical treatment, evacuations, and notification of local emergency response agencies.  \n\nTo ensure proper operations, our emergency response equipment such as the sprinkler system, fire extinguishers, and fire detection systems are regularly inspected and serviced.  In addition, the plan is updated to reflect any pertinent changes occurring within our process that would require a modified emergency response.\n\n6.0 Planned changes to improve safety\nThe Covington plant continues to periodically evaluate the safety effectiveness of its equipment and total process through our preventive maintenance program, process hazards analysis updates, and the management of change procedures.  These programmatic structures, as well as suggestions generated by employee involvement teams have led to several changes improving safety overall.  We plan to continue this safety enhancement process and implement appropriate improvements whenever possible."
    }
  ]
}