{
  "FacilityID": 37246,
  "FacilityName": "Prairie Farms Dairy - Carlinville, IL",
  "FacilityStr1": "1100 North Broadway",
  "FacilityStr2": null,
  "FacilityCity": "Carlinville",
  "FacilityState": "IL",
  "FacilityZipCode": "62626",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17117",
  "LEPC": "Macoupin County LEPC",
  "FacilityLatDecDegs": "39.293056",
  "FacilityLongDecDegs": "-089.879167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6312995,
  "ParentCompanyName": "Prairie Farms Dairy",
  "Company2Name": null,
  "CompanyDUNS": 6312995,
  "Company2DUNS": null,
  "OperatorName": "Prairie Farms",
  "OperatorStr1": "1100 North Broadway",
  "OperatorStr2": null,
  "OperatorCity": "Carlinville",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62626",
  "OperatorZipCodeExt": null,
  "FTE": 140,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000100455",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-01-05 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 39.292623,
  "FRS_Long": -89.87952,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 53654,
      "AltID": "Refrigeration System",
      "FacilityID": 37246,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 70888,
          "ProcessID": 53654,
          "ChemicalID": 56,
          "Quantity": 10500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 54887,
          "ProcessID": 53654,
          "NAICSCode": "311511",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 30888,
              "Process_NAICS_ID": 54887,
              "SafetyReviewDate": "2003-06-05 00:00:00",
              "PHA_Date": "2004-06-18 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2005-06-18 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-06-16 00:00:00",
              "TrainingReviewDate": "2003-06-05 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-06-05 00:00:00",
              "EquipmentInspectionDate": "2004-06-21 00:00:00",
              "EquipmentTested": "Most system components are visually inspected daily.  Major vessels, compressors, etc. are subjected to additional inspections/tests per manufacturer recommendations.",
              "ChangeMgmtDate": "2001-05-01 00:00:00",
              "ChangeMgmtReviewDate": "2003-06-05 00:00:00",
              "PreStartupReviewDate": "2001-05-01 00:00:00",
              "ComplianceAuditDate": "2003-06-05 00:00:00",
              "AuditCompletionDate": "2005-03-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-06-05 00:00:00",
              "HotWorkPermitReviewDate": "2003-06-05 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2003-06-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 44856,
                  "PreventionProgram3ID": 30888,
                  "ProcessChemicalID": 70888
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 37246,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Carlinville Fire Department",
    "CoordinatingAgencyPhone": "2178542813",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 37246,
      "SummaryText": "ystem.  The PHA addressed:  (1) process hazards; (2) previous incidents; (3) engineering and administrative controls applicable to the hazards; (4) the consequence of control failure; (5) facility siting; (6) human factors; and (7) a qualitative evaluation of possible safety and health effects of control system failures.  The PHA will be updated and revalidated every five years.\r\n\r\n* Written operating procedures (OPs) were prepared to provide the basis for proper and safe operation of the ammonia refrigeration system.  The OPs include procedures for normal operation, startup, shutdown, emergency operation, and emergency shutdown.  They also describe safe operating limits for temperature and pressure, the consequences of operating outside these safe operating limits, and a description of safety systems and how they operate.\r\n\r\n* Refrigeration system operators receive refresher training at least every three years.  The training content is based upon the process safety information and operating procedures.  The training program ensures that the operators understand the nature and causes of problems arising from system operations and serves to increase awareness with respect to the hazards particular to ammonia and the refrigeration process.\r\n\r\n* Formal authorization systems (i.e., management of change procedure, pre-startup safety review) are in place to ensure that system changes or expansions are as safe as the original design and that an independent recheck, prior to start-up, confirms that the changes are consistent with the engineering design and safety requirements.  \r\n\r\n* Events that might (or did) cause an accidental or unexpected release of ammonia are subjected to a formal investigation.  The objective of the investigation is to correct deficiencies in such a way as to prevent recurrence.\r\n\r\n* Contractors that are hired to work on, or adjacent to, the refrigeration system are pre-qualified based upon their knowledge of ammonia refrigeration, understanding o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 37246,
      "SummaryText": "illers.  Ammonia liquid which collects in the high side accumulator is returned to the system by a pumper drum.  \r\n\r\nThe major discharge from the high side compressors (hot gas) enters three roof-mounted condensers.  A portion of the hot gas is also used for defrosting and for operation of the pumper drums.\r\nThe condensed liquid is returned to the high pressure receiver where it is fed to the refrigeration equipment.  Various safety systems are part of the anhydrous ammonia refrigeration system.  These include pressure relief valves, engine room ventilation, and safety interlocks.\r\nPressure relief valves protect the compressor discharge, condensers, pumper drums, and suction accumulators from over pressurization.\r\nSafety interlocks include high pressure and high temperature alarms and cut outs for the compressors as well as high level floats and sensors for the vessels.  The high pressure cut-outs for the compressors are set at 225 psig.  The system also includes a solenoid-operated liquid (King) valve which is controlled and shut down from the Watkins accumulator controls.\r\n\r\nThe refrigeration system is a totally closed system.  Historically, releases of ammonia from industrial refrigeration systems most often occur from leaking valves, malfunctioning pressure relief devices, or inadvertent releases during repair activities.  While these incidents can impact employees, they seldom lead to a release of a reportable quantity or represent an off-site impact (i.e., beyond the property line).  Moreover, a release of ammonia that could affect the environment is unlikely for the following reasons:\r\n\r\n* Many of the high pressure liquid lines are located in enclosed areas that could help to contain such a release, and the outside piping is elevated to promote dispersion;\r\n\r\n* Industrial standards were followed for the manufacture and quality control of these lines;\r\n\r\n* Ammonia is not corrosive in this service;\r\n\r\n* Most of the lines are elevated to minimize potential dam"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 37246,
      "SummaryText": "age from fork lifts;\r\n\r\n* The facility has a preventive maintenance program in place to maintain the ongoing integrity of the system;\r\n\r\n* The facility has a training program designed to ensure that the system is operated by qualified personnel; and\r\n\r\n* The facility has emergency response procedures which enable trained personnel to respond quickly to isolate any potential releases by closing valves in the liquid lines.\r\n\r\n2.0    PREVENTION PROGRAM\r\nThe facility has carefully considered the potential for accidental releases of ammonia, such as the occurrence of the worst-case and alternative-release scenarios required by 40 CFR 68.  To help minimize the probability and severity of an ammonia release, a prevention program that satisfies the Occupational Safety and Health Administration (OSHA), Process Safety Management (PSM) of Highly Hazardous Chemicals  standard (29 CFR 1910.119) has been implemented.  The key components of the prevention program are summarized below:\r\n\r\n* The development, documentation, and operator availability of critical process safety information regarding the hazards of ammonia, the design basis of the system, and the equipment.  This information is used to fully understand and safely operate the ammonia refrigeration system.\r\n\r\n* The development of an extensive employee participation program, which includes employees from all levels of the organization and from all areas within the plant (i.e., production and maintenance).  This program also assures that employees that utilize the ammonia system and are most knowledgeable about it are best able to easily, effectively, and regularly recommend changes or improvements which enhance safety.\r\n\r\n* The performance of a formal process hazard analysis (PHA), using the What-if/checklist technique.  A team with expertise in engineering, operations, maintenance, and safety evaluated the existing refrigeration system in depth and developed recommendations to improve the safety and operability of the s"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 37246,
      "SummaryText": "f applicable codes and standards, and their demonstrated ability to work safely.  \r\n\r\n* Prior to the performance of any hot work (i.e., spark or flame producing operations such as welding, cutting, brazing, grinding), management must approve the work by executing a written hot work authorization permit to verify that precautions to prevent fire have been implemented.\r\n\r\n* Periodic formal walk-throughs occur to find unusual or increasing vibration, incipient leaks, or other indications of potential upsets or failures that could lead to a release.\r\n\r\n* Replacement of all pressure relief valves occurs every five years.\r\n\r\n* Numerous safety systems, including pressure relief valves, ammonia vessel level controls, and safety interlocks are used in the refrigeration system.\r\n\r\n* Periodic inspections are performed for major powered equipment, including compressors, pumps and large fans, bearings, couplings, shaft seals, mountings, etc., for vibration or incipient mechanical failure.\r\n\r\n* Proper design, including adherence to recognized safety codes.\r\n\r\n* Adherence to fire codes and preparation for fires, storms, or events which could impact the ammonia system.\r\n\r\n* Planning with the local fire department to ensure a rapid response to potential incidents involving the system or external events, such as storms or tornadoes.\r\n\r\n* Prevention program compliance audits are performed to verify that the elements are being properly implemented.  Any deficiency found in an audit is corrected.\r\n\r\n3.0    ACCIDENT HISTORY\r\nThere have been no accidental releases of ammonia at the facility in the last five years (since June 1999) that have resulted in death, injury, or significant property damage on-site or off-site death, injury, evacuation, sheltering in place, property damage, or environmental damage.  \r\n\r\n4.0    EMERGENCY RESPONSE PROGRAM\r\nThe facility has implemented a detailed written Emergency Action Plan (EAP).  The EAP is intended to address all emergencies at the facility, in a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 37246,
      "SummaryText": "ddition to incidents related to a release of ammonia.\r\n\r\nThe EAP includes awareness and response training for employees, coordination with the local fire department, and evacuation of the facility.  The plan details what personal protective equipment and spill response equipment is available; identifies specific individuals, their 24-hour telephone numbers, and their responsibilities; identifies procedures for emergency medical care; and refers to other pertinent elements of the management system (i.e., standard operating procedures).\r\n\r\n5.0\tPLANNED CHANGES TO IMPROVE SAFETY\r\nThe prevention program that is described in Section 2.0 of this Executive \r\nSummary is a management system that is designed to proactively identify, \r\nevaluate, and reduce the potential for a ammonia release and/or a release's \r\nimpact or consequence, due to failures in process, procedures, and \r\nequipment.  As safety improvements are identified by the management \r\nsystem they are evaluated and, where appropriate, implemented.  For \r\nexample, the facility may implement the following changes to further improve the safety of the process:\r\n\r\n* Additional training,\r\n* Periodic repair and replacement of equipment, and\r\n* Continued implementation and improvement of the PSM program."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 37246,
      "SummaryText": "Executive Summary\r\n\r\n1.0 Source and Process description\r\n\r\nThe Prairie Farms Dairy in Carlinville, Illinois is subject to the USEPA's Risk Management Program (RMP) for Accidental Chemical Release regulation (40 CFR 68) because it has a refrigeration system that contains more than the threshold quantity (10,000 pounds) of anhydrous ammonia (CAS Number 7664-41-7).  Anhydrous ammonia (NH3), is a gas at ambient conditions.  The anhydrous ammonia (ammonia) refrigeration system is used to manufacture and store milk and related dairy products.  It is a closed system that contains approximately 10,500 pounds (Le., 2,100 gallons) of ammonia in various physical states (gas, liquid, and saturated vapor).  The largest vessel is the high pressure receiver that operates at approximately 150 psig and can contain as much as 3,600 pounds of liquid ammonia (at its maximum safe fill volume of 90%).  However, during typical operation, the vessel contains only 2,800 pounds of ammonia.  Most of the ammonia equipment is located indoors.  The condensing towers, receiver, accumulator, and some piping runs are located outdoors.  The Carlinville plant is located in a urban setting.\r\n\r\nAmmonia is the oldest and most common refrigerant in general industrial use throughout the world.  It is a high capacity refrigerant that operates at reasonable pressure.  Although exposure to ammonia is irritating and potentially toxic in large doses, personnel exposure to more than a small leak is rare because ammonia operates within a closed system of vessels, piping, and equipment. In addition, ammonia can be easily detected by smell at levels well below its toxic endpoint.\r\n\r\nThe anhydrous ammonia refrigeration system at the Carlinville plant is a single-stage system consisting of a discharge (high pressure) side and a suction side.  \r\nThe compressors draw suction from the high side suction accumulator (Watkins) at about 25 psig. This accumulator receives suction from the ice builders, cooler units, and ch"
    }
  ]
}