{
  "FacilityID": 37249,
  "FacilityName": "Putnam Water Treatment Plant-Aquarion Water Co.",
  "FacilityStr1": "10 DeKraft Road",
  "FacilityStr2": null,
  "FacilityCity": "Greenwich",
  "FacilityState": "CT",
  "FacilityZipCode": "06830",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "09001",
  "LEPC": "Southwest Ct LEPC",
  "FacilityLatDecDegs": "41.082389",
  "FacilityLongDecDegs": "-073.638917",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "www.aquarion.com",
  "FacilityEmailAddress": "environment@aquarionwater.com",
  "FacilityDUNS": 6916530,
  "ParentCompanyName": "Aquarion Company",
  "Company2Name": null,
  "CompanyDUNS": 50633890,
  "Company2DUNS": 0,
  "OperatorName": "Aquarion Water Company of Conn.",
  "OperatorStr1": "10 DeKraft Road",
  "OperatorStr2": null,
  "OperatorCity": "Greenwich",
  "OperatorStateFIPS": "CT",
  "OperatorZipCode": "06830",
  "OperatorZipCodeExt": null,
  "RMPContact": "David Medd",
  "RMPTitle": "Manager, Supply Operations",
  "FTE": 17,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000091465",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-10-24 00:00:00",
  "DeRegistrationEffectiveDate": "2013-10-21 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 41.08239,
  "FRS_Long": -73.63892,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 53658,
      "AltID": null,
      "FacilityID": 37249,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 54891,
          "ProcessID": 53658,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 70894,
          "ProcessID": 53658,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 570894,
          "ProcessID": 53658,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 37249,
      "SummaryText": "The  Aquarion Water Company of Connecticut Putnam Filter Plant is a water treatment plant that provides drinking water to customers in the area of Greenwich, Connecticut. To ensure that our water remains safe throughout the distribution system to every tap, the plant adds a small amount of chlorine as a disinfection agent.\n\nThe concentrated form of chlorine is liquefied and stored in shipping containers. Before it is mixed with water, chlorine can be extremely hazardous if released to the air.  \n\nAquarion Water Company of Connecticut is committed to protecting its employees, the public, and the environment from any releases of hazardous materials used at its facilities.  We have implemented safety, environmental protection, and risk management programs to prevent hazardous materials releases.  If there is an accidental release, we will immediately call for emergency response to minimize the effect of the release and notify the public of any actions necessary to ensure public protection, through emergency management agencies.\n\nAccidental Release Prevention Steps\n\nTo ensure that a chemical release does not occur, the Putnam Plant maintains a release prevention program with the primary focus of protecting plant employees and the public from the hazards associated with an accident or release involving chlorine. The prevention program has twelve elements designed to meet both EPA and OSHA Process Safety Management requirements.\n\nAquarion Water Company of Connecticut is committed to personnel safety, public safety, continued reliable operation and regulatory compliance.  Based on this commitment, the Manager of Supply Operations has assumed overall responsibility for the development and implementation of the Risk Management Program.  Other key plant supervisory staff also have clearly defined accountability and responsibility for each of the prevention program elements to meet both EPA and OSHA Process Safety Management requirements.\n\nOur prevention measures include the u"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 37249,
      "SummaryText": "se of:\n\n?vacuum regulators mounted directly on the chlorine containers that automatically shut down the flow of chlorine if there is a leak on piping or equipment;\n?chlorine detectors and alarms to rapidly alert operators to any problems;\n?process safety information to document the safe process design;\n?process hazards analyses to evaluate the chemical and process hazards;\n?operating procedures to ensure that the system is operated safely;\n?maintenance, inspection and testing to ensure that the system is maintained according to applicable standards and manufacturer's recommendations;\n?training, hot work permits, contractor safety and employee participation programs to ensure that all employees and contractors working on and around the processes are aware of the hazards, can perform their job duties safely and know the actions to be taken in an emergency;\n?management of change and pre-startup safety reviews to ensure that changes are documented, analyzed and kept within the design basis;\n?incident investigation procedure to investigate each incident and \"near misses\" to determine root causes and make needed safety improvements;\n?and periodic compliance audits to ensure that our programs are working as they should to protect both employees and the public.\n\nFive-Year Accident History\n\nWithin the past five years, the Putnam Plant has not had any accidental releases that resulted in injuries or property damage.\n\nEmergency Response\n\nIn the event that a chlorine release does occur, the Putnam Plant has an emergency response program that coordinates emergency response with the regional emergency management agency and the Local Emergency Planning Committee. If such a release did occur, plant personnel would contact the local emergency responders who would dispatch a trained HAZMAT team to the site to handle the chlorine release. \n\nPlanned Changes to Improve Safety\n\nWe continually work to safely manage the hazards of chlorine to protect our employees and the community we serv"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 37249,
      "SummaryText": "e. The Risk Management Program will be maintained to reduce the risk of accidental releases and each year we will conduct training, review procedures, maintain the equipment and follow safe work practices. Periodically, we will audit our program, review our Process Hazard Analysis and coordinate with the community emergency response organization. We have recently assessedg further safety enhancements to the facility and are in the process of implementing them. We continue this process on an ongoing basis."
    }
  ]
}