{
  "FacilityID": 37242,
  "FacilityName": "SUMCO Phoenix, Albuquerque Division",
  "FacilityStr1": "9401 San Mateo Boulevard NE",
  "FacilityStr2": null,
  "FacilityCity": "Albuquerque",
  "FacilityState": "NM",
  "FacilityZipCode": "87113",
  "Facility4DigitZipExt": "2232",
  "FacilityCountyFIPS": "35001",
  "LEPC": "Bernalillo LEPC",
  "FacilityLatDecDegs": "35.194026",
  "FacilityLongDecDegs": "-106.587407",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.sumcousa.com",
  "FacilityEmailAddress": "president@sumcousa.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "SUMCO USA",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "SUMCO Phoenix",
  "OperatorStr1": "9401 San Mateo Boulevard NE",
  "OperatorStr2": null,
  "OperatorCity": "Albuquerque",
  "OperatorStateFIPS": "NM",
  "OperatorZipCode": "87113",
  "OperatorZipCodeExt": "2232",
  "FTE": 178,
  "OtherEPAFacilityID": "87113SMTCM9401",
  "EPAFacilityID": "100000036588",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 35.194026,
  "FRS_Long": -106.587407,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 53646,
      "AltID": "HCL Trailer",
      "FacilityID": 37242,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 70877,
          "ProcessID": 53646,
          "ChemicalID": 53,
          "Quantity": 3000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 54877,
          "ProcessID": 53646,
          "NAICSCode": "334413",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 54878,
          "ProcessID": 53646,
          "NAICSCode": "49319",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 30881,
              "Process_NAICS_ID": 54878,
              "SafetyReviewDate": "2004-02-05 00:00:00",
              "PHA_Date": "1999-03-16 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "Yes",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-03-16 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-03-02 00:00:00",
              "TrainingReviewDate": "2004-03-02 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-01-28 00:00:00",
              "EquipmentInspectionDate": "2004-06-07 00:00:00",
              "EquipmentTested": "HCL System",
              "ChangeMgmtDate": "2003-12-04 00:00:00",
              "ChangeMgmtReviewDate": "2003-11-10 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2003-08-18 00:00:00",
              "AuditCompletionDate": "2003-11-06 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-09-01 00:00:00",
              "HotWorkPermitReviewDate": "2003-12-18 00:00:00",
              "ContractorSafetyReviewDate": "2004-06-07 00:00:00",
              "ContractorSafetyEvalDate": "2000-09-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 44846,
                  "PreventionProgram3ID": 30881,
                  "ProcessChemicalID": 70877
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 53647,
      "AltID": "Trichlorosilane",
      "FacilityID": 37242,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 70878,
          "ProcessID": 53647,
          "ChemicalID": 153,
          "Quantity": 1000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 54879,
          "ProcessID": 53647,
          "NAICSCode": "334413",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 54880,
          "ProcessID": 53647,
          "NAICSCode": "49319",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 37242,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-02-05 00:00:00",
    "ERTrainingDate": "2004-06-03 00:00:00",
    "CoordinatingAgencyName": "Albuquerque Fire Department",
    "CoordinatingAgencyPhone": "5052436601",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 37242,
      "SummaryText": "SUMCO Phoenix, Albuquerque Division¿Risk Management Plan\n\n1 Executive Summary\n\nAccidental Release Prevention and Emergency Response Policies\nSUMCO Phoenix, Albuquerque Division, Inc. (SUMCO) is committed to employee, public and environmental safety. This commitment is demonstrated by our comprehensive, documented inspection, maintenance, and training programs. Written procedures are in place for preventing accidental releases.\n\nSUMCO also has a thorough emergency response plan and a trained emergency response team. Our emergency response procedures have been distributed to medical facilities and responding agencies. The emergency response team undergoes special training and conducts regular drills.\n\nSource and Regulated Substances \nThe facility¿s primary activity is silicon wafer preparation. We have one regulated substance, anhydrous hydrogen chloride, present at our facility. It is stored in a tube trailer of 21,000 pound capacity and used in gaseous form for wafer preparation.\n\nWorst Case Release and Alternative Release Scenarios\nTo perform the required offsite consequence analysis for the facility, SUMCO used EPA¿s RMP Comp software, Bowman Engineering¿s implementation of SLAB, and EPA¿s current guidance for offsite consequence analysis. Modeling parameters were as recommended by EPA in their guidance document for offsite consequence analysis. We evaluated three release scenarios; the artificial worst-case scenario mandated by EPA, and two realistic alternative release scenarios. These scenarios have off-site consequences.\n\nThe nominal worst-case release scenario is a catastrophic release from a single tube of the trailer, resulting in a release of 3000 pounds of HCl. Modeled as a 10-minute release occurring under conditions of F stability, 1.5 m/s wind speed, and a temperature of 77 F, the calculated affected radius to the endpoint of 0.03 mg/L is 3.4 miles. Of course, this scenario is based on illogical meteorological assumptions.\n\nEssentially all releases are"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 37242,
      "SummaryText": "flow limited by the diameter of the piping, 3/4¿. Therefore the first alternative release scenario evaluated here is a continuous release through a 3/4¿ diameter pipe under conditions of D stability, 3 m/s wind speed, and an ambient temperature of 77 F, the RMP Comp defaults for alternative releases and a much more realistic meteorological situation. This scenario is a more realistic version of the worst-case scenario. This alternative release was evaluated with SLAB, a dense gas model more suitable for this type of release than RMP Comp. This alternative release scenario results in a release rate of 432 lbs/min, and will empty a 3000 lb tube in 7 minutes. The calculated affected radius to the endpoint is 0.55 miles.\n\nAnother, even more realistic alternative release scenario was also considered, that of a leak through a 1/8¿ hole or tube. This scenario results in a release rate of 6.46 lbs/min and was also modeled with SLAB using the RMP Comp defaults and results in a calculated affected radius to the endpoint of 0.15 miles.\n\nAccidental Release Prevention Program \nThe facility has taken all necessary steps to comply with the accidental release prevention requirements established at 40 CFR 68. The facility was designed and constructed in accordance with all standards in effect at the date of construction, 1994. The facility is subject to EPCRA Section 302 notification requirements. A number of processes are subject to the OSHA PSM standard, 29 CFR 1910.119. The RMP release prevention program is based on the OSHA PSM program. The following sections briefly describe the elements of the release prevention program that is in place at the facility.\n\n2 Process Safety Information\nSUMCO maintains detailed records of safety information for all processes. Employees participate in regular safety meetings. The extent and degree of participation varies depending on the level of involvement required of the employee. Employee suggestions and information relating to process safety"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 37242,
      "SummaryText": "is solicited at these meetings. Employees are consulted for information used in developing operating procedures and specifications. Employees are advised of hazards through routine training and by their supervisors.\n\n3 Process Hazard Analysis\nA process hazard analysis of the affected process, the HCl tube trailer and gas supply system, was conducted prior to installation by Air Products Company, the supplier and operator of the HCl supply system. The hazard analysis was conducted using the ¿What if?¿, checklist, fault tree, and HAZOP methodologies. \n\nSUMCO also conducted an independent process hazard analysis of the covered process in March 1999 using the ¿What-if?¿ methodology. The hazard analysis was performed by a team of qualified personnel with expertise in engineering and process operations and will be re-validated periodically.\n\n4 Operating Procedures\nEach significant activity involving a covered process is described in a written procedure or specification. Employees involved in covered processes are consulted regarding the development and revision of operating procedures. Employees are advised of changes in operating procedures through routine training and by their supervisors. Operating and maintenance procedures are thoroughly documented are reviewed at least annually.\n\n5 Training\nSUMCO provides general and job-specific training to employees, including initial training and periodic refresher training. Information gathered through job hazards analyses is integrated with other sources of information such as ongoing health and safety reviews and surveys and regulatory requirements and incorporated into the initial and refresher training. In addition to the ongoing training, supervisors are apprised of immanent hazards as information develops so that they can convey the information to employees. \n\n6 Mechanical Integrity\nSUMCO has written specifications describing each significant activity or equipment involved in a covered process. Employees involved with proc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 37242,
      "SummaryText": "ess equipment receive the necessary training to ensure the integrity of process vessels, piping, and other containment. Employees are expected to report hazards, conditions, or acts that may compromise the mechanical integrity of processes involving hazardous materials.\n\n7 Management of Change\nWritten procedures are in place at SUMCO to manage changes in process chemicals, technology, equipment and procedures. Affected employees receive the necessary training to continue to work safely and effectively when processes, materials, equipment, and procedures involving hazardous materials are changed. MSDSs are maintained for all hazardous materials used at the facility. Equipment-, task-, and location-specific training is provided for all employees. Employees are expected to report hazards immediately. Reported hazards and employee concerns are addressed in the ongoing training.\n\n8 Pre-startup Reviews\nBefore a process involving hazardous materials is initiated or significantly changed, the change is reviewed by the Environmental, Health and Safety Department. Comments of employees associated with the process are welcomed during the review. The results of the EH&S review are communicated to employees associated with the process.\n\n9 Compliance Audits\nSUMCO conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out at least every 3 years. Employees are interviewed in conjunction with compliance audits. Specifications, procedures, and training programs may be revised as a result of audit findings. Employees will be appraised of the revised specifications or procedures or re-trained as necessary.\n\n10 Incident Investigation\nSUMCO takes accidents and near-misses seriously. All incidents which result in or could reasonably result in a catastrophic release of a highly hazardous chemical are investigate immediately and thoroughly by Environmental/Health and Safety and other departments as ap"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 37242,
      "SummaryText": "propriate. At least one employee, contractor, or other person with specific knowledge of the covered process will be involved in the incident investigation. Incident investigation will begin as soon as practical, and no later than 48 hours after an incident involving a covered process. All reports are retained for a minimum of 5 years.\n\n11 Employee Participation\nSUMCO believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements SUMCO has extensive employee communication programs, training programs, and procedures in place which satisfy the RMP requirements for covered processes. \n\n12 Contractors\nSUMCO contractors are required to implement OSHA-compliant safety programs. Contractors are advised of hazards specific to their work by the SUMCO staff overseeing the contractor work. Contractors are expected to report hazards, unsafe acts or conditions immediately. Contractors may participate in safety training if appropriate.\n\nFive-year Accident History\nThere have been no accidental releases since the facility was constructed.\n\nEmergency Response Plan\nSUMCO has a comprehensive emergency plan fully compliant with 29 CFR 1910.38(a). The emergency plan includes procedures for responding to small releases of highly hazardous chemicals. The plan also includes responding to hazardous waste emergencies. \n\nSUMCO maintains an Emergency Response Team (ERT) composed of employees with special training in emergency response. ERT members receive refresher training and meet regularly. ERT members are encouraged to propose changes in procedures.\n\nPlanned Changes \nSUMCO is evaluating active mitigation systems such as a water deluge and scrubber system for the HCl storage trailer. The purpose of such a system is to greatly reduce the consequences of catastrophic failure by immediately neutralizing the bulk of the released material. While"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 37242,
      "SummaryText": "active systems cannot be considered in evaluating the artificial worst-case RMP scenario, in reality they will reduce the volume of released gas, and the corresponding consequences, by up to an order of magnitude for any feasible release scenario."
    }
  ]
}