{
  "FacilityID": 37274,
  "FacilityName": "Rayonier Performance Fibers LLC, Fernandina Mill",
  "FacilityStr1": "Foot of Gum Street",
  "FacilityStr2": null,
  "FacilityCity": "Fernandina Beach",
  "FacilityState": "FL",
  "FacilityZipCode": "32034",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12089",
  "LEPC": " Dept of Public Safety-Nassau",
  "FacilityLatDecDegs": "30.662500",
  "FacilityLongDecDegs": "-081.470000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "rayonier.com",
  "FacilityEmailAddress": "mike.bell@rayonier.com",
  "FacilityDUNS": 4056255,
  "ParentCompanyName": "Rayonier, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1265263,
  "Company2DUNS": 0,
  "OperatorName": "Rayonier Performance Fibers LLC",
  "OperatorStr1": "Foot of Gum Street",
  "OperatorStr2": null,
  "OperatorCity": "Fernandina Beach",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32034",
  "OperatorZipCodeExt": null,
  "RMPContact": "Stephanie Woodward",
  "RMPTitle": "Environmental Programs Engineer",
  "FTE": 300,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000050972",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0890004-005-AV",
  "SafetyInspectionDate": "2003-04-14 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "6-21-2004",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 30.66253,
  "FRS_Long": -81.47006,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 53690,
      "AltID": "Ammonia (anhydrous)",
      "FacilityID": 37274,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 54925,
          "ProcessID": 53690,
          "NAICSCode": "32211",
          "_desc": {
            "NAICS_CODE": "32211",
            "NAICS_DESCRIPTION": "Pulp Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 70926,
          "ProcessID": 53690,
          "ChemicalID": 56,
          "Quantity": 640000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 570926,
          "ProcessID": 53690,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 53691,
      "AltID": "Chlorine",
      "FacilityID": 37274,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 54926,
          "ProcessID": 53691,
          "NAICSCode": "32211",
          "_desc": {
            "NAICS_CODE": "32211",
            "NAICS_DESCRIPTION": "Pulp Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 70927,
          "ProcessID": 53691,
          "ChemicalID": 62,
          "Quantity": 1080000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 570927,
          "ProcessID": 53691,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 53692,
      "AltID": "Chlorine Dioxide",
      "FacilityID": 37274,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 54927,
          "ProcessID": 53692,
          "NAICSCode": "32211",
          "_desc": {
            "NAICS_CODE": "32211",
            "NAICS_DESCRIPTION": "Pulp Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 70928,
          "ProcessID": 53692,
          "ChemicalID": 71,
          "Quantity": 11000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 71,
            "ChemicalName": "Chlorine dioxide  [Chlorine oxide (ClO2)]",
            "CASNumber": "10049-04-4",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 570928,
          "ProcessID": 53692,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 53693,
      "AltID": "Sulfur Dioxide",
      "FacilityID": 37274,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 54928,
          "ProcessID": 53693,
          "NAICSCode": "32211",
          "_desc": {
            "NAICS_CODE": "32211",
            "NAICS_DESCRIPTION": "Pulp Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 70929,
          "ProcessID": 53693,
          "ChemicalID": 49,
          "Quantity": 772000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 570929,
          "ProcessID": 53693,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 37274,
      "SummaryText": "                            Table  of Contents\n                                                                                                                                                                           1.0    EXECUTIVE SUMMARY\n1.1    ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n1.2    STATIONARY SOURCE AND REGULATED SUBSTANCES\n1.3    OFFSITE CONSEQUENCE ANALYSIS - REMOVED\n1.4    PREVENTION PROGRAM - PROGRAM 3\n1.4.1    Process Safety Information\n1.4.2    Process Hazard Review\n1.4.3    Operating Procedures\n1.4.4    Training\n1.4.5    Mechanical Integrity\n1.4.6    Management of Change\n1.4.7    Pre-Startup Review\n1.4.8    Compliance Audits\n1.4.9    Incident Investigation\n1.4.10  Employee Participation\n1.4.11  Hot Work Permit\n1.4.12  Contractors\n1.5    FIVE-YEAR ACCIDENT HISTORY \n1.6    EMERGENCY RESPONSE PROGRAM\n1.7    PLANNED CHANGES TO IMPROVE SAFETY\n2.0    CERTIFICATION\n3.0    REGISTRATION\n\n\n\n1.0    EXECUTIVE SUMMARY\n\n1.1    ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nRayonier Performance Fibers Fernandina Mill is committed to the safety of workers and the public, and the preservation of the environment, through the prevention of accidental releases of hazardous substances.  Rayonier Performance Fibers Fernandina  Mill implements reasonable controls to prevent foreseeable releases of hazardous substances.  These controls include training programs for personnel; programs to help ensure safety in the design, installation, operation, and maintenance of processes; and programs to evaluate possible hazards.\n\nIn the event of an accidental release, Rayonier Performance Fibers Fernandina Mill implements policies and procedures to protect employees and prevent injury to the public and the environment.  Rayonier Performance Fibers Fernandina Mill provides \"First Responder\" training to responsible personnel, designates an emergency response coordinator to oversee response activities, and coordinates response efforts with the Na"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 37274,
      "SummaryText": "ssau County Emergency Management team and the local fire department.\n\n\n\n1.2    STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nRayonier Performance Fibers LLC, Fernandina Beach, Florida Mill is an ammonia-base dissolving sulfite pulp mill, which produces approximately 150,000 tons of highly purified specialty pulp annually.  To manufacture these quality pulps to specific customer specifications, Rayonier uses four chemicals subject the Risk Management Plan (RMP). The Fernandina Mill is classified as Source Industrial Code (SIC) 2611 and is consequently subject to the Program Level 3 requirements of RMP.  These same four substances are also subject to Process Safety Management (PSM) regulations and are listed below:  \n1. Ammonia (anhydrous)\n2. Chlorine\n3. Chlorine dioxide\n4. Sulfur dioxide (anhydrous)\nAmmonia and sulfur dioxide are used to make up cooking acid for pulps.  Chlorine and chlorine dioxide are used as bleaching chemicals in the process.\n\n\n\n1.3    OFFSITE CONSEQUENCE ANALYSIS\n\nReporting requirement removed. \n\n\n1.4   PREVENTION PROGRAM - PROGRAM 3\n\n1.4.1   Process Safety Information\n\nRayonier Performance Fibers Fernandina Mill has compiled written Process Safety Information (PSI) before conducting any process hazard analysis as required by the Process Safety Management (PSM) standard.  The PSM standard requirements for PSI are identical to those required by the RMP in 40 CFR 68.65.  This compilation of written process safety information enables Rayonier and the employees involved in operating the processes to identify and understand the possible hazards posed by those processes involving toxic substances.  PSI includes information pertaining to the hazards of the toxic substances used in the process, information pertaining to the technology of the process, and information pertaining to the equipment in the process.\n\nPSI has been collected and updated for Rayonier's four RMP process systems: ammonia (anhydrous), chlorine, chlorine dioxide, and sulfur dioxide. Ma"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 37274,
      "SummaryText": "terial Data Safety Sheets (MSDS), block flow diagrams, piping and instrumentation diagrams (P & ID's), and equipment information are stored in the PSM Information books and equipment files.\n\n1.4.2    Process Hazard Review\n\nRayonier?s Fernandina Performance Fibers Mill has performed an initial Process Hazard Analyses (PHA) on all four covered processes as well as periodic analyses as required by PSM.  The PSM standard requirements for PHA?s are identical to those required by the RMP in 40 CFR 68.67.  Initial PHA?s were completed by May 1997 for Rayonier?s four PSM/RMP process systems:  ammonia (anhydrous), chlorine, chlorine dioxide, and sulfur dioxide.  Revalidations are required at least every five years and began in 1999. \n\n\nOf the methods commonly used for analysis or reviews, the \"HAZOP\" and \"Checklist\" methods are typically used at the Fernandina mill.  PHA's identify, evaluate and control hazards involved the process.  Rayonier also has a system in place to address any findings and recommendations.  This system ensures that recommendations are:\n1.  Resolved in a timely manner,\n2.  Documented, and \n3.  Communicated to the affected employees. \n\n\n1.4.3    Operating Procedures\n\nRayonier's Fernandina Specialty Pulp Products Mill has developed, implemented, and maintains clearly written detailed procedures for safely operating and maintaining a process during all operating modes.  In addition to operating procedures, safe work practices have been developed and implemented for the control of hazards and include hot work, confined space entry, opening process equipment or piping, lockout/tagout, and control over the entrance into a stationary source.  These safe work procedures are in place and are reviewed and revised as needed, but at least on an annual basis.\n\n\n1.4.4    Training\n\nEach employee at Rayonier's Fernandina Specialty Pulp Products Mill involved in operating a covered process has been trained to operate it safely and understands the training.  They also h"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 37274,
      "SummaryText": "ave been trained in the safety and health hazards of each process as required by 40 CFR 68.71 and evaluated for understanding of the training by a written test and/or on the job training.\n\nRefresher training is provided every three years or more often if necessary.  Rayonier's Fernandina Specialty Pulp Products Mill also gathers input from the employees involved in operating covered processes to aid in determining the appropriate frequency of refresher training.  This input is normally accomplished by the use of surveys and or interviews. \n\n\n1.4.5    Mechanical Integrity\n\nRayonier's Fernandina Specialty Pulp Products Mill already has a mechanical integrity system in place due to the requirements of PSM.  Under the RMP rule 40 CFR 68.73, Rayonier has adopted this mechanical integrity system.  The system ensures that the process equipment and instrumentation are designed, constructed, installed, and maintained to minimize the risk of hazardous releases.  It includes written procedures, training, inspection, and testing, correcting system deficiencies and quality assurance.  These tasks are discussed further in the PSM Mechanical Integrity manual.\n\n\n1.4.6    Management of Change\n\nA Management of Change (MOC) system is in place at Rayonier to prevent changes in the process and supporting equipment from introducing unacceptable hazards to workers.  This MOC system has written procedures for managing changes, which need to be made to a PSM/RMP covered process.  The procedures require review prior to the change with a special emphasis on safety and training of employees and contractors.  Process Safety Information (PSI) and procedures must be updated when a change is made and is addressed with this MOC system.\n\n\n1.4.7    Pre-Startup Review\n\nPrior to starting up any new covered process or modified covered process, Rayonier performs a pre-startup safety review when the modification is significant enough to require a change in the process safety information.  This review ensu"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 37274,
      "SummaryText": "res all requirements are met before the introduction of any highly hazardous chemical into a new or modified process.  This review is done before startup just in case safety items have not been verified.  This final pre-startup review aids in making sure the changes in the system are ready for startup.  \n\n\n1.4.8    Compliance Audits\n\nAt least every three years, Rayonier evaluates the effectiveness of the PSM system.  Audits are performed to determine that the system complies with the provisions in the PSM standard and that the systems procedures and practices are adequate and are being followed.  PSM audits are retained until all action items are completed and two subsequent audits are performed.  Rayonier Performance Fibers Fernandina Mill?s most recent internal compliance audit for PSM / RMP was performed in June 2002. The most recent external compliance audit was conducted in April 2003 by the Florida Department of Community Affairs. \n\n\n1.4.9    Incident Investigation\n\nRayonier investigates every incident, which results in or could reasonably have resulted in a catastrophic release of a regulated substance.  The investigation starts as soon as possible but not later than 48 hours after an incident.  The incident report is then retained for five years.\n\n\n1.4.10    Employee Participation\n\nRayonier has developed a written plan of action regarding the implementation of employee participation in evaluating covered processes.  Rayonier consults with and involves employees and their representatives to obtain feedback to the details of each covered process.  This written plan is located in the PSM documentation.  Employees participate in PHA's, gathering information, incident investigations, training, written operating procedures, and the other elements as needed.\n\n\n1.4.11    Hot Work Permit\n\nRayonier issues hot work permits for any hot work operations conducted on or near covered processes.  Each permit documents that the fire prevention and protection requirements in 2"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 37274,
      "SummaryText": "9 CFR 1910.252 (a) have been implemented prior to beginning the hot work operations.  They also indicate the date(s) and time authorized for hot work and the identity of the object on which hot work is to be performed.  After the hot work job is completed, the area is inspected for any smoldering fire hazards.  If none are found, the hot work permit is closed out.  Each permit is kept on file until completion of the hot work operations and inspections.\n\n\n1.4.12    Contractors\n\nRayonier selects contractors who perform maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to a covered process by obtaining and evaluating their safety performance and programs.  Each contractor is informed of any known hazards related to the contractor's work and the process and any applicable emergency response procedures.  Rayonier has implemented safe work practices to control the entrance, presence, and exit of each contractor in covered process areas.  \nRayonier periodically evaluates the performance of each contractor in fulfilling their obligations.  Contractors are obligated to:\n1.  Assure that each contract employee is trained in the work practices necessary to safely perform his/her job;\n2.  Assure that each contract employee is instructed in the known potential fire, explosion, or toxic release hazards related to his/her job and the process, and all applicable emergency response procedures;\n3.  Document that each contract employee has received and understood the required training;\n4.  Assure that each contract employee follows safety rules and safe work practices;\n5.  Advise Rayonier of any unique hazards presented by the contractor's work or of any hazards found.\n\n\n1.5   FIVE-YEAR ACCIDENT HISTORY\n\nRayonier keeps thorough records for all significant accidental chemical releases which occur at the Fernandina facility.  RMP defines accidental releases from covered process as those that resulted in deaths, injuries, or significant property damage "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 37274,
      "SummaryText": "on-site, or known off-site consequences such as death, injury, evacuation, sheltering in place, property damage, or environmental damage. \n\nFor the five year reporting period, Rayonier Performance Fibers Fernandina Mill had no offsite consequences. No significant releases have occurred for any of the other three RMP chemicals (chlorine dioxide, sulfur dioxide, and ammonia) over the last five years.\n\n\n1.6   EMERGENCY RESPONSE PROGRAM\n\nRayonier has a written emergency response plan for the Fernandina facility to aid in safely responding to accidental releases of hazardous chemicals.  This emergency response plan includes procedures for:\n\n1.  Training responsible employees on procedures for being the \"First Responder\" in the event of a release.\n2.  Providing proper first aid and emergency medical treatment to treat accidental human exposure to hazardous substances.\n3.  Controlling and containing accidental releases of hazardous substances, including the use of emergency response equipment.\n4.  Informing the local Nassau County Emergency Management team, which is responsible for responding to accidental releases, which could reasonably result in off site consequences. \n5.  Procedures for informing the public when necessary. \n6.  Inspecting and maintaining emergency response equipment.\n7.  Reviewing and updating the emergency response plan.\n\nRayonier Performance Fibers Fernandina Mill maintains an emergency response team trained in these emergency response procedures.  All personnel are trained in evacuation procedures.  Rayonier periodically conducts emergency response drills.  The written emergency response plan complies with other federal contingency plan regulations [i.e. OSHA regulations 29 CFR 1910.38(a) and 29 CFR 1910.120(a)] and has been communicated to the local emergency response officials.  Rayonier Performance Fibers Fernandina Mill also maintains a regular dialogue with the local fire chief and routinely provides required information.\n\n\n1.7   PLANNED CHANGE"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 37274,
      "SummaryText": "S TO IMPROVE SAFETY\n\nRayonier Performance Fibers Fernandina Mill constantly strives to improve the safety of the workers and the community.  There are many systems in place to achieve this goal.  The \"Behavior Based Safety\" (BBS) program to improve overall safety performance is entitled \"H.A.W.K.\" (Halting Accidents With Knowledge). and is underway with a steering committee guiding the effort while training each employee.  The H.A.W.K. concept is based on changing worker behavior by individually conducting observations and providing feedback to other employees as they perform their duties.\n\nMajor efforts to improve safety are also underway with Rayonier's \"Job Safety Analysis\" (JSA) program.  The program consists of systematically analyzing jobs from a safety perspective.  This is accomplished by identifying all the jobs performed and breaking each job down into the steps taken to complete each task.  The potential accidents and hazards of each task are identified and recommendations are then provided on how to prevent these hazards from occurring.  Employees participate in this program by providing input on each analysis.  The resulting JSA's are used in training each employee on how to do the job safely.\n\nIncident investigations are also performed to improve safety.  These investigations are conducted whenever an incident has the potential to affect the safety of workers.  There is also a program to solicit safety suggestions from workers.  As a result of these activities, improvements can be achieved.  \n\nThe following is a list of process safety improvements, which are planned or have recently been completed.\n1. The emergency cut-off valves have been relocated to the top of the Chlorine railcar. This allows isolation of the liquid chlorine prior to the unloading hose in the unlikely event that a hose is accidentally severed.\n2. Cameras have been added at the railcar unloading stations for Chlorine, Ammonia, and Sulfur Dioxide.\n3. Unloading hoses have been changed"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 37274,
      "SummaryText": " from a 1 inch diameter to a 2 inch diameter. This was done to ensure that there would be enough flow through the hose to activate the excess flow valve (i.e. the valve will shutdown the flow when it reaches a specified rate) in the unlikely event that a hose is accidentally severed.\n4. There is a plan to move the emergency cut-off valves to the top of the Ammonia and Sulfur Dioxide railcars, as was done on the Chlorine railcar. This will allow the chemical to be isolated ahead of the unloading hose in the unlikely event that a hose is accidentally severed.\n\n\n2.0    CERTIFICATION\n\nRefer to the attached form.\n\n3.0    REGISTRATION\n\nRefer to the attached form."
    }
  ]
}