{
  "FacilityID": 37314,
  "FacilityName": "Wells' Dairy Omaha Milk Plant",
  "FacilityStr1": "7122 J Street",
  "FacilityStr2": null,
  "FacilityCity": "Omaha",
  "FacilityState": "NE",
  "FacilityZipCode": "68117",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31055",
  "LEPC": "Douglas County LEPC",
  "FacilityLatDecDegs": "41.215556",
  "FacilityLongDecDegs": "-096.023056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.bluebunny.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 107605370,
  "ParentCompanyName": "Wells' Dairy, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 44103372,
  "Company2DUNS": 0,
  "OperatorName": "Wells' Dairy, Inc.",
  "OperatorStr1": "7122 J Street",
  "OperatorStr2": null,
  "OperatorCity": "Omaha",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68117",
  "OperatorZipCodeExt": null,
  "RMPContact": null,
  "RMPTitle": "Director of Utilities",
  "FTE": 120,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000130618",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-18 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 41.21517,
  "FRS_Long": -96.0221,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "25000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 53755,
      "AltID": "Fluid Milk Manufacturing",
      "FacilityID": 37314,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 54991,
          "ProcessID": 53755,
          "NAICSCode": "311511",
          "_desc": {
            "NAICS_CODE": "311511",
            "NAICS_DESCRIPTION": "Fluid Milk Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 71089,
          "ProcessID": 53755,
          "ChemicalID": 56,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 571089,
          "ProcessID": 53755,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 37314,
      "SummaryText": "A Risk Management Plan (RMP) was developed for the use and stroage of anhydrous ammonia in the refrigeration system at the Wells' Dairy Omaha Milk Plant in Omaha, NE.  The RMP Program meets and addresses the requirements of Title 40 of the Code of Frederal Regulations, Part 68 (40 CFR 68).  This Executive Summary briefly describes the following elements:\n\nThe stationary source and regulated substance\nThe five year accident history\nThe employee awareness and responder training programs\nThe accidental release prevention program and chemical-specific prevention efforts\nThe emergency response plan and its integration with local emergency response plans\nThe programs to continuously improve safety and reduce the risk of accidental releases\n\nAnhydrous ammonia is used as a refrigerant for the Omaha Milk Plant's refrigeration system.  Liquid is circulated as needed to the air units and shell and tube chillers, where heat is absorbed and removed from the medium being cooled.  The anhydrous ammonia refrigeration system is a closed loop industrial refrigeration system.  The ammonia is not used or mixed in any manner with other chemical processes.\n\nThere is no data for the five year accident history due to the fact that there have no reportable accidental releases from this facility in the last five years.\n\nChemical awareness training is provided to all employees at the facility.  For those that are designated to respond to emergencies, there is specific training provided for hazard recognition, incident command, and response.  This facility does not man a full on-site response team so the onsite response personnel are directed to call the local municipal hazardous materials response team, isolate the effected area, and assist the local response team. \n\nThe accidental release prevention progam level 3 is implemented through the process safety manament program in place at the facility.  Process specific training is provided to all maintenance and operator/mechanic personnel to en"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 37314,
      "SummaryText": "sure that the system's mechanical integrity is mainitained for the life of the process.  Administrative controls are in place to manage process and equipment changes so that training and accident prevention programs can be modified accordingly.  The various facets of the process safety management program and RMP program are being linked through documentation and communication.\n\nEmergency response plans for personnel and chemical emergencies are being integrated into a single Integrated Contingency Plan (ICP).  The ICP will consolidate training, resource management, and data tracking for a wide range of incident types that potentially may occur at this facility as well as streamline the management of incident response efforts and define the lines of authority to manage responses to incidents that may occurr.  Training is provided to on-site responders assigned to recognize hazardous situations, evacuate effected facility personnel and notify the local municpal hazardous materials response team.  Members from the local municipal hazardous response team periodically visit the facility to familiarize themselves with the any changes that may have occurred in the plant.\n\nWells' Dairy, Inc. addresses and incorporates recommendations resulting from action items developed from process hazard analyses performed on various facility functions that utilize the ammonia refrigeration system, potential offsite release consequence analyses, incident investigations, and program audit findings.  Continuous improvement of the program will allow Wells' Dairy to respond effectively to prevent or minimize any potential exposing of employees, the surrounding public, and/or the environment to a release of ammonia."
    }
  ]
}