{
  "FacilityID": 37348,
  "FacilityName": "Solvay Advanced Polymers, L.L.C.",
  "FacilityStr1": "17005 State Route 7",
  "FacilityStr2": null,
  "FacilityCity": "Marietta",
  "FacilityState": "OH",
  "FacilityZipCode": "45750",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39167",
  "LEPC": "Washington County LEPC",
  "FacilityLatDecDegs": "39.372222",
  "FacilityLongDecDegs": "-081.513889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Solvay America, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 151734506,
  "Company2DUNS": 0,
  "OperatorName": "Solvay Advanced Polymers, L.L.C.",
  "OperatorStr1": "P.O. Box 446",
  "OperatorStr2": null,
  "OperatorCity": "Marietta",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45750",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mark A. Potochnik",
  "RMPTitle": "HSE Manager",
  "FTE": 210,
  "OtherEPAFacilityID": "45750MCPRFPOBOX",
  "EPAFacilityID": "100000059367",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "06-84-02-0008",
  "SafetyInspectionDate": "2004-06-17 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Methyl Chloride storage and  use",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 39.37222,
  "FRS_Long": -81.51389,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 53791,
      "AltID": null,
      "FacilityID": 37348,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 55027,
          "ProcessID": 53791,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 71125,
          "ProcessID": 53791,
          "ChemicalID": 5,
          "Quantity": 60000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 5,
            "ChemicalName": "Methyl chloride  [Methane, chloro-]",
            "CASNumber": "74-87-3",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 571125,
          "ProcessID": 53791,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 37348,
      "SummaryText": "Solvay Advanced Polymers L.L.C., Marietta, Ohio\nEPA Risk Management Plan - Executive Summary\n\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nThe Solvay Advanced Polymers L.L.C., Marietta, Ohio plant has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation and maintenance of our processes.  Our plant adheres to process safety policies, guidelines, and best practices that have been developed based on company and industry experience over the years.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, our trained personnel will respond to control and contain the incident.\n\n\nDESCRIPTION AND REGULATED SUBSTANCES\n\nThe Solvay Advanced Polymers L.L.C. (Solvay Advanced Polymers ) plant is located at 17005 State Route 7, P.O. Box 446, Marietta, Ohio.  Various chemicals are processed to produce engineering polymers which are used in medical, electronic, automotive, and food service application.  The regulated substance at the plant in excess of the threshold quantity is methyl chloride.\n\n\nHAZARD ASSESSMENTS\n\nWorst Case Scenario\n\nThe worst case scenario (WCS) for methyl chloride, a toxic gas, is a release of 30,000 pounds in ten minutes, which is the entire contents of a storage tank.  The WCS is based on this release scenario with an endpoint concentration identified by emergency response planning guide level 2 (ERPG-2).   The effects of administrative controls, mitigation systems, and safety systems are not included in determining the WCS.  Distances to the endpoint were calculated using the methodology outlined in EPA?s RMP Offsite Consequence Analysis Guidance.  Nearby public receptors could be affected by this type of release.  Specific information on this release is presented in more detail in the plan.\n\n\nAlt"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 37348,
      "SummaryText": "ernative Release Scenario\n\nThe alternative release scenario for methyl chloride assumes a 60 minute release from a valve failure resulting in a total release of 3,000 pounds. The release is expected to be identified and isolated by the plant operators.  The distance to the ERPG-2 endpoint is such that the release just exceeds the plant boundary.  Specific information on this release is presented in more detail in the plan.\n\n\nPREVENTION PROGRAM\n\nThe following is a summary of the accident prevention program in place at the Solvay Advanced Polymers  plant.  Because processes at the plant that are regulated by the  EPA RMP regulation are also subject to the OSHA PSM standard this summary also addresses the OSHA PSM elements and describes the management system in place to implement the prevention program.\n\nEmployee Participation\n\nThe Solvay Advanced Polymers  plant encourages employees to participate in all facets of process safety management and accident prevention.  Examples of employee participation range from updating and compiling technical information to participating as a member of a process hazard analysis (PHA) team.  Employees have access to all information created as part of the plant prevention program.  Specific ways that employees can be involved in the prevention program are documented in the employee participation plan that addresses prevention program elements.  In addition, the plant has a number of initiatives under way that address process safety and personal safety issues.  These initiatives include forming teams to promote both process and personal safety.  The teams typically have members from various areas of the plant, including operation, maintenance, engineering, and plant management\n\nProcess Safety Information\n\nThe Solvay Advanced Polymers  plant keeps a variety of technical documents that are used to help maintain safe operation of the processes.  These documents address chemical properties and associated hazards, limits for key process param"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 37348,
      "SummaryText": "eters and specific chemical inventories, and equipment design basis/configuration information.  Each process has documentation available showing the location of this information to help employees and visitors locate any necessary process safety information. \n\nChemical specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs).  This information is supplemented by documents that specifically address known exposure concerns and any known hazards associated with the inadvertent mixing of chemicals.  For process areas, the plant has documented safety-related limits for specific process parameters (i.e. temperature, level, composition).  The plant assures that the process is maintained within these limits using process controls and monitoring instruments, highly trained personnel, and protective instrument systems.  In addition, information is available summarizing the consequences of deviation from these limits and the corrective actions to take.\n\nThe plant also maintains technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, electrical ratings of equipment, piping and instrument drawings, etc.  This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\nProcess Hazard Analysis\n\nThe Solvay Advanced Polymers  plant has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled.  Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\nThe Solvay Advanced Polym"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 37348,
      "SummaryText": "ers  plant primarily uses the hazard and operability (HAZOP) analysis technique to perform these evaluations.  HAZOP analysis is recognized as one of the most systematic and thorough hazard evaluation techniques.  The analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise.  This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary.\n\nThe HAZOP team?s recommendations are forwarded to management for resolution.  These recommendations are reviewed and all approved recommendations are tracked until they are completed.  The final resolution of each recommendation is documented and retained.   \n\nTo help ensure that the process controls and or process hazards do not eventually deviate significantly from the original design safety features, the Solvay Advanced Polymers  plant periodically updates and revalidates the hazard analysis results.  These periodic reviews are conducted at least every five years as long as the process exists.  The recommendations from these updates are also forwarded to management.  Final resolution of the recommendations is tracked, documented, and retained.  \n\nOperating Procedures\n\nThe Solvay Advanced Polymers  plant maintains written procedures that address various modes of process operations, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process.  These procedures are developed/revised by experienced operators as needed and provide a basis for consistent training of new operators.  The procedures are periodically reviewed and annually certified as current and accurate.  The procedures are revised as necessary to reflect changes made through the management of change process.\n\nAlso safe operating"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 37348,
      "SummaryText": " limits are maintained to provide guidance on how to respond to upper or lower exceedences for specific process or equipment parameters.  This information, along with the written operating procedures, is readily available to the process operators and other personnel to use as necessary to safely perform their job tasks.\n\nThe Solvay Advanced Polymers  plant has long-standing safe work practices in place to help ensure worker and process safety.  Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous materials before process piping or equipment is opened, and (4) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space.  These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely\n\nTraining\n\nTo complement the written procedures for process operations, the Solvay Advanced Polymers  plant has implemented a comprehensive training program for all employees involved in operating a process.  New employees receive basic training in chemical plant operations.  After successfully completing this training, a new operator is paired with a senior operator to learn process-specific duties and tasks.  After the new operator demonstrates (i.e. through tests, skills demonstration, etc.) having adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently.  In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  This refresher training is conducted at least every three years.  All of this training is documented, including the means used to verify that the operator understood the training.\n\nC"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 37348,
      "SummaryText": "ontractors\n\nThe Solvay Advanced Polymers  plant uses contractors to supplement its work force during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipment, the plant has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site safety rules, and (6) inform plant personnel of any hazards that they find during their work.  This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices prior to work starting.  In addition, the Solvay Advanced Polymers  plant evaluates contractor safety programs and performance during the selection of a contractor.  Plant personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\n\nPre-Startup Safety Reviews (PSSRs)\n\nThe Solvay Advanced Polymers  plant conducts a PSSR for any new facility or facility modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, equipment, procedures, and personnel are appropriately prepared for startup prior to placing the equipment into service.  This review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready.  The PSSR review team uses checklists to verify all aspects of readiness.  A PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\n\nMechanical Integrity\n\nThe Solvay Advanced Polymers  plant has well-established prac"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 37348,
      "SummaryText": "tices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition.  The basic aspects of this program include: (1) conducting training, (2) developing written procedures and plans, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures.  In combination these activities form a system that maintains the mechanical integrity of the process equipment.\n\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their job in a safe manner.  Written procedures help ensure that work is performed in a consistent manner and provide a basis for training.  Inspections and tests are performed to help ensure that equipment functions as intended, and to verify that equipment is within acceptable limits (i.e. adequate wall thickness for pressure vessels).  If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service, or a MOC team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.\n\nAnother integral part of the mechanical integrity program is quality assurance.  The Solvay Advanced Polymers  plant incorporates quality assurance measures into equipment purchases and repairs.  This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made. \n\n\nHot Work Permit\n\nThe Solvay Advanced Polymers  plant has a hot work permit program which details those areas which require a permit and those areas for which a permit is not required.  A permit is required in process areas for all cutting, welding, spark producing equipm"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 37348,
      "SummaryText": "ent, etc.  The procedure includes accountability and responsibility for authorizing and issuing the hot work permit, display of the permit at the site of the hot work until the work is completed, site inspection, designation of appropriate precautions to be taken with the hot work, and assignment of a fire watch where appropriate.\n\n\nManagement of Change\n\nThe Solvay Advanced Polymers  plant has a comprehensive system to manage changes to processes.  This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented.  Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided any necessary training on the change.  The system ensures that all documentation is updated and training completed prior to the commissioning of the change.\n\n\nIncident Investigation\n\nThe Solvay Advanced Polymers  plant promptly investigates all incidents that resulted in, or reasonably could have resulted in a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.   The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident.  The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to management for resolution.  Corrective actions taken in response to the investigation team's findings and recommendations are tracked until they are complete.  The final resolution of each finding or recommendation is docume"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 37348,
      "SummaryText": "nted, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings.  Incident investigation reports are retained for at least 5 years, so that the reports can be reviewed during future PHAs and PHA revalidations. \n\n\nCompliance Audits\n\nTo help ensure that the accident prevention program is functioning properly, the Solvay Advanced Polymers  plant periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  Compliance audits are conducted at least every 3 years.  The audit team develops findings that are forwarded to plant management for resolution.  Corrective actions taken in response to the audit team's findings are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports along with the resolution of findings are retained.  \n\n\nCHEMICAL SPECIFIC PREVENTION STEPS\n\nThe processes at the Solvay Advanced Polymers  plant have hazards that must be managed to ensure continued safe operation.  The accident prevention program summarized previously is applied to the Program 3 EPA RMP covered process at the Solvay Advanced Polymers  plant.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n\nIn addition to the accident prevention program activities, the Solvay Advanced Polymers  plant has safety features on many units to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of (mitigate) a release.  The following types of safety features are used in various processes:\n\nRelease Detection\n\n1.  Internal plant alarm system\n2.  Monitoring systems\n\nRelease Containment/Control\n\n1.  Process relief valves that discharge to a containment area\n2.  Valves to permit isolation of the process (manual or automated)\n3.  Shutdown systems "
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 37348,
      "SummaryText": "for specific process parameters (i.e. high level)\n4.  Vessel to permit partial removal of the process inventory in the event of a release\n5.  Curbing or diking to contain liquid releases\n6.  Redundant equipment and instrumentation (i.e. backup firewater pump)\n7.  Atmospheric relief devices\n\nRelease Mitigation\n\n1.  Fire suppression and extinguishing systems \n2.  Deluge systems for specific equipment\n3.  Trained emergency response personnel\n4.  Personal protective equipment (e.g., protective clothing, self-contained breathing apparatus)\n5.  Mobile fire fighting equipment\n6.  Blast-resistant buildings to help protect control systems and personnel\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nThe Solvay Advanced Polymers  plant had no RMP reportable accidents in the last 5 years.\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nThe Solvay Advanced Polymers  plant maintains a written emergency response program, which is in place to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response, including proper first-aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post incident cleanup and decontamination requirements.  In addition, the Solvay Advanced Polymers  plant has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is updated when necessary based on modifications made to plant processes or other plant facilities.  The emergency response"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 37348,
      "SummaryText": " program changes are administered through the MOC process, which includes informing and/or training affected personnel in the changes.\n\nThe overall emergency response program for the Solvay Advanced Polymers  plant is coordinated with the Washington County Local Emergency Planning Committee (LEPC).  This coordination includes periodic meetings of the committee, which includes local emergency response officials, local government officials, and industry representatives.  The Solvay Advanced Polymers  plant has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  In addition to periodic LEPC meetings, the Solvay Advanced Polymers  plant conducts periodic emergency drills that involve the LEPC and emergency response organizations, and the plant provides annual refresher training to local emergency responders regarding the hazards of regulated substances in the plant. \n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Solvay Advanced Polymers  plant has identified the following planned changes to improve safety:\n\n1.  Ongoing participation by plant employees in programs designed to enhance safety awareness and positive behaviors.\n2.  Plant emergency response plan training and drills.\n3.  Review and where appropriate revise process instrumentation and/or controls.\n4.  Review or revise personnel training programs.\n5.  Review or revise written operating procedures."
    }
  ]
}