{
  "FacilityID": 3737,
  "FacilityName": "Pocotaligo Wastewater Treatment Plant",
  "FacilityStr1": "600 Justin Lane",
  "FacilityStr2": null,
  "FacilityCity": "Sumter",
  "FacilityState": "SC",
  "FacilityZipCode": "29153",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45085",
  "LEPC": "Sumter County LEPC",
  "FacilityLatDecDegs": "33.849722",
  "FacilityLongDecDegs": "-80.315556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 52063732,
  "ParentCompanyName": "City of Sumter",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Sumter",
  "OperatorStr1": "P.O. Box 1449",
  "OperatorStr2": null,
  "OperatorCity": "Sumter",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29151",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000044999",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1985-04-30 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-23 00:00:00",
  "ErrorReportDate": "1999-06-23 00:00:00",
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 33.84833,
  "FRS_Long": -80.31472,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4336,
      "AltID": "Wastewater Chlorination",
      "FacilityID": 3737,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 4622,
          "ProcessID": 4336,
          "ChemicalID": 62,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 4436,
          "ProcessID": 4336,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1572,
              "Process_NAICS_ID": 4436,
              "SafetyReviewDate": "1999-04-25 00:00:00",
              "PHA_Date": "1995-04-30 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1995-05-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Human Error",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Improved Operating Procedures and Safe Working Practices",
              "OpProceduresReviewDate": "1999-04-25 00:00:00",
              "TrainingReviewDate": "1999-04-25 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-25 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "Aerators and Clarifiers",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-04-25 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-04-25 00:00:00",
              "AuditCompletionDate": "1999-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-25 00:00:00",
              "HotWorkPermitReviewDate": "1999-04-25 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-25 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "The Pocotaligo Wastewater Treatment Plant utilizes chlorine gas to create a chlorinated water solution for use in the destruction of pathogenic microorganisms within the wastewater effluent.",
              "_chemicals": [
                {
                  "PrimaryKey": 1747,
                  "PreventionProgram3ID": 1572,
                  "ProcessChemicalID": 4622
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 3737,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-05-01 00:00:00",
    "ERTrainingDate": "1997-08-31 00:00:00",
    "CoordinatingAgencyName": "Sumter County Civil Defense Agency",
    "CoordinatingAgencyPhone": "8034362158",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "NPDES (SC0027707)"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3737,
      "SummaryText": "City of Sumter\nPocotaligo WWTP\nSumter, South Carolina\n\nPolicy Statement\n\nThe City of Sumter operates the Pocotaligo Wastewater Treatment Plant at 600 Justin Lane in Sumter, South Carolina.  We are strongly committed to safety by maintaining comprehensive maintenance, prevention, and industrial safety programs that protect against any accidental release or spill which may result in on- or off-site consequences.\n\nIn the unlikely event of a mishap, an emergency response plan has been developed in cooperation with the Sumter County Civil Defense Agency, which serves to ensure the safety and well being of the community and the environment.  Our emergency response program is based upon the recommendations by The Chlorine Institute, Inc. within the \"Emergency Response Plans for Chlorine Facilities.\"       \n\nFacility Description\n\nChlorine is stored on-site for use in the disinfection process of treated wastewater prior to final discharge.  Six 2,000-pound pressurized chlorine cylinders are located within an enclosed building south of the treatment ponds for use in the treatment process.  Three additional 2,000-pound chlorine cylinders are stored on-site prior to transport to other facilities.  The latest technology in process control systems are present in the chlorine storage area to minimize and prevent the impacts of any spillage, fire, explosion, or equipment failure.            \n\nAccident History\n\nThe Pocotaligo Wastewater Treatment Plant has had an excellent record of preventing accidental release over the past 5 years.  Due to our stringent release prevention policies, no accidental releases have occurred or were identified within the time period in question.  Since the facility has been in operation, no deaths or injuries have resulted from the accidental release, explosion, or fire involving this regulated substance.  Furthermore, no fish kills or other environmental impacts have resulted from an accident or spill incident at the Sumter, South Carolina facility.   "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3737,
      "SummaryText": " \n\nOff-site Consequence Analysis\n\nThe City of Sumter has calculated a worst-case release scenario based on the EPA  approved RMP*Comp modeling software, while alternative release scenarios have been modeled using EPA's OCA Guidance Reference Tables and Equations.  Details for each chosen scenario has been provided in the following paragraphs.\n \nChlorine\n\nThe worst-case release scenario, as developed for the chlorination system, involves a catastrophic release of 12,000 pounds of chlorine from the six chlorine cylinders within the chlorine building that are connected to the chlorination process.  It has been assumed that the entire quantity of chlorine is released as a gas over a 10 minute time frame as a result of a tank rupture.  Under worst-case weather conditions, the maximum distance of 6.6 miles corresponds to the toxic endpoint of 0.0087 mg/l.  Industrial facilities, schools, hospitals, recreational areas, residential subdivisions, creeks, and rivers would be affected by such a release.    \n\nAn alternative scenario may include the catastrophic release of chlorine gas during 3 m/s windspeeds, D Class atmospheric stability, and  77 degrees fahrenheit weather conditions.  It has been assumed that a quantity of chlorine gas is released at a rate of 41.2 pounds per minute from the storage cylinders as a result of a pipe rupture within the chlorination building.  The facility's hazard response team would control the release by preventing flow through the piping within a 10 minute period.  Under the alternative weather conditions, the maximum distance of 0.3 miles corresponds to a toxic endpoint of 0.0087 mg/l. Residential subdivisions would be affected by such a release.  Environmental receptors exposed to chlorine concentrations  above the 0.0087 mg/l level include creeks and rivers.  \n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe Pocotaligo Wastewater Treatment Plant has taken the necessary steps to comply with the accidental r"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3737,
      "SummaryText": "elease prevention requirements as set forth in 40 CFR Part 68.  The chlorination process has been designed and constructed in accordance with all applicable codes and standards, as well as good engineering practices.  The prevention program consists of the elements as follows:\n\n1. Employee Participation\nEmployees at the Pocotaligo Wastewater Treatment Plant are provided access to all elements of this Risk Management Plan for review and input.  Site management, whenever possible, involves employees in the development, revisions, review, and implementation of this plan.  Employees, knowledgeable in the specified processes, are included in any task group or team for their invaluable experience and input for developing a successful program to ensure the well being of co-workers, the community, and the environment.  \n \n2. Process Safety Information\nThe Pocotaligo Wastewater Treatment Plant maintains a detailed written record of all safety information regarding the operation of each covered process.  Information includes the chemical hazards, operating procedures, and equipment design parameters.\n\n3. Process Hazard Analysis\nThe checklist hazard analysis method is utilized at the Sumter, South Carolina facility to identify and prevent any activity that may result in a release of a regulated substance.  A team of qualified personnel perform periodic reviews of operating procedures, equipment functions, and handling practices to identify potential hazards every three years, or in the event of any process or equipment change.  Any findings related to the hazard review are addressed in a safe and timely manner.\n\n4. Operating Procedures\nWritten operating procedures addressing initial startup, normal operations, temporary operations, emergency shutdown, and  emergency operations have been developed to ensure the safe operation of the covered processes.\n\n5. Training\nA comprehensive training program provides employees the proper education to safely maintain and operate the chlorin"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3737,
      "SummaryText": "ation process.  New employees receive basic training in process operations and safety, followed by a supervised on-the-job training period.  Refresher training is provided to all employees at least every three years or as needed.\n    \n6. Mechanical Integrity\nThe City of Sumter utilizes maintenance employees to regularly inspect and document the condition and functioning of all equipment associated with the covered process.  Any inspections or maintenance operations are performed by qualified personnel with previous specialized training for accomplishing such tasks.  All deficiencies or equipment were identified during maintenance inspections are corrected in a safe and timely manner.      \n\n7. Management of Change\nPrior to any modifications to equipment, procedures, raw materials, or processing, the Pocotaligo Wastewater Treatment Plant shall ensure the process safety information, training requirements, the technical designs, and the operating procedures to ensure the safety of all employees, the community, and the environment.  \n\n8. Pre-Startup Review\nIn the event that new equipment, materials, or processes are added, or existing processes are modified, the City of Sumter shall review all design specifications, safety information, maintenance requirements, operating procedures, and emergency procedures prior to the introduction of a regulated substance.  Any necessary training will be provided to employees to ensure safe operating conditions.    \n\n9. Contractors\nContractors shall undergo a screening process prior to performing any work on or around the chlorination process.  The Plant Superintendent, at the Pocotaligo Wastewater Treatment Plant, shall ensure all contractors are properly trained in the safe work practices and emergency response procedures at the facility.  During or following any work, contractors will be evaluated for their performance in accomplishing their task, while complying with all said procedures at the wastewater treatment facility.     \n\n"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 3737,
      "SummaryText": "10. Hot Work Permits\nWritten procedures have been developed to ensure that any work, conducted on or \nnear the covered processes, with the potential to produce sparks does not result in fire or release involving the regulated substances.  Proper evaluation of the area is required to ensure that adequate precautions are taken during any welding, brazing, or cutting operations.     \n\n11. Incident Investigation\nAny incident resulting in, or possibly resulting in, an accidental chlorine release will be investigated by qualified personnel.  Personnel identify any \nsituation that may result in a release, recommend corrective actions, and document any such action. \n\n12. Compliance Audits\nCompliance audits are performed on a regular basis to ensure compliance and \nimplementation of the provisions within 40 CFR part 68 and 29 CFR 1910.119.  \nAudits are performed by a group of qualified employees at least every three years.  All findings and recommendations shall be addressed in a safe and prompt fashion.\n    \nEmergency Response\n\nThe Emergency Response Plan has been developed in cooperation with the Sumter County Civil Defense Agency to ensure access to the necessary resources for response in the least amount of time.  This cooperative approach includes the following:\n\n1. Alert employees of the potential hazard and evacuate all employees from the area.\n2. Dial 911 to alert local response agencies of the event.\n3. Supervisors or management will ensure all employees exit the facility in a safe manner.\n4. The emergency response team shall evaluate the release event and repair any damage when possible.\n5. County resources will coordinate informing the public and protecting the community or environment when necessary.  \n\nProvisions of the emergency response plan include the identification of adequate first aid, medical treatment, fire fighting, and security services within the surrounding community to ensure the well being of those affected in the event of a release.  \n\nPlanned ch"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 3737,
      "SummaryText": "anges to improve safety\n\nNo changes have been planned for the Sumter, South Carolina facility."
    }
  ]
}