{
  "FacilityID": 37393,
  "FacilityName": "Plant City Dairy",
  "FacilityStr1": "3304 Sydney Road",
  "FacilityStr2": null,
  "FacilityCity": "Plant City",
  "FacilityState": "FL",
  "FacilityZipCode": "33566",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12057",
  "LEPC": "District 8 LEPC",
  "FacilityLatDecDegs": "27.993500",
  "FacilityLongDecDegs": "-082.160611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "OT",
  "FacilityURL": "www.winn-dixie.com",
  "FacilityEmailAddress": "TomTeston@winn-dixie.com",
  "FacilityDUNS": 6921902,
  "ParentCompanyName": "Winn-Dixie Stores, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Winn-Dixie Stores, Inc",
  "OperatorStr1": "5050 Edgewood Court",
  "OperatorStr2": "P.O. Box B",
  "OperatorCity": "Jacksonville",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32203",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jerald Grey",
  "RMPTitle": "Plant Manager",
  "FTE": 180,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000108563",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-05-08 00:00:00",
  "DeRegistrationEffectiveDate": "2008-04-30 00:00:00",
  "AnniversaryDate": "2009-06-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 27.99625,
  "FRS_Long": -82.15522,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "12.2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility was sold to Sunshine State Dairy Farm/Southeast Milk Inc.",
  "_processes": [
    {
      "ProcessID": 53844,
      "AltID": "Ammonia Refrig. Process",
      "FacilityID": 37393,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 55080,
          "ProcessID": 53844,
          "NAICSCode": "31151",
          "_desc": {
            "NAICS_CODE": "31151",
            "NAICS_DESCRIPTION": "Dairy Product (except Frozen) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 71181,
          "ProcessID": 53844,
          "ChemicalID": 56,
          "Quantity": 39000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 571181,
          "ProcessID": 53844,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 37393,
      "SummaryText": "1.  The accidental release prevention and emergency response policies\n\nThe Winn-Dixie Dairy in Plant City, Florida is a manufacturing facility owned by Winn-Dixie Stores, Inc.  Winn-Dixie Stores, Inc. requires each facility to develop and maintain accident prevention programs and an emergency response plan appropriate to the site.  Each site is also responsible for regulatory compliance issues that apply to the site.  Winn-Dixie Stores, Inc.?s corporate and division environmental and safety personnel provide assistance in training for site employees and in budgeting and procurement of safety and training services.\n\n2. The facility and the regulated substance handled\n\nThe Plant City Dairy is located at 3304 Sydney Road in the Southwest corner of Plant City, Florida.  The Dairy facility manufactures milk, juice, bottled water, and ice cream for distribution to the Winn-Dixie Supermarkets.  \n\nThe Plant City Dairy has an ammonia refrigeration system which exceeds the 10,000 lb. RMP threshold quantity. The ammonia refrigeration system?s equipment is located in the southwest corner of the building in the southwest corner of the property in the machine or compressor room.  The two high pressure receivers (HPRs) are connected and located outside the compressor room under the cooling towers next to the Dairy building.  The two HPRs are approximately equal in size and are both the largest capacity vessels in the ammonia refrigeration system, capable of holding approximately 12,175 lbs. of ammonia each.  \n\n3. The general accidental release prevention program and chemical-specific prevention steps\n\nThis facility exceeds the ammonia threshold quantity for the OSHA Process Safety Management (PSM) Standard, 1910.119, and is therefore subject to the PSM requirements.  For RMP compliance purposes, this places the Plant City Dairy process in the Program 3 level.  The Plant City Dairy facility will use its PSM program as the required Program 3 Prevention Program.\n\nThe Plant City Dairy"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 37393,
      "SummaryText": " has a program in place to comply with the OSHA Process Safety Management Standard, 29 CFR 1910.119.  The PSM Program includes a preventative maintenance plan which requires all ammonia refrigeration equipment to be periodically inspected and serviced.  This will ensure that the equipment remains in good operating condition and will minimize the probability of accidents due to faulty equipment.  In developing the PSM Program, the Plant City Dairy also developed written operating procedures for the refrigeration process.  These procedures cover all phases of operation and include information on safety devices.  These procedures will be used to train all operators and mechanics who work on the ammonia refrigeration process to ensure consistency of operation and minimize human error.  In addition, all refrigeration mechanics receive training through the Refrigeration Engineers and Technicians Association (RETA) training course.  These measures ensure that all refrigeration operators and mechanics are properly trained.  Existing safe work practices such as Lockout/Tagout and Hot Work Permit, are reviewed and updated to ensure that all non-routine work can be performed safely.  Other components of the prevention program include collection and review of all equipment information, the development of updated Piping & Instrumentation Diagrams (P&IDs), and the correction of any equipment design deficiencies found.  These actions will ensure that the equipment meets all refrigeration industry standards and that accurate equipment information will be available when needed.  To ensure that the Plant City Dairy refrigeration staff has the skills necessary to identify unsafe conditions, Process Hazard Analysis (PHA) training was conducted.  The staff also performed a PHA of this process.  Other PSM procedures, including Management of Change, Pre-Startup Safety Review, Compliance Audits, and Incident Investigation are also part of the program to ensure continued safe operation and "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 37393,
      "SummaryText": "prompt correction of deficiencies.  The PSM Program receives full support of plant management and involvement of employees at all levels.\n\n4. Five-year accident History\n\nThe Plant City Dairy facility has had no accidental releases of ammonia in the past five years.\n\n5. Emergency Response Program\n\nThe Plant City Dairy Facility has an Emergency Response Program in place.  The program complies with 29 CFR 1910.38.  The site also has some internal emergency response capability and is developing a program to comply with paragraph (q) of 29 CFR 1910.120.  The current plan has been coordinated with the Fire Department.  Notification is made locally by dialing 911, and by notifying Florida State Warning Point at (800) 320-0519.\n\n6.   Planned changes to improve safety\n\nNo changes are specifically identified but regular training sessions and compliance audits will be conducted.  If shortfalls are noted in the compliance audits then an action plan will be developed and areas of improvement will be addressed in a timely manner."
    }
  ]
}