{
  "FacilityID": 37644,
  "FacilityName": "Eustace Gas Processing Plant",
  "FacilityStr1": "16401 CR 2854",
  "FacilityStr2": null,
  "FacilityCity": "Eustace",
  "FacilityState": "TX",
  "FacilityZipCode": "75124",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48213",
  "LEPC": "Henderson County LEPC",
  "FacilityLatDecDegs": "32.265833",
  "FacilityLongDecDegs": "-096.038889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Enbridge Pipelines (NE Texas) LLC",
  "Company2Name": null,
  "CompanyDUNS": 802873125,
  "Company2DUNS": 0,
  "OperatorName": "Enbridge Pipelines (NE Texas) LLC",
  "OperatorStr1": "1100 Louisiana, Suite 3300",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77002",
  "OperatorZipCodeExt": null,
  "RMPContact": "O.J. Munns",
  "RMPTitle": "Plant Supervisor",
  "FTE": 25,
  "OtherEPAFacilityID": "TXD000750703",
  "EPAFacilityID": "100000063432",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-00863",
  "SafetyInspectionDate": "2004-04-22 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "submitted",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 32.27796,
  "FRS_Long": -96.03748,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 54167,
      "AltID": "Natural Gas Liquids Extra",
      "FacilityID": 37644,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 55415,
          "ProcessID": 54167,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 71630,
          "ProcessID": 54167,
          "ChemicalID": 155,
          "Quantity": 144000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 53382,
              "ProcessChemicalID": 71630,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 53383,
              "ProcessChemicalID": 71630,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 53384,
              "ProcessChemicalID": 71630,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 53385,
              "ProcessChemicalID": 71630,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 53386,
              "ProcessChemicalID": 71630,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 53387,
              "ProcessChemicalID": 71630,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 71631,
          "ProcessID": 54167,
          "ChemicalID": 98,
          "Quantity": 51000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 571630,
          "ProcessID": 54167,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 571631,
          "ProcessID": 54167,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 37644,
      "SummaryText": "Enbridge Pipelines (NE Texas) L.P.\n\nEustace Gas Plant\nEustace, Texas\n\n\nEXECUTIVE SUMMARY\n\n\nIntroduction and Policies\n\nEustace Gas Plant, owned and operated by Enbridge Pipelines (NE Texas) L.P., is committed to the same band of safety and environmental excellence that all other Enbridge assets promote.  This philosophy involves making each and every employee and contractor accountable for their own safety as well as that of the community around them.  As a company we follow a close adherence to all applicable federal, state and local laws to ensure a safe and healthy environment for all. \n\nEmployees who enter the Eustace facility complete a thorough training, both in the classroom and on-the-job, that enables them to address emergency issues as they arise.  This preparation includes standard operational, emergency operational, and release prevention training.  In addition, periodic refresher courses help to keep operators? problem solving abilities up to date and in sync with our recurring safety improvements.  Our regular internal audits provide an excellent checks and balances system for monitoring these high standards that we set.\n\nEustace Gas Plant is one of many facilities operated by Enbridge Energy Company.  At the facility, we receive wellhead gas from wells via pipeline.  The raw gas is dehydrated and contaminants removed.  Marketable natural gas is delivered via pipelines.  Natural gas liquids are extracted and stored on site.  The extracted natural gas liquids include ethane, propane, butanes, and pentane as pure products or in mixtures that are delivered to market via pipeline and transport vehicles.  There are no toxic substances present at the plant.  The facility is classified as Program Level 3 under the regulation.  The purpose of this Risk Management Plan (RMPlan) is to provide information about our operations at the facility, our programs to prevent accidental chemical releases, our emergency response plans in case an accidental release should occ"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 37644,
      "SummaryText": "ur, our 5 year accident history, and our planned changes to improve safety at the facility.\n\nWe have discussed these potential hydrocarbon releases with our employees and with local emergency response officials in Henderson County, thereby further reducing the possibility of any impact on the public.\n\n\nPrevention Program\n\nThe Eustace Gas Plant is regulated by 29 CFR 1910.119 (Process Safety Management of Highly Hazardous Chemicals), 1910.38 (Employee Emergency Plans), 1910.120 (Hazardous Waste and Emergency Response), 40 CFR 112 (Spill Prevention Control and Countermeasure), RCRA and State and Federal EPCRA Rules/Laws, as well as other federal, state and local regulations which are all developed to reduce the potential for the release of Highly Hazardous Chemicals.\n\nThis facility has implemented the Process Safety Management of Highly Hazardous Chemicals along with additional requirements of the Risk Management Program as the Accident Release Prevention Program.  There are other Practices and measures, which are contained in numerous plans and procedures that all assist to prevent the release of Highly Hazardous Chemicals.  Facility accident prevention programs promote the pro-active identification, evaluation, and mitigation or prevention of releases of highly hazardous substances that could occur as a result of failures in processes, procedures or equipment.  The implementation of The Employee Participation Program requires the development of the necessary expertise, experiences, judgment, and proactive initiative within the workforce.\n\nAn established comprehensive training program has been developed and implemented at the facility.  All employees are trained in a n overview of the process as well as in appropriate safe work practices per the corporate safety guidelines.  In addition to the training required of all employees, personnel having responsibilities under the operating and maintenance procedures are trained in those procedures.\n\nSafe work practices have "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 37644,
      "SummaryText": "been developed to ensure safe operations that are consistent with industry practice and meet regulatory requirements.  Safe work practices include site control, lockout/tagout, line breaking, confined space entry and hot work to ensure the safety and well being of employees and the surrounding area.\n\nThe Eustace facility has a policy of investigating every incident, which may have resulted in a release to prevent a similar accident from recurring.\n\nFive-year Accident History\n\nNo incident resulting in onsite or offsite impacts from a hydrocarbon release has occurred at the Eustace Gas Plant within the last five years.  Although we take pride in that record, we also place daily emphasis on our prevention and safety programs to ensure this record continues.\n\n\nEmergency Response Program\n\nThe Eustace Gas Plant maintains a written Emergency Response Plan to protect workers, ensure public safety and to protect the environment.  The plan details the procedures for responding to an emergency, including the release or potential release of a hazardous substance.  The procedures include instruction for response, communication, first aid, evacuation, accounting for personnel, company and agency notification procedures, and post incident cleanup and decontamination.  All emergency equipment is maintained following established procedures.  Employees are trained in the procedures and use of equipment appropriate to their role in the response effort.  The emergency response plan is coordinated with the local emergency responders, such as local law enforcement, local and state government officials, and the local emergency planning committee.  Our Emergency Response Program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.\n\n\nPlanned Changes to Improve Safety\n\nDiligent compliance with our RMP Prevention Program forms the framework on which we will continue to improve the level of safety at the E"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 37644,
      "SummaryText": "ustace Gas Plant.  Some of the key components of the safety improvements we expect to achieve are as follows:\n\nThe Management of Change provisions ensures that we consider the potential safety and health impacts of any change we make to process chemicals, technology, equipment or procedures.\n\nThe Process Hazard Analysis (PHA) provisions serve as a tool to ensure continual evaluation of potential hazards, thereby leading to continual improvements in our safety standards.\n\nThe Mechanical Integrity provisions ensure that process equipment and instrumentation are designed, constructed, installed and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of our safety program.\n\nInternal and third party compliance audits will ensure we maintain and increase our level of safety protection.\n\nWe encourage all interested citizens or community organizations to learn more about our latest information on emergency response for the county.  We plan to diligently integrate our response capabilities and personnel with those of the county on an ongoing basis."
    }
  ]
}