{
  "FacilityID": 3785,
  "FacilityName": "Agrilink Foods Inc.-Barker",
  "FacilityStr1": "125 East Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Barker",
  "FacilityState": "NY",
  "FacilityZipCode": "14012",
  "Facility4DigitZipExt": "0338",
  "FacilityCountyFIPS": "36063",
  "LEPC": "Niagara County LEPC",
  "FacilityLatDecDegs": "43.33",
  "FacilityLongDecDegs": "-78.5475",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Agrilink Foods,Inc.",
  "Company2Name": "Pro-Fac Cooperative",
  "CompanyDUNS": 2212611,
  "Company2DUNS": 64255938,
  "OperatorName": "Gary Ackles",
  "OperatorStr1": "125 East Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Barker",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14012",
  "OperatorZipCodeExt": "0338",
  "RMPContact": "Gary Ackles",
  "RMPTitle": "Facility Manager",
  "FTE": 37,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000046416",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-09-15 00:00:00",
  "SafetyInspectionBy": "Insurance company",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-04-21 00:00:00",
  "DeRegistrationEffectiveDate": "2003-10-17 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 43.04525,
  "FRS_Long": -78.88348,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4389,
      "AltID": "1",
      "FacilityID": 3785,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4489,
          "ProcessID": 4389,
          "NAICSCode": "31141",
          "_desc": {
            "NAICS_CODE": "31141",
            "NAICS_DESCRIPTION": "Frozen Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4677,
          "ProcessID": 4389,
          "ChemicalID": 56,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504677,
          "ProcessID": 4389,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3785,
      "SummaryText": "\n\n\n \nRisk Management Plan Barker Facility\n\n\nExecutive Summary\n\nThis is to inform all interested persons, including employees, that Agrilink Foods is complying with OSHA's Process Safety Management Standard (called Process Safety Management or PSM), Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA's Risk Management Program regulations (called RM Program), Title 40 CFR Part 68, to manage the risks involved with the storage, handling, and processing of hazardous chemicals.  In this way we promote overall plant, worker, and public safety.  These programs enable our facility to reduce the occurrence, and minimize the consequences, of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents. Overall, these programs prevent accidental fatalities, injuries and illnesses and avoid physical property damage.\n\nOur safety programs are applied to any activity involving hazardous chemicals including use, storage,  handling, or the on-site movement of such chemicals. Any group of vessels which are interconnected and separate vessels which are located such that a hazardous chemical could be involved in a potential release shall be considered a single process.\n\nOur safety programs reduce both the number and severity of accidents because they focus on the rules, procedures, and practices that govern individual processes, activities, or equipment.  These rules are detailed and improved, as necessary. They are also communicated to and accepted by all employees at the facility.\n\nDescription\n\nThe ammonia refrigeration process at the facility consists of various pumps, compressors, and condensers that are used to change the state of NH3 from a gas to a liquid and is a closed system.  The system operation is very similar to the operation of a household refrigerator.  The total ammonia inventory on site includes 30,000 pounds.  The ammonia is used in freezing of green beans, peas, butternut squash, rutabaga and potatoes.\n\nWo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3785,
      "SummaryText": "rst-Case Scenario(s)\n\nFailure of the high-pressure receiver containing 20,000 pounds of ammonia with the receiver quantity limited to 20,000 pounds of the vessel capacity by facility procedures resulting in a one-minute release. Under worst-case weather conditions, ammonia could travel 2.5 miles before dispersing enough to no longer pose a hazard to the public or the environment.  This scenario is unlikely for the following reasons: worst-case weather conditions are uncommon; industry standards for the manufacture and quality control of pressure vessels; ammonia is not corrosive in this service; pressure safety valves limit operating pressure in this vessel; the accident prevention program in place at the facility including the mechanical integrity program for regular maintenance, inspection and testing, and replacement of equipment, if necessary; installed ammonia sensors in the system to warn of leaks; alarms are in place to warn operating personnel of process upsets; and the emergency response plan and equipment in place at the facility.\n\nAlternative Release Scenario(s)\n\nFailure of a < inch diameter pipe would result in the release of approximately 6000 pounds of ammonia over a time period of 60 minutes.  Under common weather conditions, ammonia could travel 326 yards before dispersing enough to no longer pose a hazard to the public or environment.  The < inch pipe was chosen because it is used to temporarily bleed off a pump so that maintenance activities can be conducted.  This scenario is unlikely due to the following reasons: the pump is isolated with valves in the closed position and only a few pounds of ammonia would be released; the valves to the pump would have to fail completely; the facility has an accident prevention program in place including operational procedures that includes having personnel present at all times during maintenance of a pump; a mechanical integrity program for regular maintenance of a pump is in place at the facility; routine inspe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3785,
      "SummaryText": "ction and testing of valves is conducted; replacement of defective equipment if necessary; and the facility emergency response plan and equipment in place at the facility.\n\nPrevention Program\n\nThe general accident prevention program and ammonia-specific prevention steps was developed as required and complies with OSHA PSM Standard 29 CFR 1910.119 and EPA RM Program regulations in 40 CFR Part 68.  The key prevention steps at the facility consist of the following:\n\n7 Process Safety Information\n7 Process Hazard Analysis\n7 Standard Operating Procedures\n7 Training\n7 Mechanical Integrity Program\n7 Management of Change\n7 Pre-startup Safety Review\n7 Compliance Audits\n7 Incident Investigation\n7 Employee Participation\n7 Hot Work Permit\n7 Contractor Qualifications\n\n\n\n\nFive Year Accident History\n\nThere have been no reportable accidents during the past five years.\n\nEmergency Response Program\n\nThe Barker facility's emergency response program is based on the OSHA requirements for Emergency Action Plans (29 CFR 1910.38 and 1910.119) and HAZWOPER (29 CFR 1910.120).  We have trained employees for emergency response and maintain a written emergency response plan.  This plan is coordinated with the Niagara County Local Emergency Planning Committee (LEPC) and the Barker Fire Department.  We conduct annual drills for implementation of the emergency response plan at the facility with participation of the LEPC and the fire department."
    }
  ]
}