{
  "FacilityID": 38011,
  "FacilityName": "BERRY COGEN-42 FACILITY",
  "FacilityStr1": "25121 NORTH SIERRA HIGHWAY",
  "FacilityStr2": null,
  "FacilityCity": "SANTA CLARITA",
  "FacilityState": "CA",
  "FacilityZipCode": "91321",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.384167",
  "FacilityLongDecDegs": "-118.495000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "FC",
  "FacilityURL": "www.bry.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 151321411,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "BERRY PETROLEUM COMPANY",
  "OperatorStr1": "5201 TRUXTUN AVENUE",
  "OperatorStr2": "SUITE 300",
  "OperatorCity": "BAKERSFIELD",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93309",
  "OperatorZipCodeExt": "0640",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000109189",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-14 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 34.38114,
  "FRS_Long": -118.49248,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 54623,
      "AltID": "Ammonia Injection System",
      "FacilityID": 38011,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 72208,
          "ProcessID": 54623,
          "ChemicalID": 56,
          "Quantity": 55556.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 55878,
          "ProcessID": 54623,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 31354,
              "Process_NAICS_ID": 55878,
              "SafetyReviewDate": "2004-01-31 00:00:00",
              "PHA_Date": "2004-06-02 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2005-06-02 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-01-31 00:00:00",
              "TrainingReviewDate": "2003-12-31 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-12-31 00:00:00",
              "EquipmentInspectionDate": "2004-06-14 00:00:00",
              "EquipmentTested": "AMMMONIA TANK, TRANSFER PIPING",
              "ChangeMgmtDate": "1999-01-01 00:00:00",
              "ChangeMgmtReviewDate": "2003-12-31 00:00:00",
              "PreStartupReviewDate": "2003-12-31 00:00:00",
              "ComplianceAuditDate": "2004-06-02 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-12-31 00:00:00",
              "HotWorkPermitReviewDate": "2004-05-31 00:00:00",
              "ContractorSafetyReviewDate": "2004-03-09 00:00:00",
              "ContractorSafetyEvalDate": "2004-05-31 00:00:00",
              "CBI_Flag": 0,
              "Description": "This process utilizes (1) storage vessel for Anhydrous Ammonia with a maximum administrative quantity of 9,750 gallons. The process piping branches to (2) exact control units. The ammonia is injected with dilution air for emissions control for Nox reduction for the Turbine Generators exhaust. The entire prevention program, reviews, and inspections apply to the entire system.",
              "_chemicals": [
                {
                  "PrimaryKey": 45666,
                  "PreventionProgram3ID": 31354,
                  "ProcessChemicalID": 72208
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 38011,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-03-31 00:00:00",
    "ERTrainingDate": "2004-03-31 00:00:00",
    "CoordinatingAgencyName": "Los Angeles County Fire Department",
    "CoordinatingAgencyPhone": "6612592111",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38011,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe Berry Cogeneration-42 is located in Los Angeles County, California, approximately two miles from city of Newhall. The facility is adjacent to the Antelope Valley Freeway and is within the recently incorporated city limits of Santa Clarita. The site occupies 3.1 acres. It is located on a leveled pad with a barrier (hill) between the facility and the freeway. The site is adjacent to the berry petroleum company production and also has sparsely located oil wells around the site. The area around the facility is basically uninhabited as the nearest home is approximately 1600 feet from site. The nearest housing project is about 2100 feet from the site. \n\nThe Berry Cogeneration-42 Facility owned by Berry Petroleum Company was purchased in January 1999 from Arco Western Energy. Steam and electricity are produced and sold to the local power utility company. There are two General Electrical LM2500 turbine generators, each producing 21.5 MW of power. \nThe cogeneration system electrical power output runs in parallel with the local utility company grid. Electrical power consumed by the berry Oil production facilities to supply its electrical needs.\nExhaust heat from the gas turbines is recovered in the heat recovery steam Generation system. All steam produced is delivered to the berry Petroleum Company for injection into the oil formation from enhanced oil recovery. \n\nThe site is currently operated by Solar Assets Management Services and is manned 24 hrs a day. There are six personnel assigned to the facility - (1) Facility Manager, (1) Lead Technician and (4) Technician II personnel. \nCogen-42 developed a risk management program and an emergency response plan to address in June 1999. Cogen-42 is extremely diligent in the handling of all chemicals and is dedicated to the safety of its employees and the neighboring community. Cogen-42 staff are highly trained and utilize modern equipment to monitor the facility and provide safeguards, while effectively and s"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38011,
      "SummaryText": "afely using ammonia for controlling Nox emissions. \n \nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nCogen-42 has a long standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as personnel training and consideration of safety in the design, operation, and maintenance of the Ammonia Injection Systems. Cogen-42?s policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. \n \n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nAnhydrous ammonia is stored in liquid form in a specifically design storage vessel. Ammonia is stored at ambient temperature in the pressurized horizontal storage tank. When ambient conditions do not significantly promote the vaporization of liquid ammonia, a vaporizer is utilized to heat the liquid to its boiling point to produce vapor. The vapor ammonia is sent to a mixing chamber where it is mixed with air. The resulting vapor ammonia / air stream is then injected into the HRSG. This, in conjunction with the catalyst within the HRSG, allow for the reduction of Nox and other unwanted materials being sent to the environment. The exhaust gas containing a lower concentration of Nox is then sent from the HRSG to an exhaust stack. \n\n\nHAZARD ASSESSMENT SUMMARY/OFFSITE CONSEQUENCE ANALYSIS\n \nAmmonia Injection System ? Anhydrous Ammonia\nWorst-Case Release Scenario Results Summary\nScenario Description: Per regulations one worst case analysis has been defined as a release of the maximum quantity of anhydrous ammonia that can be stored in the largest equipment item (the storage tank) in ten (10) minutes. Although there are numerous controls to prevent such a release and to manage its consequences, the Ammonia Injection System is located outside, and no credit for passive mitigation was taken for the worst-case release scenario.  The most pessimistic meteorological conditions were used, as specified by the regulations.  RMP Comp w"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38011,
      "SummaryText": "as used to validate the maximum downwind endpoint distance to 0.14 mg/L, for this re-submittal.  The results show the off-site areas that will be affected. This worst case release scenario is highly unlikely to occur because of active mitigation measures that can be taken and weather conditions that are unlikely as well.\n Alternative Release Scenario Results Summary\nScenario Description: A more realistic alternative release scenario involves the release of ammonia from a fill line at the tank caused by a transfer hose failure. It was assumed that the ammonia is released through a half-open fill line. The fill line is located outside.  The release height was assumed to be at ground surface. RMP*Comp was used to estimate the release rate.  Due to the fact that transfer operations are supervised by the Delivery Truck driver and plant personnel, it was determined that 17.5 minutes was conservative release duration.  \nThe meteorological conditions specified by regulation for alternative release scenarios were used. RMP Comp was used to validate the maximum downwind endpoint distance to 0.14 mg/L.  The downwind distance for this alternative release scenario is significantly less than that for the worst-case scenario.  \nRisk Considerations\nAlthough the storage and use of anhydrous ammonia has inherent potential risks, and worst-case release scenarios can potentially reach the community; Cogen-42 has recognized these potential risks and structured its safety programs to make the worst case type of event non-credible.  In addition to the safety practices of the company and plant personnel to make this worst-case event non-credible, it should also be recognized that there are inherent analysis assumptions that make the results of the atmospheric dispersion analysis appear worse than what would actually be expected during such an event (e.g., In the event of a release, sudden rupture and flashing of ammonia would be highly turbulent.  Turbulence causes entrainment of air and t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 38011,
      "SummaryText": "he released vapor dilutes much more quickly than is shown in the model).\nIn addition to the use of conservative analysis assumptions that over-predict the effects of a potential release, other characteristics of the facility and site serve to minimize the potential risks associated with an ammonia release:\n?Ammonia sensors in the process area \n?Automatic Deluge System\n?Personal Protective Equipment (PPE) is used by plant personnel, as necessary.\n?The history of the Cogen-42 facility (i.e., no CalARP-applicable ammonia releases) reflects the adequacy of the design and diligence of the plant staff in safely operating the Ammonia Injection System.\n \n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\nAs part of the implementation of this Program, Prevention Program 3 elements were implemented by Cogen-42 to manage process safety issues associated with the use of ammonia for the Nox abatement system. In addition, common industry standards, policies, and procedures are currently utilized to ensure safe practices are being performed.(Supplemental information for Program 3 elements is located in the Berry Petroleum Cogen-42?s Compliance Workbook)\n\nThe Prevention Program 3 elements include:\n?Process Safety Information\n?Process Hazard Analysis\n?Operation Procedures\n?Training\n?Mechanical Integrity\n?Management of Change\n?Pre-Startup Review\n?Compliance Audits\n?Incident Investigation\n?Employee Participation\n?Hot Work Permit\n?Contractors\nThese elements are covered in the US EPA Submittal (Appendix A). On the RMP Submit document (Appendix A) under Incident Investigation (items 7.11 a & 7.11b): as of this date there have been no incidents to investigate, therefore the date for this item is blank.\nIn addition, key emergency response elements were addressed in the Business Emergency Plan. See EMERGENCY RESPONSE PROGRAM below.\n \nFIVE-YEAR ACCIDENT HISTORY\nThere have been no CalARP-applicable releases of ammonia at Cogen-42 in the past five years.\nEMERGENCY RE"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 38011,
      "SummaryText": "SPONSE PROGRAM\n\nBerry Petroleum Company maintains two levels Incident Command Systems. The First Level involves on site incidents with limited exposure. In these incidents the Foreman or highest-ranking Berry employee on-site, shall assume the Incident Commander duties and assign responsibilities as needed. The Level 1 and 2 Incident Command System Organization Chart is adopted to assist in assigning duties. \nA Level 3 incident, which involves off-site implications the highest ranking Incident Commander-trained Berry person on-site shall assume the Incident Commander post. If this is a escalation from Level 1 or Level 2 incident, the outgoing Incident Commander shall be reassigned to another position as needed. The Level 3 Incident Command System chart is adopted to assist assigning duties. \n\nPLANNED CHANGES TO IMPROVE SAFETY\nSeveral studies have been conducted to examine mitigation measures to improve safety at Cogen-42. These studies include the following:  Process Hazard Analysis, and Hazard Assessment.  Any outstanding recommendations from these studies will have been addressed by June 1, 2005."
    }
  ]
}