{
  "FacilityID": 38076,
  "FacilityName": "Procter & Gamble Hair Care LLC -- Iowa City",
  "FacilityStr1": "2200 Lower Muscatine Road",
  "FacilityStr2": null,
  "FacilityCity": "Iowa City",
  "FacilityState": "IA",
  "FacilityZipCode": "52240",
  "Facility4DigitZipExt": "2319",
  "FacilityCountyFIPS": "19103",
  "LEPC": "Johnson County LEPC",
  "FacilityLatDecDegs": "41.638723",
  "FacilityLongDecDegs": "-091.501632",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.pg.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 4238200,
  "ParentCompanyName": "The Procter & Gamble Company",
  "Company2Name": null,
  "CompanyDUNS": 1316827,
  "Company2DUNS": 0,
  "OperatorName": "Procter & Gamble Hair Care LLC",
  "OperatorStr1": "2200 Lower Muscatine Road",
  "OperatorStr2": null,
  "OperatorCity": "Iowa City",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52240",
  "OperatorZipCodeExt": "2319",
  "FTE": 485,
  "OtherEPAFacilityID": "52240THEPRC220L",
  "EPAFacilityID": "100000081369",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-29 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Iowa City Site",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-03-01 00:00:00",
  "DeRegistrationEffectiveDate": "2018-03-01 00:00:00",
  "AnniversaryDate": "2009-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 41.63919,
  "FRS_Long": -91.50194,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 54754,
      "AltID": "Ammonium Hydroxide, <=30%",
      "FacilityID": 38076,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 72433,
          "ProcessID": 54754,
          "ChemicalID": 57,
          "Quantity": 143300.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 56010,
          "ProcessID": 54754,
          "NAICSCode": "325611",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 20940,
              "Process_NAICS_ID": 56010,
              "SafetyReviewDate": "2001-06-20 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "API 650 (Tank Design)",
              "FR_Comments": null,
              "HazardReviewDate": "2001-06-20 00:00:00",
              "ChangeCompletionDate": "2002-05-15 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Flowmeter",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "Tank Farm spill containment includes retention ponds.",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-02-21 00:00:00",
              "TrainingReviewDate": "2002-11-30 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-02-14 00:00:00",
              "EquipmentInspectionDate": "2004-01-05 00:00:00",
              "EquipmentTested": "Entire Ammonium Hydroxide System from unload station to pre-weigh tank - including piping, tanks, pumps, valves and flanges",
              "ComplianceAuditDate": "2004-06-11 00:00:00",
              "AuditCompletionDate": "2004-06-18 00:00:00",
              "IncidentInvestigationDate": "2003-01-25 00:00:00",
              "InvestigationChangeDate": "2003-01-27 00:00:00",
              "MostRecentChangeDate": "2001-06-20 00:00:00",
              "CBI_Flag": 0,
              "Description": "The information provided in this section covers the entire ammonium hydroxide system -- from the unload station to the pre-weigh tank.  With the exception of operating procedures and task specific training, all units within the system are treated as one process or unit.  Tank farm technicians unload the ammonium hydroxide tank trucks.  The tank farm has separate operating procedures and training for unloading.  Our process operators perform all other tasks using ammonium hydroxide.  The process operators use and are trained on a separate set of operating procedures for thework they do.",
              "_chemicals": [
                {
                  "PrimaryKey": 21884,
                  "PreventionProgram2ID": 20940,
                  "ProcessChemicalID": 72433
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 38076,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-05-24 00:00:00",
    "ERTrainingDate": "2004-05-17 00:00:00",
    "CoordinatingAgencyName": "Iowa City Fire Department",
    "CoordinatingAgencyPhone": "3193565260",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38076,
      "SummaryText": "PREVENTION IS OUR FIRST PRIORITY\nProcter & Gamble (P&G) Iowa City has a long-standing commitment of maintaining a safe work environment for our employees and minimizing the impact of our operations on the environment.  Our safety and environmental programs are managed by qualified employees on site and actively supported by the participation of all employees and management.  In addition, P&G has a strong central staff of safety and environmental experts.  The goal of both our safety and environmental programs is prevention.  Safety is an integral part of every department across this site.  P&G has safety teams which focus on training, technical elements and special projects.  Although P&G's safety record is already among the best in the business, we are constantly striving for improvement.\n\nP&G is committed to the safety and protection of the local community and our neighbors.  P&G employees are active members of the Johnson County Hazardous Materials Team (HAZMAT).  The site has thirty employees trained to serve on the P&G HAZMAT Team.  Many P&G employees live near the site and support local community emergency providers.  Eighteen P&G employees are volunteer firefighters, five are volunteer Emergency Medical Technicians (EMT), and six are trained First Responders.  Furthermore, fifty employees are trained in the American Red Cross certified CPR and First Aid courses.\n\nP&G is also very committed to the safety and health of the environment.  The Iowa City site has had a strong history of reducing waste and emissions.  P&G has actively pursued pollution prevention as a business strategy.\n\n\nSYSTEMS AND PROCESSES FOR SAFE USE OF AMMONIUM HYDROXIDE\nThe P&G Iowa City site manufactures shampoo, conditioners and mouthwash.  Ammonium hydroxide is one of the raw materials used to make shampoo.  Ammonium hydroxide is delivered to our site by tank trucks and is unloaded into an above ground storage tank.  The tank and unloading area is spill protected such that in the event of"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38076,
      "SummaryText": " a spill the lost liquid material would be contained in a spill pond.  \n\n\nMINIMIZING POTENTIAL FOR ACCIDENTAL ATMOSPHERIC RELEASES\nAlthough this was not required, a detailed hazard assessment study conducted per the OSHA Process Safety Management (PSM) protocol was used to identify potential points from which ammonium hydroxide may be spilled or leaked from the process. These points have received special consideration during the process design, the training of operators and maintenance personnel, and in the development of our accident prevention and response systems. The studies are updated at least every 5 years, or when there are significant changes to the equipment, by a team of technical experts and other specially trained employees. Training, maintenance, controls, operating practices, and purchasing requirements are updated based on the results of these hazard studies. \n\n\nSAFETY AND PREVENTION \nThe first line of defense at our plant is accident prevention.  The ammonia tank has a level indicator on it.  Ammonia will only be unloaded into the tank when there is enough space to allow unloading the entire contents of the tank truck.  This administrative procedure of connecting each tank truck only once minimizes the risk of accidental spills.  In the event of an upset during unloading, there is a manual shutoff valve at the unloading station.  Furthermore, operating procedures require the attendant to maintain visual contact while unloading.\n\nIn the event of an accidental release, the site has systems to respond to the spill or leak quickly. Spills or leaks of liquid ammonium hydroxide anywhere in the tank farm would be contained in the spill ponds.  A spill or leak from the system anywhere inside the building would also be contained.  The site wide emergency communication system can be activated both in the tank farm and inside the process building to quickly communicate to site emergency response personnel the location of the incident.  If necessary, the police"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38076,
      "SummaryText": " and fire departments have procedures to manage communications and instructions to the public by means of the emergency siren, TV and radio broadcasts, and by direct communications in the streets of potentially affected neighborhoods. \n\nProcter & Gamble?s Iowa City emergency response team conducts drills with the aid of the Iowa City Fire Department and Johnson County HAZMAT Team.  The drills train new responders, refresh the skills of the experienced responders, and identify improvements to the communications and response systems.  Equipment that would be used to respond during a real emergency is used during these drills. The Iowa City Fire Department and Johnson County HAZMAT teams are toured through the site on a regular basis to increase their awareness of site layout and knowledge of where potentially hazardous materials are stored. \n\n\nHISTORY OF SAFE OPERATIONS\nThe P&G Iowa City site has an excellent safety history with ammonium hydroxide.  The plant has never had a reportable accident involving ammonia or the ammonia system that caused injury or property damage to anyone on site or off site.  \n\n\nALL EMPLOYEES RECEIVE SAFETY AND ENVIRONMENTAL TRAINING\nAll technicians using the ammonium hydroxide system are trained and qualified in our standard operating procedures. The operating procedures include steps to be taken in both routine and non-routine operations.  These operating procedures are reviewed at least annually and updated, if necessary.  All ammonia system employees participate in routine emergency response drills and refresher training on the system annually.  The results of hazard assessments and the emergency response drills are communicated to the operating and unloading teams. \n\n\nEMERGENCY RESPONSE PLANS DEVELOPED WITH LOCAL EXPERTS \nAn emergency response plan has been developed and coordinated with the LEPC, including the Iowa City Fire Department, Johnson County Hazardous Materials (HAZMAT) Team, and Iowa City Police Department.  The plan is test"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 38076,
      "SummaryText": "ed by routinely conducting drills."
    }
  ]
}