{
  "FacilityID": 38139,
  "FacilityName": "Nestlé Prepared Foods Company (CA)",
  "FacilityStr1": "9601 Canoga Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Chatsworth",
  "FacilityState": "CA",
  "FacilityZipCode": "91311",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.244361",
  "FacilityLongDecDegs": "-118.599472",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 8256224,
  "ParentCompanyName": "Nestle USA",
  "Company2Name": null,
  "CompanyDUNS": 8256224,
  "Company2DUNS": null,
  "OperatorName": "Nestlé USA",
  "OperatorStr1": "9601 Canoga Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Chatsworth",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91311",
  "OperatorZipCodeExt": null,
  "FTE": 650,
  "OtherEPAFacilityID": "CAL912203653",
  "EPAFacilityID": "100000128578",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-08-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-10-02 00:00:00",
  "DeRegistrationEffectiveDate": "2014-09-25 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 34.244361,
  "FRS_Long": -118.599472,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 54834,
      "AltID": "Frozen Specialty Food Man",
      "FacilityID": 38139,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 72521,
          "ProcessID": 54834,
          "ChemicalID": 56,
          "Quantity": 60000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 56090,
          "ProcessID": 54834,
          "NAICSCode": "311412",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 31493,
              "Process_NAICS_ID": 56090,
              "SafetyReviewDate": "2004-06-04 00:00:00",
              "PHA_Date": "2004-04-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Dump valves to transfer ammonia between vessels.",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Process Alarms",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-11-13 00:00:00",
              "TrainingReviewDate": "2003-11-13 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Classroom and hands-on refrigeration training is provided.",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-11-01 00:00:00",
              "EquipmentInspectionDate": "2004-05-01 00:00:00",
              "EquipmentTested": "Ammonia Compressors",
              "ChangeMgmtDate": "2004-01-24 00:00:00",
              "ChangeMgmtReviewDate": "2002-11-01 00:00:00",
              "PreStartupReviewDate": "2003-01-06 00:00:00",
              "ComplianceAuditDate": "2001-11-01 00:00:00",
              "AuditCompletionDate": "2004-09-01 00:00:00",
              "IncidentInvestigationDate": "2004-02-02 00:00:00",
              "InvestigationChangeDate": "2004-05-25 00:00:00",
              "ParticipationPlansReviewDate": "2001-11-01 00:00:00",
              "HotWorkPermitReviewDate": "2001-11-01 00:00:00",
              "ContractorSafetyReviewDate": "2004-06-09 00:00:00",
              "ContractorSafetyEvalDate": "2001-11-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 45904,
                  "PreventionProgram3ID": 31493,
                  "ProcessChemicalID": 72521
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 38139,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-05-25 00:00:00",
    "ERTrainingDate": "2004-05-20 00:00:00",
    "CoordinatingAgencyName": "Fire Department",
    "CoordinatingAgencyPhone": "8187568696",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "CalOSHA, CCR Title 8, Section 3220; Title 19, Division 2 Chapter 4.5 CalARP Sections 2735.1-2785.1; CCR Title 8, Section 5189; CCR Title 8, Section 5192; CCR 66261; CCR Title 19, Sec. 2729-2732",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38139,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies\nNestlé USA produces a large variety of frozen foods at its Chatsworth Facility that are frozen and then shipped to various points around the country.  The facility covers approximately eight acres and has approximately 650 employees employed at the facility.  The Facility operates under strict federal, state, and company regulations for safety of its employees, its products and the environment.\n\nNestlé USA uses ammonia as a refrigerant in its frozen food processes.  By maintaining a comprehensive safety program for ammonia and documenting the program in this Risk Management Plan, Nestlé USA is complying with OSHA's and CalOSHA's Process Safety Management Standards (called PSM) and California's and EPA's Risk Management Program regulations (called RMP).\n\nNestlé USA  realizes that constant diligence in operation and proper maintenance of the ammonia system can reduce risks to its Associates and to the public.  This RMP documents the procedures and controls in place to ensure that potential accidental releases of ammonia are prevented and to promptly respond to and mitigate any incident that might occur.\n\nThe RMP and PSM programs are applied to all onsite activities that could involve or affect the ammonia system.  The safety programs prevent accidents because they focus on the rules, procedures and practices that govern individual processes, activities or pieces of equipment.  These rules are reviewed at regular intervals and modified if required and they are communicated to, accepted, and practiced by all employees at the facility.\n\nStationary Source and Regulated Substances\nAmmonia is handled at the facility as a refrigeration medium in a closed circuit system.  No chemical reactions or venting occurs in the normal operation of the system.  A total system capacity of 60,000  pounds of ammonia is the maximum inventory found at the site.  System components include compressors, condensers, accumulators, pipi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38139,
      "SummaryText": "ng and valves, instrumentation and controls and other miscellaneous components.  Ammonia is periodically received by tank truck to recharge the refrigeration system and make up for fugitive emission losses which are normal for this type of system.\n\nAnhydrous ammonia refrigerant (Ammonia) is not used in any chemical reactions or chemical processes.  Ammonia is used to transfer heat away from freezers in a continuous cycle of evaporation, condensation and compression.  The ammonia is continuously recycled, so that make up or replacement of ammonia is done infrequently.  Under normal operations, only very small, undetectable quantities are emitted.  Anhydrous ammonia is a clear colorless gas with a characteristic odor and, although it is classed as a nonflammable gas, it will burn within certain vapor concentration limits, and the fire hazard will increase with the presence of oil or other combustible materials.  It is shipped as a liquid under pressure and it is soluble in water forming a corrosive liquid.  Although ammonia is lighter than air, the vapors from a leak are cold and will initially hug the ground until they warm up and mix with air.  \n\nGeneral Accident Release Prevention Program\nNestlé USA has integrated program elements described in the RMP to deal with the risks involved with the storage and handling of ammonia throughout the refrigeration process.  In this way, overall plant, worker and public safety is promoted.  The program elements include:\n\nProcess Safety Information - The ammonia refrigeration process has been designed and installed by reputable vendors who are well known in the refrigeration industry.  It is required that information on the design and operation of the facility be documented and maintained for as long it is in operation. \nProcess Hazard Analysis - All of the processes involving ammonia have been thoroughly analyzed for unseen hazards using a trained team of employees with experienced hazard analysis leaders. \nOperating Procedures"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38139,
      "SummaryText": "- Formal written procedures for operation and maintenance of our ammonia refrigeration system has been developed as part of our RMP.  Procedures provide steps for each operating phase, they also document operating limits, safety and health considerations, and safety systems and their functions. \nTraining - Nestlé USA,s refrigeration technicians have many years of experience in operating ammonia refrigeration systems.  Several of them have 4 year degrees in technical subjects in addition to their work experience.  Nestlé USA certifies that their operators are competent.  As required by Nestlé USA, all technicians have proper training either before or after they are hired and periodic refresher training is conducted at the facility.\nMechanical Integrity - Preventive maintenance practices have been in place for a number of years at Nestlé USA.  Routine safety checks, inspections and preventive maintenance tasks on refrigeration systems are conducted to reduce the likelihood and severity of equipment failures. \nOutside experts, including pressure vessel and piping inspectors, are employed as needed to provide ongoing verification of the integrity of the system.  Hot work procedures, Lockout/Tagout procedures and others are used to document and control safe work practices.\nManagement of Change - Changes to the process, including chemicals, technology, equipment and procedures and changes to equipment that could affect the ammonia system are managed through use of a written management of change procedure.  Designated management personnel must authorize changes under this program element.  \nPre-startup Safety Review - Before a major change can be instituted, Pre-startup Safety Review requires that Construction and equipment is in accordance with design specifications, procedures are in place and adequate, process hazard analysis is performed and recommendations resolved and training is conducted.\nCompliance audits - Under RMP Nestlé is required to evaluate compliance with"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 38139,
      "SummaryText": "the RMP regulations at least every three years.  \nIncident Investigation - The RMP requires that incidents which resulted in or could reasonably result in a catastrophic release of ammonia be investigated promptly by a team of investigators with the appropriate knowledge and experience to thoroughly investigate and analyze the incident. \nEmployee Participation - Employees (Associates) are encouraged and required to participate in program development and enforcement.  A documented system is in place that verifies employee participation and awareness with each program element. \nHot Work Permit - Before work is performed which involves a potential source of ignition, designated personnel must inspect the work area, review the procedures and document the precautions necessary to prevent fires or explosions.  The written permit authorizes work on specific dates and on specific equipment. \nContractors - Nestlé USA has adopted the recommended practices of the International Institute of Ammonia Refrigeration's recommended practices for controlling contractors in the workplace. \nThe contractor's safety record, training program and procedures are evaluated before they are hired and periodically during the course of the contract. \n\nFive year Accident History\nEPA requires that facilities document a five year history of accidental releases that caused serious onsite or offsite consequences.  The Chatsworth Facility has had no serious accidents in the last five years.  \n\n Planned and Completed Changes to Improve the Safety of the System:\nThrough the process of developing and implementing Process Safety Management and Risk Management Programs,  a number of improvements have been identified and either implemented or are in the process of being implemented, including the following:\n Ammonia Detection systems were installed.\n-Nondestructive testing of vessels and other equipment is conducted periodically.\n-All relief valves in ammonia service are on a replacement schedule.\n-The train"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 38139,
      "SummaryText": "ing program is periodically reviewed with periodic, detailed in Plant refrigeration training for the refrigeration technicians.\n-Operating and maintenance procedures are reviewed and updated as required.\n-Process safety information is being updated.                                                                                                                                                                    ExternalEvents                                                                                                                                                                      The Plant is in a seismic zone 4 area.                                                                                                                         Seismic Assessment - Walk through A third Party seismic walk through is completed every five years.  The purpose of the walkthrough is to identify where opportunities exist to reduce the risk of system failure during an earthquake.  The most recent walkthrough was conducted in May 2004 with a report issued on June 1, 2004.  The assessment meets the CalARP Seismic Program.                                                                                                                                                                         The risk of damage by tornados, hurricanes, floods, forest fires, is low."
    }
  ]
}