{
  "FacilityID": 38227,
  "FacilityName": "Grass Valley Wastewater Treatment Plant",
  "FacilityStr1": "556 - C Freeman Lane",
  "FacilityStr2": null,
  "FacilityCity": "Grass Valley",
  "FacilityState": "CA",
  "FacilityZipCode": "95945",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06057",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "39.205278",
  "FacilityLongDecDegs": "-121.055278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Grass Valley",
  "OperatorStr1": "125 E. Main St.",
  "OperatorStr2": null,
  "OperatorCity": "Grass Valley",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95945",
  "OperatorZipCodeExt": null,
  "RMPContact": null,
  "RMPTitle": "Director of Public Works",
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000105977",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-01 00:00:00",
  "SafetyInspectionBy": "Aetna Insurance",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-09-09 00:00:00",
  "DeRegistrationEffectiveDate": "2009-09-01 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 39.20528,
  "FRS_Long": -121.06806,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 54965,
      "AltID": "Disinfection",
      "FacilityID": 38227,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 56221,
          "ProcessID": 54965,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 72701,
          "ProcessID": 54965,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 72702,
          "ProcessID": 54965,
          "ChemicalID": 49,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 572701,
          "ProcessID": 54965,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 572702,
          "ProcessID": 54965,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38227,
      "SummaryText": "The City of Grass Valley has instituted a Risk Management Program for their wastewater treatment facility, Grass Valley Wastewater Treatment Plant, as required by Federal Accidental Release Prevention (ARP) Program regulations at 40 CFR Part 68.  The Risk Management Program identifies the equipment, procedures, maintenance, inspection, and training associated with Regulated Substances (RS's) handled at this facility in excess of Federal threshold quantities; describes the structured assessment of hazards which was conducted to assess possible effects on employees and offsite public and environmental receptors; provides the results of an offsite consequences analysis; defines a prevention program, emergency response program, and mitigation measures to reduce the probability and magnitude of accidental releases of RS's; and establishes a schedule and responsibilities for implementation of mitigation measures and auditing of program elements.  This Risk Management Plan(RMP) is being filed as required by ARP regulations in order to report the elements of the current Risk Management Program and to describe further measures planned to mitigate or prevent accidental releases of RS's.  \n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nThe City of Grass Valley's  Wastewater Treatment Plant is located at 556C Freeman Lane, Grass Valley, CA in Nevada County, and uses chlorine and sulfur dioxide for disinfection and dechlorination in quantities greater than the Federal threshold quantity for these RS's.  The facility is located in a ravine on the west side of town.  There are 13 full-time employees at this site.  Chlorine and sulfur dioxide are received in ton containers by truck, handled with an electric hoist, and stored on ton container scales and trunnions inside the building.  The chlorine is used for odor control of the influent wastewater, to disinfect the wastewater effluent, and for other process uses.  The sulfur dioxide is used to dechlorinate the disinfected eff"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38227,
      "SummaryText": "luent for aquatic toxicity control.  Pressurized chlorine gas within a ton container is withdrawn under pressure and piped to a vacuum regulator valve located in the storage room where the gas pressure is reduced to vacuum.  From there, the chlorine under vacuum is metered through rate valves and rotameters in chlorinators located in a separate room, and drawn into water solution by the passage of pressurized water through an injector.  Liquid sulfur dioxide is withdrawn from ton containers and evaporated to gas in an electrically-heated evaporator with a water bath surrounding a pressure vessel.  Pressurized gas from the evaporator is reduced to vacuum, metered, and fed to chlorinated effluent in a manner identical to the process for chlorination.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nIt is the policy of the City of Grass Valley that the receipt, storage and handling of chlorine and sulfur dioxide at its facility be done in a manner which meets regulatory requirements and minimizes the probability and severity of accidental releases of chlorine or sulfur dioxide to the atmosphere, in order to protect the health and safety of its workers, the public, and the environment.  In order to accomplish this goal, the City of Grass Valley has gathered safety information on chlorine and sulfur dioxide and on the process, equipment and procedures involving chlorine and sulfur dioxide; performed a structured assessment of hazards of the process and external events which might affect the process; performed an offsite consequences analysis of defined release scenarios; established a written program for prevention and mitigation of accidental releases; and established a written emergency response program coordinated with emergency response agencies.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAMS\n\nGeneral accidental release prevention programs instituted by the City of Grass Valley are categorized as administrative (management) programs; procedures, train"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38227,
      "SummaryText": "ing, and engineering controls; and emergency response programs. The City of Grass Valley has instituted a Process Safety Management (PSM) Program meeting OSHA requirements at 29 CFR 1910.119 covering its disinfection and dechlorination process.  This constitutes the general accidental release prevention program for the City of Grass Valley's operations.  The program and document mangement procedures included in the PSM Program are used as the management system for the Risk Management Program.\n\nCHEMICAL-SPECIFIC RELEASE PREVENTION STEPS\n\nRelease prevention steps specific to chlorine and sulfur dioxide have been identified and implemented.  These include, among other things, discontinuing storage of full ton containers on rails outside the building, improving egress from the chlorine storage room, and rebuilding the chlorine and sulfur dioxide headers.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no accidents involving chlorine or sulfur dioxide at this facility within the past five years resulting in injuries or offsite consequences.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe City of Grass Valley's Emergency Response Program applicable to chlorine and sulfur dioxide has been coordinated with Nevada County Department of Environmental Health, the local agency responsible for hazardous materials inventory reporting and release response coordination.  It consists of notifying First Responders and evacuating persons on site to a safe location.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nAll of the improvements and mitigation measures identified in the process hazard analysis which the City of Grass Valley committed to accomplish have been completed or are in progress.  Any other measures identified by employees during workplace hazard surveys, or as a result of audit activities, will be thoroughly reviewed and considered for implementation."
    }
  ]
}