{
  "FacilityID": 3822,
  "FacilityName": "VAN WATERS AND ROGERS INC",
  "FacilityStr1": "10889 BEKAY ST",
  "FacilityStr2": null,
  "FacilityCity": "DALLAS",
  "FacilityState": "TX",
  "FacilityZipCode": "75238",
  "Facility4DigitZipExt": "1313",
  "FacilityCountyFIPS": "48113",
  "LEPC": "DALLAS COUNTY LEPC",
  "FacilityLatDecDegs": "32.901306",
  "FacilityLongDecDegs": "-96.695833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A6",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 102971785,
  "ParentCompanyName": "VAN WATERS AND ROGERS INC",
  "Company2Name": null,
  "CompanyDUNS": 102971785,
  "Company2DUNS": 0,
  "OperatorName": "PAT WALKER",
  "OperatorStr1": "10889 BEKAY STREET",
  "OperatorStr2": null,
  "OperatorCity": "DALLAS",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75238",
  "OperatorZipCodeExt": "1313",
  "RMPContact": "MICHAEL LINSCOMB",
  "RMPTitle": "BRANCH OPERATIONS MANAGER",
  "FTE": 58,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000046979",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-03-31 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP Pro 98",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 32.9016,
  "FRS_Long": -96.69643,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4431,
      "AltID": "Containerized Storage",
      "FacilityID": 3822,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4533,
          "ProcessID": 4431,
          "NAICSCode": "42269",
          "_desc": {
            "NAICS_CODE": "42269",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4722,
          "ProcessID": 4431,
          "ChemicalID": 57,
          "Quantity": 29559.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 4723,
          "ProcessID": 4431,
          "ChemicalID": 1,
          "Quantity": 15540.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 4724,
          "ProcessID": 4431,
          "ChemicalID": 55,
          "Quantity": 6160.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 4725,
          "ProcessID": 4431,
          "ChemicalID": 26,
          "Quantity": 22000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 26,
            "ChemicalName": "Ethylenediamine  [1,2-Ethanediamine]",
            "CASNumber": "107-15-3",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 4726,
          "ProcessID": 4431,
          "ChemicalID": 31,
          "Quantity": 15375.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 31,
            "ChemicalName": "Cyclohexylamine  [Cyclohexanamine]",
            "CASNumber": "108-91-8",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504722,
          "ProcessID": 4431,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504723,
          "ProcessID": 4431,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504724,
          "ProcessID": 4431,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504725,
          "ProcessID": 4431,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504726,
          "ProcessID": 4431,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3822,
      "SummaryText": "VAN WATERS AND ROGERS INC\nDALLAS TX FACILITY RMP PLAN\nEXECUTIVE SUMMARY\n\nCOMPANY OVERVIEW\n\nVan Waters & Rogers Inc. is a wholesale chemical distributor serving a number of U.S. industries.  Founded in 1924, VW&R supplies the food industry, chemical compounders, pharmaceuticals, mining, forest products, oil and gas producers, electronics, coatings and many other key industries with the chemical raw materials required to produce or refine products used in numerous end-use markets.\n\nVan Waters & Rogers Inc. is a member of the National Association of Chemical distributors (NACD) and complies with the Responsible Distribution Process (RDP), an environmental, health and safety improvement initiative.\n\nSome of the products stored and handled by VW&R are subject to EPA's Risk Management Program rule (40 CFR Part 68).  A key requirement of this rule is the preparation and submission of an RMP Plan, contained herein.  The contents of the RMP Plan are prescribed by EPA, including this Executive Summary.\n\nCORPORATE PREVENTION AND EMERGENCY RESPONSE APPROACH\n\n1. Prevention Program\n\nProcesses that are subject to OSHA's Process Safety management (PSM) standard AND are regulated under EPA's RMP rule are subject to the Program 3 Prevention program.  Van Waters & Rogers Inc. has documented the Prevention Program in its Process Safety Management Manual.  Briefly, this program includes provisions and requirements for:\n\n* Process Safety Information\n* Process Hazard Analysis\n* Operating Procedures\n* Training\n* Mechanical Integrity\n* Management of Change\n* Pre-Startup Review\n* Compliance Audits\n* Incident Investigation\n* Employee Participation\n* Hot Work permits\n* Contractors\n\n2. Emergency Response Approach\n\nVan Waters & Rogers Inc. has an Emergency Contingency Plan in place.  This Plan is shared with local emergency responders who have access to VW&R facility personnel (and up-to-date phone numbers).  VW&R responds to minor incidents but will call in professional emergency responders in "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3822,
      "SummaryText": "the event of all other incidents.\n\nVW&R invites and encourages local emergency responders such as the fire department to visit and familiarize themselves with VW&R products and facilities.  Joint emergency exercises are conducted when possible.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nOur facility's primary activities encompass Chemical Repackaging, Storage & Distribution.  We have five regulated substances present at our facility.  The substances are Formaldehyde 37% Solution, Ammonia Aqueous 30%, Hydrogen Fluoride/Hydrofluoric Acid (Hydrofluoric) 70%, Ethylenediamine (1,2,-Ethylenediamine), Cyclohexylamine (Cyclohexanamine).\n \nListed below are the way the five RMP regulated substances are stored/handled on site and the maximum inventories present at any one time.\n\n1. Formaldehyde 37% is received in 55 gal drums and stored in our warehouse for distribution to end use customers. The estimated maximum inventory of Formaldehyde 37% onsite at anyone time will be 15,540 lbs for container storage.\n\n2. Ammonia Aqueous 30% is packaged into 55 gal and 330 gal containers and moved into storage for distribution to our end use customers.  The estimated maximum inventory of Ammonia Aqueous 30% onsite at any one time will be 29,559 in container storage. \n\n3. Hydrogen Fluoride/Hydrofluoric Acid (Hydrofluoric) 70% is received in 55 gal drums which are stored in our warehouse for distribution to end use customers. The estimated maximum inventory of Hydrofluoric Acid onsite at any one time will be 6,610 lbs for container storage. \n\n4. Ethylenediamine (1,2-Ethylenediamine) is received by truck in 55 gal containers which are stored in our warehouse for distribution to end use customers. The estimated maximum inventory of Ethylenediamine onsite at any one time will be 22,000 lbs for container storage.\n\n5. Cyclohexylamine (Cyclohexylamine) is received by truck in 55 gal drums and stored in our warehouse for distribution to our end use customers. The estimated maximum invento"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3822,
      "SummaryText": "ry of Cyclohexylamine onsite at any one time will be 15,375 lbs for container storage.\n\nWORST CASE RELEASE SCENARIO & ALTERNATE RELEASE SCENARIO\n\n(Including administrative controls and mitigation measures to limit the distances for each reported scenario.)\n\nTo perform the required offsite consequence analysis for our facility, we have used the look-up, tables and equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance.  The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenarios submitted for Program 2 and 3 substances as a class involves separate catastrophic releases from each of the RMP substances in inventory onsite. Each RMP liquid is assumed to be immediately released to form a pool of 1 cm height, from which evaporation takes place. The entire pool is estimated to have evaporated over 10 minutes. By using Class F atmospheric stability and 1.5 m/s wind speed.  Listed below are the maximum distances in miles and the corresponding toxic endpoint of mg/L for each individual RMP substance inventoried onsite using the above conditions. For each Alternate Release Scenario onsite Emergency Personnel and Equipment were considered for active mitigation .RMP Comp software was used for modeling purposes.\n\n\n1. Worse Case Scenario release of 177 lbs Formaldehyde 37% solution, the maximum distance of less than 0.1 miles is obtained corresponding to a toxic endpoint of .012 mg/L.\n\n2. Worse Case Scenario release of 690 lbs Ammonia Aqueous 30%, the maximum distance of less than <0.1 miles is obtained corresponding to a toxic endpoint of .14 mg/L.\n\n3. Worse Case Scenario release of 385 lbs Hydrogen Fluoride/Hydrofluoric Acid 70%, the maximum distance of less than 0.1miles is obtained corresponding to a toxic endpoint of .016 mg/L.\n\n4. Worse Case Scenario release of 400 lbs Ethylenediamine (1,2-Ethanediamine), the maximum distance of less than <0.1 miles is obtained corresponding to a toxic endpoint of .49 mg/L \n\n5. "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3822,
      "SummaryText": "Worse Case Scenario release of 252 lbs Cyclohexylamine (Cyclohexanamine), the maximum distance of less than <0.1 miles is obtained corresponding to a toxic endpoint of .16 mg/L.\n\n6. Alternate Case Scenario release of 80 lbs Formaldehyde 37% solution, the maximum distance of less than 0.1 miles is obtained using class D stability and 3m/s wind speed.\n\n7. Alternate Case Scenario release of 55 lbs Ammonia Aqueous 30% the maximum distance of less than <0.1miles is obtained Class D stability and 3m/s wind speed.\n\n8. Alternate Case Scenario release of 175 lbs Hydrogen Fluoride/Hydrofluoric Acid 70%, the maximum distance of less than 0.1 miles obtained using class D stability and 3m/s wind speed.\n\n9. Alternate Case Scenario release of 180 lbs Ethylenediamine (1,2-Ethylenediamine), the maximum distance of less than <0.1 miles obtained using Class D stability and 3m/s wind speed.\n\n10. Alternate Case Scenario release of 110 lbs Cyclohexylamine (Cyclohexanamine), the maximum distance of less than <0.1 miles obtained using class D stability and 3m/s wind speed. \n  \nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM \n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition.  A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119.The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\n\nVan Waters & Rogers Inc maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 3822,
      "SummaryText": "out these analyses is the \"What-If\" technique. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of five years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our covered processes, Van Waters & Rogers Inc maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\n\nVan Waters & Rogers Inc has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every year and more frequently as needed.\n\nMechanical Integrity\n\nVan Waters & Rogers Inc carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\n\nWritten procedures are in place at Van Waters & Rogers Inc to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are prompt"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 3822,
      "SummaryText": "ly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Van Waters & Rogers Inc.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\n\nVan Waters & Rogers Inc conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\n\nVan Waters & Rogers Inc promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\n\nVan Waters & Rogers Inc truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Van Waters & Rogers Inc has a strict policy of informing the contractors of known potential hazards related the contractor's work and th"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 3822,
      "SummaryText": "e processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nVan Waters & Rogers Inc has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, no accidental release of the above RMP substances have occurred during this period.\n\nEMERGENCY RESPONSE PLAN\n\nVan Waters & Rogers Inc is strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, our highly trained emergency response personnel are at hand to control and mitigate the effects of the release.  We are also completely coordinated with the local Fire Department which provides additional emergency response expertise.\n\nVan Waters & Rogers Inc carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nCERTIFICATION STATEMENT\n\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complet"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 3822,
      "SummaryText": "e.\n\nName:        ________________________________________\n\nSignature:    ________________________________________\n\nTitle:        ________________________________________\n\nDate signed:    ________________________________________\n\n"
    }
  ]
}