{
  "FacilityID": 38252,
  "FacilityName": "Rogas Loading Facility",
  "FacilityStr1": "21143 Stockdale Hwy",
  "FacilityStr2": "1 mile East of Hwy 43 (Enos Lane)",
  "FacilityCity": "Bakersfield",
  "FacilityState": "CA",
  "FacilityZipCode": "93312",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.352222",
  "FacilityLongDecDegs": "-119.235000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Inergy, L.P.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Inergy, L.P.",
  "OperatorStr1": "P.O. Box 430",
  "OperatorStr2": "9224 Tupman Road",
  "OperatorCity": "Tupman",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93276",
  "OperatorZipCodeExt": "0430",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000142703",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-03-21 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 35.3952,
  "FRS_Long": -119.158,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 54990,
      "AltID": "Rogas",
      "FacilityID": 38252,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 72729,
          "ProcessID": 54990,
          "ChemicalID": 155,
          "Quantity": 6705360.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 54328,
              "ProcessChemicalID": 72729,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 54329,
              "ProcessChemicalID": 72729,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 54330,
              "ProcessChemicalID": 72729,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 56246,
          "ProcessID": 54990,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 21020,
              "Process_NAICS_ID": 56246,
              "SafetyReviewDate": "2002-02-01 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": "National Electrical Code, 1997 Uniform Building Code, Gas Processors Association Safety Inspection Checklist, Title 19 CCR 2735, Title 40 CFR Part 68",
              "FR_Comments": null,
              "HazardReviewDate": "2002-07-01 00:00:00",
              "ChangeCompletionDate": "2007-07-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": "Rail car metering and gauging",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Facility containment, Fire Protection System consisting of hydrants and deluge system",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": "Tank metering and gauging; Operator attendance during product transfer; fire eyes; LEL monitors",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 1,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "SDVs for each station, Fisher N562 control valves, removed two storage tanks (50,000 gallons); automated control system for loading and unloading.",
              "OpProceduresReviewDate": "2004-03-12 00:00:00",
              "TrainingReviewDate": "2004-03-12 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Safety meetings and employee participation",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-03-12 00:00:00",
              "EquipmentInspectionDate": "2004-03-12 00:00:00",
              "EquipmentTested": "Check valves, flanges, fittings, and connections for leaks.",
              "ComplianceAuditDate": "2004-03-12 00:00:00",
              "AuditCompletionDate": "2007-03-12 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2002-02-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Rogas Loading Facility",
              "_chemicals": [
                {
                  "PrimaryKey": 21967,
                  "PreventionProgram2ID": 21020,
                  "ProcessChemicalID": 72729
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 38252,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-03-12 00:00:00",
    "ERTrainingDate": "2004-03-12 00:00:00",
    "CoordinatingAgencyName": "Kern County Fire Department",
    "CoordinatingAgencyPhone": "6618313467",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38252,
      "SummaryText": "Inergy, L.P. acquired the Rogas facility on October 1, 2003.  The Rogas Facility is a Liquefied Petroleum Gasoline (LPG) and Natural Gasoline Liquids loading and unloading rail car transfer facility.  The facility operations are regulated by Title 19 California Code of Regulations 2735 California Accidental Release Prevention Program (Cal ARP) and 40 Code of Federal Regulations Part 68 Risk Management Program (RMP).  This facility meets the requirements for a RMP/CalARP Program Level 2, however, the facility maintains the requirements of a program 3 as a management commitment to employee and public safety.  The facility management has implemented the prevention program described below.\n\nTHE FACILITY AND THE REGULATED SUBSTANCE HANDLED\n\nThe Rogas facility consists of two rail spurs that can handle 20 rail cars, one for each loading/offloading rack.  Rogas is connected to the Inergy North Coles Levee Fractionator via three DOT regulated pipelines (two liquid and one vapor).  \n\nThis facility and pipelines have recently been modernized through the addition of computer controls, the addition of a rail spur, new loading/unloading rack, and completion of all 1999 Process Hazard Analysis recommendations.  In addition, all piping and transfer control devices were replaced.  The facility design standards for the modernization included the 1997 Uniform Building Code, ANSI B31.3-1996 Process Piping, NFPA 58 Liquefied Petroleum Gas Code-2001, Federal Railroad Association, and Department of Transportation.  Fire protection upgrades are compliant with the California Fire Code and Kern County Fire Department.  \n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe accidental release prevention program is based on the requirements of 40 CFR Part 68 and Title 19 CCR 2735, which includes the following: Offsite Consequence Analysis, Employee Participation, Process Hazard Analysis, Operating Procedures, Training, Contractor and Visitor Orientation, Pre-Job Start-Up Safety Review, Mechanical Integ"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38252,
      "SummaryText": "rity, Hot Work Permit, Management of Change (MOC), Incident Investigation, Emergency Planning and Response and Compliance Audits.  Employee participation includes issuing Hot Work permits, reviewing and participating in hazard reviews and MOCs, conducting contractor orientations, and annually reviewing operating procedures.\n\nThe fire protection system is new and includes pumps, fire monitors, fire hydrants, loading rack deluge, gas detectors, and fire detection systems interlocked to shutdown the process and activate the deluge.  In addition, the process maintains mitigation measures consisting of relief valves, check valves, manual shut off valves, automatic shutoffs, startup and operating procedures, grounding equipment and, excess flow devices. The loading rack operator and truck driver are in attendance during transfer operations.\nEXTERNAL EVENTS ANALYSIS\n\nIn May 1999, an external event analysis consisting of a preliminary seismic walkthrough was conducted. This walkthrough was comprised of a visual inspection of the above grade process piping and vessels. The reference used for the 1999 walkthrough were the following:\n\n?    API Standard 570 Pressure Vessel Inspection Code: Maintenance Inspection, Rating, Repair, and Alteration.\n?    Processes Unlimited International, Inc., Engineered Safety Section, CalARP Seimic Assessment Procedures, April 12, 1999.\n?    Uniform Building Code, 1997 Edition, International Conference of Building Officials.\n\nThe seismic walkthrough determined that, based on the document \"Maps of Known Active Fault Near-Source Zones in California and Adjacent Portions of Nevada\", and the Uniform Building Code - 1997, this facility resides outside the boundaries and contours of a Near-Source Fault Zone.  The recommendations from this analysis were incorporated in the 2001 facility upgrade and subsequent modifications.  \n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICY\n\nThe accidental release prevention and emergency response policy have been es"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38252,
      "SummaryText": "tablished by Inergy management and implemented by the employees.  In the event of an accidental release, the facility operators are trained to shut off the source from a safe location or activate one of the emergency shutdown devices, contact 9-1-1 and secure the area.  The 9-1-1 system is used to notify the Fire Department.\n\nEMERGENCY RESPONSE PROGRAM\n\nInergy, L.P. maintains an emergency response plan in compliance with local emergency response agencies and a Hazardous Materials Business Plan on file with the Kern County Environmental Health Department - Certified Unified Program Agency.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe five-year accident history, which is based on the criteria set forth in 40 CFR 68.10 and Title 19 CCR 2735.4, shows that this facility has not had a reportable accidental release.  \n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nPlanned changes to improve safety have been established based upon the Risk Management Plan/Process Safety Management compliance audits and revalidation of the process hazard analyses.  Training includes employee responsibilities in the RMP/PSM programs, new employee orientation, emergency response, hot work permit procedures, and operating procedures. Additionally, planned changes to improve seismic safety of the facility were incorporated into the Process Hazard Analysis. The 1999 PHA recommendations were incorporated into the 2001 facility modernization and upgrades.  This upgrade included a new fire protection system consisting of fire monitors, fire hydrants, a 500,000-gallon fire water storage tank, and rail car deluge.  In addition, two propane storage tanks have been removed, thus reducing the risk by removing the permanent storage capacity at this facility.  \n\nMANAGEMENT COMMITTMENT\n\nInergy, L.P. has a commitment to employee and public safety.  This commitment is demonstrated by maintaining the implementation of the process safety requirements established at the facility since 1993.  Furthermore, the resources invested in acci"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 38252,
      "SummaryText": "dent prevention, such as modernization of transfer operations, piping upgrades, training personnel and considering safety in design during construction and installation is an investment in good business practices.  Inergy's policy is to implement reasonable controls to prevent foreseeable releases and reduce the risk to employees and the public.  However, if a release does occur, trained personnel will respond to control and contain the release."
    }
  ]
}