{
  "FacilityID": 38253,
  "FacilityName": "Southside Water Reclamation Plant",
  "FacilityStr1": "4201 2nd Street SW",
  "FacilityStr2": null,
  "FacilityCity": "Albuquerque",
  "FacilityState": "NM",
  "FacilityZipCode": "87105",
  "Facility4DigitZipExt": "0511",
  "FacilityCountyFIPS": "35001",
  "LEPC": "Bernalillo County LEPC",
  "FacilityLatDecDegs": "35.017778",
  "FacilityLongDecDegs": "-106.670278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "WR",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Albuquerque",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Albuquerque",
  "OperatorStr1": "4201 2nd Street SW",
  "OperatorStr2": null,
  "OperatorCity": "Albuquerque",
  "OperatorStateFIPS": "NM",
  "OperatorZipCode": "87105",
  "OperatorZipCodeExt": "0511",
  "RMPContact": "Douglas S. Dailey",
  "RMPTitle": "Wastewater Utilities Div. Mgr.",
  "FTE": 215,
  "OtherEPAFacilityID": "NM0022250",
  "EPAFacilityID": "100000154343",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "1418",
  "SafetyInspectionDate": "2003-07-10 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-03-25 00:00:00",
  "DeRegistrationEffectiveDate": "2011-09-01 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 35.01781,
  "FRS_Long": -106.6703,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "stop using gaseous chlorine for effluent disinfection and sulfur dioxide",
  "_processes": [
    {
      "ProcessID": 54991,
      "AltID": "Chlorination",
      "FacilityID": 38253,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 56247,
          "ProcessID": 54991,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 72730,
          "ProcessID": 54991,
          "ChemicalID": 62,
          "Quantity": 100000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 572730,
          "ProcessID": 54991,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 54992,
      "AltID": "Dechlorination",
      "FacilityID": 38253,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 56248,
          "ProcessID": 54992,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 72731,
          "ProcessID": 54992,
          "ChemicalID": 49,
          "Quantity": 60000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 572731,
          "ProcessID": 54992,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38253,
      "SummaryText": "In June 1996, the U.S. Environmental Protection Agency (EPA) issued Risk Management program (RMProgram) regulations (40 CFR Part 68).  Regulated under the Clean Air Act Amendments (CAAA), Section 112?, the RMProgram requires facilities that store large amounts of listed hazardous chemical substances to prepare and implement risk management plans to reduce the probability of accidental releases and minimize the health risks to the public and the environment.  The RMProgram regulates 77 listed toxic substances and 63 listed flammable substances.  It is expected that the RMProgram regulations apply to an estimated 7,200 public and private drinking water and wastewater treatment facilities nationwide where chlorine, ammonia, sulfur dioxide or other toxic chemicals are used.\n\nSource, Substances, Uses, and Quantities\n\nThe Southside Water Reclamation Plant (SWRP) in Albuquerque, New Mexico is the City of Albuquerque's only wastewater treatment plant, currently serving more than 400,000 people in the area.  The SWRP currently receives, treats, and releases approximately 55 million gallons per day of wastewater from residential, commercial and industrial sources.  The facility stores and uses only two regulated chemicals, anhydrous chlorine and sulfur dioxide, in quantities higher than the threshold quantities.  The terms anhydrous chlorine and chlorine are used interchangeably and specifically refer to a chemical listed in the RMProgram regulations.\n\nThe chlorine is used at the chlorination facility as a disinfectant in the wastewater.  Chlorine is stored within a building in two 25-ton bulk storage tanks.  The total maximum intended inventory for chlorine is 100,000 pounds.  The chlorine is liquefied under pressure in the bulk storage tanks.  Liquid chlorine is drawn off the bulk storage tanks into four chlorine evaporators that transform the liquid chlorine into gaseous chlorine.  The gaseous chlorine is then metered through 11 chlorinators and delivered to the various ap"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38253,
      "SummaryText": "plication points.  The chlorine solution is then fed to varied chlorine feed points.  The sulfur dioxide is used in a dechlorination process in which sulfur dioxide reacts with water and hypochlorous acid created by the chlorination process.  The hypochlorous acid must be removed from the wastewater before discharging the effluent into the Rio Grande as hypochlorous acid has detrimental effects on aquatic life.  The sulfur dioxide is stored in the dechlorination storage building in two 15-ton bulk storage tanks.  The maximum intended inventory of sulfur dioxide is 60,000 pounds.  The facility is subject to the OSHA PSM Standard and therefore, the chlorination and dechlorination processes are subject to the Program Level 3 RMProgram Regulations.\n\nIn addition to the two regulated chemicals, the facility stores and uses other hazardous chemicals.  Methane gas is a byproduct of the anaerobic process used to treat wastewater sludge.  Microorganisms metabolize the sludge and create carbon dioxide and methane.  The anaerobic digestion facility consists of 14 anaerobic sludge digesters, two low-pressure gas holders, one high pressure gas sphere, compressors, and electric cogeneration equipment.  The maximum intended inventory is 14,100 pounds of digester gas of which approximately 65% is methane.  The largest container is the high pressure gas sphere that holds approximately 3,500 pounds of digester gas.  The methane is used as a hydrocarbon fuel on-site to provide electrical power for the facility.  The EPA issued an administrative stay to exempt hydrocarbon fuels used on-site for fuel purposes at quantities less than 67,000 pounds from the RMProgram regulations.  EPA Region 6 was contacted to provide guidance on whether this stay applies to the SWRP.  The Region determined that the methane was simply a by-product of the process and not manufactured on-site.  Therefore, since the methane is used to generate electrical power, the stay applies to the facility.  Therefore, th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38253,
      "SummaryText": "e methane process is not reported in this RMP submission.  Because of the general duty clause, available system information was reviewed and is outlined in the RMProgram including information on how to complete a system safety review.\n\nPrevention and Emergency Response Policies\n\nThe major driving force in the development of the RMProgram regulations is reducing the risk to public health by minimizing the potential of a chemical release.  At the SWRP, many controls, procedures, and equipment are in place to minimize the potential for a release and to minimize the results of a release in the event that a release occurs.  The following items outline the safeguards used at the facility:\n\n1. Operators are trained in operations of the chlorination and dechlorination facilities, including day to day troubleshooting and recognition of operational problems;\n\n2. Continual monitoring of the facilities is accomplished using leak detectors equipped with alarms installed in the building where the chemicals are used and stored and a plant-wide computerized monitoring system that observes bulk tank weights, system operational parameters, and leak detector concentrations and alarm status;\n\n3. Although many safeguards significantly minimize the release potential, an emergency response plan is in place.  The plan outlines the procedures for the facility's trained personnel to assess the extent of any problem detected with a leak detector and either repair the problem or call in the City of Albuquerque=s hazardous materials response team (HazMat) team to assist;\n\n4. An extensive mechanical integrity program is used to ensure that mechanical failure does not result in release of chlorine or sulfur dioxide; and\n\n5. Both facilities are designed to reduce risk.  The buildings are constructed of non-combustible materials, the sulfur dioxide building is equipped with a scrubber system and a sprinkler system, and all systems comply with generally accepted good engineering practices and recogn"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 38253,
      "SummaryText": "ized industry standards such as the Chlorine Institute.\n\n6. The SWRP maintains a management system to ensure that both the OSHA PSM Plans and the RM program are implemented and maintained as required.  The Wastewater Utility Division Manager is the RMProgram Manager and the Plant Manager is the Alternate RMProgram Manager and the PSM Program Manager.\n\n7. Methane gas storage system is designed in accordance with applicable codes, such as building, fire and electrical codes.\n\nProgram Level 3 Chemical Release Prevention Program\n\nSince the SWRP is also subject to the OSHA PSM Standard, the facility has a PSM prevention program in place.  This program meets the requirements of the Program Level 3 RMProgram regulations.  The program consists of all the required prevention elements.  Key provisions of the prevention program are as follows:\n\n1. Written procedures have been prepared for the chlorination and dechlorination facilities, as well as the rest of the plant.  Procedures include directions for safe start-up and shutdown, normal operations, and emergency shutdown.\n\n2. SWRP operators receive initial training covering the entire facility and refresher training on the chlorination and dechlorination facilities.\n\n3. Incidences that resulted in a release, or could have resulted in a release, are investigated to improve the safety of the process.  Once investigations are completed, the results are shared with employees.\n\n4. Employees participate in process hazard analyses (PHA's) which identify potential hazards and ways to improve the safety of the process every five years, or when significant changes are made to the process.\n\n5. An employee participation program exists which utilizes weekly safety meetings to discuss various topics of the RMProgram and the PSM prevention program.  The employee participation program also outlines procedures for employees to gain awareness with the process and the program through other various means.\n\n6. The facility maintains original desi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 38253,
      "SummaryText": "gn data, contractor submittals, manufacturer's operation and maintenance manuals, and original as built contract drawings and specifications to ensure availability of all necessary process safety information.  In addition, design data related to electrical, relief system, ventilation and drawings have all been verified for the PSM Plan.   The process safety information is updated as needed.\n\n7. The SWRP has a long standing hot work permit procedure which covers all hot work conducted at the facility, not just near covered processes.\n\n8. A mechanical integrity program is in place and tracked utilizing a computerized maintenance management system.  The maintenance tasks and frequency were based upon industry standards, manufacturer=s recommendations, and mechanics experience. \n\n9. In addition, the facility has developed management of change procedures, pre-startup safety review procedures, contractor safety procedures, and a compliance auditing procedures.\n\nFive Year Accident History\n\nThe SWRP has not had any incidents that meet the RMProgram reporting requirements within the past five years.\n\nEmergency Response Program\n\nThe SWRP has an emergency response program in place for the facility, which includes emergencies related to the chlorination and dechlorination facilities.  The program consists of training all personnel in emergency procedures.  This training includes evacuation and emergency recognition procedures for all employees.  The emergency response plan presents specific procedures that are followed in the event of a chlorine or sulfur dioxide release.  Both the chlorination and dechlorination facilities are equipped with leak detectors.  In the event a leak is detected, an alarm sound (audible at the facility and on the plant-wide computerized control system).   The leak will be assessed and remedied, if possible by the SWRP's emergency response team.  If a leak is severe and cannot be controlled, the control room operator will be directed to evacuate the f"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 38253,
      "SummaryText": "acility.  The control room operator announces the evacuation notice and is also responsible for contacting the Albuquerque Fire Department Hazardous Response Team as well as Albuquerque dispatch who will notify key SWRP personnel.  The HazMat team will establish command upon responding.  The SWRP emergency response team and other key personnel will assist the HazMat team.\n\nPlanned Changes to Improve Safety\n\nThe SWRP has reviewed the initial compliance audit and the recommendations from the initial PHA and will evaluate and perhaps implement the recommendation, as necessary.  The recommendations include making improvements to the maintenance program including maintenance personnel training, installing alarm lights to help with evacuation in loud areas, the addition of gauges to evaluate the unloading process better, and reconfiguration of the relief and angle valve assembly on the chlorine bulk tanks to allow easier access.  \n\nIn addition, the facility has conducted an alternative disinfectant evaluation.  Changing to an alternative disinfectant will significantly reduce the amount of chlorine stored on-site and completely remove all sulfur dioxide on-site."
    }
  ]
}