{
  "FacilityID": 38278,
  "FacilityName": "City of Tacoma, Central Wastewater Treatment Plant",
  "FacilityStr1": "2201 Portland Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Tacoma",
  "FacilityState": "WA",
  "FacilityZipCode": "98421",
  "Facility4DigitZipExt": "2711",
  "FacilityCountyFIPS": "53053",
  "LEPC": "Pierce County, WA",
  "FacilityLatDecDegs": "47.248056",
  "FacilityLongDecDegs": "-122.415000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.cityoftacoma.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 965083595,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Tacoma, P W Sewer Utility",
  "OperatorStr1": "2201 Portland Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Tacoma",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98421",
  "OperatorZipCodeExt": "2711",
  "FTE": 237,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000093365",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-06-11 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-02-06 00:00:00",
  "DeRegistrationEffectiveDate": "2008-04-05 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 47.24722,
  "FRS_Long": -122.41347,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "the entire chlorine gas system has been removed",
  "_processes": [
    {
      "ProcessID": 55028,
      "AltID": "Wastewater Disinfection",
      "FacilityID": 38278,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 72770,
          "ProcessID": 55028,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 56285,
          "ProcessID": 55028,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 31605,
              "Process_NAICS_ID": 56285,
              "SafetyReviewDate": "2004-05-07 00:00:00",
              "PHA_Date": "2004-05-11 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-06-18 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Automatic shutoff valves",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Remote Camera",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-05-07 00:00:00",
              "TrainingReviewDate": "2004-06-04 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-06-04 00:00:00",
              "EquipmentInspectionDate": "2004-05-17 00:00:00",
              "EquipmentTested": "Chlorinators, Evaporators, Alarms",
              "ChangeMgmtDate": "1999-06-18 00:00:00",
              "ChangeMgmtReviewDate": "2004-06-04 00:00:00",
              "PreStartupReviewDate": "1999-06-18 00:00:00",
              "ComplianceAuditDate": "2004-05-07 00:00:00",
              "AuditCompletionDate": "2004-06-18 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-06-04 00:00:00",
              "HotWorkPermitReviewDate": "2004-06-04 00:00:00",
              "ContractorSafetyReviewDate": "2004-06-04 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "This chlorination process consists of a one ton chlorine container, evaporator, chlorinator, injector and water pump, plus interconnecting piping and valving.  Each piece of equipment is duplicated for redundancy.  The accident prevention program applies to the system as a whole.",
              "_chemicals": [
                {
                  "PrimaryKey": 46064,
                  "PreventionProgram3ID": 31605,
                  "ProcessChemicalID": 72770
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 38278,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-05-05 00:00:00",
    "ERTrainingDate": "2002-06-24 00:00:00",
    "CoordinatingAgencyName": "City of Tacoma Fire Department",
    "CoordinatingAgencyPhone": "2535915798",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38278,
      "SummaryText": "The accidental release prevention and emergency response policies at our facility:\n\nIt is the policy of the management of the Public Works Environmental Services Operations division, that its treatment plants be operated in a manner consistent with the safety of the citizens of Tacoma, as well as that of its employees.  To that end, safeguards to prevent the accidental release of chlorine are in place in the form of safety equipment and personnel experienced in its proper operation and maintenance.  It is likewise policy to reduce the risk to citizens and employees should an accidental release occur.  Therefore, the quantity of chlorine stored on site is limited to 5 one ton containers.  Current policy directs that, in the event of a major accidental release, the trained professionals of the Tacoma Fire Department?s Hazmat Team be called to respond to the emergency.\n\nOur facility and regulated substance handled:\n\nThis facility is a wastewater treatment plant owned and operated by the City of Tacoma?s Public Works Sewer Utility.  The plant is located at 2201 Portland Avenue in Tacoma, Washington.  The plant treats a daily average of 26 million gallons of sewage to secondary treatment standards according to a permit issued by the Washington State Department of Ecology.  Before the plant?s effluent is discharged to Commencement Bay, it is disinfected to meet the NPDES permit requirements for fecal coliform.  The method of disinfection is by chlorination.  Chlorine is stored on site exclusively for the purpose of disinfecting the effluent.  Since 1998, that amount has been reduced from greater than 55 tons, to a maximum of 5 tons.  This reduced amount is still greater than the regulation?s threshold level for chlorine of 2,500 lbs.  Therefore, the facility is regulated under Section 112(r) of the Clean Air Act Ammendments.  Chlorine disinfection is the only covered process at this facility.\n\nThree divisions of the Public Works Environmental Services are housed at the Ce"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38278,
      "SummaryText": "ntral Treatment Plant:  Operations, Maintenance, and Utility Services Engineering.  Total staffing for the three divisions is 237.  However, during the off hours of 5:00 p.m. to 7:00 a.m., weekends, and holidays, the plant is staffed only by 3 operators.\n\nGeneral accidental release prevention program and chemical-specific prevention steps:\n\nThe treatment plant?s chlorine disinfection process comes under the WISHA?s Process Safety Management regulation (WAC 296-67).  The 12 elements of the Process Safety Management regulation set out to meet the requirements of the Risk Management Program.  The process safety elements were initially developed in 1996 and 1997.  These elements have been reviewed and all updates will be completed in 2004.  After review of the process safety information and process hazard analysis, little has changed regarding the core equipment.  The greatest change resulted in the elimination of a 55 ton chlorine tank car and subsequent shift to 5 one ton containers for on site chlorine storage, substantially reducing the risk of catastrophic release.\n\nThe equipment essential to the process consists of a one ton container of chlorine, automatic shut off valves, evaporators, chlorinators, injectors, water pumps, and interconnecting piping and valving.  This equipment is fitted with industry standard safety devices including alarms which can immediately turn off the ton container and notify the operations control center.  The control center is staffed 24 hours per day and is equipped with a camera system that allows close visual surveillance of the chlorine storage area.  The process equipment is physically checked for proper operation at least once every 12 hours as well as continuous computer monitoring.  A preventative maintenance schedule which includes weekly and monthly procedures as well as other maintenance recommended by the manufacturers is ongoing.  These layers of mechanical and human monitoring help ensure the mechanical integrity of the sy"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38278,
      "SummaryText": "stem and contribute to our excellent safety record.\n\nThe five-year accident history:\n\nWe have had no accidental releases resulting in injuries or off site consequences in the past five years.\n\nThe emergency response program:\n\nAlthough the equipment and procedures are in place to prevent an accidental release of chlorine, we still must be prepared to respond should an accidental release occur.  The emergency response program describes the actions to be taken in such an event.\n\nThe response employed is determined by the severity of the release.  In the event of a minor release, in which the chlorine level is detectable, but less than the IDLH (Immediately Dangerous to Life and Health) level of 10 PPM, trained release response personnel from the plant will respond to the problem using proper protective equipment.  However, if the release is not minor or is deemed to be uncontrollable, plant personnel will not respond directly, but will instead contact 911.\n\nThe Tacoma Fire Department is the designated Hazmat team for the City and will respond to a 911 call.  The dispatcher will request information to be used by the response team and for reporting purposes, such as location and extent of release, contact numbers, etc.  The Hazmat team will plan en route which gate to use and where to locate the command post, based on weather and site layout.  The Fire Department will assume incident command.\n\nIn addition to coordination with the Tacoma Fire Department, plant operations personnel will notify other personnel on site via the public address system of the situation and advise whether to evacuate or shelter in place.  Designated coordinators in each building will then account for personnel and carry out evacuation or shelter in place procedures.  Notifications of plant neighbors and others in the community who may be affected will be carried out in combination with the Tacoma Fire Department.  Businesses immediately adjacent to the plant site will be called by plant personnel"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 38278,
      "SummaryText": ".  The Tacoma Fire Department?s automatic dialing and message system, Teleminder, will be available for use should the situation warrant.\n\nPlanned changes to improve safety:\n\nFuture plans include the capability of shutting off the ton container from any location in the plant via the computer system and the implementation of our Chlorine Change-Out and Release Response team.\n\nThe Chlorine Change-Out and Release Response (Chlorine CORR) team will be composed of 1 Operations Supervisor and 6-10 Operators/Assistants.  The team will have comprehensive HAZMAT training.  In addition, the team will also receive extensive training on chemical specific hazard communication, process safety management, emergency action plan implementation, PPE, emergency response, respirators and SCBAs, medical qualifications, and facility specific chlorine process procedures.\n\nThe team will primarily be responsible for all chlorine container change outs, and respond to minor releases of chlorine under the IDLH.  Major releases of chlorine and uncontrolled emergencies will continue to be handled by The Tacoma Fire Department."
    }
  ]
}