{
  "FacilityID": 38381,
  "FacilityName": "GARELICK FARMS - LYNN",
  "FacilityStr1": "626 LYNNWAY",
  "FacilityStr2": null,
  "FacilityCity": "LYNN",
  "FacilityState": "MA",
  "FacilityZipCode": "01905",
  "Facility4DigitZipExt": "3068",
  "FacilityCountyFIPS": "25009",
  "LEPC": "LYNN LEPC",
  "FacilityLatDecDegs": "42.452889",
  "FacilityLongDecDegs": "-070.961361",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1017110,
  "ParentCompanyName": "DEAN NORTHEAST LLC",
  "Company2Name": null,
  "CompanyDUNS": 929182210,
  "Company2DUNS": 0,
  "OperatorName": "GARELICK FARMS - LYNN",
  "OperatorStr1": "626 LYNNWAY",
  "OperatorStr2": null,
  "OperatorCity": "LYNN",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "01905",
  "OperatorZipCodeExt": "3068",
  "FTE": 590,
  "OtherEPAFacilityID": "01905WSTLY626LY",
  "EPAFacilityID": "100000127221",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-09-07 00:00:00",
  "DeRegistrationEffectiveDate": "2018-08-29 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 42.454,
  "FRS_Long": -70.962,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "25000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 55206,
      "AltID": "AMMONIA REFRIGERATION",
      "FacilityID": 38381,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 73034,
          "ProcessID": 55206,
          "ChemicalID": 56,
          "Quantity": 39000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 56475,
          "ProcessID": 55206,
          "NAICSCode": "311511",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 31733,
              "Process_NAICS_ID": 56475,
              "SafetyReviewDate": "2004-06-18 00:00:00",
              "PHA_Date": "2004-06-18 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Pressure relief valve header vent lines",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-06-01 00:00:00",
              "TrainingReviewDate": "2004-06-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-06-01 00:00:00",
              "EquipmentInspectionDate": "2004-05-14 00:00:00",
              "EquipmentTested": "AMMONIA COMPRESSORS 1 THROUGH 7",
              "ChangeMgmtDate": "2000-01-15 00:00:00",
              "ChangeMgmtReviewDate": "2004-06-01 00:00:00",
              "PreStartupReviewDate": "2004-06-01 00:00:00",
              "ComplianceAuditDate": "2004-06-01 00:00:00",
              "AuditCompletionDate": "2005-02-01 00:00:00",
              "IncidentInvestigationDate": "2004-05-18 00:00:00",
              "InvestigationChangeDate": "2004-05-18 00:00:00",
              "ParticipationPlansReviewDate": "2004-06-01 00:00:00",
              "HotWorkPermitReviewDate": "2004-06-01 00:00:00",
              "ContractorSafetyReviewDate": "2004-06-01 00:00:00",
              "ContractorSafetyEvalDate": "2004-01-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Garelick Farms Lynn's accidental release prevention program includes documented equipment preventive maintenance, employee training and process/equipment monitoring.  The preventive maintenance program is monitored using a computerized maintenance management system called Grand PM.  The latter program is based on equipment manufacturer's recommendations, the International Institute of Ammonia Refrigeration (IIAR) guidelines and accumulated facility experience.\n\nAmmonia detectors are installed in the ammonia compressor rooms, the compressor room ventilation system and in the equipment pressure relief valve discharge header vent lines.  The detectors are interlocked such that an exceedance will activate an alarm, start the standby ventilation system and automatically shutdown all power to the ammonia compressor rooms.  This system is designed to quickly identify and eliminate emission sources.\n\nAmmonia Refrigeration Technicians are Emergency Response personnel who are trained on an annual basis to assure that proper operating procedures and maintenance practices are followed.\n\nAnnual HAZWOPER refresher training is also provided.  Within the last five year, Garelick has had only one ammonia release that has resulted in an accident to one of its employees.  An ammonia refrigeration technician's hands were sprayed with liquid ammonia which was under pressure.  The rapid evaporation of the ammonia liquid on the technician's hands resulted in badly frostbitten hands.  The cause of the ammonia release was found to be due to a leaking manual block valve while removing a piping plug.  This defective valve was replaced.  In the past there have never been any ammonia releases that have ever resulted in the need to evacuate or shelter-in-place any of Garelick's community neighbors.",
              "_chemicals": [
                {
                  "PrimaryKey": 46278,
                  "PreventionProgram3ID": 31733,
                  "ProcessChemicalID": 73034
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 38381,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-06-01 00:00:00",
    "ERTrainingDate": "2004-06-17 00:00:00",
    "CoordinatingAgencyName": "LYNN LEPC",
    "CoordinatingAgencyPhone": "7814777116",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38381,
      "SummaryText": "Garelick Farms - Lynn (GFL) was originally founded in 1937 under private ownership as West Lynn Creamery and remained under this form of ownership until 1998 when it was purchased by Garelick Farms - Franklin. That same year the latter was purchased and became a division of Suiza T.T.L., LLC of Dallas, Texas. In 2002 Dean Foods merged with Suiza, and the merged company did business as Dean Foods.\n\nGarelick Farms-Lynn is located on an approximate 20 acre site and has 590 employees. Garelick Farms - Lynn distributes its dairy products throughout the East Coast. The product line includes milk, cream, juices, spring water and a variety of similar resale items. In producing and storing the above dairy products, it is necessary to provide sanitary, and for some foods, refrigerated conditions. In providing the necessary sterile food preservation, Garelick utilizes an ammonia refrigeration system which contains ammonia in a closed loop system. Due to the nature and properties of ammonia, it is necessary to use specially rated and durable equipment, piping and auxiliary systems in order to maintain a safe, fully contained and constantly reliable refrigeration system. Garelick has pledged to its employees, its customers and its community that it will rigorously maintain the highest standards of safety for this system. The control of accidents and material releases has been and will continue to be the primary responsibility of all Garelick employees.\n\nPROCESS SAFETY AND RISK MANAGEMENT PROGRAM TEAM\n\nTo ensure that Garelick Farms - Lynn fulfills its pledge to maintain a safe and reliable ammonia refrigeration system, management has designated and staffed a Process Safety and Risk Management Program Team (PSRMPT). This team consists of the Garelick Emergency Coordinators and Emergency Responders who have been trained at the Technician Level.  Some of the emergency personnel have been trained at the Specialist Level. The Facility Emergency Coordinator has responsibility for leadi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38381,
      "SummaryText": "ng this team in its charter of maintaining a safe and reliable refrigeration system and in assuring compliance with the OSHA Process Safety Management standard and the EPA Risk Management Program, or Accidental Release Prevention regulation.  The purpose of the accidental release prevention and emergency response programs is to prevent the occurrence and minimize the consequences of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents.  Overall, these programs prevent accidental fatalities, injuries and illnesses and avoid physical property damage at both the plant and community.\n\nSTATIONARY SOURCES AND REGULATED SUBSTANCE\n\nIn the manufacture and storage of food products Garelick utilizes an anydrous ammonia (CAS 7662-41-7) system to provide the necessary temperature control for preserving food sterility and preventing food spoilage.  The largest storage vessel used for storing ammonia is a high pressure receiver.   In order to improve process safety and operability, Garelick administratively controls the quantity of ammonia in this vessel to 80% of its capacity. This administrative control is included in the written ammonia refrigeration operating procedure.  Since an ammonia release could pose a risk of offsite public and environmetnal impact, this ammonia refrigeration system is designated as subject to the Program 3 requirements of EPA's Risk Management Program regulation and must be enlisted for its potential offsite release consequences.\n\nDESCRIPTION OF EMERGENCY RESPONSE PROGRAM\n\nAn emergency response program has been implemented at the facility.  This program contains procedures describing how the facility will respond to ammonia spills and other emergencies, including evaculation procedures.  The program has been coordinated with the Fire Department and Local Emergency Planning Committee.\n\nThe emergency response program consists of the following major elements:\n\n  - Organization Plan and Responsibi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38381,
      "SummaryText": "lities\n  - Communications and Notification Procedures\n  - Detailed Action Plans\n  - First Aid Procedures\n  - Emergency Medical Treatment Procedures\n  - Evaluation Plans\n  - Description of Outside Assistance Available\n  - Site Re-entry Procedures\n  - Training Programs and Drills\n\nIn the past six years Garelick has conducted emergency drills that have included coordination with the Lynn Fire Department and Local Emergency Planning Committee.  These drills have resulted in improved emergency response by all the participants, and it is anticipated that this improvement will continue in future years.\n\nCONTINUED EMERGENCY RESPONSE IMPROVEMENT\n\nGarelick has continually improved its emergency response planning and capability.  This includes the formation of HazMat emergency response teams that respond to emergency situations.  This team is trained under the OSHA HAZWOPER requirements and completes refresher training on an annual basis.  HazMat team Emergency Coordinators and Emergency Responders at the Technician Level provide coverage that is continuous on all shifts at Garelick.\n\nFuture emergency response capability improvements will include the following:\n\n  - More frequent drills with local and district response agencies;\n  - Emergency response planning and coordination with adjacent communities;\n  - Emergency response planning and coordination with adjacent commercial and manufacturing operations;\n  - Improved detection early release systems."
    }
  ]
}