{
  "FacilityID": 38409,
  "FacilityName": "Weyerhaeuser Company - Red River Mill",
  "FacilityStr1": "4537 Highway 480",
  "FacilityStr2": null,
  "FacilityCity": "Campti",
  "FacilityState": "LA",
  "FacilityZipCode": "71411",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22069",
  "LEPC": "Natchitoches LEPC",
  "FacilityLatDecDegs": "31.904444",
  "FacilityLongDecDegs": "-093.174167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Weyerhaeuser Company",
  "Company2Name": null,
  "CompanyDUNS": 1306992,
  "Company2DUNS": 0,
  "OperatorName": "Weyerhaeuser Company",
  "OperatorStr1": "P.O. Box 377",
  "OperatorStr2": null,
  "OperatorCity": "Campti",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "71411",
  "OperatorZipCodeExt": null,
  "RMPContact": "Carl Gunter",
  "RMPTitle": "Vice President and Mill Manager",
  "FTE": 356,
  "OtherEPAFacilityID": "120040609102150",
  "EPAFacilityID": "100000085294",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-02-24 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-03-03 00:00:00",
  "DeRegistrationEffectiveDate": "2011-02-23 00:00:00",
  "AnniversaryDate": "2009-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 31.90833,
  "FRS_Long": -93.175,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 55238,
      "AltID": null,
      "FacilityID": 38409,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 56507,
          "ProcessID": 55238,
          "NAICSCode": "32213",
          "_desc": {
            "NAICS_CODE": "32213",
            "NAICS_DESCRIPTION": "Paperboard Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 73078,
          "ProcessID": 55238,
          "ChemicalID": 62,
          "Quantity": 26000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 573078,
          "ProcessID": 55238,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38409,
      "SummaryText": "RED RIVER MILL RISK MANAGEMENT PLAN: EXECUTIVE SUMMARY\n\n2645 LDEQ ID Number\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nThe Red River Mill has a long-standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of the facility's processes. The Weyerhaeuser policy is to implement reasonable controls to prevent foreseeable releases of substances. However, if a release does occur, trained personnel will respond to, control, and contain the release.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nWeyerhaeuser owns and operates the Red River Mill located near Campti, Natchitoches Parish, Louisiana. The Red River Mill is an integrated pulp and paper mill that utilizes the standard kraft process for the manufacture of unbleached pulp from wood chips and recycled corrugated containers into linerboard.\n\nThe Red River Mill was evaluated to determine if any regulated flammable or toxic substances exceeded the threshold quantity. Based on process knowledge, Weyerhaeuser identified the regulated substances and quantities kept on site. These are the quantities maintained in process vessels and piping at normal operating conditions and does not necessarily represent maximum capacities of the equipment. \n\nThe only listed substance which is stored above threshold quantity at the Red River Mill is chlorine, which is classified as toxic. Propane, a regulated flammable substance is also stored on site. However, administrative controls are in place to limit the propane storage quantity below threshold.  Based on worst-case analysis, the distance to endpoint exceeds the distance to public receptors.  In addition, the Red River Mill is subject to OSHA Process Safety Management standard. Therefore, the Red River Mill is classified as a Program 3 process under the Accidental Release Preventio"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38409,
      "SummaryText": "n Program.\n\n\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM\n\nThe following is a summary of the accident prevention program in place at the Red River Mill. Because the processes at the mill that are regulated by the Environmental Protection Agency's (EPA's) risk management program (RMP) regulations are also subject to the Occupational Safety and Health Administration's (OSHA's) process safety management standard, this summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.\n\nEMPLOYEE PARTICIPATION\n\nActive employee participation and involvement in the development and implementation of the Red River Mill's PSM program is an important step toward achieving the objective to prevent or minimize the consequences of catastrophic releases of toxic, reactive, flammable, or explosive chemicals. Employee involvement will help to ensure that all perspectives regarding PSM are considered, and that the best ideas are implemented. Open communications are encouraged between supervisors and employees regarding all safety and health issues.\n\nThe Red River Mill strongly promotes employee involvement in safety issues through existing programs. These programs include the Central Safety Team (made up of a cross section of employees and supervision), regularly scheduled safety meetings, Hazard Communication, \"near-miss\" reporting, and special training programs (emergency reponse training, first aid, etc.).\n\nThe Red River Mill actively seeks employee involvement in the development and conduct of all accident prevention activities through the appropriate existing safety programs. Accident release prevention is discussed at the regularly scheduled safety meetings and/or during special training sessions if necessary. Employees are encouraged to discuss accident prevention with their supervisors if they have questions, comments, or suggestions.\n\nPROCESS SAFETY INFORMATION\n\nComplete and accurate written process safety"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38409,
      "SummaryText": " information (PSI) concerning process chemicals, process technology, and process equipment is essential to effective PSM and and RMP programs and to completing and maintaining a process hazard analysis (PHA). The PSI will be useful to the operators; the team performing the PHA; those in charge of training; contractors; those conducting pre-startup safety reviews; and those in charge of updating the emergency preparedness plans. Process safety information is readily available to all employees. \n\nThe Red River Mill keeps a variety of technical documents that are used to maintain safe operation of the process. These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information. \n\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs).\n\nThe mill also maintains numerous technical doocuments that provide information about the design and construction of process equipment. This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment. This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\nPROCESS HAZARD ANALYSIS\n\nThe Red River Mill has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled. Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards. \n\nThe Red River Mill primarily uses the HAZOP analysis technique to perform these evaluations. The analyses are conducted using a team of people who ha"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 38409,
      "SummaryText": "ve operating and maintenance experience as well as engineering expertise. This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and the team makes suggestions for additional prevention and/or mitigation measures when they believe such measures are necessary.\n\nThe PHA team findings are forwarded to local and corporate management for resolution. Implementation of mitigation options in response to PHA findings is based on a relative risk rating assigned by the PHA team. This ranking helps ensure that potential accident scenarios assigned the highest risk receive immediate attention. All approved mitigation options in response to PHA team findings are tracked until they are completed. The final resolution of each finding is documented and retained.\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the mill periodically updates and revalidates the hazard analysis results. These periodic reviews are conducted at least every five years and will be conducted at this frequency until the process is no longer operating. The results and findings from these updates are documented and retained. Once again, the team findings are forwarded to management for consideration, and the final resolution of the findings is documented and retained.\n\nOPERATING PROCEDURES\n\nThe Red River Mill maintains written procedures that address various modes of process operation, such as: (1) startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process. These procedures provide guidance for experienced operators and also provide the basis for training new operators. Operating procedures are periodically reviewed and annually certified as current and accurate. The review and certification process involves both operators and technical staff. \n\nThe intent of the operating"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 38409,
      "SummaryText": " procedures is to provide workable, useful, and clearly written instructions for conducting operating activities. To have effective operating procedures, the task and procedures directly and indirectly related to the covered process must be appropriate, clear, consistent, and most importantly, communicated to employees. Operating procedures are specific instructions or details on what steps are taken or followed in carrying out the stated procedures. The specific instructions include the applicable safety precautions and appropriate information on safety implications.\n\nTRAINING\n\nIn addition to training on operating procedures, the Red River Mill has a comprehensive training program for all employees involved in operating the process. New employees receive basic training in mill operations. In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level. This refresher training is conducted at least every three years. All of this training is documented for each operator, including the means used to verify that the operator understood the training.\n\nCONTRACTORS\n\nThe Red River Mill uses contractors during periods of increased maintenance or construction activities. Because some contractors work on or near process equipment, the mill has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have appropriate knowledge and skills, (3) are aware of the hazards of the workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site-specific safety rules, and (6) inform mill personnel of any hazards that they find during their work. This is accomplished by providing contractors with an orientation session that covers (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices prior to beginning their work."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 38409,
      "SummaryText": " In addition, the Red River Mill evaluates contractor safety programs and performance during the selection of a contractor. Mill personnel periodically monitor contract performance to ensure that contractors are fulfilling their safety obligations.\n\nPRE-STARTUP SAFETY REVIEW (PSSR)\n\nThe Red River Mill conducts a PSSR on any new facility or facility modification that requires a change in process safety information. The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment in service. This review provides one additional check to make sure construction is in accordance with design specification and that all supporting systems are operationally ready. The PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\n\n\nMECHANICAL INTEGRITY\n\nThe Red River Mill has well established practices and procedures for maintaining process equipment. The basic aspects of this program include (1) training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting equipment deficiencies, when identified, and (5) applying quality assurance measures. In combination, these activities form a system that maintains the mechanical integrity of the process.\n\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their jobs in a safe manner.\n\nAnother integral part of the mechanical integrity program is quality assurance. The Red River Mill incorporates quality assurance measures into equipment purchases and repairs. This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 38409,
      "SummaryText": "repairs are made. \n\nSAFE WORK PRACTICES\n\nThe Red River Mill has long standing safe work practices in place to help ensure worker and process safety. Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping and equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work), and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space. These procedures and others, along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\n\nMANAGEMENT OF CHANGE\n\nThe Red River Mill has a comprehensive system to manage changes in all covered processes. This system requires that changes to items such as process equipment, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change. Affected chemical hazard information, process operating limits, and equipment information, as well as procedures are updated to incorporate these changes. In addition, operating and maintenance personnel are provided any necessary training on the change.\n\nINCIDENT INVESTIGATION\n\nThe Red River Mill promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury. The goal of each investigation is to gather the facts, determine the root cause, and develop corrective actions to prevent reoccurrence of the incident or a similar incident. The inves"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 38409,
      "SummaryText": "tigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to the business management team for resolution.\n\nCOMPLIANCE AUDITS\n\nTo help ensure that the accident prevention program is functioning properly, the Red River Mill periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented. Compliance audits are conducted at least every three years. Both hourly and staff personnel participate as audit team members. The audit team develops findings that are forwarded to Red River Mill management for resolution. Corrective actions taken in response to the audit team's findings are tracked until they are complete. The final resolution of each finding is documented, and the two most recent audit reports are retained.\n\nCHEMICAL SPECIFIC PREVENTION STEPS\n\nThe processes at the Red River Mill have hazards that must be managed to ensure continued safe operation. The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\n\nUniversal Prevention  Activities\n\nThe accident prevention program summarized previously is applied to all RMP-covered processes at the Red River Mill. Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n\nSpecialized Safety Features\n\nThe Red River Mill has safety features on many units to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of (mitigate) a release. The following types of safety features are used in the covered processes:\n\nRelease Detection\n\n1. Chlorine detectors with alarms\n\nRelease Containment/Control\n\n1. Valves to permit isolation of the process (manual or automated)\n2. Redundant equipment and instrumentation (e.g., backup firewater pump)\n\nRelease Mitigation\n\n1. Fire extinguish"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 38409,
      "SummaryText": "ers and extinguishing systems\n2. Personnel trained in emergency procedures\n3. Personal protective equipment (e.g., chemical protective clothing, self-contained breathing apparatus)\n\nFIVE YEAR ACCIDENT HISTORY\n\nOver the last five years there have been no accidental releases from RMP-covered processes at Red River Mill.\n\nEMERGENCY PROCEDURE INFORMATION\n\nThe Red River Mill maintains a written emergency procedure, which is in place to protect worker and public safety as well as the environment. The procedures are for the possibility of a safety or health hazard if a hazardous substance is accidentally released. The procedures address notification of local emergency response agencies if a release occurs, and post incident cleanup and decontamination requirements. Employees receive training in emergency procedures. The emergency procedure is updated when necessary based on modifications made to the Red River Mill. The emergency procedure changes are administered through the Management of Change (MOC) process, which includes informing and/or training affected personnel in the changes.\n\nThe overall emergency procedure program for the Red River Mill is coordinated with the Natchitoches Parish, Louisiana, Local Emergency Planning Committee (LEPC). The Red River Mill has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department). This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident. The Red River Mill conducts periodic emergency drills and provides periodic refresher training to mill personnel regarding the hazards of regulated substances in the plant."
    }
  ]
}