{
  "FacilityID": 38423,
  "FacilityName": "Meadow Gold Dairies-Great Falls",
  "FacilityStr1": "312 3rd Avenue South",
  "FacilityStr2": null,
  "FacilityCity": "Great Falls",
  "FacilityState": "MT",
  "FacilityZipCode": "59405",
  "Facility4DigitZipExt": "1811",
  "FacilityCountyFIPS": "30013",
  "LEPC": "Cascade LEPC",
  "FacilityLatDecDegs": "47.301180",
  "FacilityLongDecDegs": "-111.180970",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "Norm_Stone@deanfoods.com",
  "FacilityDUNS": 6238158,
  "ParentCompanyName": "Southern Foods Group, L.P.",
  "Company2Name": null,
  "CompanyDUNS": 174127555,
  "Company2DUNS": 0,
  "OperatorName": "Meadow Gold Dairies",
  "OperatorStr1": "312 3rd Avenue South",
  "OperatorStr2": null,
  "OperatorCity": "Great Falls",
  "OperatorStateFIPS": "MT",
  "OperatorZipCode": "59405",
  "OperatorZipCodeExt": "1811",
  "FTE": 68,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000124974",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-08-14 00:00:00",
  "SafetyInspectionBy": ", Great Falls Fire Depart.--11/07/03, CAN-06/16/02",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-04-13 00:00:00",
  "DeRegistrationEffectiveDate": "2005-03-28 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 47.50193,
  "FRS_Long": -111.30281,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 55257,
      "AltID": null,
      "FacilityID": 38423,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 73107,
          "ProcessID": 55257,
          "ChemicalID": 56,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 56527,
          "ProcessID": 55257,
          "NAICSCode": "311511",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 31765,
              "Process_NAICS_ID": 56527,
              "SafetyReviewDate": "2003-12-20 00:00:00",
              "PHA_Date": "2004-05-27 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Removed section of AV-059, added valve to pressure line from V-10; relocated manual defrost \"hot gas\" lines to roof from basement;switched V-10 defrost relief from LSS to HSS; upgraded transfer system",
              "OpProceduresReviewDate": "2003-12-08 00:00:00",
              "TrainingReviewDate": "2004-04-01 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Plant Manager and maintenance employee attended ammonia refrigeration class in Garden City, Kansas",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": "Review SOP's with all affected employees.",
              "MaintenanceReviewDate": "1999-06-10 00:00:00",
              "EquipmentInspectionDate": "2003-08-14 00:00:00",
              "EquipmentTested": "Matrix, Risk Consultants, Inc. inspected all plant processes and equipment.",
              "ChangeMgmtDate": "2004-05-03 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-24 00:00:00",
              "PreStartupReviewDate": "2004-05-03 00:00:00",
              "ComplianceAuditDate": "2001-12-04 00:00:00",
              "AuditCompletionDate": "2002-12-31 00:00:00",
              "IncidentInvestigationDate": "2002-11-13 00:00:00",
              "InvestigationChangeDate": "2002-11-13 00:00:00",
              "ParticipationPlansReviewDate": "2002-02-20 00:00:00",
              "HotWorkPermitReviewDate": "2004-03-01 00:00:00",
              "ContractorSafetyReviewDate": "2002-01-02 00:00:00",
              "ContractorSafetyEvalDate": "2004-05-26 00:00:00",
              "CBI_Flag": 0,
              "Description": "Plant management with the assistance of maintenance staff and the corporate engineer has developed and implemented the prevention program elements as required by Program 3 Prevention Program 68.65 at it applies to the chemical ammonia. In some cases, such as Contractor Safety and Emergency Action, prevention safety programs were in place as required by other government regulations. The date on which safety information was last reviewed or revised may vary from element to element depending on other government requirements. Example of this is Employee Right to Know (MSDS) and Emergency Action which are reviewed yearly, with employees receiving yearly training. As required, the following elements have been developed as needed for RMP or incorporated from other programs.  Process Safety Information:  A Material Safety Data Sheet is available to all employees. Employees receive annual training on their right to know about hazards associated with chemicals use in the facility. All employees receive annual training on RMP/PSM. In 2001, the Plant Manager and a maintenance employee attended an ammonia refrigeration course in Garden City, Kansas. Professional ammonia refrigeration contractors are used when selecting and installing equipment, or making any major changes in the system.  Process Safety Information:  During the development of the RMP, a block flow diagram, maximum intended inventory, safe upper and lower limits for temperatures, pressures, and evaluation of the consequences of deviations were completed. Process chemistry was include in discussions related to the development of the PHA.  Process Safety Information:  Construction materials meet iiar standards, and equipment and processing designs are based on recognized and generally accepted good engineering practices. The P&ID was developed and has been updated as needed. The most recent update was June 2004. Due to ventilation available, the electrical classification is non-hazardous, non-explosive. Safety relief valves are incorporated into the system as required. All SRV's meet standards. A list of SRV's with location and age is maintained and updated as needed. The ventilation system is being upgraded in July 2004 to add more capacity on the exhaust side. A sail switch will be incorporated into this system. All major changes or additions to the refrigeration system are done by or under the direction of professional ammonia refrigeration contractors with approval by the Corporate Engineering staff. An alarm/detection system is in place to detect a release of ammonia and start ventilation equipment, and notify plant employees. During May, 2004, a computer system was installed to provide continuous moniotoring of the refrigeration system.  All equipment and systems, to the best of my knowledge, complies with recognized and generally accepted good engineering practices. Any equipment that was designed or constructed in accordance with codes, standards or practices that are no longer in general use, is operated in a safe manner.",
              "_chemicals": [
                {
                  "PrimaryKey": 46331,
                  "PreventionProgram3ID": 31765,
                  "ProcessChemicalID": 73107
                }
              ]
            }
          ],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 56528,
          "ProcessID": 55257,
          "NAICSCode": "31152",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 38423,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Great Falls Fire Department",
    "CoordinatingAgencyPhone": "4067278070",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38423,
      "SummaryText": "Meadow Gold Dairy, Great Falls, Montana operates a dairy processing and manufacturing facility. The refrigeration system required for this business is subject to EPA's Risk Management Program, and as such, the corporate and local management staff in cooperation with local officials have implemented all elements of the RMP. In conjunction with the RMP, elements required by OSHA's Process Safety Management program have been incorporated into our program. In so doing, the nature of the risks posed by our facility to our community has been evaluated and safety measures have been taken to minimize such risks. The safety and accident prevention program includes a two level alarm/detection system which activates a plant wide alarm, disables refrigeration equipment, activates the ventilation system and notifies plant personnel. This system also detects abnormalities in the refrigeration process and notifies plant personnel. In May, 2004, a computerized system was installed to provide continuous monitoring of refrigeration equipment and processes. As identified through the Mechanical Integrity and audit elements of RMP, refrigeration equipment and lines have been upgraded or replaced as needed to minimize the risk of a release. Insulation on pipes and equipment was replaced to meet currect standards. All refrigeration piping and equipment have been labeled to indicate the process chemistry. Standard Operating Procedures have been written for the operation of all refrigeration equipment and processes. These are reviewed annually with affected employees. Management of Change protocol is followed when changes are made to the system. Incidents of concern related to the refrigeration system are investigated and changes made as needed to minimize similar issues in the future. Protective guards have been installed around refrigeration equipment and piping located in high powered lift use areas. A keyless security system has been installed to minimize the risk of unauthorized access"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38423,
      "SummaryText": " to the building and the refrigeration system. Two plant employees attended a week long refrigeration class, in addition, employees receive yearly training in the RMP requirements and its application to our facility. Under the direction of the Great Falls Fire Department and Cascade County LEPC, three mutual response drills have been conducted. Another such drill is scheduled in 2004. Meadow Gold Dairy has also been included in the LEPC's response program. A written emergency action plan is maintained by the company with annual reviews and training conducted for all employees. In 2004, the ventilation sytem for the engine room will be upgraded to meet standards. During the past five years, there have been no accidental releases of refrigerant. Plant management, as well as, senior corporate management is committed to the safe operation and implementation of safe procedures at this facility."
    }
  ]
}