{
  "FacilityID": 38597,
  "FacilityName": "Union Carbide Corporation - UCAR Emulsion Systems",
  "FacilityStr1": "2326 Lonnecker Drive",
  "FacilityStr2": null,
  "FacilityCity": "Garland",
  "FacilityState": "TX",
  "FacilityZipCode": "75041",
  "Facility4DigitZipExt": "1203",
  "FacilityCountyFIPS": "48113",
  "LEPC": "Dallas County LEPC",
  "FacilityLatDecDegs": "32.891667",
  "FacilityLongDecDegs": "-096.672778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.dow.com",
  "FacilityEmailAddress": "glasscdm@dow.com",
  "FacilityDUNS": 61592309,
  "ParentCompanyName": "Union Carbide Corporation",
  "Company2Name": "The Dow Chemical Company",
  "CompanyDUNS": 1289008,
  "Company2DUNS": 0,
  "OperatorName": "Dow UCAR Garland, Tx",
  "OperatorStr1": "2326 Lonnecker Drive",
  "OperatorStr2": null,
  "OperatorCity": "Garland",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75041",
  "OperatorZipCodeExt": "1203",
  "RMPContact": "D Matt Glasscock",
  "RMPTitle": "EHS Delivery Specialist",
  "FTE": 35,
  "OtherEPAFacilityID": "TXT490012358",
  "EPAFacilityID": "100000144907",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-06-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Garland UES RMPlanner",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-24 00:00:00",
  "ErrorReportDate": "2004-08-24 00:00:00",
  "ReceiptDate": "2004-06-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 32.88955,
  "FRS_Long": -96.67336,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "1",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 55549,
      "AltID": "UES Garland Facility",
      "FacilityID": 38597,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 56821,
          "ProcessID": 55549,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 73468,
          "ProcessID": 55549,
          "ChemicalID": 25,
          "Quantity": 108160.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 25,
            "ChemicalName": "Acrylonitrile  [2-Propenenitrile]",
            "CASNumber": "107-13-1",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 73469,
          "ProcessID": 55549,
          "ChemicalID": 29,
          "Quantity": 703800.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 573468,
          "ProcessID": 55549,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 573469,
          "ProcessID": 55549,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38597,
      "SummaryText": "UNION CARBIDE CORPORATION\nUCAR DOW GARLAND, TX PLANT\nRISK MANAGEMENT PLAN\n\nEXECUTIVE SUMMARY\n\n1. Accidental Release Prevention and Emergency Response Policies\n\nThe Union Carbide UCAR Dow Garland Plant is committed to operating and maintaining all of our processes in a safe and responsible manner.  We have implemented a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as to protect the environment.  These programs include both Union Carbide's Responsible Care requirements and governmental requirements, such as the Environmental Protection Agency's (EPA) Risk Management Program (RMP) rule and the Occupational Safety and Health Administration's (OSHA) Process Safety Management (PSM) standard.\n\n2. General Accidental Release Prevention Program \n\nOur general accident prevention program consists of compliance with the EPA RMP rule and OSHA's PSM standard and implementation of of Loss Prevention Principles (LPP) which consist of design, installation,modification and operating practices that relate to process safety and loss prevention.  Key elements include:\n\nEquipment Design:  Vessels (including shipping containers) and other process equipment are designed according to recognized industry standards and/or governmental requirements.\n\nProcess Safety Information: Chemical hazard, process technology, and equipment information is documented, maintained up-to-date, and available to operating personnel.\n\nProcess Hazard Analysis:  Process hazard analyses are conducted every five years to identify major process hazard scenarios and to recommend corrective action(s) needed to prevent their occurrence.\n\nLoss Prevention Principles (LPP)/Operational Safety Standards: Consist of design, installation, modification and operating practices that relate to process safety and loss prevention. \n\nOperating Procedures:  Operating procedures provide detail on how to safely operate a pr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38597,
      "SummaryText": "ocess and are maintained up-to-date.\n\nOperator Training/Certification Program:  The plant has a training and testing program which provides operators with the proper skills and knowledge prior to allowing them to independently operate a process.\n\nTechnical Staff Training and Support:  Trained technical staff employees are available 24 hours a day to support operations.\n\nMaintenance Procedures:  The plant has specific procedures for maintaining process equipment so that it operates safely.\n\nMaintenance Training:  The plant trains persons who perform routine or complex maintenance tasks on process equipment.\n\nMechanical Integrity Program:  Vessels (including shipping containers) and other process equipment are periodically tested and/or inspected to ensure safe operation of process equipment, following recognized industry standards and/or governmental requirements.\n\nManagement of Change:  The plant has a management system to ensure that modified facilities and processes will be safe to operate.\n\nPre-startup Safety Reviews:  Reviews are conducted just prior to startup to ensure that modified facilities and processes are safe for operation.\n\nIncident Investigation:  The plant has a program to ensure that accidents and incidents are properly investigated to determine the cause(s) and to implement corrective action(s) that are needed to prevent the event from reoccurring.\n\nEmployee Participation:  The plant has a program to involve employees in prevention program elements.\nHot Work Permit:  The plant has a procedure to ensure that welding, cutting and brazing are safely performed in areas where flammable or combustible material may be present.\n\nContractor Safety Program:  The plant has a program to ensure that contractors are properly trained and perform their work in compliance with safety requirements.\n\nCompliance Audits:  Periodic Corporate and plant-led audits are conducted to ensure that process operations comply with governmental  requirements.\n\nThese general preven"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38597,
      "SummaryText": "tion elements and the chemical-specific steps discussed in the previous section are parts of an overall management system to prevent accidental chemical releases.  Our company and our employees are committed to the standards that these management systems set.  We have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\n\n3. FIVE-YEAR ACCIDENT HISTORY\n\nIn the last five years there has not been an accident or incident involving an EPA RMP chemical at the Union Carbide UES Garland Plant that resulted in an on-site death, injury, or property damage; or a known off-site death, injury, evacuation, shelter-in-place, property damage or environmental damage.\n\n4. EMERGENCY RESPONSE PROGRAM\n\nThe UES Garland plant maintains a written emergency response program to protect worker and public safety, as well as the environment.  The program consists of procedures for responding to  releases of hazardous substances, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response, including:\n\n? Proper first-aid and medical treatment for exposures\n\n? Evacuation plans and accounting for personnel after an evacuation\n\n? Notification of local emergency response agencies and the public if a release occurs\n\n? Post-incident cleanup and decontamination requirements.\n\n? Inspecting, testing, maintaining, and using emergency response equipment.\n\nThe emergency response program is updated when necessary based on modifications made to facility processes. \n\n5. PLANNED CHANGES TO IMPROVE SAFETY\n\nOn-going programs, such as process hazard analysis reevaluations, continually aim to improve process safety.  \n\nThe company will increase efficiency by leveraging across the businesses most effective technology (MET), standardized work processes defined using Six Sigma, and other best practices. \n\nTo continuously enhance resource productivity to reduce "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 38597,
      "SummaryText": "risk, minimize the company's  impact on the environment and health and increase global competitiveness through greater efficiency; to emphasize pollution prevention in the process; to transfer and use the best available technology throughout the company.\n\nContinue to embrace and advocate Responsible Care"
    }
  ]
}