{
  "FacilityID": 38591,
  "FacilityName": "Graves-Foster Water Treatment Plant",
  "FacilityStr1": "4108 Highway 355 South",
  "FacilityStr2": null,
  "FacilityCity": "Fulton",
  "FacilityState": "AR",
  "FacilityZipCode": "71838",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05057",
  "LEPC": "Hempstead County LEPC",
  "FacilityLatDecDegs": "33.624074",
  "FacilityLongDecDegs": "-093.824590",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "CO",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Hope Water and Light Commission",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Hope Water and Light",
  "OperatorStr1": "4108 Highway 355 South",
  "OperatorStr2": null,
  "OperatorCity": "Fulton",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "71838",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": "AR0000230",
  "EPAFacilityID": "100000075731",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-04-16 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2008-04-08 00:00:00",
  "DeRegistrationEffectiveDate": "2008-03-18 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 33.6198,
  "FRS_Long": -93.81875,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "0.5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 55542,
      "AltID": "Water Treatment Facility",
      "FacilityID": 38591,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 73461,
          "ProcessID": 55542,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 56814,
          "ProcessID": 55542,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 21190,
              "Process_NAICS_ID": 56814,
              "SafetyReviewDate": "2004-04-01 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2004-04-01 00:00:00",
              "ChangeCompletionDate": "2004-04-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Clorine Vacuum Feed System (automatic shutoff of chlorine feed in the event of an increase or decrease in pressure of feed lines)",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-04-01 00:00:00",
              "TrainingReviewDate": "2004-04-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-04-01 00:00:00",
              "EquipmentInspectionDate": "2004-06-01 00:00:00",
              "EquipmentTested": "chlorine cylinders inspected, regulators, pressure guages, feed system (all done daily, and before changing out cylinders",
              "ComplianceAuditDate": "2004-04-04 00:00:00",
              "AuditCompletionDate": "2004-07-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "The Graves-Foster Water Treatment Plant in Fulton, AR is a municipal water treatment facility owned by Hope Water and Light Commission.  This facility falls under NAICS Code 22131.  Our safety information was last reviewed and updated April 2004.  We are subject to the handling codes of the National Fire Protection Associateioin for Compressed Gas Cylinder Storage, American National Standards Institute, and American Society of Mechanical Engineers.  These standards, along with applicable (though not required) OSHA Standards have been implemented through written manuals.  Even though this is a municipal facility, and is not goverend by OSHA, Graves-Foster Water Treatment Plant has decided to use Process Safety Management as the Prevention Program.  To prevent/limit releases, this facility operates the chlorine system on an automatic vacuum feed system, manual shut-off valves, and pressure regulators.  This facility also uses chlorine detection alarms which indicates a release with a visual and audible alarm.  Employees at the water treatment plant conduct maintenance checks on all systems involved with the chlorine on a dialy basis.  These checks involve reading pressure guages, inspecting cylinders, feed lines, etc.  Employees practice safe handling practices, and follow manufacturer's recommendations on cylinder change-out.  All employees are trained in the maintenacne and operating procedures at this facility when they are rehired, and throughout their employement.  The operating and training procedures were last reviewed in November 2003.  The employees at the Graves-Foster Water Treatment Plant are trained in the classroom, and on-the-job training.  The last review of maintenance procedures was also November 2003.  There have been no incidents or accidents in the past five years.  The last Hazard Review was conducted in April 2004 by use of fault tree analysis.  There weren't any hazards identified during this review, so a completion date of the hazard review has been identified as the same date.  The prevention program for this facility is required to be a Level 2, however, a Level 3 PSM Prevention Program has been added for a more effective release prevention program.",
              "_chemicals": [
                {
                  "PrimaryKey": 22142,
                  "PreventionProgram2ID": 21190,
                  "ProcessChemicalID": 73461
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 38591,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-11-03 00:00:00",
    "ERTrainingDate": "2004-11-03 00:00:00",
    "CoordinatingAgencyName": "Hempstead County LEPC",
    "CoordinatingAgencyPhone": "8707771478",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38591,
      "SummaryText": "In this water treatment plant facility, we handle chlorine which is considered hazardous by EPA.  The same properties that makes chlorine valuable as a water treatment chemical, also makes it necessary to observe certain safety precautions in handling chlorine. Overall, the prevention of unnecessary human exposure, reducing the threat to our own personal health as well as our co-worker, and reducing the threat to nearby members of the community is the main goal of incorporating this risk management plan into our daily operations.  It is our policy to adhere to all applicable federal and state rules and regulations.  Safety depends upon the manner in which we handle chlorine combined with the safety devices inherent in the design of this facility, with the safe handling procedures that we utilize, and the training of our personnel.\n\nOur emergency response program was developed with the assistance of Environmental Data Services, Inc.  The emergency response plan includes procedures for notification of the  Hempstead County 911 System, which pages Fulton Volunteer Fire Fighters by page system.  These Fulton Fire Fighters will help to notify and evacuate any potentially affected neighbors.  The 911 System will also notify Hempstead county Offices of Emergency Services.  The emergency response plan also includes procedures for the mitigation of a liquid chlorine release.\n\nThe primary purpose of this facility is to treat the water system by utilizing chemicals such as chlorine. Chlorine is received by individual one ton cylinders at the Fulton Water Plant and stored until needed.  Chlorine is also received in 150 pound cylinders for the wells and booster stations located throughout Hope.  Chlorine is fed into the water system by automatic feeders.  All cylinders operate on a vacuum system. This vacuum system will prevent the continual operation of the system if there is an increase or decrease in operating pressure on the cylinders or lines. Access to the site is restrict"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38591,
      "SummaryText": "ed to authorized facility employees, authorized management personnel, and authorized contractors.  \n\nThe regulated substance handled at the Fulton facility is chlorine.  The maximum amount of chlorine that can be stored at this plant is 4,000 pounds.  All other wells and booster stations will have no more than 300 pounds of chlorine at any one time.  The 150 pound storage locations (Old Well #?s 3 and 5) will have no more than 2,250 pounds on hand at any given time.\n\nThis water treatment facility complies with EPA?s Accidental Release Prevention Rule and with all applicable state codes and regulations. \n\nWe have had no accidental releases of chlorine in the last five years.  The automatic vacuum system limits the amount (if any) of chlorine that escapes during operational periods.\n\nOur emergency response program was developed with the assistance of Environmental Data Services, Inc.  We have discussed this program with the Hempstead County Emergency Coordinator (Teresa Smith), the Hempstead County 911 System, as well as the Fulton and Hope Fire Department. A representative of Environmental Data Services, Inc. visited this plant February 18, 1999. Refresher  training was accomplished in November 2003.\n\nThe chlorine feed system at the Fulton facility was constructed in 1984 and is in compliance with all applicable regulations for water treatment facilities.  The Booster #23 location was added to the process in 1994, the Booster #67 location was added in 1998, and the Wells and the Ground Storage Stank were installed in 1997."
    }
  ]
}