{
  "FacilityID": 38708,
  "FacilityName": "D.L.Lee & Sons",
  "FacilityStr1": "927 Hwy 32 East",
  "FacilityStr2": null,
  "FacilityCity": "Alma",
  "FacilityState": "GA",
  "FacilityZipCode": "31510",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13005",
  "LEPC": null,
  "FacilityLatDecDegs": "31.540837",
  "FacilityLongDecDegs": "-082.444450",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3277365,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "David Lee",
  "OperatorStr1": "P.O. Box 206",
  "OperatorStr2": null,
  "OperatorCity": "Alma",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31510",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dave Lee",
  "RMPTitle": "Refrigeration",
  "FTE": 200,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000052453",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-25 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 31.54083,
  "FRS_Long": -82.44444,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 55734,
      "AltID": null,
      "FacilityID": 38708,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 57016,
          "ProcessID": 55734,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 73748,
          "ProcessID": 55734,
          "ChemicalID": 56,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 573748,
          "ProcessID": 55734,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38708,
      "SummaryText": "\nEXECUTIVE SUMMARY\n\n\n\n\n\n\n\n1. Accidental release prevention and response policies:\n\n\n\nD. L. Lee & Sons, Inc. is a small family owned pork-processing facility located approximately two miles east of Alma, Ga. on Hwy 32. The owners and managers of our facility are very supportive and concerned about the overall health and safety of everyone including employees, neighbors and community. We are proud of the fact that through management support and good leadership we worked hard and achieved a high level of commitment that exempted us from OSHA inspections for the early years of commercial development. It is this commitment that allows us to make accidental release prevention a top priority.\n\n\n\nOur emergency response activities are based on OSHA standard 1910.38. All activities are coordinated with the Alma Fire Department.\n\n\n\n2.    The stationary source and regulated substances handled:\n\n\n\nThe D.L. Lee plant imports refrigerated raw materials, primarily pork, chicken and beef, to manufacture various further processed meat products.\n\n\n\nThe refrigeration system contains twelve thousand pounds of anhydrous ammonia.\n\n\n\n3. The worst-case release scenario and the alternative release scenario including administrative controls and mitigation measures to limit the distance for each reported scenario:\n\n\n\nThe EPA has very exact guidelines when analyzing a worst-case scenario. The largest vessel on site can hold a maximum of 8,842 lbs. of ammonia. This quantity was used in the calculations, although during normal operations the vessel is below 80 percent capacity. The total contents of this vessel are assumed to be released in 10 minutes. Weather conditions used in the calculation are also worst possible conditions, little wind and a very stable atmosphere. A resulting distance to toxic endpoint of 1.2 miles was calculated. This does not mean anyone exposed within 1.2 miles would perish, but, if exposed, some long lasting health effects could occur.\n\n\n\nThe alternative release scenario "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38708,
      "SummaryText": "allows us to analyze a more likely release scenario under more normal weather conditions. A faulty relief valve was examined in the alternate release scenario resulting in a calculated distance to toxic endpoint to one tenth of a mile. There is mo population or public receptor in that distance.\n\n\n\n4.    The general accidental release prevention program and the specific prevention steps:\n\n\n\nWe have in place at our facility an OSHA PSM program, which continues to be worked on and improved for the betterment of our employees and surrounding neighbors. We have been in operation at this facility for approximately six years without an accidental release.\n\n\n\n5.    Five -year accident history:\n\n\n\nD. L. Lee and Sons take pride in the fact that there have been no accidents from an ammonia release since the plant began operation in 1993. \n\n\n\n6.    The emergency response program:\n\n\n\nAs the Haz-Mat technician responsible for an emergency, I would activate me Emergency Response Team, which includes management/owners, maintenance personnel, plant manager, and the safety coordinator. The safety coordinator?s responsibility would be to activate the Community Notification Plan. This includes a phone call to advise of the leak and the announcement of a possible follow-up phone call pertaining to the status of the leak, wind direction, and possible instruction for neighbors in the calculated distance that could be affected.\n\n\n\nThe contracts on the community notification plan include local emergency agencies, the hospital, local law enforcement, school, businesses, convalescent homes, and private citizens within the calculated distance from our facility.\n\n\n\n7.    Planned changes to improve safety:\n\n\n\nUpdating and improving our Process Safety Management program has been the top priority as we strive to improve safety. We have recently joined our efforts with The Stellar Group, a refrigeration contractor with expertise in process safety and regulatory compliance, to assist us with our efforts to achi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38708,
      "SummaryText": "eve the highest level of health and safety for our employees and community.\n\n\n\nWe are in the process of building up our in house Emergency Response Team with the capabilities of responding to all types of emergencies more quickly and efficiently.\n\n\n\n            \n\n"
    }
  ]
}