{
  "FacilityID": 38756,
  "FacilityName": "Sinclair Casper Refinery",
  "FacilityStr1": "5700 East Highway 20/26",
  "FacilityStr2": null,
  "FacilityCity": "Casper",
  "FacilityState": "WY",
  "FacilityZipCode": "82609",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "56025",
  "LEPC": "Natrona County LEPC",
  "FacilityLatDecDegs": "42.512900",
  "FacilityLongDecDegs": "-106.143400",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 79959185,
  "ParentCompanyName": "Sinclair Oil Corporation",
  "Company2Name": null,
  "CompanyDUNS": 79959185,
  "Company2DUNS": null,
  "OperatorName": "Sinclair Oil Corporation",
  "OperatorStr1": "P.O. Box 510",
  "OperatorStr2": null,
  "OperatorCity": "Evansville",
  "OperatorStateFIPS": "WY",
  "OperatorZipCode": "82636",
  "OperatorZipCodeExt": null,
  "FTE": 112,
  "OtherEPAFacilityID": "WYD 048 743 009",
  "EPAFacilityID": "100000144943",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "WDEQ/AQD 30-151",
  "SafetyInspectionDate": "2004-04-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 42.5129,
  "FRS_Long": -106.1434,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "1100000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 55795,
      "AltID": null,
      "FacilityID": 38756,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 73819,
          "ProcessID": 55795,
          "ChemicalID": 155,
          "Quantity": 5900000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 55407,
              "ProcessChemicalID": 73819,
              "ChemicalID": 119
            },
            {
              "FlamMixChemID": 55408,
              "ProcessChemicalID": 73819,
              "ChemicalID": 118
            }
          ]
        },
        {
          "ProcessChemicalID": 73820,
          "ProcessID": 55795,
          "ChemicalID": 98,
          "Quantity": 1200000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 57079,
          "ProcessID": 55795,
          "NAICSCode": "32411",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 32125,
              "Process_NAICS_ID": 57079,
              "SafetyReviewDate": "1997-05-08 00:00:00",
              "PHA_Date": null,
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1997-05-08 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fire Water System",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-05-04 00:00:00",
              "TrainingReviewDate": "2004-05-04 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-30 00:00:00",
              "EquipmentInspectionDate": "1995-03-08 00:00:00",
              "EquipmentTested": "Tank 206",
              "ChangeMgmtDate": "1998-09-18 00:00:00",
              "ChangeMgmtReviewDate": "2004-03-31 00:00:00",
              "PreStartupReviewDate": "1998-12-04 00:00:00",
              "ComplianceAuditDate": "2004-03-31 00:00:00",
              "AuditCompletionDate": "2005-03-31 00:00:00",
              "IncidentInvestigationDate": "1998-07-26 00:00:00",
              "InvestigationChangeDate": "2001-04-15 00:00:00",
              "ParticipationPlansReviewDate": "1998-04-15 00:00:00",
              "HotWorkPermitReviewDate": "2004-05-18 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-01 00:00:00",
              "ContractorSafetyEvalDate": "2004-05-18 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 46830,
                  "PreventionProgram3ID": 32125,
                  "ProcessChemicalID": 73819
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 38756,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-07-16 00:00:00",
    "ERTrainingDate": "2004-05-22 00:00:00",
    "CoordinatingAgencyName": "Natrona County LEPC",
    "CoordinatingAgencyPhone": "3072939205",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38756,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies\nSinclair Oil Corporation Health and Safety Policy\n\nSinclair Oil Corporation is committed to provide petroleum products and hospitality services in a safe and responsible manner. We recognize that excellence in managing health and safety issues is critical to the welfare of our employees and to the long-term success of our business. This policy requires full compliance with all laws and regulations and establishes principles and guidelines that serve as the foundation for our commitment to our employees and customers.\n \nSinclair commits to:\n\n·\tEnsure every employee understands that they are expected to perform work in a safe and prudent manner, and will be accountable for their personal actions and safe behavior. No one is ever expected to perform an unsafe task.\n\n·\tIncorporate health and safety concerns as an integral part of our business and a part of our strategic and operational decision making criteria.\n\n·\tEstablish, upgrade and audit company standards and procedures that will ensure all current health and safety regulatory requirements are met.\n\n·\tEliminate injuries, occupational illness and property damage by insisting on safe equipment operation, compliance with standard procedures, employee training and safe behavior.\n\n·\tProvide the leadership, resources and motivation necessary to maintain effective health and safety systems. Supervisors will be accountable for the human and physical resources under their control.\n\n·\tMaintain emergency response procedures and trained personnel to minimize the effects of spills, accidental releases, fires or other emergencies. \n\n·\tFoster a professional relationship with local, state and federal agencies.\nPeter M. Johnson\t\tKevin W. Brown\t\t\t\tHarmon M. Connell\nJoseph D. Maffuccio\t\tThomas E. Crull\t\t\t\tPaul D. Fritz\nRod Grimme\t\t\tMark A. Petersen\t\t\t\tSteven D. Lackey\nCorporate Philosophy for Process Safety Management\nSinclair Oil Corporation will work proactively to provi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38756,
      "SummaryText": "de a safe workplace for each employee and continue to promote safety practices among employees for their health and welfare. This will be accomplished at all facilities by actively assuring wide employee participation in a thorough Process Safety Management program and complete safety training. \nThe Process Safety Management program will be managed by a Corporate team, but completed on a facility basis under the specific direction of the facility manager. The program will conform to OSHA'¿ regulations contained in 29 CFR Part 1910.\nSinclair Oil Corporation has devoted the leadership, manpower, and capital investment necessary to complete the program. Sinclair Oil Corporation will update the Safety Management Program every five years. Emphasis is placed on managing the higher risk areas of our facilities first, the priority of which will be established by each facility team.\nStatement of Sinclair Casper Refinery\nThe Management of the Sinclair Casper Refinery in Evansville, Wyoming recognizes and firmly believes in the need for a safe environment for both its workers and the local community. \nOur policy is to ensure that our efforts with prevention¿through planning, training, reasonable process controls, timely maintenance, and communication with our neighbors¿will help us prevent foreseeable releases of regulated substances. If a release does occur, however, our trained personnel, in conjunction with trained personnel from the community, will respond to control and contain the release.\nDescription of the Stationary Source and Regulated Substances\nThe Sinclair Casper Refinery operates a variety of processes in petroleum refining to produce products (gasoline, diesel, kerosene, asphalt, butane, and propane) from raw crude oil. Most of the processes use heat, catalyst, and pressure to produce the above products from the crude. \nThe refinery has the following regulated flammables in its processes: \n·\tPentane (C5)\n·\tButane and isomers (C4)\n·\tPropane (C3)\n·\tEthane \n·\tMetha"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38756,
      "SummaryText": "ne\nThe refinery also has the following regulated toxics in its processes:\n·\tHydrogen Sulfide (H2S)\n·\tSulfur Dioxide (SO2)\nOf the above substances, only butane and its isomers, and propane meet the RMP threshold quantity levels. \nBy RMP definition, our entire facility falls under one RMP process. Our facility is a petroleum refinery under NAICS code 32411, and must meet the requirements of Program Level 3.\nWe are reporting the following three regulated chemicals in the RMPlan:\n·\tFlammable Mixture 1 (Light Gasoline): This represents the mixture of pentane and lighter hydrocarbons found in the piping and process units, and stored in Natural Gasoline tankage. The volumes of these hydrocarbons vary by day. The maximum quantity of Flammable Mixture 1 onsite is 14 million pounds.\n·\tFlammable Mixture 2 (Mixed Butanes): This represents a butane/butene mix in storage. It is listed separately from Flammable Mixture 1 to distinguish the large storage area of the mixed butanes. The maximum quantity of Flammable Mixture 2 onsite is 5.9 million pounds.\n·\tPropane. The maximum quantity of propane onsite is 2 million pounds.\nH2S and SO2 in the refinery do not meet threshold levels. We have four units that process or remove H2S from the processes. Our total amount does not exceed the RMP threshold quantities for these substances; therefore, we do not trigger RMP. Prevention and safety programs are in place for all H2S-handling units as part of our Process Safety Management Program.\nIn the past, the Casper Refinery used chlorine to treat water for its boilers and cooling towers. With the release modeling required under RMP, Sinclair determined that the potential impact of chlorine on the surrounding community was not necessary. Therefore, we replaced chlorine with an alternate, non-gaseous treatment system. This treatment system is more expensive to operate, yet we felt it was essential to remove chlorine in order to improve the safety of the community and minimize any toxic footprint"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 38756,
      "SummaryText": "from our facility.\n5-Year Accident History\nThe Sinclair Casper Refinery has not had any RMP-defined accidents. While releases have been documented, none have been of threshold substances, nor have these releases had offsite consequences. After each release, we investigated what happened, recorded the recommendations, and made changes to our processes, procedures, or safety systems to mitigate and eliminate future problems. \nAccident Release Prevention Program and Chemical-Specific Prevention Steps\nThe following is a summary of the general accident prevention program in place at the Sinclair Casper Refinery. For the one RMP process being reported by Sinclair, encompassing the entire refinery, RMP allows us to use OSHA¿s PSM standard as our prevention program. This summary addresses each of the OSHA PSM elements that are part of the RMP, and describes the system in place to implement the accident prevention program.\nThe elements are as follows:\n·\tEmployee Participation\n·\tProcess Safety Information\n·\tProcess Hazard Analysis\n·\tOperating Procedures\n·\tTraining\n·\tContractors\n·\tPre-Startup Safety Reviews (PSSRs)\n·\tMechanical Integrity\n·\tSafe Work Practices\n·\tManagement of Change\n·\tIncident Investigation\n·\tCompliance Audits\n\nEmployee Participation\nThe Sinclair Casper Refinery encourages and invites employees to participate in every aspect of process safety management and accident prevention. Specific ways that employees can be involved in the accident prevention program are documented in an employee participation plan that is maintained at the refinery and addresses each accident prevention program element. \nEmployees have access to all information that is part of the accident prevention program. Copies of information that is used daily is located in the unit operations buildings for quick access. \nExamples of employee participation include participating in the HAZOP analysis of each unit, updating and compiling technical documents and chemical information for their unit are"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 38756,
      "SummaryText": "a, and reviewing and being trained on any changes to operational or mechanical information that may affect them. Employees are also participants on our teams that address both process and worker safety. Teams are often comprised of representatives from plant management, safety, operations, environmental, maintenance, and engineering. \nProcess Safety Information\nThe Sinclair Casper Refinery keeps technical and safety documentation for each unit that falls under the PSM standard. This information helps ensure and maintain safe operation for the processes. These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis and configuration information. \nThe Safety, Engineering, and Maintenance departments are assigned responsibility within the plant to keep the process safety information updated. A table summarizing the reference documents and their location is readily available as part of the file in the Technical Manager¿s office in the main building. Duplicate copies of critical information are included onsite in each control room.\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in Material Safety Data Sheets (MSDSs). This information is supplemented by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals. For specific process areas, the refinery has documented safety-related limits for specific parameters (e.g., temperature, pressure, level, flow) used in monitoring and controlling operations. The refinery ensures that the process is maintained within these parameters using process controls and monitoring instruments, highly trained personnel, and protective instrument systems. \nThe refinery also maintains numerous technical documents that provide information about the design and construction of the equipment."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 38756,
      "SummaryText": "This information includes materials of construction, design pressure and temperature ratings, electrical rating of equipment, etc. This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised. This information is stored with the Inspection and Testing department.\nProcess Hazard Analysis\nThe Sinclair Casper Refinery has a comprehensive analysis program to ensure that hazards associated with the various processes are identified and controlled. Each process unit is systematically examined to identify hazards and ensure that adequate controls are in place to manage those hazards. \nThe Sinclair Casper Refinery uses the hazard and operability (HAZOP) analysis technique to perform these evaluations. HAZOP is a very systematic and thorough evaluation of potential hazards in the process unit. The refinery conducts a Process Hazard Analysis (PHA) with a team formed of knowledgeable, trained personnel from safety, maintenance, operations, environmental, engineering, and plant management. The team evaluates potential process hazards and identifies accident prevention and mitigation measures to ensure safe operating and maintenance of the units. The team makes recommendations about systems, procedures, or practices to put in place to ensure the hazards are managed and mitigated. \nThe PHA team findings are forwarded to local and corporate management for review and resolution. Implementation of systems, procedures, and practices are based on a determination of risk with the items. All approved mitigation options being implemented in response to PHA team findings are tracked until they are complete. The Technical Manager¿s office includes all information about the HAZOP analysis, team members, recommendations, and resolutions. \nTo ensure that the process controls"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 38756,
      "SummaryText": "and/or process hazards do not deviate significantly from the original design safety features, the Sinclair Casper Refinery updates and revalidates the hazard analysis results. The revalidation team consists of the same types of personnel that the initial HAZOP does. These periodic reviews are conducted at least every 5 years and will continue on that schedule until the unit is no longer operating or is removed. Revalidated hazard analysis results are tracked, submitted for management review, and retained and documented until they are complete. \nOperating Procedures\nThe Sinclair Casper Refinery maintains written procedures for all operations functions at the refinery. The procedures address various modes of unit operation, including:\n·\tPre-Startup\n·\tUnit Startup\n·\tNormal Operations and Process Control\n·\tTemporary or Special Operating Procedures\n·\tEmergency Shutdown\n·\tNormal Shutdown\nAdditional information present with the operating procedures includes a process description, a process chemistry description, an equipment description, operator responsibilities, safety concerns, chemicals in the unit, and utility and auxiliary systems. \n These procedures are used to train personnel in their responsibilities at the unit, to reference during operation of the unit, and to provide checklists necessary for unit operation. These procedures are periodically reviewed and certified as current and accurate. The procedures are maintained current and accurate by revising them as necessary to reflect changes made through the Management of Change process.\nOperating procedures are kept in the unit control rooms for each unit and are readily available to personnel to help them complete their tasks in a safe manner.\nTraining\nThe Sinclair Casper Refinery complements the written operating procedures with a comprehensive training program. New employees receive initial training in refinery operations and safety practices. After successfully completing this training, the new operator or techn"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 38756,
      "SummaryText": "ician receives a manual that guides them to an understanding of their responsibilities. Operators are given a manual that discusses the equipment, how it works, and what is involved in its operation. Drawings and graphics help the new operator picture the vessels and equipment in the unit. Maintenance personnel also receive guidance on their responsibilities under training by current maintenance personnel. \nNew operators are paired with senior operators to learn process-specific duties and tasks. All new operators are tested on what they have learned, both by study and by demonstration. When operators demonstrate adequate knowledge to perform the duties and tasks in a safe manner on their own, they are allowed to work independently. \nAll operators periodically receive refresher training in operations to ensure that their skills and knowledge are at a proper level. The refresher training is conducted at least every 3 years, and is documented for each operator. Maintenance personnel receive refresher training through the certifications required for inspection and testing. Personnel are required to take the necessary certification training and tests on the appropriate schedule to keep current. \nSinclair also trains personnel in safety, emergency response, and HAZOP. Safety and emergency response training takes place at least yearly, where local emergency response personnel from the local communities join our onsite emergency personnel for coordinated training. This training ensures that our local emergency response groups are familiar with our facility and get to know our people and our capabilities. \nPre-Startup Safety Reviews (PSSRs)\nThe Sinclair Casper Refinery conducts a PSSR for any new facility or facility modification that requires a change in the process safety information. The purpose of the PSSR is to ensure that safety features, procedures, personnel, and the equipment are appropriately prepared for startup prior to placing the equipment into service. This r"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 38756,
      "SummaryText": "eview provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready. \nThe PSSR review team uses checklists to verify all aspects of readiness. A PSSR involves field verification of the construction and serves as quality assurance by requiring verification that the accident prevention program requirements are properly implemented. The completed and signed PSSR checklist is included in the PSM files.\nMechanical Integrity\nThe Sinclair Casper Refinery has well-established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition. The basic aspects of this program include:\n·\tConducting training of maintenance personnel\n·\tDeveloping written procedures\n·\tPerforming inspections and tests\n·\tCorrecting identified deficiencies\n·\tApplying quality assurance measures\nThese activities form a system that maintains the mechanical integrity of the process equipment.\nSinclair uses current versions of the applicable API and ASME standards as the basis for setting acceptable limits. \nMaintenance personnel receive training on an overview of the process, safety and health hazards, applicable maintenance procedures, emergency response plans, and applicable safe work practices to help ensure that they can perform their job in a safe manner. Written procedures for testing and inspecting help ensure that the work is performed consistently and provides a basis for training. \nPersonnel perform inspections and tests to ensure that equipment functions as intended, and to verify that equipment is within acceptable limits. If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service, if possible, or the refinery¿s Management of Change team will review the use of the equipment and determine what actions are necessary to"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 38756,
      "SummaryText": "ensure the safe operation of the equipment. \nSinclair also integrates quality assurance within its mechanical integrity program by ensuring all equipment purchases and repairs and up to code and per specification. This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\nSinclair¿s inspection and testing personnel are certified to the proper standards and have current training certificates on file. Personnel are certified to API 510, 653, and 570 specifications. \nSafe Work Practices\nThe Sinclair Casper Refinery has long-standing safe work practices in place to help ensure worker and process safety. Examples of safe work practices include:\n·\tControl of the entry/presence/exit of support personnel on refinery property\n·\tA lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance\n·\tA procedure for safe removal of hazardous materials before process piping or equipment is opened\n·\tA permit and procedures to ensure that adequate precautions are in place before entry into a confined space\nThese procedures and others, along with training of all affected personnel, form a system to help ensure that our operations and maintenance activities are performed safely. \nManagement of Change\nThe Sinclair Casper Refinery has a comprehensive system to manage changes to processes. This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to ensure that adequate controls are in place to manage any new hazards, and to verify that existing controls have not been compromised by the change. \nAffected chemical hazard information, process operating limits, equipment information, and procedures are updated to incorporate these changes. Operating and maintenance personnel ar"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 38756,
      "SummaryText": "e provided any necessary training on the change.\nSinclair tracks all MOC changes and their details. The MOCs are stored in the Technical Manager¿s Office. \nIncident Investigation\nThe Sinclair Casper Refinery promptly investigates all incidents that resulted in, or reasonably could have result in, a fire or explosion, a toxic gas release, major property damage, environmental loss, or personal injury. The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident. \nThe investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to refinery management for resolution. Corrective action taken in response to the investigation team¿s findings and recommendations are tracked until they are complete. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings. \nSinclair retains incident investigation reports for at least 5 years so that the reports can be reviewed during future PHAs and PHA revalidations. \nCompliance Audits\nTo help ensure that the accident prevention program is functioning properly, the Sinclair Casper Refinery periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented. \nSinclair Oil Corporation has chosen to conduct compliance audits at least every 3 years using a knowledgeable team formed of corporate personnel, staff from other Sinclair refineries, and contractors, as required. The audit team reviews documentation and records, inspects the site, and interviews personnel to determine compliance. The audit team then develops findings that are forwarded to the refinery management for resolution. The final resolution of each finding is tracked and documented, and the two most recent audits are ret"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 38756,
      "SummaryText": "ained onsite as part of the PSM file.\nChemical-Specific Prevention Steps\nThe processes at Sinclair Casper Refinery have hazards that must be managed to ensure continued safe operation. The accident prevention program summarized above is applied to our Program Level 3 RMP-covered process. The prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\nIn addition to the accident prevention program, Sinclair has safety features on many units to help contain/control releases, detect releases, and reduce the consequences of a release. The following types of safety features are used in various process units:\nRelease Detection\n·\tHydrocarbon detectors with alarms\n·\tH2S detectors with alarms\nRelease Containment and Control\n·\tProcess relief valves that discharge to a monitored flare system. The flares capture and incinerate episodic releases\n·\tValves to permit isolation of the process (manual and automated)\n·\tAutomated shutdown systems for specific process parameters (e.g., high or low temperature, levels, pressures, etc.)\n·\tAlarms for specific process parameters\n·\tVessels to remove process inventory in the event or a release (tank storage, bypass systems)\n·\tConcrete curbing to contain liquid releases to unit areas only\n·\tRedundant instrumentation and equipment (spare and backup systems)\n·\tAtmospheric relief valves \nRelease Mitigation\n·\tFire suppression and extinguishing systems\n·\tDeluge system for specific equipment\n·\tTrained emergency response personnel (both refinery personnel and local emergency response personnel)\n·\tPersonal protective equipment (e.g., protective clothing, self-contained breathing, bunker gear, eye-wash systems, etc.)\nIf a release does occur, these release prevention systems help Sinclair Casper Refinery contain and control the release in a way that minimizes the risk to personnel and the public in the best way possible.\nEmergency Response Program\nThe Sinclair Casper Refinery maint"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 38756,
      "SummaryText": "ains a written emergency response program to protect worker and public safety as well as the environment. The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address all aspects of emergency response, including:\n·\tProper first-aid and medical treatment for exposures\n·\tEvacuation plans and accounting for personnel after an evacuation\n·\tNotification of local emergency response agencies and the public if a release occurs\n·\tCleanup and decontamination requirements\nIn addition, Sinclair has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment. \nEmployees receive, as part of their initial and ongoing refinery training, instructions and procedures for carrying out their specific emergency response duties. \nThe emergency response program is updated when necessary based on modifications made to refinery processes, changes in legal requirements, or refinery policy. The emergency response program changes are administered through the MOC process, which includes informing and/or training affected personnel in the changes. \nThe overall emergency response program for the Sinclair Casper Refinery is coordinated with the Natrona County Local Emergency Planning Committee (LEPC). LEPC members include local emergency response officials, local government officials, and industry representatives. The Sinclair Casper Refinery has periodic meetings with the LEPC, and has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations, including the fire department. This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident. \nIn addition to the periodic meetings, the Sinclair Casper Refinery conducts periodic"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 38756,
      "SummaryText": "emergency drills that involve the LEPC and emergency response organizations. We invite these organizations to train with us at our site to achieve a dual purpose: \n·\tTo provide annual refresher training to local emergency responders regarding the layout of the facility and the hazards of regulated substances in the refinery.\n·\tTo ensure that local emergency responder get to meet and interact with Sinclair¿s personnel in addressing response actions. \nThe fulfillment of these purposes help us ensure we meet the requirements of the emergency response program and have a practiced and effective plan in place that has the full confidence of the LEPC and local emergency response groups.\nPlanned Changes to Improve Safety\nThe Sinclair Casper Refinery resolves all safety-related findings from PHAs and other safety issues, some of which result in modifications to processes. For each modification, changes will be made to procedures and processes to ensure that they match the new equipment or changes. All affected personnel will be trained prior to their operation of the equipment.\nSinclair Oil Corporation Environmental Policy\nSinclair Oil Corporation recognizes its responsibility to protect and improve the quality of the environment.  This responsibility will be accomplished through Sinclair¿s commitment to:\n·\tEstablish and maintain a professional and active management team to promote and enhance our environmental performance.\n·\tAchieve excellence in management of our environmental duties through education and compliance with all local, state, and federal environmental regulations.\n·\tEstablish and foster a professional relationship with local, state and federal environmental agencies.\nBe proactive in the development of environmental policies and technologies."
    }
  ]
}