{
  "FacilityID": 38939,
  "FacilityName": "City of Wilmington Water Pollution Control Fac.",
  "FacilityStr1": "East 12th Street and Hay Road",
  "FacilityStr2": null,
  "FacilityCity": "Wilmington",
  "FacilityState": "DE",
  "FacilityZipCode": "19802",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "10003",
  "LEPC": "Wilmington LEPC",
  "FacilityLatDecDegs": "39.732750",
  "FacilityLongDecDegs": "-075.519194",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Veolia Water NA Operating Services",
  "OperatorStr1": "P.O. Box 9856",
  "OperatorStr2": null,
  "OperatorCity": "Wilmington",
  "OperatorStateFIPS": "DE",
  "OperatorZipCode": "19809",
  "OperatorZipCodeExt": null,
  "RMPContact": "Art Fagerstrom",
  "RMPTitle": "Project Manager",
  "FTE": 34,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000105879",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "AQM-003/00389",
  "SafetyInspectionDate": "2002-10-04 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-12-08 00:00:00",
  "DeRegistrationEffectiveDate": "2005-11-09 00:00:00",
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 39.73128,
  "FRS_Long": -75.50642,
  "FRS_Description": "LOADING FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "7",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56014,
      "AltID": "Municipal Wastewater Trmt",
      "FacilityID": 38939,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 57313,
          "ProcessID": 56014,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 74076,
          "ProcessID": 56014,
          "ChemicalID": 62,
          "Quantity": 57000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 574076,
          "ProcessID": 56014,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38939,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nVeolia Water NA Operating Services (VWNA), the operator of the Wilmington WPCF, is committed to the safety of the facility's employees and the public.  In order to minimize the potential for accidental releases of chemicals that could endanger public health or the environment, VWNA personnel review the properties of each material used at the facility; design the processes and equipment that will handle the materials in accordance with industry standards; and develop operation and maintenance  procedures that are based on industry-accepted practices.  All federal and state regulations that pertain to the materials are complied with.  The employees responsible for implementing the practices are then trained to ensure that they perform their jobs safely and without incident.\n\nKnowing that releases may occur in spite of the company's efforts to prevent them, VWNA has developed an Emergency Plan for the facility that sets forth the procedures to be followed in the event of a release.  The plan defines the procedures to be followed in dealing with the release, identifies the persons and agencies to be notified in the event of a release, and the persons and agencies to be called upon in the event assistance is needed.  The plan also describes the actions to be taken in conjunction with the Local Emergency Planning Committee in the event the release has the potential to affect persons offsite.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\nThe Wilmington WPCF is a publicly owned treatment works that treats approximately 134 million gallons per day of domestic and industrial wastewater generated in the City of Wilmington and portions of New Castle County.  Chlorine is used as a disinfectant to ensure that the treated wastewater discharged to the Delaware River does not contain disease-causing organisms.  The chlorine is delivered to the facility and stored at the facility in tank trucks.  The chlorine is conv"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38939,
      "SummaryText": "eyed from the tank trucks to evaporators, which convert the chlorine from a liquid to a gaseous state, then to chlorinators, which feed it into the wastewater.\n \nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\nThe release prevention program for the chlorine storage and feed system was developed in accordance with the requirements of OSHA's Process Safety Management Standard.  The program takes into account the hazards posed by the chemical, the process in which it is used, and the conditions of use.  Operating and maintenance procedures were then developed and the employees who are responsible to implement them are trained to ensure they are implemented properly.  Routine inspections of the process and equipment by facility personnel and periodic inspection and maintenance of the equipment by an independent contractor ensure that the equipment continues to function properly and without incident.  The program is periodically reviewed and updated as needed.\n\nFIVE-YEAR ACCIDENT HISTORY\nThere have been no accidental releases of chlorine at the facility in the last five years that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\nEMERGENCY RESPONSE PROGRAM\nThe existing emergency response program for the Wilmington WPCF was prepared in conjunction with the City of Wilmington LEPC.  \n\nPLANNED CHANGES TO IMPROVE SAFETY\nThe Wilmington WPCF plans to install the necessary equipment to allow it to use sodium hypochlorite instead of chlorine as the disinfection agent for the facility.  The change is expected to occur on or before December 31, 2004."
    }
  ]
}