{
  "FacilityID": 39013,
  "FacilityName": "FREMONT BEEF COMPANY",
  "FacilityStr1": "960 SOUTH SCHNEIDER STREET",
  "FacilityStr2": null,
  "FacilityCity": "FREMONT",
  "FacilityState": "NE",
  "FacilityZipCode": "68026",
  "Facility4DigitZipExt": "0908",
  "FacilityCountyFIPS": "31053",
  "LEPC": "Dodge LEPC",
  "FacilityLatDecDegs": "41.416667",
  "FacilityLongDecDegs": "-096.500000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "SW",
  "FacilityURL": null,
  "FacilityEmailAddress": "lleech@fremontbeef.com",
  "FacilityDUNS": 606928760,
  "ParentCompanyName": "STAMINA FOODS INC.",
  "Company2Name": "MARUBENI CORPORATION",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "STAMINA FOODS INC.",
  "OperatorStr1": "22-13, 1-chome, Naruohama",
  "OperatorStr2": null,
  "OperatorCity": "Nishinomiya",
  "OperatorStateFIPS": null,
  "OperatorZipCode": null,
  "OperatorZipCodeExt": null,
  "FTE": 140,
  "OtherEPAFacilityID": "SIC CODE 2013",
  "EPAFacilityID": "100000140322",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-05-06 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": "Hyogo",
  "ForeignZipCode": "663",
  "ForeignCountry": "JA",
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 41.41667,
  "FRS_Long": -96.5,
  "FRS_Description": "SW CORNER OF LAND PARCEL",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "2",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56112,
      "AltID": "REFRIGERATION",
      "FacilityID": 39013,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 74190,
          "ProcessID": 56112,
          "ChemicalID": 56,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 74191,
          "ProcessID": 56112,
          "ChemicalID": 98,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 57413,
          "ProcessID": 56112,
          "NAICSCode": "311612",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 32307,
              "Process_NAICS_ID": 57413,
              "SafetyReviewDate": "2004-04-15 00:00:00",
              "PHA_Date": "2004-04-15 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-04-15 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 0,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 1,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-04-15 00:00:00",
              "TrainingReviewDate": "2004-04-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-01-08 00:00:00",
              "EquipmentInspectionDate": "2004-01-08 00:00:00",
              "EquipmentTested": "pressure alarms",
              "ChangeMgmtDate": "1998-12-22 00:00:00",
              "ChangeMgmtReviewDate": "1999-01-15 00:00:00",
              "PreStartupReviewDate": "1999-01-15 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-04-15 00:00:00",
              "HotWorkPermitReviewDate": "2004-04-15 00:00:00",
              "ContractorSafetyReviewDate": "2004-04-15 00:00:00",
              "ContractorSafetyEvalDate": "2004-04-15 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 47041,
                  "PreventionProgram3ID": 32307,
                  "ProcessChemicalID": 74190
                },
                {
                  "PrimaryKey": 47042,
                  "PreventionProgram3ID": 32307,
                  "ProcessChemicalID": 74191
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 39013,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2003-10-05 00:00:00",
    "ERTrainingDate": "2003-10-05 00:00:00",
    "CoordinatingAgencyName": "Fremont fire department",
    "CoordinatingAgencyPhone": "4027272689",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39013,
      "SummaryText": "FREMONT BEEF COMPANY was built in 1989 with production starting in early 1990. Our facility uses ammonia for our refrigeration system and propane for our back up heating in the winter.The facility is approximatly 80000 square feet . Our ammonia and propane are both stored outside of the building at the northeast corner of our lot . Our on-sight AMMONIA storage is 12000 pounds , our on-sight PROPANE storage is 11100 pounds . Our primary operating function is the refrigeration of our processed beef products . There are 6 refrigeration compressors . There are 2 high side compressors , 2 swing compressors and 2 low side compressors . The AMMONIA is stored in 5 seperate tanks. They consist of 1 receiver tank rated at 1000 gallons , 2 high side accumalator tanks that store approximatly 400 gallons each and 2 low temp accumalators that store approximatly 400 gallons each. All of our refrigeration piping and valve stations are on the roof. The PROPANE is stored in 3 individual 1000 gallon water capacity storage tanks. These tanks are all piped together and feed 1 explosion proof supply pump that feeds our propane mixer. The mixer supplies our boiler and roof top heating units . This PROPANE set-up is for standby fuel usage only. This system has only been used three times in the 10 years the company has been open. An annual check and start-up are done to insure proper operation. An outside company does a once a week check on the refrigeration ststem to insure that there are no leaks in the system. They also note if any special item needs to be taken care of , such as oil changes, pressure relief valve changes,filter changes, drain oil pots etc. The release scenario is as follows. The 1000 gallon ammonia receiver was struck by lightning. This caused a welded seam to split. The crack is 1 foot long and 1/2 inch across. High pressure liquid escapes at a rate of 450 pounds per minute for a total time of ten minutes. The wind speed is 1.5 m/sec. The distance to end point is .85 m"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39013,
      "SummaryText": "iles. Approximate number of residents in the affected area is 2000. Evacuation efforts will be preformed by local fire and resque personal. The on site hazmat team ( 12 people ) will asses the situation and will take the appropriate measures to contain the leak as quickly as possible. All proper authorities will be notified of the leak and an assessment will be made to find out what the cause of the leak was and estimated amount of the loss. Notifying the hazmat team and guard station is top priority , giving them the following information. the name of the chemical involved, prevailing weather conditions (if applicable ) , best approach route - always up wind and upside if possible , and any life and property exposures .The emergency response personnel will comply with the following procedures. scene control : The affected area will be isolated and defined as a hot zone , Supervisory personnel will be assigned areas by the Incident Commander to keep people out of the area and deny entry , A command post and staging area will be set up in the first aid room , If other personnel are in the plant an evacuation may be required. Hazard and risk assessment : the operations officer and incident commander will analyze the situation and determine what actions need to be taken to stablize the release including location, the entrystrike team and backups, and methods of stopping the release. The Operations Officer will review entry procedures with entry strike team and backup team, as well as, all hazards that are present. Safety and protective equipment:The Incident Commander and the Logistics Officer will assist the response entry strike team with donning of safety equipment prior to entry. safety equipment will include SCBA's and level A suits. The backup entry team (assisted by the Safety Officer ) will don the required safety equipment but will not connect the SCBA's or seal the level A suit. The Safety Officer will remain in radio contact with the response team during ent"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39013,
      "SummaryText": "ry. The Safety Officer will start timing the entry team when the air on the SCBA's has been turned on.  The Safety Officer will notify the team every 5 minutes of the amount of air remaining (maximum of 30 minutes).  The entry team will be recalled to the staging area when there are 5 minutes of air remaining.  The team will decontaminate the entry suits when arriving at the staging area.  If the release has not been controlled, the Incident Commander will make the decision to either refit the strike team with new air supply and wait 15 minutes to rest, or send in the back-up team.  All above mentioned safety procedures will be followed if a new team will be sent in.  Team Emergency Situation.. If an entry response team is exposed to a hazardous substance or is injured while working in the hot zone and can't leave without assistance, the Safety Officer will notify security to call fire and rescue.  If the hot zone is not dangerous, the back-up team may make an attempt to bring the injured worker(s) to the first aid room.  Decontamination.. After the release has been contained, all contaminated tools and equipment will be left before the first set of green doors.  The entry team will enter the boot wash area to begin decontamination.  For Ammonia or other quickly evaporating substance that may present little danger, team members will use the hoses in the boot wash to wash down each other.  If team members are contaminated by any other substance, the back-up team, wearing PPE, will use hoses to decontaminate the team.  All PPE that cannot be decontaminated with water, will be placed in plastic barrels and discarded.  Post-Incident Analysis and Evaluation:  A debriefing meeting is held immediatedly after the spill event to review the success and problems in handling the spill.  The Incident Commander is responsible for assembling this meeting and inviting all involved or necessary personnel.  During the analysis, all aspects of the incident should be reviewed.  The inc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39013,
      "SummaryText": "ident itself and all events leading up to the incident shoudl be summarized, followed by the summarization of all procedures and responses including:  Command and control.. Tactical operations.. Intergroup cooperation.. Resources and support services.. Further preventive efforts.  An effort should be made to evaluate all health and safety issues related to the incident and any long term problems or medical surveillance that must occur because of the incident.  All information that is collected and reviewed should then be evaluated to identify:  Areas for improvement.. SOP's that must be revised.. Implications for training.. Preplanning and prevention activities..  These are the activities that may eventually impact the health of the HAZMAT Response Team and their safety to the greatest extent.  Pertinent results must be conveyed to those that will be involved in future responses to incidents.  In addition, recommendations on training and revision of provisions must be followed through.  Post-Incident analysis and evaluation reinforce and expand on First Responder knowledge of hazardous materials, increase the level of expertise in this area and consequently lead to safer handling of these incidents. There have been no accidents in the first five or second five years of plant operations. Our hazardous release and emergency response plan is inclosed. Our prevention policy is to provide proper maintenance for the refrigeration and the propane system to insure that they are not only in good operating order but they are in a safe working order also. We are always on the look-out for new technology that will not only help us run more efficiently, but will also help us have tighter control on any process variable that could pose a problem. Our constant goal is always to solve a potential problem before it becomes a real problem. Once a year we have emergency training with total shut down of the plant including all refrigeration and propane tanks. We also do emergency evacu"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 39013,
      "SummaryText": "ation of all employees, with only our hazmat team re-entering the facility to simulate an emergency."
    }
  ]
}