{
  "FacilityID": 39020,
  "FacilityName": "Towaliga River Water Treatment Facility",
  "FacilityStr1": "1147 Indian Creek Road",
  "FacilityStr2": null,
  "FacilityCity": "Locust Grove",
  "FacilityState": "GA",
  "FacilityZipCode": "30248",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13151",
  "LEPC": "Henry County LEPC",
  "FacilityLatDecDegs": "33.336472",
  "FacilityLongDecDegs": "-084.143333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "OT",
  "FacilityURL": "HCWSA.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Henry County Water & Sewerage Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Henry County Water & Sewerage Auth.",
  "OperatorStr1": "1147 Indian Creek Road",
  "OperatorStr2": null,
  "OperatorCity": "Locust Grove",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30248",
  "OperatorZipCodeExt": null,
  "FTE": 23,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000142785",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-08-08 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-07-29 00:00:00",
  "DeRegistrationEffectiveDate": "2014-07-25 00:00:00",
  "AnniversaryDate": "2009-06-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 33.32971,
  "FRS_Long": -84.12558,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "200",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56119,
      "AltID": "Water Treatment",
      "FacilityID": 39020,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 74199,
          "ProcessID": 56119,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 57422,
          "ProcessID": 56119,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 21369,
              "Process_NAICS_ID": 57422,
              "SafetyReviewDate": "2004-06-01 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 1,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2004-06-01 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": 0,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-06-01 00:00:00",
              "TrainingReviewDate": "2004-06-01 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-06-01 00:00:00",
              "EquipmentInspectionDate": "2004-06-15 00:00:00",
              "EquipmentTested": "SCBA, Chlorine Monitor, Gas Regulator",
              "ComplianceAuditDate": "2004-06-01 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 22333,
                  "PreventionProgram2ID": 21369,
                  "ProcessChemicalID": 74199
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 39020,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-06-01 00:00:00",
    "ERTrainingDate": "2004-06-01 00:00:00",
    "CoordinatingAgencyName": "Henry County Fire Department",
    "CoordinatingAgencyPhone": "7709542280",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39020,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe Henry County Water and Sewerage Authority has owned and operated water and wastewater treatment facilities within Henry County, Georgia for thirty years.  During this time the Authority has utilized chlorine gas for the disinfection of the treated water and wastewater.  To date there has been no reportable incident, over the ten-pound release, that has affected the health and safety of the employees or the communities where these facilities operate.\n\nWith the safety and welfare of its employees and the community at the forefront,  the Henry County Water and Sewerage Authority has developed a Risk Management Plan.  This plan has been submitted to all local emergency services to provide a comprehensive response to all possible scenarios related to the release of chlorine gas.  This plan to assure an orderly and complete response to issues that could arise in the utilization of chlorine gas\n\n\n\nSCOPE AND PURPOSE OF THE EMERGENCY RESPONSE PLAN\n\nIt is the policy of the Henry County Water & Sewerage Authority, Towaliga River Water Treatment Facility, to protect all workers and the community around this facility against known and anticipated hazards during the course of work operations as well as any emergencies arising at the plant.  Additionally, a site specific Emergency Response Plan has been  developed to ensure that all coordination with outside organizations including the National Response Center, the Georgia State Emergency Response Commission, Henry County Emergency Response Management, law enforcement, the Henry County Fire Department, Henry Medical Center, and emergency medical technicians is assured.\n\nWith the careful enforcement and execution of this Emergency Response Plan, in the event of an emergency release of hazardous gases at this facility, the harm to workers, the public and the environment will be minimized.  The Emergency Response Plan will address community planning and communication, how this facility will interact with local "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39020,
      "SummaryText": "officials to assist with public evacuation, and specify safe distances of refuge and rally points.  \n\nThe scope of this plan includes a chlorine gas release which can be contained within the facility and controllable by plant personnel and equipment, and a chlorine release affecting or with the potential to affect off-site areas around the facility, requiring outside assistance from the Henry County Fire Department.\n\n\nTYPES OF EMERGENCIES\n\nA Release of Chlorine Gas\n\nThere are several points at which a ?leak? could occur in the piping system, allowing a small amount or a large amount of chlorine gas to be released into the environment:\n\n1.    The first point in the chlorination line is at the one-ton cylinders themselves.  The valve could fail or rupture, resulting in the release of the contents of the cylinder.  If this occurs, a major release could occur and this is the worst case scenario for an emergency response at the Site. The gas could not be stopped by shutting off a valve, and the use of a B Kit for repairs would be in order.\n\n2.    The schedule 120# steel feed lines (approximately 15? of line) could develop a pin-hole leak, crack or break.  This could result in the release of a significant amount of chlorine gas very quickly depending on the extent of the break in the line.  This, too would constitute a worst case scenario for emergency response.  However, a leak here could be stopped by shutting off a valve.\n\n3.    Inside the control room there are a few potential break/leak points for the release of chlorine gas, including approximately 10 feet of pipe runs with numerous valves, elbows, tees and joints where leaks could develop.  The piping lines that carry the chlorine into the eductors could develop a leak or rupture, releasing chlorine gas into the air.  This could constitute a worst case scenario for emergency response.\n\n4.    Normal operations could result in an emergency response.  Hooking up the new chlorine cylinders to the manifold could result in a release"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39020,
      "SummaryText": " of chlorine gas.\n\n5.    The valve at the diffuser is another potential point for a leak to develop, resulting in emergency response.\n\n6.    Although not likely, the cylinders themselves could develop a leak or rupture.\n\nThere are continuous monitoring sensors for chlorine gas located in the cylinder storage area.  A release in this area could be quickly detected by this sensor and an alarm would sound that can be heard throughout the facility, grounds and office building, as well as the visual alarm indicators.\n\n\nLoss of Utilities\n\nAt this facility, the loss of utilities including electricity will not increase the potential for a release of chlorine gas.  \n\n\nThreatening Weather\nIn the event of dangerous weather such as a hurricane or tornado, all plant personnel and onsite visitors will gather at the designated rally point.\n\n\nBomb Threat Procedures\n\nMost bomb threats are telephoned in and are usually hoaxes.  It is still important to take all bomb threats seriously.  The person answering the phone must get as much information as possible from the caller.  The bomb threat work sheet is contained in Appendix 11 of this document.\n\nUpon completion of the bomb threat work sheet, the person taking the call will immediately notify the ranking supervisor.  The ranking supervisor will make the determination whether the call is a credible threat or if it is uncertain as to whether it is a credible threat.  If it is credible, the facility will be evacuated.  The bomb squad will be called, and if time permits, a search of the facility will be undertaken in an attempt to find the bomb.  If it is uncertain as to whether the threat is credible, the ranking supervisor will inform employees of the threat and make a decision as to what further action needs to be taken.\n\nBomb threats received through the mail must also be taken seriously.  Employees should use the precautionary procedures posted on the main bulletin board prior to opening all mail.\n\n\nLINES OF AUTHORITY\n\nS. David Whitson, P"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39020,
      "SummaryText": "roduction Manager, is the designated Incident Response Commander.  The Incident Response Commander is the senior emergency response official who is in charge of the Incident Command System (ICS).  This senior official has the responsibility for controlling the operations at the Site.  Initially, David Whitson  will serve as Incident Response Commander.  As more senior officers arrive (i.e., the Fire Chief, State Law Enforcement Official, etc.), the position is passed up the line of authority.  All emergency responders and their communications are coordinated and controlled through the senior official in charge of the ICS assisted by the senior official present for each employer.\n\nDavid Whitson reports to senior management, Lindy Farmer, General Manger of the Henry County Water & Sewerage Authority, and Mr. Farmer reports to the Henry County Manager, Linda Angus.\n\nAll employees at the plant are trained at the level of First Responder Awareness.  Plant Employees include Plant Operators, Maintenance Personnel, Lab Personnel and Secretarial Support  All Plant Operators are being trained to the level of First Responder Operations and Hazardous Materials Technicians.  Standby Rescue Personnel are to be certified by the American Red Cross or an equivalent agency in CPR and First-Aid, and have been trained in the identification of and protection against bloodborne pathogens.  (See job descriptions in Appendix 3.)\n\n\n\nESTABLISHMENT OF A RESPONSE MANAGEMENT SYSTEM\n\nThe Incident Response Commander, David Whitson, who is also designated the Site Safety Officer, will establish a response management system.  All First Responder Awareness Level personnel, First Responder Operations Level personnel and Hazardous Materials Technicians (plant operators) will report directly to the Incident Scene Commander as each senior official comes on site and assumes the role of Incident Response Commander.\n\nDuties of the Incident Response Commander include:\n\n1.    Determining the need for a rescue t"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 39020,
      "SummaryText": "eam;\n\n2.    Determining the need for and extent of repairs;\n\n3.    Determining the need for outside assistance and/or notification; and\n\n4.    Contacting additional personnel if needed to assist in the response.\n\n\n\nEMERGENCY RESPONSE PROCEDURES\n\nDiscovery\n\nA release of chlorine gas at the cylinders themselves or in the chlorine storage room will result in the sounding of the sensor alarm siren that can be heard throughout the facility and grounds, as well as visual alarm indicators.  (See example procedures in Appendix 1, Scenarios A-D.)\n\nAn employee discovering a release of chlorine gas which has not resulted in activation of the automatic alarm system is to immediately sound the alarm and then notify all other personnel and visitors to the Site that a release has occurred.\n\nThe Incident Response Commander, David Whitson, must be notified immediately, and plant operators (Hazardous Materials Technicians) summoned.\n\nBuilding Evacuation and Initial Rally Point\n\nAll site personnel and visitors will immediately gather at the rally point?in front of the Maintenance Building?and await further direction from the Incident Response Commander.\n\n\nSizing Up the Situation\n\nPlant employees trained as First Responder Operations Level will secure the area to make sure no unauthorized persons enter.\n\nTwo Hazardous Materials Technicians (Plant Operators) suited up in Level B suits and full face-piece SCBAs will approach the area to assess the nature and extent of the release and determine the necessary response action.\n\nIf turning a valve will stop the release, that action will be taken.  If more extensive action needs to be taken, the Hazardous Materials Technicians in coordination with the Incident Response Commander will determine what needs to be done and the technicians will perform the repairs.\n\nIf deemed necessary by the Incident Response Commander, who is also the Site Safety Officer, one or two standby rescue personnel will partially suit-up and be prepared to perform rescue if need"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 39020,
      "SummaryText": "ed.\n\nIf the repairs will take time to complete or the release is deemed to be of significant size so there is a possibility of off-site migration, the Fire Department will be called.\n\nA ranking supervisor of the Incident Response Commander will immediately call the Henry County Fire Department (911), and the Henry County Police Department.  The Incident Response Commander will meet or will delegate an available person to meet at the front gate and escort any outside responders notified to assist in the response.  If the front gate is not accessible, the responders will be met at the public road upwind of the release.\n\nThe Incident Response Commander/Site Safety Officer will establish work zones, as needed, to include the Exclusion Zone, the Contamination Reduction Zone and Decontamination Sequence and the Support Zone.\n\nThe Incident Response Commander will preliminarily assess the areas/resources threatened, but will turn over authority to the Fire Chief as soon as he arrives to take action.  The Fire Chief will initiate and execute any public evacuation deemed necessary.\n\n\nPlant Evacuation\n\nIn the event of the need to evacuate the Site to an off-site location, the designated employees, the Superintendent of Maintenance, trained to escort the evacuation to the rally point and account for all employees, will direct the evacuation.\n\nWhen winds are out of the West, the designated rally point is the Maintenance Building.  The Incident Response Commander will designate an alternate rally point in the event the wind is from another direction.  The rally point will be located, at a minimum, 1200 feet away, upwind of the incident. Windsocks will be placed at the Site to indicate the wind direction.  All personnel evacuating the Site will be instructed to remain crosswind or upwind of the gas at all times.\n\nThe Site?s normal operational schedule will be used to account for all employees at the rally point.  Any unaccounted-for personnel will be reported immediately to the In"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 39020,
      "SummaryText": "cident Response Commander who will initiate search and rescue operations.\n\nBased on the final decision by the Fire Department, it may be necessary to protect persons downwind during the day:  >0.1 miles for a small release of chlorine and 1.0 miles for a large release.  A nighttime release of chlorine gas might necessitate protecting persons downwind up to 0.1 miles, and 2.3 miles for a large release of chlorine gas.  (See the radius map in Appendix 2.)\n\nThe Incident Response Commander or a designated employee will call Henry Medical Center Emergency Room at (770) 389-2260 and inform them that a release has occurred.  In the event anyone is overcome by the gas, the EMTs will be called at that same number.\n\nEmergency Numbers (Appendix 1) are posted by telephones and on bulletin boards.  Evacuation routes (Appendix 2) are posted in work areas and in the main offices.\n\nThe use of example scenarios included in Appendix 1 will be utilized to assure that all necessary actions for emergency response have been taken.\n\n\n\nTERMINATION AND FOLLOW-UP ACTIONS\n\nPost-incident procedures will be dictated by the extent of the release and subsequent emergency response.  All clear for re-occupancy will be determined by the Senior Official present at the Site upon conclusion of the response.  The Incident Response Commander will declare all-clear before personnel are allowed to return to the Site.\n\n\nDecontamination\n\nImmediately upon completing repairs and exiting the Exclusion Zone, all Hazardous Materials Technicians will decontaminate thoroughly using a mild detergent and water, and continue to wear respiratory protection until inside the Support Zone.  (See Appendix 6.)\n\n\nOutside Regulatory Agency Notification\n\nThe law requires immediate reporting of any releases of chlorine equal to or greater than 10 pounds (the Reportable Quantity, RQ, for chlorine) to the following agencies:\n\n1.    The National Response Center\n2.    The Henry County Emergency Response Management\n3.    The State Emergency "
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 39020,
      "SummaryText": "eam?    Prepares and organizes the background review of the situation and the field team?    Obtains permission for Site access and coordinates activities with appropriate officials?    Ensures compliance with the Emergency Response Plan?    Briefs the field teams on their specific assignments?    Acts as the Site Safety officer to ensure that safety and health requirements are met?    Prepares the final report, critique and support files on the response activities?    Serves as the liaison with public officials?    Passes senior official authority up the line as a more senior official arrives at the Site (e.g., the fire chief)?    Maintains line-of-sight and communication contact with the Hazardous Materials Technicians during an emergency response?    Notifies emergency response personnel by telephone or radio in the event of a release?    Notifies all internal and external parties in the event of a release and emergency response action?    Establishes the Exclusion, Contamination Reduction, and Support Zones, as well as the Decontamination Sequence?    Controls the decontamination of all equipment and personnel at the Site?    Assists in the proper disposal of decontamination solutions?    Ensures that all required equipment is available?    Advises medical personnel of potential exposures and consequencesMust have at least 24 hours of training equal to the First Responder Operations level.  First Responders at the Awareness Level must have sufficient training or have had sufficient experience to demonstrate objectively competency in the following areas:?    Knowledge of the hazards associated with chlorine gas;?    Knowledge of the potential outcomes associated with an emergency created when hazardous substances are present;?    Recognition of the presence of hazardous substances in an emergency;?    Ability to identify the hazardous substances;?    Comprehension of the role of the First Responder Awareness individual in the employer?s emergency response plan including Site security and control;?    Comprehension of the U.S. D"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 39020,
      "SummaryText": "Response Commission (The State wants to be notified of any release, regardless of the amount.)\n\nVerbal notification must be given immediately after the incident has occurred.\n\nWritten follow-up is required to be provided to these agencies as soon as practicable after the incident occurs.\n\nSee Appendix 1 for phone numbers and information to provide to these agencies.\n\nPost-incident investigation, response critique, plan re-evaluation and written follow-up reports will be handled by David Whitson.\n\n\nOSHA Notification\n\nIn the event of a fatality or multiple hospitalization, OSHA is to be notified within 48 hours in accordance with OSHA regulations.  This notification will be handled by David Whitson.\n\n(See Appendix 8 for follow-up procedure information.)\n\n\n\nAFTER FIRST SHIFT HOURS PROCEDURES\n\nDavid Whitson is to be contacted immediately with a ranking supervisor assisting until his arrival.\n\n\n\nTELEPHONE COMMUNICATION\n\nDuring the day shift the telephone will be answered by a secretary or plant operator.  During the night shift, it will be answered by any available employee.  Any requests from the media are to be referred to the Incident Response Commander, David Whitson.  If that person is unavailable, take the caller?s name, organization and phone number.  Persons assigned to answering the phone are not authorized to discuss the incident with the media or with callers except people involved in the emergency response.  Simply state: ?We have had an emergency.  We are responding to it now (or it has ended).  Someone from this facility will return your call as soon as possible if you will give me your name, organization and phone number.  I am not authorized to give you any information.?  Give them your name if they ask for it.\n\n\n\nMEDIA INQUIRY\n\nMedia inquiries will be handled, as time permits, by the Production Manager / Incident Response Commander, David Whitson.  Arriving media representatives will be allowed to wait in the secretary?s office, if accessible.  No one ot"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 39020,
      "SummaryText": "her than plant employees and emergency responders are allowed access to the plant at anytime during the emergency without prior authorization.\n\nWhen time permits, the media personnel should be given background information on chlorine.  When facts are known about the incident and the cause, these should be given to the media.  ANY PERSON DISCUSSING THE INCIDENT WITH THE MEDIA MUST NOT SPECULATE AS TO THE CAUSE OF THE INCIDENT.  IF THE CAUSE IS KNOWN, SO ADVISE THE MEDIA.  IF THE CAUSE IS NOT KNOWN, ADVISE THE MEDIA IT IS UNDER INVESTIGATION.  NORMALLY THE QUANTITY OF CHLORINE EMITTED DURING A RELEASE IS UNKNOWN UNTIL A THOROUGH INVESTIGATION IS COMPLETE.  IF SUCH IS THE CASE, SO ADVISE THE MEDIA.\n\n\n\nEVACUATION OF RESIDENTS\n\nThe Incident Response Commander will notify the Fire Department who will determine if evacuation is necessary.  The Fire Department will make the necessary notifications in accordance with the previously agreed-upon sheltering plan.  Residences will be notified to shut windows and close any ventilation system and listen for further advisories.\n\n\n\nNEIGHBORING FACILITIES\n\nNeighboring facilities will be notified directly if they are affected or potentially affected.  These facilities have pre-established emergency response procedures that have been discussed with this facility?s management.\n\n\n\nCHLOREP ? OUTSIDE ASSISTANCE\n\nIn the event the ton container leak cannot be contained, our supplier, Harcor Chemicals will be contacted at  404-351-6000.  If assistance cannot be obtained, contact CHLOREP through CHEMTREC at 1-800-424-9300.  Describe the problem as well as the required help needed.  The Production Manager, David Whitson, will make these contacts.\n\n\n\nPLAN REVIEW/REVISION DATE\n\nThis site-specific Emergency Response Plan was originally developed June 21, 1999 and was revised on June 1, 2003.  This current revision is dated June 21, 2004.  It is the policy of the Henry County Board of Commissioners to review this plan, as well as OSHA regulations t"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 39020,
      "SummaryText": "hat might impact it, on an annual basis.  The plan will be audited annually to evaluate the efficacy of the plan and a critique will be incorporated following any emergency response action taken.  The plan will be updated to reflect any procedural modifications or changes in regulations that affect the Emergency Response Plan.  The Division Manager is responsible for reviewing and revising this plan.\n\nTraining of personnel with respect to this plan will be an ongoing process until such time as the staff have all received the required education from internal and outside agencies.\n\nAll review and revision records will include, at a minimum, the name and signature of the reviewer, the date of review, and a record of all revisions that were made.  (Review/Revision Form is included in Appendix 12.)\n\n\n\nTRAINING\n\nTraining for all emergency responders, as required by the Emergency Response Regulation, 29 CFR 1910.120(q) will be certified for each employee.  Annual refresher training, also required by the OSHA regulations will be assured for each emergency responder.\n\nFirst Responders at the Awareness Level must have sufficient training or have had sufficient experience to objectively demonstrate competency in the following areas:\n\n?    Understanding of the hazards associated with chlorine gas.\n?    Understanding of the potential outcomes associated with an emergency created when hazardous substances are present.\n?    Ability to recognize the presence of hazardous substances in an emergency.\n?    Ability to identify the hazardous substances.\n?    Understanding of the role of the First Responder Awareness Level individual in the employer?s emergency response plan including site security and control and the U.S. Department of Transportation?s Emergency Response Guidebook.\n?    Ability to realize the need for additional resources, and to make appropriate notifications to the communication center.\n\nFirst Responders at the Operations Level must will receive at least eight hours of specialized trai"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 39020,
      "SummaryText": "ning as required by the Emergency Response Regulation or will have sufficient experience to objectively demonstrate competency in the following areas in addition to those listed for the awareness level:\n\n?    Knowledge of the basic hazard and risk assessment techniques.\n?    Knowledge to select and use proper personal protective equipment.\n?    Understanding of the basic hazardous materials terms.\n?    Knowledge to perform basic control, containment and/or confinement operations within the capabilities of the resources and personal protective equipment provided to the First Responder Operations Level.\n?    Knowledge to implement basic decontamination procedures.\n?    Understanding of the relevant standard operating procedures and termination procedures.\n\nHazardous Materials Technicians will receive a minimum of 24 hours of training equal to the First Responder Operations Level.  Annual refresher training is required in the following:\n\n?    Implementation of the employer?s emergency response plan;\n?    Usage of field survey instruments and equipment to classify, to identify and to verify known and unknown materials;\n?    Function within an assigned role in the Incident Command System;\n?    Selection and usage of proper specialized chemical personal protective equipment provided to the Hazardous Materials Technician;\n?    Hazard and risk assessment techniques;\n?    Advance control, containment and/or confinement operations within the capabilities of the resources and personal protective equipment available with the unit;\n?    Decontamination procedures;\n?    Termination procedures;\n?    Basic chemical and toxicological terminology and behavior; and\n?    Function as Site liaison with federal, state, local or other government authorities in regards to Site activities.\n\nThe Incident Response Commander will have at least 24 hours of training equal to the First Responder Operations Level.  Annual refresher training in the following is required by the Emergency Response regulation:\n\n?    Implementation of the employer?s inc"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 39020,
      "SummaryText": "ident command system;\n?    Implementation of the employer?s emergency response plan;\n?    Hazards and risks associated with employees working in chemical protective clothing;\n?    Implementation of the Local Emergency Response Plan;\n?    The State Emergency Response Plan and the Federal Regional Response Team Plan;\n?    Importance of decontamination procedures; and\n?    Actions as the Site Safety Officer to ensure that safety and health requirements are met.\n\n\n\nCHANGING ONE-TON CHLORINE CYLINDERS\n\n1.    Make sure the cylinders are empty?\na.    zero on the pressure gauge at the chlorinators\nb.    zero on the weight scales\nc.    turn on the exhaust fan\n\n2.    Two-person minimum will be used to change out cylinders.  One will stand by the doorway with radio communication, ready to put on the full breathing apparatus if necessary, while the other person is changing out the cylinders.  The person changing the cylinders will carry an escape respirator on them, to be used to exit the room in case of a leak.\n\n3.    Close the valves on both empty cylinders and pigtail/yoke assemblies.  Close both valves on the manifold to insure no air or moisture is drawn back into the pigtail in leading to the cylinders.  (NOTE:  NEVER STRIKE VALVE WRENCHES OR USE CHEATER BARS.)\n\n4.    Remove the yoke assemblies by adjusting the bolt on the yoke assemblies.  Once the yoke assemblies are removed, screw the valve caps onto the cylinder valves.\n\n5.    Using the hoist, move empty cylinders to the cradle at the farthest point from the scales, turning the valve end of the cylinders toward the west end of the room.  Replace the valve covers on the cylinders and mark the cylinder with an empty tag.  When moving full cylinders, make sure the valves are lined up from top to bottom when placing the cylinders on the scales.  Remove the valve cover.  Using the chlorine valve wrench, make sure the valves are closed before unscrewing the valve caps.  Test for leaks with AMMONIA SOLUTION.\n\n6.    Remove valve caps for yoke assembly connection.  Befor"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 39020,
      "SummaryText": "e connecting yoke assembly, be sure to replace old lead washer with a new lead washer.  Connect the yoke assembly and tighten it down.  Do not over tighten as this could cause a leak at the assembly.  Using a chlorine valve wrench, open the valve a ? turn and close it back.  (IF VALVE WILL NOT OPEN, ROTATE CYLINDER AND USE THE OTHER VALVE.)  Test for leaks using the AMMONIA SOLUTION.  If there are no leaks, open all the valves one full turn and test for leaks under normal line pressure.\n\n7.    Set the weight on the scales and turn off exhaust fan.\n\n\n\nPERSONAL PROTECTIVE EQUIPMENT\n\nSee Appendix 4.\n\n\n\nMEDICAL SURVEILLANCE REQUIREMENTS\n\nSee Appendix 5.\n\n\n\nHEAT STRESS CONSIDERATIONS\n\nSee Appendix 7.\n\n\n\nDRILLS AND EXERCISES\n\nActual drills and exercises for mock release responses will be conducted on an annual basis.  Logs will be maintained to document personnel training/exercise sessions.  All emergency equipment and personal protective equipment will be inspected and maintained in good working order by the Incident Response Commander/Site Safety Officer.  The monthly (and post-use) inspection information will be maintained in a log along with any repairs that were made.\n\nFacility evacuation drills will be performed annually.\n\n\n \nSCENARIO A ? A RELEASE CAN BE CONTAINED BY ONSITE PERSONNEL\n\nA RELEASE OF CHLORINE HAS OCCURRED\n\n1.    Alarm sounds.\n\n2.    Notify Incident Response Commander (?IC?)/Site Safety Officer, David Whitson.\n\n3.    Summon Plant Operators.\n\n4.    Secure the area.\n\n5.    Gather all employees/visitors in front of the Maintenance Building, to await further instruction and head count.  All employees are accounted for.\n\n6.    Plant Operators (2) dress out in Level B with SCBA.\n\n7.    IC sets up work zones and decontamination sequence and determines the need for standby rescue personnel.\n\n8.    Plant Operators assess the release.\n\n9.    Plant Operators shut off a valve thereby stopping the release.\n\n10.    Plant Operators go through decontamination.\n\n11.    IC declares all clear for re-occupa"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 39020,
      "SummaryText": "ncy.\n\n12.    IC or designated MANAGER makes internal and external notifications?the State Emergency Response Commission and Henry County Emergency Management.  If more than 10 pounds of chlorine has been released, then notify the National Response Center.\n\n13.    IC prepares follow-up reports to agencies and writes up a critique of the incident.\n \n SCENARIO B ? A RELEASE IS OF SUFFICIENT SIZE OR HAS THE POTENTIAL TO MIGRATE OFF THE GROUNDS AND REQUIRES OFF-SITE ASSISTANCE\n\nA RELEASE OF CHLORINE HAS OCCURRED\n\n1.    Alarm sounds.\n\n2.    Notify Incident Response Commander (?IC?)/Site Safety Officer, David Whitson.\n\n3.    Summon Plan Operators.\n\n4.    Secure the area.\n\n5.    Gather all employees/visitors in front of the Maintenance Building, to await further instruction and head count.  All employees are accounted for.\n\n6.    Plant Operators (2) dress out in Level B with SCBA.\n\n7.    IC sets up work zones and decontamination sequence and determines the need for standby rescue personnel.\n\n8.    Plant Operators assess the release.\n\n9.    IC and Plant Operators determine the response requires outside assistance.\n\n10.    IC or designated MANAGER calls the Fire Department and Henry County Police and notifies Henry Medical Center.\n\n11.    IC or designated MANAGER notifies National Response Center (if more than 10 pounds of chlorine has been released), the State Emergency Response Commission and Henry County Emergency Management.\n\n12.    Evacuate employees/visitors to Lester Mill Road gates and South to the Griffin/Locust Grove Road and account for all persons.\n\n13.    Fire Department evacuates residents, if necessary.\n\n14.    IC or designated MANAGER notifies neighboring facilities (N/A) and General Manager.\n\n15.    Plant Operators stop the release.***\n\n16.    Plant Operators decontaminate.\n\n17.    IC declares all clear for re-occupancy.\n\n18.    IC prepares follow-up report for agencies and writes critique of the incident.\n\n\n***If the release cannot be stopped, contact Harcros Chemicals for assistance.  If the vendor cannot be reached"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 39020,
      "SummaryText": ", contact CHLOREP through CHEMTREC for assistance.\n \nAppendix 1\n\n\nEMERGENCY PHONE NUMBERS\n\nHenry County Water & Sewerage Authority Personnel\n\n\nDavid Whitson ? Water Production Manager / Incident Response Commander\n            Office:    (770) 957-1380\n            Home:    (770) 957-5208\n            Pager:    (404) 722-6601\n            Cell:    (770) 583-0806\n\n\nAndy Young ? Water Production Supervisor, Operators\n            Office:    (770) 957-1380\n            Home:    (770) 954-9268\n            Pager:    (404) 672-3057\n            Cell:    (404) 456-9432\n\n\nKim Pace ? Facility Maintenance Supervisor\n            Office:    (770) 957-1380\n            Home:    (770) 898-3897\n            Pager:    (770) 705-8843\n            Cell:    (678) 614-4036\n\n\nRay Lindsay ? Safety Manager\n            Office:    (770) 957-6659\n            Home:    (706) 647-2250\n            Cell:    (678) 614-1612\n\n\nMax Hill ? Security Manager\n            Office:    (770) 957-6659\n            Home:    (770) 914-8742\n            Cell:    (678) 409-8798\n\n\n\n\n\n\nRegulatory Contacts\n\nHenry County Fire Department    (770) 954-2280\nHenry County Police Department    (770) 954-2900\nHenry County Sheriff?s Department    (770) 954-2200\nNational Response Center    (800) 424-8802\nState Emergency Response Committee    (800) 241-4113\n\nOther Contacts\n\nHenry Medical Center    (770) 389-2260\nHarcros Chemical    (404) 943-8966\nCHEMTREC/CHLOREP    (800) 424-9300\n\nNeighboring Plants\n\n    \n    \n    \n    \n    \n    \n\n \nEMERGENCY RESPONSE RESPONSIBILITY\n\nActivity    Responsibility\n    Day Shift    Night Shift\nInitiating Emergency Response Plan    Any employee    Any employee\nOverall Coordination    Incident Response Commander    Incident Response Commander\nInside Communications    Any employee    Any employee\nOutside Communications    Incident Response Commander    Incident Response Commander\nFirst-Aid/Rescue    Any employee    Any employee\nPhone Answering    Secretary    Any employee\nAgency Notification    Incident Response Commander    Incident Response Commander\nEmergency Repair    Plant Operators    Plant Operators\nEmployee/Visitor Accounting    Incident Response Commander    Incident Response Commander\n\n \nAppendix 2\n\n\nFacility and Locality Information\n\nOnsite Emergency Evacuation Rally Point\n\nEvacuation Route and Route to Henry Medica"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 39020,
      "SummaryText": "l Center\n\nChlorine Evacuation Radius Map\n \nAppendix 3\n\n\nJOB DESCRIPTIONS FOR THE FACILITY RESPONSE MANAGEMENT SYSTEM\n\nSenior Level Management    Responsible for defining objectives, allocating resources, determining the chain-of-command and evaluating program outcome.\n    \nIncident Response Commander/Emergency Response Coordinator    Reports to upper level management.  Has the authority to direct response actions.  Has the Authority to stop work and evacuate at all times.  Assumes total control over Site activities.  Coordinates and controls all emergency responders and their communications assisted by the senior official present for each employer.  All emergency responders and their communications shall be coordinated and controlled through the individual in charge of the Incident Command System (?ICS?) assisted by the senior official present for each employer.The ?senior official? at an emergency response is the most senior official on the site who has the responsibility for controlling the operations at the Site.  Initially it is the senior officer on the first-due piece of responding emergency apparatus to arrive on the incident scene.  As more senior officers arrive (e.g., battalion chief, fire chief, state law enforcement official, site coordinator, etc.) the position is passed up the line of authority that has been established previously.The Incident Response Commander/Emergency Response Coordinator has the following responsibilities and knowledge:?    Responsible for communications and emergency assistance;?    Responsible for decontamination procedures, equipment and supplies;?    Knowledge of and ability to implement the employer?s incident command system;?    Knowledge of and ability to implement the employer?s emergency response plan;?    Knowledge of the hazards and risks associated with employees working in chemical protective clothing?    Ability to implement the Local Emergency Response Plan?    Knowledge of the State Emergency Response Plan and of the Federal Regional Response T"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 39020,
      "SummaryText": "epartment of Transportation?s Emergency Response Guidebook; and?    Ability to realize the need for additional resources and to make appropriate notifications to the communication center.Annual refresher training is required by the Emergency Response regulation.\n    \nFirst Responder Operations Level    Individuals who respond to releases or potential releases of hazardous substances as part of the initial response to the Site for the purpose of protecting nearby persons, property or the environment from the effects of the release.  First Responder Operations Level personnel are trained to respond in a defensive fashion without actually trying to stop the release.  If in the immediate area of a release, a properly trained and equipped responder can shut off a valve to stop the release?if possible.First Responders at the Operations Level must have received at least eight hours of specialized training as required by the Emergency Response regulation or have had sufficient experience to demonstrate objective competency in the following areas in addition to those listed for the awareness level:?    Knowledge of basic hazard and risk assessment techniques?    Knowledge of selection and use of proper personal protective equipment?    Knowledge and comprehension of basic hazardous materials terms?    Knowledge of and ability to perform basic control, containment and/or confinement operations within the capabilities of the resources and personal protective equipment provided to the First Responder Operations Level?    Ability to implement basic decontamination procedures; and?    Comprehension of relevant standard operating and termination procedures.(Annual refresher training in the above is required.)\n    \nHazardous Materials Technicians    Individuals (at least two, working in ?buddied? pairs) who respond to releases or potential releases for the purpose of stopping the release.  They assume a more aggressive role than a First Responder at the Operations Level in that they can approach the point of relea"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 39020,
      "SummaryText": "se in order to perform B-Kit repairs for valves repair or to shut off a valve to stop the release.Hazardous Materials Technicians must receive a minimum of 24 hours of training equal to the First Responder Operations Level.  Annual refresher training in the following is required:?    Implementation of the employer?s emergency response plan;?    Use of field survey instruments and equipment to classify, to identify and to verify known and unknown materials;?    Function within an assigned role in the Incident Command System;?    Selection and usage of proper specialized chemical personal protective equipment provided to the Hazardous Materials Technician;?    Hazard and risk assessment techniques;?    Advance control, containment and/or confinement operations within the capabilities of the resources and personal protective equipment available with the unit;?    Decontamination procedures;?    Termination procedures;?    Basic chemical and toxicological terminology and behavior; and?    Ability to function as site liaison with federal, state, local or other government authorities in regards to site activities.\n    \nStandby Rescue Personnel    Responsible for rescue in the event a Hazardous Materials Technician or other person is overcome during a release.Stands by, partially dressed in protective gear, near the response work area.Rescues any worker whose health or safety is endangered.Must possess the following skills/training:?    Knowledge in the use, care and limitations of all personal protective equipment needed to provide assistance or rescue during an emergency response; and?    American Red Cross or equivalent CPR/First-Aid and bloodborne pathogens training.\n\n \nAppendix 4\n\n\nPERSONAL PROTECTIVE EQUIPMENT REQUIREMENTS\n\n29 CFR 1910.120(g)\n\n\nPersonal protective equipment (?PPE?) is selected and used to meet the requirements of the OSHA General Industry Regulations, Part 1910, Subpart I.  Additionally, all employees wearing SCBAs are included in the Towaliga River Water Treatment Facility?s written Respira"
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 39020,
      "SummaryText": "tory Protection Program and Medical Surveillance Program.\n\nFull-body chemical-resistant suits, chemical-resistant inner and outer gloves and outer chemical-resistant boot covers are required to protect employees from chlorine gas.  The pant leg/boot interface and the glove/sleeve interface must be taped securely.  The Incident Response Commander/Site Safety Officer will be responsible for implementing the PPE program.\n\nPersonnel will follow the manufacturer?s procedures for donning and doffing PPE.\n\nThe PPE program addresses the following: use and limitations of the equipment; work mission duration; PPE maintenance and storage; decontamination or disposal; training; PPE proper fitting; inspection procedures prior to, during and after use; evaluation of the effectiveness of the program; and limitations during temperature extremes, heat stress and other appropriate medical considerations.\n \nAppendix 5\n\n\nMEDICAL SURVEILLANCE REQUIREMENTS\nEmergency Response\n\n29 CFR 1910.120(f)\n\n\nAll members of a HAZMAT response team (Hazardous Materials Technicians) as well as standby rescue personnel are required to receive a baseline physical examination and be provided with medical surveillance as required by paragraph (f) of the regulation.\n\nAdditionally, any emergency response employees who exhibit signs or symptoms that may have resulted from an exposure to hazardous substances during the course of an emergency incident either immediately or subsequently, will be provided with medical consultation immediately as required in paragraph (f)(3)(ii) of this regulation.\n\nMedical examinations and consultations will be made available prior to assignment to the response team before such duties are allowed to be executed (initial medical exam) and at least once every 12 months unless the attending physician believes a longer interval (not to exceed every two years) is appropriate.  Additionally, medical examination will be provided upon of termination of employment with Henry County Water &"
    },
    {
      "ESSeqNum": 20,
      "FacilityID": 39020,
      "SummaryText": " Sewerage Authority.  Medical examinations and consultations will be provided additionally if the examining physician determines that follow-up exams or consultations are medically necessary.\n\nThe content of the medical examinations and consultations will include a medical and work history with special emphasis on symptoms related to exposure to chlorine gas, as well as to fitness for duty including the ability to wear a Level B suit and SCBA under temperature extremes that may be expected at the work site.\n\nFurther, the content of the exams will reflect the guidelines in the OSHA Guidance Manual for Hazardous Waste Site Activities.  (Copy included in this Appendix.)\n\nAll medical examinations and procedures will be performed by or under the supervision of a licensed physician, preferably one knowledgeable in occupational medicine, and will be provided at no cost, without loss of pay, and at a reasonable time and place.\n\nHenry County Water & Sewerage Authority will provide the examining physician with the following information:\n\n?    A copy of the OSHA Hazardous Waste Operations and Emergency Response Regulation, 29 CFR 1910.120 and its Appendices.\n?    A description of the employee?s duties as they relate to the employee?s potential exposure during an emergency response.\n?    Information that the exposure level will be unknown.\n?    A description of any personal protective equipment used or to be used.\n?    Information from previous medical examinations of the employee that is not available readily to the examining physician.\n?    Information required by the OSHA Respiratory Protection Regulation, 29 CFR 1910.134.\n\nHenry County Water & Sewerage Authority will obtain and furnish the employee with a copy of a written opinion from the examining physician containing the following information:\n\n?    The physician?s opinion as to whether the employee has any detected medical conditions that would place the employee at increased risk of material impairment of the employee?s health from work in"
    },
    {
      "ESSeqNum": 21,
      "FacilityID": 39020,
      "SummaryText": " an emergency response, or from respirator use.\n?    The physician?s recommended limitations upon the employees assigned to work.\n?    The results of the medical examination and tests if requested by the employee.\n?    A statement that the employee has been informed by the physician of the results of the medical examination and any medical conditions that require further examination or treatment.\n\nThe written opinion will not reveal specific findings or diagnoses unrelated to occupational exposure.\n\nAn accurate record of the medical surveillance required by paragraph (f) of the regulation will be retained as required by 29 CFR 1910.1020, Employee Access to Medical and Exposure Records.  The record will include the following, at a minimum:\n\n?    The name and social security number of the employee.\n?    Physician?s written opinions, recommended limitations and results of examinations and tests.\n?    Any employee medical complaints related to exposure to hazardous substances.\n?    A copy of the information provided to the examining physician by the employer, with the exception of the standard and its appendices.\n \nAppendix 6\n\n\nDECONTAMINATION EQUIPMENT AND SEQUENCE\n\nCFR 1910.120(k)\n\n\nThe Incident Response Commander/Site Safety Officer is responsible for assuring that the decontamination sequence is established in the Contamination Reduction Corridor and that all workers in the Exclusion Zone (response work area) go through decontamination before entering the clean or Support Zone.  All personnel going through decontamination will continue to wear respiratory protection until full decontamination of suits, boots and gloves has been achieved.  This is to prevent an exposure hazard to the operator from off-gassing of any residual chlorine on the PPE.\n\nDecontamination will be performed using a mild detergent, such as dishwashing liquid detergent, and water.  All decontamination liquids will be collected for proper disposal.  Standby rescue personnel, properly equipped with PPE, can assist in d"
    },
    {
      "ESSeqNum": 22,
      "FacilityID": 39020,
      "SummaryText": "econtamination of workers.\n\nEmergency Decontamination:  In an emergency, the primary concern is to prevent the loss of life or severe injury to Site personnel.  If immediate medical treatment is required to save a life, decontamination should be delayed until the victim is stabilized.  If decontamination can be performed without interfering with essential life-saving techniques or first aid, decontamination should be performed.  If an emergency due to a heat-related illness develops, protective clothing should be removed from the victim as soon as possible to reduce heat stress.\n\nProvisions also have been made for protecting medical personnel and disposing of contaminated clothing and equipment.  Henry County EMTs have been trained to perform decontamination in the field.  They will know the hazard that they are dealing with before coming to the Site and will come adequately equipped.\n \nEQUIPMENT NEEDED TO PERFORM MINIMUM DECONTAMINATION MEASURES FOR LEVEL B\n\nStation 1:    Station 5:\na.    Various Size Containersb.    Plastic (6 mil) Linersc.    Plastic (6 mil) Drop Cloths     a.    Containers (20-30 gallon)b.    Plastic Linersc.    Bench or Stools\n    \nStation 2:    Station 6:\na.    Containers (20-30 gallon)b.    Decon Solution?Detergent and Waterc.    Rinse Waterd.    2-3 Long-Handled, Soft-Bristled Scrub Brushes    a.    Plastic Sheets (6 mil)b.    Basin or Bucketsc.    Soap and Towelsd.    Bench or Stools\n    \nStation 3:    Station 7:\na.    Containers (20-30 gallon)b.    Plastic Liners (6 mil)c.    Bench or Stools    a.    Waterb.    Soapc.    Tablesd.    Wash Basin or Bucket\nStation 4:    \na.    Air Tanks for SCBAsb.    Inner Gloves and Other PPEc.    Tape    \n\n\n \nMINIMUM MEASURES FOR LEVEL B DECONTAMINATION\n\nStation 1    Equipment Drop    1.    Deposit equipment used onsite (tools, sampling devices and containers, monitoring instruments, etc.)  on plastic drop cloth.  During hot weather, cool down stations may be set up within this area.\nStation 2    Outer Garment, Boots and Gloves Wash and Rinse    2.    Scrub outer boots, outer gloves, and fully-encapsulating suit with decon "
    },
    {
      "ESSeqNum": 23,
      "FacilityID": 39020,
      "SummaryText": "solution of detergent and water.  Rinse off with copious amounts of water.\nStation 3    Remove tape at wrists and ankles.  Remove outer boots and gloves.  Deposit in container with plastic liner.    3.    Remove outer boots and gloves.  Deposit in container with plastic liner.\nStation 4    Tank Change    4.    If worker leaves Exclusion Zone to change air tank, this is the last step in the decontamination procedure.  Worker?s air tank is exchanged, new outer gloves and boot covers are donned, joints taped, and worker returns to duty.\nStation 5    Boot, Gloves and Outer Garment Removal    5.    Boots, fully-encapsulating suit, inner gloves are removed and deposited in separate containers lined with plastic.\nStation 6    SCBA Removal    6.    SCBA backpack and facepiece is removed (avoid touching face with fingers).  SCBA is deposited on plastic sheets.\nStation 7    Field Wash    7.    Hands and face are washed thoroughly.  Shower as soon as possible.\n\n \nAppendix 7\n\n\nHEAT STRESS\n\nSymptoms and Treatment of Heat Stress\n\n    HeatSyncope    Heat Rash?PricklyHeat?    HeatCramps    HeatExhaustion    HeatStroke\nSigns/Symptoms    Sluggishness or fainting while standing erect or immobile in heat.    Profuse, tiny, raised, red blister-like vesicles on affected areas, along with prickling sensations during heat exposure.    Painful spasms of muscles used during work (arms, legs, or abdomen); onset during or after work hours.    Fatigue, nausea, headache, giddiness; skin clammy and moist; complexion pale, muddy or hectic flush; may faint on standing with rapid, thready pulse and low blood pressure; oral temperature normal or low.    Red, hot, dry skin; dizziness; confusion; rapid breathing and pulse; high oral temperature.\nTreatment    Remove to cooler area. Rest in recumbent position.  Increase fluid intake.  Recovery usually is prompt and complete.    Mild drying lotions, powders and skin cleanliness.  Dry skin and prevent infection.    Remove to cooler area.  Rest in recumbent position.  Administer fluids by mouth.    Remove to cooler area.  Rest in recumbent po"
    },
    {
      "ESSeqNum": 24,
      "FacilityID": 39020,
      "SummaryText": "sition with lowered head.  Administer fluids by mouth, if conscious.  Seek medical attention.    Cool rapidly by soaking in cool (not cold) water.  Call ambulance and get medical attention immediately!\n\n \nAppendix 8\n\n\nPOST INCIDENT INVESTIGATION\n\n\nThe Site Incident Response Commander, David Whitson, will perform post incident investigation and develop a report of findings.  The investigation is performed to determine the cause of the accident and may involve coordination with federal, state and local officials.\n\nInformation on the cause, amount released, resources impacted, injuries, response actions, etc. will be included in the certified report and a copy of the report will be maintained on file as well as added to the Appendix.\n\nThe post accident investigation and documentation is important in all cases, but especially so when the accident has resulted in personal injury, onsite property damage, or damage to the surrounding environment.  Documentation may be used to help avert recurrences, as evidence in future legal action, for assessment of liability by insurance companies, and for review by government agencies.  Methods of documentation can include a written transcript taken from tape recordings made during the emergency or a bound field book (not a loose-leaf book) with notes.  The document must be:\n\n?    Accurate:  All information must be recorded objectively.\n\n?    Authentic:  A chain-of-custody procedure should be used.  Each person making an entry must date and sign the document.  Keep the number of documentors to a minimum to avoid confusion and because they may have to give testimony in court.  Nothing should be erased.  If details change or revisions are needed, the person making the notation should mark a horizontal line through the old material and initial the change.\n\n?    Complete:  At a minimum, the following should be included:\n\nUpdate of the verbal information given previously.\nChronological history of the incident.\nFacts about the incident and when they be"
    },
    {
      "ESSeqNum": 25,
      "FacilityID": 39020,
      "SummaryText": "came available.\nTitle and names of personnel and composition of teams.\nActions, including decisions made and by whom.\nOrders, including those given to whom, by whom and when.\nActions taken, including who did what, when, where and how.\nTypes of samples and test results, as well as air monitoring (if done).\nAny known or anticipated acute or chronic health risks associated with the release.\nPossible exposures of Site personnel.\nHistory of all injuries or illnesses during or as a result of the emergency.\n\nThe report will document that the Site met its legal notification requirements with respect to a given incident by including a signed record of initial notifications.  Certified copies of written follow-up reports submitted after a response will be included in this Appendix.\n \nAppendix 9\n\n\nRESPONSE CRITIQUE AND PLAN REVIEW AND MODIFICATION\n\n\nIn addition to the follow-up investigation report, the Incident Response Commander will perform a written critique of the incident.  The critique will address whether the Emergency Response Plan served to provide the necessary protection for workers, the public and the environment.  The Incident Response Commander also will critique drills and mock incidents.  If deficiencies are noted from the critique, or inadequacies are documented during annual plan review/revision, the necessary corrective measures will be developed and incorporated into the written program to reflect these changes.\n\nA list of plan amendments will be included in this Appendix.  Plan review/revision and modification reflects this Site?s continuous improvement process.\n \nAppendix 10\n\n\nREFERENCES\n\n\n\n\n\n1.    United States Department of Transportation, 1996 North American Emergency Response Guidebook, RSPA P 5800.7, 1996.\n\n2.    National Institute for Occupational Safety and Health, Pocket Guide to Chemical Hazards, NIOSH Publication No. 94-116, June, 1994.\n\n3.    Code of Federal Regulations, Title 29 Part 1910, Subpart Z, Occupational Exposure to Airborne Contaminants, The"
    },
    {
      "ESSeqNum": 26,
      "FacilityID": 39020,
      "SummaryText": " Occupational Safety and Health Administration, Permissible Exposure Limit for Chlorine, June, 1997.\n\n4.    American Conference of Governmental Industrial Hygienists:  ?Chlorine,? Documentation of the Threshold Limit Values for Substances in Workroom Air, Cincinnati, 1996.\n\n5.    National Institute for Occupational Safety and Health, Occupational Health Guideline for Chlorine, September, 1978.\n\n6.    The Chlorine Institute, Inc., Personal Protective Equipment for Chlorine and Sodium Hydroxide, Pamphlet 65, Edition 3, November, 1995.\n \nAppendix 11\n\n\nBOMB THREAT PHONE CALL WORKSHEET\n\n\n\nWhat time was the call received?             What time did they hang up?         \n\nState as precisely as possible what the caller said:                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 \n\nAsk these questions:\n\n1.    When is the bomb going to explode?                                \n\n2.    Where is the bomb?                                        \n\n3.    What kind of bomb is it?                                    \n\n4.    What does it look like?                                        \n\n5.    Why did you place the bomb?                                    \n\nName(s) of person(s) receiving or monitoring the call:                                                                             \nPhone Number:                    \nHome Phone Number:                    Date:                    \n \nAppendix 12\n\n\nEMERGENCY RESPONSE PLAN REVIEW/REVISION FORM\n\n\n\nName of Reviewer:                                             \n\nAnnual Review:    Yes              No          \n\nEmergency Response Critique:    Yes              No          \n\nDrill/Exercise Critique:    Yes              No          \n\nChanges/revisions/modifications made to the Plan:                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      \n\n\n\n                                                    \nSignature of Reviewer                    Date of Review/Revision"
    }
  ]
}