{
  "FacilityID": 3903,
  "FacilityName": "Holyoke Water Pollution Control Facility",
  "FacilityStr1": "1 Berkshire Street",
  "FacilityStr2": null,
  "FacilityCity": "Holyoke",
  "FacilityState": "MA",
  "FacilityZipCode": "01040",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25013",
  "LEPC": "Hampden LEPC",
  "FacilityLatDecDegs": "42.190861",
  "FacilityLongDecDegs": "-72.612722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "AV",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "William Fuqua, Holyoke DPW",
  "OperatorStr1": "1 Berkshire Street",
  "OperatorStr2": null,
  "OperatorCity": "Holyoke",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "01040",
  "OperatorZipCodeExt": null,
  "RMPContact": "Douglas Reynolds",
  "RMPTitle": "Safety Officer",
  "FTE": 28,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000047497",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-03-23 00:00:00",
  "DeRegistrationEffectiveDate": "2007-04-01 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 42.19222,
  "FRS_Long": -72.61389,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4519,
      "AltID": "Chlorine storage",
      "FacilityID": 3903,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4621,
          "ProcessID": 4519,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4818,
          "ProcessID": 4519,
          "ChemicalID": 62,
          "Quantity": 17000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504818,
          "ProcessID": 4519,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3903,
      "SummaryText": "Facility Description and Regulated Substances Handled\n\nThe Holyoke Water Pollution Control Facility (WPCF) is a municipal wastewater treatment plant located in the City of Holyoke, Massachusetts.  The Holyoke WPCF occupies an approximately 11-acre facility located along the Connecticut River in the southeast portion of the city.\n\nThe Holyoke WPCF employs a gaseous chlorine system for wastewater disinfection and odor control. Because the quantity of chlorine stored on-site in a single process exceeds the threshold quantity of 2,500 pounds, the facility is subject to the Risk Management Program (RMP) provisions under Section 112 of the Clean Air Act Amendments (40 CFR Part 68), also known as the \"Chemical Accident Prevention Provisions.\"  Because chlorine is the only substance at the facility subject to Part 68, the Holyoke WPCF is subject to \"Program 2\" in the tiered RMP approach, since the facility is neither subject to OSHAs Process Safety Management standard (Massachusetts is a non-delegated OSHA state and has not adopted the federal OSHA Process Safety Management standard for state or local employees), nor is the facility in one of the nine SIC codes subject to \"Program 3.\"  \n\nChlorine gas is stored and fed from one-ton containers in the chlorine storage room inside the facilitys chlorine building.  Typically, 10 containers are present in the storage room.  Four containers can be connected to the chlorine feed system, while only 2 containers are \"on-line\" at any given time.  Three chlorinators and related control equipment are used to feed chlorine to a mixed sludge well for odor control and a chlorine contact basin for disinfection.  They include two 500 pound per day (ppd) chlorinators and a 1,000 ppd unit.  One of the 500 ppd units is dedicated to feed chlorine to the mixed sludge well.  The other two units can be used for feeding to the chlorine contact basin.  Vacuum regulators and an automatic switch-over valve are in line between the one-ton containers a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3903,
      "SummaryText": "nd the chlorinators.\n\nThe chlorine gas is dissolved in plant water to form a chlorine solution.  The chlorine solution is fed to the two 200,000 gallon chlorine contact chambers where the disinfection process takes place, as well as to the mixed sludge well where odor control occurs. The control system is capable of manual control and automatic compound loop control.  Chlorine disinfection occurs from April 1 through October 15, as required by the facilitys discharge permit.  Mixed sludge well chlorination occurs year-round.  \n\nThe one-ton chlorine containers are delivered to the Holyoke WPCF by truck.  The chlorine containers are unloaded outside the chlorine building using an electric hoist.  The hoist lifts the containers from the truck and enters the chlorine storage room through an overhead door. The \"covered process\" under this RMP includes chlorine storage, handling, and transfer activities prior to the introduction of chlorine into the chlorine contact basin or mixed sludge well.\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe Holyoke WPCF complies with accidental release prevention requirements for a Program 2 facility in accordance with 40 CFR 68. The facilitys chlorine storage, handling, and distribution system is designed and operated in accordance with state and local laws. Emergency response procedures for the Holyoke WPCF, including the chlorine storage and handling system, are described in the Holyoke WPCF Emergency Action Plan (July 1996), Emergency Response Plan (October 1998), Emergency Evacuation Procedure (revised November 1998), and Hazardous Material Emergency Response (revised November 1998) documents.  The Holyoke WPCF is a non-responding facility for incidents involving chlorine.  In general, outside responders and the local fire department are notified of all chlorine releases other than incidental releases that can be controlled at the time of the release (i.e., shutting a valve) by personnel in the immediate release"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3903,
      "SummaryText": " area.  \n\nWorst-case and Alternative Release Scenarios\n\nThe worst-case release scenario for the Holyoke WPCF chlorine facility consists of the release of the entire contents of two one-ton chlorine containers over a period of 10 minutes.  The release is assumed to occur inside the chlorine building as a result of a manifold failure.  The predicted distance to the toxic endpoint (0.0087 mg/l or 3 parts per million) extends 1.3 miles from the release.  Public receptors within this region include residences, schools, hospitals, industrial and commercial facilities, office buildings, municipal complexes, parks, playgrounds, and cemeteries.  Six alternative release scenarios were considered for the Holyoke WPCF chlorine facility.  The resulting distances to the toxic endpoint range from less than 0.1 mile up to 0.7 miles from the release. The potential impact region defined by the 0.7-mile alternative release scenario includes residences, schools, industrial and commercial facilities, municipal buildings, parks, and playgrounds.\n\nAccidental Release Prevention Program and Chemical-specific Prevention Steps\n\nThe Holyoke WPCF chlorine storage, handling, and transfer facilities addressed in this RMP comply with EPAs accident prevention rule as well as applicable state and local codes and regulations. The chlorine system is designed, installed, maintained, and operated in accordance with good engineering practice and industry-specific guidance developed by the Chlorine Institute, the Compressed Gas Association, and the Water Environment Federation.\n\nFive-year Accident History\n\nNo accidents involving chlorine that caused deaths, injuries, property or environmental damage, evacuations, or shelterings in-place have occurred at the Holyoke WPCF in the five-year period prior to the submittal date of this plan (June 1, 1994 to June 1, 1999).\n\nEmergency Response Program\n\nEmergency procedures described in the Holyoke WPCF Emergency Action Plan (July 1996), Emergency Response Plan (O"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3903,
      "SummaryText": "ctober 1998), Emergency Evacuation Procedure (revised November 1998), and Hazardous Material Emergency Response (revised November 1998) documents will be followed in the event of an emergency involving a chlorine release.  As a non-responding facility for incidents involving chlorine, the Holyoke WPCF will notify the local fire department and other outside emergency response agencies to respond to the emergency.  Copies of the above emergency response documents have been provided to the local fire department and Local Emergency Planning Committee (LEPC).  \n\nPlanned Changes to Improve Safety\n\n1. Provide additional personnel training in safe operating practices and emergency procedures associated with the facilitys chlorination system.\n \n2. Replace existing gaseous chlorine system with a sodium hypochlorite system.  The Holyoke WPCF completed a study in January 1999 in which alternatives to the existing gaseous chlorine disinfection system were identified and evaluated for cost, technical suitability, permit ability, site constraints, and safety.  A copy of the feasibility study is provided in Appendix A of the Risk Management Plan.  Based on the results of the evaluation, the Holyoke WPCF proposes (contingent upon budgetary constraints) to replace the existing gaseous chlorine system with a sodium hypochlorite system, which would result in a reduced safety risk for the plant and the surrounding public.\n \n3. In the interim period, prior to replacing the existing gaseous chlorine system with sodium hypochlorite, the Holyoke WPCF will evaluate chlorine release mitigation options for the chlorine building including a scrubber and/or structural enhancements to make the building air-tight or semi air-tight."
    }
  ]
}