{
  "FacilityID": 39102,
  "FacilityName": "Advanced Silicon Materials LLC",
  "FacilityStr1": "119140 Rick Jones Way",
  "FacilityStr2": null,
  "FacilityCity": "Silver Bow",
  "FacilityState": "MT",
  "FacilityZipCode": "59750",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "30093",
  "LEPC": "Butte-Silverbow County LEPC",
  "FacilityLatDecDegs": "45.972611",
  "FacilityLongDecDegs": "-112.689750",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G5",
  "LatLongDescription": "WR",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 615407483,
  "ParentCompanyName": "Komatsu America Corp.",
  "Company2Name": null,
  "CompanyDUNS": 618750772,
  "Company2DUNS": 0,
  "OperatorName": "Michael W. Kerschen",
  "OperatorStr1": "119140 Rick Jones Way",
  "OperatorStr2": null,
  "OperatorCity": "Silver Bow",
  "OperatorStateFIPS": "MT",
  "OperatorZipCode": "59750",
  "OperatorZipCodeExt": null,
  "FTE": 260,
  "OtherEPAFacilityID": "59701DVNCD11914",
  "EPAFacilityID": "100000117857",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-06-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": "Butte Facility",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 45.9758,
  "FRS_Long": -112.6647,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ZIP+4 CENTROID",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56233,
      "AltID": "Polysilicon Manufacturing",
      "FacilityID": 39102,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 74329,
          "ProcessID": 56233,
          "ChemicalID": 152,
          "Quantity": 330000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 74330,
          "ProcessID": 56233,
          "ChemicalID": 153,
          "Quantity": 310000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 74331,
          "ProcessID": 56233,
          "ChemicalID": 150,
          "Quantity": 130000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 57538,
          "ProcessID": 56233,
          "NAICSCode": "331419",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 57539,
          "ProcessID": 56233,
          "NAICSCode": "325188",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 39102,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-01-06 00:00:00",
    "ERTrainingDate": "2004-03-06 00:00:00",
    "CoordinatingAgencyName": "Butte Silver Bow Dept of Emer. Svc.",
    "CoordinatingAgencyPhone": "4067821515",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39102,
      "SummaryText": "Facility Information\n\nAdvanced Silicon Materials LLC's (ASiMI) Butte, Montana facility is a manufacturer of silane and polycrystalline silicon for the electronics industry.  The facility is relatively new, having operated for approximately 6 years at the time of this plan submittal.  ASiMI occupies an 250-acre plot, which is located aproximately 7 miles southwest of Butte, Montana on Rick Jones Way.  The facility is located in an industrial park and the surrounding property is uncultivated land.\n\nProcess Overview \n\nThe ASiMI facility in Butte, MT is comprised of three different production units: 1) Silane, 2) Poly Reaction, and 3) Product Finishing.  \n\nThe Silane Unit, through a series of chemical reactions and separation steps, converts metallurgical silicon and hydrogen to high purity silane gas.  Intermediates produced in the silane unit are trichlorosilane and dichlorosilane.  Some of the silane and dichlorosilane will packaged in cylinders or tube trailers and temporarily stored prior to sale.  The Poly Reaction Unit uses the majority of the silane and converts it into hydrogen and polycrystalline silicon.  The hydrogen is recycled back to the Silane Unit and the polycrystalline silicon is forwarded to the Product Finishing Unit for mechanical processing and packaging. \n\nThere is one covered \"process\" as defined by the RMP regulations at the Butte facility.  This process includes the Silane and Poly Reaction production areas which are interconnected and the silane module storage area which will be adjacent to the Silane production area.  Together these areas are identified as the Polysilicon Manufacturing Process.\n\nASiMI's risk management plan uses \"predictive filing\" to account for variables in the total quantities of chemicals at the facility, and for planned changes to the facility.  With predictive filing, the maximum quantity of chemicals that would be in the process at any one time is specified in this plan.\n\nRegulated Chemicals: \n\nASiMI has identified th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39102,
      "SummaryText": "e following chemicals and maximum on-site quantities, which trigger compliance with the Risk Management Program (RMP) standards, 40 CFR Part 68:\n\nSilane  330,000 pounds\nTrichlorosilane  310,000 pounds\nDichlorosilane  130,000 pounds\n\nAll RMP applicable chemicals at the facility are classified as flammables. \n\nProgram Level\n\nThe RMP regulations define three program levels based on processes' relative potential for public impacts and the level of effort needed to prevent accidents.  These levels range from Level 1 (lowest potential) to Level 3 (greatest potential).  ASiMI's process is elgible for a Program Level 1.\n\nWorst-Case Scenario\n\nA worst case scenario for each RMP listed chemical was analyzed according the to requirements in the risk management regulations. No public receptors are impacted.\n\nAccident History\n\nIn the past five years ASiMI has experienced no accidental releases causing specific offsite impacts as defined by the RMP standards.  \n\nAccidental Release Prevention Program\n\nASiMI's accidental release prevention program is based on the following essential elements: \nhazard reviews of equipment and processes, preventative and predictive maintenance programs, a management of change program, operator job certification and performance testing, accurate operating procedures, internal and external auditing and inspection programs, accident and near-miss investigations, etc.  Advanced process monitoring and control systems are in use at the facility, and critical parameters are monitored with duplicate instrumentation.  Loss of utilities is protected against through the use of installed and routinely tested back-up systems.  Engineering and design standards ensure materials and equipment meet industry specifications.  \n\nEmergency Response Program\n\nASiMI's emergency response program has been coordinated with the local Department of Emergency Services and LEPC.  The program includes information on locations, quantities, and associated hazards of materials at the f"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39102,
      "SummaryText": "acility, as well as fixed and portable methods for containment and/or suppression of spills and releases, internal and external notification and communications procedures, alarm systems and evacuation plans.  The facility itself is designed with numerous mitigating features, including containment and diking, deluge systems for fire and vapor suppression, strategically-placed fire hydrants and fire monitors, and emergency scrubber systems.  Automatic and manual shutdown systems as well as automatic isolation valves are in place.  Back-up firewater pumps are installed.  Emergency equipment is routinely maintained and tested.  In addition, ASiMI maintains a highly skilled emergency response team on-site 24-hours a day.  The team performs realistic monthly drills and exercises, covering a variety of response scenarios such as spill containment and cleanup, vapor suppression, fire fighting, and response to injuries.  The team routinely attends professional fire-fighting training to stay current with fire-fighting techniques.\n\nPlanned Changes to Improve Safety\n\nASiMI continues to seek and identify opportunities to improve safety through process hazard analyses, safety reviews and inspections, internal and external audits, incident and near-miss investigations, employee and safety committee suggestions, etc.   As a result of these activities, safety improvement opportunities are often identified leading to RMP program revisions and facility changes to improve safety."
    }
  ]
}