{
  "FacilityID": 39146,
  "FacilityName": "DSM Desotech, Inc",
  "FacilityStr1": "1122 St. Charles Street",
  "FacilityStr2": null,
  "FacilityCity": "Elgin",
  "FacilityState": "IL",
  "FacilityZipCode": "60120",
  "Facility4DigitZipExt": "8443",
  "FacilityCountyFIPS": "17089",
  "LEPC": "Kane County LEPC",
  "FacilityLatDecDegs": "42.011111",
  "FacilityLongDecDegs": "-088.269444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.dsm.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 622405298,
  "ParentCompanyName": "DSM Finance USA, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "DSM Desotech, Inc",
  "OperatorStr1": "1122 St. Charles Street",
  "OperatorStr2": null,
  "OperatorCity": "Elgin",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60120",
  "OperatorZipCodeExt": "8443",
  "FTE": 80,
  "OtherEPAFacilityID": "60120DSTNC1122",
  "EPAFacilityID": "100000064075",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "96030073",
  "SafetyInspectionDate": "2003-06-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2010-04-16 00:00:00",
  "DeRegistrationEffectiveDate": "2006-01-01 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 42.01228,
  "FRS_Long": -88.27097,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R01",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56291,
      "AltID": "Unloading/delivery",
      "FacilityID": 39146,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 74395,
          "ProcessID": 56291,
          "ChemicalID": 77,
          "Quantity": 10200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 57598,
          "ProcessID": 56291,
          "NAICSCode": "32551",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 56292,
      "AltID": "Storage",
      "FacilityID": 39146,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 74396,
          "ProcessID": 56292,
          "ChemicalID": 77,
          "Quantity": 20400.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 57599,
          "ProcessID": 56292,
          "NAICSCode": "32551",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 39146,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2001-03-01 00:00:00",
    "ERTrainingDate": "2004-02-01 00:00:00",
    "CoordinatingAgencyName": "Elgin Fire Department",
    "CoordinatingAgencyPhone": "8479316175",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "RCRA 40 CFR 262 for large quantity generators"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 39146,
      "SummaryText": "tment regularly inspects the Elgin facility. The fire department¿s most recent safety inspection occurred in June 2003. \n\nDSM has established procedures for emergencies at the Elgin facility. These procedures assign responsibility for implementing the emergency response plan, ensuring safety of workers, notifying the proper authorities, and coordinating any necessary cleanup and/or decontamination activities.  DSM has retained an outside hazardous materials contractor who can respond to on-site incidents if needed.\n\nProgram 1 Eligibility\nThe five-year review of DSM¿s RMP for the Elgin facility updated the original RMP¿s worst-case release scenario, accident history, and emergency response activities. Based on that review, DSM believes that the processes that use threshold quantities of TDI meet the requirements for Program 1 eligibility. \n\nCommitment to Safety, Health, and Environment\nDSM aims to maintain business activities that do not adversely affect safety, health, or environment, and it is therefore DSM's objective to evaluate its practices and processes to ensure that they are safe to employees, the public, and the environment.  DSM's corporate policy on Safety, Health, and Environment is consistent with the Responsible Care Programme of the European Chemical Industry Council and with the International Chamber of Commerce Business Charter of Sustainable Development.\n\nDSM complies with a variety of safety and environmental regulations, including the Emergency Planning and Community Right to Know Act (EPRCA) Sections 301-303 (Emergency Planning), Sections 311/312 (Hazardous Chemical Inventory Reporting), and Section 313 (Toxic Release Inventory Reporting); Occupational Safety and Health Administration (OSHA) Section 1910.38 for worker safety; and Resource Conservation and Recovery Act (RCRA) Section 40 CFR 262 for large quantity hazardous waste generators.  In addition, DSM operates emission sources under a federally enforceable state operating permit (FESOP)."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 39146,
      "SummaryText": "Facility Description and Operations\nDSM Desotech, Inc. (DSM) operates a manufacturing facility at 1122 St. Charles Street in Elgin, Illinois. The facility manufactures coatings and resins used in the fiber optic cable industry and in other applications. Ultraviolet light and electron beams are used to cure the coatings and resins. The facility comprises offices, a research and development laboratory, manufacturing activities, and a warehouse for raw materials and finished product.\n\nMaterials\nDSM's Elgin facility uses a variety of organic chmeicals and other substances in the production of UV/EB coatings and resins, including acrylates, polyols, isocyanates, monomers, photoinitiators, inhibitors, and diluents. An acetone solvent cleaning system is used to clean the equipment used in production.  One of the organic chemicals DSM uses as a raw material, toluene diiisocyanate (TDI), is listed as a regulated toxic substance under section 112(r) of the Clean Air Act Amendments of 1990 and is subject to the ¿Chemical Accident Prevention Provisions¿ of 40 CFR 68.  \n\nIn 1999, DSM determined that the Elgin facility is subject to the provisions of 40 CFR 68 requiring development and implementation of a risk management program. DSM also determined that it had threshold quantities (10,000 pounds or more) of a regulated substance (TDI) involved in two processes. Further, based on the facility¿s accident history, offsite consequence analysis, and emergency response procedures, it was determined that the two covered processes were eligible for the Program 1 level requirements. As required of all facilities that are subject to 40 CFR 68, DSM submitted a Risk Management Plan (RMP) prior to the June 21, 1999 deadline. \n\nAn RMP must be updated at least once every five years. Since DSM submitted its initial RMP before the original June 21, 1999-deadline, it is required to submit the 5-year update by June 21, 2004.\n\nRegistration Information \nThe registration information submitted with th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39146,
      "SummaryText": "e original RMP must be reviewed and corrected as necessary.  This includes a review of the applicability of the risk management program rule.\n\nDSM reviewed all registration information, including facility location, mailing address, emergency contact information, latitude and longitude, and the North American Industry Classification System (NAICS) code for paint and coatings manufacturing.  After reviewing the relevant information, DSM verified that all items related to facility identification and location are accurate and that no corrections are necessary.\n\nFor the original RMP, DSM conducted an analysis of on-site processes that use TDI to determine the total quantity of TDI used in each process at any one time.  Two covered processes, unloading/delivery and storage, were identified.\n\nProcess 1 ¿ Unloading/Delivery: TDI is delivered to the facility in 200-gallon totes, approximately five totes per delivery. The totes are delivered directly to an indoor dock where they are unloaded. At no time are the totes interconnected through piping or hoses and no other vessels are connected with the totes. However, the totes are co-located such that a single release could occur (for example, if exposed to a fire, explosion, or collision). The five 200-gallon totes combined contain 10,200 pounds of TDI (10,200 pounds = 5 totes × 200 gallons/tote × 10.2 pounds/gallon). The unloading/delivery process involves a threshold quantity and is therefore subject to the risk management program rule. \n\nProcess 2 ¿ Storage: TDI is stored indoors in the same 200-gallon totes that are delivered to the facility. The totes are protected in steel chambers and stored along the north wall of the warehouse addition, separate from the reactors where the TDI is used. As much as 20,400 pounds (10 totes) of TDI  may be stored. At no time are the totes interconnected through piping or hoses and no other vessels are connected with the totes. However, the totes are co-located such that a single release co"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39146,
      "SummaryText": "uld occur (for example, if exposed to a fire, explosion, or collision). The ten 200-gallon totes combined contain 20,400 pounds of TDI (20,400 pounds = 10 totes × 200 gallons/tote × 10.2 pounds/gallon). The storage process involves a threshold quantity and is therefore subject to risk management program rule.\n\nThe information relating to rule applicability remains current. DSM has determined that no revisions are needed.\n\nReview of Accident History\nThe 5-year update of the RMP must include a review of the facility¿s accident history over the past five years from a covered process. Continued eligibility for Program 1 requires that no release of TDI from the unloading/delivery or storage processes can have resulted in one or more offsite deaths, injuries, or response or restoration activities at an environmental receptor during the five years following submission of the initial RMP. DSM reviewed the Elgin facility¿s accident history for the past five years. No accidents involving a release of TDI from the subject processes have occurred during the previous five years.\n\nEmergency Response Activities\nDSM employees are trained to handle the materials with which they work. Although facilities with Program 1 processes are not required to complete an emergency response plan, DSM has developed both an emergency response plan and a spill prevention, control, and countermeasure plan (SPCC) that will be followed in the event of a spill or release of TDI. DSM updated the emergency response plan in March 2001 (see Appendix D for a copy to the facility¿s emergency response plan). Emergency response training for facility employees was most recently held in February 2004.\n\nUnder Program 1, DSM is required to coordinate emergency response activities between the local emergency planning and response agencies. The Elgin Fire Department and the Kane County Local Emergency Planning Committee (LEPC) both receive copies of MSDS to meet the requirements of SARA 311-312. The Elgin Fire Depar"
    }
  ]
}