{
  "FacilityID": 39182,
  "FacilityName": "AES Placerita, Inc.",
  "FacilityStr1": "20885 Placerita Canyon Road",
  "FacilityStr2": null,
  "FacilityCity": "Newhall",
  "FacilityState": "CA",
  "FacilityZipCode": "91321",
  "Facility4DigitZipExt": "1934",
  "FacilityCountyFIPS": "06037",
  "LEPC": null,
  "FacilityLatDecDegs": "34.381667",
  "FacilityLongDecDegs": "-118.500556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "AES",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "AES Placerita",
  "OperatorStr1": "20885 Placerita Canyon Road",
  "OperatorStr2": null,
  "OperatorCity": "Newhall",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91321",
  "OperatorZipCodeExt": "1934",
  "RMPContact": "Mike Menke",
  "RMPTitle": "Plant Leader",
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000140304",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "042676",
  "SafetyInspectionDate": "2003-03-26 00:00:00",
  "SafetyInspectionBy": "Atkins Environmental H.E.L.P.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-07-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-06-22 00:00:00",
  "DeRegistrationEffectiveDate": "2008-05-01 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 34.37948,
  "FRS_Long": -118.49899,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "203",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "All chemicals subject to RMP were removed from the site",
  "_processes": [
    {
      "ProcessID": 56337,
      "AltID": "Ammonia Storage",
      "FacilityID": 39182,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 57646,
          "ProcessID": 56337,
          "NAICSCode": "22112",
          "_desc": {
            "NAICS_CODE": "22112",
            "NAICS_DESCRIPTION": "Electric Power Transmission, Control, and Distribution"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 74441,
          "ProcessID": 56337,
          "ChemicalID": 56,
          "Quantity": 44000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 574441,
          "ProcessID": 56337,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39182,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies\n\nEvery reasonable step is taken to prevent a release at AES Placerita.  Corporate, regional and local management are all seriously committed to workplace safety, including chemical safety.  In fact, this facility has surpassed a record for continuous operation without a lost time accident (i.e., more than 1,000 workdays).\n\n\nFacility Description and Regulated Substances Handled\n\nThe AES facility was constructed between 1985 and 1988 and began commercial electrical power production in 1988.  This facility is located at 20885 Placerita Canyon Road in Newhall, California, west of California State Highway 14.  The AES facility is a power generation plant situated on approximately 2.7 acres.  The facility is fenced with security provided by a controlled access gate with 24 hour video surveillance placed strategically throughout the plant.  Ammonia is used at the AES facility to maintain air quality compliance of the emission stack NOX emissions.  The ammonia reacts with the combustion products in a catalyst bed to control pollution.  Stored as anhydrous ammonia at ambient temperatures in a 10,000-gallon pressurized carbon steel tank, this compound is used in the following equipment:\n\n?One (1) 15-gallon vaporizer;\n?Two (2) emissions control modules; and \n?The SE/SI catalytic converters (Emissions Control System).  \n\nThe ammonia flows to an emissions control module, is mixed with dilution air, and sent to the Steam Energy (SE) and Steam Injection (SI) Converters located in the boiler exhaust stream(s).  \n\nA concrete dike, enclosures, berms, drains, and sumps limit the exposed surface area of a pool and reduce the release rate.\nSummary of Release Scenarios\n\nRelease Scenarios:\n\nWorst Case Scenario\n?Liquefied under pressure\n?Quantity: 44,000 lbs.\n?Rate: 2,420 lbs/min\n?Topography: Urban\n?Enclosed\n?Wind Speed (MPH) 3.4\n?Atmospheric Stability Class F\n?Toxic Endpoint Distance: 1.9 miles\n\nAlternative Release\n?Liquefied u"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39182,
      "SummaryText": "nder pressure\n?Quantity: 100 lbs.\n?Rate: 100 lbs/min\n?Topography: Urban\n?Enclosed\n?Wind Speed (MPH) 6.7\n?Atmospheric Stability Class D\n?Toxic Endpoint Distance: 0.1 miles\n\n\nFederal or State Emergency Plan Requirements\n\nRules and regulations which apply to the facility include but are not limited to the following:\n\n?Risk Management Prevention Program (RMPP)\n[Health & Safety Code Section 25531]\n\n?Process Safety Management (PSM)\n[29 CFR ? 1910.119]\n\n?Spill Prevention Control and Countermeasure (SPCC) \n[40 CFR ? 112]\n\n?Hazardous Material Release Response Plan & Inventory\n[19 CCR ? 60204]\n\n\nFive Year Accident History\n\nSince start-up in 1988 to date, there have not been any incidents or accidents involving the release of ammonia.  There have been several small leaks of ammonia due to poor valve and connection seals.  There were no injuries or off-site consequences from these incidents.\n\nEmergency Response Program\n\nAES has developed and implemented an Emergency Response Program (ERP) for the purpose of protecting the public health and the environment.  The Lead Technician on duty is continuously monitoring the power block control room and would, therefore, be the first person informed of a release or threatened release of ammonia.  The Lead Technician will be responsible for calling 911 and informing public and local emergency response agencies about an accidental release.  The Lead Technician would then immediately inform the Plant Manager or Assistant Plant Manager, who would be responsible for interfacing with those agencies about planning and emergency response.\n\nFirst aid in response to an ammonia exposure would more than likely be handled by the local hospital, Henry Mayo Newhall Memorial, and the Los Angeles County Fire Department HazMat squad from Station 176 in Castaic.  The Plant Manager or Assistant Plant Manager is responsible for notifying the Los Angeles County Fire Department (LACFD) and the California Office of Emergency Services (OES).  \n\nA public address "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39182,
      "SummaryText": "system would be used to sound an evacuation alarm signaling all employees not responsible for emergency response to leave the facility and gather at the primary assembly area (i.e., at the maintenance shop work area).  If required, a more appropriate secondary assembly area (i.e., alternate muster area is just inside the controlled access main gate) would be indicated to employees as they arrive at the primary assembly area or announced over the public address system.  \n\nOutside contractors and visitors are the responsibility of the employee who scheduled their plant visit, or if this scheduling employee is unavailable, the operator in charge of the control room at the time the evacuation begins.  The public address/alarm system is tested regularly.\n\nAfter the notification of authorities and Plant Management and, if necessary, evacuation of appropriate facility personnel, an ammonia release would be handled, (contained and cleaned up) by the County HazMat Squad or an appropriately equipped and trained HazMat response contractor under the direction of AES Placerita and the administering agency.\n\nThere exists an automatic deluge system and secondary containment in the event of an ammonia release.  Recovery from a release would be left to trained professionals, either from the LACFD, Administering Agency (i.e., HazMat Squad) or an appropriately trained contractor.  As part of daily inspections, the deluge system and ammonia sensors are maintained.  Formal inspection, testing and maintenance occurs on an annual basis.  Training for all employees according to the incident command system occurs as a function of emergency response training for both oil spills (according the Spill Prevention Control & Countermeasure Plan), and ammonia spills (according to the Process Safety Management ? Technical Document), on an annual basis.\n\nFollowing annual training, the Safety Committee at AES Placerita convenes to review and update, as appropriate, this Emergency Response Plan and tho"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39182,
      "SummaryText": "se for petroleum hydrocarbons, SPCC, and Process Safety (PSM).  Steps are taken to ensure AES Placerita employees are informed of any significant changes.\n\nPlanned Changes to Improve Safety\n\nAES management and staff meet regularly to discuss safety.  In addition, daily inspections of several of the critical components associated with ammonia management, as highlighted in the Process Safety Management (PSM) technical document, are performed.  These inspections are documented in a daily log maintained in the control room.  \n\nAny planned changes are communicated extensively throughout the organization and coordinated with every reasonable effort being directed at preventing releases of ammonia, per the process safety management program."
    }
  ]
}