{
  "FacilityID": 39303,
  "FacilityName": "Bismarck Wastewater Treatment Plant",
  "FacilityStr1": "601 London Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Bismarck",
  "FacilityState": "ND",
  "FacilityZipCode": "58504",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38015",
  "LEPC": "Bismarck/Burleigh County LEPC",
  "FacilityLatDecDegs": "46.773889",
  "FacilityLongDecDegs": "-100.805833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": "www.bismarck.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 619077753,
  "ParentCompanyName": "City of Bismarck",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Bismarck",
  "OperatorStr1": "601 S. 26th Street",
  "OperatorStr2": "P.O. Box 5503",
  "OperatorCity": "Bismarck",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58506",
  "OperatorZipCodeExt": "5503",
  "FTE": 12,
  "OtherEPAFacilityID": "NDD080245640",
  "EPAFacilityID": "100000154539",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-15 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Chlorination System",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-07-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2022-04-19 00:00:00",
  "DeRegistrationEffectiveDate": "2022-01-01 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 46.773883,
  "FRS_Long": -100.806239,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56500,
      "AltID": "Chlorination System",
      "FacilityID": 39303,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 74623,
          "ProcessID": 56500,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 57812,
          "ProcessID": 56500,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 21536,
              "Process_NAICS_ID": 57812,
              "SafetyReviewDate": "2004-05-13 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "Ten States Standards, Chlorine institute, NSF 60 & 61, IEEE, ASQC, NEC, NEMA, NFC, SFC, UFC, WEF",
              "FR_Comments": null,
              "HazardReviewDate": "2004-06-04 00:00:00",
              "ChangeCompletionDate": "2004-06-04 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-05-13 00:00:00",
              "TrainingReviewDate": "2004-05-13 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "one-on-one",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-01-01 00:00:00",
              "EquipmentInspectionDate": "2004-04-19 00:00:00",
              "EquipmentTested": "gas detector",
              "ComplianceAuditDate": "2002-08-27 00:00:00",
              "AuditCompletionDate": "2002-08-27 00:00:00",
              "IncidentInvestigationDate": "2003-10-20 00:00:00",
              "InvestigationChangeDate": "2003-10-20 00:00:00",
              "MostRecentChangeDate": "2003-10-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 22504,
                  "PreventionProgram2ID": 21536,
                  "ProcessChemicalID": 74623
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 39303,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-07-31 00:00:00",
    "ERTrainingDate": "2003-10-20 00:00:00",
    "CoordinatingAgencyName": "Bismarck Fire Department",
    "CoordinatingAgencyPhone": "7012582070",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 39303,
      "SummaryText": "ly, release scenario for the WWTP RMP.  This scenario involves a release occurring inside the chlorine room.  The Bismarck WWTP utilizes a vacuum-operated chlorination system.  The vacuum system is, for all practical purposes, virtually fail-safe.  The gas feeder, which controls the chlorine flow rate, is installed directly onto the valve stem of the chlorine container.  In order for chlorine to flow through the valve on the gas feeder, a vacuum must be present on the feed side of the gas feeder.  Vacuum is created by water passing through an ejector, which is connected to the gas feeder with flexible tubing.  When a vacuum is present and the valve is open, gaseous chlorine may be drawn from the container, through the valve, through the gas feeder, and into the ejector where it combines with water.  In the absence of a vacuum, the gas feeder valve closes and chlorine cannot escape through the valve on the container.  In the event of equipment failure on the vacuum side of the gas feeder, the feeder valve is designed to immediately close (due to the absence of a vacuum to keep it open).\n\nBecause the gas feeder is attached directly to the chlorine container, the potential route for the escape of chlorine gas from the container is between the valve stem on the container and the gas feeder valve.  The alternate scenario modeled for this facility involves a leak from the lead gasket between the gas feeder valve and the chlorine container.  Each time a new container is connected, a new gasket is installed.  Although the gasket is checked for leaks immediately after installation, the alternate scenario assumes a small leak is not detected on a container that is connected at the end of the day.  The leak continues throughout the night and the entire contents of the vessel is released over a period of 137 minutes (2.3 hours).  However, because the container is inside the building with the door closed, the room acts as a passive mitigation measure and contains the release.  T"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 39303,
      "SummaryText": "Introduction\n\nThe Bismarck Wastewater Treatment Plant (WWTP) has submitted a Risk Management Plan (RMP) to the United States Environmental Protection Agency (USEPA) to comply with the requirements of 40 CFR Part 68, the Chemical Accident Prevention Rule, herein referred to as the \"Rule\".  As such, the City staff have completed a comprehensive review of the risks associated with the regulated process, chlorine disinfection, at the WWTP.  Additionally, an offsite consequence analysis has been completed and a prevention program has been developed and implemented to promote safe operation of the regulated process.  Emergency response procedures have been updated and communications with the Local Emergency Planning Committee (LEPC) and Fire Department have been initiated to develop a cooperative response to potential releases at the facility.  The prevention program focuses on training plant employees in safe operating and maintenance procedures and to recognize the potential hazards of the regulated chemical and process.\n\nBackground\n\nThe Bismarck WWTP is located in the southwest portion of the incorporated city limits at 601 London Avenue.  The City has owned and operated wastewater treatment works at the site since 1966.  Major facility and process upgrades were constructed in 1976 and 1987.  The existing conventional secondary treatment plant is designed to treat an average day flow of 7.5 million gallons per day (MGD) and incorporates pre-treatment, flow equalization, primary clarification, fixed media biological (trickling) filters, secondary or final clarification, chlorine disinfection and de-chlorination.  Treated effluent is continuously discharged to the Missouri River.  Residuals generated from the treatment processes are managed through anaerobic digestion and land application of bio-solids.  The Bismarck WWTP operates the facility from 6:00 am to 6:00 pm, Monday through Friday and 6:00 am to 2:00 pm on Saturday and Sunday.  The facility operates unmanned at"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39303,
      "SummaryText": "night.\n\nDisinfection is practiced during the months of April through October (during the recreational season).  However, chlorine oxidation may be practiced intermittently throughout the year for odor control.  Gaseous chlorine contained in one-ton chlorine containers is introduced into the water using a vacuum feed system.  The facility stores a maximum of five one-ton chlorine cylinders onsite, for a combined total of 10,000 pounds of chlorine.  According to the Rule, any facility storing greater than 2,500 pounds of chlorine onsite is required to develop and implement a RMP.  Therefore, the Bismarck WWTP chlorine disinfection system is a Risk Management-regulated process.\n\nChlorine containers are stored in the chlorine room, which is located on the northwest side of the control/filter building.  The room is equipped with a ventilation system and the door to the room is kept locked at all times.  The chlorine room and its components are visually inspected at least three times per day and the chlorine detector alarm is connected to the City central dispatch.\n\nChlorine is a toxic gas stored as a liquid under pressure.  Its boiling point is -29.4°F.  Chlorine is irritating and corrosive to the eyes, skin, and respiratory tract and reacts violently with easily oxidized materials.  Contact with evaporating chlorine or equipment releasing flashing chlorine can cause frostbite burns.  Chlorine gas is heavier than air and will travel along the ground and fill low spaces and pits by displacing air.  One-ton chlorine containers are welded steel tanks with removable steel protective caps over the container valves.  They are built to meet Federal specifications, and are regularly inspected and pressure tested in accordance with Federal regulations.\n\nOffsite Consequence Analysis\n\nThe City staff have examined the WWTP chlorination system and the potential hazards it presents onsite and offsite.  The results of this analysis are presented in the Offsite Consequence Analysis (Haz"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39303,
      "SummaryText": "ard Assessment section of the RMP), which is composed of a Worst Case and Alternate (more likely) Analysis.\n\nWorst Case Analysis\n\nAlthough the USEPA acknowledges that the Worst Case Scenario is not a likely scenario, the Bismarck WWTP staff have formulated a scenario to alert the public to the worst possible release.  The worst case scenario for the facility involves the release of 2,000 pounds of gaseous chlorine (the entire contents of one container) directly into the atmosphere over a 10-minute period.  Due to the location of the facility in an urban setting (with many trees or buildings nearby to dissipate the release), the analysis estimated that a release of this magnitude would have a radius of influence of 1.3 miles.  The radius of influence represents the distance a chlorine plume would travel from the facility, under assumed meteorological conditions, before the concentration is reduced below the Emergency Response Planning Guideline 2 (ERPG-2) level, or the \"toxic endpoint\".  The USEPA's RMP Offsite Consequence Analysis Guidance states the ERPG-2 concentration \"is that below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms that could impair an individual's ability to take protective action\".\n\nBased on data from the 1990 Census, a population of approximately 6,300 resides within the radius of influence under the worst case scenario.  Also within this radius are schools, churches, and public recreation areas.  The USEPA requires that the radius of influence be calculated considering a wind speed of 1.5 meters per second, or 3.4 miles per hour.  Historically, average wind speed in the vicinity of Bismarck is 10.2 miles per hour; thus, a release would likely disperse at a faster rate than estimated under the RMP assumed conditions.\n\n\n\nAlternate Case Analysis\n\nThe City Public Works staff have also formulated an alternate, or more like"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 39303,
      "SummaryText": "he radius of influence for this release is 0.1-mile.\n\nDue to the area comprising the Bismarck WWTP site, this release does not travel offsite, and no public receptors are affected.  Despite the fact that this potential release would not impact public receptors, the Bismarck WWTP will integrate Risk Management Program training with its existing training program in an effort to increase employee awareness of the consequences of even a small release.  These efforts are expected to further reduce the likelihood of such a scenario occurring.\n\nEmergency Response\n\nAlthough the potential for a chlorine release exists, the City has determined that the chlorination system is safe by all industry standards and that the potential for a release at this facility is very small.  The Public Works staff are working with the LEPC and the Fire Department to prepare emergency responders in the event of a major release at the facility.  The WWTP staff do not respond to releases other than those that can be stopped by closing a valve and will not enter the room to stop a chlorine release if the chlorine concentration is estimated to be above safe levels.  The WWTP relies on the Bismarck Fire Department and the Hazardous Materials Response Team (HAZMAT), which works closely with the LEPC to plan response procedures for a major chlorine release at the WWTP.  The results of the Offsite Consequence Analysis have been communicated to both the LEPC and the Fire Department.\n\nAccident History\n\nThe Bismarck WWTP has had no chlorine-related incidents that resulted in injury onsite or offsite in the last 5 years.The Bismarck WWTP is committed to continual employee training in an effort to increase awareness of the potential hazards associated with the chlorine system and to further reduce the likelihood of future accidents that could result in injury or equipment and property damage.\n\nPrevention Program\n\nThe day-to-day result of the Rule is the mandatory implementation of a prevention program.  The"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 39303,
      "SummaryText": "intent of the prevention program is to document procedures within the facility that promote safe operation of the regulated process and reduce the potential for an uncontrolled release of the regulated substance (chlorine gas).  Components of the prevention program include the assembly of safety information, the performance of periodic hazard reviews, the establishment of safe operating and maintenance procedures, updating training policies, conducting routine compliance audits, the development of an incident investigation procedure, and the formalization of a management system.\n\nSafety information, such as Material Safety Data Sheets and equipment specifications, have been compiled and attached to the RMP for easy access by employees.  This information specifies the safe operating limits for regulated process equipment, and lists codes and standards that apply to the equipment.  Instruction manuals for regulated process equipment are also attached to this section.\n\nA hazard review has been conducted by City personnel to identify any potential hazards associated with the regulated process at the WWTP.  A hazard review will be performed every 5 years, or prior to implementation of a new or changed process.\n\nOperating procedures relating to normal and emergency operations of the regulated process have been updated and compiled in the RMP.  Maintenance procedures have been compiled in a similar fashion.  These procedures will be reviewed periodically and updated as necessary.\n\nThe Bismarck WWTP has historically documented employee training.  An integrated training policy has been developed and training records have been reviewed and updated to reflect the current status of all facility employees.  New employee and refresher training will be provided periodically and documented to consistently maintain safe operating and maintenance procedures.  Refresher training will be conducted every 3 years, at a minimum.\n\nA compliance review policy has been developed and complian"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 39303,
      "SummaryText": "ce audits, designed to review the facility's compliance with the Rule, will be conducted every 3 years.  The audits will examine the components of the Risk Management Program and the implementation of each component.\n\nAn incident investigation procedure has been developed to facilitate the institution of corrective actions resulting from an incident and to provide a mechanism to help prevent future incidents from occurring.  This procedure establishes a timeline for the completion of incident investigations and documents any procedure changes resulting from the investigation.\n\nLastly, a management system that assigns direct individual responsibility for each component of the Risk Management Program has been established.  This system will also be reviewed periodically and updated to reflect changes in responsibilities at the facility.\n\nConclusion\n\nIn summary, the City of Bismarck is confident that although the potential for a chlorine release at the WWTP that could affect the public or the environment exists, the potential is slight.  The City has examined the risks associated with the chlorine system at the WWTP and has committed to the development and implementation of standard operating and maintenance procedures and comprehensive employee training to prevent chlorine releases.  Further, the City has prepared for such releases through modeling scenarios, developing response procedures, and coordinating with offsite responders.  Lastly, the City staff have identified additional safety measures, developed a schedule for implementation, and established a chain of responsibility to ensure program compliance.\n\nThe Bismarck WWTP intends to use its Risk Management Program as a means to operate more safely and efficiently and to communicate more effectively with offsite responders upon which it relies and the public it serves."
    }
  ]
}