{
  "FacilityID": 39404,
  "FacilityName": "DeBruce  Ag Services,Inc.",
  "FacilityStr1": "Int hwy 70+145 east of Farwell",
  "FacilityStr2": null,
  "FacilityCity": "Farwell",
  "FacilityState": "TX",
  "FacilityZipCode": "79325",
  "Facility4DigitZipExt": "0648",
  "FacilityCountyFIPS": "48369",
  "LEPC": "Parmer County LEPC",
  "FacilityLatDecDegs": "34.378444",
  "FacilityLongDecDegs": "-010.300056",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "G4",
  "LatLongDescription": "PP",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "The DeBruce Companies",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "The Debruce Companies",
  "OperatorStr1": "4100 N. Mulberry Dr.",
  "OperatorStr2": null,
  "OperatorCity": "Kansas City",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "64116",
  "OperatorZipCodeExt": null,
  "RMPContact": "Lloyd Autrey",
  "RMPTitle": "Saftey Director",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000099724",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-11-03 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-07-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-07-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-03-14 00:00:00",
  "DeRegistrationEffectiveDate": "2014-03-13 00:00:00",
  "AnniversaryDate": "2009-07-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 34.3968,
  "FRS_Long": -102.9097,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS BLOCK/TRACT-1990-CENTROID",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56627,
      "AltID": "42291",
      "FacilityID": 39404,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 57943,
          "ProcessID": 56627,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 74788,
          "ProcessID": 56627,
          "ChemicalID": 56,
          "Quantity": 160000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 574788,
          "ProcessID": 56627,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39404,
      "SummaryText": "EXECUTIVE SUMMARY-ANHYDROUS AMMONIA\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES:\n\nTHIS FACILITY COMPLIES WITH THE ANSI K 61.1 \"SAFETY REQUIREMENTS FOR THE STORAGE AND HANDELING OF ANHYDROUS AMMONIA\". IN ADDITION, IT IS OUR POLICY TO ADHERE TO ALL APPLICABLE FEDERAL, STATE, AND LOCAL LAWS.\n\nDEBRUCE AG SERVICE(DBAS) MISSION STATES \"TO PROVIDE FOR THE SAFETY OF OUR EMPLOYEES, OUR CUSTOMERS AND THE GENERAL PUBLIC\". IN ORDER TO FULFILL THIS MISSION, DBAS PROVIDES A CORPORATE ENVIRONMENTAL HEALTH, AND SAFETY (EHS) FIELD SAFETY SERVICES SUPERVISORS AUDIT AND MONITOR FACILITY COMPLIANCE WITH THE SAFETY STANDARDS OF THE COMPANY.\n\nALL LOCATIONS ARE REQUIRED TO CONDUCT THEIR OWN INTERNAL AUDIT UTILIZING CHECKLIST SURVEY FORMS THAT ARE REVIEWED REGULARLY AND UPDATED AS NECESSARY TO ENSURE ALL APPLICABLE FEDERAL, STATE, AND LOCAL REGULATIONS ARE COVERED. THE FIELD SUPERVISIORS REQUIRE A TIMELY WRITTEN RESPONSE WITH THE COMPLETION DATE OF ALL RECOMMENDATIONS RESULTING FROM THE AUDITS.\n\nEACH LOCATION HAS A \"SITE SAFETY COORDINATOR\" AS AN EXTENSION OF THE EHS GROUP. THESE COORDINATORS ARE GIVEN TRAINING TO MONITOR THE AY TO DAY SAFE WORK ACTIVITIES, MAINTAIN THE REQUIRED REGULATORY RECORD KEEPING, CONDUCT REGULAR SAFETY MEETINGS, CONDUCT REGULAR EMPLOYEE TRAINING, AND ACT AS THE LOCATIONS CONTACT WITH THE CORPORATE EHS GROUP. THE SITE SAFETY COORDINATOR ACTS AS THE LOCATIONS EMERGENCY CONTACT.\n\nDESCRIPTION OF OUR FACILITY AND THE REGULATED SUBSTANCES HANDLED:\n\nTHIS FACILITY IS A WHOLESALE FARM SUPPLY DISTRIBUTION CENTER. WE STORE AND DISTRIBUTE A WIDE VARIETY OF PESTICIDES AND FERTILIZERS INCLUDING ANHYDROUS AMMONIA. ANHYDROUS AMMONIA IS RECEIVED BY TRUCK AND RAIL, IS HANDLED AND STROED ON SITE, AND IS A SUBSTANCE REGULATED BY THE EPA REQUIRING US TO COMPLY WITH THE RISK MANAGEMENT PROGRAM. WE SELL ANHYDROUS AMMONIA TO GROWER CUSTOMERS IN EITHER 1000 GALLON OF 1500 GALLON NURSE TANKS. THE CUSTOMER APPLIES THE AMMONIA INTO THE SOIL AS A SOURCE OF NITROGEN FERTILIZ"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39404,
      "SummaryText": "ER FOR GROWING AGRICULTURAL CROPS. ANHYDROUS AMMONIA IS ALSO USED FOR BLENDING INTO MIXED GRADE FERTILIZERS FOR CROP PRODUCTON NUTRIENTS.\n\nTHIS FACILITY MAINTAINS APPROXIMATELY 26- 1000 GALLON NURSE TANKS AND 10- 1500 GALLON NURSE TANKS FOR CUSTOMER DELIVERY. OUR COMBINED STORAGE CAPACITY IN NURSE TANKS IS 194,000 POUNDS. ANHYDROUS AMMONIA IS STORED IN 1- STATIONARY 30,000 GALLON STORAGE TANK ON SITE. THE MAXIMUM CAPACITY OF THE STATIONARY STORAGE TANK IS 142,000 POUNDS OF ANHYDROUS AMMONIA. IN ADDITION ANHYDROUS AMMONIA MAY BE STORED TEMPORARILY IN UP TO 1 RAIL CAR. THE MAXIMUM QUANITY AN ANHYDROUS AMMONIA THAT MAY BE STORED IN A RAIL CAR IS 160,000 POUNDS. THEREFORE THE TOTAL FACILITY ANHYDROUS AMMONIA STORAGE CAPACITY IS 490,000 POUNDS. THE LARGEST STORAGE VESSEL AT OUR FACILITY CONTAINS 142,000 POUNDS.\n\nWORST CASE SCENARIO:\n\nOUR WORST CASE SCENARIO IS THE LOSS OF THE TOTAL CONTENTS OF THE 30,000 GALLON STORAGE TANK, WHEN FILLED TO THE GREATEST AMMOUNT ALLOWED (85%OF CAPACITY) , RELEASED AS A GAS OVER 10 MINUTES, RESULTING IN TOTAL VAPORIZATION. THE MAXIMUM QUANITY RELEASED WOULD BE 142,000 POUNDS. ACCORDING TO DEGADIS MODELING, THIS RELEASE (DISTANCE FROM POINT OF DISPERSION TO 200 PPM) WOULD HAVE OFF SITE IMPACT. IT SHOULD BE NOTED THAT THIS INDUSTRY HAS NEVER HAD A RELEASE OF AN ENTIRE STATIONARY ANHYDROUS AMMONIA STORAGE TANK FROM ANY DISTRIBUTION FACILITY.\n\nALTERNATIVE RELEASE SCENARIO:\n\nTHE MOST COMMON ALTERNATIVE RELEASE SCENARIO FORM OUR FACILITY WOULD NOT REACH AND END POINT OFF-SITE. THE ALTERNATIVE RELEASE SCENARIO MODELED FOR THE PURPOSE OF THIS PLAN IS A 2 MINUTE RELEASE FROM A STATIONARY STORAGE TANK REPRESENTING A VALVE AND HOSE FAILURE REQUIRING MANUAL SHUT DOWN. THE TOTAL AMOUNT OF ANHYDROUS AMMONIA RELEASED IN THIS SCENARIO WOULD BE 27,000 POUNDS. THIS RELEASE SCENARIO (DISTANCE FROM POINT OF DISPERSION TO 200PPM) WOULD HAVE OFF-SITE IMPACT. IT SHOULD BE NOTED THAT THE INDUSTRY HAS NOT HAD A RELEASE OF THIS TYPE FROM ANY DISTRIBUTION FACILITY.\n\n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39404,
      "SummaryText": "GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICA-SPECIFIC PREVENTION STEPS:\n\nTHE ANHYDROUS AMMONIA SYSTEM IS DESIGNED, INSTALLED AND MAINTAINED IN ACCORDANCE WITH ASTM STANDARDS AND ASME CODES. THIS FACILITY COMPLIES WITH THE ANSI K 61.1 STANDARDS, OSHA (29 CFR 1910.111)EPA'S ACCIDENTAL RELEASE PREVENTION RULE, AND ALL APPLICABLE FEDERAL, STATE, AND LOCAL CODES AND REGULATIONS.\n\nOUR AMMONIA SYSTEM IS PROTECTED FROM MAJOR RELEASE BY INTERNAL EXCESS FLOW VALVES, CHECK VALVES, RELIEF VALVES, AND MANUAL SHUTOFFS. THE LOAD OUT RISERS USED FOR THE PURPOSE OF FILLING THE NURSE TANS ARE PROTECTED BY EXCESS FLOW VALVES TO IMMEDIATELY STOP THE FLOW OF AMMONIA IF A LINE OR A HOSE FAILS. ALL MAIN STORAGE TANK  VALVES AND RISER VALVES ARE LOCKED WHEN NOT IN USE.\n\nOUR AMMONIA SYSTEM IS INSPECTED ON A REGULAR BASIS WITH MAINTENANCE AND PREVENTIVE MAINTENANCE SCHEDULED AND DOCUMENTED. LIQUID VAPOR VALVES, HOSES, EXCESS FLOW VALVES, GUAGES, AND RELIEF VALVES ARE REPLACED WHEN NECESSARY AND ACCORDING TO THE GUIDELINES AND THE ANSI STANDARDS.\n\nTRAINING IS PROVIDED TO ALL EMPLOYEES AT LEAST ANNUALLY, WHENEVER THERE IS A CHANGE IN THE PROCESS, OR WHENEVER COMPETENCY WITH REGULATIONS IS QUESTIONED. THE TRAINING CONSISTS OF CLASSROOM LECTURE, CURRENT VIDEOS, TESTING AND CERTIFICATION, AND ON THE JOB TRAINING.\n\nFIVE YEAR ACCIDENT HISTORY:\n\nTHERE HAVE BEEN NO ACCIDENTS INVOLVING ANHYDROUS AMMONIA THAT CAUSED DEATH, INJURIES, PROPERTY OR ENVIRONMENTAL DAMAGE, INCLUDING EVACUATIONS ON OR OFF-SITE, AS DEFINED BY THE RMP REGULATIONS.\n\nEMERGENCY RESPONSE PROGRAM:\n\nIN THE EVENT OF AN EMERGENCY INVOLVING OUR AMMONIA SYSTEM, IT IS OUR POLICY TO NOTIFY THE LOCAL COMMUNITY FIRE DEPARTMENT AND REQUEST THAT THEY RESPOND TO THE EMERGENCY. IN PREPERATION FOR THIS, WE HAVE COORDINATED WITH ALL OF THE LOCAL RESPONSE AGENCIES BY PROVIDING INFORMATION AND FACILITY TOURS TO ENSURE THAT THEY ARE FAMILIAR WITH AND PROPERLY PREPARED FOR AN INCIDENT AT OUR FACILITY. THIS WILL HELP TO ENSURE THAT OUR COMM"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39404,
      "SummaryText": "UNITY HAS THE STRATEGY FOR RESPONDING TO AND MITIGATIMNG THE THREAT BY AN AMMONIA RELEASE. THIS COMPLIES WITH THE REQUIREMENT FOR OUR FACILITY TO BE INCLUDED IN THE COMMUNITY EMERGENCY RESPONSE PLAN PREPARED UNDER EPCRA AND COORDINATED WITH OUR LEPC. \n\nIN ADDITION DBAS HAS AN EMERGENCY RESPONSE AND CONTINGENCY PLAN FOR EACH FACILITY THAT COMPLIES WITH THE REQUIREMENTS OF OSHA (29CFR 1910.38 AND 1910.1200). THE PLAN INCLUDES PROVISIONS FOR PUBLIC NOTIFICATION, INITIAL MEDICAL CARE, EVACUATIONS, AND LEPC COORDINATION.\n\nPLANED CHANGES TO IMPROVE SAFETY:\n\nWE DO NOT PLAN TO MAKE ANY CHANGES TO THE PHYSICAL SITE. WE WILL CONTINUE TO PROVIDE OUR EMPLOYEES WITH ON GOING ANNUAL TRAINING TO ENSURE THAT THEY ARE CURRENT WITH SAFE AMMONIA TRANSFER AND HANDLING PROCEDURES. WE WILL ALSO PROVIDE REGULAR INSPECTIONS AND MAINTENANCE ON ALL OF THE AMMONIA EQUIPTMENT."
    }
  ]
}