{
  "FacilityID": 39405,
  "FacilityName": "Xenia Water Treatment Plant",
  "FacilityStr1": "1831 U.S. Route 68 North",
  "FacilityStr2": null,
  "FacilityCity": "Xenia",
  "FacilityState": "OH",
  "FacilityZipCode": "45385",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39057",
  "LEPC": "Greene/Montgomery County LEPC",
  "FacilityLatDecDegs": "39.737176",
  "FacilityLongDecDegs": "-083.936683",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": "jjones@ci.xenia.oh.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Xenia, Ohio",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Xenia, Ohio",
  "OperatorStr1": "101 North Detroit Street",
  "OperatorStr2": null,
  "OperatorCity": "Xenia",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45385",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": "OEPA ID 2902812",
  "EPAFacilityID": "100000122459",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-06-03 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-07-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-07-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-09-22 00:00:00",
  "DeRegistrationEffectiveDate": "2008-01-01 00:00:00",
  "AnniversaryDate": "2009-07-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 39.75646,
  "FRS_Long": -83.92533,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56628,
      "AltID": "Chlorine System",
      "FacilityID": 39405,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 74789,
          "ProcessID": 56628,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 57944,
          "ProcessID": 56628,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 32563,
              "Process_NAICS_ID": 57944,
              "SafetyReviewDate": "2004-06-16 00:00:00",
              "PHA_Date": "2004-06-16 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-06-16 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Operator Error",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-07-03 00:00:00",
              "TrainingReviewDate": "2004-04-09 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-06-16 00:00:00",
              "EquipmentInspectionDate": "2004-06-16 00:00:00",
              "EquipmentTested": "Chlorinators, Injectors, Piping, Valves, Instruments, and Fittings.",
              "ChangeMgmtDate": "1999-06-04 00:00:00",
              "ChangeMgmtReviewDate": "2004-06-16 00:00:00",
              "PreStartupReviewDate": "1999-06-04 00:00:00",
              "ComplianceAuditDate": "2004-06-16 00:00:00",
              "AuditCompletionDate": "2004-06-16 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-04 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-04 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-04 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-04 00:00:00",
              "CBI_Flag": 0,
              "Description": "Process Safety Management",
              "_chemicals": [
                {
                  "PrimaryKey": 47339,
                  "PreventionProgram3ID": 32563,
                  "ProcessChemicalID": 74789
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 39405,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-06-16 00:00:00",
    "ERTrainingDate": "2004-04-09 00:00:00",
    "CoordinatingAgencyName": "Xenia Fire Division",
    "CoordinatingAgencyPhone": "9373767282",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39405,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies\n\nWe at City of Xenia's (Ohio)  Water Treatment Plant are strongly committed to employee, public and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.\n\nIt is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, we are completely coordinated with the City of Xenia Fire Division which provides highly trained emergency response personnel to control and mitigate the effects of the release.\n\n\nThe Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities encompass Chlorine Storage and Distribution.  We only have one (1) regulated substance present at our facility.  The regulated substance at our facility is used exclusively in the chlorination of the Public Water Supply.  Chlorine is used year round for the chlorination of the public's Drinking Water Supply.\n\nThe maximum inventory of Chlorine at our facility is 4,000 Lbs. stored in two 2000 Lb. cylinders.  Administrative controls manage the Chlorine inventory at a maximum of 4,000 Lbs. of chlorine (Two cylinders) at any one time in the cylinder room.\n\nWorst-Case Release Scenario and the Alternative-Case Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario have been determined for the Facility using the EPA RMP Comp program downloaded from EPA's Web-Site.\n\nTo perform the required offsite consequence analysis for our facility, we have used the equations provided by the EPA in the RMP Guidance for Chlorine Storage Facilities.  \n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 C"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39405,
      "SummaryText": "FR part 68 of the EPA regulations.  This facility was designed and constructed in accordance with The Chlorine Institute Standards.\n\nThe following sections briefly describe the elements of our release prevention program that are in place at our stationary source.\n\nProcess Safety Information:\n\nCity of Xenia's Water Treatment Plant maintains a detailed record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with the Chlorine process.\n\nHazard Review:\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these reviews is the HAZOP (Hazard and Operability study) Methodology.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are re-validated at regular intervals of every four to five years.  Any findings related to the hazard reviews are addressed in a timely manner.\n\nOperating Procedures:\n\nFor the purposes of safely conducting activities within our covered processes, City of Xenia's Water Treatment Plant has written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a maintenance activity.  The information is regularly reviewed and is readily accessible to operators involved with the processes.\n\nTraining:\n\nCity of Xenia's Water Treatment Plant has a comprehensive training program in place to ensure that employees operating processes are completely competent in the operating procedures associated with these processes.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided at least every three years and more frequently as needed"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39405,
      "SummaryText": ".\n\nMechanical Integrity:\n\nThe City of Xenia's Water Treatment Plant carries out highly documented maintenance checks on process equipment to ensure proper functions.  Process equipment examined by these checks includes among others; Chlorine storage cylinders, equipment, piping and valve  systems, relief and vent systems, emergency shutdown systems, controls and fittings.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change:\n\nWritten procedures are in place at the City of Xenia's Water Treatment Plant to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-Startup Reviews:\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at the City of Xenia's Water Treatment Plant.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits:\n\nThe City of Xenia's Water Treatment Plant conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation:\n\nThe City of Xenia's Water Treatment Plant promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These in"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39405,
      "SummaryText": "vestigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from re-occurring.  All reports are retained for a minimum of 8 years.\n\nEmployee Participation:\n\nThe City of Xenia's Water Treatment Plant truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation to the RMP rule in particular information resulting from process hazard analysis.\n\nContractors:\n\nOn occasion, The City of Xenia's Water Treatment Plant hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  The City of Xenia's Water Treatment Plant has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\nFive-Year Accident History\n\nThe City of Xenia's Water Treatment Plant has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there have been no accidental releases of regulated substances from our facility within the last 5 years. \n\n\nEmergency Response Plan\n\nThe City of Xenia's Water Treatment Plant has a written emergency response plan to deal with accidental releases of Chlorine.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected an"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 39405,
      "SummaryText": "d serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nOur emergency response plan has been coordinated and verified with The City of Xenia's  Fire Division and the Local Emergency Planning Committee (LEPC).\n\n\nPlanned Changes to Improve Safety\n\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Below are some of the major steps we will be considering to improve safety at our facility over the coming year.  \n\n\nA.  Reviewing alternate methods of sanitizing the Water Supply.  We are awaiting Plan Approval from Ohio E.P.A. to convert our  process to using liquid sodium hypochlorite (bleach) solution.  We should be able to purchase the tanks, piping, and pumps in late 2004 and no longer use chlorine gas. \nB.  Storing less than the RMP listed quantity on site through a just in time delivery program with our chlorine\n      vendors.  This will occur as Plan Approval is received, and the bid process begins for the specifiecd equipment."
    }
  ]
}