{
  "FacilityID": 39481,
  "FacilityName": "Forbo Adhesives, LLC",
  "FacilityStr1": "3150 Fiberglass Road",
  "FacilityStr2": null,
  "FacilityCity": "Kansas City",
  "FacilityState": "KS",
  "FacilityZipCode": "66115",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20209",
  "LEPC": "Wyandotte County LEPC",
  "FacilityLatDecDegs": "39.144890",
  "FacilityLongDecDegs": "-094.617383",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.forbo.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Forbo Adhesives, LLC",
  "Company2Name": null,
  "CompanyDUNS": 480007400,
  "Company2DUNS": 480007400,
  "OperatorName": "Forbo Adhesives, LLC",
  "OperatorStr1": "3150 Fiberglass Road",
  "OperatorStr2": null,
  "OperatorCity": "Kansas City",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66115",
  "OperatorZipCodeExt": null,
  "RMPContact": "William Straeter",
  "RMPTitle": "Plant Manager",
  "FTE": 22,
  "OtherEPAFacilityID": "KSD007118144",
  "EPAFacilityID": "100000043375",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-02-13 00:00:00",
  "SafetyInspectionBy": "DOT, Federal Railroad Administration",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-07-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-07-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-07-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-09-27 00:00:00",
  "DeRegistrationEffectiveDate": "2019-09-19 00:00:00",
  "AnniversaryDate": "2009-07-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 39.14489,
  "FRS_Long": -94.61738,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56747,
      "AltID": "Resin Manufacture",
      "FacilityID": 39481,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 58064,
          "ProcessID": 56747,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 74935,
          "ProcessID": 56747,
          "ChemicalID": 29,
          "Quantity": 790000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 574935,
          "ProcessID": 56747,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39481,
      "SummaryText": "Risk Management Plan: Discussion Draft\n\n\nExecutive Summary\n\nForbo Adhesive, LLC has established a Risk Management Program that helps the company to identify and communicate risks associated with our operations.  As part of this commitment, we have established reasonable controls to prevent accidental releases from occurring. Should an accidental release of a hazardous material occur, despite these measures, we have also developed specific plans for each facility to reduce the effects of potential releases upon our employees and the general public. We have also developed site-specific plans for emergency response that involve both our employees and local emergency service providers.\n\n\nDescription of Source and Regulated Substances\n\nForbo Kansas City Site\nForbo Adhesives, LLC operates approximately 6 facilities in North America.  These facilities produce a wide variety of polymers and adhesives found in many household items.  The Kansas City Site produces various materials found in latex paints, adhesives for cardboard and carpets, construction products, and other common items.  A variety of chemicals are used to manufacture these products.  One of these chemicals is subject to the RMP regulation: vinyl acetate monomer.  \n\nVinyl acetate monomer (VA) is a  toxic chemical.  The maximum quantity of vinyl acetate monomer stored on site is 790,000 pounds (99,000 gallons).  Typically only 370,000 pounds (46,250 gallons) or less of vinyl acetate monomer is stored on site at any given time.\n\nOffsite Consequence Analysis\n\nForbo Kansas City utilized RMP*Comp to calculate the following offsite consequence analyzes and Landview to estimate population densities: \n\nVinyl Acetate:\n\nVinyl acetate monomer is stored in a single storage tank. The storage tank contains 99,000 gallons (790,000 pounds).  The working storage volume for the tank is approximately 46,250 gallons (370,000 pounds).  The tank is located within a concrete secondary containment area, which is capable of containing "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39481,
      "SummaryText": "110% of the volume of the VA tanks. \n\nWorst Case Scenario\nThe worst case scenario would be the catastrophic failure of the VA storage tank releasing 790,000 pounds of VA into the secondary containment.  The offsite impact area associated with this scenario would be 1.93 miles downwind.\n\nAlternative Case Scenarios\nThere were several alternative case scenarios discussed. The most of the creditable scenario was a transfer line leak releasing 9,600 lbs or vinyl acetate monomer during a one-hour period.  The vapors would travel approximately 0.2 miles before dropping below ERPG concentration (RMP-Comp) \n\nThere are no persons living in permanent or rental properties within the 0.2 mile radius that would be effected. (Landview III software).\n\nThe vinyl acetate storage tank is protected from overfill by a high level interlock.  If the tank level reaches the high level, an alarm will sound and the unloading pump will shutdown.  This interlock, combined with the unloading procedures and daily inventory recording for the tank, would make a release from the unload system unlikely.\n\nGeneral Accidental Release Prevention Program\n\nTo help Forbo Adhesive, LLC achieve its Environmental Health & Safety (EH&S) goals, the Kansas City site is dedicated to continuous improvement of its comprehensive Environmental, Health, and Safety program, which includes compliance with the Occupational Safety and Health Administration's (OSHA) Process Safety Management regulation (29 CFR 1910.119).\n\nEmployees at the Kansas City facility are highly trained, knowledgeable, and skilled, which results in a workforce that is very capable in their job performance.  These employees are then supported with numerous sources of information about:\n\n1. Job Duties - with standard operating procedures, emergency procedures, and safe work practices\n2. Chemicals used in the process - with annual review of Material Safety Data Sheets, exposure limits and exposure prevention, and the process chemistry\n3. Operation of t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39481,
      "SummaryText": "he process - with equipment design and construction information, safe operating limits, and the consequences and correction of process upsets.\n\nThe training of Forbo employees, the supporting information available, and the active involvement of the employees at all levels of the organization, combined to provide a strong foundation for the EH&S programs for this facility.  Traditional Process Safety Management (PSM) programs such as Hot Work, Confined Space, Lockout/Tagout, Management of Change, Process Hazardous Analysis, Incident Investigation, Emergency Response, Mechanical Integrity, and Line Break Permitting also benefit from the high level of employee involvement.  It is through these programs that the potential hazards of the process are identified, corrected, reviewed, and/or mitigated.\n\nIn addition to the PSM programs, Forbo's Contractor Safety & Management programs help the Kansas City facility achieve its EH&S goals.  The contractor program is simple and direct.  Contractors and their employees are treated as though they are Forbo  employees while performing work at the site.  They are made aware of our processes and procedures, expected to follow our programs and procedures, participate as necessary, and be held to the same standards of performance as we hold our own employees.  The mechanical integrity program for this facility involves the regular testing and inspection of equipment used within our hazardous processes.  Equipment is expected to be purchased, installed, and maintained in accordance with applicable codes and standards, manufacturer's recommendations, and generally accepted good engineering practices.  Equipment found that does not meet these requirements will be repaired, replaced, or removed from service.  These same principles will be applied to spare parts and maintenance activities.\n\nFive Year Accident History\n\nThe Kansas City Site has a good safety record.  All incidents with the potential to cause any injury or damage are investiga"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39481,
      "SummaryText": "ted.  The regulations require the reporting of events involving regulated substances that result in deaths, injuries, or significant property damage on site or known deaths, injuries, evacuations, sheltering-in-place, property damage, or environmental damage off site.  There was one release in the last five years that required reporting under the RMP program.  All appropriate authorities were notified.\n\nEmergency Response Program\n\nThe Kansas City Site has a comprehensive emergency response plan.  The Emergency Response Program includes drills which are conducted annually. \n\nTransportation of hazardous materials (inbound raw materials, as well as, outbound finished products) within the local area is included in planning activities.  The emergency response plan is reviewed annually and updated as needed.\n\nPlanned Changes to Improve Safety\n\nThe Kansas City site constantly strives to improve the safety of its processes and employees through its incident investigation program, solicitation of safety suggestions from its workers, ideas from outside contractors, and support from Forbo's Corporate Office. \n\nOther:\n\nAn internal safety audit was conducted at the plant in late 2004/early 2005.\nAn outside safety audit for the Kansas City site has been scheduled for the second week of August 2009 and will be conducted by a member of a sister plant.\n\n"
    }
  ]
}