{
  "FacilityID": 39517,
  "FacilityName": "Rhodia Inc., Freeport Plant",
  "FacilityStr1": "6213 Highway 332 East",
  "FacilityStr2": null,
  "FacilityCity": "Freeport",
  "FacilityState": "TX",
  "FacilityZipCode": "77541",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48039",
  "LEPC": "Brazoria County LEPC",
  "FacilityLatDecDegs": "28.990000",
  "FacilityLongDecDegs": "-095.363611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 131121279,
  "ParentCompanyName": "Rhodia Inc.",
  "Company2Name": null,
  "CompanyDUNS": 2959810,
  "Company2DUNS": 0,
  "OperatorName": "Rhodia Inc.",
  "OperatorStr1": "6213 Highway 332 East",
  "OperatorStr2": null,
  "OperatorCity": "Freeport",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77541",
  "OperatorZipCodeExt": null,
  "RMPContact": "Phil McCray",
  "RMPTitle": "Operations Manager",
  "FTE": 44,
  "OtherEPAFacilityID": "77541RHNPL6213H",
  "EPAFacilityID": "100000119436",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-01576",
  "SafetyInspectionDate": "1999-02-02 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-09-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-07-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-07-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-11-22 00:00:00",
  "DeRegistrationEffectiveDate": "2005-11-15 00:00:00",
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 28.94556,
  "FRS_Long": -95.42333,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56794,
      "AltID": "Anhydrous Ammonia Stg.",
      "FacilityID": 39517,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 58111,
          "ProcessID": 56794,
          "NAICSCode": "325998",
          "_desc": {
            "NAICS_CODE": "325998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Chemical Product and Preparation Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 58112,
          "ProcessID": 56794,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 74986,
          "ProcessID": 56794,
          "ChemicalID": 56,
          "Quantity": 52000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 574986,
          "ProcessID": 56794,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39517,
      "SummaryText": "\n                                                                        EXECUTIVE SUMMARY\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAt Rhodia Inc., Freeport, Texas plant, we are committed to operating and maintaining all of our processes in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n?    A description of our facility and use of substances regulated by EPA?s RMP regulation\n?    A summary of results from our assessment of the potential offsite consequences from accidental chemical releases\n?    An overview of our accidental release prevention programs\n?    A five-year accident history for accidental releases of chemicals regulated by EPA?s RMP rule\n?    An overview of our emergency response program\n?    An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\nOur facility produces Rare-Earth compounds and Aliphatic Polyisocyanate paint additives using a variety of chemicals and processing operations.  The Freeport plant is located in the Brazosport area, about 50 miles south of Houston, on the coast of the Gulf of Mexico.  The plant sits on 115 acres, of which 50 are developed.  In our processes, we use the following chemicals that EPA has identified as having the potential to cause significant offsite consequences in the event of a substantial\naccidental release:\n\nToxics\n\nAmmonia (anhydrous) is used in the Rare-Earth process as a raw material stored in a 10,000 gallon storage vessel.  It is fed to the aqueous ammonia converter prior to its application as a neutraliz"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39517,
      "SummaryText": "ing reagent.\n\nOur accidental release prevention programs and our contingency planning efforts help us effectively manage the hazards that are posed to our employees, the public, and the environment by our use of these chemicals.\n\nKEY OFFSITE CONSEQUENCE ANALYSIS SCENARIOS\n\nEPA?s RMP rule requires that we provide information about the worst-case release scenarios and alternative release scenarios for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario:\n\nWorst-case Release Scenario ? Ammonia (anhydrous)\n\nAmmonia is routinely received by tank-truck, transferred into the 10,000 gallon storage vessel.  The WCS is based on the release of the maximum possible content of the storage vessel in 10 minutes.  The ERPG-2 toxic end-point distance is 2.6 miles as calculated using EPA?s RMP-Comp version 1.07.  In this case, if and when it occurs, such release will have off-site consequences.  The storage vessel was designed and built per ASME code for pressure vessel with Maximum Allowable Working Pressure of 300 psig.  Typical storage pressure during summer months is 140 psig.  Under our mechanical integrity program the vessel is inspected every 5 years externally, every 10 years internally.  There are 2 pressure relief valves protecting the vessel, each one is serviced and calibrated on annual basis.  Routine maintenance is performed as soon as any deficiencies are found.\n\nAlternative Release Scenario ? Ammonia (anhydrous)\n\nThe ARS selected to illustrate a more likely case that can occur and has the potential to reach public receptor is the failure of the 2-inch transfer hose.  The ERPG-2 toxic end-point distance is 0.5 mile as calculated using the EPA?s RMP-Comp version 1.07.  Our standard operating procedure requires both our operator and the delivery truck driver to be physically present to immediately stop the transfer should a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39517,
      "SummaryText": "ny release occur.  We require our ammonia supplier(s) to certify that the hoses used are periodically inspected and pressure tested.  Both the tank-truck and our vessel are equipped with access flow valve that will stop the release automatically.  Routine maintenance is performed on piping, valves, pump and instruments.                        \n                                                                                                                                                                                       We are using this information to help us ensure that our emergency response plan and the community emergency response plan address all reasonable contingency cases.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND AMMONIA-SPECIFIC PREVENTION STEPS\n\nWe take a systematic, proactive approach to preventing accidental releases of hazardous chemicals.  Our management systems address each of the key features of successful prevention programs including:\n\n?    Process safety information\n?    Process hazard analysis\n?    Operating procedures\n?    Training\n?    Mechanical integrity\n?    Management of change\n?    Pre-startup safety review\n?    Compliance audits\n?    Incident investigation\n?    Employee participation\n?    Hot work permit\n?    Contractors\n\nAs part of our prevention efforts, we have implemented the following chemical-specific prevention steps:\n\nAs stated earlier, the ammonia vessel was built per ASME code and inspected each 5 years externally and 10 years internally.  The 2 pressure relief valves that prevent over pressure, standard operating procedure and the trained operator who monitor each transfer operation.  Equipment maintenance is performed only by trained and quality craftsmen.\n\nThese individual elements of our prevention program work together to prevent accidental chemical releases.  Our company and our employee are committed to the standard that these management systems set for the way we do business, and we have specific accountabilities and controls to ensure that w"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39517,
      "SummaryText": "e are meeting our own high standards for accident prevention.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nFreeport has not experienced any reportable or significant releases within the last five years.  Any incident is investigated to identify and correct the root causes in order to prevent recurrance.\n\nEMERGENCY RESPONSE PROGRAM\n\nWe maintain an integrated contingency plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning.  Our program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, we coordinate our plan with the community emergency response plan.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nImprovements to the system include; Automate the deluge system for the ammonia tank and the truck unloading station to activate based on the area sensor detection of ammonia in the atmosphere and initiate a project to eliminate the ammonia transfer pump from the anhydrous to 19% system and thereby eliminate a potential for equipment leaks."
    }
  ]
}