{
  "FacilityID": 39551,
  "FacilityName": "U.S. Growers Cold Storage Areas 5&6",
  "FacilityStr1": "2045 E. Vernon Ave",
  "FacilityStr2": null,
  "FacilityCity": "Vernon",
  "FacilityState": "CA",
  "FacilityZipCode": "90058",
  "Facility4DigitZipExt": "1612",
  "FacilityCountyFIPS": "06037",
  "LEPC": null,
  "FacilityLatDecDegs": "34.001430",
  "FacilityLongDecDegs": "-118.140640",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 807446315,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "U.S. Growers Cold Storage Inc",
  "OperatorStr1": "3141 E. 44th St",
  "OperatorStr2": null,
  "OperatorCity": "Vernon",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90058",
  "OperatorZipCodeExt": "1612",
  "RMPContact": "Peter J. Corselli",
  "RMPTitle": "Engineering Manager",
  "FTE": 45,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000077427",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-06-17 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-09-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-07-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-07-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-07-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 34.00391,
  "FRS_Long": -118.23565,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "0.5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "5",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56873,
      "AltID": "Refrigerated Warehouse",
      "FacilityID": 39551,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 58191,
          "ProcessID": 56873,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 75075,
          "ProcessID": 56873,
          "ChemicalID": 56,
          "Quantity": 11000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 575075,
          "ProcessID": 56873,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39551,
      "SummaryText": "EXECUTIVE SUMMARY\n\nIntroduction\n\nIn response to the City of Vernon Health and Environmental Control, this Process Safety Management/Risk Management Program (PSM/RMP) has been developed for the U.S. Growers facility located in Vernon, California.  This document has been prepared to satisfy several regulations and is governed by the following agencies:\n\n?    OSHA?S Code of Federal Regulations, Title 29, $ 1910.119, Process Safety Management (PSM) of Highly Hazardous Materials.\n\n?    Cal-OSHA?s California Code of Regulations, Title 8, & 5189, Process Safety Management (PSM) of highly Hazardous Materials.\n\n?    Federal EPA?s. Code of Federal Regulations, Title 40, Part 68, Accidental Release Prevention Requirements: Risk Management Programs (RMP) Clean Air Act Section 112?, Program 3 requirements.\n\n?    California Office of Emergency Services, California Code of Regulations, Title 19, Division 2, Chapter 4.5, California Accidental Release Prevention (CalARP) Program.\n\n?    California Health and Safety Code, Section 25531 through 25534\n\nThe purpose of this document is to:\n\n?    Increase the protection of public health, the environment, and facility employees by ensuring proper emergency response and mitigation procedures when handling regulated substances.\n\n?    Assist U.S. Growers and local government agencies in their communication and coordination efforts to improve facility safety while handling ammonia.\n\nThis document addresses U.S. Growers administrative and operational programs established to prevent regulated substance-related accidents and reduce potential risks.  The regulated substance of concern and focus of this document is ammonia.\n\nDOCUMENTATION\nThis process Safety Management / Risk Management Program document consists of two volumes.  Volume I includes the management programs in place at the facility to ensure safe operations of the ammonia system and Volume II includes the technical studies performed prior to startup to ensure safe design of the ammonia system.\n\nAt the begin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39551,
      "SummaryText": "ning of Volume I, are the Documentation Record, Record of Revision, and Revision Page Summary forms.  The Documentation Record outlines all parties that have a copy of this PSM/RMP document.  Updates to this document will be provided to all parties listed on this record.  The Record of Revision form should be used to indicate that the revisions have been included.  When revision pages are provided a Revision Page Summary will be provided that outlines each page added or replaced.\n\nVolume I also contains a Compliance Matrix.  This matrix outlines the requirements of each regulation and the location of the documentation satisfying that regulation within this document.  The regulations covered include: OSHA?s 29CFR & 1910.119 (PSM), Cal-OSHA?s 8 CCR & 5189 (PSM), EPA?s 40 CFR Part 68 (RMP), and the California Accidental Release Prevention Program (CalARP)\n\nEach section of Volume I and II (with the exception of Recordkeeping & Updates, Management Programs, and Certification) have been prepared as ?stand-alone? documents.  Each section has its own table of contents, appendices, page numbering system and compliance matrix.\n\nThe following subsections outline the Executive Summary requirements of the CalARP program (&2745.3) and EPA?s 40CFR Part 68.155.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nU.S. Growers has an emergency response plan in effect.  The Emergency Response Plan (Plan)  is detailed in the Emergency Planning and Response section of this PSM/RMP document.  This Plan was designed to meet the following objectives:\n\n1.)    To save lives\n2.)    To minimize and avoid injuries.\n3.)    To protect the environment.\n4.)    To minimize property damage.\n\nU.S. Growers maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routs, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emerg"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39551,
      "SummaryText": "ency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan will be reviewed and updated to ensure compliance with the PSM, RMP, and CalARP regulations and to ensure that the plan is kept current.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe U.S. Growers facility is located on East Vernon Ave (North side) between Alameda and Santa Fe Ave., Vernon California . The facility consists of two main warehouses that use ammonia for refrigeration  Areas 5 and 6, and an engine room. The facility occupies approximately 167,00 square feet.\n\nThe ammonia refrigeration process is a closed system that cycle the refrigerant, or ammonia, from liquid to gas and back again.  The processes, consisting of vessels, piping, valves, and process equipment, cycle ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for product and process equipment.\n\nChanges in pressure are directly related to changes in temperature; lowering the ammonia pressure lowers its temperature.  Low pressure (cold) liquid ammonia provides refrigeration by removing ambient heat.  Removal of ambient heat causes the liquid ammonia (contained within the system to vaporize.  Heat is later removed from the ammonia as it is condensed back into a liquid.  Typical operating conditions range from approximately 7 inches Hg on the low pressure side of the system to 160 psig on the high side.  The ammonia equipment and its location is listed in Table 1.\nTable 1 Ammonia Refrigeration Equipment\n\n        Equipment                Location            State\n\n    High Pressure Receiver            Roof of Machine Room            Liquid\n    Intercooler                Machine Room                Liq/Vapor\n    Pump Traps (2)                Machine Room                Liq/Vapor\n    Evaporator Coils            1-4: -10 D F Freezer Room        Liq/Vapor\n                        5-10: Loading Dock            \n                        11-14: Passage Way, Loading & RR Dock\n                        15-17:   Passage Way, Loading & R"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39551,
      "SummaryText": "R Dock\n                        18-20: -25 D F Freezer Room\n                        21-26 : +36 D F Cooler\n                        27-32: Freezer Building\n    ___________________________________________________________________\n    Compressors (4)            Machine Room                           Vapor__\n               Evaporative Condensor            Roof of Maintenance Shop         Liq/Vapor\n    Oil Coolers (4)                At Each Compressor                Liquid_\n    Oil Pots (3)                Machine Room                 Liq/Vapor\n    Purger                    Machine Room                 Liq/Vapor\n    Heat Exchanger                Machine Room                 Liq/Vapor\n\nThe maximum quantity of ammonia that can be stored on site is 10,500 pounds.\nHAZARD ASSESSMENT SUMMARY\n\nWorst Case Release Result Summary\n\n?    Scenario Description: Release of the maximum charge of ammonia from the high pressure receiver in 10 minutes.  The capacity of the high pressure receiver is 1100 gallons of ammonia, which equates to 6050 pounds of ammonia.  The receiver is located on the roof of the facility, and thus, no passive mitigation effects were considered.  The most pessimistic meteorological conditions were used; 1.5 meters/second wind speed, and F stability.  The EPA?s RMP Guidance for Wastewater Treatment Plants was used to determin the distance to the toxic endpoint.\n\n?    Distance to Toxic Endpoint: 1.0 miles, based on EPA?s RMP Guidance for Wastewater Treatment Plants.\n\n\nAlternative Release Result Summary\n?    Scenario Description:  A release of ammonia gas from ? inch diameter leak.  The release rate of ammonia due to the pressure of the tank is 126 pounds per minute.  No passive mitigation effects wee taken into account, as this rupture could occur outside.  The meteorological conditions used were 3 meters per second wind speed, and D stability.  The EPA?s RMP Guidance for Wastewater Treatment Plants was used to determine the distance to the toxic endpoint.\n\n?    Distance to Toxic Endpoint: 0.1 miles, based on the EPA?s RMP Guidance for Wastewater Treatment Plants.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS.\n\nU.S. Growers has a Process Safety Man"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 39551,
      "SummaryText": "agement program in place to manage the handling of ammonia.  In addition, common industry standards, policies, and procedures are utilized to ensure safe practices are being performed.\n\nThe U.S. Growers facility, including the ammonia system, was designed and constructed in accordance with the Uniform Mechanical Code which specifically outlines requirements for the safe operation of the ammonia refrigeration system.  These safety features include ammonia sensors in the machine room as well as sensors in selected cold storage areas.  In addition, the majority of the ammonia is maintained inside the engine room and just outside of the machine room (condensers).\n\nIn addition to the Uniform Mechanical Code, the facility will operate in accordance with the International Institute of Amonia Refrigeration (IIAR) guidelines.  In particular, the IIAR Bulletin 110, ?Startup, Inspection, and Maintenance of Ammonia Refrigerating Systems.?\n\nFIVE YEAR ACCIDENT HISTORY\nSince the initial PHA Study conducted on June 1, 1993, there have been no releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds.  In addition, there have been no injuries resulting from an ammonia release.\n\nEMERGENCY RESPONSE PROGRAM\nThe U.S. Growers has an emergency action plan in effect at the facility.  The Emergency Action Plan )Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document.  This Plan was designed to meet the following objectives:\n\n1.)    To save lives.\n2.)    To minimize and avoid injuries.\n3.)    To protect the environment.\n4.)    To minimize property damage.\n\nThe U.S. Growers maintains a safety committee whose members include the emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  Thi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 39551,
      "SummaryText": "s Plan will be reviewed and updated to ensure compliance with the PSM, RMP, and CalARP regulations, and to ensure that the plan is kept current.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nThe process Hazard Analysis (PHA) Revalidation provided the mitigation measures outlined below to improve safety at U.S. Growers Reclamation Plant.  The PHA Revalidation was comprised of one session that included a HZOP study, a Plant Walkthrough, a ?What-if? analysis, and a series of checklists.  Below is a summary of the recommendations resulting from the Process Hazard Analysis Revalidation study performed on April 14, 1999 at U.S. Growers Cold Storage Areas 5 and 6. (List was completed).\nRecommendations from 2004  HAZP are included below.\n\n?    Link ammonia sensors to automatic shut offs to reduces extended leaks.\n\n\nThe Engineering Manager will be responsible to ensure that all recommendations are completed on or before August 1, 2005\n\n\nDISCLAIMER\n\nThe reports included in this Process Safety Management/Risk Management Program document (Volumes I, II, and III) were prepared using information provided to Tracer ES&T by U.S. Growers? implementation of the program or the programs contained herein.  Furthermore, Tracer ES&T accepts no professional liability regarding the on-going and future environmental and safety compliance programs related to this facility."
    }
  ]
}