{
  "FacilityID": 39602,
  "FacilityName": "Lake Murray WTP",
  "FacilityStr1": "730 Cherokee Road",
  "FacilityStr2": null,
  "FacilityCity": "Lexington",
  "FacilityState": "SC",
  "FacilityZipCode": "29072",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45063",
  "LEPC": "Lexington County LEPC",
  "FacilityLatDecDegs": "34.011389",
  "FacilityLongDecDegs": "-081.246667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of West Columbia",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of West Columbia",
  "OperatorStr1": "1053 Center Street",
  "OperatorStr2": "P.O. Box 4044",
  "OperatorCity": "West Columbia",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29171",
  "OperatorZipCodeExt": null,
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000047424",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-09-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-07-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-07-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-10-22 00:00:00",
  "DeRegistrationEffectiveDate": "2009-10-15 00:00:00",
  "AnniversaryDate": "2009-07-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 34.011389,
  "FRS_Long": -81.246667,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56939,
      "AltID": "Chlorination",
      "FacilityID": 39602,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 75211,
          "ProcessID": 56939,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 58260,
          "ProcessID": 56939,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 32768,
              "Process_NAICS_ID": 58260,
              "SafetyReviewDate": "2002-05-07 00:00:00",
              "PHA_Date": null,
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-05-27 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Fail close vacuum regulators",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Scrubber, leak detector and alarm, offsite mutual aid response",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-05-07 00:00:00",
              "TrainingReviewDate": "2002-05-07 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-05-07 00:00:00",
              "EquipmentInspectionDate": "2004-05-04 00:00:00",
              "EquipmentTested": "Chlorine sensors",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2002-05-07 00:00:00",
              "PreStartupReviewDate": "2002-05-07 00:00:00",
              "ComplianceAuditDate": "2002-05-07 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2002-05-07 00:00:00",
              "HotWorkPermitReviewDate": "2002-05-07 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2002-05-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 47638,
                  "PreventionProgram3ID": 32768,
                  "ProcessChemicalID": 75211
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 39602,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-06-14 00:00:00",
    "ERTrainingDate": "2003-07-10 00:00:00",
    "CoordinatingAgencyName": "Lexington County LEPC",
    "CoordinatingAgencyPhone": "8033598230",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 39602,
      "SummaryText": "for the hypothetical worst-case chlorine release scenario did predict an offsite impact.\n\nEPA describes the alternative release scenario as simply a more realistic release than the worst-case release or a release that is more likely to occur than the worst-case release.  The alternative release scenario chosen for the Lake Murray Water Treatment Plant involves a complete failure of a container mounted vacuum regulator resulting in the predicted release of 2,000 pounds of chlorine to the atmosphere over a two-hour period.  The alternative chlorine release scenario chosen for the Lake Murray Water Treatment Plant was selected based on the results of a qualitative risk analysis of possible release alternatives.  The offsite consequence analysis for this scenario incorporated passive mitigation (i.e., building enclosure) and active mitigation (i.e., actuation of a chlorine gas scrubber to control the leak.  The DEGASIS+ computer model was used to perform this consequence analysis.  Due to the high efficiency of the chlorine gas scrubber system, the consequence analysis performed for the hypothetical alternative chlorine release scenario did not predict an offsite impact.\n\nWhile EPA requires analysis of the consequence of a worst-case release scenario, worst-case release scenarios as defined by the EPA have an extremely low probability of occurrence.  The worst-case release could only happen if the majority of the safety and technology features in use failed at the same time.  Additionally, it would have to occur at exactly the time the worst-case weather conditions also existed, a most improbable event.  Further, certain consequence conditions such as the entire amount of chlorine will be released as a gas in ten minutes and comparison of a ten minute release to a toxic endpoint based on a one-hour value are unrealistic.  However, there is no allowance in the Risk Management Program (RMP) rule for making an adjustment to the worst-case release scenario conditions.  For"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39602,
      "SummaryText": "this reason, the alternative release scenario should be the focus of prevention and preparedness efforts.\n\n4. General accidental release program and the chemical-specific prevention steps:\n\nThe Lake Murray Water Treatment Plant complies with EPA¿s RMP Rule, OSHA¿s Process Safety Management standard (29 CFR 1910.119), and with all applicable state and local codes and regulations.  The chlorination process was constructed, and is operated, in accordance wit recommendations of the AWWA and Chlorine Institute.  The Lake Murray Water Treatment Plant accidental release prevention program is based on the following key elements:\n\n? High level of training for operators and maintenance personnel\n? Equipment inspection, testing, and preventive maintenance\n? Use of `industry standard¿ process and safety equipment\n? Use of accurate and effective operating procedures\n? Performance of hazard review of equipment and procedures\n? Implementation of an internal and external auditing program\n? Segregation of chemical processes for compatibility and fire prevention/control\n? Chlorine gas scrubber system\n? Chlorine leak detectors and alarm system\n? Availability of SCBAs and chlorine container leak repair kit\n? Maintenance of approved parts inventory\n\n5. Five-year accident history:\n\nThe Lake Murray Water Treatment Plant has had an excellent record of preventing accidental releases over the past five years.  Due to the effectiveness of the release prevention program, there have been no accidental releases of chlorine during the past five years.\n\n6. Emergency Response Program:\n\nThe Lake Murray Water Treatment Plant has an emergency preparedness plan that is integrated with the LEPC plan.  The Lake Murray Water Treatment Plant maintains a mutual aid agreement with the Lexington County HAZMAT Team to provide emergency response services in the event of a chlorine release.  The plant emergency preparedness plan includes procedures for the notification of offsite mutual aid responders, LEPC, SC"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 39602,
      "SummaryText": "DHEC, and the public along with a discussion of actions to be taken in the event of a chlorine release.  The plan also addresses first aid and medical treatment.\n\n7. Planned changes to improve safety:\n\nThe Process Hazard Analysis (PHA) was re-validated in May 2004 with no recommended process changes.  A PSM compliance audit was conducted in May 7,2002, and it resulted in no changes.  A Vulnerability Assessment (VA) along with a Emergency Response Plan (ERP) was conducted in accordance with EPA Risk Assessment Methodology for Water.  The following  changes have been recommended:\n\n? Shrouded security padlocks\n? Secure backwash return manhole\n? Pan/Tilt zoom camera for back of WTP\n? Fixed security camera to cover front gate\n? Motion detector at front gate\n? Shrouded security padlocks\n? Chemical feed area valve locking mechanisms\n? Motion detector in chemical feed area (Cost of camera included in planned WTP upgrade)"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 39602,
      "SummaryText": "1.  Accidental release prevention and emergency reponse policies:\n\nThe Lake Murray Water Treatment Plant accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices.  Accidental release prevention is a function of the safety devices (technology) inherent in the facility design, safe material handling practices used (procedures), and commitment to training of plant employees (management practices).  All applicable requirements of the U.S. Environmental Protection Agency (EPA) Risk Management Prevention Program (40 CFR 68.65-87) are adhered to.  It is the goal of the City of West Columbia Lake Murray Water Treatment Plant to ensure plant and community safety through an aggressive program of preventive maintenance, equipment testing, standard operating procedures, and employee training.\n\nThe Lake Murray Water Treatment Plant emergency response policy involves the preparation of an emergency preparedness plan which is tailored to the facility and to the emergency response services available in the community.  The emergency preparedness program includes procedures for notification of the Lexington County HAZMAT Team (off-site mutual aid response), LEPC (community response plan), and SCDHEC (state response plan).  The Saluda River Water Treatment Plant emergency preparedness program is based upon the recommendations of the American Water Works Association (AWWA) and the Chlorine Institute and is in compliance with the EPA Risk Management Emergency Response Program (40 CFR 68.90) requirements.\n\n2. Stationary source and regulated substances handled:\n\nThe regulated substance handled and used at the Lake Murray Water Treatment Plant is chlorine.  The maximum intended inventory of chlorine at the facility at anytime is 24,000 pounds (12 ton containers).\n\nThe Lake Murray Water Treatment Plant provides potable water for residential, retail, and industrial use through out the Greater West Columbia area.  Chlo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39602,
      "SummaryText": "rine is used in the water treatment process to destroy nuisance and pathogenic microorganisms in the raw water supply (i.e., chlorine use as a water supply disinfectant is an industry standard).  The chlorination process includes chlorine container handling and storage facilities, chlorine feed system (vacuum chlorinators, piping, and injectors), and related safety equipment and instrumentation.  The Lake Murray Water Treatment Plant is manned 24-hours a day and access to the plant site is restricted to authorized personnel.\n\n3. Worst-case release scenario and alternative release scenario:\n\nEPA defines the worst-case release scenario as the release of the maximum quantity of a regulated substance from a process vessel or pipeline failure that will result in the greatest distance to the designated endpoint.  The probability of the release occurring is not considered, it is just assumed to happen.  The worst-case chlorine release scenario at the Lake Murray Water Treatment Plant involves a catastrophic failure of a one ton chlorine container and the predicted release of 2,000 pounds of chlorine to the atmosphere.  The plant¿s passive (building enclosure) and active mitigation (chlorine gas scrubber) systems were not considered in this scenario.  The offsite consequence analysis for this scenario was performed following conditions pre-defined by EPA, namely release of the entire amount of chlorine as gas in 10 minutes, chlorine toxic endpoint of 0.0087 mg/l (i.e., the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individuals ability to take protective action), and worst-case weather conditions (i.e., stable atmospheric conditions and a wind speed of 1.5 m/s.  The DEGADIS+ computer model was used to perform this consequence analysis.  The results of the consequence analysis performed"
    }
  ]
}