{
  "FacilityID": 39627,
  "FacilityName": "Nestle Foodservice Div., L.J. Minor Factory",
  "FacilityStr1": "2621 W. 25th Street",
  "FacilityStr2": null,
  "FacilityCity": "Cleveland",
  "FacilityState": "OH",
  "FacilityZipCode": "44113",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39035",
  "LEPC": "Cuyahoga County LEPC",
  "FacilityLatDecDegs": "41.476444",
  "FacilityLongDecDegs": "-081.698750",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.nestle.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Nestle USA",
  "Company2Name": null,
  "CompanyDUNS": 148620792,
  "Company2DUNS": null,
  "OperatorName": "Nestle",
  "OperatorStr1": "2621 W. 25th Street",
  "OperatorStr2": null,
  "OperatorCity": "Cleveland",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44113",
  "OperatorZipCodeExt": null,
  "FTE": 260,
  "OtherEPAFacilityID": "44113ljmnr2621w",
  "EPAFacilityID": "100000076883",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-01-10 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-09-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-08-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-07-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-07-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 41.47642,
  "FRS_Long": -81.69907,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56965,
      "AltID": "Refrigeration System",
      "FacilityID": 39627,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 75238,
          "ProcessID": 56965,
          "ChemicalID": 56,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 58288,
          "ProcessID": 56965,
          "NAICSCode": "31199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 32783,
              "Process_NAICS_ID": 58288,
              "SafetyReviewDate": "2004-01-21 00:00:00",
              "PHA_Date": "2004-12-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "Yes",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-01-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Additonal SOPs/Training & security access controls installed",
              "OpProceduresReviewDate": "2004-02-04 00:00:00",
              "TrainingReviewDate": "2004-01-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-02-04 00:00:00",
              "EquipmentInspectionDate": "2004-06-30 00:00:00",
              "EquipmentTested": "Ammonia detectors, All annual compressors/complete system PM's completed",
              "ChangeMgmtDate": "2000-08-01 00:00:00",
              "ChangeMgmtReviewDate": "2004-01-20 00:00:00",
              "PreStartupReviewDate": "2000-08-01 00:00:00",
              "ComplianceAuditDate": "2004-01-20 00:00:00",
              "AuditCompletionDate": "2004-08-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-01-20 00:00:00",
              "HotWorkPermitReviewDate": "2004-01-20 00:00:00",
              "ContractorSafetyReviewDate": "2004-01-20 00:00:00",
              "ContractorSafetyEvalDate": "2004-01-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 47654,
                  "PreventionProgram3ID": 32783,
                  "ProcessChemicalID": 75238
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 39627,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-01-20 00:00:00",
    "ERTrainingDate": "2004-06-16 00:00:00",
    "CoordinatingAgencyName": "City of Cleveland Fire Department",
    "CoordinatingAgencyPhone": "2166646664",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39627,
      "SummaryText": "The Cleveland plant was purchased by Nestle in 1986 and modified to meet Nestle refrigerated manufacturing standards in 1996. In 1998 additional equipment was installed to increase refrigeration capacity. The facility is located at 2621 W. 25th Street, Cleveland, OH 44109.\nThe facility is primarily a two-story structure of approximately 135,000sq. ft in size.\nThe total number of employees is approximately 230. We are a food manufacturing facility which produces Minor¿sâ bases and flavor/sauce concentrates.\nMinor¿s products are used extensively throughout the country, in fine quality restaurants, healthcare facilities and in hotel & restaurant chains.\n\nThe L. J. Minor factory of the Nestlé USA Foodservices Division located at 2621 West 25th Avenue in Cleveland, Ohio uses an ammonia refrigeration system to preserve and protect raw materials, intermediates and products.  This system has a maximum intended inventory of 12,000 pounds of anhydrous ammonia.  Prior to July of 1998, this system held less than 10,000 pounds which would have exempted it from requirements of both the OSHA Process Safety Management (PSM) Standard (29 CFR Part 1910.119) and the EPA Risk Management Plan (RMP) Rule (40 CFR Part 68).  Every effort has been made to limit the amount of anhydrous ammonia contained within this system so as to minimize the potential impact of catastrophic failures.  Facility process expansions, however, has resulted in present inventory levels.  \n\nThis ammonia refrigeration system consists of:\n\n·\tFive Compressors ¿ three high stage and two booster compressors;\n·\tOne high pressure receiver and one auxiliary high pressure receiver;\n·\tOne controlled pressure receiver;\n·\tOne oil still;\n·\tOne high temperature suction; \n·\tOne low temperature suction with dump trap;\n·\tTwo evaporative condensers ¿ one Frick and one Baltimore Air Coil; \n·\tOne purger; and, \n·\tAncillary equipment, piping and controls.\n\nL. J. Minor management are committed to the prevention of anhydrous ammonia rele"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39627,
      "SummaryText": "ases that have the potential to adversely impact the health and safety of our employees, contractors, visitors and neighbors as well as sensitive receptors and ecosystems adjacent to the L. J. Minor facility.  To this end, L. J. Minor personnel have undertaken policies and procedures that: \n\n·\tEnsures that employees know and understand the hazards of anhydrous ammonia through participation in all aspects of the L. J. Minor Process Safety Management (PSM) program; \n·\tDocuments, maintains and updates all process information relating to the ammonia refrigeration system; \n·\tIdentifies process upsets that could result in an unwanted release of anhydrous ammonia using the Failure Modes and Effects Analysis (FMEA) method for performing a Process Hazards Analysis (PHA).  This PHA resulted in a number of recommendations that, when implemented, will eliminate some potential upsets, minimize the likelihood of occurrence for other potential upsets and reduce the seriousness of consequences for still more potential upsets.\n·\tLimits the potential for human errors that can lead to unwanted releases of anhydrous ammonia.  This is accomplished through the development of written operating procedures which identify potential upsets, alerts system operators to these potential upsets and provides safe methods for avoiding the serious consequences that can result; \n·\tEnsures that contractors working on or near the ammonia refrigeration system are aware of the potential hazards and work responsibly to avoid potential anhydrous ammonia releases; \n·\tEnsure that existing Safe Work Practices for hot work, confined space entry, lockout / tagout and controlling personnel access to the ammonia refrigeration system are adhered to by all employees, contractors and visitors;\n·\tEnsures that safety-critical equipment is inspected and/or tested as required to ensure their continued safe and reliable operation.  Where appropriate, periodic preventive maintenance is performed to ensure the ongoing relia"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39627,
      "SummaryText": "bility of all process equipment; \n·\tReviews any new processes or additions to the existing ammonia refrigeration system to ensure that they can be started up and operated safely; \n·\tManages changes to the ammonia refrigeration system to ensure that they are implemented in a manner that minimizes the potential for unwanted releases of anhydrous ammonia; \n·\tInvestigates all incidents associated with the ammonia refrigeration system so as to learn how they can be avoided in the future; \n·\tEnsures that all employees, contractors, visitors and outside emergency service personnel know what to do in the event of an emergency so as to minimize potential injuries as well as off-site consequences; and,\n·\tPeriodically audits PSM activities so as to ensure that PSM programs undergo continuous improvement.\n\nIn the course of preparing this Risk Management Plan (RMP), a hazard assessment was performed.  This hazard assessment identified and evaluated the potential off-site impacts of a worst case release and an alternative release scenario.  It is important to note that this hazard assessment is a consequence analysis only.  No attempt has been made to determine the potential likelihood of occurrence for the two events.  While the potential consequences for these events may be considered to be severe, their likelihood of occurrence may be very low.  This can moderate the risks associated with a potentially severe event. \n\nOver the last eight years of ammonia refrigeration system operation, there have been no incidents that resulted, or could reasonably have been expected to result, in a catastrophic release of anhydrous ammonia.\n\nThe facility¿s written Emergency Response Plan provides for plant personnel to respond to any release of anhydrous ammonia from the ammonia refrigeration system. Should they determine a need for HazMat response, they would notify a contracted off-site hazardous response team who is available 24hrs, 7 days a week. An Emergency Response Plan has been prepar"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39627,
      "SummaryText": "ed to handle release scenarios that have potential impact on the surrounding community. A community notification plan would be activated if the release could affect the surrounding neighborhood. This plan was prepared in cooperation with our local fire, police and medical officials. \nIf the release expands into the surrounding community, a shelter-in-place plan would go into effect. \n\nAll plant emergency response personnel are identified within the written Emergency Response Plan and receive periodic training to ensure that they know and understand the hazards and how they can be avoided.  Copies of the plant¿s written Emergency Response Plan are provided to the Local Emergency Planning Committee (LEPC), fire department, Lutheran Hospital (1730 W 25th St. Cleveland, OH 44113-3170 - 216/696-4300) and other outside emergency service personnel as needed.\n\nWe at Nestle USA recognize our responsibility as a company to actively address environmental concerns. It is our policy to utilize sound environmental and pollution prevention policies.\nNestle has committed resources to develop design specifications for our ammonia refrigeration systems in accordance with nationally recognized engineering practices to ensure safe operation of these systems. Our refrigeration personnel have been provided with state-of-the-art equipment as well as on-going training to be prepared to respond to accidental releases. Nestle factory personnel work closely with local emergency services to prepare for such events by conducting drills and maintaining close communications.\n\nWe are proud to operate this highly efficient facility in Cleveland, where our employees and families reside."
    }
  ]
}