{
  "FacilityID": 39722,
  "FacilityName": "McCain Foods USA, Inc.",
  "FacilityStr1": "801 Rockwell Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Fort Atkinson",
  "FacilityState": "WI",
  "FacilityZipCode": "53538",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55055",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "42.916667",
  "FacilityLongDecDegs": "-088.847028",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1104736,
  "ParentCompanyName": "McCain Foods, Ltd.",
  "Company2Name": null,
  "CompanyDUNS": 1104736,
  "Company2DUNS": 0,
  "OperatorName": "Rick Pickruhn",
  "OperatorStr1": "801 Rockwell Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Fort Atkinson",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53538",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bruce Bertelsen",
  "RMPTitle": "Plant Engineer",
  "FTE": 350,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000033992",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-17 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-09-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-08-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-08-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 42.91706,
  "FRS_Long": -88.8474,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 57086,
      "AltID": "Frozen Food Manufacturing",
      "FacilityID": 39722,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 58411,
          "ProcessID": 57086,
          "NAICSCode": "31141",
          "_desc": {
            "NAICS_CODE": "31141",
            "NAICS_DESCRIPTION": "Frozen Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 75478,
          "ProcessID": 57086,
          "ChemicalID": 56,
          "Quantity": 17000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 575478,
          "ProcessID": 57086,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39722,
      "SummaryText": "EXECUTIVE SUMMARY\nMCCAIN FOODS USA, INC\nRISK MANAGEMENT PROGRAM REPORT\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICY AT MCCAIN FOODS \nThe objective of the risk management plan (RMP), as stated in part 68 of the Clean Air Act (CAA), is to prevent accidental releases of substances that can cause serious harm to the public and the environment from short-term exposure and to mitigate the severity of releases that do occur. To meet this objective McCain Foods USA, Inc. (McCain Foods) has developed a Hazard Assessment detailing the potential effects of an accidental release; provided an accident history of the last five years; completed an evaluation of worst-case and alternative accidental releases; documented McCain Foods? Prevention Program that includes safety precautions and maintenance, monitoring, and employee training measures; and, developed an outline McCain Foods Emergency Response Program that spells out emergency health care, employee training measures and procedures for informing the public and response agencies (e.g. the fire department) should an accident occur. \n\nMcCain Foods utilizes and stores anhydrous ammonia as a refrigerant, which makes it necessary to observe certain safety precautions during ammonia use to prevent human exposure, reduce the threat to workers? personal health, the surrounding community and the environment.  It is McCain Foods? policy to adhere to all applicable federal and state regulations.  Safety depends directly on the proper handling of ammonia combined with the safety devices that are incorporated in our facility and the safe handling procedures that personnel are trained in.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE HANDLED\nMcCain Foods located at 801 Rockwell Avenue in Fort Atkinson, Wisconsin, is a food product manufacturing facility with approximately 350 employees.  McCain Foods is required to develop and implement a RMP as issued by the U.S. Environmental Protection Agency (EPA), based on exceedence of t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39722,
      "SummaryText": "hreshold quantities for the handling, use, and storage of anhydrous ammonia as listed in 40 CFR 68.130.  McCain Foods? production of frozen foods utilizes anhydrous ammonia as a refrigerant.  \n\nAnhydrous ammonia, readily recognized by its distinctive odor, is a compressed gas with extremely toxic vapors which irritate the eyes and skin. Although classified as non-flammable by the DOT, in confined spaces anhydrous ammonia can accumulate to a flammable concentration and create an explosive environment.\nExposure pathways for anhydrous ammonia include inhalation which may cause irritation, lack of sense of smell, nausea, vomiting, chest pain, difficulty breathing, head ache, lung damage, and long-term inhalation can cause digestive disorders; eyes which causes irritation, frostbite, tearing, blindness, and glaucoma; skin which may cause severe irritation, blisters, and frostbite; and ingestion which may cause irritation, difficulty breathing, and kidney damage. \nInventory of anhydrous ammonia at McCain Foods is equal to 37,633 pounds (lbs.) throughout the entire system which includes the following vessels with associated maximum anhydrous ammonia capacities:  \nOutside High Pressure Receiver ? 13,783 lbs.\nOutside Intercooler ? 11,661 lbs.\nFES Recirculator ? 4,179 lbs.\nRECO ?40 Recirculator ? 3,692 lbs.\nFES Intercooler ? 1,582 lbs.\nVilter Recirulator ? 1,368 lbs.\nRECO ?20 Recirculator ? 1,368 lbs.\n\nPotential hazards that could lead to an accidental release include, but are not limited to, equipment failure, damage to piping, damage to equipment, and human error.    \n \nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe general accidental release prevention program at McCain Foods includes:\n?    Regular completion of a process hazard analysis.\n?    Use of process controls such as vents, relief valves, check valves, manual/automatic shutoff, interlocks, alarms and procedures, backup pump, and purge system.\no    Electronic ammonia detection in machine room, outside in main relief head"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39722,
      "SummaryText": "ers, and on roof by safety relief discharge ventilation.  Audible and flashing alarms are located in both the maintenance and production areas.\no    High-level liquid switches are configured to all pressure vessels which will shut down compressor operation during an abnormal level condition.\no    Safety relief valves are installed on all pressure vessels, condensers and compressor oil separators to eliminate over pressurization conditions in those associated pieces of equipment.\n?    Use of mitigation systems to include sprinkler system, firewalls, enclosure, and wastewater collection.\n?    Periodic Maintenance Program is in place within the maintenance department to ensure all refrigeration components are kept in optimum operating status.  \n?    Training programs and frequent review of these programs.  \n?    Regular compliance audits.  \n\nFIVE-YEAR ACCIDENT HISTORY\n\nMcCain has no accidental releases to report over the last five years.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe purpose of the McCain Foods Emergency Response Program is to:\n\n?    Minimize exposure to employees and the surrounding community in the event of a hazardous material release or spill.\n?    Assure the safe emergency evacuation of the plant in the instance that it is required.\n?    Provide for prompt medical attention to any employees who become seriously injured or ill at work.\n?    Manage an emergency response system and coordinate response of the internal and external resources required to provide efficient and effective response to any type of emergency that may occur at McCain Foods.\n\nMcCain Foods updated their Emergency Action Plan (EAP) as part of the Emergency Response Program in August 2003.  Objective of the EAP is to ensure the safety of all employees of McCain Foods, as established in compliance with 29 CFR 1910.38 of the OSHA General Industry Standards.  McCain Foods has received input from and worked with the Fort Atkinson Fire Department, Jefferson County Local Emergency Planning Committees (LEPC) and State of Wisconsin"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39722,
      "SummaryText": " HAZMAT organizations to ensure compliance in the emergency response areas.  \n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nMcCain Foods conducts a monthly meeting to review ammonia system, document unsafe conditions, and discuss improvements to equipment.  A $30,000 budget is set aside for review of the system and any necessary improvements.  In addition, valves are checked annually and equipment is calibrated every six months, both are conducted by an outside agency."
    }
  ]
}