{
  "FacilityID": 39755,
  "FacilityName": "Sartomer Company, Inc. Houston Facility",
  "FacilityStr1": "17335 Wallisville Road",
  "FacilityStr2": null,
  "FacilityCity": "Houston",
  "FacilityState": "TX",
  "FacilityZipCode": "77049",
  "Facility4DigitZipExt": "5021",
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County/Houston LEPC",
  "FacilityLatDecDegs": "29.824167",
  "FacilityLongDecDegs": "-095.114167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "UN",
  "LatLongDescription": "PG",
  "FacilityURL": "www.sartomer.com",
  "FacilityEmailAddress": "Joann.Cortese@sartomer.com",
  "FacilityDUNS": 361555725,
  "ParentCompanyName": "Total Holdings, USA",
  "Company2Name": null,
  "CompanyDUNS": 37810702,
  "Company2DUNS": null,
  "OperatorName": "Sartomer Company, Inc.",
  "OperatorStr1": "502 Thomas Jones Way",
  "OperatorStr2": null,
  "OperatorCity": "Exton",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19441",
  "OperatorZipCodeExt": null,
  "FTE": 23,
  "OtherEPAFacilityID": "77049ntrsn17335",
  "EPAFacilityID": "100000151998",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-10-07 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-09-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-08-09 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-08-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2015-01-29 00:00:00",
  "DeRegistrationEffectiveDate": "2014-07-31 00:00:00",
  "AnniversaryDate": "2009-05-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 29.82416,
  "FRS_Long": -95.11378,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C02",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 57160,
      "AltID": "Norsolene Process",
      "FacilityID": 39755,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 75650,
          "ProcessID": 57160,
          "ChemicalID": 52,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 75651,
          "ProcessID": 57160,
          "ChemicalID": 138,
          "Quantity": 100000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 58487,
          "ProcessID": 57160,
          "NAICSCode": "32521",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 32898,
              "Process_NAICS_ID": 58487,
              "SafetyReviewDate": "2003-03-01 00:00:00",
              "PHA_Date": "2003-12-04 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-12-02 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "surveillance cameras",
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-05-02 00:00:00",
              "TrainingReviewDate": "2003-07-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Outside Contractor",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-04-03 00:00:00",
              "EquipmentInspectionDate": "2004-05-06 00:00:00",
              "EquipmentTested": "Fire Pump",
              "ChangeMgmtDate": "2004-04-05 00:00:00",
              "ChangeMgmtReviewDate": "2004-01-04 00:00:00",
              "PreStartupReviewDate": "2003-08-14 00:00:00",
              "ComplianceAuditDate": "2001-07-01 00:00:00",
              "AuditCompletionDate": "2003-12-04 00:00:00",
              "IncidentInvestigationDate": "2003-11-20 00:00:00",
              "InvestigationChangeDate": "2003-12-20 00:00:00",
              "ParticipationPlansReviewDate": "2004-02-03 00:00:00",
              "HotWorkPermitReviewDate": "2004-03-04 00:00:00",
              "ContractorSafetyReviewDate": "2004-03-15 00:00:00",
              "ContractorSafetyEvalDate": "2004-01-08 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 47930,
                  "PreventionProgram3ID": 32898,
                  "ProcessChemicalID": 75650
                },
                {
                  "PrimaryKey": 47931,
                  "PreventionProgram3ID": 32898,
                  "ProcessChemicalID": 75651
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 39755,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-10-23 00:00:00",
    "ERTrainingDate": "2003-06-10 00:00:00",
    "CoordinatingAgencyName": "LEPC",
    "CoordinatingAgencyPhone": "7134555372",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39755,
      "SummaryText": "Executive Summary\n\nExecutive Summary for\nSartomer Company, Inc. - Houston Facility\n\n1. Accidental Release Prevention and Emergency Response Policies\nWe at Sartomer Company - Houston Facility are strongly committed to employee, public and environmental safety. This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n2. The Stationary Source and the Regulated Substances Handled\nOur facility's primary activities encompass Norsolene resin manufacturing. Norsolene is an aromatic hydrocarbon resin. We have 2 regulated substances present at our facility. These substances include Boron trifluoride [Borane, trifluoro-] and 1,3-Pentadiene. Boron trifluoride [Borane, trifluoro-] is used as the catalyst for the Norsolene production and is reacted to form less hazardous compounds prior to removal from the resin. 1 ,3-Pentadiene is used as a hydrocarbon feedstock, which is polymerized with other feedstock to form the Norsolene resin.\n\n3. The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\nTo evaluate the worst case scenarios, we have used the look-up tables, RMP*Comp Software and equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance as well as Equations from Appendix D of the EPA's Offsite Consequence Analysis Guidance. For alternative release scenario analyses, we have employed the equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance. \nPassive mitigation controls such as dikes are taken into account to calculate the scenarios.\n\n4. The General Accidental Release Prevention Program and the Chemical-Specific Pre"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39755,
      "SummaryText": "vention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA. The resin process at our facility is subject to the OSHA PSM standard under 29 CFR 1910.119. The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nSartomer Company - Houston Facility maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently. The methodology used to carry out these analyses is HAZOP (Hazard and Operability) and is supplemented with checklists. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval within 5 years. Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Sartomer Company - Houston Facility maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround. The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nSartomer Company - Houston Facility has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. Refresher training is provided at least every 3 years and more frequently as needed.\n\nMechanical Integrity\nSartomer Company - Houston Facility ca"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39755,
      "SummaryText": "rries out highly documented maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices. Furthermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Sartomer Company - Houston Facility to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Sartomer Company - Houston Facility. These reviews are conducted to confirm that construction; equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\t.\n\nCompliance Audits\nSartomer Company - Houston Facility conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nSartomer Company - Houston Facility promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39755,
      "SummaryText": "release from reoccurring. All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nSartomer Company - Houston Facility truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. Sartomer Company - Houston Facility has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n5. 0 Five-year Accident History\nSartomer Company - Houston Facility has had an excellent record of preventing accidental releases over the last 5 years. Due to our stringent release prevention policies, the number of accidental releases was reduced to the minimum.\n\nThere has been no accidental release of regulated substances from our facility within the last 5 years.\n\n6. Emergency Response Plan\nSartomer Company - Houston Facility carries a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the plan is promptly u"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 39755,
      "SummaryText": "pdated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nHarris County is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n7. Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program. The item completion is followed through a continuous safety audit.\n\n8. Certification Statement\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\nName: Signature: Title:\nDate signed:"
    }
  ]
}