{
  "FacilityID": 39805,
  "FacilityName": "SFI - Stephenville Plant",
  "FacilityStr1": "923 County Road 176",
  "FacilityStr2": null,
  "FacilityCity": "Stephenville",
  "FacilityState": "TX",
  "FacilityZipCode": "76401",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48143",
  "LEPC": "Erath County LEPC",
  "FacilityLatDecDegs": "32.262778",
  "FacilityLongDecDegs": "-098.188333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": "jimt@sficorp.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Schreiber Foods, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 2812865,
  "Company2DUNS": 0,
  "OperatorName": "Schreiber Foods, Inc.",
  "OperatorStr1": "425 Pine Street",
  "OperatorStr2": null,
  "OperatorCity": "Green Bay",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54301",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gary Hampel",
  "RMPTitle": "Maintenance Team Advisor",
  "FTE": 119,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000178121",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-01-07 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Stephenville 2004 - Final Sent",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-09-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-08-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-08-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-08-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 32.26167,
  "FRS_Long": -98.18914,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 57227,
      "AltID": "Ammonia for refrigeration",
      "FacilityID": 39805,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 58555,
          "ProcessID": 57227,
          "NAICSCode": "311513",
          "_desc": {
            "NAICS_CODE": "311513",
            "NAICS_DESCRIPTION": "Cheese Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 75730,
          "ProcessID": 57227,
          "ChemicalID": 56,
          "Quantity": 40649.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 575730,
          "ProcessID": 57227,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39805,
      "SummaryText": "Schreiber Foods, Inc. (?SFI?) is a global enterprise and the worlds largest privately held cheese processor. SFI is the nation?s largest supplier of store-brand cheese products to grocery chains and wholesalers.  SFI operates numerous manufacturing/processing facilities throughout the U.S. The SFI ? Stephenville Plant employs approximately 119 people. The SFI plant uses anhydrous ammonia for refrigeration of the products in storage as well as for cooling of manufacturing process lines. Anhydrous ammonia is subject to EPA regulation under 40 CFR 68, Accidental Release Risk Management of Highly Hazardous Chemicals.\n\nPursuant to the RMP regulations (40 CFR 68) and the Process Safety Management (PSM) regulations, SFI has developed a comprehensive PSM written program to protect our employees and the surrounding community from exposure to the hazardous chemicals onsite.  The facility completed an initial process hazards analysis (PHA) for ammonia using the industry standard What-If?/Checklist Analysis developed through the International Institute for Ammonia Refrigeration. The PHA was completed using technical and operations staff from the Stephenville Plant as well as experienced facilitators from an outside consulting firm.  The PHA reviewed operational, human factors, and facility siting issues relative to the design of the refrigeration system, and recommendations were made, as appropriate, to address these concerns.\n\nSFI?s implementation of the PSM program includes employee education in the hazards of ammonia and measures that can be used to reduce employee and community exposure to accidental releases of ammonia. The plans include preventive maintenance programs (mechanical integrity) for the ammonia system, and a program for both pre-startup safety reviews and management of changes (MOC) to the system. The program also includes specific requirements for safe work practices (such as safe approaches to welding and similar hot work) and safety requirements for contrac"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39805,
      "SummaryText": "tors who may be hired to work on the system.  Finally, SFI has undertaken a rigorous approach to PSM compliance auditing.  Findings from the audits are reported to the facility, which then must correct the findings and provide written documentation of resolution of the findings to SFI?s Safety Director. \n\nLastly, the PSM written program incorporates the Plant?s emergency response plan and places special emphasis on handling accidental releases of hazardous chemicals and coordination of emergency response with local fire departments and other emergency response organizations.  Many of SFI?s refrigeration and maintenance personnel have completed 24-hour HAZWOPER HAZMAT technician level training program.  This training emphasized topics such as classification systems and hazards identification; ammonia spill control and containment; respiratory protection; air monitoring instrumentation; proper personal protective equipment; medical monitoring; and proper termination procedures for emergency response activities.  The facility conducts annual HAZWOPER refresher training to keep employees current and comfortable with their responsibilities under the plan using classroom discussion and response to mock emergency scenarios. The facility also conducts quarterly drills during which the emergency response team practices implementation of the incident command system to respond to mock emergency situations.\n\nAs part of the RMP requirements, SFI undertook a review of the potential offsite consequences of the accidental release of the largest vessel in the systems.  Although such a release is highly unlikely, the regulation requires this review.  \n\nAmmonia Refrigeration\n\nSFI stores and uses anhydrous ammonia on site for refrigeration of products in storage as well as for cooling of manufacturing process lines.  Ammonia is used for its excellent energy efficiency and flexibility, in addition to benefits to employee safety.  Ammonia at the facility is kept entirely within the refri"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39805,
      "SummaryText": "geration system, much as the refrigerant in your car air-conditioner.  The SFI ? Stephenville Plant has never experienced a release of ammonia involving consequences that affected residents or the environment.\n\nSFI is committed to minimizing accidental releases of ammonia from the refrigeration process at the Stephenville Plant.  Facility management is involved in the design, operation, and maintenance of the system.  SFI employees at all levels have been involved in the development of the PSM and RMP programs.  Management has committed to working with local agencies and the community to educate the public regarding the hazards of ammonia and to ensure a safe workplace and surrounding community"
    }
  ]
}