{
  "FacilityID": 39854,
  "FacilityName": "Albertson's Ft. Worth DC No. 8290",
  "FacilityStr1": "7550 Oak Grove Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Ft. Worth",
  "FacilityState": "TX",
  "FacilityZipCode": "76140",
  "Facility4DigitZipExt": "6000",
  "FacilityCountyFIPS": "48439",
  "LEPC": "Tarrant County LEPC",
  "FacilityLatDecDegs": "32.639447",
  "FacilityLongDecDegs": "-097.310280",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "www.albertsons.com",
  "FacilityEmailAddress": "cs_online@albertsons.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Albertson's, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6927180,
  "Company2DUNS": 0,
  "OperatorName": "Albertson's, Inc.",
  "OperatorStr1": "7550 Oak Grove Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Ft. Worth",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76140",
  "OperatorZipCodeExt": "6000",
  "RMPContact": "Don Oper",
  "RMPTitle": "General Manager",
  "FTE": 600,
  "OtherEPAFacilityID": "TXD988049631",
  "EPAFacilityID": "100000119418",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-11-18 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-09-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-08-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-08-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 32.64319,
  "FRS_Long": -97.30449,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 57302,
      "AltID": "FWDC#8290",
      "FacilityID": 39854,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 58630,
          "ProcessID": 57302,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 75814,
          "ProcessID": 57302,
          "ChemicalID": 56,
          "Quantity": 43300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 575814,
          "ProcessID": 57302,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39854,
      "SummaryText": "Albertson's, Inc. is a nationwide retailer of grocery products, having stores across the United States.  Albertson's, Inc. retail grocery stores throughout Texas and the Southwest are supplied by Distribution Center #8290 located at 7550 Oak Grove Road, Fort Worth, Texas, 76140.  The Ft. Worth Distribution Center employs approximately 600 people.  The facility operates 24-hours per day, 7-days per week, 52-weeks per year.  The highest occupancy occurs Monday-Friday from 7:00 am to 5:00 pm.\n\nThe system described in this submittal is the anhydrous ammonia refrigeration system utilized in the warehousing of frozen and perishable food products at the Fort Worth, Texas location.  40 CFR 68.130 lists anhydrous ammonia as a Hazardous Chemical subject to regulation with a threshold quantity of 10,000 pounds.  The purpose of this submittal is to provide a five-year update to the facility's Risk Management Program dated June 15, 1999, as required by the Accidental Release Risk Management of Highly Hazardous Chemicals rule, as stated in 40 CFR 68.\n\nThe nominal refrigeration system charge is approximately 43,980 pounds of anhydrous ammonia.  Ammonia is recirculated in the system as a liquid and gas depending on system operating pressures and temperatures.  The design and construction of the system is in accordance with the applicable guidelines and recommendations of the American Society of Mechanical Engineers (ASME), the American National Standards Institute (ANSI), the International Institute of Ammonia Refrigeration (IIAR), the American Society of Heating, Refrigerating, and Air-conditioning Engineers, Inc. (ASHRAE), and the Occupational Safety and Health Administration (OSHA).  \n\nAnhydrous ammonia has been safely used in the United States and worldwide as an efficient refrigerant for decades.  Design, maintenance, repair, and operation of the system are conducted in accordance with OSHA regulation 29 CFR 1910.119 (Process Safety Management of Highly Hazardous Chemicals).  "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39854,
      "SummaryText": "The system is continuously monitored and inspected by technicians who are qualified and trained in accordance with the requirements of the facility's Process Safety Management Program.  These operators continuously monitor the system for any indication of leaks or equipment problems by daily visual inspections, a process control system and permanent, continuous ammonia detectors capable of distinguishing the presence of ammonia in the atmosphere at levels protective of employee health and safety.  Any indication of deviation from process set points or leaks would result in the immediate isolation of the problem area from the remainder of the system and prompt repair.  In the event that a leak should occur in the system in spite of precautions taken, the ammonia detectors will sound an alarm to alert the operators.  The system is equipped with redundant controls to assure that the system operates safely.\n\nThe facility's Process Safety Management Program includes employee information and training, process hazard analyses, management of change, pre-startup safety reviews for system changes or additions, and safe work practices.  Contractors working on the system are pre-qualified based on safety performance.  \n\nAlbertson's, Inc. is currently reviewing and updating the company's Process Safety Management Program.\n\nMajor modifications designed to improve the safety and integrity of the Ft. Worth refrigeration system were completed in March 2004.  Ammonia detection systems, upgraded equipment and controls, and system operating parameter-monitoring provisions are among the changes made.\n\nAlbertson's, Inc. has implemented an Emergency Response Plan to be followed in the unlikely event of an accident or release.  This Emergency Response Plan describes the notification protocol to be used in the event of an ammonia release.  The notifications in the event of a sudden release of over 100 lbs of ammonia would include the local fire department, the Tarrant County Local Emergency"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39854,
      "SummaryText": " Planning Committee (LEPC), the State Emergency Response Commission, and the National Response Center.  The Ft. Worth Fire Department and the Tarrant County LEPC are provided with copies of the Emergency Response Plan.  Facility personnel have been trained to respond to incidental releases that may occur in the system and to provide technical support to the Fort Worth Fire Department in the event of an emergency release of ammonia from the system.\n\nThe facility has made arrangements with the local fire department to respond to emergencies involving ammonia.  The facility conducts periodic incident response drills.  The facility has never experienced an ammonia release that resulted in employee, contractor or off-site injuries, or offsite evacuation or sheltering in place.\n\nAlbertson's, Inc. has complied with the requirements of Section 302 and 303 of the Emergency Planning and Community Right to Know Act (EPCRA) by notifying the State Emergency Response Commission (SERC), the Local Emergency Planning Committee (LEPC), and the Fire Department of the presence of ammonia at the site above threshold planning quantities (TPQ).  The facility files a Tier 2 Chemical Inventory each year with the SERC, LEPC and the Fire Department as required by sections 311 and 312 of EPCRA."
    }
  ]
}