{
  "FacilityID": 39924,
  "FacilityName": "ACE Cogeneration Facility",
  "FacilityStr1": "12801 S Mariposa Street",
  "FacilityStr2": null,
  "FacilityCity": "Trona",
  "FacilityState": "CA",
  "FacilityZipCode": "93592",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06071",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "35.759722",
  "FacilityLongDecDegs": "-117.381944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 603222522,
  "ParentCompanyName": "ACE Cogeneration Company",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "ACE Cogeneration Company",
  "OperatorStr1": "12801 S Mariposa Street",
  "OperatorStr2": null,
  "OperatorCity": "Trona",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93592",
  "OperatorZipCodeExt": null,
  "FTE": 31,
  "OtherEPAFacilityID": "CAD982498271",
  "EPAFacilityID": "100000157215",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "50001051",
  "SafetyInspectionDate": "2001-04-25 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-09-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-08-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-08-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2015-09-25 00:00:00",
  "DeRegistrationEffectiveDate": "2015-08-01 00:00:00",
  "AnniversaryDate": "2009-08-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 35.7655,
  "FRS_Long": -117.3821,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 57386,
      "AltID": "Cogeneration",
      "FacilityID": 39924,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 75923,
          "ProcessID": 57386,
          "ChemicalID": 56,
          "Quantity": 61000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 58715,
          "ProcessID": 57386,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 33056,
              "Process_NAICS_ID": 58715,
              "SafetyReviewDate": "2004-04-01 00:00:00",
              "PHA_Date": "2003-12-31 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-01-29 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Backup Vaporizer",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Canopy",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-10-10 00:00:00",
              "TrainingReviewDate": "2003-12-23 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-01-29 00:00:00",
              "EquipmentInspectionDate": "2002-05-02 00:00:00",
              "EquipmentTested": "Ammonia regulator and check valve",
              "ChangeMgmtDate": "2004-04-20 00:00:00",
              "ChangeMgmtReviewDate": "2002-01-29 00:00:00",
              "PreStartupReviewDate": "2002-01-29 00:00:00",
              "ComplianceAuditDate": "2002-01-29 00:00:00",
              "AuditCompletionDate": "2003-12-31 00:00:00",
              "IncidentInvestigationDate": "1995-10-03 00:00:00",
              "InvestigationChangeDate": "1998-07-31 00:00:00",
              "ParticipationPlansReviewDate": "2003-12-23 00:00:00",
              "HotWorkPermitReviewDate": "2003-03-19 00:00:00",
              "ContractorSafetyReviewDate": "2002-01-29 00:00:00",
              "ContractorSafetyEvalDate": "2003-06-23 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 48131,
                  "PreventionProgram3ID": 33056,
                  "ProcessChemicalID": 75923
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 39924,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-12-23 00:00:00",
    "ERTrainingDate": "2003-12-23 00:00:00",
    "CoordinatingAgencyName": "San Benardino County Fire Dept",
    "CoordinatingAgencyPhone": "9093874631",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 39924,
      "SummaryText": "in compliance with applicable laws, regulations, industry standards and \n  guidelines.  \n· Activities will be managed to protect people and property and to control ACE Cogeneration Company's \n  liabilities.\n· ACE Cogeneration Company's Management Committee and secondary employees will be individually and \n  collectively accountable for the execution of the EH&S Policy.\n· EH&S goals will be achieved through the prudent use of resources, and through communication, \n  education, proactive management, assessment and action.\n\nRelative to compliance with the RMP program, ACE has a ten-year history of successful compliance with the California Risk Management Prevention Plan (RMPP) and the OSHA PSM program.  Successful compliance has been a result of adherence to the above programs and future compliance is anticipated based on this formula.\n\nFACILITY AND REGULATED SUBSTANCES\n\nACE owns a 118-megawatt (gross), coal-fired, circulating fluidized bed, cogeneration facility, referred to as the ACE Cogeneration Facility, in northwestern San Bernardino County. ACE began operation in 1990.  Trona Operting Partners personnel, under an Operation and Maintenance Agreement, perform the day-to-day operation.  ACE provides steam Searles Valley Minerals Company.\n\nAmmonia is used to reduce the nitrogen oxide emissions, which improves air quality.  The emissions control operations include storage and handling up to 10,320 of anhydrous ammonia, a substance that the Environmental Protection Agency (EPA) has identified as an acutely hazardous material.  The Federal and State of California governments have established a program for reducing the hazards associated with the storage and handling of such materials.  The program was initiated by the Clean Air Act Amendments of 1990, Title III, Section 112® and codified in 40CFR Part 68.  The California Accidental Release Program (CalARP) pursuant to Sections 25531 through 25543.3 of the Health and Safety Code has additional regulations.  As part of t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39924,
      "SummaryText": "analysis required under the Risk Management Program rule published by the Environmental Protection Agency on July 20, 1996, and amended in 2004 which implements Section 112® of the Clean Air Act.  Both the OCA Guidance and RMP*Comp are available to the public and can be downloaded from the EPA's Chemical Emergency Preparedness and Prevention Office web site at http://www.epa.gov/ceppo.  \n\nWorst Case Release Scenario\n\nCatastrophic release of ammonia from the storage tank.  This scenario could result from a number of potential accidents.  While none of the accidents leading to this release were of high frequency, it was judged the most credible worst case.  \n\nAlternative Release Scenario\n\nRelease of the entire ammonia contents of the tank through an ammonia line pipe sheared near the tank.  This scenario corresponds to a high flow scenario.\n\nEVALUATION OF RISK\n\nThe most significant impact from an ammonia release would occur at the ACE Cogeneration Facility.  Anyone working outside within a few hundred yards of the release would be exposed to the highest concentrations for the worst-case scenario.  Personnel located inside buildings would be at less risk, since ammonia would enter these areas at a rate dependent on building ventilation rates.\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nACE complies with both the Federal/State RMP requirements, and OSHA's Process Safety Management (PSM) Program (Section 1910.119 of Title 29 of CFR or Section 5189 of Title 8 of CCR).  Many parts of the PSM standards have been incorporated into the RMP regulations.  \n\nACE has employed engineering and administrative controls to reduce frequency and severity of ammonia releases. \n\nEngineering and Administrative Controls\n\nEngineering controls include equipment compatible with anhydrous ammonia, ammonia sensors, relief valves, check valves, manual and automatic shutoffs, interlocks, alarms and procedures, emergency air supply, emergency power, an"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 39924,
      "SummaryText": "d grounding equipment.  Mitigation systems include dikes, a deluge system and a canopy.\n\nAdministrative controls include: health and safety and process training for all employees, contractors and visitors, procedures for different aspects of operation, record keeping, proper installation of equipment, regular inspection, ammonia truck off-loading procedures, storage tank/system operation procedures, ammonia injection procedures, repair and maintenance for all equipment using anhydrous ammonia.  Plant personnel supervise the delivery and off-loading of ammonia.\n\nTHE FIVE-YEAR ACCIDENT HISTORY\n\nThere have been no incidents at ACE during the last 5 years.  \n\n\n\nTHE EMERGENCY RESPONSE PROGRAM\n\nACE has coordinated with the San Bernardino County Fire Department, the local emergency responders.  ACE personnel are trained to report all releases to local emergency responders and to follow instructions from the responders.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nNo changes are planned."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39924,
      "SummaryText": "his program, ACE is required to prepare a Risk Management Plan (RMP) for its anhydrous ammonia storage and handling facilities.  In an RMP, a facility reviews its processes, equipment and procedures in order to identify steps that could reduce the likelihood or consequences of a release of an acutely hazardous material.  ACE requested the assistance of AVES, an affiliate of ATC Associates, Inc. (AVES) in preparing the RMP.\n\nTHE WORST-CASE RELEASE SCENARIO AND THE ALTERNATE RELEASE SCENARIO\n\nAn RMP must consider the results of the following:\n\n1. A hazard and operability study that identifies the hazards associated with handling an AHM due to \n    operating error, equipment failure, and external events that may present a risk of an accident an AHM.\n \n2. An off-site consequence analysis that assumes pessimistic air dispersion parameters, and other \n    adverse environmental conditions for the worst case scenario and an alternative release scenario.\n\n\nThe off-site consequence analysis (OCA) requires analysis of two release scenarios: worst-case and an alternate release scenario.  The worst-case release scenario, according to the RMP Requirements, must consider a release that empties the content of the ammonia system in a ten-minute period. This scenario does not take into account whether or not the release is probable.  The alternative release scenario is designed to investigate the worst-case release that could happen within the lifetime of the facility. This scenario takes into account the combination of frequency and severity.\n\nThe maximum capacity of the ammonia storage tank is 12,000 gallons.  Written operating procedures and a high-level alarm prevent more than 10,320 gallons from being present in the 12,000-gallon tank, or 86 percent level by volume. \n\nBoth the worst-case and alternate release scenarios were completed according to the EPA's OCA Guidance with RMP*Comp.  RMP*Comp is an electronic air dispersion modeling tool used to perform the off-site consequence"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 39924,
      "SummaryText": "INTRODUCTION\n\nACE Cogeneration Company (ACE) is required to comply with Section 112® of the Clean Air Act, which requires facilities with acutely hazardous materials or flammable materials over the regulatory threshold to prepare a Risk Management Plan (RMP).  ACE stores up to 10,320 gallons (60,800 pounds) of anhydrous ammonia, an acutely hazardous material on site at any given time.  This amount is over the 10,000-pound threshold.\n\nACE originally prepared a Risk Management and Prevention Program (RMPP) in 1991 pursuant to California regulations and has complied with OSHA's Process Safety Management (PSM) program.  Both of these programs are similar in most respects to the Clean Air Act RMP program.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY POLICIES\n\nACE has a commitment to environmental compliance.  In addition to environmental, health and safety (EH&S) policies and principles, ACE has also instituted a compliance assurance plan (CAP).  The CAP is a living compliance management document developed from the Federal Sentencing Guidelines and ISO 140001 elements.  Through a system of schedules, monitoring regulatory requirements, audits, training, incentive/discipline programs, and record keeping, ACE ensures compliance and continuous improvement.\n\nThe ACE Cogeneration Company Environmental Policy Statement:\n\nACE Cogeneration Company's Environmental Policy is to conduct business in a manner that is lawful, compatible with the environment and conductive to the health and safety of employees, facilities and the community.\n\nACE Cogeneration Company Health and Safety Policy Statement:\n\nThe ACE Cogeneration Company's Health and Safety Policy is to conduct business in a manner that is lawful and promotes the health and safety of employees, contractors, visitors and the community.\n\nEnvironmental, Health, and Safety Principles:\n\nACE Cogeneration Company will conduct business consistent with the EH&S Policy and the following EH&S Principles:\n\n· Activities will be conducted"
    }
  ]
}