{
  "FacilityID": 4014,
  "FacilityName": "Bluffton Water Department Filtration Plant",
  "FacilityStr1": "900 Compromise Lane",
  "FacilityStr2": null,
  "FacilityCity": "Bluffton",
  "FacilityState": "IN",
  "FacilityZipCode": "46714",
  "Facility4DigitZipExt": "2015",
  "FacilityCountyFIPS": "18179",
  "LEPC": "Wells County LEPC",
  "FacilityLatDecDegs": "40.738611",
  "FacilityLongDecDegs": "-85.154444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "utilities@parlorcity.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Bluffton",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Bluffton Utilities",
  "OperatorStr1": "Water Department",
  "OperatorStr2": "128 East Market Street",
  "OperatorCity": "Bluffton",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46714",
  "OperatorZipCodeExt": "2015",
  "RMPContact": "Edward Davis",
  "RMPTitle": "Water Superintendent",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000049404",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-23 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-06-18 00:00:00",
  "DeRegistrationEffectiveDate": "2004-06-21 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 40.73831,
  "FRS_Long": -85.15621,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4662,
      "AltID": "Water Chlorinatio",
      "FacilityID": 4014,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4766,
          "ProcessID": 4662,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4978,
          "ProcessID": 4662,
          "ChemicalID": 62,
          "Quantity": 3000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504978,
          "ProcessID": 4662,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4014,
      "SummaryText": "BLUFFTON WATER DEPARTMENT FILTRATION PLANT\n\nRISK MANAGEMENT PLAN\n\nEXECUTIVE SUMMARY\n\n\n    The operation of the Water Filtration Plant by its very nature of providing pure drinking water to the Bluffton community, places a high priority on the control and safety in the procurement, storage and use of chemicals.\n    The City's municipal policies incorporate a comprehensive approach and enforcement of all areas where safety is a concern regardless whether it is with machinery, chemicals, or personal safety.\n    The Bluffton Board of Public Works and Safety's commitment to safety and implementation of safe procedures are assisted by inspection of the City facilities for unsafe situations, violations and improving safety in operations.  These inspections are performed not only by the local safety committee, but also  by the local Fire Department Hazard and Emergency section and the City's insurance carriers and underwriters.\n    The Water Filtration Plant purification processes are a coordination of individual processes, that takes water from a rust, hard limestone water source and produces a rust free, reduced hardness and safe drinking water for the City of Bluffton.\n    These water purification (cleaning) processes are primarily:  aeration for removal of the entrained gases, such as hydrogen dioxide and carbon dioxide; coagulation, flocculation and sedimentation (clarification) for the reduction of iron, manganese and mineral hardness; filtration for the finishing (polishing); disinfection for the final purification against any possible pathogenic bacteria.    The disinfection process requires a ready available supply of chlorine.  This supply is restricted to one ton containers.  The amount of chlorine in use and in storage is usually one and one-half tons, with the maximum of two tons.\n    The worst case release and alternative release modeling scenarios were based on EPA'S RMP* COMP Model.  The EPA models indicate there could be releases with off-site impact.  The preliminary exami"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4014,
      "SummaryText": "nation of the chlorine cylinders, their pressure plugs and connections valves before acceptance by the Filtration Plant personnel greatly reduces the possibility of the use of chlorine cylinders with potential release problems.  The enclosed chlorine cylinder storage is a planned passive mitigation feature to contain chlorine releases.  The chlorine supply lines from the chlorine cylinders to the chlorination equipment are operated under vacuum conditions with the chlorine supply regulator directly attached to the chlorine cylinder valve.  The supply regulator will not allow chlorine to leave the cylinder unless there is a vacuum in the supply line from the chlorine cylinder to the chlorination equipment.   As a result there are no chlorine pressure supply lines or manifolds.  Under the above conditions, a release in unlikely.\n    Accidental release prevention in regards to chlorine, the Water Filtration Plant operates under the OSHA RMP rules for analyzing possible risks, formulation and reviewing prevention and training programs. \n    The practice of reviewing the Plan's prevention programs in the light of developing technologies in materials, equipment, safety products and management, identify areas of possible improvements in operation processes, equipment maintenance and employee training.\n    There have been no accidental releases of chlorine at the Bluffton Water Filtration Plant during the past five years.\n    The Water Filtration Plant's chlorine emergency response involves the active coordination of the individual emergency plans of the Wells County Emergency Plan Committee, City of Bluffton Fire Department HAZMAT team and the Bluffton Water Department's Emergency contingency Plan, which includes the training and drilling for the responders, both individually and collectively.\n    The public notification and alerts for all emergency responses are organized to be performed in accordance with the criteria set up in the Wells County Emergency Committee Plan and are subject "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4014,
      "SummaryText": "to periodic review and updating by the Committee and groups of jurisdiction."
    }
  ]
}