{
  "FacilityID": 40376,
  "FacilityName": "Wawa Inc. Dairy, Warehouse, & Distribution Center",
  "FacilityStr1": "1393 W. Baltimore Pike",
  "FacilityStr2": null,
  "FacilityCity": "Wawa",
  "FacilityState": "PA",
  "FacilityZipCode": "19063",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42045",
  "LEPC": "Delaware County LEPC",
  "FacilityLatDecDegs": "39.905833",
  "FacilityLongDecDegs": "-075.455833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.wawa.com",
  "FacilityEmailAddress": "patrick.p.oconnell@wawa.com",
  "FacilityDUNS": 2284958,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Howard Stoeckel",
  "OperatorStr1": "260 West Baltimore Pike",
  "OperatorStr2": null,
  "OperatorCity": "Wawa",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19063",
  "OperatorZipCodeExt": null,
  "FTE": 350,
  "OtherEPAFacilityID": "06819",
  "EPAFacilityID": "100000147753",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "519973",
  "SafetyInspectionDate": "2006-11-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-09-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-09-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-09-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-09-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.3",
  "FRS_Lat": 39.90825,
  "FRS_Long": -75.4515,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 58020,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 40376,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 76676,
          "ProcessID": 58020,
          "ChemicalID": 56,
          "Quantity": 22500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 59362,
          "ProcessID": 58020,
          "NAICSCode": "31151",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 33470,
              "Process_NAICS_ID": 59362,
              "SafetyReviewDate": "2004-04-15 00:00:00",
              "PHA_Date": "2004-06-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-04-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-04-15 00:00:00",
              "TrainingReviewDate": "2004-04-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-04-15 00:00:00",
              "EquipmentInspectionDate": "2004-05-30 00:00:00",
              "EquipmentTested": "Silos, external valve stations, condensers, etc..  In addition, a visual and documented inspection of the entire refrigeration system is completed on a monthly basis.",
              "ChangeMgmtDate": "2004-03-02 00:00:00",
              "ChangeMgmtReviewDate": "2002-09-01 00:00:00",
              "PreStartupReviewDate": "2004-06-01 00:00:00",
              "ComplianceAuditDate": "2001-11-09 00:00:00",
              "AuditCompletionDate": "2003-01-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": "2003-06-01 00:00:00",
              "ParticipationPlansReviewDate": "2002-11-01 00:00:00",
              "HotWorkPermitReviewDate": "2003-01-13 00:00:00",
              "ContractorSafetyReviewDate": "2004-04-30 00:00:00",
              "ContractorSafetyEvalDate": "2004-02-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 48632,
                  "PreventionProgram3ID": 33470,
                  "ProcessChemicalID": 76676
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 40376,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-05-01 00:00:00",
    "ERTrainingDate": "2004-05-28 00:00:00",
    "CoordinatingAgencyName": "Middletown Township",
    "CoordinatingAgencyPhone": "6105652700",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 40376,
      "SummaryText": "using procedures that follow recognized and accepted good engineering practices.  \n·\tDWD fully evaluates changes to the ammonia refrigeration system to fully assess their impact to associate, community, and environmental safety and to determine needed changes to operating procedures.  The management of change program requires a four-step process: initiation, pre-modification checklist, pre-startup safety review, and a final sign-off.  \n·\tPre-Startup Safety Review¿s are conducted to ensure new and modified equipment is ready and safe for startup.  The Pre-Startup Safety Review confirms construction and equipment is designed in accordance with specifications, safety, operating, and maintenance procedures are in place and adequate, a process hazard analysis was performed and recommendations were resolved before startup, and training was conducted.\n·\tHot work permits are issued for hot work operations conducted on or near the ammonia refrigeration system.  The permit documents that the fire prevention and protection requirements have been implemented prior to the initiation of hot work operations.  \n·\tA team of associates investigates every incident that results in or could have reasonably resulted in a catastrophic release.  The team establishes the root cause of the incident and identifies corrective actions to prevent the incident from occurring again.  \n·\tCompliance audits are conducted every three years by a third-party consultant in order to verify procedures and practices developed under the standard are adequate, accurate, and implemented.  Any documented deficiency is tracked to completion.  \n·\tEmergency planning and training is conducted to make associates aware of their roles and responsibilities to ensure the proper execution of the procedures.  In addition to in-house training and planning we work closely with the local emergency planning commission, our local emergency responders, and our contracted hazardous clean-up agency.  \nAs we progress, our goal is"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 40376,
      "SummaryText": "to increase participation on the ammonia refrigeration team.  We will provide training to additional associates and continue to keep our management abreast of new refrigeration technology and equipment.  Furthermore, we are planning to continue our relationship with local emergency responders and the community."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 40376,
      "SummaryText": "Executive Summary for the Wawa Dairy, Warehouse, and Distribution Center¿s Ammonia Refrigeration System\n\nThe Wawa Dairy, Warehouse & Distribution Center (DWD) is located along US Route 1 in Wawa, Delaware County, Pennsylvania.  Wawa¿s Dairy, Warehouse, and Distribution center is committed to the safe operation of our ammonia refrigeration system.  The system was designed and is maintained in accordance with:\n-\tThe American National Standard for Equipment, Design, and Installation of Ammonia Mechanical Refrigeration Systems,\n-\tThe American National Standard: Safety Code for Mechanical Refrigeration,\n-\tInternational Institute of Ammonia Refrigeration (IIAE) Minimum Safety Criteria for a Safe Ammonia Refrigeration System,\n-\tGuidelines for Ammonia Machinery Room Ventilation,\n-\tGuidelines for Identification of Ammonia Refrigeration Piping and System Components.\nFurthermore, senior management provides the resources and support necessary to maintain a safe system and ensure appropriate training.  The corporate safety policy is to operate an accident-free environment by performing all our work in the safest possible manner. Management is responsible for preventing injuries and every individual Associate is responsible for following safe work practices.\nThe ammonia system refrigerates our dairy building and automated storage & retrieval system (ASRS).  The facility processes over 700,000 gallons of milk, juices and teas primarily for the Wawa convenience stores.   Raw product is pasteurized and bottled in the Dairy and the finished product is warehoused in the ASRS building and then loaded onto our trucks and shipped out to the stores.  \n\tThe anhydrous ammonia refrigeration system consists of a single stage system that operates at approximately +10°F (23.8 psig) suction and provides glycol chilling for process cooling, milk cooler automated storage and retrieval area cooling, and cooling of various tanks and silos.  The refrigeration system contains 6 compressors, 4 evaporat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 40376,
      "SummaryText": "ive condensers, 1 auto purger, 1 combined thermosyphon/high pressure receiver, 1 pump receiver package, 1 transfer unit, 13 evaporators (air handling units), 5 evaporators (DX air units), 17 storage silos, and 2 glycol chillers.  \nThe worst-case scenario release for our facility would be a 22,500 lb ammonia release that would span approximately 1.9 miles.  The release rate would be approximately 2,250 lbs per minute and would affect approximately 8,500 people.  We incorporated various safeties into our system to minimize the potential for such a release; these safeties include ammonia sensors, emergency stop buttons, and ventilation system.  In addition, we added two additional safeties to our silos.  The first safety is a 75 lb pressure valve that relieves into the suction header if the back pressure valve fails.  The second safety is a 100lb factory set pressure switch that will shut down the Clean-in-place (CIP) system if the refrigeration system reaches the set point.  The CIP operator will receive a message on the Sierberling computer system if the 100lb setpoint is reached. \nOver the past five years we focused on maintaining compliance with the OSHA Process Safety Management Regulations.  We formed a team consisting of management, front-line associates, and environmental health and safety professionals to focus on compliance with the regulatory requirements.  The team meets on a routine basis to update programs, review proposed changes and modification, and address safety issues and concerns.   \n·\tDWD developed a program to implement associate participation into process safety management policy development and implementation.  Associates (Management and Front-line) are consulted on the development and maintenance of all aspects of the PSM program.  Furthermore, all information with regards to the ammonia refrigeration system (prints, policies, etc.) is available to associates and emergency responders.\n·\tProcess Hazard Analyses are conducted to identify, evalua"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 40376,
      "SummaryText": "te, and control the hazards associated with the ammonia refrigeration process.  A team of associates with expertise in engineering and process operations, knowledge of processes being evaluated and knowledge of the specific analysis methods utilized perform the PHA updates/reviews.  PHA reviews are conducted in compliance with the Management of Change program.  The most recent PHA review was performed on 04/16/04 and all issues were tracked to completion.\n·\tThe PSM Team developed and implemented standard operating procedures that provide clear instructions for safely conducting activities regarding the ammonia refrigeration system.  The procedures include steps for each operating phase, operating limits, and safety and health considerations.  The team reviews the Standard Operating Procedures annually.  In addition, the SOPs are reviewed in coordination with the management of change program.\n·\tDWD implemented a training program that exceeds regulatory requirements.  All associates receive an overview of the system and process safety management program, as well as, annual evacuation training.  Furthermore, our ammonia refrigeration mechanics receive the three-year training, but also receive additional training when warranted or requested.  We recently completed an extensive three-day training with our ammonia refrigeration mechanics.    \n·\tIn order to protect associates, the community, and the environment, DWD maintains strict controls over the work practices of all vendors and contractors.  The program incorporates pre- and post-bid activities, orientation, and additional requirements to ensure compliance with applicable standard and policies.  \n·\tDWD established and implemented written procedures to maintain the ongoing integrity of the process equipment.  Associates involved in maintaining the ongoing integrity of process equipment have been trained in the procedures applicable to the associate¿s job task.  Inspection and testing is performed on process equipment,"
    }
  ]
}