{
  "FacilityID": 4072,
  "FacilityName": "Simpson Timber Company, Oregon Overlays Division",
  "FacilityStr1": "2301 N Columbia Blvd",
  "FacilityStr2": "PO Box 17307",
  "FacilityCity": "Portland",
  "FacilityState": "OR",
  "FacilityZipCode": "97217",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41051",
  "LEPC": "ECHO - Portland, OR",
  "FacilityLatDecDegs": "45.587778",
  "FacilityLongDecDegs": "-122.689444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": "None",
  "FacilityEmailAddress": "lgill@smpsn.com",
  "FacilityDUNS": 9056045,
  "ParentCompanyName": "Simpson Investment Company",
  "Company2Name": null,
  "CompanyDUNS": 151464633,
  "Company2DUNS": 0,
  "OperatorName": "Simpson Investment Company",
  "OperatorStr1": "2301 N Columbia Blvd",
  "OperatorStr2": "PO Box 17307",
  "OperatorCity": "Portland",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97217",
  "OperatorZipCodeExt": null,
  "RMPContact": "Larry Gill",
  "RMPTitle": "Safety Health and Environmental Mgr",
  "FTE": 100,
  "OtherEPAFacilityID": "97217RGNVR2301N",
  "EPAFacilityID": "100000050605",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "26-3009",
  "SafetyInspectionDate": "1999-05-21 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 45.5867,
  "FRS_Long": -122.69,
  "FRS_Description": null,
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4726,
      "AltID": "Overlay Manufacturing",
      "FacilityID": 4072,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4832,
          "ProcessID": 4726,
          "NAICSCode": "322222",
          "_desc": {
            "NAICS_CODE": "322222",
            "NAICS_DESCRIPTION": "Coated and Laminated Paper Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5054,
          "ProcessID": 4726,
          "ChemicalID": 1,
          "Quantity": 340000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505054,
          "ProcessID": 4726,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4072,
      "SummaryText": "SIMPSON TIMBER CO.\nOregon Overlays Division\n\nRISK MANAGEMENT PLAN\nExecutive Summary\n\n1. Corporate Policies\n\nWe at Simpson Timber Company are strongly committed to employee, public and environmental safety.  This commitment is inherent to the comprehensive accidental release prevention program that we have in place for our facility.  This program covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances from our operations.   As a result of our adherence to these policies, our operation has no accident history to report in this plan. \n\n\n2. The Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities encompass manufacturing of phenolic resin and phenolic overlays.  We store and use only one regulated substance (formaldehyde solution) at our facility.  The formaldehyde solution is a 50% (by weight) solution of formaldehyde in water and is used as a raw material to manufacture phenolic resins and glues.\n\nThe maximum inventory of formaldehyde solution at our facility is currently 340,000 lbs.  The average inventory is approximately 180,000 lbs.\n\n\n3. The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\nTo perform the required off-site consequence analysis for our facility, we have used the look-up tables and equations provided by the EPA in the RMP Off-site Consequence Analysis Guidance.   We have incorporated passive mitigation measures (containment structures and enclosures) to minimize the effects of our worst case release scenario.   In accordance with EPA procedures, we assumed a Class F atmospheric stability, a wind speed of 1.5 meters/second and a toxic end-point of 0.012mg/L.\n\nAn alternative release scenario ha"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4072,
      "SummaryText": "s also been submitted for formaldehyde solution.  This evaluation assumed neutral weather conditions and considered passive mitigation measures (diking and containment).\n\n4. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119.  Simpson voluntarily participates with Oregon OSHA's Safety and Health Achievement Recognition Program (SHARP) to further enhance plant safety and compliance.\n\nThe following sections briefly describe the elements of our release prevention program that are in place at our stationary source.\n\nProcess Safety Information\nSimpson Timber Company maintains a detailed record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is the use of a checklist and what-if scenario analysis.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are re-evaluated bi-annually or when new equipment or processes are added.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Simpson Timber Company maintains written Standard Operating Procedures.  These procedures address virtually all elements of plant operation including such aspects as initial process start-up, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and start-up after process repairs o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4072,
      "SummaryText": "r modifications.  The information is regularly reviewed and is readily accessible to operators involved with the processes.\n\nTraining\nSimpson Timber Company has a comprehensive training program in place to ensure that employees who are conducting processes are completely competent in the operating procedures associated with these processes.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided at least every other year and when processes are modified, new equipment installed or as deemed necessary by operations management.\n\nMechanical Integrity\nSimpson Timber Company carries out documented maintenance checks on process equipment to ensure proper functions.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Simpson Timber Company to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Simpson Timber Company.  These reviews are conducted to confirm that construction, equipment, operation and maintenance procedures are suitable for safe start-up prior to placing equipment into s"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4072,
      "SummaryText": "ervice.\n\nCompliance Audits\nSimpson Timber Company conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.  Simpson also uses a continuous behavioral-based safety audit program (STOP) in which all employees participate to promote safe plant operation.\n\nIncident Investigation\nSimpson Timber Company immediately investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  Simpson uses the Kepner-Tregoe Problem Analysis program for incident analysis.  Many of our employees have been formally trained in this process.  All incident analysis reports are retained for a minimum of 5 years.  \n\nEmployee Participation\nSimpson Timber Company truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation to the RMP rule; in particular, information resulting from process hazard analyses.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Simpson Timber Company has a strict policy of informing the contractors of known potential hazards related to the contractor's work and Simpson's processes.  Plant specific safety rules are presented and explained and violations of these rules constitutes grounds"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4072,
      "SummaryText": " for termination of the contractor's service agreement.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n5. Five-year Accident History\n\nSimpson Timber Company has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n\n6. Emergency Response Plan\n\nSimpson Timber Company carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is inspected and serviced annually.  We also perform annual drills to achieve practice in responding to emergency situations.  Simpson maintains accounts with emergency response contractors to provide cleanup services in the event of a major release.  In addition, the emergency response plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n7. Planned Changes to Improve Safety\n\nSimpson's safety record is in the top 10% of all companies in our industry.  With this plan we are including new elements of safety improvement.  Several developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  The following are some of the actions that we intend to take to further improve safety at our facility.  These changes are expected to be implemented by the dates indicated:\n\n7 Develop Ergonomics Evaluation Safety Team         -     8/99\n7 Completion of the Oregon Occupational Safety and Health Administration's Safety and Health Achievem"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 4072,
      "SummaryText": "ent Recognition Program (SHARP) Program                 -    11/99\n7 Initiate OSHA Voluntary Protection Program (VPP) participation which will lead to certification under the Federal OSHA \"Star\" merit ranking                        -    12/99"
    }
  ]
}