{
  "FacilityID": 40747,
  "FacilityName": "Farmers Coop Assn.",
  "FacilityStr1": "County Road 14",
  "FacilityStr2": null,
  "FacilityCity": "Lakefield",
  "FacilityState": "MN",
  "FacilityZipCode": "56150",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27063",
  "LEPC": null,
  "FacilityLatDecDegs": "43.672222",
  "FacilityLongDecDegs": "-095.152778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Farmers Coop Assn.",
  "OperatorStr1": "227 North Hwy 86",
  "OperatorStr2": null,
  "OperatorCity": "Lakefield",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56150",
  "OperatorZipCodeExt": null,
  "RMPContact": "LeRoy DeWall",
  "RMPTitle": "Location Supervisor",
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000012942",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-05-27 00:00:00",
  "SafetyInspectionBy": "Minnesota Department of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Lakefield, 2462",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-10-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-10-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-09-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": 43.66864,
  "FRS_Long": -95.15131,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 58514,
      "AltID": "Anhydrous ammonia",
      "FacilityID": 40747,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 59867,
          "ProcessID": 58514,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 77260,
          "ProcessID": 58514,
          "ChemicalID": 56,
          "Quantity": 361257.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 577260,
          "ProcessID": 58514,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 40747,
      "SummaryText": "                                                                Risk Management Plan (RMP -Ammonia\n                                                                                Executive Summary\n                                                                                Farmers Coop Assn.\n                                                                                Lakefield, Minnesota\n\n1.  Accidental Release Prevention and Emergency Response Policies\n\nWe at Farmers Coop Assn. In Lakefield are strongly committed to employee, public, and environmental safety. This commitment is an inherent part of our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the process at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. If such a release does occur, our trained emergency response perosnnel are at hand to control and mitigate the effects of the release. We also coordinate our response efforts with the Lakefield Fire Department, which provides additional emergency response expertise.\n\n2.  Stationary Source and Regulated Substances Handled\n\nOur facility's primary activities include support services for crop production. We have anhydrous ammonia stored in two 18,000 gallon tanks at our facility in Lakefield. The maximum amount stored is 30,600 (157,468 pounds) at the maximum fill capacity of 85%.\n\n3.  General Accidental Release Prevention Program\n\nOur facility has taken all the necessary steps to comply with the EPA's accidental release prevention requirements as set forth in 40CFR part 68. The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nFarmers Coop Assn. Maintains a detailed record of safety information that describes the chemical hazards, operating parameters, and equip"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 40747,
      "SummaryText": "ment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled effectively. Any findings from the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFarmers Coop Assn. Maintains written operating procedures to ensure that activities within our covered processes are conducted safely. These procedures address various modes of operation; the information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nFarmers Coop Assn. has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.\n\nMechanical Intregrity\nFarmers Coop Assn. Conducts documented maintenance checks on process equipment to ensure proper operation. Maintenance checks are conducted by qualified personnel with previous training in maintenance practices. Examples of process equipment that would receive maintenance checks include: pressue vessels, storage tanks, piping systems, relief  and vent systems, emergency shutdown systems, controls, and pumps. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Farmers Coop Assn. to manage changes in process chemicals, technology, equipment, and procedures. Process operators, maintenance personnel or other employees whose job tasks are affected by a modification in process conditions are promptly notified of the modification and offered training to deal with it.\n\nPre-startup Reviews\nFarmers Coop Assn. Routinely conducts pre-startup safety reviews related to new processes and modifications in established processes. These reviews are conducted to confirm that construction, equipment, and operating and maintenance procedures are suitable for safe startup p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 40747,
      "SummaryText": "rior to placing equiopment into operation.\n\nCompliance Audits\nFarmers Coop Assn. conducts compliance audits on a regular basis to determine whether the plan's provisions, set out under 40CFR part 68, are being implemented. Any non-compliance issue discovered during the audit is promptly corrected.\n\nEmployee Participation\nFarmers Coop Assn. Truly believes that the process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facilities implementation of the RMP, particularly information resulting from process hazard analysis.\n\n4.  Five-year Accident History\n\nFarmers Coop Assn. has had an excellent record of preventing accidental releases over the last 5 years. Due to our stringent release prevention policies, no accidental release occurred during this period.\n\n5.  Emergency Response Plan\n\nFarmers Coop Assn. maintains a written emergency response plan to deal with accidental releases of hazardous materials. The plan addresses all aspects of emergency response including first aid and medical treatment, evacuations, and notification of local emergency response agencies and the public.\n              Risk Management Plan (RMP) - Ammonia\n\n                       Executive Summary\n\n                        Co-op Ag Center \n\n                      Lakefield, Minnesota        \n\n                                \n\n                                \n\n  1. Accidental Release Prevention and Emergency Response Policies\n\nWe at Co-op Ag Center in Lakefield, Minnesota are strongly committed to employee, public, and\n\nenvironmental safety.  This commitment is an inherent part of our comprehensive accidental release\n\nprevention program that covers areas such as design, installation, operating procedures, maintenance,\n\nand employee training associated with the processes at our "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 40747,
      "SummaryText": "facility.  It is our policy to implement\n\nappropriate controls to prevent possible releases of regulated substances.  We coordinate our\n\nresponse efforts with the Lakefield Fire Department, which provides additional emergency response\n\nexpertise.\n\n\n\n  2. Stationary Source and Regulated Substances Handled\n\nOur facility's primary activities include support services for crop production.  We have anhydrous\n\nammonia stored in two 18,000-gallon tanks, three 1,450-gallon nurse tanks, sixteen 1,140-gallon\n\nnurse tanks, and twenty-four 1,000-gallon nurse tanks at our facility in Lakefield, Minnesota (Figure\n\n1).  The maximum amount stored is 70,201.5 gallons (361,256.9 pounds) at  85% standard maximum\n\nstorage capacity including the capacity of the on-site nurse tanks.   The largest single storage vessel\n\nat our facility contains 78,733.8 pounds at  85% standard maximum storage capacity.\n\n\n\n  3. Worst Case Release and Alternative Release Scenarios (NOTE: #3 Available only to\n\n  County Emergency Management Director, Fire Department and Co-op Ag Center - not\n\n  included with disk to EPA for public access per Federal Regulation posted 2004)\n\n\n\n  4. General Accidental Release Prevention Program\n\nOur facility has taken all the necessary steps to comply with the EPA's accidental release prevention\n\nrequirements as set forth in 40 CFR part 68.  The following sections briefly describe the elements\n\nof the release prevention program that is in place at our stationary source.\n\n\n\nProcess Safety Information\n\nCo-op Ag Center maintains a detailed record of safety information that describes the chemical\n\nhazards, operating parameters, and equipment designs associated with all processes (Appendix E).\n\n\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are\n\nidentified and controlled effectively.  Any findings from the hazard analysis are addressed in a timely\n\nmanner.\n\n\n\nOperating Procedures\n\nCo-op Ag Center maintains w"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 40747,
      "SummaryText": "ritten operating procedures to ensure that activities within our covered\n\nprocesses are conducted safely.  These procedures address various modes of operation; the\n\ninformation is regularly reviewed and is readily accessible to operators involved in the processes\n\n(Appendix B).\n\n\n\nTraining\n\nCo-op Ag Center has a comprehensive training program in place to ensure that employees who are\n\noperating processes are competent in the operating procedures associated with these processes.\n\n\n\nMechanical Integrity\n\nCo-op Ag Center conducts documented maintenance checks on process equipment to ensure proper\n\noperation.  Maintenance checks are conducted by qualified personnel with previous training in\n\nmaintenance practices.  Examples of process equipment that would receive maintenance checks\n\ninclude:  pressure vessels, storage tanks, piping systems, relief and vent systems, emergency\n\nshutdown systems, controls, and pumps.  Any equipment deficiencies identified by the maintenance\n\nchecks are corrected in a safe and timely manner (Appendix C).\n\n\n\nManagement of Change\n\nWritten procedures are in place at Co-op Ag Center to manage changes in process chemicals,\n\ntechnology, equipment, and procedures.  Process operators, maintenance personnel or other\n\nemployees whose job tasks are affected by a modification in process conditions are promptly notified\n\nof the modification and offered training to deal with it.\n\n\n\nPre-startup Reviews\n\nCo-op Ag Center routinely conducts pre-startup safety reviews related to new processes and\n\nmodifications in established processes.  These reviews are conducted to confirm that construction,\n\nequipment, and operating and maintenance procedures are suitable for safe startup prior to placing\n\nequipment into operation.\n\n\n\nCompliance Audits\n\nCo-op Ag Center conducts compliance audits on a regular basis to determine whether the plan's\n\nprovisions, set out under the 40 CFR part 68, are being implemented.  Any non-compliance issue\n\ndiscovered during the audit is "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 40747,
      "SummaryText": "promptly corrected.\n\n\n\nEmployee Participation\n\nCo-op Ag Center truly believes that process safety management and accident prevention is a team\n\neffort.  Company employees are strongly encouraged to express their views concerning accident\n\nprevention issues and to recommend improvements.  In addition, our employees have access to all\n\ninformation created as part of the facility's implementation of the RMP, particularly information\n\nresulting from process hazard analyses.\n\n\n\n  5. Five-year Accident History\n\nCo-op Ag Center has had an excellent record of preventing accidental releases over the last 5 years. \n\nDue to our stringent release prevention policies, no accidental release has occurred during this\n\nperiod.\n\n\n\n  6. Emergency Response Plan\n\nCo-op Ag Center maintains a written emergency action plan to deal with accidental releases of\n\nhazardous materials.  The plan addresses all aspects of emergency response including first aid and\n\nmedical treatment, evacuations, and in the event of an accidental release, Co-op Ag Center will\n\ncontact local emergency response agencies and the public (Appendix A). Co-op Ag Center maintains\n\na written emergency action plan which is coordinated with the local fire department and the county's\n\nEmergency Management Director.  The plan is intended to assist responding agencies to address all\n\naspects of emergency response including first aid and medical treatment, evacuations, and\n\nnotification of local emergency response agencies and the public.\n\n\n\n  7.  Planned Changes to Improve Safety\n\nWe will continue to provide our employees with ongoing annual training to ensure that they are\n\ncurrent with all of the safe ammonia transfer and handling procedures, and provide regular inspection\n\nand maintenance on all of the ammonia equipment.  Authorized personnel will make changes to the\n\nfacility if any audits of the facility identify non-compliance with Section 112 (r)(7), Accidental\n\nRelease Prevention Requirements of the Clean Air Act."
    }
  ]
}