{
  "FacilityID": 40821,
  "FacilityName": "Boise Cascade Corporation",
  "FacilityStr1": "4585 Industrial Road",
  "FacilityStr2": null,
  "FacilityCity": "Jackson",
  "FacilityState": "AL",
  "FacilityZipCode": "36545",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01025",
  "LEPC": "Clarke County EMA",
  "FacilityLatDecDegs": "31.490852",
  "FacilityLongDecDegs": "-087.897860",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": "www.bc.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9073099,
  "ParentCompanyName": "Boise Cascade Corporation",
  "Company2Name": null,
  "CompanyDUNS": 9073099,
  "Company2DUNS": null,
  "OperatorName": "Richard W. Merson,VP, AL Operations",
  "OperatorStr1": "4585 Industrial Road",
  "OperatorStr2": null,
  "OperatorCity": "Jackson",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36545",
  "OperatorZipCodeExt": null,
  "FTE": 620,
  "OtherEPAFacilityID": "ALD9817557529",
  "EPAFacilityID": "100000017698",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "102-0001-",
  "SafetyInspectionDate": "2000-04-27 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-10-19 00:00:00",
  "ErrorReportDate": "2004-10-19 00:00:00",
  "ReceiptDate": "2004-07-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-07-01 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": "2020-03-27 00:00:00",
  "DeRegistrationEffectiveDate": "2020-02-04 00:00:00",
  "AnniversaryDate": "2009-07-01 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.3",
  "FRS_Lat": 31.492253,
  "FRS_Long": -87.898805,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 58617,
      "AltID": "Chlorine dioxide 1% soln.",
      "FacilityID": 40821,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 77411,
          "ProcessID": 58617,
          "ChemicalID": 71,
          "Quantity": 9341.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 59970,
          "ProcessID": 58617,
          "NAICSCode": "322121",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 33860,
              "Process_NAICS_ID": 59970,
              "SafetyReviewDate": "2001-08-10 00:00:00",
              "PHA_Date": "2001-12-06 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-08-17 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Video monitor inside generator room",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-09-19 00:00:00",
              "TrainingReviewDate": "2002-02-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-04-16 00:00:00",
              "EquipmentInspectionDate": "2004-04-23 00:00:00",
              "EquipmentTested": "Chlorine Dioxide Solution Storage Vessels",
              "ChangeMgmtDate": "2001-12-06 00:00:00",
              "ChangeMgmtReviewDate": "2002-10-15 00:00:00",
              "PreStartupReviewDate": "1997-03-03 00:00:00",
              "ComplianceAuditDate": "2002-02-07 00:00:00",
              "AuditCompletionDate": "2002-11-04 00:00:00",
              "IncidentInvestigationDate": "2003-03-03 00:00:00",
              "InvestigationChangeDate": "2003-04-04 00:00:00",
              "ParticipationPlansReviewDate": "2002-10-15 00:00:00",
              "HotWorkPermitReviewDate": "2003-01-15 00:00:00",
              "ContractorSafetyReviewDate": "2004-04-22 00:00:00",
              "ContractorSafetyEvalDate": "2004-03-08 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 49201,
                  "PreventionProgram3ID": 33860,
                  "ProcessChemicalID": 77411
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 40821,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-07-29 00:00:00",
    "ERTrainingDate": "2004-02-19 00:00:00",
    "CoordinatingAgencyName": "Clarke County EMA",
    "CoordinatingAgencyPhone": "2512758775",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "NPDES, Clean Air Act, CERCLA"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 40821,
      "SummaryText": "Policy Statement\nThe Jackson Mill is committed to the safety of workers and the public, and to the preservation of the environment, through the prevention of accidental releases of hazardous substances.  Boise Cascade Corporation (Boise) implements reasonable controls to prevent foreseeable releases of hazardous substances.  These controls include training programs for personnel; programs to help ensure safety in the design, installation, operation, and maintenance of processes at Boise; and programs to evaluate the hazards at Boise.\nIn the event of an accidental release, Boise controls and contains the release in a manner that will be safe for workers and will help prevent injury to the public or the environment.  Boise provides response training to mill personnel, designates an emergency response coordinator to oversee response activities, and coordinates response efforts with the local fire department, police department, and hospital.  Response activities have also been discussed with the Clarke County Emergency Management Agency.\nIn order to effectively implement these policies, Boise has established a management system headed by the RMP Manager to oversee risk management-related activities.\n\nFacility Information and Regulated Substances\nThe Jackson Mill is an integrated bleached kraft pulp and paper mill located in Jackson, Alabama.  The mill produces approximately 800 tons per day of bleached kraft pulp.  The mill currently operates one paper machine with capacity of 475 tons per day and a second paper machine with a capacity of 1,400 tons per day.  Chlorine dioxide solution (containing approximately 1 percent by weight chlorine dioxide) is stored in two tanks of capacity 112,000 gallons each.  Assuming a specific gravity of 1.0, chlorine dioxide contained in each full tank is 9,341 pounds.  Chlorine dioxide solution is used as a bleaching agent in the pulping process.\nA Hazard Assessment was conducted as an initial screening procedure to determine the Program"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 40821,
      "SummaryText": "Level (1, 2, or 3) into which the Jackson Mill processes fall.  The mill currently stores chlorine dioxide in a quantity that exceeds the threshold amount listed in the RMP rule.  Because the chlorine dioxide process is covered by OSHA's Process Safety Management (PSM) rule and because nearby residents (public receptors) lie within the toxic endpoint concentration of the mill's worst-case release, the chlorine dioxide process is subject to Program 3 requirements of the RMP. \n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps\nThe Boise accident prevention program consists of the following 13 elements.\n\n1.  RMP Management System\nA Management System consisting of a Risk Management Program Team was established to assign responsibility for the development, implementation, and maintenance of the Risk Management Program.  The team is comprised of Hazard Assessment Coordinator, Prevention Program Coordinator, Emergency Response Coordinator and Communications Coordinator.  The Jackson Mill Environmental/Technical Manager serves as the RMP Manager and has the overall responsibility to oversee and implement the Risk Management Program.\n\n2.  Process / Chemical Safety Information\nComprehensive chemical data has been assembled to include regulatory reporting and action thresholds, health hazard and chemical exposure limitations, as well as detailed physical properties of chlorine dioxide. This information was compiled from numerous sources, and is intended to be a one-stop source for the reader seeking data on this substance. \nProcess Safety Information was meticulously compiled on the chlorine dioxide process. Hard-to-find specifications on each process are collocated in one place for easy reference. Details such as Maximum Intended Inventory, Safe Upper and Lower Temperatures, Safe Upper and Lower Pressures, and codes and standards used to design, build and operate the processes are on file at the mill. \n\n3.  Process Hazard Analysis\nA Hazard Review w"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 40821,
      "SummaryText": "as conducted for the chlorine dioxide process. The team consisted of plant management, process operating and maintenance experts, process design engineers, and Boise employees knowledgeable in the Hazard Review process itself. The Hazard Review technique used was a Hazard and Operability Study (HAZOP), supplemented by completion of design checklists.\n\n4.  Operating Procedures\nStandard Operating Procedures have been developed, and stringently reviewed by Jackson Mill employees. They provide system descriptions, specifications, and operating procedures for the chlorine dioxide system. Procedures include Startup, Shutdown, Normal, Abnormal, and Emergency Operation. Also included are Maintenance and Troubleshooting Procedures.\n\n5.  Operator Training Program \nBoise trains employees to safely and effectively perform their assigned tasks.  The Jackson Mill training program for the chlorine dioxide process includes both initial and refresher training that covers: \n1 A general overview of the process, \n2 The properties and hazards of the substances in the process, and \n3 A detailed review of the process operating procedures and safe work practices.  \nOral reviews and written tests are used to verify that an employee understands the training material before the employee can resume work in the process.\n\n6.  Mechanical Integrity Program\nThe Jackson Mill maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  The mechanical integrity program includes an inspection and testing program to help identify equipment deterioration and damage before the equipment fails.  The Boise mechanical integrity program includes:\n· Specifications for inspection and testing of process equipment\n· Specifications for replacement parts and equipment\n· Procedures for inspecting, testing, and maintaining process equipment\n· Procedures for safe work practices such as lockout/tagout, hot work, confined space e"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 40821,
      "SummaryText": "ntry, and line or equipment opening\n· Training of maintenance personnel\n· Documentation of maintenance activities\n\n7.  Management of Change\nThe Jackson Mill management of change program evaluates and approves all proposed changes to chemicals, equipment, and procedures for the chlorine dioxide process to help ensure that the change does not negatively affect safe operations.  Process changes that are determined to be a replacement in kind (e.g., replacing a valve with an identical valve) are allowed without completing a full management of change procedure.  All other changes must be confirmed through the full management of change procedure to help ensure that inadvertent consequences of process changes are prevented, safety consequences of changes are addressed, and affected employees are notified of the changes.\n\n8.  Pre-startup Review\nBoise performs a safety review of a new or modified process before the process is placed into service to help ensure that the process has been prepared to operate safely.  A pre-startup review checklist is completed to document the review and to ensure that appropriate issues have been addressed.\n\n9.  Internal Compliance Audits\nInternal Compliance Audits are conducted every three years to verify compliance with the programs and procedures contained in the Accident Prevention Program. Boise assembles an audit team that includes personnel knowledgeable in the RMP rule and in the process, and this team evaluates whether the prevention program satisfies the requirements of the RMP rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n\n10.  Incident Investigation\nThe Jackson Mill investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented.  Bo"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 40821,
      "SummaryText": "ise trains employees to identify and report any incident requiring investigation.  An investigation team is assembled, and the investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\n\n11.  Employee Participation\nBoise has developed a written employee participation program for covered processes to help ensure that the safety concerns of mill employees are addressed.  The Jackson Mill encourages active participation of personnel in the prevention program activities of all processes at the facility.  Employees are consulted on and informed about all aspects of the RMP rule prevention program, including Process Hazard Analyses and operating procedures.\n\n12.  Hot Work Permits\nThe Jackson Mill has established a hot work permit program to control spark or flame producing activities that could result in fires or explosions in covered processes at the facility.  Personnel who are to perform hot work are required to fill out the Hot Work Permit Form.  The Shift Supervisor reviews the completed form before work can begin.  Training in the use of the Hot Work Permit Form is included in the Jackson Mill safe work practices orientation.\n\n13.  Contractors\nBoise has established a program to help ensure that contractor activities at the mill are performed in a safe manner.  The Jackson Mill provides training to contractor supervisors on the hazards of the process on which they and their employees will work, and also informs the contractor supervisors of safe work practices and emergency response procedures.  The Jackson Mill requires that the contractor supervisors train each of their employees who will work in the mill before that worker begins work on site.  The Jackson Mill periodically reviews contractors' training documents and work performance to help ensure that safe work practices are followed.\n\nFive-Year Accident History\nThe Jackson Mill"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 40821,
      "SummaryText": "has had no reportable incidents within its most recent five-year accident history.\n\nEmergency Response Program\nBoise has established a written emergency response program to help safely respond to accidental releases of hazardous substances.  The emergency response plan includes procedures for:\n· Informing the local fire department and the public about accidental releases that could reasonably result in offsite consequences\n· Providing proper first aid and emergency medical treatment to treat accidental human exposure to hazardous substances at the Jackson Mill\n· Controlling and containing accidental releases of hazardous substances, including the use of emergency response equipment\n· Inspecting and maintaining emergency response equipment\n· Reviewing and updating the emergency response plan\nBoise maintains an emergency response team trained in these emergency response procedures.  All mill personnel are trained in evacuation procedures.  The Jackson Mill conducts emergency response drills, including annual drills coordinated with the local fire department. \nThe written emergency response plan complies with other federal contingency plan regulations and has been communicated to local emergency response officials and to the local fire department.  The City of Jackson fire chief, Neal Bradley, is also the fire chief for the Jackson Mill.\n\nPlanned Changes to Improve Safety\nBoise strives to improve the safety of the processes at the Jackson Mill through both an incident investigation program and a program soliciting safety suggestions from the employees.  There are currently no additional changes planned to improve process safety."
    }
  ]
}