{
  "FacilityID": 40865,
  "FacilityName": "Producers Fertilizer",
  "FacilityStr1": "905 E. Hickory",
  "FacilityStr2": "P. O. Box 345",
  "FacilityCity": "Nevada",
  "FacilityState": "MO",
  "FacilityZipCode": "64772",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29217",
  "LEPC": "Vernon County LEPC",
  "FacilityLatDecDegs": "37.842500",
  "FacilityLongDecDegs": "-094.344444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PF",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 49569981,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Producers Fertilizer",
  "OperatorStr1": "905 E. Hickory",
  "OperatorStr2": "P. O. Box 345",
  "OperatorCity": "Nevada",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "64772",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000072342",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-03-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-10-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-10-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-10-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-08-19 00:00:00",
  "DeRegistrationEffectiveDate": "2019-08-12 00:00:00",
  "AnniversaryDate": "2009-10-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": 37.84226,
  "FRS_Long": -94.34752,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 58713,
      "AltID": "2",
      "FacilityID": 40865,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 77516,
          "ProcessID": 58713,
          "ChemicalID": 56,
          "Quantity": 56000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 60068,
          "ProcessID": 58713,
          "NAICSCode": "42491",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 22229,
              "Process_NAICS_ID": 60068,
              "SafetyReviewDate": "2004-09-01 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 1,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2004-09-01 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 1,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-09-01 00:00:00",
              "TrainingReviewDate": "2004-09-01 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-10-01 00:00:00",
              "EquipmentInspectionDate": "2004-10-01 00:00:00",
              "EquipmentTested": "hoses, plumbing, emergency shet off, shear pionts",
              "ComplianceAuditDate": "2004-04-12 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "safety & loss control manual, regulaatory affairs manual, ansi-k61.1 1989 version ansi/ul 51, 1992 version, ansi/331 1989 version",
              "_chemicals": [
                {
                  "PrimaryKey": 23232,
                  "PreventionProgram2ID": 22229,
                  "ProcessChemicalID": 77516
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 40865,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-04-12 00:00:00",
    "ERTrainingDate": "2004-09-01 00:00:00",
    "CoordinatingAgencyName": "Nevada Fire Department",
    "CoordinatingAgencyPhone": "4176672720",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 40865,
      "SummaryText": "\nProducers Fertilizer \n\n905 EAST HICKORY\n\nP. O. BOX 345\n\nNEVADA MO. 64772\n\n\n\nCertification Statement for the RMP, Program 2, Anhydrous Ammonia\n\n\n\nTo the best of the undersigned's knowledge, information, and belief formed after reasonable evaluation and by actual knowledge of the facility and process, the information submitted is true, accurate, and complete.\n\n\n\n                        Kenny Brundridge\n\nSignature                    Name (Printed)\n\n\n\n\n\nLocation Manager                05/21/2004\n\nTitle                        Date\n\n\n\nEXECUTIVE SUMMARY - ANHYDROUS AMMONIA\n\n\n\nAccidental Release Prevention and Emergency Response Policies:\n\nThis facility complies with the 1989 ANSI K 61.1 \"Safety Requirements for the Storage and Handling of Anhydrous Ammonia\". In addition, it is our policy to adhere to all applicable federal, state and local laws. \n\n\n\nProducers Fertilizers Mission states \"to provide for the safety of our employees, our customers and the general public\". In order to fulfill this mission, Producers Fretilizer provides an Environmental, Health, and Safety (EHS) group to maintain and administer comprehensive safety and environmental programs and procedures. EHS field safety service supervisors audit and monitor facility compliance with the safety standards of the company.\n\n\n\nThis location is required to conduct their own internal audit utilizing checklist survey forms that are reviewed regularly and updated as necessary to ensure all applicable federal, state, and local regulations are covered. The EHS group conducts comprehensive annual audits at this location to measure regulatory compliance including those governing the safe handling and storage of anhydrous ammonia. The field supervisors require a timely written response with the completion date of all recommendations resulting from the audits.\n\n\n\nThis location has a \"site safety coordinator\" as an extension of the EHS group. These coordinators are given training to monitor the day to day safe work activities, maintain the required regulatory record keeping, conduct mo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 40865,
      "SummaryText": "nthly safety meetings, conduct employee training, and act as the location's contact with the corporate EHS group. The site safety coordinator acts as the location's emergency contact.\n\n\n\n\n\nDESCRIPTION OF OUR FACILITY AND THE REGULATED SUBSTANCES HANDLED:\n\n\n\nThis facility is a retail farm supply distribution center. We store and distribute a wide variety of pesticides and fertilizers including anhydrous ammonia. Anhydrous ammonia is received by truck, is handled and stored on-site, and is a substance regulated by the EPA requiring us to comply with the Risk Management Program. We sell anhydrous ammonia to grower customers in 1,000 gallon and 1,500 gallon nurse tanks. The customer applies the ammonia into the soil as a source of nitrogen fertilizer for growing agricultural crops. \n\n\n\nThis facility maintains approximately twenty-three - 1,000-gallon nurse tanks and two - 1,500-gallon nurse tanks for customer delivery.  Our combined storage capacity in nurse tanks is 121,420 pounds. Anhydrous ammonia is stored in two stationary storage tanks; [2 @ 12,000 gallons] on site.  The maximum storage capacity of the stationary storage tanks is 112,000 pounds of anhydrous ammonia. Therefore, the total facility anhydrous ammonia storage capacity is 243,420 pounds.  The largest single storage vessel at our facility contains 56,000 pounds.\n\n\n\n\n\nWORST CASE SCENARIO:\n\n\n\nOur worst case scenario is the loss of the total contents of the 12,000 gallon storage tank, when filled to the greatest amount allowed (85% of capacity), released as a gas over 10 minutes, resulting in total vaporization. The maximum quantity released would be 56,000 pounds. According to DEGADIS modeling, this release (distance from point of dispersion to 200 ppm) would have off-site impact. It should be noted that Producers has never had a release of an entire stationary anhydrous ammonia storage tank from any distribution facility.\n\n\n\n\n\nALTERNATIVE RELEASE SCENARIO:\n\n\n\nThe most common alternative release scenario f"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 40865,
      "SummaryText": "rom our facility would not reach an end point off-site. The alternative release scenario modeled for the purpose of this plan is a 2-minute release from a stationary storage tank representing a valve and hose failure requiring a manual shut down.  The total amount of anhydrous ammonia released in this scenario would be 12,000 pounds. This release scenario (distance from point of dispersion to 200 ppm) would have off-site impact.  It should be noted Producers has not had a release of this type from any distribution facility.\n\n\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS:\n\n\n\nThe anhydrous ammonia system is designed, installed, and maintained in accordance with ASTM standards and ASME codes. This facility complies with the ANSI K 61.1 standards (1989), OSHA (29 CFR 1910.111), EPA's Accidental Release Prevention Rule, and all applicable federal, state, and local codes and regulations.\n\n\n\nOur ammonia system is protected from major releases by internal excess flow valves, check valves, relief valves, manual shutoffs, and emergency shutoff valves. The load-out risers used for the purpose of filling the nurse tanks are protected by excess flow valves and fill line breakaways to immediately stop the flow of ammonia if a line or a hose fails. All main storage tank valves and riser valves are locked when not in use.\n\n\n\nOur ammonia system is inspected on a regular basis with maintenance and preventive maintenance scheduled and documented. Liquid and vapor valves, hoses, excess flow valves, gauges, and relief valves are replaced when necessary and according to the guidelines in the ANSI standards.\n\n\n\nTraining is provided to all employees at least annually, whenever there is a change in the process, or whenever competency with the regulations is questioned. The training consists of classroom lecture, current videos, testing and certification, and on the job training.\n\n\n\n\n\nFIVE-YEAR ACCIDENT HISTORY:\n\n\n\nThere have been no accidents invol"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 40865,
      "SummaryText": "ving anhydrous ammonia that caused deaths, injuries, property or environmental damage, including evacuations on or off-site.\n\n\n\n\n\nEMERGENCY RESPONSE PROGRAM:\n\n\n\nIn the event of an emergency involving our ammonia system, it is our policy to notify the local community fire department and request that they respond to the emergency. In preparation for this, we have coordinated with all of the local response agencies by providing information and facility tours to ensure that they are familiar with and properly prepared for an incident at our facility. This will help to ensure that our community has the strategy for responding to and mitigating the threat posed by an ammonia release. This complies with the requirement for our facility to be included in the community emergency response plan prepared under EPCRA and coordinated with our LEPC.\n\n\n\nIn addition, Producers has an Emergency Response and Contingency Plan for this facility that complies with the requirements of OSHA (29 CFR 1910.38 and 1910.1200). The plan includes provisions for public notification, initial medical care, evacuations, and LEPC coordination.\n\n\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY:\n\n\n\nWe do not plan to make any changes to the physical site. We will continue to provide our employees with ongoing annual training to ensure that they are current with safe ammonia transfer and handling procedures. We will also provide regular inspection and maintenance on all of the ammonia equipment.\n\n"
    }
  ]
}