{
  "FacilityID": 4087,
  "FacilityName": "Anheuser-Busch, Inc. St. Louis Brewery",
  "FacilityStr1": "One Busch Place",
  "FacilityStr2": null,
  "FacilityCity": "St. Louis",
  "FacilityState": "MO",
  "FacilityZipCode": "63118",
  "Facility4DigitZipExt": "1852",
  "FacilityCountyFIPS": "29189",
  "LEPC": "City of St. Louis LEPC",
  "FacilityLatDecDegs": "38.596667",
  "FacilityLongDecDegs": "-90.2125",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": "www.anheuser-busch.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6288799,
  "ParentCompanyName": "Anheuser-Busch Companies, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 98630254,
  "Company2DUNS": 0,
  "OperatorName": "Anheuser-Busch, Inc.",
  "OperatorStr1": "One Busch Place (3-2)",
  "OperatorStr2": null,
  "OperatorCity": "St. Louis",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "63118",
  "OperatorZipCodeExt": "1852",
  "FTE": 1635,
  "OtherEPAFacilityID": "63118NHSRBONEBU",
  "EPAFacilityID": "100000052319",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "In process",
  "SafetyInspectionDate": "1999-06-07 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 38.59735,
  "FRS_Long": -90.21025,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4752,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 4087,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 5082,
          "ProcessID": 4752,
          "ChemicalID": 56,
          "Quantity": 340000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 4858,
          "ProcessID": 4752,
          "NAICSCode": "31212",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1791,
              "Process_NAICS_ID": 4858,
              "SafetyReviewDate": "1999-04-15 00:00:00",
              "PHA_Date": "1997-05-05 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-01-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Fail safe valves",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-15 00:00:00",
              "TrainingReviewDate": "1998-01-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-10 00:00:00",
              "EquipmentTested": "Pressure relief valves on #7 Frick booster compressor;  additionally system inspection is performed daily",
              "ChangeMgmtDate": "1999-05-24 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-10 00:00:00",
              "PreStartupReviewDate": "1999-06-10 00:00:00",
              "ComplianceAuditDate": "1997-05-05 00:00:00",
              "AuditCompletionDate": "2002-01-01 00:00:00",
              "IncidentInvestigationDate": "1998-03-05 00:00:00",
              "InvestigationChangeDate": "1999-12-01 00:00:00",
              "ParticipationPlansReviewDate": "1999-06-10 00:00:00",
              "HotWorkPermitReviewDate": "1996-05-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-01 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-01 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1993,
                  "PreventionProgram3ID": 1791,
                  "ProcessChemicalID": 5082
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4087,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-06-01 00:00:00",
    "ERTrainingDate": "1999-03-01 00:00:00",
    "CoordinatingAgencyName": "City of St. Louis Fire Department",
    "CoordinatingAgencyPhone": "3142891900",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4087,
      "SummaryText": "EXECUTIVE SUMMARY\n\n Risk Reduction Policies\n \nThe management team of the Anheuser-Busch brewery in St. Louis, Missouri, recognizes and shares the communitys interest in safe operation of the facility.  We have completed this report under the U.S. Environmental Protection Agencys (EPA) risk management program (RMP) to communicate our efforts to achieve a safe workplace.  \n\nThe brewery uses ammonia as a key part of the cooling system that maintains beer at the proper temperature during certain stages of the brewing process.  Ammonia is one of the materials covered under the U.S. Occupational Safety and Health Administrations Process Safety Management standard (PSM) and U.S. Environmental Protection Agencys Risk Management Program (RMP) regulations.  The brewery follows these regulations, as well as others, to ensure that it safely handles, uses, and stores ammonia and other potentially hazardous chemicals safely.  The brewery has had no releases of ammonia that resulted in injuries to people, harm to property, or damage to the environment within the last five years.\n\nOur corporate environmental, health, and safety (EHS) policy and requirements promote the overall safety of this brewery, employees, and the public.  This policy includes risk reduction programs that provide assurance for the safe management of process risks to prevent environmental, health and safety incidents and to protect the workplace, the community and the environment. These programs enable the brewery to prevent the occurrence, or minimize the consequences of, significant releases of ammonia.  \n \nIt is Anheuser-Busch's policy to conduct our business in accordance with all applicable laws, regulations, and permits and to promote a safe workplace and a quality environment.  Each employee is trained and required to comply strictly with this policy.  We do not allow production goals or financial objectives to over-ride safety and environmental concerns.  \n \nAlso, it is Anheuser-Busch's policy to le"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4087,
      "SummaryText": "ad by example so that other companies, including vendors and suppliers, are similarly interested in protecting the health and safety of employees and safeguarding the environment.  We are committed to the spirit as well as the letter of our EHS policy and promote, throughout the organization, responsibility and accountability for strict compliance with that policy.  Anheuser-Busch employees whose actions in the performance of their duties may affect the environment and/or public health are trained sufficiently to permit them to comply strictly with our EHS policy. \n\nIn conducting our businesses, we continue to seek and implement cost effective methods to reduce the EHS impact of our operations.  We integrate EHS considerations into our business planning and decision-making processes, including product research and development, packaging, and new manufacturing methods.  Our continuous EHS improvement goals include pollution prevention and resource conservation.  We ask our contractors to adopt EHS standards, ethics, and policies similar to our own and we give preference to suppliers that do so.\n \nWe encourage our employees, customers, and the public to share with us their EHS concerns.  We continually talk with local authorities in communities in which we operate to share ideas about preventing incidents with materials we use or store.\n \nAmmonia System\n \nAmmonia is used in the refrigeration system of the brewery.  As part of the brewing process, the beer is cooled to ensure its consistency, flavor and overall quality.  Beer packaged in kegs is stored in a refrigerated area in our facility until it's shipped.  Because of the characteristics of ammonia, our employees observe certain safety precautions to prevent unnecessary human and environmental exposure, both within the brewery and in the surrounding community.\n \nWorst-Case Release Scenario\n \nAs required by the EPA's Risk Management regulation, we have identified an extremely unlikely \"worst-case\" scenario in which "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4087,
      "SummaryText": "liquid ammonia distribution piping fails, releasing 38,535 pounds of ammonia. This constitutes all of the liquid ammonia in the distribution system between major process units.  Under worst-case weather conditions and with no mitigating actions, ammonia could travel 2.3 miles before dispersing to the endpoint concentration of 200 ppm.\n \nThis scenario is unlikely to occur at the St. Louis brewery for a number of reasons: \n\nWe meet or exceed industry standards for the manufacture and quality control of pipes and vessels that       contain ammonia used at our facility;\nAmmonia is not corrosive to piping in the form in which it is used at the brewery;\nPressure relief safety valves limit operating pressure so chances for a large-scale release are minimal;\nAmmonia sensors warn of leaks; \nAutomatic and manual safety valves provide the ability to isolate components within the ammonia system, as described below;\nEquipment is inspected and kept in proper working order and replaced when necessary; \nWorst-case weather conditions as assumed by the definition of worst case are uncommon in the St. Louis area; \nThe brewery has an emergency response plan, personnel and equipment in place to respond to emergency situations (see description below).\n \nAlternative Release Scenario\n \nAn alternative release scenario would be the opening of a pressure relief valve, which itself is a system safety device designed to relieve pressure to avoid a more serious release.  The largest release from a pressure relief valve at any of our 12 breweries in the past five years has been 400 pounds.  Under defined weather conditions, this amount of ammonia could travel 0.10 miles before dispersing to the endpoint concentration of 200 ppm.\n \nThis scenario is unlikely for the same reasons presented in the discussion above regarding the worst-case release.\n \nAccidental Release Prevention Program\n \nAnheuser-Busch has years of experience operating ammonia-based refrigeration systems at its breweries.  This exper"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4087,
      "SummaryText": "ience has helped bring about designs and operating plans that produce a safe system.  No ammonia releases from any of the companys breweries have ever resulted in consequences off brewery property.  The following elements have produced this safe operating record:\n\nProcess hazard analysis and review, including identification of corrective actions which are tracked to closure;\nStandard operating procedures that all operators of the refrigeration system must follow;\nFormal operator training (80 hours minimum);\nPreventative maintenance to ensure that the entire refrigeration system is mechanically sound;\nProcedures to ensure that changes to the refrigeration system are managed so that system operation remains safe;\nSafety review prior to the startup of new or modified equipment;\nAudits of the PSM and RMP programs;\nIncident investigations to ensure that lessons are learned to prevent future incidents;\nEmployee involvement in risk reduction programs;\nContractor safety procedures are reviewed to ensure outside workers exercise the same safety consciousness as brewery employees;\nA hot work permit system that ensures all welding work is conducted safely.\nProcess safety information; and \nEmergency planning and response.\n \nThe brewery additionally complies with the requirements of the OSHA PSM standard (40 CFR 1910.119), the EPA RMP rules (40 CFR 68), and the ANSI/IIAR 2-1992 standard for Equipment, Design, and Installation of Ammonia Mechanical Refrigerating Systems.\n \nFive-Year Accident History\n  \nThe brewery has had no covered releases that have caused on-site or offsite injuries, or damage to property or the environment within the last five years. \n \nEmergency Response Program\n \nThe St. Louis brewery has established emergency response procedures in the event of an incident involving ammonia.  The emergency response program is based on OSHA's requirements for emergency action plans (29 CFR 1910.38) and HAZWOPER (29 CFR 1910.120 (q)).  We have trained employees for emergenc"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4087,
      "SummaryText": "y response and maintain a plan entitled  \"Environmental, Health and Safety Incident Plan\" (EHSIP) which is provided to the City of St. Louis Fire Department.  We conduct periodic drills with local agencies as one of the methods we use to train on implementation of the EHSIP at the brewery. \n \nBrewery personnel notify local agencies when emergency response is needed.  Local agencies determine if the public needs to be notified.  If it is determined that the public needs to be notified, the local agencies perform the notification task.\n \nPlanned Changes to Improve Safety\n \nAnheuser-Buschs St. Louis brewery ammonia refrigeration system is periodically modified to improve safety.  In 1996 a new state-of-the-art refrigeration plant was placed into service.  Additional changes to improve safety are planned in the future.\n\nConclusion\n\nAnheuser-Busch is pleased to share its record of safe operations.  We believe the Risk Management Plan under which we are providing this information is an important tool for encouraging communications with our neighbors.  Although we are confident the worst case and alternative scenarios presented in this report are highly unlikely,  we are prepared to respond quickly and effectively should one ever occur.  Anheuser-Busch has worked hard over the years to ensure the highest standard of safety.  Our goal is to continue the excellent and safe track record."
    }
  ]
}