{
  "FacilityID": 40984,
  "FacilityName": "Foster Farms C St. (10/04 RMP Rev.)",
  "FacilityStr1": "520 C Street",
  "FacilityStr2": null,
  "FacilityCity": "Turlock",
  "FacilityState": "CA",
  "FacilityZipCode": "95380",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06099",
  "LEPC": null,
  "FacilityLatDecDegs": "37.491000",
  "FacilityLongDecDegs": "-120.849000",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 193426202,
  "ParentCompanyName": "Foster Poultry Farms",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Foster Poultry Farms",
  "OperatorStr1": "520 C Street",
  "OperatorStr2": null,
  "OperatorCity": "Turlock",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95380",
  "OperatorZipCodeExt": null,
  "FTE": 64,
  "OtherEPAFacilityID": "CAD981667389",
  "EPAFacilityID": "100000129121",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-03 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-10-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-10-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-10-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2023-04-21 00:00:00",
  "DeRegistrationEffectiveDate": "2023-04-07 00:00:00",
  "AnniversaryDate": "2009-10-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.3",
  "FRS_Lat": 37.48796,
  "FRS_Long": -120.84739,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 58900,
      "AltID": "FTP-1 @ 520 C Street",
      "FacilityID": 40984,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 77810,
          "ProcessID": 58900,
          "ChemicalID": 56,
          "Quantity": 28344.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 60257,
          "ProcessID": 58900,
          "NAICSCode": "311615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 34077,
              "Process_NAICS_ID": 60257,
              "SafetyReviewDate": "2004-06-15 00:00:00",
              "PHA_Date": "2006-06-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-06-16 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Leak Detection System",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-01-02 00:00:00",
              "TrainingReviewDate": "2004-01-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-01-02 00:00:00",
              "EquipmentInspectionDate": "2004-10-22 00:00:00",
              "EquipmentTested": "Compressors",
              "ChangeMgmtDate": "2004-08-02 00:00:00",
              "ChangeMgmtReviewDate": "2004-01-02 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2003-05-29 00:00:00",
              "AuditCompletionDate": "2005-05-29 00:00:00",
              "IncidentInvestigationDate": "2000-12-26 00:00:00",
              "InvestigationChangeDate": "2001-01-15 00:00:00",
              "ParticipationPlansReviewDate": "2004-01-02 00:00:00",
              "HotWorkPermitReviewDate": "2004-01-02 00:00:00",
              "ContractorSafetyReviewDate": "2003-12-02 00:00:00",
              "ContractorSafetyEvalDate": "2004-01-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 49527,
                  "PreventionProgram3ID": 34077,
                  "ProcessChemicalID": 77810
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 40984,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-03-15 00:00:00",
    "ERTrainingDate": "2004-10-01 00:00:00",
    "CoordinatingAgencyName": "Turlock Fire Department",
    "CoordinatingAgencyPhone": "2096681200",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 40984,
      "SummaryText": "ng and a ready reference for operating and trouble-shooting the systems.\n\nFoster Farms is committed to maintaining the mechanical integrity of the ammonia refrigeration systems.  A preventive maintenance system is utilized to manage the maintenance of the refrigeration systems.  Preventive maintenance at the facility includes shift, daily, weekly, and periodic inspection; calibration; testing; and overhaul of equipment.  The system is used to track equipment performance and to create reports that are used by maintenance personnel to monitor the frequency of repairs and deviations from normal operating parameters.\n\nChanges to improve safety at the facility are ongoing.  Many of the mitigation measures suggested by the previous process hazard analysis team have already been implemented.  Others will be addressed during the next eighteen months.  \n\nThe status of significant mitigation measures for the ammonia refrigeration system is as follows:\n·the review and revision of SOPs is completed\n·Foster Farms tests safety shutdowns annually\n·operator training includes SOPs\n·valve tagging is completed\n·recommendations for equipment inspection and maintenance have been incorporated into the preventive maintenance program\n·high level compressor shutoffs have been installed on recirculator and intercooler vessels\n\nFoster Farms will respond to all suggested mitigation measures.  Foster Farms is scheduling completion of proposed actions.  Management responses and support will be consistent with Foster Farms' commitment to safe and environmentally responsible operations.\n\nFoster Farms recognizes that the RMP/PSM is a continuous process for evaluating, monitoring, and improving anhydrous ammonia handling operations at its facility. As such, this document and related attachments and program elements will evolve as Foster Farm continues their ongoing focus and dedication of risk minimization and safety improvement for their employees and surrounding community. Foster Farms will submit"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 40984,
      "SummaryText": "revised information if a change occurs that is considered significant and requires resubmission under the regulations. However, minor improvements/modifications to the RMP/PSM and related attachments and program elements will be incorporated consistent with Foster Farms¿ internal review practices and Foster Farms will maintain the most current versions on site. Thus, the most current version RMP/PSM and related documents and elements maintained on site may vary slightly from the information in submittals made to EPA and other regulatory agencies."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 40984,
      "SummaryText": "FOSTER POULTRY FARMS\nFOSTER TURKEY PRODUCTS\nC STREET PLANT/BLAST FREEZER AND TURLOCK DISTRIBUTION CENTER\nRISK MANAGEMENT PROGRAM AND\nPROCESS SAFETY MANAGEMENT PROGRAM\n\nAnhydrous Ammonia Refrigeration Systems\n\nRevised October 2004\n\nEXECUTIVE SUMMARY\n\nFoster Poultry Farms revised this document, previously submitted in March 2000, due to the revalidation of their process hazard analysis¿s and regulatory requirements requiring re-submittal within six months of a revised process hazard analysis.  \n\nFoster Turkey Products C Street Plant/Blast Freezer and Turlock Distribution Center (formerly Processing Plant 1 and Shipping) (referred to hereafter as ¿Foster Farms¿ or ¿C Street Plant and Distribution Center¿) prepared a Chemical Risk Management Program and Process Safety Management Program (RMP/PSM) in general accordance with state and federal regulations. The state risk management regulations, also referred to as the California Accidental Release Prevention (CalARP) program, are codified in California Code of Regulations (CCR), Title 19, Section 2735.1, et. Seq.  The Environmental Protection Agency (EPA) also regulates facilities with certain toxic and flammable substances.  The federal regulations are codified in Title 40 of the Code of Federal Regulations (CFR), Part 68.  Finally, both CalOSHA and OSHA regulate facilities with certain acutely hazardous materials under the PSM regulations, as defined in CCR Title 8 Section 5189 and CFR Title 29 Part 1910 Section 119, respectively.\n\nFoster Farms prepared the RMP/PSM to satisfy regulatory requirements and to demonstrate a commitment to evaluate and improve chlorine and anhydrous ammonia handling systems and practices at the facility.  Foster Farms removed all liquid/gaseous chlorine processes in early 2000 and replaced them with alternative systems, further demonstrating their commitment to reduce chemical risks.\n\nMany state-of-the-art safety features were incorporated into the ammonia refrigeration systems at the facility"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 40984,
      "SummaryText": "as part of the original system construction and system modifications. Foster Farms will continue to improve ammonia handling safety through the implementation of the prevention program elements of the RMP/PSM.  In the unlikely event that an ammonia release does occur at the facility, Foster Farms personnel are trained in the appropriate response measures and do not rely on support services provided by the local fire department and/or hazardous materials response team to end the release.\n\nThe C Street Plant and Distribution Center is located at 500/520 C Street in Turlock, California.  Foster Farms purchased the facility in 1982 from the Grange Company.  The main processing building was constructed in the 1950s; the Distribution Center was constructed in 1977.  The C Street Plant and Distribution Center is located on approximately two acres bordered by 5th Street on the east and 6th Street on the west.  The north side is bordered by B Street, and the southern border is D Street.  The areas surrounding the facility consist of residential, industrial, and commercial properties.  Portions of the facility are surrounded by a security fence, prohibiting unauthorized access.  Additionally, the entrance to the facility is staffed by plant security personnel 24 hours per day, 365 days per year.\n\nOperations at the facility consist of the storage and distribution of poultry products.  The facility receives poultry products from other Foster Farms facilities, and packages them or sends them to other Foster Farms¿ facilities for further processing.  All processing rooms and cold storage units are cooled by air handling units supplied with ammonia.  The ammonia systems at the C Street Plant and Distribution Center are located in secured rooms, in a fenced area, or on the roofs of the facility.\n\nAnhydrous ammonia is used in two closed-loop refrigeration systems at the facilities.  The ammonia system for the C Street Plant provides cooling for storage areas, freezers, and ice make"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 40984,
      "SummaryText": "rs.  The ammonia system for the Distribution Center is used for cooling storage areas.  The desired temperatures are maintained by controlling the flow of ammonia with manually and electrically operated valves, float switches, transfer pumps, and compressor controls.  Ammonia is used as the heat transfer media in the refrigeration systems.  As the ammonia passes through heat exchangers in the various refrigerated areas or units, heat is transferred to the ammonia thus cooling the air, water, or product that is giving up heat.  The ammonia is then compressed and passes through a condenser where it gives up heat to air and water.  The ammonia cycles back through the heat exchangers to repeat the process.  Anhydrous ammonia is a commonly used industrial refrigerant due to its relatively efficient heat transfer characteristics.\n\nThe RMP/PSM regulations require a review of the five-year accident history at the regulated facility.  Foster Farms has had no reportable releases within the past five years.\n\nThe RMP regulations also require a review of the accidental release prevention programs and chemical specific prevention steps used by the facility.  Foster Farms has incorporated many safety features in the ammonia refrigeration systems to prevent system failures and to mitigate potential releases.\n\nThe predominant safety concern with closed-loop ammonia systems is an inadvertent buildup of pressure exceeding pressure ratings or capacities of equipment due to ammonia expansion.  The Foster Farms ammonia systems are continuously monitored by automated control systems that shut down components if deviations from normal operating conditions occur.  The major pressure vessels in the ammonia systems at the C Street Plant and Distribution Center are equipped with pressure relief valves.\n\nOther safety features of the ammonia refrigeration systems at the facility include: \n·emergency shutdown systems\n·component specific safety shutdowns\n·an ammonia leak detection system is instal"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 40984,
      "SummaryText": "led in the C Street Plant engine room and other rooms in the facility \n·an ammonia leak detection system is installed in the Distribution Center engine room and other rooms in the facility\n·component specific safety shutdowns and the ammonia leak detection system alarm locally and to the security department at Foster Farms¿ headquarters in Livingston, California \n·ammonia pipes, valves, and components are labeled\n·pressure relief valves are replaced at least every five years\n·fire alarms and sprinkler systems are installed throughout the plants\n·ammonia equipment is located in a fenced or secured area\n·a computerized preventive maintenance program is used for both systems\n·most oil draining done through an oil still\n·self-closing valves are used for draining oil through the still and for draining oil from components not connected to the still\n·all major system components are observed at least daily\n·a barrier wall protects the high pressure receiver at the C Street Plant\n·the high pressure receiver at the Distribution Center is located inside the engine room\n·much of the ammonia piping has been replaced since original construction of the facility as part of Foster Farms ongoing mechanical integrity program\n\nIn addition to the physical features of the ammonia refrigeration systems at the facility, Foster Farms has extensive administrative controls in place to maintain safe operation of the system.  Administrative controls include, but are not limited to, formal training programs for system operators and mechanics, emergency training, a hot work permit program, a lockout/tagout program, a contractor safety program, incident investigation program, mechanical integrity program, management of change program, pre start-up safety review program, and a RMP auditing and inspection program.  Written standard operating procedures (SOPs) have been prepared and are being reviewed for the ammonia systems at the facility.  The SOPs provide a basis for site specific operator traini"
    }
  ]
}