{
  "FacilityID": 4102,
  "FacilityName": "Plum Creek Wastewater Treatment Plant",
  "FacilityStr1": "91 Colorado Street",
  "FacilityStr2": null,
  "FacilityCity": "Verona",
  "FacilityState": "PA",
  "FacilityZipCode": "15147",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42003",
  "LEPC": "Allegheny County LEPC",
  "FacilityLatDecDegs": "40.514306",
  "FacilityLongDecDegs": "-79.821111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Municipality of Penn Hills",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Muncipality of Penn Hills",
  "OperatorStr1": "12245 Frankstown Road",
  "OperatorStr2": null,
  "OperatorCity": "Pittsburgh",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "15235",
  "OperatorZipCodeExt": null,
  "FTE": 19,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000049565",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-09-24 00:00:00",
  "DeRegistrationEffectiveDate": "2010-09-22 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 40.51446,
  "FRS_Long": -79.82116,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4771,
      "AltID": "Wastewater Treatment Plan",
      "FacilityID": 4102,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 5103,
          "ProcessID": 4771,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 4877,
          "ProcessID": 4771,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 2731,
              "Process_NAICS_ID": 4877,
              "SafetyReviewDate": "1999-03-28 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-05-13 00:00:00",
              "ChangeCompletionDate": "1999-06-15 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Portable heater and auxillary power generator available.",
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-15 00:00:00",
              "TrainingReviewDate": "1999-06-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-03-15 00:00:00",
              "EquipmentInspectionDate": "1998-03-15 00:00:00",
              "EquipmentTested": "Transfer hoses, vacuum regulators, chlorinators, and injectors.",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "Muncipal Wastewater Treatment Plant",
              "_chemicals": [
                {
                  "PrimaryKey": 2780,
                  "PreventionProgram2ID": 2731,
                  "ProcessChemicalID": 5103
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4102,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-03-28 00:00:00",
    "ERTrainingDate": "1998-06-17 00:00:00",
    "CoordinatingAgencyName": "Allegheny County LEPC",
    "CoordinatingAgencyPhone": "4124732550",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4102,
      "SummaryText": "\n                            EXECUTIVE SUMMARY\n\n                  PLUM CREEK WASTEWATER TREATMENT PLANT\n                          RISK MANAGEMENT PROGRAM\n\n\n1. Purpose\n\nChlorine is used as a disinfectant in the wastewater treatment.  The raw wastewater contains microorganisms that are harmful to human health.  Several treatment processes are utilized at the plant to treat the raw wastewater and a chlorination system provides disinfection of the final effluent prior to discharge.\n\n2. Storage\n\nChlorine is delivered to the treatment plant in one-ton containers and 150-lb cylinders.  A maximum of 4 one-ton containers and three 150-lb cylinders of liquified chlorine gas are stored on site.\n\n3.  Overview of the Wastewater Treatment Plant\n\nThe Plum Creek Wastewater Treatment Plant (PCWWTP) treats approximately 2.2 million gallons per day (MGD) of raw domestic wastewater at the treatment plant.  The chlorine used for disinfection is supplied from one-ton containers and 150-lb cylinders.  This is the only chemical substance at this facility that is regulated under U. S. EPA's Accidental Release Prevention Program.\n\nChlorine gas is primarily a respiratory irritant.  In sufficient concentrations, the gas irritates the mucous membranes, the respiratory tract and the eyes.  In extreme cases difficulty in breathing may increase to the point where death can occur from respiratory collapse or lung failure.  The characteristic, penetrating odor of chlorine gas usually gives warning of its presence in the air.  At high concentrations, it is visible as a greenish yellow gas.  Liquid chlorine in contact with the skin or eyes will cause chemical burns and/or frostbite.\n  \nChlorine containers and cylinders are thoroughly inspected for mechanical integrity and leaking valves prior to leaving the supplier's premises.  The containers are off-loaded from the delivery truck at the treatment plant by an overhead crane with a lifting beam that is specially designed for ton-containers.  PCWWTP pe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4102,
      "SummaryText": "rsonnel also inspect the off-loaded containers and cylinders.  One ton container and one 150-lb cylinder are connected to the chlorination system.  The other three one-ton containers are stored outside in a fenced area outside the chlorine room. There are two chlorinators that can deliver chlorine gas, at the correct flow rate, to the process water.  One system is normally active and the other system is on standby.  Although both systems can be used simultaneously, one system has more than adequate capacity to supply the required amount of chlorine to the process water.  \n\nThe liquid chlorine leaves the ton container as a gas.  There is one ton container and one 150-lb cylinder connected to a manifold; however, only the chlorine gas valve on the ton container is normally open.  This container is used until empty and then the 150-lb cylinder is put in service. The chlorine gas flows from the container to the manifold and then to the chlorinator.  The chlorine gas is drawn from the chlorinator by inducing a vacuum in the line after the chlorinator.  The flow of process water through an ejector creates a vacuum in the line and also mixes the chlorine gas with the process water.  Both the ton container and 150-lb cylinder are equipped with vacuum regulators.  If the water supply to the ejector is stopped, or the operating vacuum is lost for any other reason, the vacuum regulator immediately shuts off the chlorine gas supply from the container or cylinder.  The average chlorine usage is approximately 45 pounds per day. \n\n4.  Accidental Release Prevention\n\nAccidental releases of chlorine are prevented by routine training and adhering to the written operating procedures that cover the chlorination system from the ton-container and 150-lb cylinder unloading through the mixing of the chlorine gas with the process water.  These procedures cover normal operations and emergency operations where personnel may have to respond to an accidental release of chlorine.  The chlorine sy"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4102,
      "SummaryText": "stem is inspected at least once per shift and leak testing is performed on the valves and fittings when ton-containers are changed-out and at other times if a leak is suspected.  Employees that are responsible for disconnecting empty containers and connecting filled containers to the chlorination system have been trained on the operating procedures, inspection of valves, fittings, and the connected piping, and leak testing with an aqueous ammonia solution.  Aqueous ammonia reacts with chlorine gas to form a very visible white cloud. An outside contractor inspects the chlorination system and performs preventive maintenance on this system once per year and more frequently, if required.  This insures that worn or damaged parts are replaced and routine maintenance is performed on the chlorinators and other equipment.  These preventive measures have resulted in the absence of any accidental release of chlorine that resulted in personal injury or property damage since the treatment plant began operation.\n\nThe Chlorine Institute's Emergency Kits A and B are kept onsite and contain the necessary tools and equipment to repair most leaks in the 150-lb cylinders (Kit A) and ton containers (Kit B). Ton containers and 150-lb cylinders are equipped with fusible metal plugs that are designed to melt between 158OF and 165OF to relieve pressure and prevent rupture of the container in case of fire or other exposure to high temperature.  \n\nChlorine gas is heavier than air and will settle to the lowest elevation when released.  The chlorine storage area is equipped with an exhaust fan that is mounted near the floor on an outside wall.  There are also air intake vents located near the ceiling so that fresh air is circulated in the building.  The fan can be activated by a switch located outside the building and also by a switch inside the building. \n\n\n\n\n5.  Emergency Response Plan\n\nThe PCWWTP has developed an Off-Site Response Plan in the event of an accidental release of chlorine at the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4102,
      "SummaryText": " treatment plant.  This plan was developed in accordance with the provisions set forth in Title III of the Superfund Amendments and Reauthorization Act of 1986.  The plan assigns release response procedures to the emergency coordinator at the PCWWTP, Penn Hills Volunteer Fire Departments, Local Police, Emergency Medical Services, and the Allegheny County Emergency Management Coordinator.  The plan is updated as necessary, including the list of emergency telephone numbers.  Penn Hills Volunteer Fire Company No. 4 has visited the treatment plant on several occasions and is familiar with the chlorine system.\n\nIf a chlorine leak develops in a ton-container or 150-lb cylinder, or in the connected piping, valves, or other equipment, a chlorine monitor in the chlorine storage area or feed room area will activate an automatic dialup and a contract security firm will then notify the appropriate emergency responders.  The treatment plant is manned 24-hours per day, seven days per week. The PCWWTP have installed a windsock near the chlorine storage building so that the area that is likely to be affected by a chlorine release can be determined.      \n\n\n6.  Worst-Case and Alternate-Case Accidental Release Scenarios\n\nWorst-Case Release Scenario\nThe worst-case release scenario as postulated in the regulation (40 CFR 68.25) is the release of the greatest quantity (of chlorine) in a single vessel.  The entire contents of this vessel are assumed to be released, as a gas over a 10-minute period.  The largest single vessel at the treatment plant is a one-ton container; therefore, 2,000 pounds of liquid chlorine will be released as a gas over a 10-minute period.  A release of this magnitude would only be possible if the shell of the container failed and the liquid chlorine formed a pool and vaporized over a 10-minute period.  The likelihood of this type of catastrophic release is very minimal.  The off site consequence of this release was determined by use of U. S. EPA's RMP*Comp softwa"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4102,
      "SummaryText": "re.  The RMP*Comp results indicate that the chlorine concentration will exceed 3 parts per million (ppm) out to a radial distance of 1.3 miles from the chlorine storage room. This is the distance to the toxic endpoint. Beyond 1.3 miles the chlorine concentration will be less than 3 ppm. Short-term exposure to chlorine concentrations less than 3 ppm is not considered to be a health hazard.  The chlorine storage room is located on a hillside that slopes downward to the west and south. Based on the guidance provided in the regulation and U. S. EPA's Risk Management Program Guidance for Wastewater Treatment Plants, the area surrounding the treatment plant was classified as urban due to the presence of nearby buildings and other structures, trees, and hilly terrain.  The meteorological conditions associated with the worst-case release scenario, as prescribed in the regulation, is a wind speed of 1.5 meters per second (3.36 miles per hour) and very stable atmospheric conditions. These stable atmospheric conditions will limit the mixing of the chlorine gas with the ambient air as the gas travels downwind from the point of release.  The cloud formed by the chlorine release will grow in size and decrease in concentration as it travels downwind. \n\nAlternate-Release Scenario\nThe alternate release scenario is one that is more likely to occur than the worst case release scenario.  For this scenario, it was assumed that gas valve on the ton container is leaking and mitigation occurs in one hour.   This assumption is based on the alternate release scenarios listed in Edition 3 of The Chlorine Institute Pamphlet No. 74 - Estimating the Area Affected by a Chlorine Release, April 1998.  More than one-third of the contents of the ton-container (762 pounds) is released over a one-hour period.  For this scenario, the meteorological conditions prescribed in the regulation are neutral atmospheric stability conditions and a wind speed of 3 meters per second (6.7 miles per hour).   RMP*Comp"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 4102,
      "SummaryText": " was also used to determine the radial distance at which the chlorine concentration falls off to less than 3 ppm.   This distance to the toxic endpoint, as determined by RMP*Comp, is 0.10 miles (528 feet).   There are residences but no schools or hospitals within this radial distance. \n\nThe worst-case and alternate release scenarios are summarized in the Table 1 along with some additional information regarding population estimates, schools, hospitals and other building or recreation areas within the radial distance to the toxic endpoint.  Census data and the location of schools, hospitals, etc. were obtained from the LandView III mapping system that includes database extracts from U. S. EPA, the Bureau of Census, the U. S. Geological Survey, the Nuclear Regulatory Commission, the Department of Transportation, and the Federal Emergency Management Agency.\n\n7.  Planned Changes to Increase Safety\n  \n* Increase the frequency of practice drills to respond to an accidental release of chlorine to three times per year.\n\n\n\n\n                                     Table 1\n\n              Summary of the Worst-Case and Alternate Release Scenarios\n\n                                     Worst-Case Release      Alternate Release \n\nType of Accidental Release       Rupture of ton-container      Gas valve leak \n                                                                       \nQuantity of Chlorine Released           2,000 pounds             762 pounds\n\nDuration of Chlorine Release             10 minutes              60 minutes\n\nRate of Release of Chlorine Gas     200 lbs per minute      12.7 lbs per minute\n\nWind Speed                         1.5 m/sec(3.36 mph)       3.0 m/sec(6.7 mph)\n\nAtmospheric Stability Class          F (very stable)             D (neutral)\n        \nMethod used to determine toxic          RMP*Comp                  RMP*Comp\nendpoint\n\nChlorine concentration at                3 ppm                      3 ppm\nthe endpoint\n\nRadial distance to the            1.3 miles "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 4102,
      "SummaryText": "(6,900 feet)    0.1 miles (528 feet) \ntoxic endpoint\n\nEstimated population within               6,971                      55\nradial distance\n\nNumber of residences                      2,730                      21\n\nNumber of hospitals                          0                        0\n\nNumber of schools                            5                        0"
    }
  ]
}