{
  "FacilityID": 41409,
  "FacilityName": "CSL Behring L.L.C.",
  "FacilityStr1": "Route 50 & Armour Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Bradley",
  "FacilityState": "IL",
  "FacilityZipCode": "60915",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17091",
  "LEPC": "Kankakee County LEPC",
  "FacilityLatDecDegs": "41.1603",
  "FacilityLongDecDegs": "-87.8543",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "wwww.cslbehring.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "ZLB Behring L.L.C.",
  "OperatorStr1": "P.O. Box 511",
  "OperatorStr2": null,
  "OperatorCity": "Kankakee",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60901",
  "OperatorZipCodeExt": "0511",
  "FTE": 740,
  "OtherEPAFacilityID": "ILD000161422",
  "EPAFacilityID": "100000122002",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "96020048",
  "SafetyInspectionDate": "2009-08-11 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-10-16 14:12:44",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-11-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-11-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-11-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.0",
  "FRS_Lat": 41.16082,
  "FRS_Long": -87.85477,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 59499,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 41409,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 78783,
          "ProcessID": 59499,
          "ChemicalID": 56,
          "Quantity": 120000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 60874,
          "ProcessID": 59499,
          "NAICSCode": "325414",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 34433,
              "Process_NAICS_ID": 60874,
              "SafetyReviewDate": "2008-12-04 00:00:00",
              "PHA_Date": "2008-12-04 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-08-10 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-02-26 00:00:00",
              "TrainingReviewDate": "2009-02-26 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-10-01 00:00:00",
              "EquipmentInspectionDate": "2009-09-30 00:00:00",
              "EquipmentTested": "Condensor BAC S.E. Module",
              "ChangeMgmtDate": "2007-05-18 00:00:00",
              "ChangeMgmtReviewDate": "2009-08-18 00:00:00",
              "PreStartupReviewDate": "2006-02-14 00:00:00",
              "ComplianceAuditDate": "2009-08-11 00:00:00",
              "AuditCompletionDate": "2010-05-28 00:00:00",
              "IncidentInvestigationDate": "2008-11-01 00:00:00",
              "InvestigationChangeDate": "2009-03-24 00:00:00",
              "ParticipationPlansReviewDate": "2005-04-27 00:00:00",
              "HotWorkPermitReviewDate": "2007-05-16 00:00:00",
              "ContractorSafetyReviewDate": "2006-04-19 00:00:00",
              "ContractorSafetyEvalDate": "2007-05-04 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 50233,
                  "PreventionProgram3ID": 34433,
                  "ProcessChemicalID": 78783
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 41409,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-08-14 00:00:00",
    "ERTrainingDate": "2009-10-13 00:00:00",
    "CoordinatingAgencyName": "Bourbonnais Fire Dept.",
    "CoordinatingAgencyPhone": "8159339670",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 41409,
      "SummaryText": "arios (a worst-case release and an alternative release) were analyzed to determine the maximum distance to an endpoint where the ammonia concentration is 200 parts per million in air, or 0.02 percent.  This endpoint represents the maximum airborne concentration below which nearly all individuals could be exposed for up to 1 hour without experiencing or developing irreversible effects or symptoms that could affect their ability to take protective action.\n\nThe release scenarios analyzed are based upon the guidance contained in the USEPA's Risk Management Program Guidance for Ammonia Refrigeration (the Model Plan), dated November 1998.  This guidance document used the SACRUNCH atmospheric dispersion model to construct lookup tables that relate the quantity and rate of ammonia released to the endpoint distance.\n\n2.1 WORST-CASE RELEASE\nThe worst-case release is considered to be defined (according to the RMP Rule) by the catastrophic rupture and complete loss of the maximum contents of the HP receiver (approximately 50,784 pounds of ammonia) over a 10-minute period.  Using the specified worst-case meteorology contained in the Model Plan, the distance to the endpoint for a worst-case release was estimated to be 13,834 feet or 2.62 miles.\n\nAlthough the worst-case consequence analysis is required by the RMP, it should be considered a highly unlikely event.  Design, construction, and operation of the HP receiver is such that worst-case failure is extremely remote.  The receiver was designed and constructed in accordance with the American Society of Mechanical Engineers (ASME) Boiler and Pressure Vessel Code (Section VIII), and was certified and stamped by the National Board of Pressure Vessel Inspectors (National Board).  Third party and state mandated inspections of the vessel's condition occur every three years by a representative of the State Fire Marshall's office.  In addition, the vessel is inspected daily by plant motive power personnel trained in the operation of"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 41409,
      "SummaryText": "EXECUTIVE SUMMARY\n1.0 SOURCE AND PROCESS DESCRIPTION\n1.1 SOURCE\nThe CSL Behring L.L.C., Bradley, Illinois, pharmaceutical manufacturing facility is subject to the United Stated Environmental Protection Agency's (USEPA's) Risk Management Program (RMP) for Accidental Chemical Release regulation (40 Code of Federal Regulations [CFR] 68) because it has a refrigeration system that contains more than the threshold quantity (10,000 pounds) of anhydrous ammonia (ammonia) (Chemical Abstract System [CAS] Number 7664-41-7).  Anhydrous ammonia (NH3) is a gas at ambient conditions.  The ammonia refrigeration system is used to control the processing and room temperature for plasma-derived and related products.  It is a closed system that contains approximately 85,000 pounds of ammonia in various physical states (gas, liquid, and saturated vapor).  The vessel that can contain the largest volume of ammonia is the high-pressure (HP) receiver. The vessel operates at approximately 150 to 180 pounds per square inch gauge (psig) and can contain as much as 50,784 pounds of liquid ammonia.  However, during typical operation, the vessel holds only about 10,000-15,000 pounds.  Most of the ammonia equipment is located indoors.  The HP receiver, condensing towers, some chillers, and most piping runs are located outdoors.\n\nAmmonia is the oldest and most common refrigerant in general industrial use throughout the world.  It is a high capacity refrigerant that operates at reasonable pressure.  At this facility, personnel exposure to more than a small leak is rare because ammonia operates within a closed system of vessels, piping, and equipment and its self-alarming properties allow for immediate detection and response.\n\n1.2 PROCESS DESCRIPTION\nCSL Behring's ammonia refrigeration system is a two-stage system consisting of a high pressure (HP) side and a low pressure side.  The Building No. 4 chillers operate on the low side (i.e., low pressure) to quickly chill alcohol or cool room air.  Ammonia"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41409,
      "SummaryText": "suction from the Building No. 4 equipment at about -10 psig passes through the low side accumulator before entering the low-back compressors.  Liquid ammonia in the low side suction is trapped in the low side accumulator and returned to the high side accumulator.  The booster compressor discharge is desuperheated in the high side accumulator before entering the high side compressors.\nThe high side compressor suction draws from the high side suction accumulator at about 20 psig.  This accumulator receives suction from various chiller units.  Excess ammonia liquid that collects in the high side accumulator is removed and returned to the system.\n\nThe major discharge from the high side compressors (hot gas), at 150 to 175 psig, is vented to 15 condensing towers.\n\nThe condensed liquid is returned to the HP receiver where it is fed to the low and high side equipment, including the chillers and room coolers.\n\nThe ammonia refrigeration system is well protected by the existence of specific safety systems and hardware, including safety relief valves, engine room ventilation, and system safety interlocks.  Safety relief valves protect the HP receiver, compressor discharge, condensers, suction accumulators, oil pots, and pump-out system from the hazards associated with overpressure.  Safety interlocks include HP and high temperature alarms and cutouts for the compressors, as well as high level floats and sensors for vessels.\n2.0 POTENTIAL RELEASE SCENARIOS\nCSL Behring's refrigeration system is a totally closed system.  Historically, releases of ammonia from industrial refrigeration systems most often occur from leaking valves, malfunctioning pressure relief devices, or inadvertent releases during repair activities.  While these incidents can impact employees, this facility has never experienced a release of a reportable quantity that represented an off-site impact (i.e., beyond the property line).\n\nConsistent with the RMP rule requirements, two specifically defined release scen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 41409,
      "SummaryText": "the system.\n\n\nThere are only two potential causes for a worst-case scenario involving an HP receiver:  (1) the internal pressure increases uncontrollably and ruptures the vessel from the inside; or (2) rupture of the vessel wall occurs due to inadvertent contact (e.g., vehicular) from the outside.\n\nThe vessel at CSL Behring is operated well below the design pressure (i.e., maximum allowable working pressure) of 250 psig and because of the safety factors built into the ASME Code, a fourfold pressure excursion, to approximately 1,000 psig, would have to occur before a worst-case vessel failure.  Such pressures could not be generated internally.  The only logical external cause of high pressure would be flame impingement or surface heat from a high challenge fire adjacent to the vessels.  If this were to occur, the vessel is equipped with safety relief valves (SRVs) set to relieve internal pressure at 250 psig.  A high pressure excursion would not occur as long as the SRVs continued to function.  Actuation of the SRVs would result in an ammonia release similar to that described in Section 2.2 for the alternative-release scenario.  The SRVs are on a 5-year replacement schedule, in compliance with the International Institute of Ammonia Refrigeration (IIAR) guidance contained in IIAR Bulletin Number 109, Minimum Safety Criteria for a Safe Ammonia Refrigeration System, in an effort to ensure that they will function properly when required.\n\nFurthermore, inadvertent vehicular contact with the vessel is unlikely since the unit is protected with substantial barrier protection designed to preclude this occurrence.  (The vessel is located beneath the evaporative condensers.)\n \nThe worst-case release scenario is unlikely for the following additional reasons:\n\nÂ· The worst-case weather conditions which were used for this scenario are uncommon;\n \nÂ· Typically, the receiver contains only 10,000-15,000 pounds of ammonia;\n \nÂ· Industry standards were followed for the manufacture and q"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 41409,
      "SummaryText": "uality control of this receiver;\n\nÂ· Ammonia is not corrosive in this service and the vessel is less than ten years old;\n \nÂ· Safety relief valves limit operating pressures in the receiver;\n \nÂ· The facility has a preventive maintenance program in place designed to maintain the ongoing integrity of the vessel;\n \nÂ· The facility has a training program designed to ensure that the system is operated by qualified personnel;\n \nÂ· The facility has emergency response procedures designed to enable trained personnel to respond quickly to isolate any potential releases;\n \nÂ· Main ammonia shut-off valves exist that are designed to allow personnel to stop the flow of ammonia quickly in an emergency;\n \n2.2 ALTERNATIVE-CASE RELEASE\n The alternative-case release scenario is considered to be defined (according to the Model Plan) by a release of ammonia through a one-quarter-inch effective diameter hole in a high side (i.e., 150 psig) pipe or vessel, releasing 118 pounds of ammonia per minute for up to 60 minutes.  This release is representative of a small pipe or vessel leak.  Because the HP receiver and some piping are located outdoors, passive (building) mitigation was not used to reduce the release rate or the distance to the endpoint.  Active mitigation was considered, because it is believed that emergency responders could identify and stop the leak in less than 60 minutes.  However, a rapid response does not change the TEP distance obtained from the Model Plan.\n \n Using the specified meteorology contained in the Model Plan, the distance to the endpoint for the more likely release scenario was estimated to be 450 feet or 0.1 miles.\n \n As with the worst-case scenario, the alternative-release scenario is unlikely for the following reasons:\n \nÂ· Industrial standards were followed for the manufacture and quality control of these lines;\n \nÂ· Ammonia is not corrosive in this service;\n Â· The fact that most of the lines are elevated minimizes potential damage from fork lifts;\n \nÂ· T"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 41409,
      "SummaryText": "he facility has a preventive maintenance program in place designed to maintain the ongoing integrity of the system;\n \nÂ· The facility has a training program designed to ensure that the system is operated by qualified personnel; and\n \nÂ· The facility has emergency response procedures designed to enable trained personnel to respond quickly to isolate potential releases by closing valves in the liquid lines.\n \n3.0 PREVENTION PROGRAM\n The facility has carefully considered the potential for accidental releases of ammonia, such as the potential occurrence of the worst-case and alternative-release scenarios described in Section 2.0.  In an effort to minimize the probability and severity of an ammonia release, a prevention program that satisfies the Occupational Safety and Health Administration, Process Safety Management of Highly Hazardous Chemicals standard (29 CFR 1910.119) has been implemented.  The key components of the prevention program are summarized below:\n \nÂ· The development, documentation, and availability of critical process safety information regarding ammonia, the design basis of the system, and the equipment.  This information is used in an effort to fully understand and safely operate the ammonia refrigeration system.\n \nÂ· The development of an employee participation program, which includes employees throughout the organization and from a cross section of areas within the plant (i.e., production and maintenance).  This program also assumes that employees that utilize the ammonia system and are most knowledgeable about it are best able to easily, effectively, and regularly recommend changes or improvements which enhance safety.\n \nÂ· The performance of a formal process hazard analysis (PHA), using the What-if... technique.  A team with expertise in engineering, operations, maintenance, and safety evaluated the existing refrigeration system in depth and developed recommendations designed to enhance the safety and operability of the system.  The PHA addressed"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 41409,
      "SummaryText": ":  (1) process hazards; (2) previous incidents, if any; (3) engineering and administrative controls applicable to the hazards; (4) the consequence of control failure; (5) facility siting; (6) human factors; and (7) a qualitative evaluation of possible safety and health effects of control system failures.  The PHA resulted in multiple procedural and/or hardware recommendations designed to enhance the safety and operation of the refrigeration system.  These recommendations are in the process of being resolved and many changes have already been implemented.  The PHA will be updated and revalidated every 5 years.\n Â· Written operating procedures (OPs) were prepared that are designed to provide the basis for proper and safe operation of the ammonia refrigeration system.  The OPs include procedures for normal operation, startup, shutdown, emergency operation, and emergency shutdown.  They also describe safe operating limits for temperature and pressure, the consequences of operating outside these safe operating limits, and a description of safety systems and how they operate.\n \nÂ· Refrigeration system operators receive refresher training at least every 3 years.  The training content is based upon the process safety information and operating procedures.  The training program is designed to ensure that the operators understand the nature and causes of problems that may arise from system operation as well as the potential hazards particular to ammonia and the refrigeration process.\n \nÂ· Formal authorization systems (i.e., management of change procedure, pre-startup safety review) are in place that are designed to ensure that system changes or expansions are as safe as the original design and that an independent recheck, prior to start-up, confirms that the changes are consistent with the engineering design and safety requirements.\n \nÂ· Events that might (or did) cause an accidental or unexpected release of ammonia are subjected to a formal investigation.  The objective of th"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 41409,
      "SummaryText": "e investigation is to address issues in such a way as to prevent recurrence.\n \nÂ· Contractors that are hired to work on, or adjacent to, the refrigeration system are pre-qualified based upon their knowledge of ammonia refrigeration, understanding of applicable codes and standards, and their demonstrated ability to work safely.  \n \nÂ· Prior to the performance of any hot work (i.e., spark or flame producing operations such as welding, cutting, brazing, and grinding), management must approve the work by executing a written hot work authorization permit to verify that appropriate precautions to prevent fire have been implemented.\n \nÂ· Periodic walk-throughs occur to find unusual or increasing vibration, incipient leaks, corrosion, or other indications of potential upsets or failures that could lead to a release.\n \nÂ· Replacement of pressure relief valves every 5 years.\n \nÂ· Numerous safety systems including pressure relief valves, monitors, ammonia vessel level controls, and safety interlocks are used in the refrigeration system.\n \nÂ· Periodic inspection and calibration is performed on liquid level sensors, temperature and pressure instruments, switches and shutdown devices that have safety implications.\n\nÂ· Periodic inspections are performed for major powered equipment, including compressors, pumps and large fans, bearings, couplings, shaft seals, mountings, etc., for vibration or incipient mechanical failure.\n\nÂ· Proper design including adherence to recognized safety codes, such as the International Institute of Ammonia Refrigeration (IIAR).\n \nÂ· Adherence to fire codes and preparation for fires, storms, or events which could impact the ammonia system.\n \nÂ· Planning with the local fire department to ensure a rapid response to potential incidents involving the system or external events, such as floods or tornadoes.\n \nÂ· Prevention program compliance audits performed every 3 years to verify that the elements are being properly implemented.  Any issues found in an audi"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 41409,
      "SummaryText": "t are addressed in accordance with an action plan.\n\n\n\n\n\n4.0 ACCIDENT HISTORY\nThe facility has not experienced a release of ammonia within the past 5 years that has resulted in on-site death, injury, or significant property damage or off-site death, injury, evacuation, sheltering in place, property damage, or environmental damage.\n\n5.0 EMERGENCY RESPONSE PROGRAM\nThe facility has implemented a detailed written Emergency Response Plan (ERP).  The ERP is intended to address emergencies at the facility in addition to incidents related to a release of ammonia.\n\nThe ERP includes education and response training for employees, coordination with the local fire department, coordination with the Local Emergency Planning Committee (LEPC), and evacuation of the facility and surrounding area.  Additionally, the plan details the procedures for:  (1) pre-emergency planning; (2) emergency recognition and prevention; (3) site security and control; (4) decontamination; (5) emergency medical treatment and first aid; (6) emergency alerting and response; and (7) personal protective and emergency equipment.\n\nCSL Behring maintains emergency response personnel on all shifts.  Members of the response team participate in 40 hours of initial training, 8 hours of annual refresher training, as well as monthly training exercises."
    }
  ]
}