{
  "FacilityID": 41424,
  "FacilityName": "Norwich Fluids, Inc.",
  "FacilityStr1": "13807 Main Street",
  "FacilityStr2": null,
  "FacilityCity": "Queen Anne",
  "FacilityState": "MD",
  "FacilityZipCode": "21657",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24035",
  "LEPC": "Queen Anne's County LEPC",
  "FacilityLatDecDegs": "38.922639",
  "FacilityLongDecDegs": "-075.956389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "wsylvest@bluecrab.org",
  "FacilityDUNS": 185775285,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Bill Sylvester",
  "OperatorStr1": "P.O. Box 260",
  "OperatorStr2": "13807 Main Street",
  "OperatorCity": "Queen Anne",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21657",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bill Sylvester",
  "RMPTitle": "President",
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000124288",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-06-30 00:00:00",
  "SafetyInspectionBy": "Maryland Department of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-12-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-12-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-12-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-02-09 00:00:00",
  "DeRegistrationEffectiveDate": "2006-09-01 00:00:00",
  "AnniversaryDate": "2009-12-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": 38.91932,
  "FRS_Long": -75.95408,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 59516,
      "AltID": "aqua ammonia storage tank",
      "FacilityID": 41424,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 60891,
          "ProcessID": 59516,
          "NAICSCode": "325314",
          "_desc": {
            "NAICS_CODE": "325314",
            "NAICS_DESCRIPTION": "Fertilizer (Mixing Only) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 78801,
          "ProcessID": 59516,
          "ChemicalID": 57,
          "Quantity": 96000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 578801,
          "ProcessID": 59516,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41424,
      "SummaryText": "Norwich Fluids, Inc.\n13807 Main Street\nQueen Anne, Md. 21657\n\nTo the best of the undersigned's knowledge, information, and belief formed after reasonable evaluation and by actual knowledge of the facility and processes, the information is true, accurate, and complete.\n\n\n________________________                      Bill Sylvester\nSignature                                                       Print Name\n\n\n________________________                      _______________________\nTitle                                                                Date\n\n\nExecutive Summary- Aqua Ammonia\n\n\n\nDescription of Our Facility\n\nNorwich Fluids is a retail/wholesale farm supply distribution center. We store and distribute a wide variety of fertilizers and pesticides. At this time all of our fertilizers are fluid in state. One of the componets of many of the fertilizers we make is aqua ammonia. This Aqua ammonia is reacted with phosphoric acid to create pH balanced ortho-phosphoric fertilizers.Aqua ammonia is shipped by truck to Norwich. All aqua ammonia is used on site. It is not sold retail/wholesale in its ammonia form. Aqua ammonia is a substance regulated by the EPA requiring us to comply with the Risk Managment Program.\n\nAqua ammonia is stored at the plant in a storage tank that is used exclusively for aqua ammonia. The size of the tank is 20,000 gallons. It is never filled over 80% full. Tank levels are monitored via a sight guage mounted on the side of the tank. Although we allow the tank to be filled to 80% (16000 gallons) full more typically it is much less full than that. Because we bring ammonia in by truck we can allow the tank volume to go much lower than that. Aqua ammonia is typically not ordered until the tank has 3000 to 6000 gallons left in it. This volume equates to 1/2 to 1 truckload.\n\nWorst Case Scenario\n\nOur worst case scenario is the loss of the entire contents of the 20,000 gallon storage tank, when filled to the greatest volume allowed (80% of capacity or 1600"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41424,
      "SummaryText": "0 gallons). According to RMP Comp modeling, this release (distance from point of dispersion to 200 ppm) would have off site impact. It should be noted that Norwich Fluids has never had a release of the entire contents from its ammonia storage tank or any other tank in its history. It should also be noted that the aqua ammonia storage sits inside a secondary containment area (dike)  which provides passive mitigation. \n\nAlternative Release Scenario\n\nThe alternative release scenario for this plan would be a transfer hose failure which would result in a loss of 2000 pounds of ammonia solution over 10 minutes. The release scenario (distance from dispersion point to 200 ppm) would have off site impact. Itshould be noted that Norwich Fluids has never had a transfer hose failure in its history. Also, Norwich feels that even in the unlikely event of a transfer hose failure, loss of product would be much less than the 2000 pounds indicated. Trucks delivering product are double valved as is our storage tank. Should a hose burst and a vave fail there are manual backup valves in place. It should also be noted that trucks unloading are never left unattended.\n\n\nGeneral Accidental Release Prevention Program:\n\nOur aqua ammonia system, and all other systems, are inspected on a daily basis. Preventative maintainance is done immediately when needed. All valves all closed and locked each night at closing. Norwich Fluids complies with all Fedral, State, and Local laws. Where laws are absent or not applicable we operate by industry standards and common sense. All products, not just aqua ammonia, that could have a negative environmental impact if released are stored in ares with secondary containment (dikes). In addition, in the unlikely event of storage tank failure and secondary containment failure the lowest point on Norwich Fluids' property has a berm which can be closed off to slow down or prevent any products from leaving the property.\n\n\n\n\n\n\nFive Year Accident History:\n\nThere have be"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41424,
      "SummaryText": "en no accidents involving aqua ammonia that caused deaths, injuries, property or environmental damage, including evacuations on or off site\n\nEmergency Response Program:\n\nIn the event of an emergency involving our ammonia system, it is our policy to notify the local community fire department  and request that they respond to the emergency. In preparation for this we will coordinate with all of the local response agencies by providing information and facility tours to ensure that they are familiar with and properly prepared for an incident at our facility. This will help to ensure that our community has the strategy  for responding to and mitigating the threat posed by an ammonia release. This complies with the requirement for our facility to be included in the community emergency response plan prepared under EPCRA and coordinated with our LEPC.\n\nPlanned Changes to Improve Safety:\n\nWe do not plan to make any changes to the physical site. We will continue to provide our employees with ongoing  training to ensure that they are current with safe aqua ammonia transfer and handling procedures. We will also provide regular inspection and maintainance on all of the ammonia equipment."
    }
  ]
}