{
  "FacilityID": 41440,
  "FacilityName": "Brenntag Southwest, Inc. Houston",
  "FacilityStr1": "14826 Hopper Road",
  "FacilityStr2": null,
  "FacilityCity": "Houston",
  "FacilityState": "TX",
  "FacilityZipCode": "77047",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-",
  "FacilityLatDecDegs": "29.588611",
  "FacilityLongDecDegs": "-095.406111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "Brenntag.com",
  "FacilityEmailAddress": "ghill@brenntag.com",
  "FacilityDUNS": 117432922,
  "ParentCompanyName": "Brenntag, Inc",
  "Company2Name": null,
  "CompanyDUNS": 92963644,
  "Company2DUNS": null,
  "OperatorName": "Garry W. Hill",
  "OperatorStr1": "206 East Morrow Road",
  "OperatorStr2": null,
  "OperatorCity": "Sand Springs",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74063",
  "OperatorZipCodeExt": null,
  "FTE": 25,
  "OtherEPAFacilityID": "TXD062128004",
  "EPAFacilityID": "100000042884",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-01-30 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-12-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-12-03 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-11-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2018-12-04 00:00:00",
  "DeRegistrationEffectiveDate": "2018-11-28 00:00:00",
  "AnniversaryDate": "2009-11-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.3",
  "FRS_Lat": 29.588669,
  "FRS_Long": -95.405263,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R08",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility has been shutdown. Brenntag does not operate a facility at this address",
  "_processes": [
    {
      "ProcessID": 59540,
      "AltID": "Storage & Handling",
      "FacilityID": 41440,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 78825,
          "ProcessID": 59540,
          "ChemicalID": 31,
          "Quantity": 45000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 60915,
          "ProcessID": 59540,
          "NAICSCode": "42469",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 41440,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-04-23 00:00:00",
    "ERTrainingDate": "2004-04-23 00:00:00",
    "CoordinatingAgencyName": "Fire Department",
    "CoordinatingAgencyPhone": "7132475000",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41440,
      "SummaryText": "INTRODUCTION\n\nBrenntag Southwest, Inc., is a chemical distribution company headquartered in Longview, Texas with Corporate Regulatory Offices in Sand Springs, Oklahoma, which has several branches located in Kansas, Oklahoma, Texas, Louisiana, and Alabama.  Brenntag Southwest participates in the Responsible Distribution Process program of the National Association of Chemical Distributors (NACD). The Community Outreach and Emergency Response Plan of Responsible Distribution Process brings chemical distribution plants and local communities together through communications and cooperative emergency planning.  The company is also a long-term member of the Chlorine Institute, a worldwide organization that focuses on the safe handling of chlorine and other chemicals. Brenntag Southwest is an ISO-9002 certified company with Health, Safety, and Environmental policies and procedures in place, which are designed to prevent emergencies such as fires, explosions and accidental chemical releases. \n\nBrenntag Southwest is a Business Unit of Brenntag, Inc., which serves customers worldwide with products, chemicals, and advanced materials. The company ranks among the top chemical distribution firms in North America. It is the worldwide policy of Brenntag to design, blend and distribute its products and to handle materials throughout their life cycle in a manner that protects the environment and safeguards employees, customers and the public from unacceptable risk. \n\nPLANT DESCRIPTION\n\nThe Brenntag Southwest facility is located in the south central part of Harris County on the south side of the City of Houston, which is in the state of Texas.  The company employs 25 full-time employees who carry out distribution activities that include the storing and handling of Cyclohexylamine in compliance with Prevention Program Level 1.  The Environmental Protection Agency (EPA) considers each of this product hazardous.  The facility provides this material and other quality products to customers i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41440,
      "SummaryText": "n Texas and other surrounding states.\n\nPRODUCTS\n\nCyclohexylamine is used in water treatment, as a rubber accelerator, and intermediate in organic synthesis.  The same properties that make this chemical valuable as a commodity also make it necessary to observe certain safety precautions when handling to reduce the threat to nearby members of our community as well as to the employees of the company.  It is our policy to adhere to all applicable Federal, State and Local regulations. \n\nACCIDENTAL RELEASE & EMERGENCY RESPONSE POLICIES\n\nBrenntag Southwest owns emergency equipment specifically designed to be able to stop leaks from containers of these products.  Brenntag maintains employees who are trained in the specialized use of this emergency equipment and also maintains agreements with area response companies who are equipped to respond to emergencies.  \n\nThe Emergency Programs in place at the facility include an Emergency Action Plan, Fire Prevention Plan, Emergency Response Plan, and a Transportation Emergency Plan.  These plans require the facility to maintain an open door policy with local fire departments and other emergency groups in the area, and to invite emergency responders from both the public and private sectors to tour the facility annually in order to gain knowledge of the physical setup of the plant.  This information becomes very valuable during an emergency incident.  These plans also direct the facility to maintain a working relationship with area clinics and hospitals in order to be prepared during emergency events of any kind.   \n\nACCIDENT PREVENTION PROGRAM & CHEMICAL SPECIFIC ACCIDENT PREVENTION PROGRAM\n\nBrenntag Southwest, Inc., maintains Health, Safety and Environmental policies for Risk Management, Training, Product Stewardship, Community Outreach, Hazard Communication, and Process Safety Management among others.  These policies require careful review of the hazards and the safeguards that must be implemented to prevent releases of regulated c"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41440,
      "SummaryText": "hemicals. In conjunction with these numerous training programs, the company also complies with container specifications, inspections, and testing requirements of laws in-acted by the Department of Transportation.  Still other programs such as the NACD's Responsible Distribution Process, and guidance implemented based on EPA's SARA Title III regulations along with BOCA Building and Fire Codes have aided the company in designing and operating a safe plant.  These programs and regulations coupled with company policy help to ensure that the possibility of a release of this magnitude would never occur at the facility.  \n\nFIVE-YEAR ACCIDENTAL RELEASE HISTORY\n\nThe Brenntag Southwest Houston branch has not had a release of any magnitude that caused the facility to implement evacuation measures.\n\nEMERGENCY RESPONSE PROGRAM\n\nThis facility has emergency plans, which are coordinated with local fire departments and the Local Emergency Planning Committee (LEPC).  For the toxic and flammable products, the company¿s emergency release plans are based off of information from the manufacturers of these materials. The emergency response plans for all company facilities include procedures for notification of any potentially affected neighbors, the local fire authority, and federal, state, and local agencies.\n\nSUMMARY\n\nIn order to continue to improve upon its safety record, Brenntag Southwest requires all of its facilities to conduct incident investigations, safety compliance audits, continuous training of normal, and emergency procedures, and continuous community outreach actions which include: educating and training neighbors, customers, fire departments, and emergency response teams.  These policies along with improvements that have originated from internal programs such as the Employee Suggestion Program and from external sources such as industrial associations aids the company in its continuous effort to enhance the safe handling and storage of all of its products."
    }
  ]
}