{
  "FacilityID": 41596,
  "FacilityName": "LANXESS Baytown Plant",
  "FacilityStr1": "8500 West Bay Rd",
  "FacilityStr2": null,
  "FacilityCity": "Baytown",
  "FacilityState": "TX",
  "FacilityZipCode": "77520",
  "Facility4DigitZipExt": "9730",
  "FacilityCountyFIPS": "48071",
  "LEPC": "Baytown (Texas) LEPC",
  "FacilityLatDecDegs": "29.757500",
  "FacilityLongDecDegs": "-094.903056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.us.lanxess.com",
  "FacilityEmailAddress": "info@lanxess.com",
  "FacilityDUNS": 149047230,
  "ParentCompanyName": "LANXESS Deutschland GmbH",
  "Company2Name": null,
  "CompanyDUNS": 333335490,
  "Company2DUNS": 333335490,
  "OperatorName": "LANXESS Corporation",
  "OperatorStr1": "8500 West Bay Rd",
  "OperatorStr2": null,
  "OperatorCity": "Baytown",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77520",
  "OperatorZipCodeExt": "9730",
  "FTE": 5,
  "OtherEPAFacilityID": "77520MBYCR8500",
  "EPAFacilityID": "100000190205",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "Ci-0016-S",
  "SafetyInspectionDate": "2004-04-22 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2007-11-20 13:10:03",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-12-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-12-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-12-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.3",
  "FRS_Lat": 29.759767,
  "FRS_Long": -94.907294,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 59732,
      "AltID": "Manufacturing",
      "FacilityID": 41596,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 79048,
          "ProcessID": 59732,
          "ChemicalID": 118,
          "Quantity": 120000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 61113,
          "ProcessID": 59732,
          "NAICSCode": "32511",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 34584,
              "Process_NAICS_ID": 61113,
              "SafetyReviewDate": "2001-10-22 00:00:00",
              "PHA_Date": "2001-10-22 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2005-03-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-09-23 00:00:00",
              "TrainingReviewDate": "2004-09-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer-Based Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-07-22 00:00:00",
              "EquipmentInspectionDate": "2004-03-25 00:00:00",
              "EquipmentTested": "Maleic pilot reactor",
              "ChangeMgmtDate": "2004-09-08 00:00:00",
              "ChangeMgmtReviewDate": "2002-08-22 00:00:00",
              "PreStartupReviewDate": "2004-10-20 00:00:00",
              "ComplianceAuditDate": "2003-12-15 00:00:00",
              "AuditCompletionDate": "2004-12-15 00:00:00",
              "IncidentInvestigationDate": "2004-05-19 00:00:00",
              "InvestigationChangeDate": "2004-08-30 00:00:00",
              "ParticipationPlansReviewDate": "1998-04-20 00:00:00",
              "HotWorkPermitReviewDate": "2003-09-23 00:00:00",
              "ContractorSafetyReviewDate": "2004-10-01 00:00:00",
              "ContractorSafetyEvalDate": "2004-05-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 50421,
                  "PreventionProgram3ID": 34584,
                  "ProcessChemicalID": 79048
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 41596,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2001-02-21 00:00:00",
    "ERTrainingDate": "2004-10-27 00:00:00",
    "CoordinatingAgencyName": "Baytown (Texas) LEPC",
    "CoordinatingAgencyPhone": "2814206558",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "(CAA) Title V",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41596,
      "SummaryText": "LanXess Baytown Executive Summary\n\n\nAccident Release Prevention\n\nEmployee health and safety, security, environmental protection, and quality are core values of LanXess Corporation, founded on the global principles of quality management, progressive stewardship, and sustainable development\n- Ensuring that the necessary resources are available, including training, to achieve our HSEQ objectives\n-  Holding all employees responsible and accountable for improving HSEQ performance \n- Monitoring and auditing the HSEQ aspects of our business, including non-conformance \n-  Seeking and sharing best practices, both inside and outside the organization\nLanXess has a strong commitment to the safety and health of our employees. In fact, we have a commendable safety record based upon statistics. Our goal is to not see a single employee injured, and that requires a constant vigilance by all employees.\n\nDescription of the Facility\n\nLanXess Corporation has recently been formed.  Formerly a portion of the Bayer Corporation group, Lanxess has become a separate and intact company.\n\nLocated in the Bayer Baytown Industrial Park, Lanxess operates a facility which manufactures maleic anhydride (used in unsaturated polyesters for synthetic marble countertops, bowling balls, and in lubrication oil additives).   LanXess manages the operation which is staffed by Bayer MaterialScience operators and supervisors.\n\nThe Bayer Baytown Industrial Park is located in West Chambers County on 1,700 acres along Cedar Bayou.  The site is serviced by barge, rail and truck and has pipeline service to and from industry along the Houston Ship Channel region.\n\nRisk Management Program (RMP)\n\nLanxess Baytown has one process covered under RMP.   The process also is a PSM- covered process and is considered to be Program Level III processes under the scope of Risk Management Program.\n\nThere is one chemical used in quantities greater than the threshold quantities defined in the RMP regulations: Butane.\n\nAt the time of"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41596,
      "SummaryText": "separation from Bayer Corporation, Lanxess Baytown operated two facilities, both of which were covered by RMP.  Lanxess has made a decision to shutdown and dismantle one of the operating facilities.  Covered chemicals in that unit included ammonia and ammonia solution (>20%) which will no longer be on-site as of this submission.\n\nManagement of Risk\n\nThe site is covered by Process Safety Management (PSM).  PSM elements are:\n\nEmployee Participation:\nEmployees participate on numerous safety steering committees that potentially affect the work life of each area at the Baytown Industrial Park site.  Action items that are identified from inspections, incidents, process hazards analyses, etc. are provided to employees for review.\n\nProcess Safety Information:\nAll site personnel have access to the company¿s electronic mail system and Intranet.  Chemical-specific information (Material Safety Data Sheets), operating information, and information on the equipment in the process are easily accessible.  The information resides in a controlled electronic system that is updated regularly.  All Process Safety Information (PSI) is verified at each scheduled process hazards analysis.\n\nProcess Hazards Analysis:\nEvery five years, process hazards analyses (PHA¿s) are conducted in each process.  The HazOp method is used to conduct PHA¿s.  Findings are identified, prioritized and then promptly corrected.  The information is shared with personnel who are impacted by the findings.  The action items and completion schedules are available through the electronic system.\n\nOperating Procedures:\nOperating procedures that address normal and abnormal operating situations are in place.  Deviations from established operating limits and the consequences of these deviations are clearly identified and easily referenced.   The procedures are reviewed annually to assure accuracy.\n\nTraining:\nTraining on these operating procedures is ongoing to assure that operators know and understand the safe operation of t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41596,
      "SummaryText": "heir unit and that they understand the necessary actions for abnormal situations.  Employee training is documented and tracked through a network system.  The system allows specific training needs to be identified as well as tracks the completion of required modules. \n\nContractor Safety:\nControl of contractor activity in operating areas is well established.  A safety steering committee and safety council actively monitors the actions of contractors to assure their safety, the safety of the Bayer facility and its employees. Contract employees are required to participate annually in comprehensive industry safety training. \n\nPre-Startup Safety Reviews:\nReviews are conducted of any new facility, major modification, or a change (management of change) before the new system can become operational.  Findings are addressed prior to startup.\n\nMechanical Integrity:\nMechanical integrity procedures are in place to ensure that maintenance workers understand how to perform their duties safely to maintain the facility.  Specific instructions for testing and inspections are included.  Testing and inspections are conducted as scheduled and documented.  Maintenance and engineering follow established codes, standards and company guidelines.\n\nHot Work and Control of Abnormal Activities:\nControl of hot work and abnormal situations is conducted to ensure that work does not contribute to or cause hazardous results.  All aspects of hot work and abnormal situations are controlled.\n\nManagement of Change:\nThe proper management of change generates appropriate assessment of possible impacts on the level of safety and health on an area.  All impacted documents and procedures are altered as required.  Appropriate personnel are informed regarding changes before they operate the new system.\n\nIncident Investigations:\nIncidents, injuries and near-miss situations are investigated.  Root causes are identified and documented.  Changes in the system are made to prevent recurrence.  Incident reports are rea"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 41596,
      "SummaryText": "dily available to assist other areas in preventing similar occurrences.  \n\nCompliance Audits:\nA site-wide compliance audit is conducted every three years of the PSM-RMP program.  An audit team made up of hourly employees, supervision, and contractors conduct these audits.  Deficiencies are documented and corrected in a timely manner.  Open action items are tracked through completion.\n\n\nChemical Specific Prevention Programs \n\nAt the Baytown Industrial Park, accident prevention programs are required in each process.  Specific prevention programs include:\n\nDetection Systems:\nDetectors are in place for various toxic vapors (phosgene) and for hydrocarbons (butane).  Personnel wear dosimeters in the plant.  An LDAR program is in place.  Personnel conduct work area safety observations.\n\nRelease Control and Containment:\nSystems for emergency scrubbers and emergency vacuum neutralization are in place.  Remote-operated valves contain systems and processes.  Relief devices direct neutralization systems.  Steam-ammonia curtains surround operating areas.  Firewater monitoring systems are in place\n\nRelease Mitigation Systems:\nTrained emergency response personnel are in place and supported by external emergency response organizations.  Fire/toxic release suppression and fire extinguishing systems are in place.  Specific areas have deluge systems.  Appropriate personal protection equipment is readily available.\n\n\nFive Year Accident History\n\nThe Lanxess Baytown plant has an exceptional record of accident prevention and release containment.  There have been no RMP-defined accidents with either onsite or offsite injury or damage in the past five years.\n\nEmergency Response Program\n\nLanxess Baytown participates and is covered by the Bayer Baytown Industrial Park emergency response system. Bayer Baytown maintains a trained emergency response team on site at all times.  Each shift has an emergency response team with up-to-date training.  There are emergency medical technicians on each shi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 41596,
      "SummaryText": "ft and an ambulance and fire truck staged for their immediate use.  An auxiliary trailer has additional equipment (air bottles, escape equipment, etc.) for immediate access during emergencies.\n\nThe emergency team includes members who have completed requirements for hazard materials (HazMat) response. Equipment for emergency HazMat use has been prepared for this facility.  \n\nThere is a designated organization that responds during daytime emergencies and off-shift emergencies.  The Incident Command Center (ICC) has equipment (maps, warning systems, P&ID drawings, MSDS, etc.) and supplies to direct the response.  The ICC is equipped with an emergency response modeling system to estimate the potential effects of a release on other areas of the facility or the community.  The ICC maintains lists of personnel to notify during an emergency.  The list also includes local emergency response personnel and organizations. \n \nThe Bayer Baytown Industrial Park facility is an active participant in the Baytown Local Emergency Planning Committee (and Emergency Management Office).  All emergency plans have been coordinated with the Baytown LEPC.  The facility has also been involved with the Chambers County LEPC.  All RMP plans have been reviewed with both LEPC groups.  Community outreach efforts are currently underway in all communities in the vicinity of the Bayer facility.  Bayer¿s role in the community emergency action plan is documented in the community procedures.\n\nThe Bayer Baytown Industrial Park facility has also been an active participant in the Baytown Citizens Advisory Panel to address concerns of the citizens regarding their proximity to manufacturing sites.  The City of Baytown is notified of all plant level alarms as an information source to citizens.  Through the East Harris County Manufacturers Association, Bayer emergency response participates in recording messages on a CAER line for information and emergency notification purposes.  The facility posts updates for the"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 41596,
      "SummaryText": "community in the event of an emergency or significant activity at the Bayer facility."
    }
  ]
}