{
  "FacilityID": 41770,
  "FacilityName": "Mount Pearl Unit Gas Plant",
  "FacilityStr1": "2.5 miles E of Hwy 59 on Co. Rd V",
  "FacilityStr2": null,
  "FacilityCity": "Kit Carson",
  "FacilityState": "CO",
  "FacilityZipCode": "80825",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08017",
  "LEPC": "Cheyenne County LEPC",
  "FacilityLatDecDegs": "38.886520",
  "FacilityLongDecDegs": "-102.741050",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "lelsom@cogc.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Citation Oil & Gas Corp.",
  "Company2Name": null,
  "CompanyDUNS": 58778853,
  "Company2DUNS": null,
  "OperatorName": "Citation Oil & Gas Corp.",
  "OperatorStr1": "8223 Willow Place South",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77070",
  "OperatorZipCodeExt": "5623",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000083214",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2005-01-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-01-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2005-01-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2019-05-10 00:00:00",
  "DeRegistrationEffectiveDate": "2019-05-03 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.3",
  "FRS_Lat": 38.88652,
  "FRS_Long": -102.74105,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "C04",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 60010,
      "AltID": null,
      "FacilityID": 41770,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 79364,
          "ProcessID": 60010,
          "ChemicalID": 98,
          "Quantity": 170000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 61398,
          "ProcessID": 60010,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 41770,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-09-21 00:00:00",
    "ERTrainingDate": "2002-03-12 00:00:00",
    "CoordinatingAgencyName": "Cheyenne County LEPC",
    "CoordinatingAgencyPhone": "7197675633",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41770,
      "SummaryText": "A) Accidental Release Prevention and Response Policies\n\nThe Mount Pearl Gas Injection Facility has a long standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes.  Our policy is to implement reasonable controls to prevent foreseable releases of regulated substances.  However, if a release does occur, our trained personnel will respond to control and contain the release.  We also work closely withour public emergency responders.\n\nB)  Description of the Stationary Source and Regulated Substances\n\nThe Mount Pearl Gas Injection Facility; located 8 miles north, and 2.5 miles east of Kit Carson Co.; incorporates a variety of processes to produce petroleum products (e.g., natural gas, propane, butane, condensate) from oil and gas wells.  The Mount Pearl Gas Injection Facility handles methane; ethane, propane and butane which are regulated flammables.  It processes approximately 10 million cubic feet of raw natual gas and natural gas liquids.  The Mount Pearl Gas Injection Facility does not use, process or store a reportable quantity of toxic regulated substances.\n\nC)  Hazard Assessment Results\n\nThe Worst Case Scenario (WCS) associated with a release of flammable materials in processes at the gas plant is a vapor cloud explosion (VCE) involving the full inventory of the largest process vessel containing 169,828 pounds of a propane, ethane mix.  The maximum distance to the 1-psi endpoint for this WCS is 0.450 miles.  No passive mitigation measure were taken into account in evaluating this WCS.\n\nE)  Five Year Accident History\n\nWithin the past ifve years the processes have not had an accidental release that caused offsite impacts provided in the risk management program rule (40 CFR 68.10(b)(1)).\n\nGeneral Accidental Release Prevention Program/Chemical Specific Prevention Steps\n\nThe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41770,
      "SummaryText": "following is a summary of the accident prevention program in place at the Mount Pearl Gas Injection Facility.  Although processes at the Mount Pearl Gas Injection Facility are regulated by the EPA Risk Management Program (RMP) regulation, they are not subject to the OSHA Process Safety Management (PSM) standard.  This summary addresses only general safety issues and describes the management system in place to implement the accident prevention program.\n\nI)  Safe Work Practices\n\nThe Mount Pearl Gas Injection Facility has long-standing safe work practices in place to help ensure worker and process safety.  Examples of these include:\n\n(1)  lockout/tagout procedure to ensure isolation of energy sources for equipment that is being worked on\n(2)  a procedure for safe removal of hazardous materials before process piping or equipment is opened\n(3)  a permit and procedure to control spark-producing activities (i.e., hot work)\n(4)  a permit and procedure to ensure that adequate precautions are in place before entry into a confined space.  \nThese procedure (and others), along with training of affected personnel, form a system to help ensure operations and maintenance activities are performed safely.\n\n\nII)  Incident Investigation\n\nThe Mount Pearl Gas Injection Facility promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident.  The investigator documents his/her findings, develops recommendations to prevent a recurrence, and forwards these results to Southeast Colorado management for resolution.  Corrective actions taken in response to the investigation team's findings and recommendations are tracked until they are completed.  The final resolution of each finding or recommendation is documented, and the investigation"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41770,
      "SummaryText": "results are reviewed with all employees (including contractors) who could be affected by the findings.\n\nIII)  Compliance Audits\n\nTo help ensure that the accident prevention program is functioning properly, the Mount Pearl Gas Injection Facility periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  Compliance audits are conducted approximately every 3 years.  Personnel from other operating areas compose the Audit Team.  Both hourly and staff personnel participate as audit tem members.  The audit team develops findings that are forwarded to Mount Pearl Gas Injection Facility management for resolution.  Corrective actions taken in response to the audit team's findings are tracked until they are completed.  The final resolution of each finding is documented, and the two most recent audit reports are retained.\n\nIV)  Summary of Process Hazards, Safety Feature, and Hazard Analysis Findings\n\nThe process at the Mount Pearl Gas Injection Facility have hazards that must be managed to ensure continued safe operations.\n\na)  Universal Prevention Activities\n\nThe accident prevention program summarized previously is applied to all EPA RMP covered processes at the Mount Pearl Gas Injection Facility.  Collectively, these preventions program activities help prevent potential accident scenarios that could be caused by (1) equipement failures and (2) human errors.\n\nb)  Specialized Safety Features\n\nThe Mount Pearl Gas Injection Facility has safety features on many units to help (1) contain/control a release, (2) quickly detect a release, and (3)  reduce the consequences of (mitigate) a release.  The following types of safety features are used in the covered processes:\n\nc)  Release Detection\n\n1.  Hydrocarbon detectors with alarms in all closed compressor buildings\n\nd)  Release Containment/Control\n\n1.  Valves to permit isolation of the process (manual or automated)\n2.  Automated shutdown systems f"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 41770,
      "SummaryText": "or specific process paramater (e.g., high level, high temperature, high pressure)\n3.  Curbing or diking to contain liquid releases\n4.  Atmospheric relief devices\n\ne)  Release Mitigation\n\n1.  Personal protective equipment\n2.  Trained emergency first-responder personnel\n3.  Spacing of equipment in accordance with IRI spacing guideline\n4.  Emergency shutdown strategically placed in the plant to automatically shut in the inlet\n\nEmergency Response Program\n\nThe Southeast Colorado Area maintains a written emergency response program, which is in place to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response, including proper fist-aid and medical treatment for exposures, evacuation plans and accoutning for personnel after an evacuation, notification of local emergency resonse agencies and the public if a release occurs, and post incident cleanup and decontamination procedures.  The emegency response program is updated as necessary.  Any significant changes to the emergency response program are identified and affected personnel are informed of the changes.\n\nThe overall emergency response program for the Mount Pearl Gas Injection Facility is coordinated with the Kit Carson Fire Department and the local emergency planning committee (LEPC).  This coordination includes periodic meetings with the LEPC, which includes local emergency response officials, local government officials, and industry representatives.  The gas platn has around the clock cmmunications capability with appropriate LEPC officials and emergency response organizations (e.g. fire department).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.\n\nCertification:\n\nBased on the criteria in"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 41770,
      "SummaryText": "40 CFR 68.10, the distance to the specified endpoint for the worst-case accidental release scenario for the following process is less than the distance to the nearest public receptor.  Within the past five years, the proccess has not had any accidental release that cuased offsite impacts provided in the risk management program rule (40 CFR 68.10(b)(1)).  No aditional measures are necessary to prevent offsite impacts from accidental releases. In the event of fire, expllstin, or a release of a regulated substance from the process, entry within the distance to the specified endpoints may pose a danger to public emergency responders.  Therefore, the public emergency responders should not enter this area except as arranged with the emergency contact as indicated in the RMP.\n\nThe undersigned certifies that to the best of my knowledge, information and belief, formed after reasonable inquiry, theinformation submitted is ture, accurate and complete.\n\n\n\n\n\nLee Ann Elsom\nEnvironmental Coordinator\n1/12/2005"
    }
  ]
}