{
  "FacilityID": 41784,
  "FacilityName": "Peak Sulfur, Inc.",
  "FacilityStr1": "140 Goes In Lodge Road",
  "FacilityStr2": null,
  "FacilityCity": "Riverton",
  "FacilityState": "WY",
  "FacilityZipCode": "82501",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "56013",
  "LEPC": "Fremont County Emg Mgmt Agency",
  "FacilityLatDecDegs": "42.997778",
  "FacilityLongDecDegs": "-108.416944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Peak Sulfur, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Peak Sulfur, Inc.",
  "OperatorStr1": "15700 College Blvd",
  "OperatorStr2": null,
  "OperatorCity": "Lenexa",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66219",
  "OperatorZipCodeExt": null,
  "RMPContact": "Christian Pogson",
  "RMPTitle": "Plant Manager",
  "FTE": 20,
  "OtherEPAFacilityID": "82501RVRTN140GO",
  "EPAFacilityID": "100000057369",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "VWR 0003-00.02",
  "SafetyInspectionDate": "2001-09-18 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-01-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-01-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-01-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": 43.00116,
  "FRS_Long": -108.41463,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "100000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 60026,
      "AltID": "Sulfuric Acid Manufacture",
      "FacilityID": 41784,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 61416,
          "ProcessID": 60026,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 79383,
          "ProcessID": 60026,
          "ChemicalID": 69,
          "Quantity": 32645.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 69,
            "ChemicalName": "Oleum (Fuming Sulfuric acid)  [Sulfuric acid, mixture with sulfur trioxide]",
            "CASNumber": "8014-95-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 579383,
          "ProcessID": 60026,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41784,
      "SummaryText": "PEAK SULFUR, INC.\n\nPeak Sulfur, Inc.\nRiverton, Wyoming\n\nEXECUTIVE SUMMARY\nFOR \nTHE RISK MANAGEMENT PLAN (RM Plan)\n\n\nIntroduction and Policies\n\nAt Peak Sulfur, Inc. we are committed to being associated with superior environmental performance as measured by our employees, customers, regulators, and the public.  Our management philosophy goals are achieved by the personal commitment of our employees and contractors, and open communication with our employees, customers, neighbors, and with regulators.  The accidental release prevention and emergency response programs we have at our facilities are part of the high standards we strive for through Responsible Care programs.  Our high standards are achieved by operating and maintaining our assets in such a manner that any unpermitted release will be unintentional and acknowledged as unacceptable, by remedying any shortcomings found during regular audits of our facilities, and by reporting promptly to regulators any shortcomings found during the course of our audits as required by law.\n\nThe Peak Sulfur, Inc.s' Riverton Facility (Riverton Facility) is one of four facilities operated by Peak Sulfur Incorporated.  At the facility, we manufacture commercial grade sulfuric acid (200 tons per day) from elemental sulfur and spent sulfuric acid in two separate process trains.  Oleum is the only toxic substance regulated under the Risk Management Program (RMP) that is present at the Riverton Facility in amounts greater than threshold quantity.  The facility is classified as Program Level 3 under the regulation.  The purpose of this Risk Management Plan (RM Plan) is to provide information about our operations at the facility, our programs to prevent accidental chemical releases, our emergency response plans in case an accidental release should occur, our 5 year accident history, and our planned changes to improve safety at the facility.\n\n\nPrevention Program\n\nThe Riverton Facility has been operating under the strict guidelines of the O"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41784,
      "SummaryText": "ccupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program since 1998.  Our ongoing analysis of the potential hazards of our process, detailed training of our employees, and constant emphasis on safety have helped us avoid any serious accidents over the last 5 years.  Part of this program has also involved identifying and taking steps to avoid potential accidental chemical releases.  A few examples of the additional prevention features implemented at this facility include the following:\n\n\nWe have provided safety showers; and alarm in the Oleum process area second level.\n\nWe have changed pump design to minimize maintenance seal replacement and exposure to risk.\n\nWe provide reviewed, improved, and updated safety orientation program to reflect our day to day operation to all our contractor employees to enhance personal safety.\n\nThese safeguards as well as the vigilance of our trained employees will help us operate safely at this facility.\n\n\nFive Year Accident History\n\nNo incident having resulted in offsite impacts or onsite injuries from a RMP regulated substance has occurred at the Riverton Facility within the last five years.  Although we take pride in that record, we also place daily emphasis on our prevention and safety programs to ensure this record continues.\n\n\nEmergency Response\n\nWe will continue to conduct emergency response preparedness activities and coordinate any emergency response actions necessary for the Riverton Facility with the Fremont County Volunteer Fire department.  Also involved in emergency response of the facility would be the Fremont County Sheriff, Fremont County Emergency Management Agency, Freemont County Ambulance, Riverton Fire District, Wind River Environmental Quality Commission, City of Riverton Police, City of Riverton Emergency Management Agency, Riverton Memorial Hospital, and Wyoming State Highway Patrol.  The Riverton Facility Plant Manager is responsible for coordinating all emergency actions.  A "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41784,
      "SummaryText": "specific Emergency Response Plan for the facility is in place and that plan has been coordinated with local officials, along with evacuation procedures, regular drills, and training.  Our Emergency Response Program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.\n\n\nPlanned Changes to Improve Safety\n\nDiligent compliance with our RMP Prevention Program forms the framework on which we will continue to improve the level of safety at the Riverton Facility.  Some of the key components of the safety improvements we expect to achieve are as follows:\n\nThe Management of Change provisions ensure that we consider the potential safety and health impacts of any change we make to regulated process chemicals, technology, equipment or procedures.\nThe Process Hazard Analysis (PHA) provisions serve as a tool to ensure continual evaluation of potential hazards, thereby leading to continual improvements in our safety standards.\nThe Mechanical Integrity provisions ensure that process equipment and instrumentation are designed, constructed, installed and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of our safety program.\nInternal and third party compliance audits will ensure we maintain and increase our level of safety protection.\n\nWe encourage all interested citizens or community organizations to contact the Fremont County Emergency Management Director for the latest information on emergency response for the county.  We plan to diligently integrate our response capabilities and personnel with those of the county on an ongoing basis."
    }
  ]
}