{
  "FacilityID": 41801,
  "FacilityName": "FAIRFAX COUNTY WATER AUTHORITY - OCCOQUAN, WTP",
  "FacilityStr1": "411 MILL STREET",
  "FacilityStr2": null,
  "FacilityCity": "OCCOQUAN",
  "FacilityState": "VA",
  "FacilityZipCode": "22192",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51153",
  "LEPC": "Prince William Joint LEPC",
  "FacilityLatDecDegs": "38.685833",
  "FacilityLongDecDegs": "-077.263889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.fcwa.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "FAIRFAX COUNTY WATER AUTHORITY",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "FAIRFAX COUNTY WATER AUTHORITY",
  "OperatorStr1": "8570 EXECUTIVE PARK AVENUE",
  "OperatorStr2": "P.O. BOX 1500",
  "OperatorCity": "FAIRFAX",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "22031",
  "OperatorZipCodeExt": "0815",
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000070399",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-12-07 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-01-28 00:00:00",
  "ErrorReportDate": "2005-01-28 00:00:00",
  "ReceiptDate": "2005-01-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-01-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-12-13 00:00:00",
  "DeRegistrationEffectiveDate": "2007-12-14 00:00:00",
  "AnniversaryDate": "2010-01-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.4",
  "FRS_Lat": 38.6836,
  "FRS_Long": -77.2605,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 60049,
      "AltID": "CHLORINE STORAGE",
      "FacilityID": 41801,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 79412,
          "ProcessID": 60049,
          "ChemicalID": 62,
          "Quantity": 48000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 61439,
          "ProcessID": 60049,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 34804,
              "Process_NAICS_ID": 61439,
              "SafetyReviewDate": "2005-01-11 00:00:00",
              "PHA_Date": "2005-01-11 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 1,
              "PHA_OtherTechnique": "EMPLOYEE TEAM EVALUATION ON PHA",
              "PHACompletionDate": "1999-08-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 1,
              "MH_OtherType": "EXTERNAL EVENT",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "DIRECT OBSERVATION",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Continue with current prevention program elements",
              "OpProceduresReviewDate": "2005-01-11 00:00:00",
              "TrainingReviewDate": "2003-12-31 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": "Hands-on practical",
              "MaintenanceReviewDate": "2005-01-11 00:00:00",
              "EquipmentInspectionDate": "2004-11-01 00:00:00",
              "EquipmentTested": "REPLACE CHLORINE FLEX LINE #2",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-05-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-08-13 00:00:00",
              "HotWorkPermitReviewDate": "2004-03-04 00:00:00",
              "ContractorSafetyReviewDate": "1999-03-22 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Due to the similarities and exact nature of  the Chlorine Storage and Chlorine Feed Processes, all the safeguards that follow from the Occoquan WTP's Prevention Program 3 are the same for each respective process with the following exceptions: (1) Mitigation systems in the Storage Area do not include an enclosure, instead it is a covered storage; and (2) the Monitoring detection system in the Storage Area does not include process area detectors.",
              "_chemicals": [
                {
                  "PrimaryKey": 50681,
                  "PreventionProgram3ID": 34804,
                  "ProcessChemicalID": 79412
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 60050,
      "AltID": "CHLORINE FEED",
      "FacilityID": 41801,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 79413,
          "ProcessID": 60050,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 61440,
          "ProcessID": 60050,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 41801,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2003-09-30 00:00:00",
    "ERTrainingDate": "2004-04-13 00:00:00",
    "CoordinatingAgencyName": "COUNTY OF PRINCE WILLIAM - HAZMAT",
    "CoordinatingAgencyPhone": "7037927405",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41801,
      "SummaryText": "The attached file contains the Occoquan, WTP's RMP Executive Summary.  The file was written as a Word 6 document and saved as a text file to be imported into the RMP Submit software.\nOCCOQUAN WATER TREATMENT PLANT\n\n(RIVER STATION)\n\nFIRST FIVE YEAR RMP UPDATE\n\nEXECUTIVE SUMMARY\n\n\n\nRMP #1000 0007 0399\n\n\n\n\n\nSIGNIFICANT REVISIONS\n\n\n\n1. Five year update & submission.\n\n2. Refined latitude and longitude coordinates as a result of the use of available technology.\n\n3. Reduction in the distance to the OCA endpoints as a result of the use of available technology.\n\n4. Change of SIC code to new system.\n\n\n\nOverview\n\n\n\nThe Fairfax County Water Authority (FCWA) occupies approximately 20 acres in northern Prince William County at the Occoquan Water Treatment Plant (WTP).  The Occoquan WTP is located at the end of Mill Street in the Town of Occoquan, approximately 1 mile north of Interstate 95. \n\n\n\nThe Occoquan WTP is a drinking water provider and has an average capacity of 26 million gallons of drinking water a day.   Operations at the Occoquan WTP fall into the 22131 Standard Industrial Classification.\n\n\n\nAt the Occoquan WTP, the FCWA pumps, treats and distributes water from the Occoquan River Reservoir to customers in the Northern Virginia Region.  To ensure the highest quality drinking water is available to its customers, the FCWA uses chlorine as a disinfectant to remove and control the growth of otherwise potentially harmful microorganisms and pathogens in the drinking water supply.  Because of its relative toxicity, chlorine is listed as a regulated substances under the United States Environmental Protection Agency's (EPA), Accidental Release Prevention Provisions.  Under the provisions, EPA requires that facilities having regulated chemical processes above the following threshold implement a Risk Management Program (RMP) covering the regulated process.\n\n\n\nChemical    Threshold Quantity\n\n\n\n    Chlorine    2,500 pounds\n\n\n\nChlorine is delivered to the facility in one (1) ton containers v"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41801,
      "SummaryText": "ia tractor trailer.  There is a maximum inventory of 24 containers for a combined inventory of approximately 48,000 pounds of chlorine.\n\n\n\nThe FCWA's RMP describes the potential environmental impacts and the toxicity hazards presented by the chlorine inventory at the Occoquan WTP.  Moreover, the RMP describes the FCWA's procedures to minimize the risk and prevent unwanted releases of the chemical into the surrounding communities.  \n\n\n\nAccidental Release Prevention and Emergency Response\n\n\n\nThe FCWA has adopted policies that comply with applicable federal, state, local, and institutional regulations for design, construction,  operation, and modification of the water treatment plant facilities.\n\n\n\nWorst-Case Release Scenario - Chlorine\n\n\n\nWhile chlorine releases are rare at WTPs, the FCWA has conducted an off-site consequence analysis (OCA) to evaluate the potential impacts on the surrounding \n\ncommunities should an unwanted release occur.  As directed by EPA regulations, the FCWA assumed a worst-case release scenario to consist of a 1-ton cylinder depleting its contents over a 10 minute release period.  Such a chlorine release would tend to sink, hug the ground, or follow low lying areas due to the fact that chlorine is approximately 2.5 times heavier than air.  Depending on the ambient weather conditions (i.e. wind speed and direction) and the topography of the surrounding land, the chemical plume can impact the surrounding region and cause damage to human health and the environment.    \n\n\n\nTo determine how far from the Occoquan WTP a chlorine plume would travel from a 1-ton cylinder over a 10 minute release period, the FCWA utilized RMP Comp version 1.07.  Additionally, the FCWA utilized the Fairfax Joint Local Emergency Planning Committee's (FJLEPC) modeling conducted consistent with the North American Emergency Response Guidebook.  These approaches conservatively estimate a potential impact area that is circular with the center being the point of release.\n\n\n\nFor "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41801,
      "SummaryText": "the Occoquan WTP, the greatest mass that can be released from any chlorine process is equal to one 1-ton cylinder of chlorine.  Based upon the RMP Comp model the maximum distance to the end-point is approximately 0.9 miles.  The potential impact area is shown on Figure 1. \n\n\n\nIt is estimated that 5,000 people live within the boundaries of the potential impact area as identified on Figure 1.  Moreover, the potential impact area contains both public and environmental receptors. \n\n\n\nGRAPHIC FILE DELETED\n\n\n\n Alternate Release Scenario - Chlorine\n\n\n\nConsidering that the aforementioned worst-case release scenario is ultra-conservative and unrealistic in terms of the potential impact area, the FCWA is required to conduct an alternate release scenario for chlorine. This variation of the worst-case scenario is considered \"more realistic\" than the worst-case scenario.  The impact area must still include off-site receptors.  However, it is important to understand that although the occurrence of the alternate release scenario is considered as \"more realistic\", the FCWA considers it still to be highly unlikely due to engineering and administrative controls at the Occoquan WTP.   \n\n\n\nEPA regulations encourage facilities to select the alternate release scenario from one that has occurred at some point in the past at the facility or from one identified through the process hazards analysis.  Due to no historical off-site releases at the Occoquan WTP within the last 20 years, the alternate release scenario selected, although still unlikely, was one identified through the process hazard analysis.  Similar to the worst-case scenario, the alternate release assumed that the largest vessel of chlorine (1-ton cylinder) is released. \n\n\n\n    Figure 1 presents the alternate case release scenario  estimating a 0.1 mile radius and approximately 200 people to be effected.\n\n\n\nGRAPHIC FILE DELETED\n\nFive Year Accident History\n\n \n\nThe EPA RMP regulations require each regulated facility to report all ac"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 41801,
      "SummaryText": "cidental releases which resulted in deaths, injury, environmental or property damage, either on- or off-site that resulted in evacuations or sheltering  within the last 5 years prior to submission.\n\n\n\nThe FCWA has not had any such incidences at the Occoquan WTP for chlorine within the last 20 year?s operating history.\n\n\n\n\n\nOverview of the Prevention Program\n\n\n\nThe EPA RMP regulations have three tiers of compliance based upon the relative degree of effort necessary to minimize the risk to off-site receptors.  The tiers are established as Program 1, Program 2 and Program 3.  As a rule of thumb, since the FCWA's off-site consequence analysis affected off-site receptors, the FCWA falls into the Program 3 tier requirement.   Moreover, the WTP is regulated under the OSHA Process Safety therefore making compliance with Program 3 criteria mandatory under the RMP regulation.\n\n\n\nManagement System\n\n\n\nThe FCWA has established a management system to assign responsibility for the development, implementation, and modification of the RMP.  The overall responsibility for implementation is assigned to the Supervisor of Water Production, with specific responsibilities assigned to management level personnel with organizational responsibility for the individual tasks (i.e. plant maintenance).\n\n\n\nSafety Information\n\n\n\nThe FCWA maintains up-to-date process safety information on the chlorine and  processes at the Occoquan WTP.  This information is available to all operations, maintenance, and administrative employees for review.  The safety information includes:  \n\n\n\n1. Information on chemical hazards, which includes toxicity information, permissible exposure levels (PELs), physical data, reactivity data, corrosivity data, thermal and chemical stability data, and hazardous effects from mixing.  This is in the form of Material Safety Data Sheets (MSDSs) that meet the requirements of 29CFR 1910.1200 (g). \n\n\n\n2. Process technology information, including a block flow diagram or process flow di"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 41801,
      "SummaryText": "agram, process chemistry, safe upper and lower operating limits, maximum intended inventory, and consequences of process deviation.\n\n\n\n3. Equipment specifications for the chlorine systems.\n\n\n\n4. A list of the codes and standards used to design build and operate the chlorine system at the Occoquan WTP\n\n\n\nHazard Review\n\n\n\nThe FCWA completed a detailed process hazard analysis (PHA) for the chlorine  handling system at the Occoquan WTP.  Due to the stability of the regulated process over 20 years and no historical  process incidents, a checklist method with a what-if analysis was chosen for the PHA.  Copies of the completed PHA's and checklist are maintained as a part of the aforemented safety information.  The FCWA will review and update the PHA's at least every five years or after any significant modification or change to the chlorine system at the WTP.\n\n\n\nOperating Procedures\n\n\n\nDetailed operating procedures for the chlorine system have been  developed.  The procedures are detailed step-by-step instructions for safely performing operations on the chlorine system in a manner to minimize the risk of an accidental release.  \n\n\n\nTo ensure up-to-date operating procedures, the FCWA will review and update the PHA's at least every five years or after any significant modification or change to the chlorine system at the WTP. At the time of this update, no process modifications have occurred in the five years to trigger a review or update.\n\n\n\nTraining\n\n\n\nAll employees who work with the chlorine system at the Occoquan WTP have received on the job training of the processes and their hazards.  Moreover, each employee assigned a safety sensitive function is part of an on-going safety training program.  \n\n\n\nMaintenance\n\n      \n\nThe chlorine systems are maintained under the plant's computerized maintenance system known as CHAMPS.  As preventive maintenance activities are scheduled, work orders are printed and issued to the responsible craft supervisor.  Should equipment be found in n"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 41801,
      "SummaryText": "eed of repair, either during scheduled PM or at any other time, a corrective maintenance (CM) work order is issued.  Finally, once work has been completed, that information and any other data are entered into CHAMPS.  This system permits Occoquan WTP to continuously strive for and achieve its goal of ?zero failures? (i.e., no loss of production and 100 percent resolution of identified safety concerns).\n\n\n\nCompliance Audits\n\n\n\nThe ensure compliance with the RMP regulations compliance audits will be conducted  to evaluate the FCWA's safe work procedures to determine if their implementation are compliant with the applicable codes and regulations.  The audit also is utilized  to identify potential program deficiencies and assist with formulating recommendations to alleviate identified deficiencies. A checklist procedure will used by an audit team to conduct compliance inspections  at FCWA facilities for all regulated programs and processes. \n\n\n\nThe FCWA Risk Manager will then prepare an audit report documenting all findings, recommended corrective action, assigned personnel, and completion dates.  Reports will be maintained at the WTP. At the time of this first five year update no process modifications have occurred to trigger prevention program requirements including management of change, contractor safety review, and pre-start up safety review.  The chlorine process has been stable, and remained unchanged other than preventative maintenance in the past five years.\n\n\n\nIncident Investigations\n\n\n\nThe FCWA's internal incident investigation procedures ensure compliance with the EPA RMP regulations.  All incidents that result, or could have resulted, in serious injury, illness, damage, or liability to FCWA employees, property, public or the environment are investigated within 24 hours of the incident.  The purpose of the investigation is to identify any underlying causes and facts leading up to and contributing to the incident and to implement corrective actions to prevent "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 41801,
      "SummaryText": "a reoccurrence.\n\n\n\nEmergency Response Program\n\n\n\nThe FCWA has developed an Emergency Action Plan (EAP) describing actions to be taken by Fairfax County Water Authority (FCWA) personnel and by off-site emergency response agencies to effectively respond to hazardous chemical spills and releases or fires at the Occoquan WTP.  In addition, other local jurisdictions have their own emergency response plans in place.  The FCWA will utilize the services of the Prince William County Joint Local Emergency Planing Commission, the Local Hazardous Materials Response Team, or County Fire Department Incident Commander, and the local police departments in case of a hazardous chemical release. \n\n  \n\n\n\n\n\n\n\n\n\n    \n\n\n\n"
    }
  ]
}