{
  "FacilityID": 41906,
  "FacilityName": "Upper Smith River Water Filtration Plant",
  "FacilityStr1": "590 Philpott Drive",
  "FacilityStr2": null,
  "FacilityCity": "Bassett",
  "FacilityState": "VA",
  "FacilityZipCode": "24055",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51089",
  "LEPC": "Martinsville Joint LEPC",
  "FacilityLatDecDegs": "36.784650",
  "FacilityLongDecDegs": "-080.005110",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Henry County Public Service Authority",
  "Company2Name": null,
  "CompanyDUNS": 198279549,
  "Company2DUNS": 0,
  "OperatorName": "Michael Ward",
  "OperatorStr1": "3300 Kings Mountain Road",
  "OperatorStr2": "PO Box 7",
  "OperatorCity": "Collinsville",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "24078",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael Ward",
  "RMPTitle": "Director of Regulatory Compliance",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000128444",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-04-02 00:00:00",
  "SafetyInspectionBy": "Woodard & Curran",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-02-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-01-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-01-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-01-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.4",
  "FRS_Lat": 36.7965,
  "FRS_Long": -79.961,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3.1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 60212,
      "AltID": "Chlorine",
      "FacilityID": 41906,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 61608,
          "ProcessID": 60212,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 79617,
          "ProcessID": 60212,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 579617,
          "ProcessID": 60212,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41906,
      "SummaryText": "EXECUTIVE SUMMARY\n\na. The Henry County Public Service Authority?s (PSA) accidental release prevention program involves three items: Technology, Management and Procedural Practices. The PSA?s emergency action plan involves coordination between plant personnel, management, and public safety responders. The PSA is committed to providing a safe working environment for its employees and to the communities, which it serves. \n\nb. The Upper Smith River Water Filtration Plant (Philpott) is a water purification plant owned by Henry County and operated by the Henry County Public Service Authority (PSA). The plant is located at 590 Philpott Drive in Bassett, Virginia. This facility purifies and supplies water to Bassett, Stanleytown, Collinsville and the 57 West areas. The plant is rated at 4.0 MGD. Chlorine is utilized for disinfection. The operation uses and stores 4, 1-ton cylinders of chlorine gas on site. The existing chlorine system operates when the facility is manned. The chlorine system is monitored  by electronic sensors with remotely activated audible and visual indicators and also by the plant operators. Alarmed conditions are responded to by a given protocol and trained personnel.\n\nc. The offsite consequence analysis includes two chlorine release scenarios, which are identified as a ?Worst Case Release scenario? and an ?Alternative Release scenario?. The Worst Case scenario is defined by the EPA and states that ?the owner or operator shall assume that the maximum quantity in the largest vessel is released as a gas over 10 minutes? due to an unspecified failure. The Alternative scenario is defined as ?more likely to occur than the worst case scenario?. \n\nAtmospheric dispersion modeling has to be performed to determine the distance traveled by chlorine release before its concentration decreases to the ?toxic endpoint? selected by EPA of 3 ppm, which is the Emergency Response Planning Guideline level 2 (ERPG-2). This is defined by the American Industrial Hygiene Assoc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41906,
      "SummaryText": "iation (AIHA) as the ?maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual?s ability to take protective action.? The residential population within a circle with a radius corresponding to the toxic endpoint distance has to be defined; to estimate the population potentially affected?.\n\nThe worst-case release scenario at the Philpott plant involves the failure of a 1-ton cylinder (2,000 lbs. of chlorine). The offsite consequence analysis for this scenario was performed for two sets of conditions. The first set followed conditions predefined by the EPA, namely release of the entire amount of gas in a full cylinder in 10 minutes, use of the one-hour average EPRG-2 as the toxic endpoint, and consideration of the population residing within a full circle radius corresponding to the toxic endpoint distance. EPA set these conditions to facilitate the performance of the offsite consequence analysis.  \n\nEPA mandated meteorological conditions, namely Stability F, wind speed of 1.5 m/sec. When atmospheric dispersion modeling of the worst case scenario was performed using the EPA assumptions, a distance to toxic endpoint of 1.3 miles and an estimate of residential population potentially affected of 871 was obtained. \n\nThe alternative release scenario involves the break of a ? inch pigtail flexible connector with an amount released of 37 lbs. over a one-hour period. The toxic endpoint distance to ERPG-2 is .1 miles and the estimate of residential population potentially affected is 10.\n\nd. The PSA?s prevention program is based on the following items\n? Training of operators\n? Maintenance program\n? State of the art process and safety equipment\n? The use of self-contained breathing apparatus (SCBA), worn by operators during connection/disconnection of chlorine supply, awareness of the hazardous "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41906,
      "SummaryText": "and the toxic properties of chlorine, and presence of the chlorine detector. \n\ne. No accidental release of chlorine has occurred at this facility in the past five years.\n\nf. The facility has an emergency action plan which has been coordinated with the Public Safety Director in charge of fire and rescue for Henry County and the Local Emergency Response Planning Committee (LEPC). This program includes an emergency response notification plan.\n\ng. The treatment processes are, and will continue to be, evaluated for effectiveness and improvement. The PSA is always upgrading and reviewing equipment and operations to insure compliance with current State and Federal  regulations."
    }
  ]
}