{
  "FacilityID": 41932,
  "FacilityName": "Nebraska City Water Treatment Plant",
  "FacilityStr1": "Second Street & Fourth Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Nebraska City",
  "FacilityState": "NE",
  "FacilityZipCode": "68410",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31131",
  "LEPC": "Otoe LEPC",
  "FacilityLatDecDegs": "40.680556",
  "FacilityLongDecDegs": "-095.847778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": "service@nebraskacityutlities.com",
  "FacilityDUNS": 980739817,
  "ParentCompanyName": "Nebraska City Utilities",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dean Hauptman",
  "OperatorStr1": "100 Central Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Nebraska City",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68410",
  "OperatorZipCodeExt": null,
  "RMPContact": "Leroy Frana",
  "RMPTitle": "General Manager",
  "FTE": 3,
  "OtherEPAFacilityID": "NE0001749787",
  "EPAFacilityID": "100000015627",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-08-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-02-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-01-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-01-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-01-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.4",
  "FRS_Lat": 40.68056,
  "FRS_Long": -95.84778,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 60254,
      "AltID": "Disinfection",
      "FacilityID": 41932,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 61652,
          "ProcessID": 60254,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 79665,
          "ProcessID": 60254,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 579665,
          "ProcessID": 60254,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41932,
      "SummaryText": "NOTE: Original submittal June 17, 2004, via paper copy.  This electronic submittal is at the request of the EPA.\n\nThe Nebraska City Water Treatment Plant (NCWTP) serves the needs of residents and industries in and around Nebraska City, Nebraska.  The plant is located in an urban setting and provides service to a population of 7,228 (2000 Census).  NCWTP utilizes chlorine to disinfect the water supply before being sent to the distribution system  The maximum quantity of chlorine present at any one time at NCWTP is 6,000 pounds.  The chlorine is stored in one-ton steel cylinders as a liquefied gas under pressure and is housed inside an enclosed room inside of the main building specifically for chlorine storage and distribution.  Chlorine releases are minimized by the design of the chlorine gas distribution system where all of the chlorine gas distribution lines are kept under vacuum.\n\nIf a major chlorine leak were to occur at the facility, emergency responders would be contacted immediately by dialing 911.  NCWTP has coordinated emergency response with the Nebraska City Fire Department and with Otoe County Emergency Management.  These organizations are aware of the dangers of chlorine gas and are familiar with the proper method to handle a chlorine release.\n\nThe RMP rule defines the worst-case release as \"the release of the largest quantity of a regulated substance from a vessel or a process line failure that results in the greatest distance to an endpoint \" [40 CFR 68.3],  Possible causes of the worst-case release or the probability that such a release might occur do not have to be considered, the release is simply assumed to take place.  For the case of the NCWTP, the worst-case release quantity is the greatest amount held in a single chlorine storage vessel, ignoring interconnections.  The largest single vessel is a 2,000-pound chlorine cylinder.  In developing the worst-case scenario, consideration must be given to the quantity that is released and the rate at whi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41932,
      "SummaryText": "ch the substance is released.  For toxic gases such as chlorine, the worst-case quantity is specified by the RMP regulation to be released over a 10-minute period.  \n\nFor worst-case scenarios, passive mitigation systems that function without human, mechanical, or other energy input may be considered to reduce the release rate of the toxic gas to the atmosphere.  The chlorine containers and equipment are stored in an enclosed building.  Because of this, a mitigation factor of 0.55 can be multiplied by the worst-case release rate to decrease the release rate level by 45 percent.  The release rate for chlorine at the NCWTP is 110 pounds-per-minute (lbs/min).\n\nOff-site distances to the toxic endpoint of 3 parts-per-million (ppm) for chlorine were determined using EPA's RMP Guidance for Wastewater Treatment Plants [EPA 550-B-98-010].  This distance in 0.9 miles.\n\nThe two alternative-case release scenarios were chosen from AWWA Research Foundation's Compliance Guidance and Model Risk Management Program for Water Treatment Plants.  This document suggests that a release from the one-ton cylinder occurring through a 5/16-inch-diameter valve on the end of the tank would be a more likely release scenario than a catastrophic tank failure.  Two conditions were examined in the calculations: (1) where chlorine escapes through the gas valve; and (2) where chlorine escapes through the liquid valve.\n\nAs with the worst-case scenario, the building serves to mitigate the release of the chlorine to the atmosphere by 45 percent.  No active mitigation measures are available at the NCWTP.\n\nRelease calculations followed EPA's Guidance on the Application of Refined Dispersion Models for Hazardous/Toxic Air Releases document.  The release rate for the gas valve alternative scenario is 8.1 lbs/min, and the liquied valve alternative scenario is 93.1 lbs/min.  Off-site distances to the toxic endpoint are 0.1 mile and 0.2 mile respectively.\n\nThe NCWTP is committed to a safe environment for employe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41932,
      "SummaryText": "es and the community alike.  Workers are trained on a regular basis in the proper handling, maintenance, and operating procedures for the chlorine equipment and storage units."
    }
  ]
}