{
  "FacilityID": 42121,
  "FacilityName": "Lone Camp Gas Processing Plant",
  "FacilityStr1": "2290 Ranch Road 3137",
  "FacilityStr2": null,
  "FacilityCity": "Gordon",
  "FacilityState": "TX",
  "FacilityZipCode": "76453",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48363",
  "LEPC": "Palo Pinto  LEPC",
  "FacilityLatDecDegs": "32.670000",
  "FacilityLongDecDegs": "-098.283333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Enbridge Gathering (North Texas) LP",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Enbridge Gathering (North Texas) LP",
  "OperatorStr1": "PO Box 427",
  "OperatorStr2": null,
  "OperatorCity": "Gordon",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76453",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brad Wilcoxen",
  "RMPTitle": "Area Supervisor",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000136998",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-00760",
  "SafetyInspectionDate": "1999-03-22 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Submitted changes",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-02-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-02-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-02-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-05-24 00:00:00",
  "DeRegistrationEffectiveDate": "2019-01-01 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.4",
  "FRS_Lat": 32.67,
  "FRS_Long": -98.28333,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 60484,
      "AltID": "Gas Plant - 1 process",
      "FacilityID": 42121,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 61897,
          "ProcessID": 60484,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 79907,
          "ProcessID": 60484,
          "ChemicalID": 155,
          "Quantity": 630000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 59026,
              "ProcessChemicalID": 79907,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 59027,
              "ProcessChemicalID": 79907,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 59028,
              "ProcessChemicalID": 79907,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 59029,
              "ProcessChemicalID": 79907,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 59030,
              "ProcessChemicalID": 79907,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 579907,
          "ProcessID": 60484,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42121,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND RESPONSE\nPROGRAM\n\nThe Lone Camp gas plant has a long-standing commitment to employee and public safety.  This\ncommitment is demonstrated by the resources invested in accident prevention, such as training of\npersonnel and considering safety in the design, installation, operation, and maintenance of our\nprocesses.  Our standing practice is to implement reasonable controls to prevent foreseeable\nreleases of regulated flammable substances.  However, if a release does occur, trained gas plant\npersonnel will take appropriate action to control/mitigate the release.\n\nA DESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe Lone Camp gas plant, located in rural Palo Pinto County, Texas, operates a variety of processes\nto recover petroleum products (e.g., natural gas, propane, butane, condensate) from field gas. \nThe gas plant also recovers the regulated flammables, pentane and ethane.  There are no\nthreshold quantities of toxic substances present.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe following is a summary of the accident prevention program in place at the Lone Camp gas plant. \nBecause processes at the gas plant that are regulated by the Environmental Protection Agency's\n(EPA's) risk management program (RMP) regulation are also subject to the Occupational Safety\nand Health Administration's (OSHA's) process safety management (PSM) standard, this\nsummary addresses each of the OSHA PSM elements and describes the management system in\nplace to implement the accident prevention program.  \n\nEmployee Participation\n\nThe Lone Camp gas plant encourages employees to participate in all facets of process safety\nmanagement and accident prevention.  Examples of employee participation range from updating\nand compiling technical documents and chemical information to participating as a member of a\nprocess hazard analysis (PHA) team.  Employees have access to all information created as part of\nthe gas plant accident prevention program"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42121,
      "SummaryText": ".  Specific ways that employees can be involved in the\naccident prevention program are documented in an employee participation plan that is\nmaintained at the gas plant and addresses each accident prevention program element.  In\naddition, the gas plant has a number of initiatives in place that address process safety and\nemployee safety issues.\n\nProcess Safety Information\n\nThe Lone Camp gas plant keeps a variety of technical documents that are used to help maintain safe\noperation of the processes.  These documents address chemical properties and associated\nhazards, limits for key process parameters and specific chemical inventories, and equipment\ndesign basis/configuration information.  Specific departments within the gas plant are assigned\nresponsibility for maintaining up-to-date process safety information.  The reference documents\nand their location is readily available as part of the written employee participation plan to help\nemployees locate any necessary process safety information.\n\nChemical-specific information, including exposure hazards and emergency response/exposure\ntreatment considerations, is provided in material safety data sheets (MSDSs).  This information is\nsupplemented by documents that specifically address known corrosion concerns and any known\nhazards associated with the inadvertent mixing of chemicals.  For specific process areas, the gas\nplant has documented safety-related limits for specific process parameters (e.g., temperature,\nlevel, composition).  The gas plant ensures that the process is maintained within these limits\nusing process controls and monitoring instruments, highly trained personnel, and protective\ninstrument systems (e.g., automated shutdown systems).\n\nThe gas plant also maintains numerous technical documents that provide information about the\ndesign and construction of process equipment.  This information includes materials of\nconstruction, design pressure and temperature ratings, and electrical rating of equipment.  This\ninfor"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42121,
      "SummaryText": "mation provides a basis for establishing inspection and maintenance activities, as well as\nevaluating proposed changes to ensure that safety features in the process are not compromised.\n\nProcess Hazard Analysis (PHA)\n\nThe Lone Camp gas plant has a comprehensive program to help ensure that hazards associated with\nthe various processes are identified and controlled.  Within this program, each process is\nsystematically examined to identify hazards and ensure that adequate controls are in place to\nmanage these hazards.\n\nThe gas plant primarily uses the What If/Checklist analysis technique to perform these evaluations.  The\nanalyses are conducted using a team of people who have operating and maintenance experience\nas well as engineering expertise.  The team identifies and evaluates hazards of the process as well\nas accident prevention and mitigation measures, and the team makes suggestions for additional\nprevention and/or mitigation measures when the team believes such measures are necessary.\n\nThe PHA team findings are sent to local and corporate management for resolution. \nImplementation of mitigation options in response to PHA findings is guided by a relative risk\nranking assigned by the PHA team.  All approved mitigation options in response to PHA team\nfindings are tracked until they are completed.  The final resolution of each finding is documented\nand retained.\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate\nsignificantly from the original design safety features, the plant periodically updates and\nrevalidates the hazard analysis results.  These periodic reviews are conducted at least every five\nyears and will be conducted at this frequency until the process is no longer operating.  The results\nand findings from these updates are documented and retained.  Once again, the team findings are\nforwarded to management for consideration, and the final resolution of the findings is\ndocumented and retained.\n\nOperating Procedures\n\nThe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 42121,
      "SummaryText": " Lone Camp gas plant maintains written procedures that address various modes of process\noperations, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4)\nemergency shutdown, (5) normal shutdown, and (6) initial startup of a new process.  These\nprocedures can be used as a reference by experienced operators and provide a basis for consistent\ntraining of new operators.  These procedures are periodically reviewed and annually certified as\ncurrent and accurate.  The procedures are kept current and accurate by revising them as necessary\nto reflect changes made through the management of change process.  These procedures are\nreadily available in the process unit for operators and other personnel to use as necessary to\nsafely perform their job task.\n\nTraining\n\nTo complement the written procedures for process operations, the Lone Camp gas plant has\nimplemented a comprehensive training program for all employees involved in operating a\nprocess.  New employees receive basic training in gas plant operations if they are not already\nfamiliar with such operations.  After successfully completing this training, a new operator is\npaired with a senior operator to learn process-specific duties and tasks.  After operators\ndemonstrate (e.g., through tests, skills demonstration) having adequate knowledge to perform the\nduties and tasks in a safe manner on their own, they can work independently.  In addition, all\noperators periodically receive refresher training on the operating procedures to ensure that their\nskills and knowledge are maintained at an acceptable level.  This refresher training is conducted\nat least every three years.  This training is documented for each operator, including the means\nused to verify that the operator understood the training.\n\nContractors\n\nThe Lone Camp gas plant uses contractors to supplement its work force during periods of increased\nmaintenance or construction activities.  Because some contractors work on or near process\nequipment, "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 42121,
      "SummaryText": "the gas plant has procedures in place to ensure that contractors (1) perform their work\nin a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in\ntheir workplace, (4) understand what they should do in the event of an emergency, (5) understand\nand follow plant safety rules, and (6) inform gas plant personnel of any hazards that they find\nduring their work.  This is accomplished by providing contractors with (1) a process overview,\n(2) information about safety and health hazards, (3) emergency response plan requirements, and\n(4) safe work practices prior to their beginning work.  In addition, the Lone Camp gas plant evaluates\ncontractor safety programs and performance during the selection of a contractor.  Gas plant\npersonnel periodically monitor contractor performance to ensure that contractors are fulfilling\ntheir safety obligations.\n\nPre-startup Safety Reviews (PSSRs)\n\nThe Lone Camp gas plant conducts a PSSR for any new facility or process modification that requires\na change in the process safety information.  The purpose of the PSSR is to ensure that safety\nfeatures, procedures, personnel, and equipment are appropriately prepared for startup prior to\nplacing the equipment into service.  This review provides an additional check to make sure\nconstruction is in accordance with the design specifications and that all supporting systems are\noperationally ready.  The PSSR team uses checklist(s) to verify startup readiness.  A PSSR\ninvolves field verification of the construction and serves a quality assurance function by\nrequiring verification that accident prevention program requirements are properly implemented.\n\nMechanical Integrity\n\nThe Lone Camp gas plant has well-established practices and procedures to maintain pressure vessels,\npiping systems, relief valves, controls, pumps and compressors, and emergency shutdown\nsystems in a safe operating condition.  The basic aspects of this program include:  (1) conducting\ntraining, (2) sc"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 42121,
      "SummaryText": "heduled preventive maintenance, (3) performing inspections and tests, (4)\ncorrecting identified deficiencies, and (5) applying quality assurance measures.  In combination,\nthese activities form a system that maintains the mechanical integrity of the process.\n\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health\nhazards, (3) applicable maintenance procedures, (4) emergency action plan, and (5) applicable\nsafe work practices to help ensure that they perform their jobs in a safe manner.  Scheduled\npreventive maintenance helps ensure that work is performed in a timely and consistent manner. \nInspections and tests are performed to help ensure that equipment functions as intended and to\nverify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure\nvessels).  If a deficiency is identified, employees will correct the deficiency before placing the\nequipment back into service (if possible), or plant management will review the use of the\nequipment and determine what actions are necessary to ensure the safe operation of the\nequipment.\n\nAnother integral part of the mechanical integrity program is quality assurance.  The Lone Camp gas\nplant incorporates quality assurance measures into equipment purchases and repairs.  This helps\nensure that new equipment is suitable for its intended use and that proper materials and spare\nparts are used when repairs are made.\n\nSafe Work Practices\n\nThe Lone Camp gas plant has long-standing safe work practices in place to help ensure worker and\nprocess safety.  Examples of these include (1) control of the entry/presence/exit of support\npersonnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment\nundergoing maintenance, (3) a procedure for safe removal of hazardous substances before\nprocess piping or equipment is opened, (4) a permit and procedure to control spark-producing\nactivities (i.e., hot work), and (5) a permit and procedure to ensure "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 42121,
      "SummaryText": "that adequate precautions are\nin place before entry into a confined space.  These procedures (and others), along with training of\naffected personnel, form a system to help ensure that operations and maintenance activities are\nperformed safely.\n\nManagement of Change\n\nThe Lone Camp gas plant has a comprehensive system to manage changes to all covered processes. \nThis system requires that changes to items such as process equipment, chemicals, technology\n(including process operating conditions), procedures, and other facility changes be properly\nreviewed and authorized before being implemented.  Changes are reviewed to (1) ensure that\nadequate controls are in place to manage any new hazards and (2) verify that existing controls\nhave not been compromised by the change.  Chemical hazard information, process operating\nlimits, and equipment information, as well as procedures, are updated to incorporate these\nchanges.  In addition, operating and maintenance personnel are provided any necessary training\non the change.\n\nIncident Investigation\n\nThe Lone Camp gas plant promptly investigates all incidents that resulted in, or reasonably could\nhave resulted in, a fire/explosion, major property damage, environmental loss, or personal injury. \nThe goal of each investigation is to determine the facts and develop corrective actions to prevent\na recurrence of the incident or a similar incident.  The investigation team documents its findings,\ndevelops recommendations to prevent a recurrence, and forwards these results to plant\nmanagement for resolution.  Corrective actions taken in response to the investigation team's\nfindings and recommendations are tracked until completed.  The final resolution of each finding\nor recommendation is documented, and the investigation results are reviewed with all employees\n(including contractors) who could be affected by the findings.  Incident investigation reports are\nretained for at least five years so that the reports can be reviewed during future PH"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 42121,
      "SummaryText": "As and PHA\nrevalidations.\n\nCompliance Audits\n\nTo help ensure that the accident prevention program is functioning properly, the Lone Camp gas\nplant periodically conducts an audit to determine whether the procedures and practices required\nby the accident prevention program are being implemented.  Compliance audits are conducted at\nleast every three years.  Both hourly and staff personnel may participate as audit team members. \nThe audit team findings are forwarded to plant management for resolution.  Corrective actions\ntaken in response to the audit team's findings are tracked until completion.  The final resolution\nof each finding is documented, and the two most recent audit reports are retained.\n\nCHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe processes at the Lone Camp gas plant have hazards that must be managed to ensure continued\nsafe operation.  The following is a description of existing safety features applicable to prevention\nof accidental releases of regulated substances in the facility.\n\nUniversal Prevention Activities\n\nThe accident prevention program summarized above is applied to all RMP covered processes at\nthe Lone Camp gas plant.  Collectively, these prevention program activities help prevent potential\naccidents that could be caused by equipment failures and human errors.\n\nSpecialized Safety Features\n\nThe Lone Camp gas plant has safety features to help (1) contain/control a release, (2) quickly detect a\nrelease, and (3) reduce the consequences of (mitigate) a release.  The following types of safety\nfeatures are used in the covered processes:\n\nRelease Containment/Control\n\n? Process relief valves\n? Valves to permit isolation of the process (manual or automated)\n? Automated shutdown systems for specific process parameters (e.g., high temperature)\n? Curbing or diking to contain liquid releases\n\nRelease Detection\n\n- Hydrocarbon detection sensors\n\nRelease Mitigation\n\n? Fire extinguishers\n? Trained personnel\n? Personal protective equipment\n\nFIVE-YEAR ACCIDENT HISTORY\n"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 42121,
      "SummaryText": "\nThe Lone Camp gas plant has an excellent record of accident prevention over the past five years. \nThere have been no releases of regulated substances that resulted in deaths, injuries, property or\nenvironmental damage, evacuations, or sheltering in place.  \n\nEMERGENCY ACTION PLAN INFORMATION\n\nThe Lone Camp gas plant maintains a written emergency action plan, which is in place to protect the\nsafety of workers and the public, as well as the environment.  There are no 112(r) threshold toxic\nsubstances on the plant site.  For a non-incidental release of a flammable substance, including the\npossibility of a fire, response actions have been coordinated with the local fire department, and\nmechanisms for notification are in place.  Employees receive training as necessary to perform\ntheir specific emergency actions.  The emergency action plan is updated when necessary, and\naffected personnel are informed and/or trained in the changes.  \n\nThe gas plant has around-the-clock communications capability with appropriate officials and\nemergency response organizations (e.g., fire department).  This provides a means of notifying the\npublic of an incident if necessary, as well as facilitating quick response to an incident."
    }
  ]
}