{
  "FacilityID": 4217,
  "FacilityName": "Tenneco Packaging Specialty and Consumer Products",
  "FacilityStr1": "437 Center Road",
  "FacilityStr2": null,
  "FacilityCity": "Frankfort",
  "FacilityState": "IL",
  "FacilityZipCode": "60423",
  "Facility4DigitZipExt": "1630",
  "FacilityCountyFIPS": "17197",
  "LEPC": "Will County LEPC",
  "FacilityLatDecDegs": "41.491667",
  "FacilityLongDecDegs": "-87.845556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Tenneco Inc",
  "Company2Name": "Tenneco Packaging",
  "CompanyDUNS": 181442526,
  "Company2DUNS": 5211766,
  "OperatorName": "Tenneco Packaging",
  "OperatorStr1": "437 Center Road",
  "OperatorStr2": null,
  "OperatorCity": "Frankfort",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60423",
  "OperatorZipCodeExt": "1630",
  "FTE": 335,
  "OtherEPAFacilityID": "ILD072343361",
  "EPAFacilityID": "100000050829",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "197040AAB",
  "SafetyInspectionDate": "1996-06-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 41.491708,
  "FRS_Long": -87.846761,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4920,
      "AltID": "4",
      "FacilityID": 4217,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 5272,
          "ProcessID": 4920,
          "ChemicalID": 115,
          "Quantity": 420000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5029,
          "ProcessID": 4920,
          "NAICSCode": "32614",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1871,
              "Process_NAICS_ID": 5029,
              "SafetyReviewDate": "1998-12-15 00:00:00",
              "PHA_Date": "1999-07-31 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1997-06-04 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1997-05-13 00:00:00",
              "TrainingReviewDate": "1996-06-16 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-10-02 00:00:00",
              "EquipmentInspectionDate": "1998-10-29 00:00:00",
              "EquipmentTested": "Calibration of LEL Sensors",
              "ChangeMgmtDate": "1998-04-06 00:00:00",
              "ChangeMgmtReviewDate": "1998-10-02 00:00:00",
              "PreStartupReviewDate": "1998-01-21 00:00:00",
              "ComplianceAuditDate": "1998-10-02 00:00:00",
              "AuditCompletionDate": "1999-12-31 00:00:00",
              "IncidentInvestigationDate": "1998-10-15 00:00:00",
              "InvestigationChangeDate": "1998-10-12 00:00:00",
              "ParticipationPlansReviewDate": "1998-10-02 00:00:00",
              "HotWorkPermitReviewDate": "1996-06-26 00:00:00",
              "ContractorSafetyReviewDate": "1998-12-15 00:00:00",
              "ContractorSafetyEvalDate": "1997-06-04 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2092,
                  "PreventionProgram3ID": 1871,
                  "ProcessChemicalID": 5272
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4217,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-11-18 00:00:00",
    "ERTrainingDate": "1998-12-15 00:00:00",
    "CoordinatingAgencyName": "Will County LEPC",
    "CoordinatingAgencyPhone": "8157408351",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 4217,
      "SummaryText": "g a contractor, a thorough evaluation of the contractor\u0012s safety performance and program is carried out.  Tenneco Packaging Specialty and Consumer Products, Inc.  has a strict policy of informing contractors of known potential hazards related to the contractor\u0012s work and the processes.  Contractors are also informed of the procedures for emergency response should an accidental release of a regulated substance occur.\n\nHot Work \nThe facility maintains a hot work program and issues a hot work permit for hot work conducted on or near the covered process.  Hot work is performed by qualified personnel who complete each permit and fulfill its requirements prior to the start of a hot work operation.  These permits are kept on file until the conclusion of the hot work operation.                                                                                                                                                                                                                                                                                                                                                                                                 \n\n5. Five-year Accident History\nTenneco Packaging Specialty and Consumer Products, Inc. has an excellent record of preventing accidental releases over the last 5 years.  There has been no accidental release during this period.\n\n6. Emergency Response Plan\nTenneco Packaging Specialty and Consumer Products, Inc. has developed a written emergency response plan to deal with fires and releases of hazardous materials.  The plan includes all aspects of emergency response including prompt notification of local emergency response agencies and the public; emergency evacuations, if necessary; adequate first aid and medical treatment should any be necessary.  The plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response. In addition, emergency response eq"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 4217,
      "SummaryText": "rgency Response Policy involves the preparation of response plans which are tailored to each facility and to the emergency response capabilities of the community they're located in.\n\n(b) What and Where - The Florenceville branch of WCA has LP Gas as one of the most economical sources of fuel to run the co-op's corn dryers. The Florenceville location serves corn growers from NE Iowa and SE Minnesota. The Florenceville branch includes the LP grain dryers, grain storage and a bagged feed, seed and crop protection product warehouse. The LP GAS is stored in a four 1,000 gallon tanks. These tanks, with a maximum capacity of 17,500 pounds of LP, are mounted on two cement pillars. The entire LP GAS handling process includes the latest safety products, with many of the safe-guards duplicated to assure extra protection. The facility is inspected on a daily basis during the fall harvest seasons. All of the LP GAS equipment is inspected annually by State officials. Much of the non-durable equipment (including hoses, safety valves) are replaced on a regular basis most of the time long before being required to be replace by other state and federal standards. The Florenceville branch is manned, with staff on site five days a week.\n\n (c) Worst-case and alternate accidental release scenarios - The offsite consequence analysis includes two accidental release theories, found as worst case release and alternative release scenario. \n\nThe worst case scenario is defined by EPA, which states that the owner or operator shall assume that the ... maximum quantity in the largest vessel . . . is released as a gas over 10 minutes due to an unspecified failure.   This accidental release is very unlikely to occur.  However, should it occur, 17,500 pounds of LP GAS would be released, with an estimated distance to 1 psi overpressure of 0.2 miles down wind from the facility.\n\nThe alternative release scenario is defined as more likely to occur than the worst-case scenario.  With no accident hi"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 4217,
      "SummaryText": "story experience to base on, it is WCA's presumption the most likely to occur would be the rupture of a transfer hose or pipe, tied with the failure of the involved excess-flow valve. However, should it occur, 17,500 pounds of LP GAS would be released, with an estimated distance to 1 psi overpressure of 0.1 miles down wind from the facility.\n\n\nWCA used RMP-Comp to calculate the distance to 1 psi overpressure endpoint selected by the EPA. The population within the endpoint distance of the Florenceville facility is defined as the population potentially affected by a worst-case flammable release.\n\nBecause LP GAS is not stored within a building, no passive mitigation measures can be credited to slow or reduce any release.\n\n\n\n (d) How to prevent accidental releases - WCA's accidental release prevention program is based upon provisions within  NFPA 58.  In addition to these requirements, WCA has also included the following elements:\n\n1. Strictly limiting the number of staff who are allowed to handle LP GAS\n2. All valve handles, controls and electrical switches are secured and/or locked to prevent unauthorized releases and/or the overfilling of the bulk tank.\n3. Strict enforcement of all parts replacement policies mandated by state and federal officials.\n4. Thorough inspections of all LP GAS equipment before fall harvest. \n\n(e)\tNo accidental releases of liquified petroleum gas have occurred at this facility in the past five years\n\n(f)\tEmergency Response Program - Safety improvements at WCA are an on-going process.  WCA has an extensive emergency response program, which it coordinates with the Howard County Local Emergency Planning Committee and the local fire departments. This program includes an emergency response decision chart, emergency phone number list, notification plans, maps and diagrams.\n \nRISK MANAGEMENT PLAN\n\nLP Gas\n\nCorn Dryer use at the\nWinneshiek Cooperative Association\nFlorenceville, Iowa location\n\n\n\nIn Compliance with 40 CFR 68\nFebruary, 1999"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 4217,
      "SummaryText": "Prepared by:\nWinneshiek Cooperative Association\nPO Box 402- Attn: Les Yaw\nDecorah, IA 52101\n\n\n\nPh: (319) 382-9686\ne-mail: lyaw@salamander.com"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 4217,
      "SummaryText": "Executive Summary\nTenneco Packaging Specialty and Consumer Products Inc.\nRisk Management Plan\nFrankfort, IL\n\n1.Accidental Release Prevention and Emergency Response Policies\nWe at Tenneco Packaging Specialty and Consumer Products, Inc. are strongly committed to employee, public and environmental safety.  This commitment is inherent in a comprehensive accidental release prevention program that covers areas such as design, installation, operation, and maintenance of the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances and to train employees regarding the safe operation of  processes involving regulated substances. Although such an event is unlikely, employees are trained to react to unplanned releases of regulated substances.  In addition, the plant has coordinated with local and other emergency response organizations which provide highly trained emergency response personnel to help control and lessen the effects of any unplanned release.\n\n2.The Stationary Source and the Regulated Substances \nThe primary manufacturing activity at this plant involves the production of plastic consumer products such as polystyrene foam plates, bowls, food containers, and trays that you might find meat or poultry on in a supermarket.  We have one substance present at our facility which is regulated by United States Environmental Protection Agency (USEPA) under the Risk Management Program.  This substance is iso-pentane; and is referenced in this document by the term regulated substance.  The regulated substance at our facility is used as foaming agents in the production of the polystyrene foam.  These products are also often called blowing agents or expansion agents .\n\nThe maximum inventory of iso-pentane possible at our facility is approximately 420,000 pounds. Written operating procedures and high-level alarms prevent more than this amount from being present at this facility.\n\n3.Worst Case Release S"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4217,
      "SummaryText": "cenario(s) and Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\nUnder RMP, USEPA requires facilities to determine the effects of catastrophic releases of regulated substances.  In facilities which use flammable regulated substances, USEPA defines the worst case scenario for a catastrophic release to be 1 pound per square inch (psi) over-pressure as a result of an instantaneous release of the largest tank volume utilizing no active measures to control the release of the regulated substance under worst-case weather conditions.   USEPA defines alternative release scenarios as 1 psi over-pressure as a result of a timed release of a portion of the largest tank volume utilizing active measures to control the release of the regulated substance under neutral weather conditions.  \n\n To evaluate the worst case scenario for the particular regulated substances and conditions at this facility, we used equations from Appendix D of the USEPA RMP Offsite Consequence Analysis Guidance and RMP Compute, a simplified EPA model based on the EPA\u0012s Offsite Consequence Analysis Guidance.  For analysis of alternative release scenarios, we also employed the equations provided by the USEPA in the RMP Offsite Consequence Analysis Guidance and RMP Compute.  The following paragraphs provide details of the chosen scenarios.\n\nThe activities at the plant can be categorized by Program 3 of the RMP guidance.  The projected worst case release scenario would involve a catastrophic release from the iso-pentane storage.  The scenario involves the release of 160,000 pounds of iso-pentane.  Passive mitigation systems such as dikes were not considered when evaluating this scenario.  The worst case release scenario assumes that the entire quantity of the iso-pentane storage tank is released as a vapor, an ignition source is present and 10 percent of the released quantity participates in a vapor cloud explosion.  Under"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4217,
      "SummaryText": "worst case weather conditions, the maximum distance of 0.40 miles corresponds to an endpoint of 1 psi overpressure.  \n\nThe alternative release scenario involves a release from the iso-pentane storage tank assumed to result in a pool fire.  The scenario involves the release of 26,000 pounds of iso-pentane. The release is controlled by active mitigation measures that include a deluge system and an automatic shut off valve.  Under neutral weather conditions, the maximum distance from the center of the pool where people can potentially receive second degree burns from a 40-second exposure is 0.10 miles.\n\n4.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under EPA\u0012s 40 CFR Part 68.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition.  A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119.  We also have an air operating permit under Title V of the Clean Air Act. This facility has received a Star Ranking under OSHA\u0012s Voluntary Protection Program (VPP) for over ten (10) years.  The following sections briefly describe the elements of the release prevention program that are in place at our stationary source.\n\nProcess Safety Information\nTenneco Packaging Specialty and Consumer Products, Inc.  maintains a detailed record of safety information that describes the chemical hazards, operating guidelines and equipment designs associated with the processes.\n\nProcess Hazard Analysis\nOur facility conducts extensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The approach used to carry out these analyses is a HAZOP/Modified What If process.  The studies are undertaken by a team of qualified personnel with expertise in engineering, process operations, and safety and are revalidated"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4217,
      "SummaryText": "at a regular interval of approximately every 5 years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Tenneco Packaging Specialty and Consumer Products, Inc.  maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily available to operators involved in the processes.\n\n\n\nTraining\nTenneco Packaging Specialty and Consumer Products, Inc. utilizes a detailed training program to ensure that employees who are operating processes using regulated substances are skilled in the handling, operation, and maintenance procedures associated with these processes.  Refresher training is provided at least every  one (1) years and more frequently as needed.\n\nMechanical Integrity\nTenneco Packaging Specialty and Consumer Products, Inc.  carries out routine, periodic maintenance inspections and preventive maintenance on process equipment to ensure proper operations.  Process equipment examined these inspections include but are not limited to pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with training in maintenance practices.  These personnel are provided specialized training as needed.  Any equipment deficiencies identified by maintenance inspections  are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures at Tenneco Packaging Specialty and Consumer Products, Inc. are in place to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4217,
      "SummaryText": "fication in process conditions are promptly made aware of changes and provided training, as needed, to deal with these changes.\n\nPre-startup Safety Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Tenneco Packaging Specialty and Consumer Products, Inc.  These reviews are conducted to confirm that equipment and procedures are complete and suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nTenneco Packaging Specialty and Consumer Products, Inc.  conducts audits on a regular basis to determine whether the requirements set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nTenneco Packaging Specialty and Consumer Products, Inc. promptly investigates any incident that results in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent a potential release from reoccurring.  Reports are kept for a minimum of 5 years.\n\nEmployee Participation\nTenneco Packaging Specialty and Consumer Products, Inc. truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  Many employees participate in safety initiatives within the plant.  In addition, our employees have access to all information created as part of our facility\u0012s implementation of the RMP rule, including information resulting from process hazard analyses, in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selectin"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 4217,
      "SummaryText": "uipment (fire extinguishers, etc) is regularly inspected and serviced. \n\n7. Planned Changes to Improve Safety\nOur facility has been certified for over ten years by OSHA as a STAR site in their Voluntary Protection Program (VPP).  To achieve this status, our facility has excellent occupational safety and health programs which encompass employee involvement, recognition for safe work, partnership with OSHA and continuous hazard identification activities.\n\nTo enhance our continuous improvement in occupational safety and health, we conduct monthly general safety and annual VPP safety planning meetings which includes employee participation.  \n\n8. Certification Statement\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\nName:   Reggie Goldsmith    Signature:__________________________\n\nTitle:  Plant Manager________________   Date signed:________________________\n\nExecutive Summary\n\n(a) Who - Winneshiek Cooperative Association (WCA) is an organization owned by crop growers and livestock producers in NE Iowa and SE Minnesota. The member-owners of WCA benefit from having strategically located fertilizer, feed and grain facilities in Winneshiek and Howard (Iowa) counties. \n\nBeing owned by farmers, WCA does everything it can to protect and preserve the environment.  The members, management and employees of WCA are committed to the prevention of any accidental releases of any kind, including liquefied petroleum gas (LP) from the tanks for the corn dryer at our Florenceville, Iowa location.  In the event an accidental release occurs, the Florenceville facility is well prepared to work with the local fire department, or other authorities, to mitigate any releases and minimize the impact of the release to people and the environment.\n\nAll applicable procedures of the U.S. Environmental Protection Agency prevention programs are strictly adhered to. The WCA Eme"
    }
  ]
}