{
  "FacilityID": 42186,
  "FacilityName": "Turkey Valley Farms",
  "FacilityStr1": "112 south 6th street",
  "FacilityStr2": null,
  "FacilityCity": "Marshall",
  "FacilityState": "MN",
  "FacilityZipCode": "56258",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27083",
  "LEPC": "Marshal Fire & Rescue",
  "FacilityLatDecDegs": "44.449722",
  "FacilityLongDecDegs": "-095.796389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Turkey Valley Farms",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Turkey Valley Farms",
  "OperatorStr1": "P.O. Box 200",
  "OperatorStr2": null,
  "OperatorCity": "Marshall",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56258",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joseph Como",
  "RMPTitle": "Plant Engineer, Operations Manager",
  "FTE": 300,
  "OtherEPAFacilityID": "MN0000854620",
  "EPAFacilityID": "100000094006",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-01-01 00:00:00",
  "SafetyInspectionBy": "Private Consultant",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-03-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-02-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-02-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-02-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 44.45038,
  "FRS_Long": -95.79379,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 60575,
      "AltID": "Poultry Processing",
      "FacilityID": 42186,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 61993,
          "ProcessID": 60575,
          "NAICSCode": "31161",
          "_desc": {
            "NAICS_CODE": "31161",
            "NAICS_DESCRIPTION": "Animal Slaughtering and Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 80009,
          "ProcessID": 60575,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 580009,
          "ProcessID": 60575,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42186,
      "SummaryText": "Turkey Valley Farms (TVF) is a new company in Marshall, MN.  The facility that will house TVF operations was formerly owned and operated by Heartland Foods / Willmar Poultry companies.  Much of the exsisting facility was demolished, and a new facility is currently under construction.\n\nTVF is a turkey processing plant that will use ammonia in the refrigeration system for cooling and freezing the final products.  The primary purpose of the facility is to process live turkeys into food products for distribution to retailers.  The main supply of ammonia is stored in steel tanks located at various locations within the facility.  Compressors in the \"engine room\" will circulate the ammonia through piping to the condensors and evaporators in the areas of the plant where refrigeration systems are used.  \n\nAmmonia is classified as a toxic chemical by the EPA.  All necessary precautions for safety must be implemented for the operation of a system of this type.  We will be following all refrigeration industry \"best practices\" to prevent unnecessary human exposure, health and safety threats to our workers, and reduce the threat to nearby members of the community.  It is the TVF policy to follow all Federal and State rules and regulations pertaining to our operations.  Safe operation of this system is directly connected to the design & application of the equipment as well as the training & competence of our refrigeration technicians.  All aspects of safe design and operation are being addressed with the utmost attention.\n\nAn accidental release program is being developed, and will be implemented prior to starting the plant.  The facility is being constructed using the International Institute of Ammonia Refrigeration (IIAR) guidelines, and will be in compliance with Fedral & State codes.  Equipment up-grades will be scheduled as warranted to maintain the system.  \n\nAll TVF ammonia refrigeration operators are trained using a formal program based on IIAR materials.  This program cons"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42186,
      "SummaryText": "ists of having an effective preventitive maintenance schedule, and comprehensive employee training to insure adequate response to equipment integrity.  The TVF policy is to replace \"in kind\" safety equipment  and/or other components required on the system on a time schedule recommended by the IIAR.\n\nTVF will organize, train, and equip an \"in-house\" emergency response team to handle accidental releases of ammonia.  All components of the 1910.120 (HAZWOPER) standards for emegency response to chemical releases will be implemented.  The team will be designed as a \"unified ERT\", meaning that they will be able to address all types of emergencies including fires, medical, chemical, and rescue operations.  Close coordination and cooperation will be maintained with the city of Marshall fire & rescue units.  Initial team training, refresher training, and practical exercises are conducted on a regular schedule.\n\nWhen this plant goes into production (anticipated - 03-15-2005) every employee will have received formal safety training & education.  Supervisors and department leaders will have an OSHA 30 hour course completed, every line worker will have an OSHA 10 hour course completed, and the Unified ERT will have the equivalent of a 40 Hr. HAZWOPER by the years end.  Select employees will be involved in the development and receive training on the PSM program, Hazardous Waste Management, NPDES, and chemical handling & storage policy.  Safety is not going to be implemented as a priority at this facility, but rather as a \"Standard Operation\" and the only way of getting the job accomplished."
    }
  ]
}