{
  "FacilityID": 42194,
  "FacilityName": "Telco Food Products, Inc.",
  "FacilityStr1": "2111 West Valley Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Colton",
  "FacilityState": "CA",
  "FacilityZipCode": "92324",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06071",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "34.071944",
  "FacilityLongDecDegs": "-117.364722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9648304,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Tim Telliard",
  "OperatorStr1": "2111 West Valley Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Colton",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92324",
  "OperatorZipCodeExt": null,
  "FTE": 100,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000164412",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-03-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-02-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-02-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-08-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 34.07051,
  "FRS_Long": -117.36537,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 60584,
      "AltID": "Bakery Manufacturer",
      "FacilityID": 42194,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 80018,
          "ProcessID": 60584,
          "ChemicalID": 56,
          "Quantity": 19000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 62003,
          "ProcessID": 60584,
          "NAICSCode": "31181",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 35094,
              "Process_NAICS_ID": 62003,
              "SafetyReviewDate": "2001-07-25 00:00:00",
              "PHA_Date": "2001-07-25 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-07-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Water Dilution Tank",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2001-07-27 00:00:00",
              "TrainingReviewDate": "2001-07-25 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-07-27 00:00:00",
              "EquipmentInspectionDate": "2001-07-30 00:00:00",
              "EquipmentTested": "compressors",
              "ChangeMgmtDate": "2000-10-04 00:00:00",
              "ChangeMgmtReviewDate": "1999-08-27 00:00:00",
              "PreStartupReviewDate": "2000-10-09 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-07-25 00:00:00",
              "HotWorkPermitReviewDate": "1999-08-27 00:00:00",
              "ContractorSafetyReviewDate": "1999-09-07 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "This bakery manufacturer uses two separate and independent ammonia refrigeration processes containing anhydrous ammonia.  The original process contains 19,100 lbs of ammonia and the process that became operational in July 2001 contains 21,000 lbs.  The following information applies to both of the ammonia refrigeration systems.  These processes include ASME vessels, evaporators, compressors, and condensers to provide refrigeration to storage and processing areas.",
              "_chemicals": [
                {
                  "PrimaryKey": 51030,
                  "PreventionProgram3ID": 35094,
                  "ProcessChemicalID": 80018
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 60585,
      "AltID": "Bakery Manufacturer",
      "FacilityID": 42194,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 80019,
          "ProcessID": 60585,
          "ChemicalID": 56,
          "Quantity": 21000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 62004,
          "ProcessID": 60585,
          "NAICSCode": "31181",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 42194,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "San Bernardino County Fire Dept.",
    "CoordinatingAgencyPhone": "9093874631",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42194,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nTelco Food Products, Inc. (Telco) facility has an emergency response plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Response section of the PSM/RMP document as well as the Business Plan.  This Plan was designed to meet the following objectives:\n\n1.) To save lives.\n2.) To minimize and avoid injuries.\n3.) To protect the environment.\n4.) To minimize property damage.\n\nThe Plan provides the response organization and notification procedures, evacuation assembly areas, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan was reviewed and updated at least once per year.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Telco facility was designed and constructed in accordance with all applicable federal, state, and local regulations.  The facility is located at 2111 West Valley Blvd., Colton, CA 92324 and began operation in 1999.  In October 2000, the facility added new freezer and cooler rooms which required additional evaporators (10), compressors (2), and condenser (1).  In July 2001, an additional separate and independent ammonia refrigeration system containing 21,000 lbs. of ammonia was installed.\n\nThe area immediately surrounding the facility is comprised of commercial areas and vacant fields with residences to the north.  The facility is situated approximately 0.3 miles north of Interstate 10.\n\nAmmonia is used as the refrigerant in the industrial refrigeration system that provides cold storage for food products.  The original ammonia refrigeration system uses 19,100 pounds of ammonia within a closed system for the purpose of manufacturing bakery products.  The July 2001 ammonia system uses 21,000 lbs of ammonia.  The system cycles ammonia through various physical states in order to provide cooling in the bakery production processes and cold storage rooms. \n\n\nACCID"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42194,
      "SummaryText": "ENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nA sensor within Machine Room 1 will alarm at 125 ppm.  A signal is sent to the central computer and is logged within alarm history and will wait for operator response, otherwise, if time occurs, operators are paged.  An initial shutdown occurs at 250 ppm which does the following: (1) Shut down of solenoid valves in order to isolate the ammonia, (2) The purge ventilation fan is turned on with a manual reset required, (3) scrubbing system pumps and fans are turned on with a manual reset required, and (4) Signal is sent to notify operator (refrigeration contractor).  A final shutdown occurs at 10,000 ppm which de-energizes all of the equipment in the machine room including the compressors.  The facility is equipped with an automatic shut off button located outside of the Machine room.  If a release were to occur, operators can activate this prevention measure.  The majority of the ammonia equipment is located in the Machine Room. \n\nSensors are also located within Machine Room 2 (July 2001) which alarm at 30 ppm.  A signal is sent to the auto dialer (Security Link) who contacts operators.  At 120 ppm, Security Link is instructed to call the fire department.  Exhaust fans are energized and exhaust is routed from engine room to condenser inlet.  Automatic controls energize condenser fans.  Shutdown occurs at 10,000 ppm which de-energizes all of the equipment in the machine room including the compressors.  The facility is equipped with three automatic shut off buttons located outside of the Machine Room 2 doors.  If a release were to occur, managers or operators can activate this prevention measure.  The majority of the ammonia equipment is located in the Machine Room 2.\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere is no accident history at this facility within the past five years.\n\n\nEMERGENCY RESPONSE PROGRAM\n\nTelco has an emergency response plan in effect at the facility.  If a release of ammonia were to occ"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42194,
      "SummaryText": "ur, Telco will determine the extent of the emergency.  The alarms are tied into the ammonia sensors and will automatically alarm.  Telco management will determine if an evacuation is necessary.  They will call 911 in order to reach the San Bernardino County Fire Department HazMat team who will respond to the ammonia release.  \n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe initial Process Hazard Analysis study (including a HAZOP study and What-If Walkthrough) was performed on July 28, 1999 at Telco Food Products, Inc.  There were several mitigation measures recommended at that time.  The majority of those recommendations were completed by June 2000.  ries).\n\nA second Process Hazard Analysis study (including a HAZOP study, checklists and walkthrough) was performed on July 25, 2001 at Telco Food Products, Inc. for the ammonia system installed in July 2001.  There were several mitigation measures recommended at that time.  The recommendations will be completed by July 2002.  Some of the mitigation measures implemented included the following items:\n\nR01:Conduct an awareness training program that includes informing all employees of the following: 1) the presence of and the hazards associated with ammonia at the facility, 2) what to do if they observe an ammonia leak, and 3) where to go when they are told to evacuate.\n\nR02:Consider having local Fire Department team participate in the evacuation drills and familiarize them with the system, equipment location within the facility, and of Telco's and Key Mechanical's capabilities.\n\nR03:Consider implementing a periodic test to verify ammonia sensors are operational.\n\nR04:Ensure that dual relief valves are replaced/recertified on a 5-year schedule.  Also, replace any relief valve that engages to vent pressure.    \n\nR05:Consider conducting an annual visual inspection for rust on all exterior ammonia piping into the maintenance program.  Paint and repair insulation as needed as per IIAR Bulletin 110 Guidelines.\n\nR06:Consider starting a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 42194,
      "SummaryText": " daily log to record daily walkthroughs of ammonia equipment to be performed by Telco management.    \n\nR07:Evaluate feasibility of combining emergency shut off for original system and new system, so the same shut off button deactivates both systems.  \n\nR08:Consider the feasibility of installing eye wash station just outside both machine room doors.\n\nR09:Consider the feasibility of keeping interface software and spare parts for Logix control system available on hand in the event of control system failure.\n\nR10:Consider conducting an annual test to activate all mechanical switches to ensure high level alarms are initiated and compressors are shut down, and low level alarms are initiated.  Calibrate switches with bulls eye as needed.\n\nR11:Ensure that all evaporator coils are periodically maintained by cleaning the pans and coils per IIAR Bulletin 110 Guidelines.\n\nR12:Follow compressor manufacturer's recommended maintenance program (including replacing the coalescer and oil). \n\nR13:On an annual basis or as recommended by manufacturer, verify the operability of the compressor safety shut down features.\n\nR14:Ensure the condenser is periodically maintained including water treatment and cleaning out of the water reservoir per IIAR Bulletin 110.\n\nR15:Recommend continuing practice of maintenance operator notifying other employees when work is to be performed in isolated areas at the facility.\n\nR16:Review lock out/tag out program and ensure it is used when entering the condensers for cleaning or maintenance.  \n\nWR01:Consider moving one detector from the roof top closer to the floor of the machine room.  \n\nWR02:Consider installing a light outside the machine room doors to notify any employees of an ammonia release inside the machine room prior to entering.\n\nWR03:Ensure all critical valves and ammonia piping are labeled.\n\nWR04:Ensure ammonia warning signs appear on exterior doors to machine room. \n\nWR05:Include in the Mechanical Integrity program a periodic check of the water le"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 42194,
      "SummaryText": "vel and an annual check of the pH of the water dilution tank to discover any ammonia releases from the relief valves.\n\nRC01:Discuss flag with fire department.\n\nRC02: Recommend reviewing the Emergency Response Checklist annually."
    }
  ]
}