{
  "FacilityID": 42457,
  "FacilityName": "Univar USA Inc.--Dallas, TX",
  "FacilityStr1": "10889 Bekay Street",
  "FacilityStr2": null,
  "FacilityCity": "Dallas",
  "FacilityState": "TX",
  "FacilityZipCode": "75238",
  "Facility4DigitZipExt": "1313",
  "FacilityCountyFIPS": "48113",
  "LEPC": "Dallas County LEPC",
  "FacilityLatDecDegs": "32.902500",
  "FacilityLongDecDegs": "-096.692778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PF",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 102971785,
  "ParentCompanyName": "Univar USA Inc.",
  "Company2Name": null,
  "CompanyDUNS": 102971785,
  "Company2DUNS": 0,
  "OperatorName": "Jason Miller",
  "OperatorStr1": "10889 Bekay Street",
  "OperatorStr2": null,
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75238",
  "OperatorZipCodeExt": "1313",
  "FTE": 83,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000046979",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-03-10 00:00:00",
  "SafetyInspectionBy": "City of Dallas Storm Water",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": "RMP-3/11/05",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-03-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-03-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-03-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-03-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 32.9016,
  "FRS_Long": -96.69643,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61039,
      "AltID": "Containerized Storage",
      "FacilityID": 42457,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 80596,
          "ProcessID": 61039,
          "ChemicalID": 57,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 80597,
          "ProcessID": 61039,
          "ChemicalID": 55,
          "Quantity": 15750.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 80598,
          "ProcessID": 61039,
          "ChemicalID": 1,
          "Quantity": 40400.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 62467,
          "ProcessID": 61039,
          "NAICSCode": "42469",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 22968,
              "Process_NAICS_ID": 62467,
              "SafetyReviewDate": "2004-10-06 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2004-10-06 00:00:00",
              "ChangeCompletionDate": "2004-10-06 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2005-02-17 00:00:00",
              "TrainingReviewDate": "2004-11-08 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Outside Contractors",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-10-06 00:00:00",
              "EquipmentInspectionDate": "2005-03-11 00:00:00",
              "EquipmentTested": "Forklift",
              "ComplianceAuditDate": "2004-12-14 00:00:00",
              "AuditCompletionDate": "2005-01-11 00:00:00",
              "IncidentInvestigationDate": "2004-12-29 00:00:00",
              "InvestigationChangeDate": "2005-01-02 00:00:00",
              "MostRecentChangeDate": "2004-10-06 00:00:00",
              "CBI_Flag": 0,
              "Description": "PHA Performed on HF, Ammonia, and Formaldehyde",
              "_chemicals": [
                {
                  "PrimaryKey": 24001,
                  "PreventionProgram2ID": 22968,
                  "ProcessChemicalID": 80596
                },
                {
                  "PrimaryKey": 24002,
                  "PreventionProgram2ID": 22968,
                  "ProcessChemicalID": 80597
                },
                {
                  "PrimaryKey": 24003,
                  "PreventionProgram2ID": 22968,
                  "ProcessChemicalID": 80598
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 42457,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2002-12-16 00:00:00",
    "ERTrainingDate": "2005-01-06 00:00:00",
    "CoordinatingAgencyName": "Dallas F.D. Sta #57, Dallas, TX",
    "CoordinatingAgencyPhone": "0000000911",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42457,
      "SummaryText": "COMPANY OVERVIEW\n\nUnivar USA Inc is a wholesale chemical distributor serving a number of U.S. Industries.  The original company, Van Waters & Rogers Inc was founded in 1924.  In 2001, the name was changed to Vopak USA Inc and then in 2002 the name was changed to Univar USA Inc.  Univar USA Inc  supplies the food industry, chemical compounders, pharmaceuticals, mining, forest products, oil and gas producers, electronics, coating and many other key industries with the chemical raw materials required to produce or refine products used in numerous end-use markets.\n \nUnivar USA Inc is a member of the National Association of Chemical Distributors (NACD) and complies with the Responsible Distribution Process (RDP), an environmental, health and safety improvement initiative.\n\nSome of the products stored and handled by Univar USA Inc are subject to EPA's Risk Management Program rule (40 CFR Part 68).  A key requirement of this rule is the preparation and submission of an RMP Plan, contained herein.  The contents of the RMP Plan are prescribed by EPA, including this Executive Summary.  \n\nCORPORATE PREVENTION AND EMERGENCY RESPONSE APPROACH  \n\n1.  Prevention program:  The process that is regulated under EPA's RMP rule is subject under Program 3 Prevention program.  Univar USA Inc has documented the Prevention Program in its Process Safety Management Manual.  Briefly, this program includes provisions and requirements for:  Safety Information; Hazard Review; Operating Procedures; Training; Maintenance; Compliance Audits; Incident Investigation.  \n\n2.  Emergency Response Approach:  Univar USA Inc has an Emergency Contingency Plan in place.  This plan is shared with local emergency responders who have access to Univar USA Inc facility personnel (and up-to-date phone numbers).  Univar USA Inc responds to minor incidents but will call in professional emergency responders in the event of all other incidents.  \n\nUnivar USA Inc invites and encourages local emergency responders such as "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42457,
      "SummaryText": "the fire department to visit and familiarize themselves with Univar USA Inc products and facilities.  Joint emergency exercises are conducted when possible.  \n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED:  Our facility's primary activities encompass Chemical Repackaging, Storage & Distribution.  We have five RMP-regulated substances stored above threshold limits:  Ammonium Hydroxide; Hydrofluoric Acid 70%; Cyclohexylamine; Ethylenediamine; Formaldehyde 37%.\n\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM:  Our facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68 of the EPA including:  1. Safety Information-Univar USA Inc. maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.  2. Hazard Review-Our facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is the \"What-If\" technique.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of five years.  Any finding related to the hazard analysis are addressed in a timely manner.  3. Operating Procedures-For the purposes of safely conducting activities within our covered processes, Univar USA Inc maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.  4. Training-Univar USA Inc has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedur"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42457,
      "SummaryText": "es associated with these processes.  Refresher training is provided at least every year and more frequently as needed.  5. Maintenance-Univar USA Inc carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks include among others: storage tanks, piping systems, relief and vent systems, controls and pumps.  Maintenance operations are carried out by qualified personnel.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.  6. Compliance Audits-Univar USA Inc conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 2 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.  7. Incident Investigation-Univar USA Inc promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.  8. Contractors-On occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Univar USA Inc has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental relaese of a regulated substance occur.\n\nFIVE-YEAR ACCIDENT HISTORY:  Univar USA Inc has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, no accidental release of the RM"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 42457,
      "SummaryText": "P substances listed above has occurred during this period.\n\nEMERGENCY RESPONSE PLAN:  Univar USA Inc is strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with tthe processes at our facillty.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, our highly trained emergency response personnel are at hand to control and mitigate the effects of the release.  We are also completely coordinated with the local Fire Department which provides additional emergency response expertise.\n\nUnivar USA Inc carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is proptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nCERTIFICATION STATEMENT:  The undersigned certifies that to the best of my knowledge, information, and belief, formed after resaonable inquiry, the information submitted is true, accurate and complete.\n\nName:             __________________________________________________\n\nSignature:       __________________________________________________\n\nTitle:                __________________________________________________\n\nDate Signed:   __________________________________________________"
    }
  ]
}