{
  "FacilityID": 42522,
  "FacilityName": "Flint Hills Resources, LP",
  "FacilityStr1": "2267 Highway 34 North",
  "FacilityStr2": null,
  "FacilityCity": "Junction City",
  "FacilityState": "WI",
  "FacilityZipCode": "54443",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55097",
  "LEPC": "Portage County, WI",
  "FacilityLatDecDegs": "44.593193",
  "FacilityLongDecDegs": "-089.717087",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": "www.fhr.com",
  "FacilityEmailAddress": "diane.schmidt@fhr.com",
  "FacilityDUNS": 56576507,
  "ParentCompanyName": "Flint Hills Resources, LP",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Flint Hills Resources, LP",
  "OperatorStr1": "2267 Highway 34 North",
  "OperatorStr2": null,
  "OperatorCity": "Junction City",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54443",
  "OperatorZipCodeExt": null,
  "RMPContact": "Shawn Marion",
  "RMPTitle": "Terminal Manager",
  "FTE": 6,
  "OtherEPAFacilityID": "WID000713107",
  "EPAFacilityID": "100000164172",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-07-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-04-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-03-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-03-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 44.61667,
  "FRS_Long": -89.78333,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61125,
      "AltID": "Propane Storage",
      "FacilityID": 42522,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 62553,
          "ProcessID": 61125,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 80696,
          "ProcessID": 61125,
          "ChemicalID": 98,
          "Quantity": 2700000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 580696,
          "ProcessID": 61125,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42522,
      "SummaryText": "RMP Executive Summary:\n\nThis Executive Summary briefly reviews the major elements of the Rick Management Plan (RMP) for the Flint Hills Resources, LP  Junction City, Wisconsin facility (FHR).  This summary is presented in response to the requirements of the United States Environmental Protection Agencies (USEPA) under 40 CFR Part 68 and 112( r )  of the Clean Air Act.  The Junction City facility is subject to the RMP rule due to the storage of Propane above the threshold quantity.\n\n1. Accidental Release Prevention and Emergency Response Policies\nFlint Hills Resources, LP is committed to protecting the environment and operating facilities in a manner that promotes the safety of employees and the general public.  The management has adopted and implemented policies that adhere to all applicable Federal and state rules and regulations.  Safety is the number one consideration in the handling of propane; our goal is to prevent accidental releases through the proper design, installation, operation and maintenance of the equipment, and the training of our personnel.  The facility is operated consistent with National Fire Protection Association (NFPA) requirements for propane facilities.\n\nIn the event that a release does occur, the facility's emergency response is contained in an Integrated Contingency Plan.  Our response plan includes procedures to coordinate response actions with local emergency responders such as the fire and law enforcement departments as well as any potentially affected neighbors.\n \n2. Facility Description and Regulated Substances Handled\nThe Junction City facility operates as a bulk fuel distribution and storage terminal.  The facility stores and distributes gasoline, fuel oil and propane to wholesale customers.  Fuels are received at the facility by pipeline, stored in product storage tanks and vessels and distributed to customers via bulk tanker trucks at two product loading racks.  One loading rack is used for gasoline and fuel oil and the other loa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42522,
      "SummaryText": "ding rack is used for propane.  Propane is the only RMP regulated substance that the facility handles above the threshold quantity.  Ethyl mercaptan, a RMP regulated substance, is used to stench propane gas at the facility, but the quantity stored is below regulatory threshold quantities.    \n\nPropane is stored at the facility in nine storage vessels (bullets) with one storage vessel for off specification propane.  The facility also operates a propane transport truck-loading rack.\n\nIn addition, the facility operates two 500 gallon propane tanks which are excluded from the RMP program provisions due to their use as a fuel (40 CFR 68.126).  One of the propane tanks is used for office building heating and the second tank is used to fuel the facility?s vapor combustion unit.\n\nThe entire facility is enclosed by fence and access is restricted to authorized personnel only.\n\n3. Accidental Release Prevention Program and Chemical Specific Prevention Steps\nFHR has programs in place to address accidental release prevention measures required by EPA, Process Safety Management (PSM) requirements from OSHA, and all notification requirements of EPA's Emergency Response and Community Right-to-Know regulations.  The facility complies with PSM for the management of propane.  \n\nEmployee Participation\nFHR has developed an employee participation program.  All Process Safety Information, Process Hazard Analysis (PHA) results, recommendations, and action items, incident investigations, compliance audits, operating procedures, emergency response plan, and records of management of change are available to the operating personnel at any time.  Process Hazard Analysis team members include staff from division management, operations and engineering supervisors and operations personnel and technicians.   \n\nProcess Hazard Analysis and Process Safety Information\nThe facility utilizes the Failure Mode and Effects Analysis technique of Hazard Analysis.  The PHA identified the following potential major "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42522,
      "SummaryText": "hazards: fire, explosion, over-pressurization, over-filling and equipment failure.  The facility utilizes process controls such as vents, relief valves, check valves, manual shutoffs, automatic shutoffs, interlocks, alarms and procedures, backup pumps, grounding equipment and excessive flow devices to prevent or limit releases.  The facility operates both process area detectors and perimeter monitors and dikes are used as a mitigation system in the event of a spill.\n\nOperating Procedures and Training\nFHR maintains written procedures that address all modes of process operations, including: unit startup, normal operations, temporary/maintenance operations, emergency shutdown and normal shutdown.  These procedures can be used as a reference by experienced operators and provide consistent training of new operators.  The facility has developed and implemented a comprehensive training program for all employees involved in facility operations.  \n\nContractors\nThe contractor safety procedures establish minimum guidelines and activities in order to assure that the contractor's employees follow safe work practices and procedures.  The procedure includes a contractor screening process and hazard awareness, safety and emergency procedures training.\n\nPre-startup Safety Reviews\nFHR conducts a Pre-Startup Safety Review (PSSR) for any new facility or facility modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel, and the equipment are appropriately prepared for startup prior to placing the equipment into service.\n\nMechanical Integrity\nThe facility has well-established practices and procedures to maintain pressure vessels, piping systems, relief systems, pumps, emergency shutdown systems and controls in a safe operating condition.  This program includes written procedures, training and regular inspections and equipment testing.\n\nManagement of Change\nThe facility?s Management of Change ("
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 42522,
      "SummaryText": "MOC) program reviews all proposed changes to process chemicals, technology, equipment, procedures, materials and design conditions prior to implementation of the change.  Changes are reviewed to ensure that adequate controls are in place to manage any new hazards, and to verify that existing controls have not been compromised by a process change.  \n\n\nIncident Investigation\nFHR has procedures to promptly investigate any incident that has resulted in, or could reasonably result in a release of a regulated substance.  The procedure establishes the minimum guidelines and activities of the incident investigation program in order to reduce the likelihood of repetitive occurrences of events which could reasonably lead to catastrophic releases.  Investigations will be undertaken to identify the situation leading to the incident as well as any corrective actions to prevent a similar release in the future.\n\nCompliance Audits\nThe facility regularly conducts audits of the provisions of RMP to verify that procedures and practices developed under the standard are adequate and are being followed.  The audit includes a review of documentation and process safety information, inspection of the physical facilities, and interviews with all levels of plant personnel.\n\n4. Accident History\nIn the five years preceding submittal of this plan, there were no accidental releases with on-site or off-site consequences meeting EPA criteria for inclusion in this plan.\n\n5. Emergency Response Program\nFHR maintains a written emergency response program to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response, including proper first-aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 42522,
      "SummaryText": "of local emergency response agencies and the public if a release occurs, and post-incident cleanup and decontamination requirements.   In addition, FHR has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  We work with the local Fire Department and emergency responders to ensure the proper execution of our plan.  The emergency response program is updated when necessary based on modifications made to facility processes. \n\n6. Planned Changes to Improve Safety\nSafety practices are continually reviewed. Equipment and maintenance programs are monitored on an ongoing basis.  At the submission of this plan, no immediate changes are scheduled."
    }
  ]
}