{
  "FacilityID": 42536,
  "FacilityName": "Woonsocket Regional Wastewater Commission",
  "FacilityStr1": "11 Cumberland Hill Road",
  "FacilityStr2": null,
  "FacilityCity": "Woonsocket",
  "FacilityState": "RI",
  "FacilityZipCode": "02895",
  "Facility4DigitZipExt": "4819",
  "FacilityCountyFIPS": "44007",
  "LEPC": "District 1 LEPC",
  "FacilityLatDecDegs": "41.727340",
  "FacilityLongDecDegs": "-071.799250",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "LW",
  "FacilityURL": "http://www.ci.woonsocket.ri.us/",
  "FacilityEmailAddress": "wrwc@woonsocketri.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Woonsocket RI",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Veolia Water NA",
  "OperatorStr1": "11 Cumberland Hill Road",
  "OperatorStr2": null,
  "OperatorCity": "Woonsocket",
  "OperatorStateFIPS": "RI",
  "OperatorZipCode": "02895",
  "OperatorZipCodeExt": "4819",
  "RMPContact": "Roger Boltrushek",
  "RMPTitle": "Superintendent",
  "FTE": 14,
  "OtherEPAFacilityID": "RI0100111",
  "EPAFacilityID": "100000082279",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-09-21 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-04-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-04-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-04-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-01-24 00:00:00",
  "DeRegistrationEffectiveDate": "2005-11-27 00:00:00",
  "AnniversaryDate": "2010-04-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 42.00056,
  "FRS_Long": -71.49583,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61144,
      "AltID": "Chlorination",
      "FacilityID": 42536,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 62572,
          "ProcessID": 61144,
          "NAICSCode": "56221",
          "_desc": {
            "NAICS_CODE": "56221",
            "NAICS_DESCRIPTION": "Waste Treatment and Disposal"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 80715,
          "ProcessID": 61144,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 580715,
          "ProcessID": 61144,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 61145,
      "AltID": "Dechlorination",
      "FacilityID": 42536,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 62573,
          "ProcessID": 61145,
          "NAICSCode": "56221",
          "_desc": {
            "NAICS_CODE": "56221",
            "NAICS_DESCRIPTION": "Waste Treatment and Disposal"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 80716,
          "ProcessID": 61145,
          "ChemicalID": 49,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 580716,
          "ProcessID": 61145,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42536,
      "SummaryText": "\nThe Woonsocket Regional Wastewater Commission's (WRWC) Accidental Release\nPrevention Policy involves a unified approach that integrates state of the art technologies,\nprocedures and management practices.\n\nFor process ID 1 (Chlorination),  the WRWC utilizes chlorine in its clarification process in order\nto meet its Permit limit of fecal coliform.  The Chlorination System consists of  two (2) banks\nwith three (3) one toncylinders of chlorine each.  There is an automatic switch valve to switch\nover when onebank is empty.  Each chlorine cylinder is equipped with a rapid shut off valve.  This\nsystem provides a rapid closure (3 second response) of chlorine cylinders upon contact closure\nfrom gas detectors and fire alarm.  To make the system safer, a second chlorine gas detector\nwas installed and connected to the cylinders rapid shut off valves controller as a back up in\nthe event of failure of the main chlorine gas detector.  In addition a motorized shut off\nvalve was installed on each chlorine line to the vacuum regulators.  Those valves will be\nactivated upon receiving a signal from the PLC in the event that the chlorine gas detectors\nor the fire alarm are activated.  Total response time from the time of release to complete\nshut down of system is seventeen (17) seconds.  \n\nThe offsite consequence analysis includes consideration of two chlorine release scenarios,\nidentified as \"worst-case release\" and \"alternative scenario\".  The first scenario is defined\nby EPA, which states that \"the owner or operator shall assume that the ... maximum\nquantity in the largest vessel ... is released as a gas over 10 minutes,\" due to an unspecified\nfailure.  The alternative scenario is defined as \"more likely to occur than the worst-case\nrelease scenario\".\n\nAtmospheric dispersion modeling has to be performed to determine the distance traveled\nby the chlorine released before its concentration decreases to the \"toxic endpoint\" selected\nby EPA of 3 ppm, which is the Emergency Response Plann"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42536,
      "SummaryText": "ing Guideline Level 2 (ERPG-2). \nThis is defined by the American Industrial Hygiene Association (AIHA) as the \"maximum\nairborne concentration below which it is believed that nearly all individuals could be\nexposed for up to one hour without experiencing or developing irreversible or other serious\nhealth effects or symptoms which could impair an individual's ability to take protective\naction.\"  The residential population within a circle with a radius corresponding to the toxic\nendpoint distance has to be defined, \"to estimate the population potentially affected\".\n\nThe worst-case release scenario at the Chlorination System involves a failure of the one ton-\ncontainer  The offsite consequence analysis for this scenario was performed by RMP*Comp\nver 1.06 .  This conditions was pre-defined by EPA, namely release of the entire amount as\na gas in 10 minutes, use of the one-hour average ERPG-2 as the toxic endpoint and\nconsideration of the population residing within a full circle with radius corresponding to\nthe toxic endpoint distance.  EPA set these conditions to facilitate the performance of the\noffsite consequence analysis; however, the assumptions used may be unrealistic because:\n\nWhen atmospheric dispersion modeling for the worst-case scenario was performed using\nthe EPA assumptions, a distance to toxic endpoint of 0.9 miles and an estimate of\nresidential population potentially affected of 28,000 was obtained. \nThe alternative release scenario involves the rupture of the flexible connections (pigtails)\nconnected to three ton-containers, possibly due to an earthquake.  The amount of chlorine\nreleased is 1 lbs., at an average rate over one minute (the duration of the release) of 1 (one)\nlb/min. The estimated toxic endpoint was 0.10 mile with 30 persons effected. Actuation of the\nchlorine detector is an active mitigation measure considered.  An additional mitigation system\ninstalled of the automatic shut off valves on the chlorine containers. \n\nFor process ID 2 (Dechlori"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42536,
      "SummaryText": "nation) which is utilizing sulfur dioxide for the removal of residual\nchlorine from the final effluent in order to meet plant permit of 0.056 mg/L of chlorine residual.\n\nThe dechlorination system is consisting of two (2) banks with two (2) one ton cylinders of sulfur\ndioxide each. The same as in process ID 1, the dechlorination system has an automatic switch\nover when one bank is empty. There are two (2) gas detectors and both detectors are connected\nto automatic shut off valves which are installed on each sulfur dioxide cylinders.\n\nUsing RMP*Comp ver 1.06 to determine the toxic endpoint for worst case release scenario of\none ton sulfur dioxide which estimated at 0.90 miles, the same as in the chlorination process.\n\nAs for alternative release of which was based on one pound of sulfur dioxide, similar to the same\nanalysis for process ID1, the estimated toxic endpoint found to be 0.10 mile with 30 persons were\neffected.\n\nThe general Woonsocket Regional Wastewater Commission (WRWC) accidental release\nprevention program is based on the following key elements:\n\n           Preventive maintenance program.\n\n          Use of state-of-the-art process and safety equipment.\n\n     Use of accurate and effective operating procedures, written with the participation of     \n     the operators.\n\n          Performance of a hazard review of equipment and procedures.\n\n          Implementation of an auditing and inspection program..\n\nNo accidental releases of chlorine have occurred at this facility in the past five years.\n\nThe facility has an emergency response program, which has been coordinated (reviewed)\nby the City of Woonsocket Fire Department, which is a member of the Local Emergency\nResponse Planning Committee (LEPC).  This program includes an emergency response\ndecision tree and a notification plan."
    }
  ]
}