{
  "FacilityID": 42623,
  "FacilityName": "Kanto Corporation",
  "FacilityStr1": "13424 North Woodrush Way",
  "FacilityStr2": null,
  "FacilityCity": "Portland",
  "FacilityState": "OR",
  "FacilityZipCode": "97203",
  "Facility4DigitZipExt": "6417",
  "FacilityCountyFIPS": "41051",
  "LEPC": "Oregon Statewide LEPC",
  "FacilityLatDecDegs": "45.644444",
  "FacilityLongDecDegs": "-122.765555",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "P5",
  "LatLongDescription": "IP",
  "FacilityURL": "www.kantocorp.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Kanto Chemical Company Inc., Tokyo, Japan",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Kanto Corporation",
  "OperatorStr1": "13424 North Woodrush Way",
  "OperatorStr2": null,
  "OperatorCity": "Portland",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97203",
  "OperatorZipCodeExt": "6417",
  "RMPContact": null,
  "RMPTitle": "Plant Manager",
  "FTE": 68,
  "OtherEPAFacilityID": "97203KNTCR13424",
  "EPAFacilityID": "100000100785",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-10-13 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-01-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-04-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-04-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-04-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 45.61965,
  "FRS_Long": -122.76736,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61296,
      "AltID": "Ammonium hydroxide wareho",
      "FacilityID": 42623,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 62728,
          "ProcessID": 61296,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 80900,
          "ProcessID": 61296,
          "ChemicalID": 57,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 580900,
          "ProcessID": 61296,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 61297,
      "AltID": "Ammonium hydroxide manufa",
      "FacilityID": 42623,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 62729,
          "ProcessID": 61297,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 80901,
          "ProcessID": 61297,
          "ChemicalID": 56,
          "Quantity": 42240.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 580901,
          "ProcessID": 61297,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42623,
      "SummaryText": "COMPANY AND PROCESS DESCRIPTIONS\n\nKanto Corporation, Portland Manufacturing Facility (KC-PMF) was established in 1990 as a wholly owned subsidiary of Kanto Chemical Company Ltd., Japan, a company which has been in business for over 45-years as a manufacturer of high purity chemicals and chemical distribution systems.  As a leading supplier of high purity inorganic and organic chemicals, KC-PMF is dedicated to leading the US semiconductor industry as the most advanced supplier of custom-made process chemicals and related services.  High purity is essential to KC-PMF's business.  This demand by industry for high purity requires advanced process equipment and processes that are provided for in a state-of-the-art, purpose-built facility designed to exacting standards established by KC-PMF's parent company. To meet these requirements, KC-PMF's process systems are for the most part fully contained or closed chemical systems, and all chemical handling and storage areas designed and built to achieve 100% spill containment with all floor drains connected directly to an OR-DEQ permitted Elementary Neutralization System.\n\nKC-PMF is located in the Rivergate Industrial District of Portland, Oregon.  KC-PMF began production in 1996, and includes both manufacturing/packaging and chemical warehousing capabilities.  KC-PMF's employees provide leadership to its vendors to ensure safety, quality, and customer satisfaction.  KC-PMF's employees are trained in applicable EPA-, OSHA-, and DOT- driven environmental and safety programs.\n\nThe processes covered by EPA's RMP requirements relate to the manufacture and temporary storage of ammonium hydroxide solution.  Other chemicals are also processed and stored on-site, some in similar volumes as ammonium hydroxide, but which are not covered by EPA's RMP rule.   The covered process requires on-site bulk storage of the precurser chemical anhydrous ammonia and the necessary process equipment to safely, and with high quality, combine it with wat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42623,
      "SummaryText": "er to form ammonium hydroxide solution 29%.  The latter is contained in on-site storage tanks from where it is subsequently repackaged into bottles, drums, IBCs or totes, and ISO containers.  In order to maintain a consistent supply for customers' needs, an inventory of ammonium hydroxide is maintained within the warehouse.  Since this storage is separate from the manufacture of ammonium hydroxide, it is considered a separate process for the pupose of the RMP rule.  The warehouse operations are limited to the temporary storage of fully closed containers and truck unloading/loading operations.\n\nSUMMARY OF MAJOR HAZARDS\n\nAnhydrous ammonia is a colorless gas with a strong, pungent odor, used largely in refrigeration systems and as a fertilizer, and also in aqueous solutions.  At KC-PMF the gas is stored under pressure as a liquid in an outside tank. During the (batch) process it is converted to a gas and dissolved in water to form ammonium hydroxide 29%.  Ammonia gas is an acute health hazard and can effect persons when inhaled and on contact.  The OSHA PEL (8-hour TWA) is 50 ppm, and the NIOSH IDLH is 300 ppm.  It is considered a corrosive and causes burns to eyes/skin/respiratory tract  Exposures to high levels can cause blindness and may be fatal.  Lesser exposures may cause irritation to eyes/skin/respiratory tract and lungs, coughing and shortness of breath.\n\nAmmonium hydroxide is a colorless liquid that is commonly found as house ammonia (as ammonium hydroxide 3%).  At 29% concentration it too has a strong irritating odor and is used by KC-PMF's customers as a etchant or cleaner during the manufacture of silicon chips.  Although ammonia has a strong affinity for water, ammonia is released from ammonium hydroxide 29% and can affect persons in the same way as ammonia from anydrous ammonia, albeit the airborne concentrations will invariably be much lower.           \n\nCONSEQUENCES OF FAILURE TO CONTROL HAZARDS\n\nA worst case scenario, as specified by the EPA, would be"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42623,
      "SummaryText": " a total failure of the anhydous ammonia storage tank, assuming a total loss of all contents within 10-minutes.  Additional presumptions include the poorest weather conditions relative to a release, and no allowance for engineered active safety systems.  The modeled worst case release for a release of ammonia would travel offsite and impact the neighboring community.\n\nAlternative scenarios were developed for each of the two processes covered buy the rule.  These scenarios are more realistic than the worst case prescibed, and allow for active safety systems.  A more likely (although still not probable) release of anhydrous ammonia would be from a transfer hose failure during delivery.  This release would be similar to a hose failure, or disconnection of the hose from the piping system.  This release could impact the immediate industrial neighborhood to some degree, albeit with no residential impact.\n\nSimilarly, a spill of the largest ammonium hydroxide 29% container (1000-liter tote) inside the storage warehouse, as modeled taking into consideration containment within the warehouse, does not result in off-ste releases of ammonia vapors.\n\nEXPLANATION OF HOW RELEASES ARE PREVENTED\n\nTo prevent an accident related to the storage of any chemical KC-PMF has instituted a comprehensive environmental, safety and heath program, that includes management commitment, written programs, employee training, auditing, and accountability.  All personnel that transport or handle containers of chemicals are trained in chemical safety and handling, including OSHA's 29 CFR 1910.120 and DOT's 49 CFR 172.704.  Also the competencies of  forklift operators who transport chemicals are evaluated annually.\n\nThe anhydrous ammonia system was installed in 1999 is state-of-the-art and incorporates several layers of engineered protection.  For example:\n\n-Fully scrubbed primary exhaust (no direct release to atmosphere without treatment) \n-Excess flow control (automatic shut-off of chemical in event of "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 42623,
      "SummaryText": "a leak)\n-Automatic pressure relief and venting of released ammonia to a secondary scrubber containing a water deluge system\n-Computer controlled and monitored process with a back-up UPS\n-Interior and exterior ammonia detection and alarm systems (shuts system down in the event of a leak; sounds a Shelter-in-Place alarm, and alerts Portland Fire Department)\n-Computer operated and manually attended when in operation (process is batch, not continuous)\n-Containment, both interior and exterior to the building\n-Anhydrous ammonia tank is valved off when ammonium hydroxide is not being manufactured  \n\nThe operations of the facility ensure the safe day-to-day operations of the processes.  Operators are trained on written Stadard Operating Procedures, and any change to the process or system requires a thorough \"Management of Change\" review and sign-off by affected managers.  Mechanical integrity and preventative maintenance programs compliant with OSHA's PSM rule ensure equipment is maintained and continues to operate as designed, and a contractor safety program ensures only qualified contractors are hired.\n\nACCIDENT HISTORY\n\nKC-PMF has an excellent safety record, and to date there have been no incidents in the nine (9) year history of the facility that have resulted in a chemical release of ammonia (or any other chemical) with off-site impacts or requiring help from hazardous materials response contractors.\n\nSTEPS TAKEN TO ADDRESS HAZARDS\n\nExhausted anhydrous ammonia, including that resulting from activation of a presuure relief valve, are routed to scrubbers that utilize ammonia's affinity for water to reduce the airborne ammonia concentration to below 25 ppm.  If a leak occurs in process piping, excess flow instrumentation will sense the decrease in preassure and increase flow of chemical, and automatically and safely shut down the system.  Ammonia detection is located outside on the ammonia pad, inside on the ammonia skid, and within process exhausts to detect any releases"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 42623,
      "SummaryText": " of ammonia and alert the operator in charge.  Ammonia detected above a specific level sounds a facility-wide Shelter in Place alarm, alerts Portland Fire Department, and shuts down the system.  Operating procedures ensure three trained KC-PMF employees work with the driver of the anhydrous ammonia truck during truck to tank transfers (two employees in appropropriate PPE are outside on the pad; one employee monitoring the transfer is inside the anhydrous ammonia control room).  They are in radio contact with each other.  As an added precaution, the area around the delivery truck and bulk tank is secured and off limits to everyone except the employees directly involved in the transfer.\n\nThe storage warehouse was built in 1998 to receive incoming non-bulk (bottles, pails, drums) precursor chemicals, and to temporarily store and ship customers' products, either in non-bulk containers or in IBCs (totes).  The building's design is such that incompatible chemicals are separated by distance and fire walls into distinct areas each having separate and independent systems of spill containment comprising perimeter trench drains and in-ground collection pits.  Should a spill occur, even the complete loss of a tote of ammonium hydroxide 29%, it would be fully contained.  The building is fully protected by an automatic foam fire suppression system that includes in-rack sprinkler heads.  The ventilation system has enough capacity to adequently maintain acceptable indoor air quality by preventing the accumulation of hazardous levels of vapors during storage of chemicals.\n\nOnly KC-PMF certified forklift drivers are permitted to transport chemical product.  Only experienced drivers are hired into the warehouse.  They then receive additional training via KC-PMF's forklift safety training program (along with other training).  They are evaluated annualy (OSHA requires at least every 3-years) by KC-PMF's certified evaluators.\n\nRESPONSE ACTION IN EVENT OF A RELEASE\n\nAll KC-PMF employees i"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 42623,
      "SummaryText": "nvolved with chemical handling receive training to both OSHA's Hazard Communication and HAZWOPER Standards.  The extent of the training is appropriate to employees' functions.  For example: all of Production, Production Technical, and Maintenace are trained to HAZMAT Technician level (and receive the mandatory 8-hour refresher training); all of Warehouse and others involved in the transpotation of chemicals are trained to DOT's Hazardous Material Regulations (and receive the mandatry refresher training every 3-years) and also to OSHA's HAZWOPER Standard - First Responder level.  Because of the comprehensiveness of this training, both small and large spills and releases may be immeditely dealt with.\n\nAlaso ammonia system operators are specially trained to take limited energency actions to prevent a release from escalating (such as close a valve or shut down the process), prior to sheltering in place.  But with the engineered automatic operation and shutdowns, and ability for limited operator actions, a sustained and on-going ammonia release is highly unlikely.\n\nFor large, uncontrolled spills or releases the facility relies upon response and assistance from the Portland Fire Bureau HAZMAT team and HAZMAT response contractors (already pre-selected).  While these services have to date never been necessary, the partnership and preplans with the fire bureau and contractors are in place should the services be required.  Drills continue to be routinely conducted, some of which involve the participation of the fire bureau and the emergency response contractors.  Emergency plans at the facility have been developed with the input from the outside responders to ensure a smooth, coordinated response, mitigation, and recovery from an emergency should one occur."
    }
  ]
}