{
  "FacilityID": 42655,
  "FacilityName": "Grimmway / Premier",
  "FacilityStr1": "6101 Zerker Road",
  "FacilityStr2": null,
  "FacilityCity": "Shafter",
  "FacilityState": "CA",
  "FacilityZipCode": "93263",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.292350",
  "FacilityLongDecDegs": "-119.094850",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 945800688,
  "ParentCompanyName": "Grimmway Enterprises, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 33560509,
  "Company2DUNS": null,
  "OperatorName": "Grimmway Enterprises, Inc.",
  "OperatorStr1": "P.O. Box 81498",
  "OperatorStr2": null,
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93380",
  "OperatorZipCodeExt": "1498",
  "FTE": 550,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000191543",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-11-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2005-04-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-04-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2005-04-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-04-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.5",
  "FRS_Lat": 35.49515,
  "FRS_Long": -119.166766,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61362,
      "AltID": "Chlorine gas",
      "FacilityID": 42655,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 81017,
          "ProcessID": 61362,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 62794,
          "ProcessID": 61362,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 35655,
              "Process_NAICS_ID": 62794,
              "SafetyReviewDate": "2005-04-01 00:00:00",
              "PHA_Date": "2005-03-18 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2006-04-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Personnel monitors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2005-04-11 00:00:00",
              "TrainingReviewDate": "2005-04-11 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2005-04-11 00:00:00",
              "EquipmentInspectionDate": "2005-02-09 00:00:00",
              "EquipmentTested": "Regulator, piping, cylinders, etc.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2004-12-03 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-09-16 00:00:00",
              "HotWorkPermitReviewDate": "2004-11-04 00:00:00",
              "ContractorSafetyReviewDate": "2004-11-04 00:00:00",
              "ContractorSafetyEvalDate": "2004-11-04 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 51802,
                  "PreventionProgram3ID": 35655,
                  "ProcessChemicalID": 81017
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 42655,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-10-25 00:00:00",
    "ERTrainingDate": "2004-10-26 00:00:00",
    "CoordinatingAgencyName": "Kern County Fire Department",
    "CoordinatingAgencyPhone": "6617463933",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42655,
      "SummaryText": "Executive Summary\n\nGrimmway Enterprises, Inc. ¿ Premier Facility, Shafter, Ca 93263\n\nExecutive Summary for Water Treatment System\n\n1.  Accidental Release Prevention and Emergency Response Policies:\n\nWe at the Premier Plant are strongly committed to employee, public, and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program and our process safety management program that addresses such critical safety issues as design, installation, operation procedures, maintenance, and employee training associated with the hazardous processes at our facility.  It is our goal to implement appropriate control measures to prevent accidental releases of regulated substances.  \n\n2.   The Stationary Source and Regulated Substances Handled:\n\nOur facility¿s primary activities encompass Carrot processing and storage.  We have 1 regulated substance present at our facility.  Substance one is Chlorine (Gas), which is used for water treatment in our plant.\n\nThe maximum inventory of Chlorine (Gas) at our facility is 24,000 lbs.\n\n3.  The Worst Case Release Scenarios and the Alternative Release Scenarios, including administrative controls and mitigation measures to limit the distance for each reported scenario:  \n\nTo evaluate worst-case scenarios, we have used the EPA¿s OCA Guidance Reference Tables or Equation, the EPA¿s RMP Guidance for Ammonia Refrigeration Reference Tables or Equation, and the RMP-COMP calculation program.\n\n4.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps: \n\nOur facility has taken all necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility has been upgraded and improved in accordance with NFPA-58 Standard, 1967 Edition.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information:\nThe Premier Plant"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42655,
      "SummaryText": "maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes. \n\nProcess Hazard Analysis:\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently. The methodology used to carry out these analyses is Hazop.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at regular intervals. At present, new PHA¿s are being conducted at all Grimmway facilities with an anticipated completion date of 12/31/02.   \n\nOperating Procedures:\nFor the purposes of safely conduction activities within our covered processes, the Grimmway/Premier Plant maintains written operating procedures.  These procedures address various modes of operation such as initial startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the process.  \n\nTraining: \nThe Premier Plant has a comprehensive training program in place to ensure that employees who are operating process equipment are competent in the operating procedures associated with these processes.  Refresher training is provided at least every year and more frequently if necessary. \n\nMechanical Integrity:\nThe Premier Plant contracts with an outside vendor to carry out highly documented maintenance checks of process equipment to ensure proper operations. Process equipment examined by these checks includes among other: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. The timing of their inspections follow the recommended guidelines available from the manufacturer and the Chlorine Institute. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices. Furthermore, these personnel are offered specialized training as nee"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42655,
      "SummaryText": "ded.  Any equipment deficiencies identifies by the maintenance checks are corrected in a safe and timely manner.  \n\nManagement of Change: \nWritten procedures are in place at the Premier Plant to manage changes in process chemical, technology, equipment and procedures.  The most recent review/revision of management of change procedures was performed of 5/1/02.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly make aware of and offered training to deal with the modification.\n\n\n\nPre-startup Reviews:\nPre-startup safety reviews related to new processes and to modification in established processes are conducted as a regular practice at the Premier Plant.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation. \n\nCompliance Audits:\nThe Premier Plant conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The next audit is scheduled for April 2006.\n\nIncident Investigation:\nThe Premier Plant promptly investigated any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading into the incident as well as any corrective actions to prevent the release from re-occurring.  All reports are retained for a minimum of 5 years. \n\nEmployee Participation:\nThe Premier Plant truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility¿s implementation of the RMP rule, including information from process hazard analyses in particular. \n\nContract"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 42655,
      "SummaryText": "ors:\nOn occasion our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  The Premier Plant has a strict policy of informing the contractors of known potential hazards related to the contractor¿s work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur. \n\n5.  Five Year Accident History:\n\nThe Premier Plant has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n \n6.  Emergency Response Plan:\n\nThe Premier Plant carries a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspect of emergency response including adequate first aid and medical treatment, evacuation procedures, notification of local emergency response agencies and the public, as well as past incident decontamination of affected areas.\n\nGrimmway Enterprises, Inc., the primary corporate entity, also maintains a fully stocked hazardous materials response van as well as highly trained complement of hazardous response fist responders, technicians, and incident commanders.  To ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  All response team members receive annual refresher training.  In addition, the plan is promptly updated to reflect pertinent changes taking place in our processes that would require a modified emergency plan.\n\n7.  Planned Changes to Improve Safety:\n\nSeveral developments and findings have resulted form the implementation of the various elements of our accidental release prevention program.  The installation of additional safety equipment improved process training and hazmat inspection programs, as well"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 42655,
      "SummaryText": "as improved audit and process hazard analysis programs are some of the major steps we plan to undertake to improve safety at our facility.  These changes are expected to be addressed by 4/01/2006."
    }
  ]
}