{
  "FacilityID": 4266,
  "FacilityName": "Carlsbad Municipal Water District Maerkle Facility",
  "FacilityStr1": "5203 Sunny Creek Road",
  "FacilityStr2": null,
  "FacilityCity": "Carlsbad",
  "FacilityState": "CA",
  "FacilityZipCode": "92008",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06073",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.150139",
  "FacilityLongDecDegs": "-117.265444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Carlsbad Municipal Water District",
  "Company2Name": null,
  "CompanyDUNS": 73384166,
  "Company2DUNS": 0,
  "OperatorName": "Carlsbad Municipal Water District",
  "OperatorStr1": "5950 El Camino Real",
  "OperatorStr2": null,
  "OperatorCity": "Carlsbad",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92008",
  "OperatorZipCodeExt": "8802",
  "RMPContact": "Kurt Musser",
  "RMPTitle": "Operations Superintendent",
  "FTE": 0,
  "OtherEPAFacilityID": "CAD980361273",
  "EPAFacilityID": "100000057485",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-08-25 00:00:00",
  "SafetyInspectionBy": "San Diego County HazMat",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 33.14802,
  "FRS_Long": -117.26454,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4970,
      "AltID": "Upper Maerkle",
      "FacilityID": 4266,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5079,
          "ProcessID": 4970,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5323,
          "ProcessID": 4970,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505323,
          "ProcessID": 4970,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 4971,
      "AltID": "Lower Maerkle",
      "FacilityID": 4266,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5080,
          "ProcessID": 4971,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5324,
          "ProcessID": 4971,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505324,
          "ProcessID": 4971,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4266,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nCarlsbad Municipal Water District (CMWD) has an emergency response plan in effect.  The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document, which is maintained at the facility and updated as necessary.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nThe Plan provides the response organization and notification procedures, evacuation routes, chlorine health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes.\n\nCMWD has coordinated emergency response efforts with the local fire department, Carlsbad  Fire Department.  Since the facility is normally unmanned, chlorine operators are typically the only personnel on site.  In case chlorine leak detection at the facility, the on-call (\"duty\") operator is alerted via a telemetry system.  The duty operator alerts the Water Operations Supervisor and immediately responds to the alarm.  Upon arrival, the Supervisor will determine whether or not the Fire Department is to be called to respond to the emergency based on the severity of the incident.  The duty operator assignment is made on a rotating basis between the 5 chlorine systems operators.  Each chlorine operator has the necessary hazardous materials training to be considered \"qualified\" to respond to a chlorine leak.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Carlsbad Municipal Water District Maerkle Dam facility (5203 Sunny Creek Road, Carlsbad, California) is owned and operated by CMWD (5950 El Camino Real, Carlsbad, Californi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4266,
      "SummaryText": "a).  The facility is located approximately 1 mile North of the intersection of El Camino Real and Palomar Airport Road.  The area surrounding the facility consists of the Maerkle reservoir, agricultural land, and a new residential development to the North.  Two very similar chlorine water treatment systems reside on the property: Lower Maerkle and Upper Maerkle.  The chlorine systems were constructed in 1995 accordance with all applicable federal, state, and local regulations.  Each process is located within a separate chain link fenced area with access through one gate only.\n\nThe Maerkle Facility is a 111 acre site that consists of a ten million gallon distribution reservoir, a 600 acre foot long-term storage impound, one pumping/disinfection facility (Lower Maerkle), one impound disinfection facility (Upper Maerkle), related pressure control stations, meter stations, and a caretaker's residence.  The site is normally unmanned (with the exception of the caretaker's residence).  Operators visit the site daily (7 days per week) to ensure that the chlorine systems are operational.\n\n*  Lower Maerkle Chlorine System\n\nA maximum of 3 one-ton containers plus 8 150-pound cylinders (7,200 pounds) of chlorine can be stored in the chlorine room at any one time.  The 150-pound cylinders are stored for use at another facility.\n\nChlorine gas is drawn from one of the two on-line ton containers under pressure through a strainer to a common vacuum regulator.  Automatic switch over regulator valves control which container is actively feeding chlorine to the vacuum regulator.  The other container is either empty or in standby status.\n\nDownstream of the vacuum regulator, chlorine is fed to a combination of six manually-adjustable chlorinators located in an adjacent room.  The chlorine can be distributed to four independently-controlled processes: System 20, System 25, System 30, and System 40.  Each process feeds chlorine gas into solution at an injector where it is mixed with water.  "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4266,
      "SummaryText": "System 20 is flow paced only  the chlorine feed rate is manually controlled at the rotameter.  The other three systems are compound loop systems  the chlorine feed rate is controlled by a combination of manual adjustment at the rotameter and residual chlorine concentration.\n\nThe one-ton containers  are stored in the chlorine storage room, which is protected by a scrubber with a capacity to neutralize 2,000 pounds of chlorine.  The scrubber is activated based on the alarm status of two chlorine detectors located in the storage room and one detector in the chlorinator room.  A detection of 1 part per million (ppm) activates on-site alarms and alerts operators via a telemetry system.  A detection of 3 ppm initiates operation of the chlorine scrubber. \n\nA scale that indicates the remaining weight of chlorine in each of the on-line one-ton containers allows system operators to plan ahead for placing chemical supply orders for delivery.  A monorail hoist is used to change out the chlorine cylinders.\n\nThe chlorine system is operated almost entirely under vacuum conditions.  The only portions of the system that contain chlorine under pressure are the container and the piping up to the vacuum regulator.  (CMWD plans to remove all pressurized piping by attaching a vacuum regulator to each of the one-ton container valves.)  The containers are positioned so that the valves are vertically aligned.  The flex tubing is connected to the top container valve to ensure that chlorine gas (not liquid) is drawn out of the container.  A vacuum is created when process water is pumped through the injectors.  This flow generates a vacuum which opens the vacuum regulator.  Upon loss of vacuum in the line downstream of the vacuum regulator, a diaphragm in the vacuum regulator will close, stopping any chlorine from escaping from the line under vacuum.  Any chlorine in the piping upon loss of vacuum (downstream of the vacuum leak) will be drawn to the injection point and into solution.\n\n*  Upp"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4266,
      "SummaryText": "er Maerkle Chlorine System\n\nThe design and operation of the chlorine system (upstream of the chlorinators) for the Upper Maerkle chlorine system is essentially identical to that of the lower station.  Only two chlorinators are used at the Upper facility.  Similar chlorine detection and scrubber systems are located at the Upper facility.  The maximum quantity of chlorine maintained for the Upper Maerkle process is 3 one-ton containers (6,000 pounds).\n\n\nHAZARD ASSESSMENT SUMMARY\n\n*  Worst Case Release Result Summary\n\n      Scenario Description:  Release of the maximum quantity of chlorine that can be stored in a vessel (one-ton container) - 2,000 pounds in 10 minutes.  The chlorine systems are each located inside a building, but because the delivery of chlorine containers occurs outside, no passive mitigation measures were taken into account.  The most pessimistic meteorological conditions were used: 1.5 meters per second wind speed, and F stability.  The Risk Management Program Guidance for Waste Water Treatment Plants reference tables were used to determine the maximum distance to the toxic endpoint of 3 ppm in rural conditions.  This release reaches off site and may impact population receptors and an environmental receptor.\n\n*  Alternative Release Result Summary\n\n     Scenario Description:  A release of chlorine from resulting from a 1/4 inch diameter hole in a pipe.  The release rate of chlorine due to the pressure of the tank is 9.5 pounds per minute (5.2 pounds per minute to the outside atmosphere taking into account the enclosure of the building).  The meteorological conditions used were 3 meters per second wind speed, and D stability.  The Risk Management Program Guidance for Waste Water Treatment Plants reference tables were used to determine the maximum distance to the toxic endpoint of 3 ppm.  This release reaches off site.  Due to the remote location of the facility, no population receptors are likely to be affected.  An environmental receptor that borders"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4266,
      "SummaryText": " the facility may be affected.\n\nIn order for this potential release to go off-site, it was assumed that the chlorine scrubber failed.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe CMWD chlorine system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the CMWD treatment processes operate in accordance with OSHA's Process Safety Management regulation and the California Accidental Release Prevention (CalARP) Program.\n\nChlorine gas detectors are strategically located in the chlorine buildings (in the storage rooms and the chlorinator rooms).  In case of chlorine detection, visible and audible alarms are activated at the site and the duty (on-call) operator is paged through the telemetry system.  A scrubber also protects each chlorine building that has the capability of neutralizing 2,000 pounds of chlorine with a 99%+ rate of effectiveness.\n\nIn the event of a power failure, vacuum regulators prevent chlorine from escaping the system.  A backup generator that is activated during a power outage is maintained on site to power the chlorine systems.  If vacuum conditions are compromised, the vacuum regulators close stopping chlorine flow from the one-ton containers.  Chlorine vent lines are piped to ventilation intakes of the scrubber system.\n\nIn addition, common industry standards, policies, and procedures are utilized to ensure safe practices are being performed.  This includes common practices recommended by the Chlorine Institute.\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no chlorine accidents at the facility since the startup of the chlorine systems in 1995.\n\n\nEMERGENCY RESPONSE PROGRAM\n\nCMWD has an emergency response plan in effect.  The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document, which is maintained at the facility and updated as necessary.  This Plan"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 4266,
      "SummaryText": " was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nThe Plan provides the response organization and notification procedures, evacuation routes, chlorine health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes.\n\nCMWD has coordinated emergency response efforts with the local fire department, Carlsbad  Fire Department.  Since the facility is normally unmanned, chlorine operators are typically the only personnel on site.  In case chlorine leak detection at the facility, the on-call (\"duty\") operator is alerted via a telemetry system.  The duty operator alerts the Water Operations Supervisor and immediately responds to the alarm.  Upon arrival, the Supervisor will determine whether or not the Fire Department is to be called to respond to the emergency based on the severity of the incident.  The duty operator assignment is made on a rotating basis between the 5 chlorine systems operators.  Each chlorine operator has the necessary hazardous materials training to be considered \"qualified\" to respond to a chlorine leak.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazard Analysis (PHA) and the Seismic Assessment provided mitigation measures to improve safety at Carlsbad Municipal Water District located at 5203 Sunny Creek Road in Carlsbad, California.   All recommendations are scheduled to be complete by May 1, 2000.\n\n\n*  Process Hazard Analysis\n\nR01    Ensure that suspect chlorine cylinders (including Sulfur Dioxide cylinders) are rejected upon delivery.\n\nR02    Consider removing the pressurized piping from the system by moving the vacuum regulators to the contain"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 4266,
      "SummaryText": "er valve.\n\nR03    Document delivery and tank change procedures for the Maerkle Dam sites.\n\nR04    Ensure that flammable materials are not stored in the chlorine room.\n\nR05    Ensure that all operators are aware of the hazards associated with chlorine at the facility.\n\nR06    Coordinate emergency response efforts with the local emergency responders (i.e. fire department) on a periodic and ongoing basis.\n\nR07    Consider maintaining respiratory protection certificates at the facility for each chlorine systems operator in case of HazMat emergency response.\n\nR08    Ensure that the cylinder valves are vertically aligned prior to connecting the vacuum regulator.\n\nR09    Ensure that a wind sock or other wind direction indicator is present at each of the Maerkle Dam Sites.  Replace as needed.\n\nR10    Ensure that operators check the date of the most recent hydrostatic test stamped on each one-ton container upon delivery and reject those that are overdue.\n\n*  Seismic Assessment\n\nS01       Consider securing the 150 pound cylinders using 3/8 inch lag bolts instead of the eye-hooks.  In addition, consider using a chain rated at 2000 pounds.  The chain should be kept tight around the cylinders.  As an alternative, two Kevlok nylon straps with \"come-along\" buckles are good because they can be tighten snug around the cylinders."
    }
  ]
}