{
  "FacilityID": 42682,
  "FacilityName": "Ed Love water Treatment Plant",
  "FacilityStr1": "1125 Jack Warner Pkwy.",
  "FacilityStr2": null,
  "FacilityCity": "Tuscaloosa",
  "FacilityState": "AL",
  "FacilityZipCode": "35404",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01125",
  "LEPC": "Tuscaloosa County LEPC",
  "FacilityLatDecDegs": "33.217528",
  "FacilityLongDecDegs": "-087.528694",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "P5",
  "LatLongDescription": "SE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Tuscaloosa, Alabama 35304",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Tuscaloosa",
  "OperatorStr1": "1125 Jack Warneer Pkwy.",
  "OperatorStr2": null,
  "OperatorCity": "Tuscaloosa",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35404",
  "OperatorZipCodeExt": null,
  "RMPContact": "Perry A. Acklin",
  "RMPTitle": "Manager of water Treatment",
  "FTE": 32,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000048691",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-09-16 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-04-25 00:00:00",
  "ErrorReportDate": "2005-04-25 00:00:00",
  "ReceiptDate": "2005-04-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-04-11 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2010-09-20 00:00:00",
  "DeRegistrationEffectiveDate": "2010-09-15 00:00:00",
  "AnniversaryDate": "2010-04-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 33.23172,
  "FRS_Long": -87.50052,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61408,
      "AltID": "chlorine",
      "FacilityID": 42682,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 62840,
          "ProcessID": 61408,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 81078,
          "ProcessID": 61408,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 581078,
          "ProcessID": 61408,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42682,
      "SummaryText": "The Ed Love Water Treatmenty Plant is the water treatment facility for the City of Tuscaloosa, Alabama. The City of Tuscaloosa has a population of 96,000 and serves a metropolitan area of 160,00 people.\n    Tuscaloosa is the home of the University of Alabama, Mercedes Benz ATV, JVC Magnetics, Michelin- B.F. Goodrich Tire Mnfg.and Gulf Staes Paper Coorporate Office, Stillman College and several industries that employee 200 to 600 employees. All of these companies make for a pleasurable life style in Tuscaloosa.  The Ed Love Water Treatment Plant is a 45.6 MGD facility. The treatment consist of Aluminum Sulfate (Alum) and lime for coagulation. Lime is also used for pH ccontrol, Potassium Permanganate for oxidation of iron and manganeese, flouride for the prevention of tooth decay and chlorine for dissenfectant for bacteria.  The raw water source for the city off Tuscaloosa is Lake tuscaloosa which has a capacity of 40 billion gallons of water, Lake Nicol as back-up source with foir billion gallon capacity and Lake Harris with a one billion gallon capacity. Lake Tuscaloosa water is a very clean source with an average turbidity of 6.0 NTU.                                                                                             \n      The water filtration plant is in an urban setting with the University of Alabama less than one mile away, DCh Hospital, Bryce's Mental Hospital, Taylor Hrdin State Maximum Security Hospital, Tuscaloosa Middle School, doctor's offices, resturants, apartment complexes, and a motel all within the 1.3 mile plume.\n     The treatment facility utilizes chlorine in the dissenfectant process to prevent viruses and protozoa that are present in the raw water supply. The chlorine is also used to kill bacteria and e-coli.The plant has two one ton cylinders that are attached to a common header to feed the plan at an average of 1200 lbs per day. The chlorine is in liquid form that is vaporized and fed into the post chemical mixer, prefiltration and the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42682,
      "SummaryText": " finished water.                 \n     Maintenance operators and plant operators work daily on changing chlorine cylinders and following the procedures for change out. Maintenance and operators check all lines from the cylinders that connect the valves to the manifold feed. As cylinders are being changed out, the exhaust vents are energized to remove any fumes or vapors from the chlorine room. All operators and maintenance personnel check self-contained air supply and protective clothing before entering the room and in case of a discharge. The scrubber is filled with a 12% solution of NaOH (Caustic) to neautrilize any chlorine vapors. The concentration of the caustic is checked monthly to maintain the 12% solution. All personnel are trained in chlorine safety and repair minor problemssuch as leaking gaskets, ruptured lines and small spills. An oustside chlorine manafacture presents a training seminar at the Ed Love water treatment Plant or at the manufacture's facility.The training tapes are reviewed as needed and all new personnel go through chlorine safety training.                   \n      In case of a worse case scenario and the plant were to experience a discharge, The EMA, fire station 2 and 4, and the police department are immediately notified. All personnel that are nonessential are evacuated to prevent injuries. At the discretion of EMA, Hazmat team and the police department, the prevaling wind conditions are considered and a decision is made in what areas are to be evacuated and predetermine a safe distance. The release, if gas, will be contained to the best of everyone's ability as a hazmat team works to neautralize the discharge. After the discharge is neautralized, an assessment will be made as to the extent of the damage if any, injuries andor loss of life if applicable. The Ed Love water Treatment Plant has not had a release in the last five years and has never had a major release.\n     There are 32 full time employees at the Ed Love Water Plant and t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42682,
      "SummaryText": "he plant is owned and subsudized by the City of Tuscaloosa, Alabama. The city of Tuscaloosa consist of a City council/ Mayor government with a mayor and seven council members.\n     The city government approves budgets for the water treatment facilityand all cost that are incurred by the water plant as far as meeting compliance. It is important that the city stay abreast of all compliance regulations and any laws that are enacted that impact the city for water quality and changes in said quality. \n     The city is in the process of selecting a new process and plant site for a new water treatment plant to meet future growth of the city. The new plant will subsidize the Ed Love water Plant that will remain the driving facility for the city. All revelant laws and regulations will be implemented to keep the city of Tuscaloosa's water quality in excellent condition and to keep the public informed as to changes.\n     The expected date for a new water treatment plant to come on line will be in late 2007 or early 2008. The City of Tuscaloosa is looking at membrane technology at the present and has successfully completed the pilot study for said plant. The use of sodium hypochlorite is being considered for dissenfectant to replace liquid chlorine and to eliminate a possible discharge. Consideration is being made to convert the Ed Love Water Plant to sodium hypochlorite to eliminate the risk management and an accdidental discharge. The citizens are first priority as for safety issues and any changes that would lessen the chance of death or injury is foremost in operating the water plants. The City off Tuscaloosa will continue to work with EPA in order to comply with all safety and environmental issues."
    }
  ]
}