{
  "FacilityID": 42687,
  "FacilityName": "A-Carb, LLC",
  "FacilityStr1": "One Carbon Way",
  "FacilityStr2": null,
  "FacilityCity": "Walton",
  "FacilityState": "KY",
  "FacilityZipCode": "41094",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21015",
  "LEPC": "Northern Kentucky LEPC",
  "FacilityLatDecDegs": "38.922778",
  "FacilityLongDecDegs": "-084.610556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 80818359,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "A-Carb, LLC",
  "OperatorStr1": "One Carbon Way",
  "OperatorStr2": null,
  "OperatorCity": "Walton",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "41094",
  "OperatorZipCodeExt": null,
  "RMPContact": "Karen Bomba",
  "RMPTitle": "CEO",
  "FTE": 100,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000169051",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "20060003",
  "SafetyInspectionDate": "2005-03-09 00:00:00",
  "SafetyInspectionBy": "Propane Supplier",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-04-10 00:00:00",
  "ErrorReportDate": "2007-04-10 00:00:00",
  "ReceiptDate": "2005-04-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-04-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-04-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 38.86278,
  "FRS_Long": -84.64083,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61413,
      "AltID": "Propane System",
      "FacilityID": 42687,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 62845,
          "ProcessID": 61413,
          "NAICSCode": "336413",
          "_desc": {
            "NAICS_CODE": "336413",
            "NAICS_DESCRIPTION": "Other Aircraft Parts and Auxiliary Equipment Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 81084,
          "ProcessID": 61413,
          "ChemicalID": 98,
          "Quantity": 101640.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 581084,
          "ProcessID": 61413,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42687,
      "SummaryText": "EXECUTIVE SUMMARY\n1. Accidental release prevention and emergency response policies:\nA-Carb, LLC (A-Carb) is located at One Carbon Way, Walton, Kentucky 41094.  The propane system at A-Carb includes a 30,000 gallon liquid propane tank, two vaporizers, piping that conveys mixture of propane gas with natural gas (5% propane to 95% natural gas), and injection of the propane/natural gas mixture into chemical vapor infiltration (CVI) furnaces.  Propane is a listed flammable substance under the Risk Management Plan regulations found at 40 CFR 68 and is subject to those regulations since it is stored in quantities in excess of 10,000 pounds.  It is necessary to observe certain safety precautions in handling propane to prevent unnecessary human exposure, to reduce the threat to the personal health of A-Carb employees as well as to reduce the threat to nearby members of the community.  It is A-Carb?s policy to adhere to all applicable federal and state rules and regulations.  Safety depends upon the manner in which propane is handled combined with the safety devices inherent in the design of this facility, the safe handling procedures used, and the training of our personnel.\n\nThe emergency response program at this facility is based upon the NPGA's LP-Gas Safety Handbook, \"Guidelines for Developing Plant Emergency Procedures\" and \"How to Control LP-Gas Leaks and Fires\".  The emergency response plan includes procedures for notification of Boone County Kentucky Emergency Management and notification of any potentially affected neighbors.\n\n2. Description of the stationary source and regulated substances handled.\nA-Carb manufactures aircraft brake components using CVI for depositing graphite on prepared carbon fiber substrate.  Propane gas is a reactant in the process.  Brake blanks are carbonized in furnaces equipped with a thermal oxidizer and a mixture of propane and natural gas is circulated to deposit carbon on the substance.  The remaining gas and off-gases are routed to a bo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42687,
      "SummaryText": "iler and used as supplemental fuel.\n\nThe propane system at A-Carb includes the following equipment:\n\n?    Truck Transport Unloading Station\n?    One 30,000 gallon Propane Storage Tank\n?    Two LGL 1.25 Propane Pumps\n?    Two TF-300 Propane Vaporizers\n?    One Control Panel at the Propane Storage Area\n?    Piping, Control Valves, Safety Valves, and Instruments\n?    Propane Gas Detectors\n?    Gas Chromatograph\n\n\nThe only regulated substance under section 112(r) handled at this facility is propane. \n\nThe maximum amount of propane that can be stored at this plant is 101,640 pounds. \n\n3. Worst-case release scenario and alternative release scenarios\nWorst-Case Scenario. ? The worse case release scenario required for flammable substances shall assume ?that the quantity of the substance?vaporizes resulting in a vapor cloud explosion.  A yield factor of ten percent of the available energy released in the explosion shall be used to determine the distance to the explosion endpoint if the model used is based on TNT-equivalent methods? (40 CFR 68.25(f)).  The endpoint for propane used in A-Carb?s worst-case scenario will be a 1 pound per square inch (psi) overpressure.  An overpressure of 1 psi may cause partial demolition of houses, which can result in serious injuries to people, and shattering of glass windows, which may cause skin laceration from flying glass.\n\nThe worst-case scenario of vapor cloud explosion is based on the assumption that only one tank is affected.  The largest capacity of a single tank will be used for the scenario, 30,000 gallons.  Failure of the storage tank would release 101,640 pounds of propane.  It is assumed that the entire contents are released as vapor which finds an ignition source, and 10% of the released quantity is assumed to participate in the resulting explosion. \n\nThe distance to the endpoint of 1 psi for the worst-case scenario is 0.4 miles. \n\nThis distance is used to determine the related offsite impacts on businesses and the public.  No residences were identifi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42687,
      "SummaryText": "ed in the radius.  The following facilities are within the 0.4 mile radius:\n\n?    Willamette Industries Warehouse (West)\n?    Durobag Mfg. Co. (Southwest)\n?    Kustom Group (West)\n\nThe remaining area within the radius is primarily farmland.\n\nAlternative Scenario. ?  A-Carb considered two alternative release scenarios for the propane storage area.  Each of these scenarios will assume a vapor cloud explosion and an overspray of 1 psi.\n\nAlternative Scenario #1:\n\nThe first alternative release scenario is a valve failure release resulting in a ? inch stream of propane escaping from one of the pipes located in the propane storage area.  Due to process alarms and regular observation of the propane storage area by A-Carb personnel, the release is assumed to last no longer than 60 minutes.  The resulting unconfined vapor travels to the lower flammability limit.  The release leads to a vapor cloud explosion (endpoint 1 psi).  The distance to the endpoint for the lower flammability limit for the alternative scenario is 0.2 miles.\n\nThis distance is used to determine the related offsite impacts on business and the public.  No residences were identified in the radius.  The following facility is within the 0.2 mile radius:\n\n?    Durobag Mfg. Co. (Southwest)\n?    Kustom Group (West)\n\nAlternative Scenario #2:\n\nIf a driver fails to remove the hoses between the storage tank and the transfer vehicle before moving the vehicle, a pull-away may occur.  This pull-away will most likely cause the hose to rupture.  It will be assumed in this case that the transfer vehicle will be using an unloading house 4 inches in diameter and 25 feet long.  In addition, it will be assumed that the active mitigation devices will operate as designed, which will limit the release to the propane held in the hose.  The resulting unconfined vapor travels to the lower flammability limit.  The release leads to a vapor cloud explosion (endpoint 1 psi).  The distance to the endpoint for the lower flammability limit for the alterna"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 42687,
      "SummaryText": "tive scenario is 0.03 miles.\n\nThis distance is used to determine the related offsite impacts on business and the public.  There are no residences or off-site facilities identified within this radius.  \n\n4. General accidental release prevention program and the specific prevention steps. \n\nA-Carb is subject to Process Safety Management (PSM) requirements under 29 CFR 1910.119.  A-Carb has established a program for process safety management of the propane system, including pre-start-up safety reviews, process hazard analyses, contractor safety, operating procedures, incident reporting, training, mechanical integrity and management of change.  Equipment was installed by a certified contractor and was designed/built to National LP Gas Code NFPA 58, ASME and NEC 70 standards.  Liquid propane lines, gas propane lines, the propane storage tank and the vaporizer unit are equipped with safety relief devices.  Process safety information is maintained at the site.  \n\nThe en                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 42687,
      "SummaryText": "                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         "
    }
  ]
}