{
  "FacilityID": 42782,
  "FacilityName": "Dr. Robert E. Young Water Services Center",
  "FacilityStr1": "100 Pine Drive",
  "FacilityStr2": null,
  "FacilityCity": "Harrisburg",
  "FacilityState": "PA",
  "FacilityZipCode": "17103",
  "Facility4DigitZipExt": "1260",
  "FacilityCountyFIPS": "42043",
  "LEPC": "Dauphin County LEPC",
  "FacilityLatDecDegs": "40.281389",
  "FacilityLongDecDegs": "-076.870278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "THABOARD@aol.com",
  "FacilityDUNS": 55298397,
  "ParentCompanyName": "City of Harrisburg",
  "Company2Name": "The Harrisburg Authority",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Harrisburg",
  "OperatorStr1": "100 Pine Drive",
  "OperatorStr2": null,
  "OperatorCity": "Harrisburg",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "17103",
  "OperatorZipCodeExt": "1260",
  "RMPContact": "Daniel E. Standish",
  "RMPTitle": "Director",
  "FTE": 35,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000025607",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-03-11 00:00:00",
  "SafetyInspectionBy": "Pennsylvania DEP",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-05-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-05-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-05-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-05-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 40.42833,
  "FRS_Long": -76.74667,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61536,
      "AltID": "Chlorine storage",
      "FacilityID": 42782,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 62975,
          "ProcessID": 61536,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 81226,
          "ProcessID": 61536,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 581226,
          "ProcessID": 61536,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42782,
      "SummaryText": "Executive Summary\n\nThe primary function of the Dr. Robert E. Young Water Services Center (RYWSC) is to provide potable drinking water to the City of Harrisburg and three surrounding municipalities. The facility is located at 100 Pine Drive, Harrisburg, Pennsylvania and is owned by the Harrisburg Authority and operated by the City of Harrisburg, Department of Public Works, Bureau of Water.\n\nThe RYWSC is a stationary source with one process assigned to Program Level 2. The regulated substance of the process is chlorine. The chlorine disinfection process involves one building which contains the chlorine cylinders, the chlorine scale, the water injectors, and the chlorinators. An adjacent docking area is where the extra cylinders are stored, when empty. The amount of chlorine that is handled at any one time is four one-ton cylinders. The facility is manned 24 hours a day, seven days a week. The operators check the chlorine room at least four times a day and respond to alarms that occur.\n\nIt is the policy of the RYWSC to promote the awareness and detection of a spill/leak or the potential of a spill/leak of any regulated substance in order to initiate a timely response to mitigate or eliminate a health or safety hazard and/or an environmental incident. Management?s commitment to process safety is a critical element of the RYWSC?s Risk Management Plan to ensure that program elements are integrated and implemented on an ongoing basis; and all parties understand the lines of responsibility and communications.\n\nThe offsite consequence analysis includes consideration for worst case and alternative case release scenarios of chlorine. Atmospheric dispersion modeling was performed utilizing the RMP*Comp program.\n\nThe worst case scenario for chlorine assumes that the entire contents of a one-ton cylinder are completely released over a ten-minute period. The toxic endpoint distance is calculated for releases that are assumed to take place outdoors. No passive mitigation systems ar"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42782,
      "SummaryText": "e included in the assumptions. A toxic endpoint distance of 1.3 miles was obtained and an average population potentially affected was 24,800. This figure was developed from population numbers calculated by the Dauphin County Local Emergency Planning Committee.\n\nThe alternative release scenario for chlorine involves the breaking of the ? - inch discharge line. The cylinder and line are located in an enclosed space with a temperature of  70? F. The pressure within a full cylinder is 85 PSI. The response action to correct this is to close the discharge valve on the cylinder and replace the line. The time required to \n\nclose the valve is ten minutes. A toxic endpoint of 0.1 miles was obtained and an average residential population potentially affected was zero.\n\nThe purpose of the RYWSC prevention program is to ensure that management staff and employees understand the safety related aspects of the equipment and processes, know what limits they place on operations, and adopt accepted standards and codes where they apply. Key elements of the program include: training, preventive maintenance, state-of-the-art process and safety equipment, operating procedures, hazard review, auditing, and inspection.\n\nThe RYWSC has not had any accidental release of the regulated substance, chlorine, from its covered process or any accidental release meeting specific criteria in the past five years.\n\nThe RYWSC is a non-responding facility, therefore efforts are coordinated with Local, County, State, and Federal emergency response agencies in order to stop the release of any hazardous chemical and to cleanup any released chemicals to safeguard the workers and surrounding community."
    }
  ]
}