{
  "FacilityID": 42948,
  "FacilityName": "Denver Distribution Center",
  "FacilityStr1": "4600 Stapleton Drive South",
  "FacilityStr2": null,
  "FacilityCity": "Denver",
  "FacilityState": "CO",
  "FacilityZipCode": "80216",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08031",
  "LEPC": "Denver LEPC",
  "FacilityLatDecDegs": "39.779972",
  "FacilityLongDecDegs": "-104.936389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.safeway.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Safeway, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 9137209,
  "Company2DUNS": null,
  "OperatorName": "Safeway,Inc (Environmental Affairs)",
  "OperatorStr1": "4410 Rosewood Drive",
  "OperatorStr2": null,
  "OperatorCity": "Pleasanton",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94588",
  "OperatorZipCodeExt": "3492",
  "FTE": 650,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000182456",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-05-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2005-05-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-05-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2005-05-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-05-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.5",
  "FRS_Lat": 39.77981,
  "FRS_Long": -104.93507,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R08",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61773,
      "AltID": "New Central System",
      "FacilityID": 42948,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 81559,
          "ProcessID": 61773,
          "ChemicalID": 56,
          "Quantity": 31000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 63216,
          "ProcessID": 61773,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 35939,
              "Process_NAICS_ID": 63216,
              "SafetyReviewDate": "2003-04-16 00:00:00",
              "PHA_Date": "2004-12-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-04-18 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "water diffusion system",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Implementation of procedures and policies to promote a safe and efficient work environment",
              "OpProceduresReviewDate": "2004-05-04 00:00:00",
              "TrainingReviewDate": "2004-05-04 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-05-04 00:00:00",
              "EquipmentInspectionDate": "2004-05-04 00:00:00",
              "EquipmentTested": "Pre-start up Safety Review",
              "ChangeMgmtDate": "2004-05-04 00:00:00",
              "ChangeMgmtReviewDate": "2004-05-04 00:00:00",
              "PreStartupReviewDate": "2003-04-18 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-05-04 00:00:00",
              "HotWorkPermitReviewDate": "2004-05-04 00:00:00",
              "ContractorSafetyReviewDate": "2004-05-04 00:00:00",
              "ContractorSafetyEvalDate": "2004-05-04 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 52207,
                  "PreventionProgram3ID": 35939,
                  "ProcessChemicalID": 81559
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 42948,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Denver County Fire Department",
    "CoordinatingAgencyPhone": "3032867600",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 42948,
      "SummaryText": "the 89 psig Controlled Pressure Receiver (CPR-1).  In addition, liquid ammonia is routed to the compressors for thermosyphon oil cooling.  CPR-1 sends liquid ammonia to the 58 psig Controlled Pressure Receiver (CPR-2) as well as to evaporators in the following rooms:\n\n· +30°F Freezer Dock (EVAP-1)\n· +34°F Perishables Warehouse (EVAP-13®EVAP-18)\n· +34°F Perishables Dock East (EVAP-19®EVAP-24)\n· +35°F Floral Room (EVAP-25)\n· +42°F Egg Room (EVAP-26)\n· +35°F Wet Cooler - Low (EVAP-27 & EVAP-28)\n· +35°F Wet Cooler - High (EVAP-29)\n· +35°F Dry Cooler - Low (EVAP-30 & EVAP-31)\n· +35°F Dry Cooler - High (EVAP-32)\n· +35°F Produce Dock (EVAP-33 & EVAP-34)\n· +55°F Dry Produce Cooler - Low (EVAP-35 & EVAP-36)\n· +55°F Dry Produce Cooler - High (EVAP-37 & EVAP-38)\n· +55°F Dry Produce Dock (EVAP-39 & EVAP-40)\n· +30°F Truck Receiving and Shipping Dock ( Existing King Air Units )\n· +28°F Meat Cooler Evaporators\n\nCPR-2 feeds liquid to evaporators in the -20°F Freezer (EVAP-2®EVAP-12).  At the Evaporators, the liquid ammonia is partially vaporized as it absorbs heat from the product and room.  The resultant vapor/liquid mix is drawn back to the respective suction accumulator as follows: the +30°F Suction Accumulator (ACC-3) draws suction from EVAP-35®EVAP-40; the +18°F Suction Accumulator (ACC-2) draws suction from EVAP-1, EVAP-13®EVAP-34, & EVAP-41®EVAP-45 and also receives defrost return from EVAP-2®EVAP-12; the -30°F Suction Accumulator (ACC-3) draws suction from EVAP-2®EVAP-12.\n\nAt the suction accumulators, the wet suction from the evaporators is separated.  The liquid falls to the bottom and the vapor is drawn from the top by the compressors. Booster Compressors (COMP-1 & COMP-2) draw low stage suction from ACC-1, High Stage Compressors (COMP-3 & COMP-4) draw medium stage suction from ACC-2, and High Stage Compressors (COMP-5 & COMP-6) draw high stage suction from ACC-3.   Each suction accumulator is equipped with two dump traps to return excess liquid to the respective controll"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42948,
      "SummaryText": "ed pressure receiver.  ACC-1 returns excess liquid to CPR-2, while ACC-2 and ACC-3 return excess liquid to CPR-1.\n\nThe Swing Compressor may operate in any of the above compressor settings, with the added option of drawing economizer suction from ACC-1 when drawing suction from ACC-2 or ACC-3.  The Booster Compressors discharge vapor to the +30°F Suction Accumulator, while the High Stage and Swing Compressors discharge vapor to the Condensers.  High stage discharge from the compressors is also used in i) the hot gas defrost cycle of the evaporators, ii) pressurizing the Transfer Traps during the liquid transfer process, and iii) maintaining pressure in the Controlled Pressure Receivers.\n\nThe high stage discharge from the compressors is condensed back into high pressure liquid at the Condensers.  Latent heat is rejected by spraying water and blowing air over coils filled with ammonia.  The resultant high pressure ammonia liquid is returned to the Thermosyphon Receiver to begin the cycle again.\n\nThe system is also equipped with an Automatic Purger.  The Auto Purger removes non-condensables (i.e., air and water) from the system.  There are four purge points located at the Condenser, and one at the Thermosyphon Receiver.\n \nThe relief valves are set at 250 psig on all vessels, the compressors, the purger, and the condensers.  The relief valves vent to an Ammonia Dump Tank located outside the equipment room.\n\n\n\nC. ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe Denver Distribution Center has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the facility operates in accordance with the OSHA's Process Safety Management (PSM), and Federal EPA's Risk Management Program (RMP), Program 3 requirements.\n\nThe ammonia refrigeration system at the Denver Distribution Center was designed and constructed in accordance with the Uniform Mechanical Code,"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 42948,
      "SummaryText": "which specifically outlines requirements for the safe operation of the ammonia refrigeration system.  These safety features include ammonia sensors throughout the plant, pressure relief valves to protects vessels' integrity, and automatic shut down systems that prevent equipment damage and ammonia releases.  In the event of ammonia detection, audible and visual alarms are triggered throughout the facility. \n\nAmmonia refrigeration systems do not experience any chemical reactions or internal corrosion.  The only composition changes that occur within the systems are phase changes, as ammonia is cycled through various stages of liquid and vapor, similar to a household refrigerator.  The refrigeration system is a closed-loop system without any regular emissions or releases.  Any leaks are noted and repaired immediately.\n\nD. FIVE YEAR ACCIDENT HISTORY\n\nOver the past five years, the Denver Distribution Center has not had any ammonia releases that resulted in deaths, injuries, property damage, environmental damage, or offsite evacuations.\n\nE. EMERGENCY RESPONSE PROGRAM\n\nThe Denver Distribution Center facility has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document, which is maintained at the facility.  Emergency response activities are coordinated with the Denver Fire Department and the local fire houses.  If necessary, the facility will call 9-1-1 to alert the local Police and Fire Departments.\n\nOther responders will be called as needed, including the Denver Fire Department.  If a release exceeds the federal reporting quantity of 100 pounds for ammonia, the National Response Center will be called.\n\n The Denver Distribution Center will be responsible for evacuating and ensuring the safety of its employees in case of an emergency evacuation.  Evacuation drills are performed at least annually.  Other training received by employees includes: ammonia awareness, what to do in ca"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 42948,
      "SummaryText": "se of emergency, and where to go when an evacuation is called. \n\nThe following summarizes the notification procedures at the facility:\n\n1. First call 911 on an internal/land line phone for the Denver Fire Department and Police Departments.  The Denver Fire Department can be reached directly at 303-286-4927.\n\n2. If an ammonia release exceeds 100 pounds in a 24 hour period, call the LEPC Denver Office of Emergency Management Coordinator, Kim Steigelmeier at 720-865-7600.  The after hours phone number is 303-640-9999.\n\n3. If an ammonia release exceeds 100 pounds (Federal Reportable Quantity CERCLA), call the National Response Center 1-800-424-8802 and the Denver Office of Emergency Management at 720-865-7600 for a release of any amount.\n\n4. In the event of a release to a waterway or directly into the storm drain, also call the Colorado Department of Health and Environment at 877-518-5608.\n\n5. EPA Region 8 24 hour Emergency Response can be contacted at 1-800-227-8914.\n\n6. If additional help is required for an ammonia spill or leak, the facilities can call Chemtrec - Manufacturing Chemists Association 1-800-424-9300.\n\n7. If serious injuries or harmful exposures to workers occurs, call the Safeway Denver Division Loss Control Manager, John Yanuska at 303-843-7880.\n\n\n8. If an employee ingests ammonia, the Poison Control Center can be reached 24 hours per day at 800-342-9293.\n\n9. Safeway Contacts - The following individuals should be contacted if a release occurs: Rick Mueller, Corporate Environmental Compliance Manager at 925-226-5789 and Kelly Zielbauer, Denver Environmental Affairs Food Safety Manager at 303-843-7545. \n\nG.PLANNED CHANGES TO IMPROVE SAFETY\n\n The initial Process Hazard Analysis (PHA), which was completed on April 17th and 18th, 2003,  included a Hazard and Operability (HAZOP) study as well as a Facility What If Walkthrough.  The PHA provided mitigation measures to improve safety at the Denver Distribution Center located at 4600 Stapleton Drive South in D"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 42948,
      "SummaryText": "enver, Colorado. \n\n20 recommendations were made as a result of the April 2003 PHA. \nThey were completed by December 2004."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 42948,
      "SummaryText": "A.                                                                                                                                                               ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe management and staff of the Denver Distribution Center are committed to operating their facility with the highest regard for the safety of the public, Denver Distribution Center personnel, and the environment.  To ensure the safety of the public, Denver Distribution Center personnel, and the environment, the plant has implemented a management system that integrates the elements of OSHA's Process Safety Management (PSM) standard, 29 CFR 1910.119 and EPA's Risk Management Program (RMP) rule, 40 CFR part 68.  The policies and procedures integrated under the Denver Distribution Center's management system specifically address prevention of the release of anhydrous ammonia, and emergency response to an accidental release of ammonia.\n\nB. STATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Denver Distribution Center operates several refrigerated warehouses and a freezer.  Anhydrous ammonia is used as a refrigerant in the mechanical compression refrigeration system at the facility.  Ammonia is handled in a closed-loop process that consists of the following general stages: liquid storage; expansion; evaporation; compression; and condensation.\n\nRefrigeration process equipment at the facility operates continuously.  Compressors and condensers cycle on and off to comply with system demand during operation.  The ammonia refrigeration system provides cooling for dock operations, coolers and freezers.  \n\nThe ammonia refrigeration system is the only process at the Denver Distribution Center which is subject to the EPA RMP rule (and the OSHA PSM standard).  Anhydrous ammonia is the only regulated substance handled in the ammonia refrigeration system.\n\nThe refrigeration cycle begins with the transfer of high pressure liquid ammonia from the Thermosyphon Receiver to"
    }
  ]
}