{
  "FacilityID": 42945,
  "FacilityName": "Chestnut Ridge Foam, Inc.",
  "FacilityStr1": "443 Warehouse Dr.",
  "FacilityStr2": null,
  "FacilityCity": "Latrobe",
  "FacilityState": "PA",
  "FacilityZipCode": "15650",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42129",
  "LEPC": "Westmoreland County LEPC",
  "FacilityLatDecDegs": "40.328611",
  "FacilityLongDecDegs": "-079.371944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "ccasamento@chestnutridgefoam.com",
  "FacilityDUNS": 153749395,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Larry Garrity",
  "OperatorStr1": "443 Warehouse Dr.",
  "OperatorStr2": null,
  "OperatorCity": "Latrobe",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "15650",
  "OperatorZipCodeExt": null,
  "FTE": 150,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000166866",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "TV-65-00181",
  "SafetyInspectionDate": "2005-05-03 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-05-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-05-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-05-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-05-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 40.32987,
  "FRS_Long": -79.37111,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61770,
      "AltID": "Urethane Foam Manufacture",
      "FacilityID": 42945,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 81550,
          "ProcessID": 61770,
          "ChemicalID": 77,
          "Quantity": 61080.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 63213,
          "ProcessID": 61770,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 23143,
              "Process_NAICS_ID": 63213,
              "SafetyReviewDate": "1999-09-01 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "OSHA Labelling",
              "FR_Comments": null,
              "HazardReviewDate": "1999-09-01 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": "heat detection sensors",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-09-01 00:00:00",
              "TrainingReviewDate": "1999-10-22 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "HAZMAT Technician (24 hours)",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-08-31 00:00:00",
              "EquipmentInspectionDate": "1999-07-21 00:00:00",
              "EquipmentTested": "Tanks and piping",
              "ComplianceAuditDate": "1999-12-02 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "In October 1988, Chestnut Ridge Foam, Inc. formalized an Off-Site Response Plan with the Westmoreland County Department of Emergency Management.  The purpose of the plan is to describe the procedure to be followed in the event of an emergency which may require an evacuation of the surrounding areas.  Annual revisions have been issued to include updated or revised information.",
              "_chemicals": [
                {
                  "PrimaryKey": 24187,
                  "PreventionProgram2ID": 23143,
                  "ProcessChemicalID": 81550
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 42945,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-11-01 00:00:00",
    "ERTrainingDate": "2000-01-14 00:00:00",
    "CoordinatingAgencyName": "Westmoreland County LEPC",
    "CoordinatingAgencyPhone": "7248303771",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42945,
      "SummaryText": "Risk Management Planning Executive Summary\n\nGeneral Information\n\nChestnut Ridge Foam, Inc. is a privately held company located on Route 981 North, Latrobe, Westmoreland County, and Pennsylvania.  This location consists of corporate offices, as well as the manufacturing facility and is located in a rural setting.  Access to the facility is through the driveway located on the West Side of the property off state Route 981N. Chestnut Ridge Foam, Inc. uses several processes to manufacture polyurethane, polychloroprene, and natural rubber foam for a variety of applications. The facility manufactures numerous consumer and commercial products containing polyurethane foam materials.  These products include mattresses, and automobile, airplane, and specialty seating.  The facility has purchased flexible urethane blocks, in bulk, for use in these products.  The process includes cutting and shaping of the urethane materials and constructing the final shapes through heating and adhesives.  The use of large quantities of these urethane blocks prompted the company to investigate the generation of these items on-site.\n\nThe oldest manufacturing process used is known as the \"Dunlap\" process where air is entrained in latex compounds using small \"whip and bowl\" mixers and large foamers.  After air is mixed into the latex compound, a gelatin agent is added which causes the compound to gel after it is poured into a mold.  In one process, the gel is steam-cured in the mold, then washed, and dried after stripping from the mold.  In another process, the gelled foam is stripped from the mold, placed on a rack, air-dried and cured.  In a third process, the latex and air mixture is poured onto a belt where it is scraped level, then gelled, and cured with heat.  The cured foam is used in a variety of applications.\n\nChestnut Ridge Foam, Inc. uses another process where raw polyurethane foam is purchased from outside vendors, dipped in polychloroprene latex compounds and dried to produce a highly "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42945,
      "SummaryText": "flame-retardant foam.  This foam is used in a variety of applications.  An additional line utilizes a polyol resin and methylene bisphenyl isocyanate (MDI), which is mixed and poured into molds to produce molded seating cushions.\n\nThe RMP plan describes the newly designed and constructed process unit and all programs, practices, and procedures for the manufacture of urethane buns. This process introduces the only Part 68 regulated material at the site.  The batch process uses toluene diisocyanate, a non-regulated polyol resin, and other chemicals to make flexible urethane buns.  The chemicals are blended in a mixing pot and released into a mold to produce the large polyurethane buns. The buns will be cut to appropriate size and shape and are utilized in the manufacture of a variety of products in several applications.  The process, housed in the West Building, includes the following elements:\n\n* Toluene Diisocyanate (TDI) truck trailer transfer station with integrated dike area\n* transfer piping and pumps\n* 6000 gallon storage tank (61,000lbs. of TDI)\n* transfer piping and pumps with automated/process control transfer/mixing equipment\n* 55 gallon mixing tank\n* bun mold\n* curing area\n* fully functional TDI multi-point monitoring system\n\nAccidental Release Prevention Program\n\nChestnut Ridge has developed an extensive accidental release prevention program and integrated emergency response policies to assure public safety.  The manufacturing process is unique to the industry and incorporates new technology developed in South Africa.  Design of the facility was carefully orchestrated and selection of all auxiliary equipment was made utilizing state of the art criteria.  All design was conducted in accordance with current good engineering practice, current industrial standards (such as ASME codes), conformance with raw material supplier recommendations, and following a process hazard analysis to identify potential design issues.  Any identified issues were corrected prior"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42945,
      "SummaryText": " to final check out of equipment. The management of Chestnut Ridge Foam, Inc. is committed to safety and protection of the environment.  The presence of a full-time EHS professional and a design engineer is evidence of this commitment and will ensure continued safe operation and modification of existing processes.  Advanced training for facility first responders, operators and company management employees in emergency practices and procedures will assure a unified and committed response in case of an emergency.\n\nThe facility has developed a complete accidental release prevention process that includes:\n\n* Process safety information file\n* Complete hazard analysis of the process\n* Installation of numerous process controls\n* Active and passive mitigation systems, including the fact that the entire process is enclosed\n* TDI monitoring and detection system\n* Development of a complete set of operating instructions/procedures\n* Training for all operating personnel associated with the process\n* Training of selected personnel in emergency response practices (HAZWOPER 24-hour)\n* Development of a compete maintenance program with procedures\n* Full implementation of an incident investigation procedure\n* Recently updated emergency response plan\n\nWorst Case Release Scenario\n\nChestnut Ridge Foam, Inc. has identified the catastrophic failure of the 6000-gallon storage tank as the worst-case release scenario.  The storage tank is housed inside the manufacturing facility with dike containment capable of holding the entire contents of the tank.  The United States Environmental Protection Agency's RMP*Comp(tm) model was utilized to determine offsite impact of such a release.  It was determined that the distance to the endpoint would be less than 0.1 miles.  Fifteen residents live within this distance.  However, it is unlikely they would be impacted by the release due to the fact the storage tank is contained in a building and the surface area of the pool would not allow for significant "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 42945,
      "SummaryText": "vaporization of the TDI.  There are no schools, hospitals, prisons/correctional facilities, or recreation areas within the distance to endpoint.  An adjacent manufacturing facility, ALLVAC, is within the distance to endpoint, but should not be impacted by a release.  No environmental receptors such as state parks, forests, monuments, wildlife sanctuaries or wilderness areas are within the distance to endpoint.  Passive mitigation systems include a dike and enclosure.  The storage area has TDI monitoring systems that will alert facility personnel of a release.  Quick response should limit the amount of material released if a slow leak scenario should occur.  The use of fire fighting foam would also limit the release of vapor to the atmosphere.  The storage tank is a pressure vessel capable of handling the contents the near ambient storage conditions.\n\nAlternate Release Scenario\n\nAn alternate release scenario would result from a power outage or inoperable valve within the process at the batch-mixing tank.  This would result in up to 55 gallons (304 pounds) of TDI contained in the batch-mixing tank.  The mixed materials could begin to expand and could overflow the vessel.  However, the model, RMP*Comp(tm), indicates the distance to endpoint under 0.1 miles.  It is unlikely that this distance would be reached.  Further, the model does not have the capability to determine distance to release under 0.1 miles.  Investigation of this scenario indicates it is unlikely that any receptors, other than facility personnel would be impacted by such a release.  This release scenario is the only identified potential scenario other than failure of the storage tank or failure of the delivery tanker.  It is unlikely that the delivery tanker would fail while on facility property and more likely that such a failure would occur on the road.  This would be the responsibility of the shipper and not of Chestnut Ridge Foam.\n\nFive Year Accident History\n\nThe facility has not had a significant o"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 42945,
      "SummaryText": "r reportable release in the past five years.  All environmental, safety, and health related incidents are investigated in accordance with Chestnut Ridge Foam, Inc.'s incident investigation program.  A compete report is developed, recommendations/corrective actions are identified, and implementation timetable is followed.  The facility has had regular PA DEP inspections as required for compliance with various state rules/regulations for environmental compliance.  No significant issues are outstanding at this time.  All required reports have been filed in accordance with rules and regulations.\n\nEmergency Response Program\n\nChestnut Ridge Foam Inc. recently updated (11/01/99) the facility emergency response plan to include the TDI process unit.  The plan will be incorporated into the Westmoreland County emergency response plan and has been discussed with the Westmoreland County Local Emergency Planning Commission.  The plan includes specific actions to be taken in response to accidental releases of TDI from the facility.  The facility has trained (10/07/99) emergency responders to react to spills, not greater than 100 gallons.  Bayer Corporation, supplier of the raw materials, will coordinate actions in response to spills greater than 100 gallons.  This will be accomplished utilizing professionally trained responders.  The plans are specific with respect to informing public and local agencies responding to accidental releases.  The facility intends to conduct drills annually.\n\nMethods and Planned Changes to Improve Safety\n\nThe process facility is new.  The operation of the facility will be reviewed following the normal startup period and at least 6 months of operations.  A review of operations, training, equipment, technology, and organizational issues will be conducted and any recommendations or corrective actions will be addressed."
    }
  ]
}