{
  "FacilityID": 43029,
  "FacilityName": "Ogdensburg Energy Facility",
  "FacilityStr1": "SLPC Entrance Rd.",
  "FacilityStr2": "P. O. Box 585",
  "FacilityCity": "Ogdensburg",
  "FacilityState": "NY",
  "FacilityZipCode": "13669",
  "Facility4DigitZipExt": "0585",
  "FacilityCountyFIPS": "36089",
  "LEPC": "St. Lawrence County LEPC",
  "FacilityLatDecDegs": "44.725833",
  "FacilityLongDecDegs": "-075.441667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "jklimaszewski@sithe.com",
  "FacilityDUNS": 179188230,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "AG Energy, L. P.",
  "OperatorStr1": "SLPC Entrance Rd.",
  "OperatorStr2": "P. O. Box 585",
  "OperatorCity": "Ogdensburg",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13669",
  "OperatorZipCodeExt": "0585",
  "FTE": 13,
  "OtherEPAFacilityID": "13669GNRGYSERVI",
  "EPAFacilityID": "100000146139",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "6401200053/0001",
  "SafetyInspectionDate": "2004-05-26 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Complete Revision 060305",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-06-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-06-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-06-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-06-08 00:00:00",
  "DeRegistrationEffectiveDate": "2010-01-01 00:00:00",
  "AnniversaryDate": "2010-06-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 44.72583,
  "FRS_Long": -75.44167,
  "FRS_Description": "SW CORNER OF LAND PARCEL",
  "FRS_Method": "PUBLIC LAND SURVEY - FOOTING",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61913,
      "AltID": "Aqueous Ammonia System",
      "FacilityID": 43029,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 81734,
          "ProcessID": 61913,
          "ChemicalID": 57,
          "Quantity": 128000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 63361,
          "ProcessID": 61913,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 23171,
              "Process_NAICS_ID": 63361,
              "SafetyReviewDate": "2005-05-12 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 1,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "API Standards; NY State Hazardous Bulk Storage regulations",
              "FR_Comments": "6 NYCRR 595 - 599",
              "HazardReviewDate": "2005-05-12 00:00:00",
              "ChangeCompletionDate": "2005-05-12 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 1,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Local / remote level indication and alarms",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2005-05-12 00:00:00",
              "TrainingReviewDate": "2005-05-12 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2005-03-31 00:00:00",
              "EquipmentInspectionDate": "2005-05-12 00:00:00",
              "EquipmentTested": "All CBS equipment (NYS Spill Prevention requirement)",
              "ComplianceAuditDate": "2003-01-23 00:00:00",
              "AuditCompletionDate": "2003-01-23 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "The aqueous ammonia system consists of one storage unit and two interconnected injection units.  All the parts of this prevention program apply to both units.",
              "_chemicals": [
                {
                  "PrimaryKey": 24222,
                  "PreventionProgram2ID": 23171,
                  "ProcessChemicalID": 81734
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 43029,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-05-01 00:00:00",
    "ERTrainingDate": "2004-09-29 00:00:00",
    "CoordinatingAgencyName": "St. Lawrence County LEPC",
    "CoordinatingAgencyPhone": "3153792240",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43029,
      "SummaryText": "EXECUTIVE SUMMARY\n\n1.  Accidental Release Prevention and Emergency Response Policies:\nThe Ogdensburg Energy Facility is strongly committed to employee, public and environmental safety.  This commitment is inherent to having a comprehensive accidental release prevention program in place that covers areas such as system design, installation, operation, maintenance, employee training and procedure development and implementation.  It is our policy to implement the appropriate controls to prevent the possible release of regulated substances.  However, if such a release should occur, our facility is integrated closely with the local fire department and other emergency response teams to control and mitigate the effects of the release.\n\n2.  The Stationary Source and the Regulated Substances Handled:\nAs a cogeneration facility, our primary activities include those common to the generation of electricity and thermal energy.  There is one (1) regulated substance present at our facility, aqueous ammonia (30% concentration).  The ammonia is used in a selective catalytic reduction process to reduce gas turbine Nox emissions.  The maximum inventory of ammonia at our facility is 128,000 lbs.\n\n3.  The Worst Case Release and Alternate Case Release Scenarios:\nThe required off-site consequence analyses at our facility were performed using the look-up tables and equations provided by the EPA in the RMP Offsite Consequence Analysis Program, RMP*Comp(fm).  The following paragraphs provide the specific details of the chosen scenarios.\n\nThe worst case release scenario developed for Program 2 toxic substances involves the catastrophic release of aqueous ammonia from the storage tank via a tank shell rupture.  The release consists of the maximum quantity stored of 128,000 lbs of product in aqueous form.  The liquid is assumed to be released immediately to form a pool of solution 1.7 feet deep covering 1,350 sq. ft. of surface area.  The product evaporates into the air at a rate of 50.2 lbs. p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43029,
      "SummaryText": "er minute with the entire quantity evaporating in a matter of approximately 42 hours.  A diked containment is the only form of passive mitigation assumed to have taken place during this scenario.  Under worst case atmospheric conditions, namely Class F atmospheric stability and 1.5 meters / second windspeed, the maximum distance of travel of the product released at a toxic endpoint of 0.14 mg/L is 0.4 miles.\n\nThe alternative release scenario developed for the regulated substance involves the catastrophic release of 3300 lbs. of ammonia (30% concentration) resulting from a rupture of the product hose during a transfer of ammonia from a pressurized delivery vehicle to the storage tank.  Upon discovering the ruptured connection, the active mitigation measure of utilizing the emergency shutdown device available during the transfer limits the total duration of the discharge to less than three (3) minutes.  The spilled product is assumed to be released into the the passive mitigation device of the transfer station's secondary containment dike.  The product will spread throughout the 7,500 sq. ft. basin where it evaporates into the environment over the next 13 minutes.  Under the alternative case atmospheric conditions, namely an atmospheric stability Class D, at windspeeds of 3.0 meters / second, the maximum distance of travel of the product released at a toxic endpoint of 0.14 mg/L is 0.2 miles.\n\n4.  The Accidental Release Prevention Program:\nThe facility has implemented any and all necessary steps to comply with the accidental release prevention requirements set forth under 40 CFR 68 and all applicable subparts.  This facility was designed and constructed in accordance with applicable ASTM, ANSI, API, and ASME standards.\n\nThe following sections briefly describe the elements of the release prevention programs that are in place at our facility:\n\na)  Safety Information\nThe Ogdensburg Energy Facility maintains a detailed record of written safety information describing the c"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43029,
      "SummaryText": "hemical hazards, operating parameters and equipment desgins associated with the aqueous ammonia system.\n\nb)  Hazard Review\nThe facility has and will continue to conduct comprehensive studies to ensure that any hazards associated with our processes are identified and controlled efficiently.  A hazard assessment checklist has been developed and is used to perform a routine hazard evaluation.  These studies are undertaken by qualified personnel knowledgable in process operations.  Any adverse findings will be reviewed and addressed in a timely manner.\n\nc)  Operating Procedures\nThe Ogdensburg Energy Facility routinely maintains and employs current operating procedures and checklists for the purpose of operating the process systems in a safe, efficient and environmentally compliant manner.  These procedures address the various modes of operation applicable to the facility such as: start-up / shutdown, steady-state operation, and chemical unloading and transfer.  The information contained in these procedures is reviewed regularly and is required to be used by all personnel involved in the process.\n\nd)  Training\nThe facility has a comprehensive training program in place that ensures that the employees involved in the operation, maintenance, and/or inspection of the process systems are fully qualified.  All new empolyees receive basic and advanced training in process operations and in the safe handling procedures of regulated substances.  They also receive on-the-job direct supervision until their qualification process is complete.  Refresher training is a routine part of the training program and is completed annually.\n\ne)  Maintenance\nFacility personnel perform documented maintenance inspections and preventative checks on process systems regularly to ensure their continued safe and efficient operation.  Process equipment examined during these checks include: storage tanks, piping and valves and all equipment associated with the safe handling and transfer of the products.  "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43029,
      "SummaryText": "Maintenance activities are performed by fully qualified personnel, trained in the proper skills.  These employees are also offered additional, specialized training on an as-needed basis.\n\nf)  Compliance Audits\nThe facility has and will continue to conduct periodic compliance audits on a regular basis to ensure that the provisions set forth in the RMP rules are being followed.  These audits will be performed at least every three (3) years and any actions determined to be necessary will be undertaken in a timely manner.\n\ng)  Incident Investigation\nThe facility will investigate incidents which result in, or could reasonably have resulted in, the accidental release of a regulated substance.  These investigations will be undertaken to identify the factors contributing to the incident as well as any corrective actions required to prevent the incident from recurring.  Reports will be retained for a minimum of five (5) years.\n\n5.  There have not been any accidental releases of any regulated substances during the past five (5) years.\n\n6.  Emergency Response Plan:\nWith the exception of defensive action to stop of mitigate the effects of a leak, or response to incidental releases of hazardous substances that can easily be absorbed, neutralized or otherwise controlled, Ogdensburg Energy Facility employees will not respond to an accidental release of aqueous ammonia.  The facility is included in the St. Lawrence County LERC emergency response plan, and procedures are in place to notify emergency responders in the event of an accidental release.\n\nFacility management is on-call on a 24 hour basis and meet the requirements for the RMP of the facility emergency contact.\n\n7.  Current Projects and Planned Changes\nNONE"
    }
  ]
}