{
  "FacilityID": 4305,
  "FacilityName": "SupHerb Farms",
  "FacilityStr1": "300 Dianne Drive",
  "FacilityStr2": null,
  "FacilityCity": "Turlock",
  "FacilityState": "CA",
  "FacilityZipCode": "95380",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06099",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.498333",
  "FacilityLongDecDegs": "-120.881944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 788317253,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "SupHerb Farms",
  "OperatorStr1": "300 Dianne Drive",
  "OperatorStr2": null,
  "OperatorCity": "Turlock",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95380",
  "OperatorZipCodeExt": null,
  "FTE": 74,
  "OtherEPAFacilityID": "CAL000138762",
  "EPAFacilityID": "100000051711",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 37.49688,
  "FRS_Long": -120.88213,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5023,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 4305,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 5378,
          "ProcessID": 5023,
          "ChemicalID": 56,
          "Quantity": 16200.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5132,
          "ProcessID": 5023,
          "NAICSCode": "311411",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1922,
              "Process_NAICS_ID": 5132,
              "SafetyReviewDate": "1996-08-01 00:00:00",
              "PHA_Date": "1996-08-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1996-08-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Diffusion System",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-01 00:00:00",
              "TrainingReviewDate": "1999-04-26 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-01 00:00:00",
              "EquipmentInspectionDate": "1999-05-01 00:00:00",
              "EquipmentTested": "Compressors and pumps",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-04-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-13 00:00:00",
              "HotWorkPermitReviewDate": "1998-12-21 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-22 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Ammonia Refrigeration System",
              "_chemicals": [
                {
                  "PrimaryKey": 2145,
                  "PreventionProgram3ID": 1922,
                  "ProcessChemicalID": 5378
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4305,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Stanislaus County Dept of Envir Res",
    "CoordinatingAgencyPhone": "2095256700",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4305,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nSupHerb Farms utilizes anhydrous ammonia in the refrigeration system at their herb and specialty vegetable processing plant in Turlock, California.  It is SupHerb Farms' policy to comply with all applicable governmental regulations.  Further, it is SupHerb Farms' objective to be a responsible citizen of the community in all of its business activities.\n\nSupHerb Farms emphasizes safe and environmentally sound operating practices and procedures through their employee training programs.  In addition to job specific training, operators and maintenance personnel receive training in accident prevention, safety, and first aid.  Additionally, an emergency action plan has been prepared for SupHerb Farms and a chain of command to respond to emergencies has been established.\n\nSupHerb Farms has developed a detailed Compliance Audit Checklist which will be used to evaluate compliance with the Process Safety Management (PSM) and 40 CFR Part 68 (RMP regulations).  At least every three years, SupHerb Farms will audit these programs and any findings of noncompliance will be documented and responded to and the deficiencies will be corrected.\n\nDescription of the Stationary Source and Regulated Substances \n\nSupHerb Farms owns and operates a herb and specialty vegetable processing plant located on 300 Dianne Drive in Turlock, California.  The plant began commercial operation in March, 1993.  The facility is located on eleven acres of land and is comprised of an office, warehouse, indoor and outdoor processing areas, and open space.\n\nHerbs and specialty vegetables are unloaded from trucks at the processing facility and are washed with water prior to entering the process lines.  The herbs and specialty vegetables are fresh frozen or freeze dried.  Depending on the final product, the herbs and specialty vegetables are processed through a drying unit and chive freezer, an Instant Quick Freeze (IQF) tunnel, or "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4305,
      "SummaryText": "a paste line prior to packaging for wholesale markets.  Cold storage is also provided within the warehouse for holding incoming herbs and specialty vegetables and packaged final products.\n\nAt SupHerb Farms, anhydrous ammonia is used as the refrigerant in the plant refrigeration system.  The refrigeration system provides process cooling for the IQF freezer, chive freezer, sifting room, holding freezer, packing room, and the shipping and receiving rooms.  The major components of the SupHerb Farms refrigeration system are the high pressure receiver, high side and low side accumulators, evaporators, compressors, an intercooler, condensers, an air purger, and an oil drain pot.\n\nDuring normal operation, the anhydrous ammonia is distributed throughout the refrigeration system.  However, during major maintenance activities, the entire refrigeration system can be \"pumped down\" to evacuate the ammonia from the system and store it in the high pressure receiver.  The maximum quantity of ammonia that can be stored in the high pressure receiver is 16,274 pounds. \n\nFor purposes of the offsite consequence analyses, the RMP regulations define the toxic endpoint for anhydrous ammonia as 0.14 mg/l (200 ppm).  This concentration has been established by the American Industrial Hygiene Association as the Emergency Response Planning Guideline Level 2 (ERPG-2).  \n\nERPG-2 is the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\n\nWorst-Case Release Scenario and Alternative Release Scenario\n\nOffsite consequence analyses are used as tools to assist in emergency response planning.  The RMP regulations require the owner or operator of a stationary source to analyze the offsite impacts due to an accidental release of a regulated substance.  The offsite consequence an"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4305,
      "SummaryText": "alysis for a Program 3 process must analyze the worst-case release scenario and an alternative release scenario.  Since SupHerb Farms' ammonia-based refrigeration system is considered a Program 3 process, both release scenarios were evaluated in the offsite consequence analysis.\n\nThe offsite consequence analysis must include an estimate of the residential population within an area potentially affected by the accidental release scenario.  This area is defined as a circle with a radius equivalent to the distance the release would travel with concentrations at or above the endpoint.  The circle also defines the area in which potential environmental receptors must be identified.\n\nThe worst case release is defined by the U.S. EPA as the total release of the contents of the single largest vessel or pipe within 10 minutes.  For liquefied gases stored under pressure, the entire contents of the vessel or pipe are assumed to be released as a vapor.  A total vapor release is highly unlikely.  However, this standardized worst case scenario was developed for emergency response agencies to use for planning purposes.\n\nAn alternative release scenario is a release that is more likely to occur than the worst-case release scenario.  For SupHerb Farms, the alternative release scenario was selected based on the results of the Process Hazard Analysis (PHA) for the ammonia-based refrigeration system.  A credible release event with a high discharge rate would potentially have the greatest offsite impact.  A failure of one of the pump seals on the ammonia-based refrigeration system was identified in the PHA as having a medium probability of occurrence with a possible high discharge rate, and therefore, was chosen as the alternative release scenario.\n\nSupHerb Farms has analyzed the offsite consequences of the worst-case and alternative release scenarios.  For the worst-case release scenario, the release of 16,200 lbs. of ammonia over a 10 minute period, the plume would travel 1.5 miles at co"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4305,
      "SummaryText": "ncentrations at or above the endpoint.\n\nUsing 1990 Census data, the population potentially affected within the worst-case release scenario circle is 9,000.  Sensitive receptors potentially affected by the worst-case release are schools, long term health care facilities, child day care facilities, parks, recreational areas, and major commercial, office, and industrial buildings.  There were no environmental receptors within the worst case release scenario circle.\n\nIn the alternative release scenario, a failure of a pump seal was modeled as a release of liquefied ammonia stored under pressure.  For a release of 490 lb/min of anhydrous ammonia inside the engine room, the model calculated that the plume would travel 0.1 mile at concentrations at or above the endpoint.  Farmland and one residence are located within the 0.1 mile radius from the engine room at the SupHerb Farms facility. Using 1990 Census data, the population potentially affected by the alternative release scenario is 2 people.  There were no sensitive receptors or environmental receptors within the alternative release scenario circle.\n\nThe ammonia refrigeration equipment, except for the high pressure receiver, is located within a building, which would greatly reduce the impact of an actual release.  The modeling performed as part of this offsite consequence analysis includes a mitigation factor which assumes that the release is within an enclosed space, in direct contact with the outside air. \n\n\n\n\nGeneral Accidental Release Prevention Program and Chemical-\nSpecific Prevention Steps\n\nA PSM program, which meets the requirements of the general accidental release prevention program, has been developed at SupHerb Farms to address the ammonia-based refrigeration system.  The PSM program includes the following chemical-specific prevention steps:\n\nr    Written process safety information, including information pertaining to the hazards of ammonia, the technology of the process, and the equipment in the process has be"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4305,
      "SummaryText": "en compiled.\n\nr    An initial Process Hazard Analysis (PHA) was performed and will be updated and revalidated at least every five years.\n\nr    Written operating procedures have been developed and implemented, and are reviewed at least annually.\n\nr    Safe work practices, such as lockout/tagout, confined space entry, opening process equipment or piping, and control over entrance into the facility have been developed and implemented.\n\nr    Each employee involved in operating the ammonia system has received initial training and refresher training at least every three years.\n\nr    Written mechanical integrity procedures have been established and implemented.\n\nr    A Management of Change (MOC) program has been developed and implemented to address all proposed changes to the ammonia system.\n\nr    Pre-startup safety reviews are performed when a modification is made to the ammonia system that is significant enough to require a change in the process safety information.\n\nr    Audits are conducted at least every three years to evaluate compliance with the PSM and RMP regulations.\n\nr    Incident investigation procedures have been established.\n\nr    A written plan of action regarding the implementation of employee participation has been developed and implemented.\n\nr    Hot work permits are issued for all hot work operations conducted on or near the ammonia system.\n\nr    A Contractor Safety Policy has been developed and implemented.\n\nTo ensure that the general accidental release prevention program and the chemical-specific prevention steps are implemented, SupHerb Farms has assigned overall responsibility for the RMP elements to the President.  The President has the overall responsibility for the development, implementation, and integration of the RMP elements.\n\nFive-Year Accident History\n\nSupHerb Farms has not had any accidental releases from the ammonia-based refrigeration system that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, shelter"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 4305,
      "SummaryText": "ing in place, property damage, or environmental damage in the last five years.\n\nEmergency Response Program\n\nSupHerb Farms has established an emergency action plan and a chain of command to respond to emergencies and to notify emergency responders when there is a need for a response.  However, an emergency response program does not need to be developed for the facility since SupHerb Farms employees will not respond to accidental releases of ammonia, the facility is included in the community emergency response plan, and appropriate mechanisms are in place to notify emergency responders.\n\nPlanned Changes To Improve Safety \n\nThrough the accidental release prevention program, SupHerb Farms regularly evaluates the need for any changes to improve safety.  Currently, SupHerb Farms does not have any additional changes planned to improve safety."
    }
  ]
}