{
  "FacilityID": 43088,
  "FacilityName": "Neale Gas Plant",
  "FacilityStr1": "Arco Road",
  "FacilityStr2": null,
  "FacilityCity": "Merryville",
  "FacilityState": "LA",
  "FacilityZipCode": "70653",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22011",
  "LEPC": "Beauregard Parish LEPC",
  "FacilityLatDecDegs": "30.772139",
  "FacilityLongDecDegs": "-093.469472",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Hilcorp Energy Company",
  "Company2Name": null,
  "CompanyDUNS": 606410538,
  "Company2DUNS": null,
  "OperatorName": "Hilcorp Energy Company",
  "OperatorStr1": "1201 Louisiana Street",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77002",
  "OperatorZipCodeExt": "5606",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000087951",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-04-17 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2005-06-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-06-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2005-06-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2007-08-15 00:00:00",
  "DeRegistrationEffectiveDate": "2007-07-31 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.5",
  "FRS_Lat": 30.772139,
  "FRS_Long": -93.469472,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": null,
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C04",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Hilcorp Energy sold its RMP Facility to Energy Quest, LLC",
  "_processes": [
    {
      "ProcessID": 61989,
      "AltID": "NGL Storage Tank",
      "FacilityID": 43088,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 81868,
          "ProcessID": 61989,
          "ChemicalID": 118,
          "Quantity": 153000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 63437,
          "ProcessID": 61989,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 23193,
              "Process_NAICS_ID": 63437,
              "SafetyReviewDate": "2004-10-07 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "American Petroleum Institute (API)",
              "FR_Comments": null,
              "HazardReviewDate": "2004-10-07 00:00:00",
              "ChangeCompletionDate": "2004-12-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": "Human error",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fire extinguishers",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-09-01 00:00:00",
              "TrainingReviewDate": "2003-04-15 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer based training",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-10-07 00:00:00",
              "EquipmentInspectionDate": "2004-09-07 00:00:00",
              "EquipmentTested": "Pressure Relief Valves",
              "ComplianceAuditDate": "2004-05-18 00:00:00",
              "AuditCompletionDate": "2004-11-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 24246,
                  "PreventionProgram2ID": 23193,
                  "ProcessChemicalID": 81868
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 43088,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2002-01-24 00:00:00",
    "ERTrainingDate": "2003-04-15 00:00:00",
    "CoordinatingAgencyName": "Beauregard Sheriff Office",
    "CoordinatingAgencyPhone": "3374633281",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 43088,
      "SummaryText": "ined.\r\n\r\nCHEMICAL SPECIFIC PREVENTION STEPS\r\nThe processes at the Neale Gas Plant have hazards that must be managed to ensure continued safe operation.  The prevention program summarized previously is applied to all RMP-covered processes at the Neale Gas Plant.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\r\nIn addition, to the accident prevention program activities, Devon Louisiana Corp. has safety features on many units to help contain/control a release, quickly detect the release, and reduce the consequences of (mitigate) a release.  The following types of safety features are used in various processes.\r\n\r\nRelease Containment/Control\r\n1. Process relief values that discharge to a flare to capture and incinerate episodic releases.\r\n2. Valves to permit isolation of the process (manual or automated)\r\n3. Automated shutdown systems for specific process parameters (e.g., high temperature)\r\n4. Curbing or diking to contain liquid releases\r\n5. Redundant equipment and instrumentation \r\n6. Atmospheric relief devices\r\n\r\nRelease Mitigation\r\n1. Fire extinguishing systems\r\n2. Personnel trained in emergency procedures\r\n3. Personal protective equipment (e.g., chemical protective clothing, self-contained breathing apparatus)\r\n\r\nFIVE-YEAR ACCIDENT HISTORY\r\nThe Neale Gas Plant has an excellent record of accident prevention.  Over the past 5 years there have been no offsite releases, as defined in the regulation.\r\n\r\nEMERGENCY RESPONSE PROGRAM INFORMATION\r\nThe Neale Gas Plant maintains a written emergency program, which is in place to protect worker and public safety as well as the environment.   The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address facility/equipment isolation and shutdown, initial first-aid and medical trea"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 43088,
      "SummaryText": "tment for exposures (i.e., MSDS information), evacuation plans for the plant, accounting for plant personnel after an evacuation, notification of local emergency response agencies, and post-incident cleanup/decontamination requirements.  Plant personnel receive training in these procedures as necessary to perform their specific duties.\r\nThe emergency action program is reviewed annually and updated when necessary.  Plan changes required because of modification to the Plant facilities or emergency equipment are administered through the management of change (MOC) process, which includes informing and/or retraining affected personnel.\r\nThe overall emergency response program for the Plant is coordinated with the Beauregard Parish Local Emergency Planning Committee (LEPC), City of Merryville Fire Department, and the local ambulance services.  The plant has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department and ambulance services).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  The plant conducts periodic emergency action drills and provides periodic refreshers to the local emergency response organizations on the hazards associated with the Plant's operations."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 43088,
      "SummaryText": "Neale Gas Plant, Merryville, LA 70653\r\n\r\nDevon Louisiana Corp.\r\nNeale Gas Plant\r\nRisk Management Plan\r\nExecutive Summary\r\n\r\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\nDevon Louisiana Corp. (Devon) is strongly committed to employee, public and environmental safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the operation and maintenance of our facility's processes.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, Devon will utilize trained contract response personnel for emergency response and recovery operations and/or may rely upon local fire department capabilities as well as mutual aid from other local agencies.\r\n\r\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\r\nThe Neale Gas Plant is an unmanned gas processing plant located in Beauregard Parish, near the city of Merryville, Louisiana, off highway 110 on Arco Rd.  The plant consists of one Program Level 2 process, which utilizes several operations (e.g., gravity separation, dehydration, compression, cryogenic separation) to extract a natural gas liquid mixture (primarily liquid butane) from produced natural gas.  The plant has the capacity to store up to 48,000 gallons of regulated NGL, a regulated flammable substance, in two separate pressure tanks at a maximum pressure of 185 psi. The Neale Gas Plant is classified as a Program 2 process under the Accidental Release Prevention (ARP) Program.\r\n\r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\r\nThe following is a summary of the accident release prevention program in place at the plant.  This summary addresses each of the RMP Program 2 Prevention Program elements and describes the management system in place to implement the program.\r\nSafety information\r\nDevon Louisiana Corp. keeps a variety of technical documents that are used to help maintain safe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43088,
      "SummaryText": "are documented, tracked to closure and retained.\r\nOperating Procedures\r\nDevon Louisiana Corp. maintains written procedures that address various modes of process operations, such as; (1) start-up, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial start-up of a new process.  These procedures provide guidance for experienced operators and also provide the basis for training new operators.  The information is regularly reviewed and is accessible to operators involved in the processes.\r\nTraining\r\nDevon Louisiana Corp. has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least once every three years, and more frequently as required by regulations.\r\nContractor services are periodically utilized during periods of increased maintenance or construction activities.  Because contractors work on or near process equipment, the gas plant has procedures in place to ensure the contractors (1) perform their work in a safe manner, (2) have appropriate knowledge and skills, (3) are aware of the hazards of their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site specific safety rules, and (6) inform gas plant personnel of any hazards that they find during there work.  All contractors participate in a comprehensive Contractor Safety and Environmental Management Process that DEVON has implemented and a site-specific orientation provide by DEVON personnel to verify the above.  Contract personnel are given a copy of the HSE Field Operations Handbook before starting work.  In addition, a job safety analysis is reviewed and or updated or developed by the contractors prior to each maintenance/construction task.\r\nMaintenance\r\nDevon Louisiana Corp. has well-established practices and procedures for maintaining process equipment."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43088,
      "SummaryText": "operation of the gas plant.  These documents address chemical properties and associated hazards, limits for key process properties and specific chemical inventories, and equipment design basis/configuration information, including exposure hazards and emergency response/exposure treatment consideration, as provided in material safety data sheets (MSDSs).\r\nThe gas plant also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities.\r\nHazard Review\r\nThe hazard review helps Devon to determine whether we are meeting applicable codes and standards, identify and evaluate the types of potential failures, and focuses our emergency response planning efforts.\r\nDEVON utilizes the process hazards analysis (PHA) methods such as what if and hazard review checklist for propane storage facilities provided in the EPA's Risk Management Program Guidance For Propane Storage Facilities.  The hazard review checklist was prepared based on the requirements of NFPA 58, 1998 Edition, and supplemented with additional information for NPGA Safety Bulletin #106-83 L-P Gas Bulk Storage Safety Inspection Checklist.  Hazard reviews are conduct by a team of people who have operating and maintenance experience as well as engineering expertise.  The Hazard Analysis (HA) team identifies hazards associated with the process and regulated substances, opportunities for equipment malfunctions or humans errors that could cause accidental release, the safeguards used or needed to control the hazards to prevent equipment malfunction or human errors and any steps used or needed to detect or monitor releases.  The HA team findings are forwarded to local and corporate management for resolution.  These periodic reviews are conducted at least every 5 years.  The results, findings and corrective actions"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43088,
      "SummaryText": "The basic aspects of this program include (1) training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting equipment deficiencies, when identified, and (5) applying quality assurance measures.  Qualified personnel carry out maintenance operations with previous training in maintenance practices.  Any equipment deficiencies identified by the maintenance checks or hazard analyses are corrected in a safe and timely manner.\r\nIncident Investigations\r\nNote:  There have been no offsite releases in the last five years.  Devon has well-established procedures for conducting incident investigations.  Devon will investigate every incident that results in or could reasonably have resulted in a catastrophic release.  The goal of the investigation is to determine the facts and develop corrective actions to prevent recurrence of the incident or a similar incident.  The investigation team will document its findings, develop recommendations to prevent recurrence, and forward these results to corporate management for resolution.  All corrective actions will be tracked to closure and communicated to all applicable employees.  Incident investigation reports will be retained for at least five years so that the reports can be reviewed during future HAs and HA re-validations.\r\n\rCompliance Audits\r\nTo help ensure that the accident prevention program is functioning properly, the Neale Gas Plant is periodically audited to determine whether the procedures and practices required by the accident prevention program are being implemented.  It is Devon's policy that an audit should be conducted at the plant at least every three years.  Both plant operators and management participate as audit team members and forward their findings to corporate for resolution.  The corrective actions taken in response to the audit team's findings are tracked until they are completed.  The final resolution of each finding is documented and the two most recent audit reports are reta"
    }
  ]
}