{
  "FacilityID": 43114,
  "FacilityName": "Grandin Coop Oil",
  "FacilityStr1": "County Road 11",
  "FacilityStr2": "Highway 81",
  "FacilityCity": "Grandin",
  "FacilityState": "ND",
  "FacilityZipCode": "58038",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38097",
  "LEPC": "Traill County LEPC",
  "FacilityLatDecDegs": "47.233389",
  "FacilityLongDecDegs": "-097.000056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "themberger@haltstadelevator.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Halstad Elevator Company, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Grandin Coop Oil",
  "OperatorStr1": "P.O. Box 199",
  "OperatorStr2": null,
  "OperatorCity": "Grandin",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58038",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robin Stene",
  "RMPTitle": "General Manager",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000154192",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-01 00:00:00",
  "SafetyInspectionBy": "Tri State Ins. & PRO Compliance, Inc.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "2702 to epa dup amm ch",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-05-03 00:00:00",
  "DeRegistrationEffectiveDate": "2021-05-01 00:00:00",
  "AnniversaryDate": "2009-08-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 47.23339,
  "FRS_Long": -97.00006,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62016,
      "AltID": "Anydrous Ammonia",
      "FacilityID": 43114,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 63465,
          "ProcessID": 62016,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 81897,
          "ProcessID": 62016,
          "ChemicalID": 56,
          "Quantity": 358676.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 581897,
          "ProcessID": 62016,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43114,
      "SummaryText": "Risk Management Plan (RMP) - Ammonia\n                       Executive Summary\n                       Grandin Coop Oil \n                      Grandin, Minnesota         \n                                \n                                \n  1. Accidental Release Prevention and Emergency Response Policies\nWe at Grandin Coop Oil in Grandin, North Dakota are strongly committed to employee, public, and\nenvironmental safety.  This commitment is an inherent part of our comprehensive accidental release\nprevention program that covers areas such as design, installation, operating procedures, maintenance,\nand employee training associated with the processes at our facility.  It is our policy to implement\nappropriate controls to prevent possible releases of regulated substances.  We coordinate our\nresponse efforts with the Grandin Fire Department, which provides additional emergency response\nexpertise.\n\n  2. Stationary Source and Regulated Substances Handled\nOur facility's primary activities include support services for crop production.  We have anhydrous\nammonia stored in two inter-connected 30,000-gallon tanks, and twenty-two 1,000-gallon nurse at\nour facility in Grandin, North Dakota (Figure 1).  The maximum amount stored at  85% standard\nmaximum storage capacity is 69,700 gallons (358,676.2 pounds) including the capacity of the on-site\nnurse tanks.   The largest single storage vessel at our facility contains 262,446 pounds at  85%\nstandard maximum storage capacity.\n\n  3. Worst Case Release and Alternative Release Scenarios\n  4. General Accidental Release Prevention Program\nOur facility has taken all the necessary steps to comply with the EPA's accidental release prevention\nrequirements as set forth in 40 CFR part 68.  The following sections briefly describe the elements\nof the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nGrandin Coop Oil maintains a detailed record of safety information that describes the chemical\nhazards, op"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43114,
      "SummaryText": "erating parameters, and equipment designs associated with all processes (Appendix E).\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are\nidentified and controlled effectively.  Any findings from the hazard analysis are addressed in a timely\nmanner.\n\nOperating Procedures\nGrandin Coop Oil maintains written operating procedures to ensure that activities within our covered\nprocesses are conducted safely.  These procedures address various modes of operation; the\ninformation is regularly reviewed and is readily accessible to operators involved in the processes\n(Appendix B).\n\nTraining\nGrandin Coop Oil has a comprehensive training program in place to ensure that employees who are\noperating processes are competent in the operating procedures associated with these processes.\n\nMechanical Integrity\nGrandin Coop Oil conducts documented maintenance checks on process equipment to ensure proper\noperation.  Maintenance checks are conducted by qualified personnel with previous training in\nmaintenance practices.  Examples of process equipment that would receive maintenance checks\ninclude:  pressure vessels, storage tanks, piping systems, relief and vent systems, emergency\nshutdown systems, controls, and pumps.  Any equipment deficiencies identified by the maintenance\nchecks are corrected in a safe and timely manner (Appendix C).\n\nManagement of Change\nWritten procedures are in place at Grandin Coop Oil to manage changes in process chemicals,\ntechnology, equipment, and procedures.  Process operators, maintenance personnel or other\nemployees whose job tasks are affected by a modification in process conditions are promptly notified\nof the modification and offered training to deal with it.\n\nPre-startup Reviews\nGrandin Coop Oil routinely conducts pre-startup safety reviews related to new processes and\nmodifications in established processes.  These reviews are conducted to confirm that construction,\nequipment, and ope"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43114,
      "SummaryText": "rating and maintenance procedures are suitable for safe startup prior to placing\nequipment into operation.\n\nCompliance Audits\nGrandin Coop Oil conducts compliance audits on a regular basis to determine whether the plan's\nprovisions, set out under the 40 CFR part 68, are being implemented.  Any non-compliance issue\ndiscovered during the audit is promptly corrected.\n\nEmployee Participation\nGrandin Coop Oil truly believes that process safety management and accident prevention is a team\neffort.  Company employees are strongly encouraged to express their views concerning accident\nprevention issues and to recommend improvements.  In addition, our employees have access to all\ninformation created as part of the facility's implementation of the RMP, particularly information\nresulting from process hazard analyses.\n\n  5. Five-year Accident History\nGrandin Coop Oil has had an excellent record of preventing accidental releases over the last 5 years. \nDue to our stringent release prevention policies, no accidental release has occurred during this\nperiod.\n\n  6. Emergency Response Plan\nGrandin Coop Oil maintains a written emergency action plan to deal with accidental releases of\nhazardous materials.  The plan addresses all aspects of emergency response including first aid and\nmedical treatment, evacuations, and in the event of an accidental release, Grandin Coop Oil will\ncontact local emergency response agencies and the public (Appendix A). Grandin Coop Oil\nmaintains a written emergency action plan which is coordinated with the local fire department and\nthe LEPC.  The plan is intended to assist responding agencies to address all aspects of emergency\nresponse including first aid and medical treatment, evacuations, and notification of local emergency\nresponse agencies and the public.\n\n  7.  Planned Changes to Improve Safety\nWe will continue to provide our employees with ongoing annual training to ensure that they are\ncurrent with all of the safe ammonia transfer and handling procedur"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43114,
      "SummaryText": "es, and provide regular inspection\nand maintenance on all of the ammonia equipment.  Authorized personnel will make changes to the\nfacility if any audits of the facility identify non-compliance with Section 112 (r)(7), Accidental\nRelease Prevention Requirements of the Clean Air Act."
    }
  ]
}