{
  "FacilityID": 43149,
  "FacilityName": "Farmers Union Oil Company - Adams Facility",
  "FacilityStr1": "Highway 17 West",
  "FacilityStr2": null,
  "FacilityCity": "Adams",
  "FacilityState": "ND",
  "FacilityZipCode": "58210",
  "Facility4DigitZipExt": "0056",
  "FacilityCountyFIPS": "38099",
  "LEPC": "Walsh County LEPC",
  "FacilityLatDecDegs": "48.413139",
  "FacilityLongDecDegs": "-098.087222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 60492386,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Farmers Union Oil Company",
  "OperatorStr1": "PO Box 56",
  "OperatorStr2": null,
  "OperatorCity": "Adams",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58210",
  "OperatorZipCodeExt": "0056",
  "RMPContact": "Gary Paulson",
  "RMPTitle": "General Manager",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000014691",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-04-15 00:00:00",
  "SafetyInspectionBy": "Farmers Union Insurance",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "2480 dup amm ch",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-06-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-05-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 48.41314,
  "FRS_Long": -98.08508,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62065,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 43149,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 63514,
          "ProcessID": 62065,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 81946,
          "ProcessID": 62065,
          "ChemicalID": 56,
          "Quantity": 334490.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 581946,
          "ProcessID": 62065,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43149,
      "SummaryText": "              Risk Management Plan (RMP) - Ammonia\n                       Executive Summary\n                   Farmers Union Oil Company \n                      Adams, North Dakota         \n                                \n                                \n  1. Accidental Release Prevention and Emergency Response Policies\nWe at Farmers Union Oil Company in Adams, North Dakota are strongly committed to employee,\npublic, and environmental safety.  This commitment is an inherent part of our comprehensive\naccidental release prevention program that covers areas such as design, installation, operating\nprocedures, maintenance, and employee training associated with the processes at our facility.  It is\nour policy to implement appropriate controls to prevent possible releases of regulated substances. \nWe coordinate our response efforts with the Adams Fire Department, which provides additional\nemergency response expertise.\n\n  2. Stationary Source and Regulated Substances Handled\nOur facility's primary activities include support services for crop production.  We have anhydrous\nammonia stored in one 25,000-gallon tank, twenty-five 1,000-gallon nurse tanks and ten 1,500-\ngallon nurse tanks at our facility in Adams, North Dakota (Figure 1).  The maximum amount stored\nis 65,000 gallons (334,490 pounds) including the capacity of the on-site nurse tanks.   The largest\nsingle storage vessel at our facility contains 109,352.5 pounds at  85% standard maximum storage\ncapacity.\n\n  3. Worst Case Release and Alternative Release Scenarios\n  4. General Accidental Release Prevention Program\nOur facility has taken all the necessary steps to comply with the EPA's accidental release prevention\nrequirements as set forth in 40 CFR part 68.  The following sections briefly describe the elements\nof the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nFarmers Union Oil Company maintains a detailed record of safety information that describes the\nchemical h"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43149,
      "SummaryText": "azards, operating parameters, and equipment designs associated with all processes\n(Appendix E).  In addition Farmers Union Oil Company holds regular Safety Meetings with\nemployees.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are\nidentified and controlled effectively.  Any findings from the hazard analysis are addressed in a timely\nmanner.\n\nOperating Procedures\nFarmers Union Oil Company maintains written operating procedures to ensure that activities within\nour covered processes are conducted safely.  These procedures address various modes of operation;\nthe information is regularly reviewed and is readily accessible to operators involved in the processes\n(Appendix B).\n\nTraining\nFarmers Union Oil Company has a comprehensive training program in place to ensure that\nemployees who are operating processes are competent in the operating procedures associated with\nthese processes.  \n\nMechanical Integrity\nFarmers Union Oil Company conducts documented maintenance checks on process equipment to\nensure proper operation.  Maintenance checks are conducted by qualified personnel with previous\ntraining in maintenance practices.  Examples of process equipment that would receive maintenance\nchecks include:  pressure vessels, storage tanks, piping systems, relief and vent systems, emergency\nshutdown systems, controls, and pumps.  Any equipment deficiencies identified by the maintenance\nchecks are corrected in a safe and timely manner (Appendix C).\n\nManagement of Change\nWritten procedures are in place at Farmers Union Oil Company to manage changes in process\nchemicals, technology, equipment, and procedures.  Process operators, maintenance personnel or\nother employees whose job tasks are affected by a modification in process conditions are promptly\nnotified of the modification and offered training to deal with it.\n\nPre-startup Reviews\nFarmers Union Oil Company routinely conducts pre-startup safety reviews rela"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43149,
      "SummaryText": "ted to new processes\nand modifications in established processes.  These reviews are conducted to confirm that\nconstruction, equipment, and operating and maintenance procedures are suitable for safe startup prior\nto placing equipment into operation.\n\nCompliance Audits\nFarmers Union Oil Company conducts compliance audits on a regular basis to determine whether\nthe plan's provisions, set out under the 40 CFR part 68, are being implemented.  Any non-compliance\nissue discovered during the audit is promptly corrected.\n\nEmployee Participation\nFarmers Union Oil Company truly believes that process safety management and accident prevention\nis a team effort.  Company employees are strongly encouraged to express their views concerning\naccident prevention issues and to recommend improvements.  In addition, our employees have access\nto all information created as part of the facility's implementation of the RMP, particularly\ninformation resulting from process hazard analyses.\n\n  5. Five-year Accident History\nFarmers Union Oil Company has had an excellent record of preventing accidental releases over the\nlast 5 years.  Due to our stringent release prevention policies, no accidental release has occurred\nduring this period.\n\n  6. Emergency Response Plan\nFarmers Union Oil Company maintains a written emergency action plan to deal with accidental\nreleases of hazardous materials.  The plan addresses all aspects of emergency response including first\naid and medical treatment, evacuations, and in the event of an accidental release, Farmers Union Oil\nCompany will contact local emergency response agencies and the public (Appendix A). Farmers\nUnion Oil Company maintains a written emergency action plan which is coordinated with the local\nfire department and the LEPC.  The plan is intended to assist responding agencies to address all\naspects of emergency response including first aid and medical treatment, evacuations, and\nnotification of local emergency response agencies and the public.\n\n  7.  "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43149,
      "SummaryText": "Planned Changes to Improve Safety\nWe will continue to provide our employees with ongoing annual training to ensure that they are\ncurrent with all of the safe ammonia transfer and handling procedures, and provide regular inspection\nand maintenance on all of the ammonia equipment.  Authorized personnel will make changes to the\nfacility if any audits of the facility identify non-compliance with Section 112 (r)(7), Accidental\nRelease Prevention Requirements of the Clean Air Act."
    }
  ]
}