{
  "FacilityID": 43244,
  "FacilityName": "Anton Caratan & Sons (New Cold Storage)",
  "FacilityStr1": "1625 Road 160",
  "FacilityStr2": null,
  "FacilityCity": "Delano",
  "FacilityState": "CA",
  "FacilityZipCode": "93215",
  "Facility4DigitZipExt": "9436",
  "FacilityCountyFIPS": "06107",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.820846",
  "FacilityLongDecDegs": "-119.211209",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9698382,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Anton Caratan",
  "OperatorStr1": "1625 Road 160",
  "OperatorStr2": null,
  "OperatorCity": "Delano",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93215",
  "OperatorZipCodeExt": "9436",
  "RMPContact": "Anton Caratan",
  "RMPTitle": "Owner",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000141955",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-06-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Cold Storage Facility",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-07-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-07-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-06-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-06-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 35.7989,
  "FRS_Long": -119.21467,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62203,
      "AltID": "ammonia refrigeration",
      "FacilityID": 43244,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 63660,
          "ProcessID": 62203,
          "NAICSCode": "115114",
          "_desc": {
            "NAICS_CODE": "115114",
            "NAICS_DESCRIPTION": "Postharvest Crop Activities (except Cotton Ginning)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 82119,
          "ProcessID": 62203,
          "ChemicalID": 56,
          "Quantity": 22500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 582119,
          "ProcessID": 62203,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43244,
      "SummaryText": "\nANTON CARATAN AND SON\n\n\n\nEXECUTIVE SUMMARY FOR AMMONIA REFRIGERATION SYSTEMS AND PROPANE FUELING OPERATION\n\n\n\n1.    Accidental Release Prevention and Emergency Response Policies:\n\nWe at Anton Caratan and Son are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n\n\n\n2.    The Stationary Source and the Regulated Substances Handled:\n\nOur facility's primary focus is on the cold storage of freshly-picked table grapes.  As such, the only regulated substance held at this facility is 22,500 pounds of anhydrous ammonia.\n\n\n\n3.    The Worst Case Release Scenarios and the Alternative Release Scenarios, including administrative controls and mitigation measures to limit the distances for each reported scenario:\n\nTo perform the offsite consequences for this facility, we used the EPA's RMPCOMP software to determine offsite consequences.\n\nWorst Case:\n\nOur worst-case scenario involves the rupture of the main reciever tank, which spills its entire 22,500 pound contents of anhydrous ammonia (in liquid form) over ten minutes.  The \"Circle of Death\" measures 1.8 miles in diameter, and represents a population total of 75 persons.  Mitigation measures in place put the release in an enclosed space, with direct contact with outside air.\n\nAlternative Scenario:\n\nOur chosen alternative scenario involves the loss of 1500 pounds of anhydrous ammonia through a leaky pipe, released at 150 pounds per minute for a duration of ten minutes. The toxic endpoint is 0.2 miles, with a total populatio of zero.\n\n\n\n\n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps:\n\nOur facility has taken all the nec"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43244,
      "SummaryText": "essary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\n\n\nProcess Safety Information:\n\nAnton Caratan and Son maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\n\n\nProcess Hazard Analysis:\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is What If/Checklist (combined) and HAZOP.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of every two years.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA/update was performed on 02/24/1999.\n\n\n\nOperating Procedures:\n\nFor the purposes of safely conducting activities within our covered processes, Anton Caratan and Son maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\n\n\nTraining:\n\nAnton Caratan and Son has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every year and more frequently as needed.\n\n\n\nMechanical Integrity:\n\nAnton Caratan and Son carries out highly documented maintenance check"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43244,
      "SummaryText": "s on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change:\n\nWritten procedures are in place at Anton Caratan and Son to manage changes in process chemicals, technology, equipment and procedures.  The most recent review/revision of maintenance procedures was performed on 06/07/2004.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\n\n\nPre-startup Reviews:\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Anton Caratan and Son. The most recent review was performed on 06/17/2004.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits:\n\nAnton Caratan and Son conduct audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The most recent compliance audit was conducted on 06/07/2004.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation:\n\nAnton Caratan and Son promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These invest"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43244,
      "SummaryText": "igations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\n\n\nEmployee Participation:\n\nAnton Caratan and Son truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\n\n\nContractors:\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Anton Caratan and Son has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n\n\n\n5.    Five-year Accident History:\n\nAnton Caratan and Son has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, we have not had an accidental release over the last five years.\n\n\n\n\n\n6.    Emergency Response Plan:\n\nAnton Caratan and Son carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\n\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly up"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 43244,
      "SummaryText": "dated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n\n7.    Planned Changes to Improve Safety:\n\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Periodic safety inspections and ongoing employee training are some of the major steps we want to take to improve safety at our facility.  These changes are expected to be implemented by September First, 2004.\n\n\n\n"
    }
  ]
}