{
  "FacilityID": 43261,
  "FacilityName": "Airgas Specialty Products Inc., Concord, NC",
  "FacilityStr1": "2200 Speedrail Court",
  "FacilityStr2": null,
  "FacilityCity": "Concord",
  "FacilityState": "NC",
  "FacilityZipCode": "28025",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37025",
  "LEPC": "Cabarrus County Emergency Mgt.",
  "FacilityLatDecDegs": "35.337789",
  "FacilityLongDecDegs": "-080.612744",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "airgasspecialtyproducts.com",
  "FacilityEmailAddress": "butch.johnson@airgas.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Airgas Specialty Products Inc.",
  "Company2Name": "Airgas Inc.",
  "CompanyDUNS": null,
  "Company2DUNS": 24492860,
  "OperatorName": "Airgas Specialty Products Inc.",
  "OperatorStr1": "6340 Sugarloaf Pkwy.",
  "OperatorStr2": "Suite 300",
  "OperatorCity": "Duluth",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30097",
  "OperatorZipCodeExt": null,
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000064949",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-01-11 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2005-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-07-05 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2005-07-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.5",
  "FRS_Lat": 35.33755,
  "FRS_Long": -80.61329,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "C04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62222,
      "AltID": "Ammonia Distribution",
      "FacilityID": 43261,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 82143,
          "ProcessID": 62222,
          "ChemicalID": 56,
          "Quantity": 950000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 82144,
          "ProcessID": 62222,
          "ChemicalID": 57,
          "Quantity": 250000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 63680,
          "ProcessID": 62222,
          "NAICSCode": "42469",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 36218,
              "Process_NAICS_ID": 63680,
              "SafetyReviewDate": "2002-09-16 00:00:00",
              "PHA_Date": "2005-07-10 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-06-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Water cannons and/or sprinkler/deluge",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Area and perimeter detection systems are in place",
              "OpProceduresReviewDate": "2004-01-13 00:00:00",
              "TrainingReviewDate": "2003-01-13 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer, Web based",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-01-16 00:00:00",
              "EquipmentInspectionDate": "2004-06-01 00:00:00",
              "EquipmentTested": "Presssure relief valves, emergency shutoff valves, hoses, eye wash/safety showers, etc.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-01-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2002-10-15 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-06-16 00:00:00",
              "HotWorkPermitReviewDate": "1999-01-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-01-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 52596,
                  "PreventionProgram3ID": 36218,
                  "ProcessChemicalID": 82143
                },
                {
                  "PrimaryKey": 52597,
                  "PreventionProgram3ID": 36218,
                  "ProcessChemicalID": 82144
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 43261,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-06-16 00:00:00",
    "ERTrainingDate": "2003-04-25 00:00:00",
    "CoordinatingAgencyName": "Harrisburg Volunteer FD",
    "CoordinatingAgencyPhone": "7044553574",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43261,
      "SummaryText": "Executive Summary for Airgas Specialty Products Inc.'s  Concord, NC Distribution Center\n\n1. Accidental Release Prevention and Emergency Action  Policies\nAirgas Specialty Products  Inc. is  committed to compliance with all laws and regulations and the safety of employees and the public as well as the protection of the environment. This commitment is demonstrated by a comprehensive ammonia release prevention program that includes areas such as system design, installation, operating procedures, maintenance procedures, security and a comprehensive employee training program associated with all ammonia processes. Airgas Specialty Products policy is for all facilities to meet ANSI K61.1 standards for Safety Requirements for The Storage and Handling of Anhydrous Ammonia.   Company policy also requires the  implementation of  appropriate controls to prevent  releases of ammonia to the atmosphere.  Airgas Specialty Products Inc. strives to prevent emergency situations, but maintains a current Emergency Action Plan to be prepared should an emergency situation develop.\n\n2. The Stationary Source and the Regulated Substances Handled\nThe primary business at the subject facility is the  Distribution of Anhydrous and Aqueous Ammonia.  Ammonia is not produced at the subject facility; rather it is received via rail as a liquefied compressed gas. Ammonia is stored in ASME code pressure vessels and the storage and handling system meets OSHA, EPA and ANSI K61.1 requirements.  Very little ammonia is released to the atmosphere at this facility.  Ammonia storage and transfer operations are accomplished in totally enclosed pressure systems designed to meet all code requirements.  \n\nPart of the anhydrous ammonia received at the facility is converted into aqueous ammonia solution (19.5% ammonia and 29.5% ammonia in water) on site.  The aqua ammonia operation and storage is also a totally enclosed system.  \n\nThe maximum inventory of Anhydrous Ammonia at this facility is 950,000 lb. while  the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43261,
      "SummaryText": "maximum inventory of Aqueous Ammonia (>20%) is 300,000 lb.  All product is shipped from the facility over the road in DOT approved cylinders or  vessels.\n\n3. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nAirgas Specialty Products Inc. has implemented the accidental release prevention requirements set forth in  40 CFR part 68 and Process Safety Management requirements set forth in 29 CFR 1910.119.  All Airgas Specialty Products facilities are constructed and operated in accord with AMERICAN NATIONAL STANDARD SAFETY REQUIREMENTS FOR THE STORAGE AND HANDLING OF ANHYDROUS AMMONIA (ANSI K61.1). The following sections briefly describe the elements of the release prevention program that is in place at the subject facility.\n\nProcess Safety Information\nAirgas Specialty Products Inc. maintains a detailed file of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all pertinent operations.\n\nProcess Hazard Analysis\nAirgas Specialty Products Inc.  conducts comprehensive Process Hazard Analysis studies to ensure that hazards associated with its operations are identified and controlled efficiently.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at intervals no less frequently than required by regulations (5-yr intervals), and even more frequently if needed.   Conclusions and recommendations of  the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nAirgas Specialty Products Inc. develops and maintains written operating procedures (SOPs) for all phases of ammonia related operations. These procedures address all modes of operation including, but not limited to,  initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and maintenance procedures. The procedures are reviewed annually and are readily available to"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43261,
      "SummaryText": "all operators involved in the ammonia operation.\n\nTraining\nAirgas Specialty Products Inc. has a comprehensive on-line training program coupled with on-the-job training to ensure that employees are competent to perform the operating procedures that they participate in. Refresher training is provided every three years and even more frequently if needed.\n\nMechanical Integrity\nAirgas Specialty Products Inc. performs documented mechanical integrity checks on process equipment to ensure proper and safe operations. Process equipment examined by these checks includes (but is not limited to); pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Maintenance operations are carried out by qualified personnel with previous training in pertinent maintenance practices.  Specialized training is also provided to maintenance personnel as needed. All identified equipment deficiencies  are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Airgas Specialty Products Inc. to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.  The Management of Change process helps insure that proper parts and equipment are always used in operations. \n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a standard practice at Airgas Specialty Products Inc. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nAirgas Specialty Products Inc. conducts routine audits  to determine/confirm compliance with PSM / RMP regulations. The most recen"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 43261,
      "SummaryText": "ia occur.\n\n\n5. Five-year Accident History\nAirgas Specialty Products Inc. has an excellent record of preventing  releases of ammonia to the atmosphere. Due to our stringent release prevention policies, the number of accidental releases has been reduced to a minimum.  The Concord, NC facility has not had any RMP defined accidents in the past five years.  In addition, there have not been any ammonia releases with offsite consequences. \n                                                                                                                           \n6. Emergency Action Plan\nAirgas Specialty Products Inc. has a written Emergency Action Plan to deal with accidental releases of anhydrous ammonia and aqua ammonia (the only hazardous chemicals onsite). The plan includes procedures for informing all onsite personnel, notification of emergency response agencies and neighbors.  It also includes suggested personal protective equipment, evacuation procedures, emergency shutdown procedures, and post-incident recovery procedures. \n\nCopies of the Emergency Action Plan have been supplied to the Cabarrus County Emergency Management Agency (LEPC) and to the Harrisburg, NC Fire Department. \n\n7. Safety Features \nSafety features in place at the Concord, NC facility include:  A number of security features are in place to prevent acts by vandals and criminals.  All vessels are equipped with pressure relief valves. Emergency shut-down valves and switces are in place, electronic ammonia leak detectors are installed at strategic locations and water cannons and fog nozzles are readily available for use in emergencies."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43261,
      "SummaryText": "t comliance audit was conducted on 10-15-2002.  These audits are conducted at least every 3 years and any corrective actions required are undertaken in a safe and timely manner.   \n\nIncident Investigation\nAirgas Specialty Products Inc. promptly investigates incidents that  resulted in, or could reasonably result in, the release of ammonia to the atmosphere or human injury. The investigations are undertaken to identify situations contributing to the incident, and to identify corrective actions needed to prevent similar events  from reoccurring. All reports are retained for a minimum of 5 years.  The Concord facility has not had an incident in the past five years that triggered an incident investigation.\n\nEmployee Participation\nAirgas Specialty Products Inc. believes that Process Safety Management and accident prevention is a team effort. All employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, all employees have access to all information created as part of the facility's implementation of Process Safety Management and  Risk Management Plan regulations, including information resulting from process hazard analyses in particular.  Airgas Specialty Products' Concord employees participate in Process Hazard Analyses (PHAs) and Standard Operating Procedures (SOPs) reviews.\n\nContractors\nOn very few occasions, Airgas Specialty Products employs contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. Airgas Specialty Products Inc. has a strict policy of informing the contractors of known potential hazards related to the contractor's work. Relevant Material Safety Data Sheets are made available to and reviewed with contractors and their onsite workers.  Contractors are also informed of all the procedures for emergency response should an accidental release of a ammon"
    }
  ]
}