{
  "FacilityID": 43319,
  "FacilityName": "Henningsen Cold Storage-Richland Washington",
  "FacilityStr1": "2025 Saint St.",
  "FacilityStr2": null,
  "FacilityCity": "Richland",
  "FacilityState": "WA",
  "FacilityZipCode": "99354",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53005",
  "LEPC": "Benton County LEPC",
  "FacilityLatDecDegs": "46.309460",
  "FacilityLongDecDegs": "-119.297410",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.henningsen.com",
  "FacilityEmailAddress": "paul@henningsen.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Henningsen Cold Storage",
  "Company2Name": null,
  "CompanyDUNS": 7873243,
  "Company2DUNS": 0,
  "OperatorName": "Paul Henningsen",
  "OperatorStr1": "2025 Saint St.",
  "OperatorStr2": null,
  "OperatorCity": "Richland",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "99354",
  "OperatorZipCodeExt": null,
  "RMPContact": "Paul Henningsen",
  "RMPTitle": "Director Engineering Development",
  "FTE": 29,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000192463",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-06-21 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-07-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-07-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2008-12-16 00:00:00",
  "DeRegistrationEffectiveDate": "2005-07-13 00:00:00",
  "AnniversaryDate": "2010-07-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility never had regulated substance above Threshold Quantity",
  "_processes": [
    {
      "ProcessID": 62297,
      "AltID": null,
      "FacilityID": 43319,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 63756,
          "ProcessID": 62297,
          "NAICSCode": "532299",
          "_desc": {
            "NAICS_CODE": "532299",
            "NAICS_DESCRIPTION": "All Other Consumer Goods Rental"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 82261,
          "ProcessID": 62297,
          "ChemicalID": 56,
          "Quantity": 8400.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 582261,
          "ProcessID": 62297,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43319,
      "SummaryText": "The accidental release prevention and emergency response policies at facility:\nThe major objective of Henningsen Cold Storage (HCS) is to prevent unwanted releases of hazardous chemicals especially into locations, which could expose employees and others to serious hazards. An effective safety program requires a systematic approach to evaluating the entire process. Using this approach, the process design, process technology, operational and maintenance activities and procedures, non-routine activities and procedures, emergency preparedness plans and procedures, training programs, and other elements which impact the facility are all considered in the evaluation. The various lines of defense that have been incorporated into the design and operation of the process to prevent or mitigate the release of hazardous chemicals are evaluated and strengthened to assure their effectiveness at each level.  \n\nSenior management is extremely committed to safety and implementation of safe procedures.  Through their support and dedication changes such as policies, procedures, equipment design and replacement, have been installed and/or implemented throughout the company.  \n\nHCS values employees and their input.  Employee participation provides a cooperative participatory environment.  Employee participation presents the necessary flow of information from management to employees and from employees to management.  Management encourages a participatory work environment by visiting the facility, talking with employees, auditing, addressing audit recommendations and demonstrating through example and policy that they are committed to the employees at HCS.   \n\nA solid safety program married with a dedicated senior management staff aids in the prevention and mitigation of episodic chemical releases that could lead to a catastrophe in the workplace or surrounding community. To control these types of hazards, HCS is confident that they have the necessary expertise, experience, judgment and proa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43319,
      "SummaryText": "ctive initiative within the workforce to properly implement and maintain an effective safety program as envisioned in the both the OSHA 1910.119 and EPA Part 68 standards.  \n\nFacility Description and regulated substances handled: \nThe HCS, Gresham Oregon facility is a public refrigerated warehouse. Currently, outdoor operations at the site include product loading and unloading and vehicle parking.  Indoor operations include freezing and refrigerated storage of product from customers.  Anhydrous ammonia (a regulated substance) is used in the refrigeration process.\n\nAccidental release prevention program and chemical-specific prevention steps: \nThe HCS, Gresham facility is regulated by the OSHA 1910.119 Process Safety Management (PSM) and EPA Part 68-Chemical Accident Prevention Provisions (RMP) programs.  HCS employs a LOGIX computer control system of the refrigeration process.  The LOGIX system is configured to ensure that all refrigeration components are operating within their prescribed operating specifications.  It sounds an alarm if a component is not operating within its limits and notifies the Engineers.  It archives daily logs of the operating conditions as well.  The Chief Engineer or Engineer also maintains daily, weekly, and monthly operating records of the equipment.  Records are maintained and reviewed by the Director of Corporate Development and Engineering (DOCDE).  \n\nContinued documented maintenance of the equipment and annual inspections enhance the PSM and RMP programs.  HCS believes that taking a proactive approach to preventative maintenance ensures efficiency and safety. \nEngineers are specifically trained on the refrigeration system, the hazards associated with it, and their specific job tasks in regard to the process.  They are provided with renewal training in the following tradition: as needed, annually, biennial, or every three years as deemed by the DOCDE.  \n\nFive year accident history: \nThe HCS, Gresham facility has had no reportable offsit"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43319,
      "SummaryText": "e incidents during the past five years. \n\nEmergency Response Program: \nThe HCS emergency response program states that HCS employees are to take action only during an emergency.  Drills are scheduled at the facility with the local emergency responding agency.  Public notification is made through the DOCDE, the General Manager, or designee.  An Emergency Action Plan has been developed, employees have been trained, and it has been implemented by the facility.  Several ammonia detection alarms are located throughout the facility.   If an unintentional release occurs the alarms sound alerting employees.  The alarming system also notifies the Chief Engineer/Engineer over 100 parts per million, at which time they immediately take action to locate where the detection took place.  \n\nPlanned changes to improve safety: \nHCS is committed to continued safety for personnel, facility, products, and off-site neighbors by; conducting employee orientation safety training, regular employee safety committee meetings, scheduling job specific training seminars and classes for employees, conducting and proceeding with recommendations from a process hazard analysis, implementing a five-year valve replacement program, upgrading equipment and technology and, annual review and certification of existing safety programs.  HCS believes that continued safety success is measured by employee?s increased knowledge and understanding of the work environment."
    }
  ]
}