{
  "FacilityID": 4334,
  "FacilityName": "City of Fayetteville Water Facilities",
  "FacilityStr1": "Manasass Mile Road",
  "FacilityStr2": null,
  "FacilityCity": "Fayetteville",
  "FacilityState": "GA",
  "FacilityZipCode": "30214",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13113",
  "LEPC": null,
  "FacilityLatDecDegs": "33.429972",
  "FacilityLongDecDegs": "-84.481222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Fayetteville",
  "OperatorStr1": "P.O. Box 1258",
  "OperatorStr2": null,
  "OperatorCity": "Fayetteville",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30214",
  "OperatorZipCodeExt": null,
  "RMPContact": "Rick Eastin",
  "RMPTitle": "Director--Water & Sewer Department",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000054157",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 33.42989,
  "FRS_Long": -84.48153,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5060,
      "AltID": "WWTP Chlorine Storage",
      "FacilityID": 4334,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5169,
          "ProcessID": 5060,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5417,
          "ProcessID": 5060,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505417,
          "ProcessID": 5060,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 5061,
      "AltID": "Water Treatement Chlorine",
      "FacilityID": 4334,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5170,
          "ProcessID": 5061,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5418,
          "ProcessID": 5061,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505418,
          "ProcessID": 5061,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4334,
      "SummaryText": "The Risk Management Program (RMP) promulgated under the Clean Air Act [Section 112(r)] requires facilities that store certain chemicals in excess of a certain threshold amount to prepare a comprehensive Risk Management Plan.  The RMP guidelines require facilities to evaluate the consequences of certain accidents involving hazardous chemicals, to prepare a comprehensive program to prevent accidental releases, and to have an emergency response program for taking action in the event of a release.\n\nProcess Determination\nWater treatment for the City of Fayetteville is provided by two separate facilities, located adjacent each other at the termination of Manassas Mile Road (southwest of downtown Fayetteville).  The facilities include the Fayetteville Wastewater Treatment Plant and Drinking Water Treatment Plant.  The City of Fayetteville facilities have two \"Processes\" subject to U.S. EPA's Risk Management Program regulations.\n\nThe Processes at the City of Fayetteville facilities subject to the RMP requirements include:\n\n7 Chlorine Storage, Wastewater Facility (used to treat wastewater effluent)\n7 Chlorine Storage, Water Treatment Facility (used for chlorination of potable water)\n\nEach Process includes the storage of 8,000 pounds of chlorine in four one-ton cylinders.  Each Process includes storage of the cylinders inside a concrete block building; use of the chlorine is regulated by a series of piping and valves controlled by facility staff.\n\nProgram Level Determination\nEPA has divided the RMP into three levels.  Program Level 1 is the most streamlined RMP and requires the least documentation.  Program Level 2 requires more documentation; most additional requirements concern the evaluation of offsite consequences of potential substance releases and documentation of an accident prevention program.  Program Level 3 is the most stringent RMP and requires much greater documentation of facility operations and hazardous substance procedures.\n\nA process is eligible for Program "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4334,
      "SummaryText": "Level 1 if the facility worst-case release (defined below) does not impact any public receptors and all processes have been accident free for a period of five years.  A process must comply with Program Level 3 requirements if it is part of a certain industry (e.g., petroleum refining, chemical manufacturing) or is subject to the Occupational Safety and Health Administration's (OSHA's) Process Safety Management (PSM) rules.  Program Level 2 is applicable to processes that do not meet the criteria for either Program Level 1 or Program Level 3.\n\nOnce the RMP-applicable processes were determined, a preliminary off-site consequence analysis (OCA) was performed to determine the maximum distance to the applicable process endpoint.  The OCA was performed using EPA's Risk Management Program Guidance for Wastewaster Treatment Plants (WWTP Guidance, October 1998).  This document provides standard \"Look-Up tables\" for different accident scenarios.  The results of this evaluation were used to determine the applicable Program Level for each process (either Program Level 1 or Program Level 2 for facilities located in Georgia).  The Program Levels for the above-referenced processes are discussed below:\n\nProcess 1--Wastewater Effluent Chlorine Treatment\nThe process includes 8,000 pounds of compress chlorine gas; the  EPA threshold for chlorine is 2500 pounds.  The chlorine used onsite does exceed the RMP threshold quantity limit.  There have been no documented accidental releases of chlorine in the storage area that meet definitions promulgated in the RMP.  However, a worst-case scenario release from the aggregate cylinders would likely impact nearby public receptors (including primary residences, businesses, and schools).  Accordingly, this process does not qualify for Program Level 1.  Program Level 3 is precluded, as Georgia facilities are regulated by state standards rather than delegated OSHA PSM requirements (29 CFR 1910.119).  As such, the chlorine disinfection process at the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4334,
      "SummaryText": " Fayetteville wastewater treatment facility is a Program Level 2 process.\n\nProcess 2--Drinking Water Chlorine\nThe process includes 8,000 pounds of compress chlorine gas; the  EPA threshold for chlorine is 2500 pounds.  The chlorine used onsite does exceed the RMP threshold quantity limit.  There have been no documented accidental releases of chlorine in the storage area that meet definitions promulgated in the RMP.  However, a worst-case scenario release from the aggregate cylinders would likely impact nearby public receptors.  Accordingly, this process does not qualify for Program Level 1.  Program Level 3 is precluded, as Georgia facilities are regulated by state standards rather than delegated OSHA PSM requirements.  As such, the chlorine purification process at the Fayetteville drinking water treatment facility is a Program Level 2 process.\n\nFive-Year Accident History\nThe RMP regulations require facilities to compile a five-year accident history. This is defined as \"all accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage\" (40 CFR 68.42).  \n\nThe City of Fayetteville has had no accidents or incidents from the covered Processes within the last five years that meet the above definition.\n\nWorst-Case Scenario Release\nThe RMP regulations require the modeling of a \"worst-case\" release of a toxic substance at a given facility.  The regulations define a worst-case scenario (WCS) as \". . .the release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to an endpoint defined in Section 68.22(a)\" (40 CFR 68.3).  For chlorine, the worst-case toxic endpoint is 0.0087 mg/L.  \n\nBoth processes at the Fayetteville facilities include 2,000-pound cylinders.  According to the WWTP Guidance, the chlorine WCS assumes complete release of a c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4334,
      "SummaryText": "ompressed gas from the largest containment vessel utilized in the process.  For the purposes of this modeling, the WCS would be a breach in the chlorine cylinder during loading or switchout operations (i.e., exposed to the ambient environment outside the storage buildings).  Releases are assumed to take place linearly in a space of 10 minutes.  For a 2,000 pound cylinder, this release rate equates to 200 pounds per minute.  Using the WWTP Lookup Table, the toxic endpoint for a 200 pounds per minute release is 3.0 miles.  The endpoint for both Process 1 (Wastewater Treatment) and Process 2 (Drinking Water Chlorine Purification) are identical under the WCS, given the identical nature of storage vessels for the two processes.  Since the facilities are located near a populated area, the toxic cloud formed by the chlorine release would reach offsite endpoints and public receptors.\n\nThe WCS is extremely unlikely to occur at the Fayetteville facilities.  Chlorine loading and switchout is undertaken by trained staff; either chlorine cylinder suppliers or Fayetteville facility managers.  All employees handling cylinders during loading, unloading, or switchout procedures are trained on proper chlorine procedures and emergency response.  The chlorine cylinders themselves are constructed of steel, and are completely sealed until activation of a chlorine release valve.  A magnetic lift is utilized during loading and unloading operations to minimize the opportunity for human error.  Switchout of chlorine cylinders takes place only a few times a year.\n\nAlternative Release Scenario\nUnder Program Level 2, each RMP process must be subjected to an alternative release scenario (ARS) analysis.  ARS analysis generally includes \"more likely\" scenarios of chemical release.  Calculation of accident probabilities is not necessary under the rule.  One ARS for each toxic chemical process must be included in RMP analysis. \n\nProcess 1--Wastewater Chlorine Treatment\nIn accordance with the EPA Gui"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4334,
      "SummaryText": "dance for Wastewater Treatment Facilities, Radian chose to evaluate a breach in the actual chlorine storage cylinder.  This evaluation scenario is likely the ARS with the largest potential impact from Process 1.  This scenario assumes that the storage cylinder is compromised during handling, loading, or operational procedures.  Such a scenario could occur from faulty cylinders, catastrophic breach during loading/unloading, blown pressure gauges, and other events. This breach in the cylinder integrity would result in the release of both liquid chlorine (storage form) and chlorine gas (vapor flash upon contact with exterior atmosphere).  The great majority of the release would be in the form of chlorine gas and extremely fine liquid droplets.  For purposes of this analysis, a 3/16 inch hole in the storage cylinder was assumed.  The ARS assumes that the release would proceed uninterrupted until the entire quantity of one vessel is spent (based upon the following calculations, approximately 23 minutes).  The rate of release in this ARS is approximately 87 pounds/minute.\n\nARS calculations may also take into account active and passive mitigation measures in place for a given Process.  For Process 1, passive mitigation measures exist in the status quo.  All operational cylinders are inside a concrete block building that would likely provide passive containment in the event of a leak. \nThe RMP Offsite Consequence Analysis Guidance provides a simple building release rate multiplicative factor of 55 percent for toxic gases in alternative release scenarios (i.e., the predicted rate of release is 55 percent of that for the same accident occurring outdoors).  For the ARS in Process 1, the release rate would equate to 48 pounds/minute.  The toxic endpoint for this release in a Rural setting is 0.3 miles, or approximately 1584 feet.  Public receptors are located within this radius, including private residences.  Accordingly, the ARS for Process 1 does implicate offsite receptors, "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 4334,
      "SummaryText": "as required under the Rule.\n\n Process 2--Drinking Water Chlorine\nFor Process 2, a different type of ARS was investigated.  A potential release event in chlorine distribution areas occurs when the cylinder release valve is sheared away, producing a breach in the container integrity.  Such a valve shear can occur during loading and unloading activities, coupling/decoupling operations, or from cylinder displacement.  This ARS would produce a choked release of vapor (i.e., emerging at the speed of sound from the shear hole).  \n\nFor purposes of analysis, the Process 2 ARS was assumed to take place during unloading activities.  These activities expose the chlorine cylinders to the ambient outdoor environment.  A shearing of the cylinder valve during unloading activities for a 2,000-pound chlorine tank would produce a hole approximately 5/16 of an inch in diameter.  Accordingly, the release rate for the ARS equates to 15 pounds/minute release.\n\nUsing the Lookup tables provided in the WWTP Guidance, a release rate of 15 pounds/minute has a toxic endpoint of 0.2 miles (1056 feet) in a rural setting.  Under the ARS, the storage building used for cylinder containment would not function as a mitigation measure.  This ARS would implicate public receptors in the general vicinity of the Water treatment plant, including private residences.\n\nFor both Alternative Release Scenarios, several measures are in place at the Fayetteville facilities that would mitigate against uncontrolled release of chlorine gas.  Chlorine release cylinders are sealed until the dispersion system is activated, making the shearing or other disturbance of a release valve unlikely.  All operations of an active chlorine dispersal system take place inside a concrete building, which would contain the chlorine gas in the event of a release.  Ambient chlorine sensors are attached to both dispersal systems; cylinder and valve \"patch kits\" are also located adjacent the cylinder storage areas for both facilities.  The "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 4334,
      "SummaryText": "Water Treatment facility has an automatic shutoff system in place, which activates when a pressure drop occurs in any portion of the chlorine delivery system.  The shutoff system takes less than 2 seconds to sense a pressure drop and seal the chlorine cylinder.  A version of this shutoff system is scheduled for installation at the Wastewater Treatment facility within the next year.  Numerous active systems, including sprinklers and air routing vents, would also reduce the potential migration of chlorine gas in the event of a release. \n\nAccident Prevention Policy\nThe City of Fayetteville is committed to providing essential municipal water treatment and supply services while avoiding accidents associated with hazardous chemical storage and use.  The Fayetteville facilities have outlined operating and safety procedures in the Operations and Maintenance Manuals for each plant.  Facility staff are trained at the outset of their service in proper chlorine handling, use, and emergency issues.  Safety procedures are outlined for the following activities:\n\n7 Initial Startup Activities;\n7 Normal operations;\n7 Temporary Operations;\n7 Normal Shutdown Procedures; and\n7 Emergency Shutdown Procedures.\n\nIn addition to initial employee training, the City of Fayetteville conducts refresher training and competency testing for each staff member assisting in chlorine-related operations.  Regular equipment maintenance (including documentation) occurs at each Fayetteville facility to further reduce the likelihood of accidents.\n\nEmergency Response Plan\nThe Fayetteville water facilities have an Emergency Response Plan (ERP) in place regarding both small and large chlorine release scenarios.  Each is outlined in detail during initial employee training and the subject of occasional exercises to test staff competency and efficiency in implementing the ERP.  Small release scenarios would generally be contained onsite by facility staff.  Each staff member is trained in the use of Self-Contained "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 4334,
      "SummaryText": "Breathing Apparatus (SCBA) and emergency alert procedures.  Large scale releases would generally be addressed by the Fayette County Fire Department and other emergency assistance agencies.  The Fire Department would assist in local notification and evacuation procedures in the event of a catastrophic chlorine gas release.  \n\nContinuing Safety Upgrade Efforts\nThe City of Fayetteville continually reviews safety procedures at the water facilities to improve safety conditions and procedures.  The following policy and technological changes are slated for the facilities in the next year:\n\n7 Installation, testing, and operation of automatic shut-off system for wastewater treatment plant\n7 Real-time exercises to test employee knowledge and response under emergency scenarios\n7 Annual refresher training on SCBA equipment\n7 Acquisition of additional short-term breathing devices for both facilities\n\nAdditional safety training and/or policies will be instituted for each facility as necessary given staff or equipment changes."
    }
  ]
}