{
  "FacilityID": 43398,
  "FacilityName": "Cameron Parish Water and Wastewater District #1",
  "FacilityStr1": "373 Davis Road",
  "FacilityStr2": null,
  "FacilityCity": "Cameron",
  "FacilityState": "LA",
  "FacilityZipCode": "70631",
  "Facility4DigitZipExt": "0960",
  "FacilityCountyFIPS": "22023",
  "LEPC": "Cameron Parish LEPC",
  "FacilityLatDecDegs": "29.782889",
  "FacilityLongDecDegs": "-093.310861",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I7",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Cameron Parish Police Jury",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Cameron Parish Water and Wastewater",
  "OperatorStr1": "P.O. Box 960",
  "OperatorStr2": null,
  "OperatorCity": "Cameron",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70631",
  "OperatorZipCodeExt": "0960",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000163191",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-09-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2005-07-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-07-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2005-07-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-02-12 00:00:00",
  "DeRegistrationEffectiveDate": "2009-02-03 00:00:00",
  "AnniversaryDate": "2010-07-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.6",
  "FRS_Lat": 29.775958,
  "FRS_Long": -93.339405,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R06",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62429,
      "AltID": "Sewage Treatment",
      "FacilityID": 43398,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 82443,
          "ProcessID": 62429,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 63893,
          "ProcessID": 62429,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 23302,
              "Process_NAICS_ID": 63893,
              "SafetyReviewDate": "2005-05-31 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "Yes",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2005-02-25 00:00:00",
              "ChangeCompletionDate": "2005-02-25 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2005-03-25 00:00:00",
              "TrainingReviewDate": "2004-08-04 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2005-01-18 00:00:00",
              "EquipmentInspectionDate": "2005-06-15 00:00:00",
              "EquipmentTested": "chlorinator system",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 24363,
                  "PreventionProgram2ID": 23302,
                  "ProcessChemicalID": 82443
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 43398,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2005-05-31 00:00:00",
    "ERTrainingDate": "2005-05-31 00:00:00",
    "CoordinatingAgencyName": "Cameron Parish OEP",
    "CoordinatingAgencyPhone": "3377755555",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 43398,
      "SummaryText": "repair kits.  We have an emergency chlorine safety procedure that provides the appropriate procedures for notification of all areas in case of a release as well as proper notification of state and local agencies as required.  We will provide all information developed for emergency response to the Office of Emergency Preparedness in Cameron Parish,  Our personnel will be trained to assist the fire department personnel as needed and requested.\nF.Planned Changes to Improve Safety\nWe plan to provide more in-depth training on the risks and hazards of chlorine at our facility.  We plan on running a newspaper article once a year to notify the community of the possible hazards associated with chlorine at the oxidation ponds.  We also plan to provide a windsock at the location where the chlorine is located."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43398,
      "SummaryText": "d with the chlorine processs, and reporting requirements in case of a release.  We schedule chlorine safety meetings on a yearly basis.\nMaintenance-Cameron Parish Wastewater System has developed a daily checklist for chlorine safety with a space provided to suggest repair and replacement information on its chlorination equipment. Inspections of the chlorine feed system are performed on a daily basis to determine if any changes need to be made to our maintenance procedures and information.  Qualified personnel carry out maintenance operations with training in maintenance practices.  Manufacturer's manuals on all equipment are kept on file for review as needed.\nCompliance Audits-Audits of our system are performed at a minimum of every three years.\nIncident Investigations-Cameron Parish Wastewater System will promptly investigate any known incident that has resulted in, or could reasonably result in a release of a regulated substance.  An investigation will be done to determine the situation that led to the incident, as well as any corrective actions to prevent the release from reoccurring. All reports will be retained for a minimum of five years.\nD. The Five Year Accident History\nThe Cameron Parish Wastewater Oxidation System have had and excellent record of preventing accidental releases of chlorine over the last five years.  Due to safety and release prevention policies, there has been no accidental releases during this period.\nE.Emergency Response Program\nThe Cameron Parish Volunteer Fire Department will be the first responders to any regulated release of chlorine. We have coordinated our emergency response program with the fire department and the Office of Emergency Preparedness through their office.  We have met with officials from both departments to provide complete information on the location and inventory of chlorine at our facility.  We have planned training for their personnel at our facilities to give them hands on training in the use of the 1-ton cylinder"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 43398,
      "SummaryText": "A. Accidental Release Prevention and Emergency Response Policies\nThe Cameron Parish Water and Wastewater System are committed to employee, public and environmental safety.  We are aware that the use of our treatment chemical could pose a risk to the public under certain circimstances.  We therefore are committed to the development of a comprehensive risk management program for the Cameron Parish wastewater facility.  The program will address areas such as operating procedures, maintenance, and employee training associated with the chlorine processes at our facilities.  Safety depends upon the manner in which we handle and operate the regulated process.  The safety of the vacuum operated chlorination system combined with safe handling procedures make the use of chlorine a reliable process.  Ongoing training programs of our personnel will make the use of chlorine even safer for our employees and the surounding community.  It is our policy to implement any appropriate controls to prevent possible releases of chlorine gas.  If such a release does occur, we have met with and coordinated our release planning with the Cameron Volunteer Fire Department and the Office of Emergency Preparedness which provides highly trained emergency response personnel to control and mitigate the effects of a release.\nB. The Stationary Source and the Regulated Substance Handled\nCameron Parish Wastewater Facility's primary purpose is the treatment and disinfection of wastewater.  We have one regulated substance at the facility.  Chlorine gas is used in the treatment process as the primary disinfectant to inhibit microbial growth.  Chlorine 1-ton cylinders are delivered to the facility on a regular basis and off loaded and stored for use.  There are normally two 1-ton cylinders on the property at the same time.  Only authorized and trained personnel perform maintenance on or operate the regulated process.\nC. The General Accidental Release Prevention Program and the Chemical Specific Prevention"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43398,
      "SummaryText": "Steps\nOur facility has taken all the necessary steps to comply with all accidental release prevention requirements.  The facility was designed and built in several phases during the time period of 1969-1971 in accordance with all applicable standards in place at the time and the pond was upgraded in 1980-1981 from a single cell pond to a three cell pond.  We file Tier II forms for chlorine for our facility on a yearly basis.\nProcess Safety Information- The Cameron Parish Wastewater system maintains a record of safety information that describes the chemical and physical hazards of chlorine.  We also compile and develop operating manuals and equipment design information associated with all aspects of the process.\nProcess Hazard Review-Our facility conducts studies to ensure that the hazards associated with our chlorine process are identified and any deficiencies corrected.  We use a checklist developed for our chlorine system to site specific.  Qualified personnel knowledgeable in design and safety practices perform the hazard reviews.  The review of hazards is designed to be updated on a yearly basis or upon changes to the process.  Any deficiencies are to be addressed in a timely manner.\nOperating Procedures-For the purpose of safely conducting activites within our covered processes, Cameron Parish Wastewater System develops and maintains operating procedures.  We address various modes of operation, such as start-up, normal operations, emergency operations and shut down, and normal shutdwon.  Complete training is given to all personnel on these procedures.  The procedures will be reviewed and updated on an ongoing basis.\nTraining-The Cameron Parish Wastewater System has developed training information that covers items such as unloading of 1-Ton cylinders, storage of 1-ton cylinders, installing the chlorinators on a container, general parts used in the chlorination system, general operation of the chlorination system, maintenance of chlorine system, hazards associate"
    }
  ]
}