{
  "FacilityID": 43407,
  "FacilityName": "Bar-S Foods Co. - Lawton Plant",
  "FacilityStr1": "802 SW Goodyear Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Lawton",
  "FacilityState": "OK",
  "FacilityZipCode": "73505",
  "Facility4DigitZipExt": "9797",
  "FacilityCountyFIPS": "40031",
  "LEPC": "Comanche County LEPC",
  "FacilityLatDecDegs": "34.599722",
  "FacilityLongDecDegs": "-098.512222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.bar-s.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 48804504,
  "ParentCompanyName": "Bar-S Foods Co.",
  "Company2Name": null,
  "CompanyDUNS": 48804504,
  "Company2DUNS": 0,
  "OperatorName": "Bar-S Foods Co.",
  "OperatorStr1": "4041 N. Central Avenue, Suite 1300",
  "OperatorStr2": null,
  "OperatorCity": "Phoenix",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85038",
  "OperatorZipCodeExt": "9049",
  "RMPContact": "Chris Christianson",
  "RMPTitle": "Director of Engineering",
  "FTE": 305,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000134115",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-05-14 00:00:00",
  "SafetyInspectionBy": "PIHS, Inc.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-07-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-07-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-07-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-07-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 34.59833,
  "FRS_Long": -98.51006,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62438,
      "AltID": null,
      "FacilityID": 43407,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 63902,
          "ProcessID": 62438,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 82452,
          "ProcessID": 62438,
          "ChemicalID": 56,
          "Quantity": 35000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 582452,
          "ProcessID": 62438,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43407,
      "SummaryText": "RMP Executive Summary\n\n1.0  Accidental Release Prevention and Emergency Response Policies at Bar S Foods, Lawton Division.\n\nBar S Foods, Lawton Division prevents accidental releases through classroom and on the job training of refrigeration personnel and ongoing inspection and maintenance of the refrigeration system.  Refrigeration system components are located in areas that are not as likely to become damaged (i.e., tanks and pipe runs are placed away and protected from forklift and truck traffic). The facility maintains an ongoing emergency response program that prepares for safe evacuation and timely response by trained personnel.\n\n2.0  Bar S Foods, Lawton and Anhydrous Ammonia.\n\nBar S Foods, Lawton processes and freezes meat products for global distribution. Approximately 35,000 lbs. of anhydrous ammonia is contained within the refrigeration system on site at Bar S Foods, Lawton. A Risk Management Plan has been developed as required and is maintained in order to reduce the possibility of an accidental release of ammonia from the system. \n\n3.0  Accidental Release Prevention Program and Prevention Steps.\n\nBar S Foods, Lawton complies with all rules and regulations that pertain to the safe storage and use of anhydrous ammonia. Specific regulations include: OSHA Process Safety Management (PSM) rule; OSHA Hazardous Waste Operations and Emergency Response (HAZWOPER); OSHA Hazard Communication (HAZCOM); OSHA Employee Emergency Plans and Fire Prevention Plans; EPA Risk Management Plans (RMP); IIAR Guidelines. \n\nSpecific prevention steps that have been implemented to increase the safety of operation of the ammonia refrigeration system include:\n \n?Annual operator refresher training\n?Routine preventative maintenance\n?Refrigeration system repairs made in a prompt, safe manner\n?Labeling of ammonia system pipes and components\n?Safe work practices followed\n\n4.0  Five Year Accident History.\n\nNo releases or accidents, involving anhydrous ammonia, that are reportable in accordanc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43407,
      "SummaryText": "e with 40 CFR Part 68 (RMP Rule), have occurred at this facility within the last five (5) years. \n\n5.0  Bar S Foods, Lawton Emergency Response Program.\n\nBar S Foods, Lawton maintains an ongoing emergency response program in order to efficiently notify and evacuate employees, notify potential critical receptors in the community and state and local emergency response agencies. The program includes initial and annual training for  employees who respond to releases or potential releases. The program includes written procedures for proper first aid and emergency medical treatment to treat human exposures; procedures for using emergency response equipment and procedures to review and update the plan and ensure that employees are informed of changes. The facility emergency response plan is coordinated with the local fire department annually as required by the Emergency Planning and Community Right to Know Act.\n\nRed Cross shelter resources in the area consist of pre-arranged service agreements with local schools and churches. Facilities that would serve as a Red Cross shelter would have food, cots, and first aid supplies on site and reserve supplies would be shipped in. The Fire Department or Police Chief would activate the Red Cross if they are needed and would arrive within two hours with the emergency vehicles. They are able to provide first aid, refreshments, and clean clothing for emergency response workers. The Fire or Police Chief would decide if sheltering in place, evacuation, sheltering off site is required in a given emergency. If evacuation were needed, the Red Cross would then activate the shelter(s) determined to be located at a safe distance from the hot area. Those in need of medical attention would be taken to a nearby hospital.   \n\n6.0  Planned Changes to Improve Safety at Bar S Foods, Lawton.\n\nFuture plans to improve anhydrous ammonia refrigeration system safety at Bar S Foods, Lawton include:\n\n?Annual coordination of the emergency response plan with the "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43407,
      "SummaryText": "Fire Department and HAZMAT team.\n?Annual Hazardous Materials Technician and Incident Commander training.\n?Improving PSM program elements on an ongoing basis.\n?Purchase of CCTV for site security.\n?Hiring of an additional refrigeration technician.\n?On going RETA training for refrigeration technicians."
    }
  ]
}