{
  "FacilityID": 4341,
  "FacilityName": "City of Largo Water Reclamation Facility",
  "FacilityStr1": "5100 150th. Avenue North",
  "FacilityStr2": null,
  "FacilityCity": "Clearwater",
  "FacilityState": "FL",
  "FacilityZipCode": "33760",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12103",
  "LEPC": "District 8 LEPC",
  "FacilityLatDecDegs": "27.905556",
  "FacilityLongDecDegs": "-82.705556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": "www.largo.com",
  "FacilityEmailAddress": "jcarlini@largo.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Largo",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Largo",
  "OperatorStr1": "P.O. Box 296",
  "OperatorStr2": null,
  "OperatorCity": "Largo",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33779",
  "OperatorZipCodeExt": "0296",
  "RMPContact": "Joseph V. Carlini",
  "RMPTitle": "Wastewater Manager",
  "FTE": 38,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000050008",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "1030060-002AV",
  "SafetyInspectionDate": "1996-06-19 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-01-13 00:00:00",
  "DeRegistrationEffectiveDate": "2016-01-04 00:00:00",
  "AnniversaryDate": "2004-06-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 27.90844,
  "FRS_Long": -82.70253,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5069,
      "AltID": "Chlorination",
      "FacilityID": 4341,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5178,
          "ProcessID": 5069,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5426,
          "ProcessID": 5069,
          "ChemicalID": 62,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505426,
          "ProcessID": 5069,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 5070,
      "AltID": "Dechlorination",
      "FacilityID": 4341,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5179,
          "ProcessID": 5070,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5427,
          "ProcessID": 5070,
          "ChemicalID": 49,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505427,
          "ProcessID": 5070,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4341,
      "SummaryText": "The City of Largo Water Reclamation Facility utilizes chlorine gas and sulfur dioxide gas for chlorination (disinfection) and dechlorination, respectively, of the Facility's effluent from the treatment of wastewater.  Current staff recalls no large scale accidental release of either of these substances.  As part of this Risk Management Program, the Facility has re-reviewed and formally established a complete program which includes the assessment of hazards, a thorough prevention program and an emergency response program.\n\nThe Facility is a municipal wastewater treatment facility.  As stated above, chlorine is used to disinfect the Facility's effluent.  Sulfur dioxide is then used to partially dechlorinate the effluent prior to distribution to the reclaimed water system for irrigation purposes.  The Florida Department of Environmental Protection requires that these two processes be done.  Twenty one ton cylinders of chlorine and fourteen one ton cylinders of sulfur dioxide is the maximum quantity that is maintained on-site.  Both substances are gaseous that are liquified under pressure.  The cylinders are delivered to the Facility and unloaded by the chemical vendor.  The cylinders are connected/disconnected by the Facility's trained operating personnel.\n\nThe worst case release scenarios for both substances involve the release of all the contents in one cylinder.  Using the common EPA mandated factors, the distances to the toxic endpoints are both 1.3 miles.  Alternate release scenarios were evaluated for each substance.  The chlorine alternate scenarios were assumed to occur in the chlorine storage building which is equipped with air scrubbers.  Since the scrubbers are able to mitigate all of the discussed releases, no off-site consequences are predicted.  The alternate release scenario for sulfur dioxide involves the rupture of the one inch diameter pipe manifold connected to four one ton cylinders upstream of the vacuum regulator.  Using the EPA standard factors, "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4341,
      "SummaryText": "the distance to the toxic endpoint is ____ miles.  Other release scenarios involving lesser releases quantities and shorter distances to endpoint were also evaluated.  The worst case scenarios were agreed to be 'highly unlikely' while the alternate scenarios are more likely and were discussed more concerning emergency response.  Also the EPA mandated and standard meterologic condition factors used in the analyses are not 'average' conditions at the Facility.  Due to the Facility's proximity to the coast, the average conditions are most likely less calm.  Less calm conditions would disperse the substances at a much quicker rate thus resulting in a shorter distance to the toxic endpoint.\n\nThe Facility has had no accidental releases of either chlorine or sulfur dioxide in the past five years that resulted in injuries or other impacts as defined by EPA.\n\nThe Facility has a prevention program in place which covers all aspects of the Facility's operations on and around the chlorination and dechlorination processes.  Written procedures are followed by trained staff on all activities.  The entire systems are inspected at least one time each shift during the 24 hour per day, 365 days per year operation and manning of the Facility.  Any concerns are addressed promptly by the operations staff and maintenance staff which is on 24 hour per day stand-by.  The City is dedicated to safety with the adoption of a city-wide safety program and the Commission's planned approval and adoption of this Risk Management Program.\n\nImmediate and limited emergency response would be completed by the Facility's staff upon a release.  During cylinder delivery, switchover and changeout, a release is most likely to occur.  The operators performing these duties don personal protective gear and connect to a containerized air supply.  If a leak occurs, they are able to stop or mitigate the release while connected.  Mitigation could include closing of valves, reorientating the cylinder to prevent release"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4341,
      "SummaryText": " of liquid, closing of doors, etc.  If the release continues, 9-1-1 is called and the facility is evacuated.  The local haz-mat response team would then respond and notify other effected parties including law enforcement, school board and emergency management.  Pinellas County Fire and Rescue, the City of Largo and the other participating agencies maintain a trained and equipped team for hazardous material releases.  All municipalities in Pinellas County rely on this team for response to these types of events.  The team would then complete all activities as needed which may include repair of cylinder, evacuation, spill cleanup, environment tests, etc.\n\nThe Facility plans to evaluate other disinfection methods to possibly lessen the amount of chlorine which is required to be stored and utilized.  Florida Department of Environmental Protection requires that the Facility maintain a certain residual amount of chlorine in the Facility's effluent which is supplied as reclaimed water for irrigation purposes.  Therefore the need for chlorine will not be completely removed.\n\nThe Facility is also planning upgrades to the dechlorination system.  Funds are currently programmed in the City's Capital Improvement Program for new sulfur dioxide storage facilities in future years.   Also, if other disinfection methods are selected, the sulfur dioxide inventory (and system) could also be reduced or completely removed."
    }
  ]
}