{
  "FacilityID": 43483,
  "FacilityName": "FARMLAND FOODS, INC",
  "FacilityStr1": "800 INDUSTRIAL DRIVE",
  "FacilityStr2": null,
  "FacilityCity": "DENISON",
  "FacilityState": "IA",
  "FacilityZipCode": "51442",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19047",
  "LEPC": "Crawford County LEPC",
  "FacilityLatDecDegs": "42.027778",
  "FacilityLongDecDegs": "-095.359722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7284508,
  "ParentCompanyName": "FARMLAND FOODS, INC",
  "Company2Name": "SMITHFIELD FOODS, INC",
  "CompanyDUNS": 50710854,
  "Company2DUNS": 43205053,
  "OperatorName": "FARMLAND FOODS, INC",
  "OperatorStr1": "PO BOX 490",
  "OperatorStr2": null,
  "OperatorCity": "Denison",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "51442",
  "OperatorZipCodeExt": null,
  "RMPContact": "JIM SCHABEN",
  "RMPTitle": "ACTING PLANT MANAGER",
  "FTE": 1550,
  "OtherEPAFacilityID": "51442FRMLNINDUS",
  "EPAFacilityID": "100000079121",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-05-17 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Denison",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-08-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-08-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-07-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-07-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 42.0252,
  "FRS_Long": -95.36173,
  "FRS_Description": "OTHER",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62535,
      "AltID": "AMMONIA REFRIGERATION",
      "FacilityID": 43483,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 64000,
          "ProcessID": 62535,
          "NAICSCode": "31161",
          "_desc": {
            "NAICS_CODE": "31161",
            "NAICS_DESCRIPTION": "Animal Slaughtering and Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 82562,
          "ProcessID": 62535,
          "ChemicalID": 56,
          "Quantity": 110000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 582562,
          "ProcessID": 62535,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43483,
      "SummaryText": "\nRisk Management Plan\n\nExecutive Summary\n\n\n\nFarmland Foods, Inc.\n\nDenison, IA\n\n\n\nFarmland Foods' Denison pork processing plant is located in West Central Iowa, in the city of Denison, Iowa. The plant manufactures fresh pork and processed meats that provide consumers with high-quality meat products. This facility is subject to the Environmental Protection Agency's Risk Management Program rules under the Clean Air Act Amendments of 1990.\n\n\n\nThe Risk Management Program rules require facilities handling threshold amounts of certain chemical substances to submit Risk Management Plans for the prevention of accidental releases of these substances.  The plan submission to include hazard assessments defining possible off-site impacts of certain regulated substance release scenarios, a five-year accident history, description of the facilities accidental release prevention program, and an emergency response program. \n\n\n\nThe following is the Executive Summary of the Risk Management Plan for Farmland Foods, Inc., Denison, IA.\n\n\n\nFacility Snapshot\n\nThis facility, which was constructed in the late 1950's, was owned and operated by Crawford County Packing Company prior to Farmland's acquisition of the plant in 1959.  The plant produces over 600 million pounds of product annually.\n\n\n\nImpact on the community\n\n* Farmland employs 1,550 area residents at a combined annual salary of approximately $54 million. \n\n* The facility paid more than $246 million for materials, live hogs and utilities, including electricity, natural gas, water, and wastewater treatment from the local area.\n\n\n\nEmployee snapshot\n\nFarmland employees are involved in community activities.  The facility supports United Way, Kidde Kampus and other community support organizations.  Employees are active in many other community organizations, such as Community Chest and Blue Jeans for Babies annual fund-raising drives.  Employees also participate in semi-annual blood drives conducted at the facility.     \n\n\n\nAccidental Rele"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43483,
      "SummaryText": "ase Prevention and Emergency Response Policy\n\nThe management and employees of this facility are committed to the prevention of any accidental releases of hazardous and regulated substances and to minimize the effects of any such releases that may occur.  Prevention of accidental releases is critical to the safe operation of this plant, to the safety of its employees, and to the safety of the general public.\n\n\n\nTo achieve its goals of accident and accidental release prevention, the facility is committed to the following:\n\n* A knowledgeable and highly trained and motivated employee group\n\n* A well-designed facility that is maintained and operated in a superior manner\n\n* Improvements that enhance safety and accident prevention where appropriate\n\n* Excellence in safety programs and practices; a superior safety and accident record\n\n* Preparation and training for emergency response and mitigation\n\nThe plant has had a written Emergency Response Plan in effect for many years and is committed to respond to and mitigate any accidental release to minimize the impact to employees, the community, and environment.  The response plan is coordinated with the Local Emergency Planning Committee and emergency response agencies and the plant has interacted with possible responding agencies for many years regarding the plan and activities at the plant.  Employees are trained in the implementation of the plan and in possible response activities that could be required in the event of an emergency.  The plant has a Hazmat Team made up of plant employees who are trained to respond in the event of an ammonia release.\n\n\n\nStationary Source and Regulated Substances\n\nAmmonia refrigeration constitutes the process at this facility that is covered by the EPA Risk Management Plan rule.\n\n\n\nThe facility has 110,000 pounds of ammonia on site that is used as a refrigerant in its ammonia refrigeration system.  This is a closed, contained system, in which the ammonia is recirculated to refrigerate the mea"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43483,
      "SummaryText": "t processing and storage areas in the plant. \n\n\n\nSynopsis of Worst-Case and Alternate Release Scenarios\n\nThe Risk Management rule requires a hazard analysis for worst-case and alternate release scenarios for regulated substances present in threshold quantities at the site.  For this facility, one regulated toxic substance is included, anhydrous ammonia.  \n\n\n\nThe Risk Management rule requires that the largest amount in a single vessel be considered the release quantity for the worst-case event, unless smaller quantities handled at different conditions result in a greater distance to the regulated endpoint of consideration.  This is a requirement of the rule regardless of whether the event is likely, or, could even reasonably occur.  It should be emphasized that the possibility of such an event is extremely low. \n\n\n\nAlternate scenarios, for each regulated toxic, which are more likely events, must also be presented.  More likely release events tend to concentrate in areas such as failure of smaller valves, lines, and hoses.  Significantly lower quantities are involved and operator intervention would tend to mitigate and limit the consequences of such failures.\n\n\n\nPrevention Program\n\nThe ammonia refrigeration process at this plant is subject to the OSHA Process Safety Management rule, 29 CFR 1910.119.  Therefore, under the EPA Risk Management Rule, this is a Program Level 3 process.  The OSHA Process Safety Management Program is in place for this process, which constitutes the Program Level 3 Prevention Program.  \n\n\n\nThe OSHA Process Safety Management /EPA Prevention Program consists of facility management policies and procedures which promotes and recognizes process safety and the prevention of accidents in plants that handle, use, store, and process hazardous chemical materials. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe plant adheres to the requirements of Process Safety Management and has written policies and procedures addressing all aspects of Process Safety Management and EPA Preventio"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43483,
      "SummaryText": "n Programs.  The Prevention Programs consist of several elements and policies listed below:\n\n* Employee Participation\n\n* Process Safety Information\n\n* Process Hazard Analysis\n\n* Operating Procedures\n\n* Operator Training \n\n* Contractors\n\n* Pre-startup Safety Review\n\n* Mechanical Integrity\n\n* Hot Work Permits\n\n* Management of Change\n\n* Incident Investigation\n\n* Emergency Planning and Response\n\n* Compliance Audit\n\n\n\nEmergency Response Plan\n\nThe Farmland Denison plant has a written Emergency Response Program as required by the Risk Management rule and other Environmental Protection Agency and OSHA rules.  This Plan is coordinated with the local community response plan and is available to those responding agencies.  Emergency planning and Community Right-To-Know information as required under SARA Title III has been provided to the State Emergency Response Commission, Local Emergency Planning Committee, and other appropriate agencies such as the local fire department. The facility interacts with various local agencies in it's emergency planning such as the Local Emergency Planning Committee, fire departments, law enforcement agencies, and hospitals. Employees receive annual training in the response plan and also receive various safety training, both in general, and in the competencies relative to their required roles in the plan.  Periodically, the plan is practiced in a tabletop, classroom type setting, and also drilled in mock emergencies including participation by outside responding agencies.\n\n\n\n5-Year Accident History\n\nThe Risk Management rule requires inclusion of the five-year accident history of the facility for all accidental releases that resulted in deaths, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage. The Denison plant has an excellent five-year accident record with no qualifying accidental releases.\n\n \n\nPlanned Changes for Safety Improvements\n\nSa"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 43483,
      "SummaryText": "fety improvements are a continual and ongoing process at the plant, facilitated by the EPA Prevention Program/OSHA Process Safety Management Program.  Formal process hazard analysis is conducted at least every five years, but review is constant through management of change procedures, operator training, incident investigation, and mechanical integrity programs.  As a result, changes relevant to safety occur continuously, as needs are identified through these procedures and policies.\n\n"
    }
  ]
}