{
  "FacilityID": 43556,
  "FacilityName": "Evans St. Gabriel, LLC",
  "FacilityStr1": "3950 Highway 30 South",
  "FacilityStr2": null,
  "FacilityCity": "St. Gabriel",
  "FacilityState": "LA",
  "FacilityZipCode": "70776",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22047",
  "LEPC": "Iberville Parish LEPC",
  "FacilityLatDecDegs": "30.245278",
  "FacilityLongDecDegs": "-091.063389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Evans Industies,INC",
  "Company2Name": null,
  "CompanyDUNS": 174781922,
  "Company2DUNS": 0,
  "OperatorName": "Evans Industries, Inc",
  "OperatorStr1": "1255 Peters Rd",
  "OperatorStr2": null,
  "OperatorCity": "Harvey",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70058",
  "OperatorZipCodeExt": null,
  "RMPContact": "Frank DiVincenti",
  "RMPTitle": "EHS Manager",
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000192702",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-12-09 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-08-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-08-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-08-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-08-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62696,
      "AltID": "Warehousing and Packaging",
      "FacilityID": 43556,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 64170,
          "ProcessID": 62696,
          "NAICSCode": "49319",
          "_desc": {
            "NAICS_CODE": "49319",
            "NAICS_DESCRIPTION": "Other Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 82767,
          "ProcessID": 62696,
          "ChemicalID": 44,
          "Quantity": 188000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 44,
            "ChemicalName": "Toluene 2,4-diisocyanate  [Benzene, 2,4-diisocyanato-1-methyl-]",
            "CASNumber": "584-84-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 582767,
          "ProcessID": 62696,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43556,
      "SummaryText": "RMP Executive Summary below:\n \nExecutive Summary for Evans Houston\n\n1.Accidental Release Prevention and Emergency Response Policies at Evans St. Gabriel are committed to employee, public and environmental safety. This commitment is inherent to our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent releases of regulated substances.  \n\n2.The Stationary Source and the Regulated Substances Handled:\nThe Evans St. Gabriel facility's primary activity is repackaging and warehousing of chemicals. Evans either repackages or warehouses one RMP regulated substance. Evans receives the regulated substance in bulk and packages the product into 55 gallon drums or other industrial packages for customer distribution.  Drummed products are then warehoused or shipped depending on customer specifications.  Inventory is dependent upon customer orders and regulated substances are not present at all times.  \n\nChemical                                                              CAS No.\nToxic Substances: Toluene 2,4 Diisocyanate        584-84-9\n\n3.The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), include administrative controls and mitigation measures to limit the distances for each reported scenario.  Evans St. Gabriel is a Program 2  level facility.  \n\nTo evaluate the worst case and alternative scenarios, Evans used EPA's program RMP*Comp to calculate the off-site consequences.  RMP*Comp is based on the look-up tables and equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance.  The following paragraphs provide details of the chosen scenarios.\n\nScenarios for Toxic Substances\n\nThe worst-case release scenario submitted for toxic substances involves a catastrophic release of 2,4 Toluene Diisocyanate.  The scenario involves the rele"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43556,
      "SummaryText": "ase of 54,000 lbs of 2,4 Toulene Diisocyanate via bottom valve failure of a rail car.  The event occurs over a period of 3 hrs at a rate of 300 lbs/min.  Estimated 3hrs for emergency responders to isolate and control the release.  Calculations take into account the worst case weather conditions (stable, low wind speed) in a rural setting and is calculated to a toxic endpoint of 0.007 mg/l.\n\n \nThe alternative release scenario for 2,4 Toluene Diisocyanate involves a release of 3000 lbs in the containment dike from a hose failure while transferring.  It is assumed the release takes place for 10 minutes before it is brought under control.  The release is controlled by active mitigation measures that include shut off valves, nitrogen bleed off valves, neutralizing material and sorbent to confine and control the release.   Under the most common weather conditions, the maximum distance to the toxic endpoint of 0.007mg/l.\n\n4.The Accidental Release Prevention Program and the Chemical-Specific Prevention Steps:\nThe repackaging and warehouse operations at Evans St. Gabriel are not subject to the OSHA PSM standard under 29 CFR 1910.119.  Evans is subject to EPCRA Section 302 notification requirements.  The following sections briefly describe the elements of the release prevention program that is in place.\n                                                                                                                                                                                           Process Hazard Analysis\nEvans? facility has no process chemistry.  Periodic hazard reviews are conducted to ensure hazards associated with operations are identified and controlled effectively.  The checklist methodology used to carry out process hazard analyses are from the Chemical Manufactures Association  Assessment guides (CMA).  Evans also used the EPA Compliance Guide Checklist as well its own hazard reviews.  Any findings related to the hazard analysis are addressed in a timely manner.\n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43556,
      "SummaryText": "\nOperating Procedures\nFor the purposes of safely conducting activities within covered operations, Evans maintains written standard operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after maintenance.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nEvans St. Gabriel has a training program in place to ensure that employees are competent in the operating procedures. New employees receive training and are tested for competency before starting work and continue on the job training under supervision.  Refresher training is provided on a regular basis and more frequently as needed.\n\nMechanical Integrity\nEvans carries out a preventative maintenance program on related process equipment.  Process equipment examined by this program includes among others; pressure valves, transfer hoses, abatement vent systems, shutdown systems and weighing mechanisms.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nStart Up Reviews\nSafety reviews related on all new chemical transfers are conducted. These reviews are conducted to confirm that equipment and appropriate PPE are suitable for all new chemicals.\n\nCompliance Audits\nEvans will conduct audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits will be carried out at least every 3 years and any corrective actions required as a result of the audits will be undertaken in a safe and prompt manner.\n\nIncident Investigation\nEvans promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigation"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43556,
      "SummaryText": "s are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nAt Evans St. Gabriel safety is not a departmental function.  Company employees are encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, Evans employees are trained in  operation procedures, msds reviews and contingency awareness.\n\n5.Five-year Accident History\nEvans St. Gabriel has been in existence since 2002 and not had any release since its origin.\n\n6.Emergency Response Plan\nEvans has a written emergency response plan for accidental releases of hazardous materials.  Small events of drips and spills are handled internally.  Emergency events are handled by 3rd party professional responders who are trained in mitigation and clean up.  Evans Emergency plan is incorporated into its site Contingency plan.  This plan is updated regularly to reflect any pertinent changes. \n\n7. Certification Statement\nThe undersigned certifies that to the best of their knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete. \nAugust 1, 2005  Frank C DiVincenti"
    }
  ]
}