{
  "FacilityID": 43601,
  "FacilityName": "Gallade Chemical, Inc. Fontana - Federal Filing",
  "FacilityStr1": "15120 Santa Ana Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Fontana",
  "FacilityState": "CA",
  "FacilityZipCode": "92337",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06071",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "34.056389",
  "FacilityLongDecDegs": "-117.475667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "IO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Gallade Chemical, Inc.",
  "OperatorStr1": "1230 E. St. Gertrude Place",
  "OperatorStr2": null,
  "OperatorCity": "Santa Ana",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92707",
  "OperatorZipCodeExt": null,
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000192766",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-08-05 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2005-08-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-08-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2005-08-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2015-08-11 00:00:00",
  "DeRegistrationEffectiveDate": "2015-06-01 00:00:00",
  "AnniversaryDate": "2010-08-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.6",
  "FRS_Lat": 34.05566,
  "FRS_Long": -117.47447,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62767,
      "AltID": "Chemical Distribution",
      "FacilityID": 43601,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 82861,
          "ProcessID": 62767,
          "ChemicalID": 53,
          "Quantity": 18500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 64245,
          "ProcessID": 62767,
          "NAICSCode": "42469",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 36603,
              "Process_NAICS_ID": 64245,
              "SafetyReviewDate": "2004-08-05 00:00:00",
              "PHA_Date": "2004-08-05 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2005-05-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Accidental releases during truck unloading and movement of regulated substance containers to storage/holding areas.",
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "ALL storage building doors locked.",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "No previous HazOp conducted",
              "OpProceduresReviewDate": "2004-08-31 00:00:00",
              "TrainingReviewDate": "2004-08-31 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-08-31 00:00:00",
              "EquipmentInspectionDate": "2004-08-05 00:00:00",
              "EquipmentTested": "Condition of storage racks",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2004-08-31 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-08-31 00:00:00",
              "HotWorkPermitReviewDate": "2004-08-31 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 53135,
                  "PreventionProgram3ID": 36603,
                  "ProcessChemicalID": 82861
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 43601,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-08-05 00:00:00",
    "ERTrainingDate": "2004-08-05 00:00:00",
    "CoordinatingAgencyName": "San Bernardino County Fire Dept.",
    "CoordinatingAgencyPhone": "9093868425",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 43601,
      "SummaryText": "arious Prevention Program components not discussed herein.  Interested parties that have additional questions regarding the Fontana Facility¿s Risk Management Plan and/or Prevention Program, are directed to contact:\n\n\tMr. Steve Halberstadt\n\tHealth/Safety & Compliance Manager\n\tc/o Gallade Chemicals, Inc.\n\t1230 East St Gertrude Place\n\tSanta Ana, California 92707"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 43601,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThis document comprises the Federal Risk Management Plan (RMP) for the Gallade Chemical facility located in Fontana, California (hereinafter referred to as the site or the subject site).  The site is owned and operated by Gallade Chemical, Inc.  \n\nThe purpose of this document is to comply with the risk management planning and update requirements as set forth in the Code of Federal Regulations, Title 40, Part 68 (also known as the Federal Risk Management Plan Regulations).  The scope of the  RMP includes all operations conducted at the subject site that involve the storage and handling of 37-percent concentrated hydrochloric acid.  \n\nES 1.0\tDESCRIPTION OF STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nThe primary operation conducted by Gallade Chemical, Inc. at the Fontana Facility is Chemical Distribution (NAICS Code 42489 ¿ Other Chemical and Allied Products Merchant Wholesalers).  \n\nFacility Location\nThe Gallade Chemical Facility is located at 15120 Santa Ana Avenue in Fontana, California 92337.  The Facility is located in an area that is primarily industrial in nature and bounded by Santa Ana Avenue to the south, by Hemlock Street to the west and by Beech Street to the east.  \n\nFacility Description\nGallade Chemical¿s Fontana Facility was constructed in 1983 to distribute industrial chemicals to retail operations and wholesale distributors.  \n\nDescription of Regulated Substance Storage and Handling\nGallade Chemical¿s Fontana Facility is a chemical distribution facility.  As part of normal operations, the Facility purchases, receives and stores onsite a number of  substances in various container types and sizes.  As customer orders are received, these materials are loaded onto delivery trucks in various container types and sizes (as they were received and dictated by the customers¿ order) and delivered to the customer.  With regard to 37-percent concentrated hydrochloric acid, Gallade Chemicals, Inc. NEITHER uses hydrochloric acid onsite NOR"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43601,
      "SummaryText": "repackages hydrochloric acid into other container sizes or types.  The various size containers of hydrochloric acid are shipped out as received.\n\nReceipt/Unloading/Storage\nUpon arrival of a delivery vehicle to the Facility, the driver checks in with the office and proceeds to the delivery dock.  At the dock, the delivery papers and material identities are confirmed by Gallade Operators.  Once the order is confirmed, a pallet jack or forklift is utilized (depending on the load type) to unload and stage the order being received.  An Operator then transfers the order from the staging area to the storage room.  The Company has developed and implemented an extensive material segregation and storage procedure that requires that ALL materials be stored in specifically allocated building(s) or areas only.  The act of material segregation and storage is integral to the safe storage and handling of ALL materials handled at the Facility.\n\nStaging/Loading/Delivery\nAs the Company receives orders for chemicals, the Dispatch Department works out the logistics for order fulfillment and delivery.  Again, pallet jacks or forklifts are utilized to move materials from the various building areas or storage rooms to the delivery dock.  The Operator checks the Delivery Order and ensures that the load is accurate.  The delivery truck driver then delivers the load to customer sites.  \n\nIt should be noted that 37-percent concentrated hydrochloric acid is received in sealed containers, the containers remain sealed throughout the duration of their storage onsite, and the containers are delivered sealed to customers.  Furthermore, ALL containers are stored indoors in locked, secured warehouse areas/rooms that have been pre-designated via a well thought out and planned materials handling and segregation process.  As such, only chemically compatible materials or like materials are stored in the same warehouse areas or rooms.  Storage areas for incompatible materials are separated by walls, or ot"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43601,
      "SummaryText": "her barriers that prevent co-mingling.  \n\nSite Security\nALL buildings at the site are locked at all times and access is limited to authorized persons only.  Furthermore, the site is surrounded by a chain link fence and the entry gate is locked at all times.  These security measures are designed to prevent unauthorized access to site areas including those areas where regulated substances are stored and/or handled and thus, add a level of safety for the storage of regulated substances at the site.\n\nES 2.0\tACCIDENTAL RELEASE SCENARIOS\n\nThe CalARP RMP regulations require that at least two types of release scenarios be evaluated for their potential to impact off-site populations:\n\n¿\tthe worst case release; and\n¿\tan alternative release (an accident scenario that is more credible than the worst-case release scenario).\n\nA number of hypothetical accidental release scenarios were postulated and evaluated for the RMP.  These scenarios were categorized into worst-case release scenarios and alternative release scenarios.  Each of these categories of hypothetical accidental release scenarios are discussed below.\n\nHYDROCHLORIC ACID (37-PERCENT CONCENTRATED)\n\nWorst-Case Release Scenario\nIn this scenario, a 550-pound container (e.g. a 55-gallon drum ¿ the largest container size handled at the site) of 37-percent concentrated hydrochloric acid stored on site experiences a catastrophic failure due to an unknown event.  This scenario could be initiated by an external event (i.e., an airplane, missile or meteorite impacting the area where the drums are stored).  It is highly improbable that this scenario would be initiated by a seismic event.  However, the possibility of this scenario being initiated by a seismic event cannot be completely discarded (i.e., the structural failure of a building or wall, etc.).  This scenario is considered to be extremely unlikely.  In the extremely unlikely case that this scenario occurs, up to 550-pounds of hydrochloric acid could be released (in the wor"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43601,
      "SummaryText": "st-case).  In an effort to be conservative (i.e., to estimate the largest vulnerable zone) it was assumed that the release occurs outdoors.  Thus, it was assumed that the hydrochloric acid released during the catastrophic accident forms a liquid pool from which a cloud of hydrochloric acid fumes are generated.  The cloud of hydrochloric acid fumes was then assumed to freely migrate off-site.  Utilizing the methodology specified by USEPA, the estimated vulnerable zone for this hypothetical accidental release scenario is approximately 0.2-miles.\n\nAlternative Release Scenarios\nAlternative release scenarios which are considered to be more likely to occur are those which may result in the release of anywhere from less than one-pound to up to 550-pounds of 37-percent concentrated hydrochloric acid.  These scenarios include situations such as accidental releases during delivery of hydrochloric acid to the site, a pinhole leak in one of the hydrochloric acid containers stored onsite, a partial or complete failure of one of the hydrochloric acid containers stored onsite, or an accident during onsite movement of one of the hydrochloric acid storage containers.  In order to be conservative in the estimation of the vulnerable zone, it was assumed that 550-pounds of 37-percent concentrated nitric acid (the largest container size handled at the facility) is released during an event in which the integrity of one of the storage containers is breeched by some external event.  In order to be conservative (i.e., in order to estimate the largest vulnerable zone), this event is assumed to occur outdoors (although it could occur indoors also).  Thus, it was assumed that the hydrochloric acid released during the accident forms a liquid pool from which a cloud of hydrochloric acid fumes is generated.  The cloud of hydrochloric acid fumes was then assumed to freely migrate off-site.  Utilizing the methodology specified by USEPA, the estimated vulnerable zone for this hypothetical accidental"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 43601,
      "SummaryText": "release scenario is approximately 0.1-miles.\n\nSENSITIVE RECEPTORS LOCATED WITHIN THE LARGEST PROJECTED VULNERABLE ZONE\n\nDue to the location of the site (i.e., it is located within an area that is primarily industrial in nature), there are no sensitive receptors known to be present within the Projected Vulnerable Zone.  \n\nES 3.0\tFIVE YEAR ACCIDENT HISTORY\n\nDuring the five years preceding the submittal of the  RMP (i.e., from April 1, 1999 through April 1, 2005), the subject site has NOT had any releases of 37-percent concentrated hydrochloric acid that have resulted in:\n\n¿\tOnsite deaths, injuries, or significant property damage; or\n¿\tKnown offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\n\nES 4.0\tACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\nThe Accidental Release Prevention Program at the facility consists of a series of programs, procedures and policies designed to minimize the risk of accidental releases involving regulated substances.  These programs include design and operating controls such as compliance with specified codes (i.e. compliance with building codes and fire codes, conformance to the Chemical Manufacturer¿s Association¿s Responsible Care Program, Corporate policies for segregation of classes of hazardous substances such as strong acids, strong bases, weak acids, weak bases, etc.), the Company¿s OSHA Hazard Communication Program, the Company¿s Injury and Illness Prevention Program, numerous standard operating procedures, the equipment inspection and maintenance program (including a mechanical integrity and preventive maintenance program for forklifts, etc.), the management of change program, pre-start-up review, fire protection and hot work permit programs, management of- and safety of- contractors, accident/incident investigation procedures (as contained in the Company¿s Injury and Illness Prevention Program), emergency response plan, the RMP Program compliance audi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 43601,
      "SummaryText": "ting program, the RMP Program record keeping program and a variety of personnel training programs.  Details of each of these components of the Company¿s Accidental Release Prevention Program are provided in the document entitled Federal Risk Management Plan (RMP) and California Accidental Release Prevention Program Risk Management Plan (CalARP RMP), Volume I - Prevention Program.  \n\nThere are a number of detection and monitoring devices and alarms designed to ensure the continued safe operation of the Facility.  These devices are located throughout the facility and monitor various aspects of Operations.  \n\nES 5.0\tEMERGENCY RESPONSE\n\nGallade Chemical recognizes that emergency planning and emergency response are an integral component of risk management.   As such, the Company, as part of its hazardous materials business plan (HMBP) for the Fontana Facility, has currently developed and implemented an emergency response plan and an emergency evacuation plan.  However, as an added measure to improve safety, the Company is developing specific emergency response options for emergencies involving various classes of hazardous substances handled at the facility (including strong acids such as 37-percent concentrated hydrochloric acid).  \n\nES 6.0\tPLANNED CHANGES TO IMPROVE SAFETY\n\nA detailed hazard and operability study (i.e., process hazards analysis) was performed for the facility on ALL operations involving 37-percent hydrochloric acid at the facility in order to enhance the safety of the site and to evaluate the potential for accidental releases.  As a result of the process hazards analysis performed, a number of recommendations were made.  Gallade Chemical has already completed/implemented a number of the recommended actions and expects to complete/implement the remaining recommended actions by May 31, 2005.\n \n\nES 7.0\tFOR MORE INFORMATION\n\nGallade Chemicals, Inc. recognizes that some persons may be interested in obtaining more detailed information regarding the  RMP and v"
    }
  ]
}