{
  "FacilityID": 43800,
  "FacilityName": "Atlantic Energy, Inc. Chesapeake Terminal",
  "FacilityStr1": "2901 South Military Highway",
  "FacilityStr2": null,
  "FacilityCity": "Chesapeake",
  "FacilityState": "VA",
  "FacilityZipCode": "23323",
  "Facility4DigitZipExt": "5804",
  "FacilityCountyFIPS": "51550",
  "LEPC": "Chesapeake LEPC",
  "FacilityLatDecDegs": "36.776667",
  "FacilityLongDecDegs": "-076.312778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "BillN.aei@verizon.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": "UGI Energy Services, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 14354518,
  "Company2DUNS": 0,
  "OperatorName": "Atlantic Energy, Inc.",
  "OperatorStr1": "2901 South Military Highway",
  "OperatorStr2": null,
  "OperatorCity": "Chesapeake",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23323",
  "OperatorZipCodeExt": "5804",
  "RMPContact": "William E. Noeth",
  "RMPTitle": "Plant Manager",
  "FTE": 12,
  "OtherEPAFacilityID": "VA0074454",
  "EPAFacilityID": "100000168301",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-12-06 00:00:00",
  "SafetyInspectionBy": "US Goast Guard",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-09-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-09-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-09-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-09-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 36.77722,
  "FRS_Long": -76.31194,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 63138,
      "AltID": "LPG Storage/ Distribution",
      "FacilityID": 43800,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 64630,
          "ProcessID": 63138,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 83532,
          "ProcessID": 63138,
          "ChemicalID": 98,
          "Quantity": 84400000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 83533,
          "ProcessID": 63138,
          "ChemicalID": 105,
          "Quantity": 17234.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 105,
            "ChemicalName": "Ethyl mercaptan [Ethanethiol]",
            "CASNumber": "75-08-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 583532,
          "ProcessID": 63138,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 583533,
          "ProcessID": 63138,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43800,
      "SummaryText": "Risk Management Plan Executive Summary\nAtlantic Energy, Inc. Chesapeake Terminal\n\n\nA. Accidental Release Prevention and Response Policies\n\nConstructed in 1973, the Atlantic Energy, Inc. Chesapeake Terminal provides a vital energy service to homeowners, commercial businesses, and industry.  The facility has an excellent safety record, and its employees are key players in achieving that safety record.\n\nAtlantic Energy is committed to safe and reliable operation for the protection of its employees, the community, and the environment.  Atlantic Energy is proud of its 32 year operating record, during which there has never been an incident that resulted in any off-site impacts to neighboring industries, residents or the community at large. This record has been achieved through consistent attention and total dedication by management and staff to safe operating practices and preventive maintenance.  Atlantic Energy has constantly made new investments in the latest technology in operating and maintaining the facility.  These practices form the backbone of Atlantic Energy's dedication to keeping the facility and its community safe.\n\n\nB. Description of the Source and Regulated Substances Handled.\n\nThe Atlantic Energy Terminal in Chesapeake, VA imports and stores fully refrigerated liquid propane (also called liquefied petroleum gas or LPG) at -45 deg F.  The terminal processes this product by heating it to +40 deg F for shipment to its customers by truck and rail.  Ethyl mercaptan, an odorizing agent, is added to the LPG being distributed from the terminal.  Both propane and ethyl mercaptan are regulated flammable substances.  The terminal has no RMP listed toxic chemicals in threshold quantities.\n\n\nC. Release Prevention Program\n\nThe terminal was designed and built in accordance with provisions of the following three recognized standards for LPG facilities:\n\n*  NFPA 58, Standard for the Storage and Handling of Liquefied Petroleum Gases, (National Fire Protection Association).\n"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43800,
      "SummaryText": "\n*  API 2510, Design and Construction of Liquefied Petroleum Gas (LPG) Installations, (American Petroleum Institute).\n\n*  API 620, Design and Construction of Large, Welded, Low-Pressure Storage Tanks, (American Petroleum Institute).\n\nThe plant is attended by at least two operators at all times.  They log field operating data at four-hour intervals and monitor plant equipment using the following monitoring and control systems:  Indoor operating areas of the plant are monitored by combustible vapor detectors to quickly detect leaks.\n\nThe main control panel, located in the central control room, displays pressures, temperatures, valve positions, and flow rates and provides for remote operation and manual or automatic shutdown of valves and equipment.\n\nWritten policies and procedures for safe operation are contained in the following Atlantic Energy manuals:\n\n*  \"Operations Manual and Emergency Manual,\" covering normal startup, operation, and shutdown of marine unloading systems and equipment.\n\n*  \"Atlantic Energy Contingency Plan,\" covering guidelines for situations involving unusual events or threats to public safety.\n\n*  \"Field Safety and Operational Handbook,\" covering safe handling of the product.  It covers safe work practices and permitting requirements for such activities as hot work, electrical work, confined space and vessel entry, excavation, and other hazardous activities.  Plant security and visitor policies are covered.\n\n*  \"Process Safety Management Program,\" covering policies and procedures for PSM program elements.\n\n\nD. Five Year Accident History\n\nIn the five-year reporting period, there were no release of propane or ethyl mercaptan that resulted in injuries, deaths, property damage, evacuations, sheltering in place, or environmental damage either on site or off-site.\n\n\nE. Emergency Action Plan\n\nEmergency planning, preparedness, and action are covered in the \"Operations Manual and Emergency Manual,\" which details responses by facility employees, the Chesa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43800,
      "SummaryText": "peake Fire Department, and the US Coast Guard.  All new employees are given initial training in emergency action procedures.  Employees receive refresher training on an ongoing basis.\n\n\nF. Planned Changes to Improve Safety\n\nThe facility has been in operation since 1973.  Safety reviews have been undertaken periodically since that time.  Many recommendations arising from these reviews have been implemented through equipment and procedural changes.\n\nThe intial process hazard analysis (PHA) for the facility was completed in October 1997.  The update and revalidation of that PHA was completed in January 2003.  Both PHAs led to plant improvements and similar results can be expected from future studies."
    }
  ]
}