{
  "FacilityID": 43816,
  "FacilityName": "Lodi Export Group",
  "FacilityStr1": "48 East Oak Street",
  "FacilityStr2": null,
  "FacilityCity": "Lodi",
  "FacilityState": "CA",
  "FacilityZipCode": "95240",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06077",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "38.132750",
  "FacilityLongDecDegs": "-121.270970",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ken Sasaki",
  "OperatorStr1": "48 East Oak Street",
  "OperatorStr2": null,
  "OperatorCity": "Lodi",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95240",
  "OperatorZipCodeExt": null,
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000192285",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-01-14 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "48 East Oak Street, Lodi, California",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-09-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-09-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-09-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-06-24 00:00:00",
  "DeRegistrationEffectiveDate": "2010-06-04 00:00:00",
  "AnniversaryDate": "2010-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C02",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "regulated substance was never at or above TQ",
  "_processes": [
    {
      "ProcessID": 63159,
      "AltID": "hydrocooler",
      "FacilityID": 43816,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 83556,
          "ProcessID": 63159,
          "ChemicalID": 56,
          "Quantity": 1500.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 64653,
          "ProcessID": 63159,
          "NAICSCode": "115116",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 23480,
              "Process_NAICS_ID": 64653,
              "SafetyReviewDate": "2005-03-25 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 1,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2005-03-25 00:00:00",
              "ChangeCompletionDate": "2005-04-30 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "cooling coils, room locations, piping locations",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "daily inspections",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2005-03-25 00:00:00",
              "TrainingReviewDate": "2005-03-25 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2005-03-25 00:00:00",
              "EquipmentInspectionDate": "2005-03-25 00:00:00",
              "EquipmentTested": "all process equipment",
              "ComplianceAuditDate": "2005-03-25 00:00:00",
              "AuditCompletionDate": "2005-04-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2005-03-25 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 24574,
                  "PreventionProgram2ID": 23480,
                  "ProcessChemicalID": 83556
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 43816,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Lodi Fire Department",
    "CoordinatingAgencyPhone": "2093336735",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43816,
      "SummaryText": "\nLodi Export Group operates a cherry packing facility and cold storage near the downtown area of the City of Lodi, California.  Lodi Export Group is located at two separate addresses (33 East Oak Street and 48 East Oak Street) but functions as one facility.  This Executive Summary is for the southern building located at 48 East Oak Street.\n\nFacility Description and Regulated Substances\n\nAnhydrous ammonia is used as a refrigerant in the hydrocooler system in the cherry packing at 48 East Oak Street in Lodi, California.  This system was installed prior to Lodi Export Group occupying the building and has been modified several times in the past.  The system is operated and maintained regularly by licensed and trained refrigeration contractors.  Anhydrous ammonia is received by truck and stored in one 350-gallon storage tank (bullet) at this location.  The maximum quantity of anhydrous ammonia handled in this process is 1,500 pounds. \n\nSubstance Used/Stored: Anhydrous Ammonia  (CAS# 7664-41-7) Max. Qty: 1,500 lbs\n\nFacility SIC: 4222    NAICS Code: 115114    Concentration: 100 wt%\n\n\n\n\n\nFive-Year Accident History\n\nThe Lodi Export Group Facility is an existing facility that has been in operation for over 30 years.  No accidental releases have occurred in the last 5 years.\n\nAccident Prevention Program Policies and Elements\n\nThe accident prevention program is implemented through an established set of policies and programs including, but not limited to, the following:\n\n* Inspection and maintenance program for all system equipment.\n\n* Community Emergency Response Plan\n\n* Employee Equipment and Safety Training Program\n\n* Compilation of substance information (MSDS)\n\n* Incident investigation procedures\n\n* Periodic compliance audits.\n\n* Compliance with all applicable laws, ordinances, and regulations.\n\nThe Lodi Export Group processes have several design and operating and maintenance controls which minimize the risk of an accident or release.  These controls are detailed in Section 3.0 of"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43816,
      "SummaryText": " this RMP.  Additionally, a process maintenance and inspection check is conducted daily when the processes are operating during the Facility?s normal operating season.\n\n\n\nOperating Procedures\n\nThe Facility uses licensed refrigeration contractors to perform operation and maintenance tasks on the anhydrous ammonia processes.  The contractors developed and use written standard operating procedures for all aspects of operation of these systems. These procedures are continuously updated to remain in accordance with all applicable regulations, ordinances, and standards of safe operation.  These procedures are provided as a matter of record only to the facility operator and are to be performed only by qualified, trained personnel with the approval of the contractor.  The only procedure facility personnel are instructed to perform is a total system shutdown in the event of an emergency.  \n\nTraining\n\nFacility staff is not trained on process operation and maintenance procedures but are trained to recognize and report potential problems with the processes and to shut them down if necessary.  The refrigeration contractor training program provides instruction to operation and maintenance staff on how to operate the processes within the required operating limits, and how to handle potential emergencies.  No Facility personnel are authorized to repair or maintain anhydrous ammonia handling equipment.  Process handling equipment repairs and maintenance are the responsibility of personnel qualified and trained by the refrigeration contractors.  The contractor maintenance personnel servicing process-handling equipment are required to follow the manufacturer?s guidelines for servicing the equipment and adhere to the contractor?s safety guidelines for working near equipment that handles acutely hazardous materials.  \n\nMaintenance\n\nThe maintenance element of the Facility operations procedures ensures that actions are taken to maintain the mechanical integrity of the process equipment.  "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43816,
      "SummaryText": "The refrigeration contractor conducts daily inspections and maintenance while the processes are in operation to insure they are operating in a manner consistent with design parameters and standards of safety.  The contractors use only properly trained personnel and follow manufactures or industry guidelines, accepted good engineering practices, and/or federal and state regulations when performing maintenance and inspection activities on process equipment.  Inspection and maintenance logs are maintained by the refrigeration contractors and forwarded to Lodi Export Group as a matter of record to file at the Facility.  \n\nIncident Investigations\n\nThorough investigation of ?incidents? (any occurrence that results in or could result in catastrophic releases of anhydrous ammonia, aqua ammonia, or regulated pesticides) or ?near misses? (any situation where conditions existed under which an incident could have occurred, but did not) is another essential element of the RMP program. Incident investigations typically yield perspectives on equipment or process safety that are not normally apparent to plant operations and maintenance staff, such as:\n\n* Incident ?causes? outside of the hazard assessment scope.\n\n* Was the facility response appropriate?\n\n* Did the emergency action and notification program function as designed?\n\n* Did the RMP provide the necessary level of protection with respect to the offsite impacts?\n\n* What changes need to be made to the RMP to ensure an appropriate response in the future?\n\nIncident investigations pursuant to this RMP will be specific to the anhydrous ammonia process system. The following data is typically gathered by the incident investigation team subsequent to the incident:\n\n* Date and time of the ?incident? or ?near miss?\n\n* Timeliness of incident report to the responding agency\n\n* Timeliness of public awareness and/or evacuation measures\n\n* Description of the incident or ?near miss?\n\n* An evaluation of the events that resulted in the inciden"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43816,
      "SummaryText": "t or ?near miss?\n\n* Recommendations to prevent future occurrences of the incident\n\nThe investigation results, including the implementation of all recommendations, are reviewed with facility staff whose job responsibilities are relevant to the findings. Copies of the investigation reports are maintained on site for a minimum of five years, and are used during the periodic hazard assessments re-evaluations.\n\nEmergency Action Program\n\nThe Lodi Export Group Facility does not have a trained emergency response team and as a result, Facility staff will not act as first responders in the event of an accidental release.  The response to a release by facility staff will be limited to notification of the appropriate emergency contacts and if necessary, shutdown of the anhydrous ammonia process.  Lodi Export Group has coordinated response actions with the City of Lodi Fire Department and Facility processes are included in the community emergency response plan.  \n\nAccidental Release Prevention Program\n\nThe general accidental release prevention program is comprised of the following elements:\n\n* Proper maintenance of all system equipment.\n\n* Proper operation of all system equipment.\n\n* Internal operating policies with respect to ammonia tank capacity.\n\n* Comprehensive personnel training.\n\n* Inclusion in the community emergency response plan.\n\n* Documented safety procedures for employees and contractors.\n\n* Inclusion of ammonia specific health, safety, and response data in the RMP.\n\nThe Lodi Fire Department will be the first responder in the event of a release.  Lodi Export Group personnel will perform \"awareness\" duties only, which simply means that once a spill or release is discovered, Lodi Export Group personnel will make the proper notifications setting the emergency procedures in motion and if necessary, shutdown of the anhydrous ammonia process.  In the event of a major release, Lodi Export Group may join forces with the Lodi Fire Department and State/County OES personnel in"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 43816,
      "SummaryText": " a \"unified command effort\" until the emergency has been mitigated.\n\nChemical Specific Prevention Elements\n\nChemical specific prevention measures are summarized as follows:\n\n* Periodic inspection of ammonia tank, containment area, pumps, and piping network.\n\n* Monitoring of anhydrous ammonia storage tank and system pressures and temperatures.\n\n* Monitoring of unloading/delivery procedures.\n\n* Provide all required safety and response equipment.\n\n* Provide a chemical specific training program.\n\n* Access to the anhydrous ammonia tank is controlled, and the secured area is locked.\n\nRelease Scenario Data\n\nSince the northern facility at 33 Oak Street contains the larger of two ammonia storage vessels, an off-site consequence analysis was run only for the larger of the ammonia storage vessels.  The worst-case release scenario is the failure of the anhydrous ammonia storage tank.  This scenario results in the release of approximately 680 gallons of ammonia. The distance to the toxic endpoint is approximately 550 meters and may affect approximately 2,608 individuals within the zone of impact radius in accordance to Landview 6.\n\nThe alternate release scenario for anhydrous ammonia is the rupture of the truck unloading hose; based on available accident statistics, this is the most likely release scenario.  This scenario results in the release of approximately 8.2 gallons of ammonia. The distance to the toxic endpoint is within the Facility fence-line boundary and the zone of impact radius would remain on-site in accordance to Landview 6.\n\nPlanned Changes to Improve Safety\n\nThe Lodi Export Group has operated this facility for several years without incident.  Data developed from the operational experience at the 48 East Oak Street facility will be directly applied to the operation and safety aspects of the 33 East Oak Street facility, and vice versa. Operational and safety issues identified at either facility are immediately analyzed for applicability to other operations. \n\nThe "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 43816,
      "SummaryText": "facility will constantly strive for improved performance and reliability from all its processes. As specific process and safety improvements are identified, they will be evaluated by staff for application and implementation.\n\n\n\n"
    }
  ]
}