{
  "FacilityID": 43907,
  "FacilityName": "Plum Creek Wastewater Treatment Plant",
  "FacilityStr1": "91 Colorado Street",
  "FacilityStr2": null,
  "FacilityCity": "Verona",
  "FacilityState": "PA",
  "FacilityZipCode": "15147",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42003",
  "LEPC": "Allegheny County LEPC",
  "FacilityLatDecDegs": "40.514306",
  "FacilityLongDecDegs": "-079.821111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Municipality of Penn Hills",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Municipality of Penn Hills",
  "OperatorStr1": "12245 Frankstown Road",
  "OperatorStr2": null,
  "OperatorCity": "Pittsburgh",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "15235",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tom O'Grady",
  "RMPTitle": "Acting Director",
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000049565",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-12-20 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-12-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-10-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-09-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-09-24 00:00:00",
  "DeRegistrationEffectiveDate": "2010-09-22 00:00:00",
  "AnniversaryDate": "2010-09-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 40.51446,
  "FRS_Long": -79.82116,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 63317,
      "AltID": "Use of chlorine",
      "FacilityID": 43907,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 64813,
          "ProcessID": 63317,
          "NAICSCode": "562219",
          "_desc": {
            "NAICS_CODE": "562219",
            "NAICS_DESCRIPTION": "Other Nonhazardous Waste Treatment and Disposal"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 83765,
          "ProcessID": 63317,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 583765,
          "ProcessID": 63317,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43907,
      "SummaryText": "Plum Creek Wastewater Treatment Plant (PCWWTP)\n\nExecutive Summary, Plum Creek Wastewater Treatment (PCWWTP), RMP 5 Year Submission\n\nAccidental Release and Emergency Response policies at PCWWTP\n\nPCWWTP is committed to safety and follows the concept that safety is never compromised.  Operating and training procedures are in place to prevent the accidental release of chlorine gas.  These procedures cover the unloading of 1-ton chlorine cylinders, leak testing of chlorine cylinders and daily system inspection.  These measures have resulted in no accidental release of chlorine gas from this facility.  PCWWTP maintains an excellent relationship with the local fire, and emergency response agencies.  These groups have been involved with PCWWTP on a regular basis, which includes training on-site of the operators by the fire department in the use of full-face air supply equipment.\n\nFacility Description and the Regulated Substances Handled\n\nPCWWTP treats approximately 3.7 million gallons per day of raw domestic sewage wastewater.  The chlorine is used for the purpose of disinfecting the treated water, or effluent, as it leaves the plant.  The chlorine is supplied in one (1) ton and 150-lbcylinders.  A maximum of two (2) one-ton cylinders and two (2) 150-lb cylinders are stored at the site.  This is the only chemical substance at this facility that is regulated under the USEPA Accidental Release Prevention Program.\n\nChlorine containers are thoroughly inspected for mechanical integrity and leaking valves prior to leaving the supplier?s premises.  The containers are off-loaded from the delivery truck at the treatment plant by an overhead crane with a lifting beam that is specially designed for the one-ton containers.  The off-loaded containers are inspected by PCWWTP personnel.  There are two identical systems that can deliver chlorine gas, at the correct flow rate to the wastewater.  One system is normally active with the other on stand-by. \n\nThe chlorine gas is drawn from the c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43907,
      "SummaryText": "ontainer by inducing a vacuum in the line after the chlorinator.  The flow of  process water through an injector creates a vacuum in the chlorine supply line and also mixes the chlorine gas with the process water.  If the water to the ejector is stopped for any reason, or the vacuum is lost, the spring loaded gas inlet valve immediately closes to isolate the chlorinator from the chlorine gas supply.  The average chlorine usage is approximately 45 lbs per day.  \n\nAccidental Release Prevention\n\nAccidental releases of chlorine are prevented by routine training and adhering to the written operating procedures that cover the chlorination system from the unloading of chlorine containers through the mixing of chlorine gas with the process water.  These procedures cover normal operations and emergency operations where personnel may have to respond to an accidental release of chlorine.  The chlorine system is inspected at least once per shift (usually more often) and leak testing is performed on the valves and fittings when ton containers are changed-out and at other times if a leak is suspected. Employees that are responsible for disconnecting empty containers and connecting filled containers to the chlorination system have been trained on the operating procedures, inspection of valves, fittings, and the connected piping, and leak testing with an aqueous ammonia solution.  Aqueous ammonia reacts with chlorine gas to form a very visible white cloud.  An outside contractor inspects the chlorination system and performs preventive maintenance on this system once per year or more frequently if required. This insures that work or damaged parts are replaced and routine maintenance is performed on the chlorinators and other equipment.  These preventive measures have resulted in the absence of any accidental release of chlorine that resulted in personal injury or property damage since the treatment plant began operation. \n\nChlorine Institute?s Emergency Kits A and B are kept on-site"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43907,
      "SummaryText": ".  These kits contain the necessary tools and equipment to repair most leaks in the 150-lbs and 1-ton cylinders.    An electronic monitor continuously measures chlorine levels in the storage room and activates an alarm if chlorine is sensed.  \n\nIf a chlorine leak develops in a cylinder, connected piping, valves , or other equipment, a chlorine monitor will activate an automatic dial-up and sound an alarm.  \n\nThe chlorine storage area is equipped with a properly designed exhaust fan/ fresh air intake system.  \n\nFive Year Accident History\n\nPCWWTP has not had a reportable release of chlorine in the past five years.\n\nEmergency Response Program\n\nThe PCWWTP has in place an Off-Site Response Plan in the event of an accidental release of chlorine at the treatment plant.  This plan was developed in accordance with the provisions set forth in Title III of the superfund Amendments and the Reauthorization Act of 1986.  The plan assigns release response procedures to the emergency coordinator at the PCWWTP, Penn Hills Volunteer Fire Departments, the Local Police, Emergency Medical Services, and the Allegheny County Emergency Management Coordinator.  The plan is updated as necessary, including the list of emergency telephone numbers.  Penn Hills Volunteer Fire Company No. 4 has visited and conducted drills with the treatment plant personnel.  \n\nIf a chlorine leak develops in a container or in the connected piping, valves, or other equipment,a chlorine monitor in the chlorine storage area will activate an automatic dialup to alert plant personnel and an outside security firm.  If the chlorine release may travel off-site, the Off-site Response Plan will be activated.  If the chlorine release does not pose a threat to the general public, PCWWTP personnel will repair the leak.  PCWWTP has a windsocks installed near the chlorine building to determine the wind direction and the area that is likely to be affected by a chlorine release.\n  \nPlanned Changes to Improve Safety\n\nThe Authority"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43907,
      "SummaryText": " plans to Set-up a schedule for coordinated training with other offsite response personnel."
    }
  ]
}