{
  "FacilityID": 43943,
  "FacilityName": "AES Puerto Rico,LP",
  "FacilityStr1": "Carretera #3 KM142",
  "FacilityStr2": "Barrio Puente Jobos",
  "FacilityCity": "Guayama",
  "FacilityState": "PR",
  "FacilityZipCode": "00785",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "72057",
  "LEPC": "Guayama County",
  "FacilityLatDecDegs": "17.945028",
  "FacilityLongDecDegs": "-066.150278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.aes.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 160160420,
  "ParentCompanyName": "AES Corporation",
  "Company2Name": null,
  "CompanyDUNS": 43857812,
  "Company2DUNS": 0,
  "OperatorName": "AES Puerto Rico,LP",
  "OperatorStr1": "P.O. Box 1890",
  "OperatorStr2": null,
  "OperatorCity": "Guayama",
  "OperatorStateFIPS": "PR",
  "OperatorZipCode": "00785",
  "OperatorZipCodeExt": null,
  "RMPContact": "Geannette M. Siberon",
  "RMPTitle": "Environmental Compliance",
  "FTE": 110,
  "OtherEPAFacilityID": "000009798250",
  "EPAFacilityID": "100000177845",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "TV-4911-30-0703",
  "SafetyInspectionDate": "2003-10-06 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-10-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-10-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-09-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-11-13 00:00:00",
  "DeRegistrationEffectiveDate": "2013-08-31 00:00:00",
  "AnniversaryDate": "2010-09-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 17.94503,
  "FRS_Long": -66.15028,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 63354,
      "AltID": "Water Treatment Systems",
      "FacilityID": 43943,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 64850,
          "ProcessID": 63354,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        },
        {
          "Process_NAICS_ID": 64851,
          "ProcessID": 63354,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 83806,
          "ProcessID": 63354,
          "ChemicalID": 62,
          "Quantity": 26600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 583806,
          "ProcessID": 63354,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43943,
      "SummaryText": "Facility Description:\n\nAES Puerto Rico is a co-generation power plant located in the town of Guayama, PR.  The plant generates approximately 454 MWs of electricity which is sold to the local utility Puerto Rico Electric Power Authority and also provides pressurized steam to a neighboring petrochemical facility owned by Chevron Phillips Puerto Rico Core which is located to the east of the facility.  The facility began commercial operation on November 29, 2002.\n\nThe facility is located on an 85 acre tract of land owned by AES Puerto Rico.  The facility also occupies associated rights of ways for transmission lines, conveyors, make-up water supply lines, process steam piping and roads.  To the south of the facility is an area of wetlands, the Las Mareas Harbor and the Caribbean Sea.  To the north and northwest are vacant lots, State Road #3, Wyeth Pharmaceuticals, Baxter Pharmaceuticals and Chemsource.  Directly west is a vacant lot with wetlands.\n\nThe facility consists of two boiler and steam turbine units, a wet cooling tower, water treatment, coal, limestone and ash handling systems.  The boilers are coal fired Circulating Fluidized Bed boilers with NOx, SOx and particulate matter air emissions control equipment.  Coal is delivered by ocean vessel to the docking facility at the Las Mareas Harbor.  Limestone is also delivered by ocean vessel or by truck.  All other plant consumables such as #2 fuel oil, propane, chlorine, sulfuric acid, sodium hydroxide and urea are delivered by truck.  \n       \nIt is the desire of the management of the AES Puerto Rico project to operate the plant in compliance with all applicable environmental and safety laws and regulations.  This Risk Management Plan (RMP) is being submitted as part of the facility's regulatory requirements for the storage and use up to 26,600 pounds of chlorine.  #2 fuel oil and propane are also stored on site above threshold quantities, but are not included in the RMP due to the fact they are used as fuels and i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43943,
      "SummaryText": "t is the understanding of this preparer that fuels are considered exempt from the RMP regulations.\n\nThe following is a list of pertinent regulations that apply to AES Puerto Rico:\n? OSHA?s Hazard Communications Standard 29 CFR 1910.1200\n? OSHA?s Process Safety Management Regulations; 29 CFR 1910.119\n? OSHA?s Emergency Action Plan Regulation; 29 CFR 1910.38(a)\n? OSHA?s HAZWOPER Regulation; 29 CFR 1910.120\n? EPA?s Oil Pollution and Prevention Regulations (SPCC and Facility Response Plan Requirements); 40 CFR part 112\n? EPA?s Risk Management Programs Regulations; 40 CFR part 68\n? EPA?s Resource Conservation and Recovery Act; 40 CFR part 262 and 40 CFR part 279\n? EPA?s Standards of Performance for New Stationary Sources; 40 CFR part 60\n? EPA?s Clean Air Act Title V Operating Permit Requirements; 40 CFR part 71\n? EPA?s National Pollutant Discharge Elimination System, 40 CFR part 122\n? EPA?s Emergency Planning and Community Right to Know Act regulations; 40 CFR part 300\n? And relevant local and Puerto Rico laws and regulations\n\nPrevention Plan:\n\nThe facility currently has in effect a ?Safety Procedures Manual? which was developed and implemented by facility personnel.  This manual contains the procedures and plans required by the OSHA Process Safety Management Standard including hotwork permits, tagouts and a emergency action plan to provide a continued compliance with the RMP Accident Prevention Program Requirements.\n\nThe facility's chemical accident prevention plan is focused on training and preventive maintenance.  The initial operations team was indoctrinated on corporate culture and the required OSHA training.  Currently operator training consists of a qualifications book and systems walk down type of  training for certification of new employees and periodic initial and refresher classroom training for the required OSHA training.\n\nPreventive and corrective maintenance is scheduled, tracked and implemented through the use of a commercial maintenance management softwar"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43943,
      "SummaryText": "e program.  The initial schedules for preventive maintenance and inspections were developed according to manufacturer recommendations and good engineering practice.\n\nThe facility currently has an \"Oil and Chemical Spill Prevention, Control and Countermeasures (SPCC) Plan\" in place.  This plan includes on site spill response equipment and general procedures, spill response contractors and notification procedures.\n\nFive Year Accident History:\n\nThere have been no accidents involving the chlorine systems at AES Puerto Rico."
    }
  ]
}