{
  "FacilityID": 43957,
  "FacilityName": "Ferro Delaware River Plant",
  "FacilityStr1": "U.S. Route 130 South",
  "FacilityStr2": null,
  "FacilityCity": "Bridgeport",
  "FacilityState": "NJ",
  "FacilityZipCode": "08014",
  "Facility4DigitZipExt": "0309",
  "FacilityCountyFIPS": "34015",
  "LEPC": "Logan Twp LEPC",
  "FacilityLatDecDegs": "39.792583",
  "FacilityLongDecDegs": "-075.395278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G7",
  "LatLongDescription": "PU",
  "FacilityURL": "ferro.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1700707,
  "ParentCompanyName": "Ferro Corporation",
  "Company2Name": null,
  "CompanyDUNS": 4161477,
  "Company2DUNS": 0,
  "OperatorName": "Ferro Corporation",
  "OperatorStr1": "P.O. Box 309",
  "OperatorStr2": null,
  "OperatorCity": "Bridgeport",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08014",
  "OperatorZipCodeExt": "0309",
  "RMPContact": "John Ambrose",
  "RMPTitle": "Plant Manager",
  "FTE": 70,
  "OtherEPAFacilityID": "NJR000035865",
  "EPAFacilityID": "100000017983",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "BOP990001",
  "SafetyInspectionDate": "2005-08-08 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "US EPA RMP version, Ferro Delaware River Sept 2005",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-10-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-10-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-10-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-10-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 39.79079,
  "FRS_Long": -75.39426,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 63393,
      "AltID": "Benzyl Chloride",
      "FacilityID": 43957,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 64891,
          "ProcessID": 63393,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 83850,
          "ProcessID": 63393,
          "ChemicalID": 62,
          "Quantity": 182570.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 583850,
          "ProcessID": 63393,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 63394,
      "AltID": "Phosphate Esters",
      "FacilityID": 43957,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 64892,
          "ProcessID": 63394,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 83851,
          "ProcessID": 63394,
          "ChemicalID": 70,
          "Quantity": 216000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 70,
            "ChemicalName": "Phosphorus oxychloride  [Phosphoryl chloride]",
            "CASNumber": "10025-87-3",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 583851,
          "ProcessID": 63394,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 63395,
      "AltID": "Tetrathal",
      "FacilityID": 43957,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 64893,
          "ProcessID": 63395,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 83852,
          "ProcessID": 63395,
          "ChemicalID": 62,
          "Quantity": 181010.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 583852,
          "ProcessID": 63395,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 63396,
      "AltID": "Chlorine Tank Car Storage",
      "FacilityID": 43957,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 64894,
          "ProcessID": 63396,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 83853,
          "ProcessID": 63396,
          "ChemicalID": 62,
          "Quantity": 2160000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 583853,
          "ProcessID": 63396,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43957,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES                               Updated  9/27/2005\n\nAt the Ferro Delaware River Plant, we are committed to operating and maintaining all of our processes in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n?A description of our facility and use of substances regulated by the Environmental Protection Agency's (EPA) Risk Management Plan (RMP) regulation\n?An overview of our accidental release prevention programs\n?A five-year history of accidental releases of chemicals regulated by EPA's RMP\n?An overview of our emergency response program\n?An overview of improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\n?The certifications that EPA's RMP rule requires us to provide\n?The detailed information (called data elements) about our risk management program\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe Ferro Delaware River Plant produces the following products, using a variety of materials and processing operations: \n\n?Benzyl chloride, which is used as an intermediate to produce a variety of end-products, including plasticizers, perfumes, biocides, and flavorings.\n\n?Tetrachlorophthalic anhydride (brand name is Tetrathal?), which is used to produce pigments and polyester resin flame retardants.\n\n?Plasticizers, which are used to produce vinyl flooring, wire coating, caulk, and other soft vinyl end products.\n\n?Dibutyl phenyl phosphate (DBPP) and Tri-isobutyl phosphate (TiBP), which are used to make hydraulic fluids for use in aviation control systems.\n\nOur plant operates 24 hours, (7) days a we"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43957,
      "SummaryText": "ek, year-round, except for planned or unplanned downtime for maintenance or inventory control.  Our plant has operated safely since its initial startup in 1961 without a major incident affecting our community.\n\nIn our processes, we use the following chemicals that the EPA has identified as having the potential to cause significant offsite consequences in the event of a substantial accidental release. Our accidental release prevention programs and our contingency planning efforts help us effectively manage the hazards that are posed to our employees, the public, and the environment by our use of these chemicals:\n\nToxics\n\nOur facility uses two RMP-regulated toxic chemicals, chlorine and phosphorous oxychloride,  to produce our products.\n\nChlorine, which is purchased and not manufactured, is used at our site to produce benzyl chloride and Tetrathal?, and is stored in and distributed from railroad tank cars shared between the two processes.  Chlorine is a gas at normal pressure and temperature, but is stored as a liquid under pressure in the tank cars.  It is unloaded directly from the tank car into a steam-heated vaporizer, where it is heated up to vaporize the liquid chlorine for use in both the benzyl chloride and Tetrathal? processes.\n\nPhosphorus oxychloride (POCl3) is used in our Phosphate Esters manufacturing facility to manufacture dibutyl phenyl phosphate (DBPP), tri-isobutyl phosphate (TiBP) and several plasticizer products (Santicizers 141, 148, and 2148). Phosphorus oxychloride is received in tanker trucks and unloaded into a storage tank, from where it is transferred to the Phosphate Esters manufacturing process.\n\nFlammables:\n\nWe have no RMP-regulated flammables stored or handled at our facility.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nWe take a systematic, proactive approach to preventing accidental releases of hazardous chemicals.  Our management systems address each of the key features of successful preventio"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43957,
      "SummaryText": "n programs, including those incorporated into EPA, OSHA, and New Jersey Toxic Catastrophe Prevention Act requirements:\n\n?Inventory Control to minimize the quantity that could be released in an accident\n?Process Safety Information to ensure up-to-date parameters for safely operating the process\n?Process Hazards Analysis to identify and correct potential safety problems\n?Standard Operating Procedures which describe how to safely operate the process\n?Training to ensure that operators and mechanics are qualified to safely perform their job\n?Mechanical Integrity/Preventive Maintenance to inspect and test equipment to ensure mechanical integrity and prevent equipment failure\n?Management of Change to identify and address potential safety concerns associated with process modifications prior to installation\n?Pre-Startup Safety Review to ensure that process modifications are safe prior to start-up.\n?Annual Compliance Audits to verify that procedures are being followed and to institute corrective actions if necessary.\n?Incident Investigations to identify and address the root causes of incidents or near-misses to prevent recurrence\n?Employee Participation in all process safety management activities\n?Hot Work Permit to ensure that work involving flame, sparks or heat producing equipment is controlled to minimize the chance of a fire\n?Contractor Safety Program to ensure that only the safest contractor companies are hired to work in the plant, and to make sure that contract employees are aware of potential hazards and safety procedures and are trained to safely perform their job. A permit system is also in place to control contractor work and help ensure that it is done safely \n?Risk Assessment to estimate and reduce the likelihood and impact of potential accident scenarios\n?Breaking into Process Permit Procedure to ensure that proper precautions are taken when opening up process equipment to prevent release of hazardous chemicals\n?Comprehensive security program to deter, detect, "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43957,
      "SummaryText": "and delay an intruder onto our site so that we can respond promptly to any threat\n                                                                                                                                                                                       As part of our prevention efforts, we have implemented chemical-specific prevention steps:\n\nThe risk associated with chlorine releases is minimized by the following design, maintenance, and operating features:\n\n?Both the benzyl chloride and Tetrathal? processes are monitored, alarmed, and  interlocked to shut down if any problem occurs, using computer control systems. \n?Atmospheric chlorine sensors are in place to quickly detect a leak in the  unloading area if it occurs\n?Vents and relief devices are connected to scrubbers, where the chlorine is  neutralized with caustic soda\n?Periodic thickness checks are made on vessels and process piping to make sure that internal corrosion is not taking place which could result in equipment failure. \n?Special corrosion-resistant Monel hoses are used to connect tank cars to the  process, and these are replaced every 6 months. \n?A specially designed tank car-mounted valve and an excess-flow valve are used  to allow the car to be shut off remotely if a leak occurs in the unloading line.\n?Both American Petroleum Institute (API) and plant standards are used to ensure proper design, installation, operation, and maintenance of chlorine systems.\n?A special capping kit is available to seal any leaks in the tank car  unloading fittings.\n\nThe risk of phosphorus oxychloride releases is minimized by a number of features:\n\n?The Phosphate Esters process is monitored, alarmed, and interlocked to shut down if a problem occurs, using computer control systems.\n?Atmospheric sensors are installed to quickly detect a leak if one occurs.\n?Phosphorus oxychloride is unloaded and stored in an enclosed building vented  to a scrubber, so that leaks and resulting vapors are fully contained. \n?Spec"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 43957,
      "SummaryText": "ial spill blanketing systems are provided in case of a spill  which would  minimize the formation of hazardous vapors.\n?Both API and plant standards are used to minimize the potential for a release,  including design, installation, operation, and maintenance of phosphorus oxychloride handling systems.\n\nThe risk of hydrogen chloride releases is minimized primarily through use of corrosion-resistant piping and vent scrubbing equipment. Atmospheric HCl sensors are installed to quickly detect a leak if one occurs..\n\nThese individual elements of our prevention program work together to prevent accidental chemical releases.  Our company and our employees are committed to the standard that these management systems set for the way we do business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nWe keep records for all significant accidental chemical releases that occur at our facility.  There have been no accidental chemical releases of materials covered under EPA's RMP rule during the past five years.\n                                                                                                                                                                           EMERGENCY RESPONSE PROGRAM\n\nThe Ferro Delaware River Plant maintains a comprehensive emergency response plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning.  Our program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, we coordinate our plan with the community emergency response plan.  \n\nFeatures of our emergency response plan include the following:\n\n?Atmospheric monitors to provide prompt detection of leaks.\n?A plant alarm system to notify everyone of an incident\n?Department-specific emergency procedures which address poten"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 43957,
      "SummaryText": "tial incidents\n?Remote shutdown capability to permit quick process isolation and shutdown.\n?A Dispersion Modelling System to assess potential for off-site impact of a release.\n?Emergency generators to provide backup electrical power to critical equipment in the event of a power failure.\n?Fire Protection systems for all process areas handling flammable materials, as well as 1.25 million gallons of firewater storage and primary and backup fire pumps.\n?An Emergency Brigade trained to respond to fires and chemical releases. The brigade includes two volunteer firefighters.\n?Emergency Response Training of all employees, on at least an annual basis, in their emergency responsibilities.\n?Emergency Drills at least annually with outside responders to test performance of the Emergency Response Plan.\n\nCHANGES TO IMPROVE SAFETY\n\nOur plant has practiced good process safety management for many years, and many improvements have already been made, including:\n\n?Atmospheric monitors to provide prompt detection of leaks.\n?Reduced on-site inventory of phosphorus oxychloride through installation of a smaller storage tank.\n?Construction of a full enclosure for phosphorus oxychloride unloading and storage to contain any leaks.\n?Installation of scrubbers for process vents which could release hazardous vapors to the atmosphere.\n?Installation of process control systems with backup power to better monitor processes and take immediate action if a problem occurs.\n?Installation of a remotely-operated shutdown for chlorine tank cars\n?Relocation of the chlorine vaporizer close to the tank car unloading to minimize the amount of liquid chlorine handled (liquid chlorine is much more hazardous than chlorine vapor since it expands to 460 times its volume if released).\n?Elimination of the phosphorus oxychloride Weigh Tank in order to minimize the amount of this material in the process.\n?Installation of emergency generators to provide backup electrical power to critical equipment in the event of a power "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 43957,
      "SummaryText": "failure.\n?Operator certification program to ensure that operators are fully qualified to perform their jobs.\n?Certification of inspectors for testing of critical equipment.\n\nPlanned improvements include on-going followup on recommendations made as a result of incidents and periodic process hazards analyses to reduce the potential and impact of releases of hazardous chemicals."
    }
  ]
}