{
  "FacilityID": 43991,
  "FacilityName": "Sasol North America Inc.",
  "FacilityStr1": "3441 Fairfield Road",
  "FacilityStr2": null,
  "FacilityCity": "Baltimore",
  "FacilityState": "MD",
  "FacilityZipCode": "21226",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24510",
  "LEPC": "Baltimore City LEPC",
  "FacilityLatDecDegs": "39.236111",
  "FacilityLongDecDegs": "-076.571944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": "www.sasolnorthamerica.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3065984,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sasol North America Inc.",
  "OperatorStr1": "3441 Fairfield Road",
  "OperatorStr2": null,
  "OperatorCity": "Baltimore",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21226",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike Thomas",
  "RMPTitle": "Plant Manager",
  "FTE": 65,
  "OtherEPAFacilityID": "21226VSTCH3441",
  "EPAFacilityID": "100000040261",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "24-510-00100",
  "SafetyInspectionDate": "2003-05-08 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-10-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-10-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-10-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-12-12 00:00:00",
  "DeRegistrationEffectiveDate": "2007-12-03 00:00:00",
  "AnniversaryDate": "2010-10-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 39.23596,
  "FRS_Long": -76.57819,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 63473,
      "AltID": "Linear alkylbenzene unit",
      "FacilityID": 43991,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 64971,
          "ProcessID": 63473,
          "NAICSCode": "325192",
          "_desc": {
            "NAICS_CODE": "325192",
            "NAICS_DESCRIPTION": "Cyclic Crude and Intermediate Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 83943,
          "ProcessID": 63473,
          "ChemicalID": 54,
          "Quantity": 44000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 54,
            "ChemicalName": "Hydrogen chloride (anhydrous) [Hydrochloric acid]",
            "CASNumber": "7647-01-0",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 83944,
          "ProcessID": 63473,
          "ChemicalID": 125,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 583943,
          "ProcessID": 63473,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 583944,
          "ProcessID": 63473,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43991,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies\n\nSafety, health and protection of the environment form an integral part of Sasol North America?s planning and decision making.  Sasol North America is committed to:\n-    Implementing the American Chemistry Council?s Responsible Care? initiative  \n-    Continually improving safety, health and environmental performance\n-    Complying, as a minimum, with all applicable legal and other agreed requirements\n-    Making safety, health, environmental control and pollution prevention essential and integral parts of product and facility design, construction and operation\n-    Promoting dialogue with stakeholders about safety, health and environmental performance\n-    Implementing internationally recognised safety, health, environmental and quality management systems\n-    Developing and implementing inherently safer and cleaner technologies\n-    Informing and appropriately training all employees and contractors on safety, health and environmental matters\n-    Responding effectively to safety, health and environmental emergencies involving operations and products\n-    Benchmarking internationally on best safety, health and environmental practices\n-    Sharing safety, health and environmental risk reduction best practices throughout Sasol\n-    Setting and periodically reviewing performance versus objectives and targets\n-    Providing appropriate resources required to implement the above\n\nStationary Source and Regulated Substances Handled\n\nSasol North America's Baltimore plant uses by-products from petroleum refinery operations to produce linear alkylbenzene (LAB) and other specialty chemicals.  LAB is used in the production of household detergents.  The Baltimore plant uses hydrogen chloride gas to promote chemical reactions within the LAB process.  Hydrogen chloride gas is a regulated toxic substance.  The Baltimore plant also uses pentane as a processing aid within the LAB process.  Pentane is a regulated flammable substance.\n\nProcess Safety Information\n"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43991,
      "SummaryText": "\nThe Baltimore plant maintains a variety of technical documents that are used to help maintain safe operation of plant processes.  These documents address chemical properties and associated hazards, limits for key process parameters, specific chemical inventories and equipment design basis/configuration information.  Specific departments within the plant are assigned responsibility for maintaining up-to-date process safety information.  Employees are provided training on how to locate the information from computer terminals.\n\nChemical specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDS).  This information is supplemented by documents that address known corrosion concerns and hazards associated within inadvertent mixing of specific chemicals.  Safety related limits for specific process parameters (e.g. temperature, pressure, composition, etc.) have been documented.  Processes are maintained within these limits using process controls, monitoring instruments, protective instrument systems and trained personnel.\n\nThe Baltimore plant also maintains an electronic database, accessible to both employees and contractor supervision, which provides information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, electrical classification, etc.  In combination with written procedures and trained personnel, this information provides a basis for establishing inspection and maintenance activities as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not comprised.\n\nProcess Hazard Analysis (PHA)\n\nThe Baltimore plant has a comprehensive program to help ensure that the hazards associated with the various processes are identified and controlled.  Within this program, each process is systematically examined to identify hazards a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43991,
      "SummaryText": "nd ensure that adequate controls are in place to manage these hazards.\n\nThe Baltimore plant primarily uses the hazard and operability (HAZOP) analysis technique to perform these evaluations.  HAZOP analysis is recognized as one of the most systematic and thorough hazard evaluation techniques.  HAZOP analyses are conducted using a team of people who have operating and maintenance experience and engineering expertise.  The team identifies and evaluates hazards of the process and accident prevention and mitigation measures, and makes recommendations for additional prevention and/or mitigation measures where deemed necessary.\n\nHAZOP team findings are made available to personnel who operate and maintain the process for comments, and forwarded to management for resolution.  Implementation of mitigation options in response to PHA findings is based on a relative ranking assigned by the PHA team.  This ranking helps ensure that potential accident scenarios assigned the highest rank receive immediate attention.  All approved mitigation options that are implemented in response to PHA findings are tracked until complete.  The final resolution of each finding is documented and retained.\n\nOperating Procedures\n\nOperators, supervisors and plant engineers work together to develop and maintain operating procedures.  These procedures define how tasks related to process operations are safely performed.  At the Baltimore plant, operating procedures are used to train employees and serve as reference guides for appropriate actions to take during both normal operations and process upsets.  Operating procedures include:\n-    Steps for safely conducting activities\n-    Applicable process safety information, such as safe operating limits,\n-    Safety and health considerations, such as chemical hazards, personnel protective equipment required and steps to take if exposed to a particular chemical.\n\nPlant personnel develop and maintain operating procedures that cover all phases of operations, including i"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43991,
      "SummaryText": "nitial startup, normal operation, normal shutdown, emergency shutdown, startup following a turnaround or emergency shutdown, and temporary operations.\n\nTraining\n\nThe Baltimore plant trains its workers to safely and effectively perform their assigned tasks.  The training program includes both initial and refresher training.\n\nAll new operators receive several weeks of comprehensive training before being assigned to a specific operating position.  This training includes training on specific types of equipment, such as pumps and compressors, a general overview of the process, properties of hazardous substances in the process and a detailed review of complex procedures such as safe work practices and emergency response.  Written tests are used to verify that employees understand the training material before a new employee can report to a process unit.  When a new employee reports to a particular process unit, he/she then receives detailed training with respect to process specific procedures.  When the new hire has demonstrated, through hands-on demonstration in the field, mastery of process specific operating procedures for specific tasks, he/she is allowed to begin work in a specific operating position.\n\nRefresher training covers (1) a general overview of the process, (2) the properties and hazards of the substances in the process, and (3) a detailed review of the process operating procedures and safe work practices.  Demonstration in the field is used to verify that employees understand the training before an employee can resume work in the process.  Operators are consulted in safety meetings and through questionnaires regarding effectiveness and frequency of training.  Recommendations are reviewed and changes to the training program are implemented as appropriate.\n\nManagement of Change\n\nThe Management of Change procedure at the Baltimore plant evaluates all proposed changes to chemicals, equipment, procedures and controls within covered processes to help ensure that a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 43991,
      "SummaryText": " change does not adversely affect the safety of plant operations.  Proposed changes are reviewed and approved by qualified personnel, process safety information and procedures are updated, and affected employees are notified of the change.\n\nPre-Startup Safety Review (PSSR)\n\nThe Baltimore plant conducts a safety review of new and modified processes before the process is placed in service.  The purpose of the PSSR is to ensure that processes, procedures and personnel are appropriately prepared for startup prior to startup.  The review provides an additional check to make sure that construction is in accordance with design specifications and that all supporting systems are operationally ready.  The PSSR review team uses checklists to verify all aspects of readiness.  A PSSR involves field verification of construction and serves a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\n\nMechanical Integrity\n\nThe Baltimore plant has well-established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, emergency shutdown systems and rotating equipment (pumps and compressors) in a safe operating condition.  The basic aspects of this program include (1) maintenance procedures, (2) personnel training in maintenance procedures, (3) equipment inspections and testing, (4) correction of identified deficiencies, and (5) quality assurance measures.  In combination, these activities form a system that maintains the mechanical integrity of the process.\n\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices.  Written procedures help ensure that work is performed in a consistent manner and provide a basis for training.  Inspections and tests are performed to help ensure that equipment functions as intended, a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 43991,
      "SummaryText": "nd to verify that equipment is within acceptable limits (e.g. adequate wall thickness for pressure vessels).  If a deficiency is identified, equipment is repaired in a timely manner.  All outstanding deficiencies are tracked until corrective action has been implemented and documented.\n\nAnother integral part of the mechanical integrity program is quality assurance.  The Baltimore plant incorporates quality assurance into equipment purchase and repairs. This helps ensure that new equipment is suitable for intended use and that proper materials and spare parts are used when repairs are made.\n\nSafe Work Practices\n\nThe Baltimore plant has a long-standing safe work program in place to ensure worker safety.  Examples of the program include (1) control of the entry/presence/exit of support personnel, (2) lockout/tagout procedures to ensure isolation of energy sources for equipment undergoing maintenance, (3) procedures for safe removal of hazardous materials before process piping or equipment is opened, (4) a permit and procedures to conduct spark producing activities (i.e, hot work), (5) a permit and procedures to ensure that adequate precautions are in place before entry into a confined space, and (6) procedures to ensure that hazardous jobs are closely coordinated by qualified supervision.  These procedures, along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\n\nIncident Investigation\n\nThe Baltimore plant investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public or the environment in order to prevent similar incidents from occurring in the future.  Plant employees are trained to identify and report any incident requiring investigation.  Investigations are initiated within 48 hours of an incident and are usually performed using formal root cause analysis.  Results of investigations are documented and appropriate changes are made.\n\nEmployee P"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 43991,
      "SummaryText": "articipation\n\nThe Baltimore plant maintains a written employee participation program to help ensure that safety and environmental concerns of plant workers are addressed.  The plant encourages active participation of personnel in safety, health and environmental programs at the plant.  Employees are involved in all aspects of the prevention program, including PHAs (Process Hazard Analyses), development of operating procedures, management of change and incident investigations.\n\nCompliance Audits\n\nThe Baltimore plant audits chemical processes to be certain that the prevention program effectively addresses safety, health and environmental requirements. The audit team may include consultants or Sasol North America personnel who are knowledgeable in plant processes.  The team evaluates whether the prevention program satisfies the requirements of the RMP rule and whether the prevention program is sufficient to ensure safe operation of the plant.  The results of the audit are documented, recommendations are resolved and appropriate enhancements are made to plant operations.\n \nContractors\n\nThe Baltimore plant has established a program to help ensure that contractor activities are performed in a safe manner.  The program reviews the safety record of contractors to ensure only contractors who can perform the desired task safely are hired.  The plant communicates to contractors the hazards of the process on which they and their employees will work, Baltimore plant safe work practices and Baltimore plant emergency response procedures.  The plant requires that contractors train each of their employees on safety requirements.  The plant periodically evaluates contractor safety performance and training documents to help ensure that safe practices are followed.\n\nFive Year Accident History\n\nThe Baltimore plant experienced no accidents during the last five years that involved a regulated substance or extremely hazardous substance, and that resulted in deaths, injuries or significant "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 43991,
      "SummaryText": "property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.\n\nEmergency Response Program\n\nThe Baltimore plant emergency response program has been developed to meet the emergency planning, response, and notification requirements of the following regulations:\n-    OSHA 29 CFR 1910.38 (a) - Employee Emergency Action Plans\n-    OSHA 29 CFR 1910.120 (q) - Hazardous Waste Operations and Emergency Response (HAZWOPER)\n-    OSHA 29 CFR 1910.110 (n) - Process Safety Management of Highly Hazardous Chemicals\n-    OSHA 29 CFR 1910 Subpart L - Fire Protection\n-    EPA 40 CFR Part 302.6 - Notification Requirements\n-    EPA 40 CFR Part 355.40 - Emergency Planning and Release Notification\n-    EPA 40 CFR Part 68 - Risk Management Programs for Chemical Accidental Release Program\n-    EPA 40 CFR Part 355.30 - Facility Coordinator and Emergency Response Plan\n-    EPA 40 CFR Part 112 - Facility Response Plan\n-    EPCRA 302 - List of Extremely Hazardous Substances\n-    Coast Guard 33 CFR Part 154 Subpart F - Facility Response Plan\n\nThe emergency response strategy for the Baltimore plant is to prevent and/or control emergency situations via the use of engineering, design and fixed protection systems.  Plant personnel, in combination with the Baltimore City Fire Department, are available 24 hours per day and trained to respond and take actions to contain, control and mitigate any release that might occur.  Emergency responders have access to on-site and off-site emergency equipment that is appropriate for situations that could possibly occur at the plant.  In addition to the considerable on-site resources, the Baltimore plant is a member of the South Baltimore Industrial Mutual Aid Program (SBIMAP).  This membership allows the plant (if needed) to draw on the emergency response resources of other industries in the immediate area.\n\nDrills are periodically conducted either individually or jointly with the LEPC and SBIMAP to assess emergency response "
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 43991,
      "SummaryText": "at the Baltimore plant and/or the surrounding district.\n\nThe Baltimore plant is a participant in the community planning process cooperating with the Baltimore City Local Emergency Planning Committee.  A copy of the plant's Emergency Response Plan has been forwarded to the Baltimore City Fire Department per the requirements of 40 CFR 355.  \n\nPlanned Changes to Improve Safety\n\nThe Baltimore plant constantly strives to improve safety and reduce risk through auditing, suggestions from employees, incident investigations, advancements in technology and the use of engineering standards and specifications.  For example:\n-    A new process technology was installed in 2002 that eliminated chlorine storage and use.\n-    A process change was implemented in 2004 that eliminated propane storage and use."
    }
  ]
}