{
  "FacilityID": 44096,
  "FacilityName": "DPC ENTERPRISES, L.P.",
  "FacilityStr1": "3 RIVERSIDE LANE",
  "FacilityStr2": null,
  "FacilityCity": "CHATTANOOGA",
  "FacilityState": "TN",
  "FacilityZipCode": "37406",
  "Facility4DigitZipExt": "1725",
  "FacilityCountyFIPS": "47065",
  "LEPC": "HAMILTON COUNTY LEPC",
  "FacilityLatDecDegs": "35.084444",
  "FacilityLongDecDegs": "-085.279167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "DPC ENTERPRISES, L.P.",
  "OperatorStr1": "P.O. BOX 24600",
  "OperatorStr2": null,
  "OperatorCity": "HOUSTON",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77229",
  "OperatorZipCodeExt": "4600",
  "RMPContact": "JOY MONTANIO",
  "RMPTitle": "ENVIRONMENTAL AFFAIRS MGR",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000084614",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "DPCE-CHATTANOOGA",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-10-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-10-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-10-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-11-16 00:00:00",
  "DeRegistrationEffectiveDate": "2015-10-30 00:00:00",
  "AnniversaryDate": "2009-10-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 35.08257,
  "FRS_Long": -85.2692,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 63639,
      "AltID": "Compressed Gas Repkging",
      "FacilityID": 44096,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 65142,
          "ProcessID": 63639,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 84198,
          "ProcessID": 63639,
          "ChemicalID": 62,
          "Quantity": 1000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 84199,
          "ProcessID": 63639,
          "ChemicalID": 49,
          "Quantity": 650000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 584198,
          "ProcessID": 63639,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 584199,
          "ProcessID": 63639,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 44096,
      "SummaryText": "EXECUTIVE SUMMARY\n\n1.    Accidental Release Prevention and Emergency Response Policies\nDPC Enterprises (DPCE) is strongly committed to employee, public and environmental safety.  This \ncommitment is demonstrated by our comprehensive accidental release prevention program that covers \nareas such as design, installation, operating procedures, maintenance, and employee training associated \nwith the processes at our facility.  It is our policy to comply with all applicable federal, state, and local \nregulations as well as implement appropriate controls to prevent possible releases of regulated substances.  \nUnforeseeably, if such a release does occur, our highly trained emergency response personnel are at hand \nto control and mitigate the effects of the release.\n\nOur emergency response program includes procedures for notification of the local fire department; \nnotification of any potentially affected neighbors; and notification of local, state and federal agencies.   \nSafety is an essential part of our operations, the safety devices built-in to the design of this facility, the \nsafe handling procedures that we use, and the extensive training of our personnel.\n\n2.    The Stationary Source and the Regulated Substances Handled\nDPCE whose primary activities encompass distributing and repackaging inorganic chemicals and \ncompressed gases as well as manufacturing water treatment products. For example, chlorine is used to \nproduce sodium hypochlorite commonly know as household bleach.\n \nWe handle Chlorine and Sulfur Dioxide (anhydrous) for use by our customers.\n\n3.    The Process Safety Management Program\nOur facility has taken all the necessary steps to comply with the accidental release prevention \nrequirements set out under 40 CFR Part 68 of the EPA.  A number of processes at this facility are subject \nto the OSHA PSM standard under 29 CFR 1910.119.  The following sections briefly describe the \nelements of the release prevention program that is in place at our stationary source.\n\nPro"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 44096,
      "SummaryText": "cess Safety Information\nDPCE maintains a detailed record of safety information that describes the chemical hazards, operating \nparameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are \nidentified and controlled efficiently.  The methodology used to carry out these analyses is the What \nif/Checklist (combined).  The studies were undertaken by a team of qualified personnel with expertise in \nengineering and process operations and are revalidated every 5 years as required or as necessary.  Any \nfindings related to the hazard analysis are addressed in a timely manner.  The most recent PHA/update \nwas performed on 7/24/2004.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, DPCE maintains written \noperating procedures.  These procedures address various modes of operation such as initial startup, \nnormal operations, temporary operations, emergency shutdown, emergency operations, and normal \nshutdown.  The information is regularly reviewed and is readily accessible to operators involved in the \nprocesses.\n\nTraining\nDPCE has a comprehensive training program in place to ensure that employees who are operating \nprocesses are competent in the operating procedures associated with these processes.  Refresher training \nis provided at least every 3 years and more frequently as needed.\n\nMechanical Integrity\nDPCE carries out highly documented maintenance checks on process equipment to ensure proper \noperations.  Process equipment examined by these checks includes among others; pressure vessels, \nstorage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  \nQualified personnel carry out maintenance operations with previous training in maintenance practices.  \nFurthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies \n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 44096,
      "SummaryText": "identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at DPCE to manage changes in process chemicals, technology, equipment \nand procedures.  Process operators, maintenance personnel or any other employee whose job tasks are \naffected by a modification in process conditions are promptly made aware of and offered training to deal \nwith the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are \nconducted as a regular practice at DPCE.  These reviews are conducted to confirm that construction, \nequipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment \ninto operation.\n\nCompliance Audits\nDPCE conducts audits on a regular basis to determine whether the provisions set out under the RMP rule \nare being implemented.  These audits are carried out at least every 3 years and any corrective actions \nrequired as a result of the audits are undertaken in a safe and prompt manner.  The most recent \ncompliance audit conducted was on 6/26/2005.\n\nIncident Investigation\nDPCE promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic \nrelease of a regulated substance.  These investigations are undertaken to identify the situation leading to \nthe incident as well as any corrective actions to prevent the release from reoccurring.  All reports are \nretained for a minimum of 5 years.\n\nEmployee Participation\nDPCE truly believes that process safety management and accident prevention is a team effort.  Company \nemployees are strongly encouraged to express their views concerning accident prevention issues and to \nrecommend improvements.  In addition, our employees have access to all information created as part of \nthe facility's implementation of the RMP rule, including information resulting from process hazard \nanalyses in particular.\n\nContract"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 44096,
      "SummaryText": "ors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction \nactivities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is \ncarried out.  DPCE has a strict policy of informing the contractors of known potential hazards related the \ncontractor's work and the processes.  Contractors are also informed of all the procedures for emergency \nresponse should an accidental release of a regulated substance occur.\n\n4.    Five-year Accident History\nDPCE has had an excellent record of preventing accidental releases over the last 5 years.  Due to our \nstringent release prevention policies, there have been no accidental releases of a regulated substance \nduring this period.\n\n5.    Emergency Response Plan\nDPCE carries a written emergency response plan to deal with accidental releases of hazardous materials.  \nThe plan includes all aspects of emergency response including adequate first aid and medical treatment, \nevacuations, notification of local emergency response agencies and the public, as well as post-incident \ndecontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In \naddition, the plan is promptly updated to reflect any pertinent changes taking place within our processes \nthat would require a modified emergency response.\n\nThe Hamilton County LEPC is the Local Emergency Planning Committee (LEPC) with which our \nemergency plan has been coordinated and verified.\n\n6.    Planned Changes to Improve Safety\nDPCE continues to participate in the Chlorine Institute programs, and continuously works to improve our \noperations."
    }
  ]
}