{
  "FacilityID": 44361,
  "FacilityName": "Petrosol International, Inc.",
  "FacilityStr1": "153 Airport Road",
  "FacilityStr2": null,
  "FacilityCity": "Thompson Falls",
  "FacilityState": "MT",
  "FacilityZipCode": "59873",
  "Facility4DigitZipExt": "9407",
  "FacilityCountyFIPS": "30089",
  "LEPC": "Sanders County LEPC",
  "FacilityLatDecDegs": "47.575100",
  "FacilityLongDecDegs": "-115.266200",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.petrosolinc.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Petrosol International, Inc.",
  "OperatorStr1": "300 N. Mullan Rd.",
  "OperatorStr2": "Suite 201",
  "OperatorCity": "Spokane",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "99206",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000173448",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2005-11-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-11-29 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2005-11-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2011-01-06 00:00:00",
  "DeRegistrationEffectiveDate": "2010-05-28 00:00:00",
  "AnniversaryDate": "2010-11-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.6",
  "FRS_Lat": 47.5751,
  "FRS_Long": -115.2662,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "facility was sold to Energy Partners",
  "_processes": [
    {
      "ProcessID": 64037,
      "AltID": "Bulk Propane Storage",
      "FacilityID": 44361,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 84716,
          "ProcessID": 64037,
          "ChemicalID": 98,
          "Quantity": 303872.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 65556,
          "ProcessID": 64037,
          "NAICSCode": "454312",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 23735,
              "Process_NAICS_ID": 65556,
              "SafetyReviewDate": "2004-06-01 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "Yes",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2004-11-01 00:00:00",
              "ChangeCompletionDate": "2006-08-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "internal valves",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "product control management system",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "not required at this time by code",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2005-10-01 00:00:00",
              "TrainingReviewDate": "2005-10-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "National Propane Gas Assoc (certified employee training program)",
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2005-10-01 00:00:00",
              "EquipmentInspectionDate": "2005-11-01 00:00:00",
              "EquipmentTested": "Hoses, Cables, Acme Threads, Valves, Emergency shut-off system",
              "ComplianceAuditDate": "2004-06-01 00:00:00",
              "AuditCompletionDate": "2006-06-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 24844,
                  "PreventionProgram2ID": 23735,
                  "ProcessChemicalID": 84716
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 44361,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2005-10-01 00:00:00",
    "ERTrainingDate": "2005-10-01 00:00:00",
    "CoordinatingAgencyName": "Thompson Falls Rural Fire Dept.",
    "CoordinatingAgencyPhone": "4068273731",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 44361,
      "SummaryText": "1. Accidental Release Prevention and Emergency Response Policies\r\nThe primary function of Petrosol International Inc. is to act as a propane distribution facility. By virtue of the flammable effects associated with propane, it is necessary to observe certain safety precautions in handling propane to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as the health of our co-workers, and to reduce the threat to nearby members of the community. We are strongly committed to employee, public and environmental safety. Safety at our facility depends upon the manner in which we handle propane as well as on the various safety devices incorporated into the design of our equipment. Furthermore, comprehensive training received by our employees adds to the inherent safety of our distribution facility. \r\n\r\nOur emergency response program is based upon the (NPGA's LP-Gas Safety Handbook/ Guidelines for Developing Plant Emergency Procedures/ How to Control LP-Gas Leaks and Fires). In addition to the presence of appropriate controls to prevent possible releases of propane, if a release does occur, we are completely coordinated with Thompson Falls Rural Fire Department, which provides highly trained emergency response personnel to control and mitigate the effects of the release. \r\n\r\n2. The Stationary Source and the Regulated Substances Handled\r\nThe primary purpose of this facility is to repackage and distribute propane to both retail and wholesale customers for use as a fuel. Propane arrives at our facility via (rail car / Truck) and is stored in 3 storage tanks. This facility has equipment for unloading rail cars and transports to unload transports and containers. Access to this site is restricted to authorized facility employees, authorized management personnel and authorized contractors. The regulated substance handled at this facility is propane. The maximum amount of propane that can be stored at this plant is 304,798 lbs. \r\n\r\n3. The Wors"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 44361,
      "SummaryText": "t Case Release Scenario(s) and the Alternative Release Scenario(s), Including Administrative Controls and Mitigation Measures to Limit the Distances for Each Reported Scenario\r\nWe have calculated worst case release scenarios based on the EPA approved RMP-COMP energy method. For alternative release scenario analyses, we have employed the look-up tables and equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance. The following paragraphs provides details of the chosen scenarios. \r\n\r\nThe worst case scenario submitted for propane involves a catastrophic release from PROPANE. The scenario involves the release of 117,024 lbs. of propane. It is assumed that the entire quantity is released as a vapor that finds an ignition source, with 10 percent of the released quantity participating in a vapor cloud explosion. Under worst case weather, the maximum distance of .44 miles was obtained corresponding to a flammable endpoint of 1 psi overpressure.\r\n\r\nThe alternative release scenario submitted for Program 2 flammable substances involves a release from PROPANE resulting in a Vapor Cloud Fire. In this scenario 2,330 lbs. of propane is released in 10 minutes. The release is also controlled by active mitigation measures that include excess flow valves. Under neutral weather conditions, the maximum distance to the flammable endpoint of Lower flammability is .07 miles.\r\n\r\n4. The General Accident Release Prevention Program and the Chemical-Specific Prevention Steps\r\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA. This facility was designed and constructed in accordance with NFPA-58 Standard, 1998 Standard. The following sections briefly describe the release prevention program that is in place at our stationary source.\r\n\r\nSafety Information\r\nPetrosol International Inc. maintains a detailed record of written safety information, which describes the chemical hazards,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 44361,
      "SummaryText": "operating parameters and equipment designs associated with all aspects of our distribution facility.\r\n\r\nHazard Review\r\nA checklist methodology is used to carry out hazard reviews at our facility. The reviews focus on operating procedures, equipment functions and handling practices to identify possible hazards. The studies are undertaken by a team of qualified personnel with extensive knowledge of facility operations and are revalidated at a regular interval of 3 years. Any findings related to the hazard reviews are addressed in a safe and timely manner.\r\n\r\nOperating Procedures\r\nFor the purpose of safely conducting activities within our covered processes. Petrosol International Inc. maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround. The information is regularly reviewed and is readily accessible to operators involved with the processes.\r\n\r\nTraining\r\nPetrosol International Inc. has a comprehensive training program in place to ensure that employees that are operating processes are completely competent in the operating procedures associated with these processes. New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently. Refresher training is provided annually and more frequently as needed.\r\n\r\nMaintenance\r\nPetrosol International Inc. carries out documented maintenance checks on process equipment to ensure proper functioning. Maintenance activities are carried out by qualified personnel with previous training in these practices. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\r\n\r\nCompliance Audits\r\nPetrosol International Inc. conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 44361,
      "SummaryText": "implemented. These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\r\n\r\nIncident Investigation\r\nPetrosol International Inc. promptly investigates any incident that has resulted in, or could reasonably result in, a catastrophic release of propane. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from recurring. All reports are retained for a minimum of 5 years.\r\n\r\n5. Five Year Accident History\r\nPetrosol International Inc. has had an excellent record of preventing accidental releases over the last 5 years. Due to our stringent release prevention policies, there has been no accidental release during this period.\r\n\r\n6. Emergency Response Plan\r\nPetrosol International Inc. carries a written emergency response plan to deal with accidental releases of propane. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post incident decontamination of affected areas. Our facility's emergency response plan is based upon the NPGA's LP-GAS Handbook / Guidelines for Developing Plant Emergency Response Procedures / How to Control LP-Gas Leaks and Fires. To ensure proper functioning our emergency response equipment is regularly inspected and serviced. In addition, this plan is promptly updated to reflect any changes taking place within our processes that would require a modified emergency response.\r\n\r\n7. Planned Changes to Improve Safety\r\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.\r\n\r\n8. Certification Statement\r\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is tru"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 44361,
      "SummaryText": "e, accurate and complete.\r\n\r\nName: \r\nSignature: \r\nTitle: \r\nDate signed:"
    }
  ]
}