{
  "FacilityID": 44404,
  "FacilityName": "Pregis Innovative Packaging, Inc.",
  "FacilityStr1": "8201 West Elowin Court",
  "FacilityStr2": null,
  "FacilityCity": "Visalia",
  "FacilityState": "CA",
  "FacilityZipCode": "93291",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.343863",
  "FacilityLongDecDegs": "-119.382479",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.pregis.com",
  "FacilityEmailAddress": "sgamertsfelder@pregis.com",
  "FacilityDUNS": 609692012,
  "ParentCompanyName": "AEA Investors LLC",
  "Company2Name": null,
  "CompanyDUNS": 7932858,
  "Company2DUNS": 7932858,
  "OperatorName": "Pregis Innovative Packaging, Inc.",
  "OperatorStr1": "8201 West Elowin Court",
  "OperatorStr2": null,
  "OperatorCity": "Visalia",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93291",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joe Minasola",
  "RMPTitle": "Plant Manager",
  "FTE": 95,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000045408",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "S-334-0-1",
  "SafetyInspectionDate": "2003-11-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Visalia",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-04-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-12-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-11-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-09-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 36.34356,
  "FRS_Long": -119.38287,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 64101,
      "AltID": "Foam Plastic Extrusion",
      "FacilityID": 44404,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 65620,
          "ProcessID": 64101,
          "NAICSCode": "32619",
          "_desc": {
            "NAICS_CODE": "32619",
            "NAICS_DESCRIPTION": "Other Plastics Product Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 84858,
          "ProcessID": 64101,
          "ChemicalID": 107,
          "Quantity": 49000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 107,
            "ChemicalName": "Isobutane  [Propane, 2-methyl]",
            "CASNumber": "75-28-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 584858,
          "ProcessID": 64101,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 44404,
      "SummaryText": "Pregis Innovative Packaging, Inc.\n\n1. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nWe at Pregis Innovative Packaging, Inc. are strongly committed to employee, public, and environmental safety. This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. Unforeseeably, if such a release does occur, we are coordinated with the Region 5 Local Emergency Planning Commission (LEPC) Inland South and the Visalia Fire Department to provide highly trained emergency response personnel to control and mitigate the effects of the release.\n\n2. THE STATIONARY SOURCE AND THE REGULATED SUBSTANCE HANDLED\n\nOur facility's primary activities encompass the manufacturing of foam products that are used as packaging material. We have one regulated substance present at our facility. This regulated substance is used as a blowing agent.\n\n3. GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE CHEMICAL SPECIFIC PREVENTION STEPS\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68 of the EPA. In addition, we have one process at our facility which is subject to the Occupational Safety & Health Administration (OSHA) Process Safety Management (PSM) standard under 29 CFR 1910.19. The following sections briefly describe the elements of the accidental release prevention program that are in place at Pregis Innovative Packaging, Inc.\n\nProcess Safety Information\nPregis Innovative Packaging, Inc. maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with the covered process.\n\nProcess Hazardous Analysis\nPregis Innovative Packaging, In"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 44404,
      "SummaryText": "c. conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently. HAZOP and/or What if methodology is used to carry out these analyses. These studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and revalidated at regular intervals of 5 years and when major changes are made to the covered process. Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purpose of safely conducting activities within the covered process, Pregis Innovative Packaging, Inc. maintains written operating procedures. These procedures address various modes of operation such as startup, shutdown, normal operations, temporary operations, emergency shutdown, and emergency operations. The information is reviewed on a regular basis and is readily accessible to operators involved in the process.\n\nTraining\nPregis Innovative Packaging, Inc. has a comprehensive training program to ensure that employees that are operating components of the covered process are competent in the operating procedures associated with these components. Refresher training is provided at least every three years and more frequently as needed.\n\nMechanical Integrity\nPregis Innovative Packaging, Inc. performs documented maintenance checks on covered process equipment to ensure proper operations.  Process equipment examined by these checks includes but is not limited to storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner. The maintenance operations are done by qualified personnel with previous training in maintenance practices; and these personnel are provided specialized training as needed.\n\nManagement of Change\nWritten procedures are in place at Pregis Innovative Packaging, Inc. to manage changes in covere"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 44404,
      "SummaryText": "d process chemicals, technology, equipment, and procedures. Operators, maintenance personnel or any other employee whose job tasks are affected by a modification in the covered process conditions are promptly made aware of and given training to deal with the modifications\n\nPre-startup Reviews\nPre-start up safety reviews related to additions and modifications to the covered process are conducted as a regular practice at Pregis Innovative Packaging, Inc. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nPregis Innovative Packaging, Inc. will continue to conduct periodic audits to ensure that the provisions set forth under the RMP and PSM rules are being implemented. Any corrective actions required as a result of the audits will be undertaken in a safe and prompt manner.\n\nIncident Investigation\nPregis Innovative Packaging, Inc. promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions that would prevent the release from reoccurring. All reports are retained at the facility for a minimum of 5 years.\n\nEmployee Participation\nPregis Innovative Packaging, Inc. truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and they actively participate in process safety management. In addition, Pregis Innovative Packaging, Inc.  employees have access to all information created as part of the facility's implementation of the RMP and PSM rules, including information resulting from process hazard analyses.\n\nContractors\nOn occasion, Pregis Innovative Packaging, Inc. hires contractors to conduct specialized mainten"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 44404,
      "SummaryText": "ance and construction activities. Prior to selecting a contractor, a thorough safety performance evaluation of the contractor is carried out. Pregis Innovative Packaging, Inc. has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the covered process. Contractors are also informed of all the procedures for emergency response should accidental release of a regulated substance occur.\n\n4. FIVE YEAR ACCIDENT HISTORY\nPregis Innovative Packaging, Inc. has an excellent record of preventing accidental releases over the last 5 years. As a result of Pregis Innovative Packaging, Inc.'s stringent release prevention program, there have been no significant accidental releases during this period.\n\n5. EMERGENCY RESPONSE PLAN\nPregis Innovative Packaging, Inc. maintains a written emergency evacuation plan for the safety of our employees during accidental releases of hazardous materials. The plan includes adequate first aid and medical treatment, evacuations and notification of local emergency response agencies. Pregis Innovative Packaging, Inc. employees do not respond to emergencies.\n\nEmergency notification equipment is regularly inspected and serviced to ensure proper functioning. Upon modification of the covered process, the plan is promptly updated to reflect any pertinent changes within the covered process that would require a modified emergency response.\n\n6. PLANNED CHANGES TO IMPROVE SAFETY\nPregis Innovative Packaging, Inc. has exemplary occupational safety and health programs which encompass employee involvement, recognition for safe work and continuous hazard identification activities. To enhance our continuous improvement in occupational safety and health, we utilize an employee driven system to identify opportunities for improvement."
    }
  ]
}