{
  "FacilityID": 44490,
  "FacilityName": "Motiva Enterprises LLC- Nashville Terminal",
  "FacilityStr1": "1717",
  "FacilityStr2": "61st Avenue, North",
  "FacilityCity": "Nashville",
  "FacilityState": "TN",
  "FacilityZipCode": "37209",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47037",
  "LEPC": "Davidson County LEPC",
  "FacilityLatDecDegs": "36.170000",
  "FacilityLongDecDegs": "-086.859444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": "www.motivaent.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Motiva Enterprises LLC",
  "Company2Name": null,
  "CompanyDUNS": 860146174,
  "Company2DUNS": 0,
  "OperatorName": "Motiva Enterprises LLC",
  "OperatorStr1": "1717",
  "OperatorStr2": "61st Avenue, North",
  "OperatorCity": "Nashville",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37209",
  "OperatorZipCodeExt": null,
  "RMPContact": "George Marlatt",
  "RMPTitle": "Complex/Terminal Manager",
  "FTE": 4,
  "OtherEPAFacilityID": "TND000792663",
  "EPAFacilityID": "100000193774",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "TN Depatment of Commerce and Insurance",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-12-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-12-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-12-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-12-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 64282,
      "AltID": "Butane Blending System",
      "FacilityID": 44490,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 65814,
          "ProcessID": 64282,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 85066,
          "ProcessID": 64282,
          "ChemicalID": 118,
          "Quantity": 248760.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 585066,
          "ProcessID": 64282,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 44490,
      "SummaryText": "The Motiva Enterprises, LLC - Nashville Terminal complies with the National Fire Protection Association #58 (2004 Edition) for Liquified Petroleum Gas Storage, and it is this Facility's policy to adhere to all Federal, State, and Local codes/laws.  If an emergency were to occur, it is this Facility's policy to notify the Nashville-Davidson County Metro Fire Department and the Davidson County LEPC, as appropriate, through the 911 service.  Medical emergencies will require notification of the Centennial, Babtist, Vanderbilt, and/or Saint Thomas Hospitals and associated ambulance service (Nashville-Davidson County Metro) via 911.  The Facility currently maintains a trained incipient stage fire and hazardous material emergency response team to respond to small or initial stages of an emergency.\n\nThe Motiva Enterprises, LLC- Nashville Terminal transfers/stores refined product (regular/premium gasoline and diesel fuel) and handles product additives, including the liquified butane blending system (direct injection into refined product pipelines).  The Risk Management Program covers the butane blending system including the associated piping, the 60,000 gallon vessel, the blending skid, sampling unit (Grabner), and the truck offloading station product injection points.\n\nThe Facility's worst case scenario is the failure of the blending system's 60,000 gallon liquified (pressure) butane vessel when filled to the greatest amount allowed (fill shutoff device at 85% with an alarm at 80%) resulting in a vapor cloud explosion.  The resulting distance to the endpoint (1 PSI overpressure) extends off-site 0.5 miles and includes both public and environmental receptors.  The Facility's alternate scenario (most-likely) is a truck \"pull-away\" resulting in a one minute pipe/hose release and explosion.  The resulting distance to endpoint (1 PSI overpressure) extends off-site including the contiguous railway, but does not affect other public (other than the facility itself) or environmental"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 44490,
      "SummaryText": " receptors.  \n\nThe Motiva Enterprises, LLC - Nashville Terminal complies with the U.S. Environmental Protection Agency's Accident Prevention Rules (40 CFR Part 68 Subpart D - Program Level 3).  Additionally, this plan meets the requirements of the U.S. Department of Labor- Occupational Safety and Health Administration Process Safety Management regulations for Highly Hazardous Chemicals (29 CFR Part 1910.119).  This butane blending system is designed, constructed, and maintained to meet or exceed the NFPA #58 requirements for Liquified Petroleum Gas Storage.  \n\nTo date, this Facility has never had an accident involving the butane blending system (new process) resulting in deaths, injuries, property/environmental damage, evacuations, or sheltering in-place.\n\nIn the event of an emergency involving the Nashville Terminal butane blending system, it is the policy of the Facility to initially contact the Nashville-Davidson County Metro  Fire Department and request their assistance.  The Facility maintains a trained (annually) incipient fire and hazardous substance emergency response team, as referenced above.  The Facility's emergency response plans are coordinated with the Nashville-Davidson County Metro Fire Department and the Davidson County LEPC.  The Nashville-Davidson County Metro Fire Department, which maintains a full hazardous response team, is aware of the Facility's butane blending system, access via Centennial Boulevard and 61st Avenue, and available fire suppression equipment including approximately twenty-four 20 lbs. ABC fire extinguishers, and water sources (nearest hydrant available at approximately 150 ft. distance from the vessel/off-loading point along 61st Avenue; additional units totaling three along the remainder of 61st Street and Centennial Boulevard).  Motiva Enterprises, LLC - Nashville Terminal maintains a vegetation control program to minimize plant growth within 10 ft. of the system."
    }
  ]
}