{
  "FacilityID": 44511,
  "FacilityName": "Sadler's Bar-B-Que Sales",
  "FacilityStr1": "1206 North Frisco Street",
  "FacilityStr2": null,
  "FacilityCity": "Henderson",
  "FacilityState": "TX",
  "FacilityZipCode": "75653",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48401",
  "LEPC": "Rusk County LEPC",
  "FacilityLatDecDegs": "32.162222",
  "FacilityLongDecDegs": "-094.827222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 26544346,
  "ParentCompanyName": "Sadler's Bar-B-Que Sales",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sadler's Bar-B-Que Sales, Inc.",
  "OperatorStr1": "1206 North Frisco Street",
  "OperatorStr2": null,
  "OperatorCity": "Henderson",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75653",
  "OperatorZipCodeExt": null,
  "RMPContact": "Taryn Howell",
  "RMPTitle": "Safety Coordinator",
  "FTE": 250,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000050543",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-07-07 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-12-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-12-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-12-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-12-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 32.15936,
  "FRS_Long": -94.82733,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 64304,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 44511,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 65836,
          "ProcessID": 64304,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 85093,
          "ProcessID": 64304,
          "ChemicalID": 56,
          "Quantity": 26000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 585093,
          "ProcessID": 64304,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 44511,
      "SummaryText": "1.    Accidental Release prevention and emergency response policies\n\nSadler?s Bar-B-Que Sales is committed to both the safety of our employees and that of the surrounding public, including both human health and the environment.  Safety is ensured through careful prevention measures and emergency planning.  The intent of our Prevention Program is the minimization of all risks that could possibly lead to an accidental release.  This program focuses primarily on the mechanical integrity of the process equipment and the training of its operators.  The Emergency Response Plan focuses on minimizing the potential impacts of an accidental release.  This is done by coordinating emergency actions with the Henderson Fire Department and ensuring that employees are trained on the proper response to an emergency situation.\n\n2.    The Stationary source and regulated substances handled\n\nSadler?s Bar-B-Que Sales is a prepared meat products facility.  The regulated substance handled at this plant is ammonia.  Ammonia is used as a refrigerant in the plant cooler and freezer system.  The maximum quantity of ammonia stored at the facility is 30,000 pounds.\n\n3.    The worst-case release scenario and the alternative release scenario, including administrative controls and mitigation measures to limit the distances for each reported scenario\n\nWorst-Case Scenario: Failure of the high pressure receiver outside the engine room when filled to the greatest amount allowed would release 11,000 pounds of ammonia.  Company policy limits the maximum filling capacity of this vessel to 30%.  It is assumed that the entire contents are released as vapor over a ten minute time span and are subjected to a wind speed of 1.5 m/s with a stability class of F.  The distance to the toxic endpoint for the worst-case scenario is 1.3 miles.\n\nAlternative Scenario:  The lifting of a pressure relief valve on the high pressure receiver outside the engine room.  Relief valves allow the escape of ammonia at a total flow rate of 1"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 44511,
      "SummaryText": "00 lbs/min.  Weather conditions are assumed to be average values of 3 m/s wind speed and stability class D.  The valves are assumed to be open 75% of the time during the release as the pressure builds and is relieved.  The distance to this endpoint is 460 feet and extends beyond the facility boundary.\n\n4.    The general accidental release prevention program and the specific prevention steps\n\nSadler?s Bar-B-Que Sales believes that the best way to prevent an accidental release is by being proactive in its approach to safety.  This facility maintains information about the proper use of its equipment and the possible hazards.  By following set operating procedures and maintenance routines, the process equipment within the facility will continue to operate in optimum condition.  Additionally, the release prevention program is constantly being improved by sustained employee training and regular compliance audits.  Compliance with all applicable state codes and regulations ensures the continued safety of Sadler?s Bar-B-Que Sales? employees.\n\n5.    Five-year accident history\n\nIn the last five years, the Sadler?s Bar-B-Que Sales facility has not experienced a significant accidental ammonia release.\n\n6.    The emergency response program\n\nA well planned emergency response program can make a tremendous difference in the potential off-site impacts of an accidental release.  Swift, efficient actions can minimize the damage to both human population and the natural surroundings.  To this end, Sadler?s Bar-B-Que Sales has coordinated emergency response efforts with the Henderson Fire Department and has instructed employees on the proper actions to take in the event of an accidental release.  Sadler?s Bar-B-Que Sales maintains a well trained emergency response team and has a written emergency response plan which specifies the details of the actions that will be taken in the event of an accidental release.\n\n7.    Planned changes to improve safety\n\nThere are no planned changes to improve safety at"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 44511,
      "SummaryText": " this time."
    }
  ]
}