{
  "FacilityID": 4455,
  "FacilityName": "Borden Chemical, Inc. - Waverly, VA Plant",
  "FacilityStr1": "5090 General Mahone Highway",
  "FacilityStr2": "P. O. Box 8",
  "FacilityCity": "Waverly",
  "FacilityState": "VA",
  "FacilityZipCode": "23890",
  "Facility4DigitZipExt": "5090",
  "FacilityCountyFIPS": "51183",
  "LEPC": "Sussex County LEPC",
  "FacilityLatDecDegs": "37.0525",
  "FacilityLongDecDegs": "-77.1175",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A6",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 942200932,
  "ParentCompanyName": "Borden Chemical, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1338797,
  "Company2DUNS": null,
  "OperatorName": "Borden Chemical, Inc.",
  "OperatorStr1": "5090 General Mahone Highway",
  "OperatorStr2": "P. O. Box 8",
  "OperatorCity": "Waverly",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23890",
  "OperatorZipCodeExt": "5090",
  "FTE": 30,
  "OtherEPAFacilityID": "23890SPRLCRT460",
  "EPAFacilityID": "100000053906",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-28 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Waverly, VA",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2002-03-26 00:00:00",
  "DeRegistrationEffectiveDate": "2001-02-23 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 37.050335,
  "FRS_Long": -77.113152,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5189,
      "AltID": "Formaldehyde Production",
      "FacilityID": 4455,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 5559,
          "ProcessID": 5189,
          "ChemicalID": 1,
          "Quantity": 370000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5298,
          "ProcessID": 5189,
          "NAICSCode": "325199",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 5190,
      "AltID": "Resin Manufacturing",
      "FacilityID": 4455,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 5560,
          "ProcessID": 5190,
          "ChemicalID": 1,
          "Quantity": 35000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5299,
          "ProcessID": 5190,
          "NAICSCode": "325211",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4455,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-14 00:00:00",
    "ERTrainingDate": "1999-06-10 00:00:00",
    "CoordinatingAgencyName": "Sussex County LEPC",
    "CoordinatingAgencyPhone": "8042465511",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4455,
      "SummaryText": "1. Accidental release prevention and emergency response policies:\n\nAs stated in our Worldwide Health, Safety and Environmental Policy and Principles, Borden Chemical, Inc. is committed to health, safety and environmental excellence.  To accomplish this we integrate health, safety and environmental planning into all business activities.  This includes complying with applicable laws, responsibly managing risks and working collaboratively with others in addressing health, safety and environmental issues. \n                                                                                                                                                                           In the Borden Chemical, Inc., Safety Manual, the Safety Policy Statement clearly states that safety will not be compromised to achieve any other operational or business objective.  This manual defines requirements and guidelines developed to prevent injuries and accidental releases.  \n\nIncluded in the Safety Manual are Emergency Response Policies that state that safety is the top priority in all emergency response situations.  This policy refers to the plant Emergency Response Plan for specific procedures for handling releases of hazardous materials.  \n\n2. Stationary source and regulated substances handled:\n \n Borden Chemical, Inc. acquired sed this facility from Spurlock Industries, on May 12, 1999.  The plant is located in Sussex County, Virginia, 1.5 miles Northwest of the Town of  Waverly.  The facility has 45 acres bounded on the North by US Highway 460 and to the South by the Norfolk & Southern Railway.  70 to 90 foot pine trees border the entire facility.  There are no public or environmental receptors within the circle of the plant's Worse Case Scenarios.  \n\nThe plant produces formaldehyde solutions, Urea Formaldehyde Concentrate (UFC) and urea-formaldehyde resin for use in the Forest Products industry.  \n\nThe regulated substances used in the plant and the maximum quantities stored are:\n\nForm"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4455,
      "SummaryText": "aldehyde and/or Urea-Formaldehyde Concentrate (UFC):  740,000 lbs.*. \n*{370,000 lbs. of the regulated substance formaldehyde and 370,000 lbs. non-regulated liquids in solution} \n\n3. Worst Case Release Scenario:\n\nThis plant has two program one processes, formaldehyde production and resin manufacturing.  A worst case release scenario analysis was performed for each.  \n                                                                                                                                                                           In the formaldehyde production process, the worst case scenario is a rupture of the largest formaldehyde storage tank.  In this case, 190,000 lbs. of formaldehyde solution would spill into a remote containment pit, releasing 6 lbs./min. of formaldehyde vapor into the atmosphere.  The distance to the toxic endpoint of 0.012 mg/l would be 0.18 miles.  There would be no offsite impact as a result of this release, as the nearest public receptor is 0.3 miles away.\n\nIn the resin manufacturing process, the worst case scenario is a rupture of the formaldehyde weigh tank.  In this case, 70,000 lbs. of formaldehyde solution would spill into the remote containment pit, with the same release rate and impact as the storage tank case.\n\n\n4. Accidental release prevention program and chemical-specific prevention steps\n\nBorden has introduced a comprehensive process safety management program that is in compliance with the EPA Accidental Release Prevention Rule, the OSHA Process Safety Management Standard, and all applicable state codes and regulations.  A safety management system is in place to assure on-going compliance.  The Plant Manager has overall responsibility for this program.\n\nThe responsibility to maintain operation procedures up-to-date is also assigned to the plant manager, as well as making sure operators are trained so they can safely carry out these procedures, minimizing the chance of an accident or spill and assuring that the plant is run"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4455,
      "SummaryText": "safely on a daily basis.  Supervisors investigate incidents and initiate changes to prevent their reoccurrence.  Teams are appointed to assist and these reviews often lead to improvements in equipment, procedures, operating conditions, or training.   All employees participate in the safety program.  Each department is responsible for a specific section(s) of the Safety Manual. Borden feels that bringing responsibility and ownership of the Safety Program to the Line Process employees is the best way to ensure that the facility carries out the Plan.    \n\nProcess Hazard Analyses was conducted.  As a result of this study, procedures were improved to prevent the chance of an accidental release.  A preventive maintenance program maintains the mechanical integrity of process equipment. A formal Lock-Out/Tag Out program is in place to reduce the chance of an accidental release or injury.\n\nContractors, who periodically perform work in the plan, are given safety orientations to brief them on plant hazards and safety practices.  Contractor safety programs and performance are thoroughly evaluated prior to their selection for jobs that impact process safety. \n\n5. Five-year accident history\n\nIn the five-year period from January 1, 1994 to December 31, 1998, there were no off-site releases of regulated substances.  \n\n6. Emergency response program\n\nThe plant maintains a relationship with the Local Emergency Planning Committee of Sussex County, which would provide help (if needed) during an emergency.  The plant Emergency Response Plan describes procedures for actual and threatened releases, including coordination with fire responders.  Flow charts are employed to help make the proper chain of procedures and communications easier to follow in a time of emergency.  This plan was submitted to and approved by the Sussex Local Emergency Planning Committee. \n\n\n7. Planned changes to improve safety\nBorden will introduce a new computerized system for the preventive maintenance program. Bor"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4455,
      "SummaryText": "den is also actively reviewing the facility's Safety Plan and converting all existing plans into the Standard Borden Program."
    }
  ]
}