{
  "FacilityID": 4456,
  "FacilityName": "Wyman-Gordon Investment Castings, Incorporated",
  "FacilityStr1": "839 Poquonnock Road",
  "FacilityStr2": null,
  "FacilityCity": "Groton",
  "FacilityState": "CT",
  "FacilityZipCode": "06340",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "09011",
  "LEPC": "Town of Groton LEPC",
  "FacilityLatDecDegs": "41.345",
  "FacilityLongDecDegs": "-72.053333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1211796,
  "ParentCompanyName": "Wyman-Gordon Company",
  "Company2Name": null,
  "CompanyDUNS": 1128016,
  "Company2DUNS": 0,
  "OperatorName": "Wyman-Gordon Company",
  "OperatorStr1": "839 Poquonnock Road",
  "OperatorStr2": "P.O. Box 999",
  "OperatorCity": "Groton",
  "OperatorStateFIPS": "CT",
  "OperatorZipCode": "06340",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert Rotondi",
  "RMPTitle": "Plant Manager",
  "FTE": 550,
  "OtherEPAFacilityID": "06340RWDCR839PO",
  "EPAFacilityID": "100000053988",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-03-26 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2000-01-28 00:00:00",
  "DeRegistrationEffectiveDate": "1999-09-23 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 41.34575,
  "FRS_Long": -72.05343,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5191,
      "AltID": "HF Storage and Transfer",
      "FacilityID": 4456,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5300,
          "ProcessID": 5191,
          "NAICSCode": "332111",
          "_desc": {
            "NAICS_CODE": "332111",
            "NAICS_DESCRIPTION": "Iron and Steel Forging"
          }
        },
        {
          "Process_NAICS_ID": 5301,
          "ProcessID": 5191,
          "NAICSCode": "332112",
          "_desc": {
            "NAICS_CODE": "332112",
            "NAICS_DESCRIPTION": "Nonferrous Forging"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5561,
          "ProcessID": 5191,
          "ChemicalID": 55,
          "Quantity": 1600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505561,
          "ProcessID": 5191,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4456,
      "SummaryText": "The Wyman-Gordon Investment Castings, Incorporated, Groton facility is a manufacturer of ferrous and nonferrous forgings.  The facility serves such international markets as commercial and military aerospace and land based gas turbine and power generation.  Processes conducted at the facility include large and  small scale chemical milling and etching.  These processes utilize hydrofluoric acid (HF), nitric acid, and hydrochloric acid.  However, only hydrofluoric acid , approximately 1,600 pounds, is maintained at a level above the threshold quantity, thus requiring the facility to submit a RMP.  The facility will adhere to the general duty provisions for each chemical used in a process below the threshold value.\n\nThe process of concern at the Groton facility is the transfer and storage of hydrofluoric acid for use in the large scale chemical milling operations.  The process of transferring the HF consists of two fifty-five gallon drums of HF (70% by weight) in a complete enclosure and hard piped to the chemical milling operations.  A portion of the piping is located inside a building equipped with a continuously operating wet, packed caustic scrubber to prevent HF emissions to the atmosphere.  The remaining piping and the drum enclosure are located outside the building in a covered area.  Two replacement drums of HF are also stored in this area.  The small scale chemical milling operation only utilizes one drum of HF with one drum in storage, which is below the threshold and does not require a RMP.    \n\nThe Groton facility currently has a contract with Clean Harbors for emergency response and clean-up.  Local agencies are relied upon for dealing with fire, injuries, traffic, etc. in the event of an emergency.  \n\nWhen acid is needed for a process tank at the Groton facility, the drums are transported into the appropriate building using a fork truck.  The drums are always transported on 4ft x 4ft spill containment pallets.  However, since it is possible for a drum to "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4456,
      "SummaryText": "be punctured and simultaneously knocked off its containment pallet, the worst-case scenario involves the unmitigated release of the contents of one (1) 55-gallon drum of HF outdoors.  This scenario assumes that the acid forms a pool with a depth of 1 centimeter and that the pool evaporates at 770F.  \n\nThe quantity of HF released was calculated to be approximately 571 pounds.  RMP*Comp, Version 1.06 was used to perform the worst-case release offsite consequence analysis.  The release rate was estimated by using the equation for the evaporation of unmitigated releases of liquids, from the procedures in EPA's OCA Guidance.\n\nThe estimated distance to the toxic endpoint, determined using the procedures in EPA's OCA Guidance, is 0.6 miles based on \"rural\" topography.  The rural topography assumption is appropriate for this analysis since the facility buildings are not extremely tall and the area is surrounded by relatively flat terrain.  \n\nLandview III was used to determine the number of persons living within the impact area based on census data.  According to Landview III's census database, there are approximately 2,200 people living within the worst-case impact radius of 0.6 miles.  Also located within the impact area are recreation areas, as well as major commericial and industrial areas.\n\nThe alternative case scenario assumes that a drum is pierced near the bottom with a fork from the fork truck and that the entire contents (55 gallons) is released into the 4ft x 4ft x 1 ft spill containment pallet and evaporates at 770F.  Further assumptions are that the truck fork makes a 15 square inch puncture in the drum and that the puncture is 4 feet below the acid surface. \n\nThe quantity of HF released was calculated to be approximately 571 pounds.  RMP*Comp, Version 1.06 was used to perform the alternative case release scenario analysis using the calculations and assumptions contained in EPA's OCA Guidance.  Rural topography was assumed in the analysis.  The release rate was "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4456,
      "SummaryText": "estimated based on the procedures in EPA's OCA Guidance for the evaporation of releases of toxic liquids from a diked/contained pool.\n\nThe estimated distance to the toxic endpoint is 0.1 miles.  Landview III was used to determine the number of persons living within the impact area based on census data.  According to Landview III's census database, there are approximately 40 people living within the alternative case impact radius of 0.1 miles.   There are no other public or environmental receptors within the alternate scenario impact area.\n\nThe facility has not had an accidental release of HF from this covered process in the five years prior to the submission of this Risk Management Plan (RMP).\n\nThe Wyman-Gordon Company is considering the possibility of relocating the large scale chemical milling operation to a facility in another state at some point in the near future."
    }
  ]
}