{
  "FacilityID": 44644,
  "FacilityName": "RMAX Inc.",
  "FacilityStr1": "13524 Welch Road",
  "FacilityStr2": null,
  "FacilityCity": "Dallas",
  "FacilityState": "TX",
  "FacilityZipCode": "75244",
  "Facility4DigitZipExt": "5227",
  "FacilityCountyFIPS": "48113",
  "LEPC": "Dallas County LEPC",
  "FacilityLatDecDegs": "32.930556",
  "FacilityLongDecDegs": "-096.831944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G7",
  "LatLongDescription": "NW",
  "FacilityURL": "www.rmaxinc.com",
  "FacilityEmailAddress": "vhanlon@rmaxinc.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "HC Industries",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "HC Industries dba RMAX Inc.",
  "OperatorStr1": "13524 Welch Road",
  "OperatorStr2": null,
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75244",
  "OperatorZipCodeExt": "5291",
  "RMPContact": "Vince Hanlon",
  "RMPTitle": "Plant Manager",
  "FTE": 31,
  "OtherEPAFacilityID": "75244RMXNC13524",
  "EPAFacilityID": "100000179111",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-10-27 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Revised RMP Jan 2006",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-01-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-01-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-01-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-01-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 32.93124,
  "FRS_Long": -96.83037,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 64510,
      "AltID": "n-Pentane",
      "FacilityID": 44644,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 66045,
          "ProcessID": 64510,
          "NAICSCode": "32615",
          "_desc": {
            "NAICS_CODE": "32615",
            "NAICS_DESCRIPTION": "Urethane and Other Foam Product (except Polystyrene) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 85356,
          "ProcessID": 64510,
          "ChemicalID": 125,
          "Quantity": 66470.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 585356,
          "ProcessID": 64510,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 44644,
      "SummaryText": "RMAX, Incorporated\nDallas Operations\n13524 Welch Road, Dallas, Texas, 75244\nRMP Executive Summary - Revised January 2006\n\nAccidental Release Prevention & Emergency Response Policies\n\nRMAX Inc.?s management, at both the plant and corporate level, is extremely committed to the safety and health of its employees, contractors, and visitors, and to minimizing to the greatest extent practicable the potential for releases which may adversely affect the environment. This commitment is a critical element of the facility?s RMP/PSM Plan. It will extend not only through the initial development of the plan, but will endeavor to incorporate the practices and procedures established by this plan into the facility?s normal way of conducting day-to-day business. RMAX has established a management system to oversee the development, implementation, and successful continuing implementation of its RMP/PSM Plan. The goals of this system are:\n\n?Clarify the roles and responsibilities related to process safety issues at the facility;\n?Avoid problems or conflicts among the various people responsible for implementing elements of the risk management plan;\n?Avoid confusion and allow those responsible for implementation to work together as a team;\n?Ensure that the program elements are integrated into an ongoing approach to identifying hazards and managing risks;\n?Ensure effective communication about process changes; and,\n?Provide full compliance to all regulatory requirements.\n\nThe overall implementation of the RMP/PSM Plan is the responsibility of the Plant Manager. Under this plan, it is his duty to ensure all elements are ultimately implemented as described. Although other employees will have key roles in the RMP/PSM Plan, the Plant Manager assumes this overall responsibility.\n\nIt is in the best interest of RMAX and it?s employees to continually evaluate potential safety issues. Should any employee find any area or practice to be a potential safety hazard, let your supervisor know. Do not wait "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 44644,
      "SummaryText": "for someone to have an accident before we make the change.\n\nPolicy: We will not compromise safety for convenience, efficiency, or for any other reason. Entry to confined spaces will be permitted only after proper training has been conducted.   Our employees are not permitted to enter a bulk chemical tank. \nIt is also our policy to prevent chemical spills by maintaining our chemical handling equipment, chemical storage tanks, chemical transfer lines, and containment walls, in excellent condition. \n\nPolicy: In the case of a Major Chemical Spill our employees will immediately evacuate the facility. Our employees will not attempt to assist in the clean-up of a major chemical spill. In the unlikely event the containment wall fails to restrict a chemical spill, RMAX certified HAZMAT technicians may be asked to place absorbent barriers in the flow path of the spilled chemical. However, RMAX employees will not be asked to make contact with hazardous spilled chemicals.       \n \nFacility & Regulated Substances Handled\n\nRMAX, Dallas Operations manufactures polyisocyanurate foam insulating board (foam board). The facility operates under the North American Industrial Classification System (NAICS) Code 32615 (Urethane and other foam (except polystyrene) manufacturing). The foam board produced at the facility is used in both residential and commercial construction applications. RMAX produces foam board in thickness ranging from ? inch to 4.5 inches.\n\nRMAX uses three main raw materials in the production of foam board: Methylenebis Di-Phenylisocyanate (MDI), Polyol, and Blowing Agent (n-Pentane).  Several catalysts and fire retardants may also be used depending upon the type of foam board being produced. MDI is considered as part ?A? and Polyol combined with catalyst and surfactants are considered as a part ?B?.   \n\nThe main raw materials are all liquids and are stored on-site in bulk tanks sized at 12,000 gallons. The liquids flow through a series of tanks, static mixers and high-p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 44644,
      "SummaryText": "ressure pumps towards the pour table. At the pour table, parts ?A? and ?B? are combined together and injected between the top and bottom facers. RMAX uses several different types of facers, depending upon the type of foam board being produced. Once parts ?A? and ?B? are combined the liquids exothermically react to form solid foam. \nn-Pentane (CAS No: 109-66-0) is a substance regulated by 40 CFR 68 [EPA?s Chemical Accident Prevention Provisions]. Taking into account ? 68.115(b)(2)(i), RMAX has determined the total quantity of n-Pentane in its foam board manufacturing process (for purposes of a threshold quantity determination) to be the total amount of the Hydrocarbon Blowing Agent present in its process at any one time. The maximum amount present in RMAX?s foam board manufacturing process at any one time is 66,470 pounds. This is above the threshold quantity for n-Pentane of 10,000 pounds, as established in ? 68.130. Therefore, RMAX has determined that the Dallas facility is subject to the requirements of 40 CFR ? 68 for n-Pentane. \n\nRMAX has defined its covered process as that equipment which contains or contacts the Hydrocarbon Blowing Agent starting at the bulk storage tank loading (or fill) connection and extending up to and including the mix heads (located at the Pour Table). This determination was made based on the fact that once the Blowing Agent is mixed with the other foam components; it is no longer a liquid and is part of a solid, non-flammable product.  Thus, the blowing agent is flammable according to the definition as contained in ? 1910.1200(c). As stated previously, the RMAX Dallas Operation may have up to 66,470 pounds of Hydrocarbon Blowing Agent present in its process at any one time. This is above the applicability quantity for a flammable liquid of 10,000 pounds, as established in ? 1910.119(a)(1)(ii). Thus, RMAX has determined its Dallas, Texas facility is subject to the requirements of 29 CFR 1910.119.\n\nThrough preparation of this Risk Managem"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 44644,
      "SummaryText": "ent Program / Process Safety Management Program (RMP/PSM), RMAX has determined that its Dallas Operation is a Program 3 process as defined by 40 CFR 68.10(d). This determination is based on the results of the worst-case release scenario for n-Pentane (the location of public receptors being within the distance to the endpoint) and the applicability of 29 CFR 1910.119 to its facility. Thus RMAX has complied with the requirements for preparation and submittal of a Program 3 RMP as contained in 40 CFR ? 68.\n\nWorst Case and Alternative Release Scenarios\n\nIn order to calculate the distance to the endpoint from a worst case release of Blowing Agent (n-Pentane), the EPA automated program RMPComp v. 1.07 was used to perform the off site consequence analysis. The program provided a conservative estimate for the distance to an endpoint of 1.0 psi overpressure. The quantity of n-Pentane used in the worst case release scenario analysis for RMAX?s Dallas, Texas facility has been determined to be the amount of Blowing Agent contained in the facility?s on-site bulk storage tank. In accordance with 40 CFR 68.25(e), for purposes of calculating the distance to the worst case release endpoint, RMAX has assumed that the entire contents of the single largest vessel containing Blowing Agent (66,470 pounds) is released as a vapor, which finds an ignition source, and that 10% of the released quantity participates in the resulting explosion. \n\nRMAX has determined the maximum threat distance to an endpoint of 1.0 psi overpressure using RMPComp is 0.3 miles for a release quantity of 66,470 pounds of Blowing Agent.  Using U.S. Census Data for 2000, it is estimated that the maximum residential population within a 0.3 mile radius is less than 2 persons.  The vast majority of the affected area is occupied by industrial and commercial properties, although there is some retail property development south of the facility.  RMAX has determined, through examination of the Addison USGS 7.5 Minute Topogra"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 44644,
      "SummaryText": "phic Quadrangle Map, that there are no environmental receptors located within the 0.3 mile radius.\n\nRMAX has identified another possibility for the release of Blowing Agent that is more likely to occur than the worst case release.  This possible alternative release scenario was defined as a 10-minute transfer hose release of Blowing Agent during tanker truck unloading.  RMAX has determined, based on the physical properties of the Blowing Agent, that a release from a transfer hose would result in a spill of a highly volatile liquid which would likely evaporate very quickly and have the potential to result in a Vapor Cloud Fire. \n\nRMAX has determined the maximum threat distance to a Lower Flammability Limit endpoint of 38 milligrams per liter using RMPComp is 0.1 miles for a release quantity of 12,700 pounds of Blowing Agent.  Using U.S. Census Data for 2000, it is estimated that the maximum residential population within a 0.1 mile radius is 0 persons.  The affected area is 100% occupied by industrial and commercial properties.  RMAX has determined, through examination of the Addison USGS 7.5 Minute Topographic Quadrangle Map, that there are no environmental receptors located within the 0.1 mile radius."
    }
  ]
}