{
  "FacilityID": 4478,
  "FacilityName": "Dreyer's Grand Ice Cream, Inc.",
  "FacilityStr1": "5743 E. Smithway St.",
  "FacilityStr2": null,
  "FacilityCity": "Commerce",
  "FacilityState": "CA",
  "FacilityZipCode": "90040",
  "Facility4DigitZipExt": "1500",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.006528",
  "FacilityLongDecDegs": "-118.148556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 66563859,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Dreyer's Grand Ice Cream, Inc.",
  "OperatorStr1": "5743 E. Smithway St.",
  "OperatorStr2": null,
  "OperatorCity": "Commerce",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90040",
  "OperatorZipCodeExt": "1500",
  "FTE": 93,
  "OtherEPAFacilityID": "90040DRYRS5743E",
  "EPAFacilityID": "100000051338",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-12-14 00:00:00",
  "SafetyInspectionBy": "CalOSHA- State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2006-04-24 00:00:00",
  "DeRegistrationEffectiveDate": "2006-04-28 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 34.00684,
  "FRS_Long": -118.14921,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5217,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 4478,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 5590,
          "ProcessID": 5217,
          "ChemicalID": 56,
          "Quantity": 25000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5328,
          "ProcessID": 5217,
          "NAICSCode": "31152",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2054,
              "Process_NAICS_ID": 5328,
              "SafetyReviewDate": "1999-05-19 00:00:00",
              "PHA_Date": "1999-03-17 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Wastewater Collection System",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Procedural Improvements",
              "OpProceduresReviewDate": "1998-09-30 00:00:00",
              "TrainingReviewDate": "1999-06-03 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-09-30 00:00:00",
              "EquipmentInspectionDate": "1998-11-01 00:00:00",
              "EquipmentTested": "Compressors, Evaporators, Condensers, Vessels, Pipelines",
              "ChangeMgmtDate": "1999-05-22 00:00:00",
              "ChangeMgmtReviewDate": "1998-11-01 00:00:00",
              "PreStartupReviewDate": "1999-01-18 00:00:00",
              "ComplianceAuditDate": "1998-09-09 00:00:00",
              "AuditCompletionDate": "1998-11-23 00:00:00",
              "IncidentInvestigationDate": "1999-03-23 00:00:00",
              "InvestigationChangeDate": "1999-03-23 00:00:00",
              "ParticipationPlansReviewDate": "1999-05-17 00:00:00",
              "HotWorkPermitReviewDate": "1998-10-07 00:00:00",
              "ContractorSafetyReviewDate": "1998-12-16 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2288,
                  "PreventionProgram3ID": 2054,
                  "ProcessChemicalID": 5590
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4478,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-12-31 00:00:00",
    "ERTrainingDate": "1999-05-13 00:00:00",
    "CoordinatingAgencyName": "Los Angeles County Fire Department",
    "CoordinatingAgencyPhone": "3238904317",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 4478,
      "SummaryText": "re demanded as a condition of employment in a Dreyer's work environment; the most important of which is safety.  In recent years, significant resources have been deployed against company-wide safety objectives.  This is evidenced by the fact that (4) new positions have been created; including roles such as safety coordinator and risk & safety manager. \n\nDreyer's maintains a comprehensive risk and safety program These systems include: injury & illness prevention, control of hazardous energy, confined space entry, line breaking, hot work, and emergency response.  These written programs provide the foundation for employee education, training, and ongoing safety process execution and improvement.\n\nA zero tolerance for safety incidents is enforced at Dreyer's.  Each safety incident is documented, investigated, and reviewed.  In addition, any corrective action necessary to prevent recurrence is implemented in an expedient and comprehensive manner.\n\nFurthermore, a zero tolerance policy for accidental releases of hazardous materials demands each incident be documented.  Fugitive emissions must be recorded and traced to the original source.  This means that when ammonia vapors are detected, the original source must be located and the problem corrected: valve packing, pump seal, flange gasket, etc.\n\nA rigorous preventative maintenance (PM) program is used to prevent accidents before they happen.  Dreyer's utilizes a computerized maintenance management system (CMMS) to track and organize all PM activities.  Each week, a list of tasks is generated by the CMMS and is then divided amongst several qualified personnel for completion.  \n\nIn addition to regular, ongoing preventative maintenance activities, several annual events occur to further ensure the mechanical integrity of the refrigeration system.  This includes an IIAR safety inspection and physical examinations of strategic pieces of equipment/pipelines.  These two activities provide a foundation for formulation of an annual"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4478,
      "SummaryText": "maintenance plan.\n\nDreyer's Grand Ice Cream maintains on-site emergency response teams.  At Commerce, this team is comprised of approximately 20 members from different work teams, shifts, and locations throughout the facility.  All members receive training on a regular basis including topics such as first aid, CPR, triage, SCBA use, and hazardous materials response.  Each member has been trained as an emergency responder to (at a minimum) the Hazardous Materials Technician level.  In addition, approximately one-half of the team is also qualified to the Incident Commander level.  These roles are practiced during team and plant-wide emergency response drills staged periodically throughout each year.\n\nAll emergency response activities are carried out in accordance with the Emergency Response Business Plan.  This plan details items such as evacuation procedures, roles & responsibilities, notification procedures, emergency response equipment, hazardous materials inventories, and media inquiry response.  Dreyer's also maintains an emergency response command center strategically located on the property.  This command center houses SCBA's, site maps, refrigeration P&ID's, first aid equipment, mitigation devices, and communications equipment.  The general emergency response philosophy of Dreyer's Grand Ice Cream is that all actions are intended to be defensive in naturetherefore the primary concern of all emergency responders is the safety of employees and any threat to the environment.  \n\nRELEASE SCENARIOS\nThe worst-case release scenario for Dreyer's facility is defined as a total charge release from the outside -400F pumper vessel.  The function of this vessel is to supply ammonia to (6) sets of cold storage evaporators.  This is the largest vessel in the refrigeration system and it contains a mixture of liquid and vapor.\n\nPassive mitigation in the form of a sump drain does exist near this vessel.  However, in the interest of providing the most conservative result, it was"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4478,
      "SummaryText": "y the mechanical integrity of the outer wall.\n\nThe alternative release scenario for Dreyer's facility has been defined as a 0.25 diameter pinhole leak from a rooftop pipeline at a maximum pressure of 160 psig (from the high side of the refrigeration system).  This would represent a pinhole leak from a high side compressor discharge pipeline near a condenser.\n\nActive mitigation measures in the form of emergency response procedures are assumed to end the release via system shutdown within 40 minutes.  This allows approximately 20 minutes for detection of the leak and approximately 20 minutes for emergency shutdown and equalization.  Based on the resulting release rate (using the simplified formula from the EPA's guidance document), a toxic endpoint of 200ppm (Emergency Response Planning Guidelines), an urban topography, and EPA's Risk Management Program Guide for Ammonia Refrigeration, the potential off-site impact may include public receptors.  However, it will not include any environmental receptors.\n\nThe potential at-risk (residential) population for exposure to concentrations exceeding 200ppm is determined using Landview III Environmental Mapping Software and 1990 census tract data.  This affected population represents the number of people within the radius of the maximum downwind distance reached by the plume in all wind directions.\n\nAs stated earlier, Dreyer's Grand Ice Cream utilizes an CMMS system for preventative maintenance tracking.  Although there are no specific PM procedure to check this particular pipeline, there are PM procedures for surrounding equipment that occur on a monthly frequency.  Engineer visits to nearby equipment would expose any possible breach.  Also, the annual IIAR Safety Inspection includes all piping in its comprehensive scope.  Additionally, the annual mechanical integrity spot-check would encompass this pipeline every 3-5 years.\n\nActive mitigation procedures are also a large part of this release scenario.  The ammonia refrigerat"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 4478,
      "SummaryText": "d, CPR, and triage.  In addition, all members are certified Hazardous Materials Technicians, with approximately half of the team qualified at the Incident Commander level as well.  The primary focus of all responders is the safety of employees and the environment.  Training exercises focus on defensive measures and mitigation procedures..\n\nDreyer's maintains an emergency response command center where all employees are instructed to meet in the event of an evacuation.  This command center contains all gear necessary for an emergency response: first aid equipment, SCBA's, chemical resistant and fully encapsulating protective suits, decontamination equipment, ventilation equipment, communications equipment (2-way radios, cellular telephone, bullhorn), and facility site plans/technical drawings.  This command center will also serve as a common area for coordination with outside resources/agencies.\n\nBoth internal and external notification procedures have been specifically detailed in the Emergency Response Business Plan.  This is to ensure appropriate agencies are notified.  The following communication network is in place: detection of a release is initially communicated to a First Responder; the First Responder will decide if an evacuation is necessary and announce it via the plant PA system; if a building evacuation is necessary, neighboring tenants will be notified using a telephone call list.  The Los Angeles County Fire Department will be notified for local assistance (this agency will fill the absence of an active Local Emergency Planning Committee).  Other agencies such as the California Office of Emergency Services and the National Response Center will be notified as required.\n\nIMPROVING SAFETY\nDreyer's will continually work to improve its risk and safety process indefinitely.  New processes and programs are added to the risk and safety program on a regular basis.  Existing programs will also be refined to simplify implementation and further integrate safety prog"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 4478,
      "SummaryText": "rams into daily routines.  Although not all safety improvements are directed at hazardous materials, each will build on the foundation that safety is a given and must be practiced as a condition of ongoing employment.\n\nThe plant maintains an aggressive Safety Strategic Plan, with the objective of totally eliminating injuries from the workplace.  An active Safety Leadership Team discusses safety-related topics on a regular basis.  The make-up of this team includes managers, supervisors, and front-line employees.  This team has performed job hazard evaluations to determine the potential dangers of each of job classification throughout the plant.  These evaluations also emphasize safe work practices and strict adherence to standard operating procedures.  In addition, this team has conducted behavior observation studies as a documented source of continuous safety improvement.\n\nDreyer's operates a company-wide Risk and Safety Network, with the objective of sharing learnings and best practices across locations.  The members of the network include the site and corporate risk and safety leaders.  The Company is committed to deploying the resources necessary to ensure safe and healthy workplace environments.  Dreyer's insists that investments in refrigeration systems receive priority in its capital planning process."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4478,
      "SummaryText": "not considered in the analysis of this worst-case scenario.  It is assumed that the contained charge will be released from this vessel to the environment in a time period of 10 minutes.  Based on the resulting release rate, the Emergency Response Planning Guidelines toxic endpoint, site topography, and EPA's Risk Management Program Guide for Ammonia Refrigeration, the potential off-site impact may include public receptors.  However, it will not include any environmental receptors.\n\nThe potential at-risk (residential) population for exposure to concentrations exceeding 200ppm was determined using Landview III Environmental Mapping Software and 1990 census tract data.  This affected population represents the number of people within the radius of the maximum downwind distance reached by the plume in all wind directions.\n\nDreyer's Grand Ice Cream has several practices in place that are intended to prevent the occurrence of this highly improbable worst-case scenario.  As mentioned earlier, a rigorous CMMS is used to generate maintenance work orders on a periodic basis.  The PM frequency of the outside -400F pumper vessel is monthly.  During the PM, the proper functioning, auxiliary device integrity, and electrical device integrity are verified to ensure the overall effectiveness of this asset.  In addition, the following measures are taken to ensure the integrity of the vessel: all vessel and pipe supports are inspected; the reliability of the insulation covering the vessel is checked; and all other attached devices are checked for signs of unusual wear or corrosion.  Furthermore, several other periodic inspections are performed.  Each year, an IIAR Safety Inspection, which includes the outside -400F pumper, is performed.  This vessel is also included in the annual mechanical integrity spot-check inspection.  During this inspection, a more comprehensive check is made on the vessel.  This inspection includes removing various portions of the insulation to visually verif"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 4478,
      "SummaryText": "FACILITY & CHEMICAL PROCESS DESCRIPTION\nThe Dreyer's Grand Ice Cream, Inc. facility is located at 5743 E. Smithway St., Commerce, California.  This is a multi-tenant building where Dreyer's leases the largest single portion.  Dreyer's occupancy houses a manufacturing operation where packaged frozen dairy dessert and novelty products are manufactured on a 3-shift, 24-hour schedule.  The plant consists of ambient and frozen warehouses, production areas, utility and refrigeration systems, and general office space.  The property is paved with asphalt and landscaped with vegetation in the main parking and perimeter areas.  The areas surrounding Dreyer's facility are primarily industrial, with residential areas to all sides.  \n\nApproximately 93 people are employed on a full-time basis at this facility.  An additional pool of laborers is employed on a seasonal basis.  On average, approximately 25 contract employees are on site during a 24-hour time period.\n\nThe regulated material at the facility is anhydrous ammonia.  Ammonia is used as a refrigerant in a mechanical refrigeration system.  This refrigerant provides cooling to storage silos, chillers, production freezers, storage freezers, and other refrigerated areas.  The ammonia refrigeration system was constructed in 1985 and subsequently expanded in 1991.\n\nThe majority of the refrigeration equipment is located in the engine room and basement.  Three condensers are mounted on the roof of the engine room, two vessels are located outside the engine room, and the freezers and evaporators are located in the production areas and cold storage rooms respectively.\n\nThe entire ammonia refrigeration system holds a charge of approximately 25,000 pounds.  The physical state and location of this charge is constantly changing to accommodate operating conditions.\n\nACCIDENTAL RELEASE PREVENTION & EMERGENCY RESPONSE POLICIES\nDreyer's Grand Ice Cream, Inc. practices a very aggressive philosophy regarding risk and safety.  Several things a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 4478,
      "SummaryText": "ion system is controlled by a central microprocessor (PLC).  This control system would automatically shut down the entire system in an emergency such as this, triggered by a drop in head pressure.  If an automatic shutdown did not occur, remote human intervention could trigger an emergency shutdown.  In addition, several ammonia gas detectors are installed throughout the facility.  Any release exceeding a preset minimum threshold would be sensed and result in an emergency shutdown.\n\nRELEASE PREVENTION\nDreyer's maintains several release prevention programs in accordance with federal, state, and local laws.  Most importantly, Dreyer's is subject to OSHA's standard: Process Safety Management of Highly Hazardous Chemicals.  In addition, Dreyer's currently maintains a Risk Management Prevention Program in accordance with the California State Office of Emergency Services and its local administrative agent, the Los Angeles County Fire Department.\n\nDreyer's PSM program Each element has been tailored to allow for seamless integration into daily work routines.  This enables employees to participate in the program in the course of their normal practices.  \n\nAll Dreyer's employees are trained in emergency notification and evacuation procedures.  They are very sensitive to the presence of ammonia vapors and the zero tolerance policy for fugitive emissions.  Any time an employee detects ammonia, emergency procedures are immediately activated with First Response Team notification.  A First Responder can then determine the severity of the incident and the appropriate corrective actions.  Detecting every release is key to preventing repeat occurrences and reducing the risk of more severe future incidents.\n\nIn addition to human-related prevention programs, Dreyer's has intentionally engineered the ammonia refrigeration system to be state of the art with regards to safety.  As previously mentioned, the entire system is controlled by a programmable logic controller (PLC).  All portions"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 4478,
      "SummaryText": "of the system are interlocked and operate in conjunction with each other to provide a desired effect with minimum operator interaction.  \n\nOther state of the art devices include ammonia gas detectors and a seismic sensor.  The gas detectors are set to provide alarms at early detection levels in storage rooms, the basement, and the engine room.  The seismic sensor will detect the occurrence of a seismic event.  If any device is triggered, the PLC will commence automatic shutdown of appropriate equipment.\nFIVE YEAR ACCIDENT HISTORY\nDreyer's has no reportable accidents from the last five years to include in this summary.\n\nEMERGENCY RESPONSE PROGRAM\nAs previously mentioned, Dreyer's maintains an Emergency Response Business Plan as a foundation for all emergency programs and procedures.  This plan is a compilation of several different elements.  First, this plan contains the Hazardous Materials Business Plan as required by the local administering agency (Los Angeles County Fire Department).  This plan registers the facility with the administering agency as having hazardous materials on site.  It contains an inventory of all hazardous materials, prevention, mitigation, and abatement procedures, and a site map showing the location of critical devices.\n\nSecond, this plan contains the facility Emergency Response Plan.  This plan details all emergency response procedures (general and material-specific), roles and responsibilities, training requirements, team rosters, notification procedures, incident management recording forms/checklists, and other required elements.  Every employee at Dreyer's is trained on emergency notification and evacuation procedures.  This training is practiced through periodic drills and training exercises.\n\nThe First Response Team (emergency response team) is comprised of approximately 20 team members from different physical and functional areas of the plant as well as different work shifts.  Each first responder is trained in areas such as first ai"
    }
  ]
}