{
  "FacilityID": 44912,
  "FacilityName": "Houghton Chemical Plant",
  "FacilityStr1": "52 Cambridge Street",
  "FacilityStr2": "PO Box 307",
  "FacilityCity": "Allston(Boston)",
  "FacilityState": "MA",
  "FacilityZipCode": "02134",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25025",
  "LEPC": "Boston LEPC",
  "FacilityLatDecDegs": "42.359170",
  "FacilityLongDecDegs": "-071.119170",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.houghtonchemical.com/",
  "FacilityEmailAddress": "webmail@houghton.com",
  "FacilityDUNS": 1024058,
  "ParentCompanyName": "N/A",
  "Company2Name": "N/A",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Houghton Chemical Corporation",
  "OperatorStr1": "52 Cambridge Street",
  "OperatorStr2": "PO Box 307",
  "OperatorCity": "Allston(Boston)",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "02134",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joseph A. Lima",
  "RMPTitle": "Vice President",
  "FTE": 25,
  "OtherEPAFacilityID": "MAD001024058",
  "EPAFacilityID": "100000174232",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-06-08 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-02-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-02-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-01-31 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-03-28 00:00:00",
  "DeRegistrationEffectiveDate": "2006-03-15 00:00:00",
  "AnniversaryDate": "2011-01-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 42.35917,
  "FRS_Long": -71.11917,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 64851,
      "AltID": "32492",
      "FacilityID": 44912,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 66396,
          "ProcessID": 64851,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 85920,
          "ProcessID": 64851,
          "ChemicalID": 29,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 585920,
          "ProcessID": 64851,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 44912,
      "SummaryText": "\nThe Risk Management Plan (RMP) was prepared for transfer operations involving Vinyl Acetate Monomer at the Houghton Chemical facility located at 52 Cambridge Street in Allston, MA.   The RMP was developed to fulfill the requirements of the United States Environmental Protection Agency, 40 CFR Part 68.   Vinyl Acetate Monomer (VAM) has been successfully handled here for 5 years.   This is an RMP Renewal Application.   Houghton Chemical Corporation is a family owned and operated distribution and manufacturing company headquartered in Boston with diversified but interrelated operations including, but not limited to autoomotive fluids, heat transferfluids, water treatment chemicals and industrial chemicals.   For over 75 years, Houghton Chemical has built an enviaable reputation for high quality and prompt, courteous service in chemicals and chemical related products marketed on a national and international basis.   Houghton Chemical is an enthusiastic supporter of many industry and trade organizations.  These include the National Association of Chemical Distributors (NACD) and their Responsible Distribution Program , the National Paint and Coatings  Association (NPCA), Association of Water Technology, ASTM, ASHRAE and DCAT.   Houghton Chemical emphasizes safety in the day-to-day operations of the facility.   Employees operate under strict adherance to the Standard Operating Policies for chemical handling and transfer.   Houghton Chemical's primary business is in the bulk movement of chemicals.   Approximately 20% of the business is dedicated to the mixing and blending of chemicals, including specialty contract blending.   The facility has flammables permits for approximately half a mililion gallons.   The chemicals are transported in by railcars and cargo tankers which are then unloaded into on site storage tanks, containers or transshipped on cargo tankers.   Containers are stored in warehouses on site.   Commonly handled chemicals include Methanol, Acetone,  Isoprop"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 44912,
      "SummaryText": "anol,  Ethylene Glycol,  Toluene and Xylene.    Currently VAM is the only chemiccal that is stored at this facility that exceeds the RMP threshold limits set by the EPA.   The process involves the transfer of VAM from a stationary railcar, having a maximum capacity of 180,000 lbs., to an above ground storage tank, located within a dike and having a capacity of 234,000 lbs., from which cargo tankers are loaded for shipment of VAM.   In accordance with RMP rules for program 2, a worst case scenario has been developed.   The worst case scenario is baded on the complete release of the largest tank which is the rail car storing approximately 180,000 lbs. of product.   The resultant plume would have offsite consequences into the greater Boston srea.   The alternative release scenario is based on the release of product due to failure of the transfer piping.   The resultant plume would have offsite consequences into a limited area surrounding the facility.   Both scenarios have been analyzed using the RMP Comp program.   Houghton Chemical has developed a detailed Standard Operating Procedure for VAM handling from railcar to storage tank and cargo tankers.   The SOP includes a several step process for sampling, quantity verification, testing and transfer processs.   Two trained employees don the appropriate personal protective equipment prior to working with VAM transfers.   Prior to the actual transfer of product they are required to do a thorough check of all valves, piping, hoses and connections used for the VAM transfer operations.   During the transfer operations they are constantly monitoring the transfer devices, vapor recovery connections and high level alarms that are connected to the vessel receiving the product.   In the event of a release, personnel are instructed to immediately initiate the companies Emergency Response Plan, which includes notification fo the Boston Fire Department LEPC via a telephone call to 911.   Personnel are also required to take immediate"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 44912,
      "SummaryText": " steps to attempt to stop the release while awaiting the appropriate response level for the incident.    Houghton Chemical Corporation has had no accidental releases over the past five years.    Houghton Chemical has successfully handled VAM for 5 years.   Houghton Chemical does not plan to make any changes to our Standard Operating Procedures for the VAM transfer processes at this time."
    }
  ]
}