{
  "FacilityID": 45144,
  "FacilityName": "Glasgow Wastewater Treatment Plant",
  "FacilityStr1": "705 Glenn Garry Road",
  "FacilityStr2": null,
  "FacilityCity": "Glasgow",
  "FacilityState": "KY",
  "FacilityZipCode": "42141",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21009",
  "LEPC": "Barren County LEPC",
  "FacilityLatDecDegs": "36.983611",
  "FacilityLongDecDegs": "-085.957222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 156253999,
  "ParentCompanyName": "Glasgow Water Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Glasgow Water Company",
  "OperatorStr1": "126 East Public Square",
  "OperatorStr2": null,
  "OperatorCity": "Glasgow",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "42141",
  "OperatorZipCodeExt": null,
  "RMPContact": "Larry Estes",
  "RMPTitle": "Superintendent of Wastewater",
  "FTE": 6,
  "OtherEPAFacilityID": "KY0021164",
  "EPAFacilityID": "100000098002",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1994-10-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-03-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-03-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-03-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-12-06 00:00:00",
  "DeRegistrationEffectiveDate": "2016-09-13 00:00:00",
  "AnniversaryDate": "2011-03-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 36.98333,
  "FRS_Long": -85.95778,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "52.3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 65246,
      "AltID": "Sewage Treatment Plant",
      "FacilityID": 45144,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 66807,
          "ProcessID": 65246,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 86402,
          "ProcessID": 65246,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 586402,
          "ProcessID": 65246,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 45144,
      "SummaryText": "\n\nExecutive Summary\n\n \n\nGlasgow Waste Water Treatment Plant\n\n \n\n? Background\n\nGlasgow Water Company, located in Glasgow, Kentucky, operates the Glasgow \n\nWaste Water Treatment Plant (WWTP).  The facility is subject to EPA?s Risk \n\nManagement Program in accordance with Section 112(r) of the Clean Air Act (CAA).  \n\nThe WWTP treats municipal and industrial wastes prior to disposal to Huggins \n\nBranch.\n\n \n\n? Chemical Management Program\n\nAs a concerned member of the community, the Glasgow Water Company takes its \n\nrole as a responsible citizen very seriously.  Glasgow Water Company facilities are \n\noperated to protect employees, contractors and the public from injury and illness, and \n\nto minimize environmental impact.  Glasgow Water Company?s policy is to inspect, \n\nmaintain and operate equipment and facilities to prevent accidents, including release \n\nof hazardous materials, and to train employees in prevention of accidents.\n\n \n\nGlasgow Water Company has developed and implemented Process Safety \n\nManagement (PSM) plans at each operations facility as part of an overall chemical \n\nmanagement program.  The program involves the Superintendents at each facility \n\nalong with the plant operators.\n\n \n\n1) Accidental Release Prevention and Emergency Response Policies\n\n \n\nThe Glasgow WWTP has developed a PSM plan as part of the overall chemical \n\nmanagement program.  The program involves the Superintendent and all operators at \n\nthe facility.  WWTP personnel also provides safety training to staff as part of the \n\naccidental release prevention program.\n\n \n\n2) Description of Facility and the Regulated Substances\n\n \n\nThe Glasgow WWTP is located at 705 Glen Garry Road in Glasgow, Kentucky.  This \n\nfacility began operation in 1960 and is located south of the Glasgow Landfill.  The \n\nWWTP?s chlorination process is covered by EPA?s 40 CFR Part 68.\n\n \n\nThe facility operates a water treatment plant (WTP) with a maximum capacity of four \n\nmillion gallons per day (MGD). After treatment, the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 45144,
      "SummaryText": " waste water is discharged to \n\nHuggins Branch.  \n\n \n\nChlorine gas is injected into the water for disinfection purposes.  The chlorine system \n\nutilizes a Wallace & Tiernan vacuum operated, automatic switchover gaseous feed \n\nsystems with two 1-ton containers piped together to provide uninterrupted flow of \n\nchlorine.  Currently, the feed rate for chlorine ranges from approximately 30 ? 100 \n\npounds per day.\n\n \n\nThe maximum chlorine inventory at the WWTP includes three 1-ton chlorine \n\ncontainers.  Under normal circumstances, a full container and a container in use are \n\npiped together and situated on the scale apparatus and a third 1-ton container is stored \n\nin an adjacent room separated by steel sliding doors that are kept closed unless \n\nemployees are in the Scale Room.\n\n \n\n3) Worst-Case Release Scenarios\n\nThe predicted worst-case release scenario for chlorine is a catastrophic release of one \n\n(full) chlorine container within the Scale Room.  This enclosure will limit the \n\ndispersion of both liquid and vapor to the atmosphere during a release.  For this \n\nscenario, 2,000 pounds of chlorine liquefied under pressure are assumed to be \n\nreleased in 10 minutes.  Using RMP*Comp Version 1.06 air dispersion modeling \n\nsoftware, the distance to a toxic endpoint of 0.0087 mg/l is predicted to be 0.9 miles.  \n\n \n\nAs an input parameter for RMP*Comp, the topography surrounding the WWTP was \n\nconsidered ?urban?.  It should be noted that this parameter is not directly correlated to \n\npopulation density.  Rather, the topography surrounding the facility is characterized \n\nas either having many obstructions ? ?urban? or generally flat with few obstructions ? \n\n?rural?.  It was determined that because the WWTP was surrounded by trees and \n\nrolling hills, the topography would be characterized as ?urban? for modeling \n\npurposes.\n\n \n\nThis 0.9 mile radius encompasses approximately 259 residences, and several \n\nindustries.  Assuming a population multiplier of 3.5 people per residenc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 45144,
      "SummaryText": "e, this radius \n\nencompasses approximately 910 people.  The number of residences and other public \n\nand environmental receptors associated with this radius was provided by Glasgow \n\nWater Company personnel from GIS data using the latitude and longitude of the \n\nfacility and a radius of 0.9 miles provided by EMPE.\n\n \n\n4) Alternative Release Scenarios\n\nThe proposed alternative release scenario for this facility is the rupture of a 3/8 inch \n\ndiameter flexible metal connector that conveys chlorine gas under pressure from the \n\nton container to the piping manifold.  As a result, a rupture of this line would result in \n\nan unmitigated discharge of chlorine vapor from the container.\n\n \n\nFor this release scenario, the delivery line is ruptured or severed and chlorine vapor \n\ndischarges from the end of the line at a pressure equal to that of the container.  It is \n\nassumed that the release occurs when the temperature of the container is 77 degrees F \n\nat a pressure is 113 pounds per square inch (psi).\n\n \n\nGiven a hole diameter of 0.11 inches at this temperature and pressure, RMP*Comp \n\ncalculated a release rate of 20.9 pounds of chlorine per minute.  The release will \n\nproceed at this rate for 1 hour, at which time the release is stopped by local \n\nemergency responders. \n\n \n\nOff-site consequences analysis using RMP*Comp resulted in a radius of impact of \n\n0.1 miles.  Using the methodology described in the worst-case scenario above, it was \n\ndetermined that there are no environmental or public receptors located within this \n\nradius.\n\n \n\nBecause the specific gravity of chlorine is 2.49 (air = 1.29), chlorine vapor is more \n\ndense than air.  As a result, chlorine vapor may collect and/or migrate along low-lying \n\nareas such as the Huggins Branch, to the southeast of the facility.  However, the \n\nmigration of chlorine vapor in the event of an actual release will be highly dependent \n\nupon the atmospheric conditions and release scenario at that time of the release.\n\n \n\n5) Genera"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 45144,
      "SummaryText": "l Accident Release Prevention Program\n\nThe Glasgow WWTP maintains a Process Safety Management (PSM) of Highly \n\nHazardous Chemicals plan prepared in accordance with the Occupational Health and \n\nSafety Administration (OSHA) regulation 29 CFR 1910.119.  The WWTP also \n\nutilizes preventative maintenance programs for its system components.  The \n\npreventative maintenance program for the chlorination system is conducted in \n\nconformance with manufacturer?s recommendations.\n\n \n\n6) Five-Year Accident History\n\nMr. Larry Estes, Glasgow WWTP Superintendent, indicated there has not been a \n\nreportable accident within the last five years.\n\n \n\n7) Emergency Response Program\n\nThe Glasgow WWTP has implemented an Emergency Action Plan in accordance \n\nwith OSHA PSM regulations.  The facilities will rely on the Glasgow Fire \n\nDepartment to respond in the event of a hazardous material release, fire or other \n\nemergency situation.  The written Emergency Action Plan contains specific \n\ninformation regarding evacuation and notification procedures in the event of a \n\ncatastrophic chlorine release.\n\n \n\nThe Glasgow Fire Department has conducted a reconnaissance of the facility and \n\ntrained personnel are ready to respond if requested.\n\n \n\n8) Planned Changes to Improve Safety\n\n \n\nThe Glasgow WWTP is in the process of implementing safety improvements as \n\nrecommended in the Process Safety Management program.  The improvements \n\nhave been completed.\n\nGlasgow Water\\Reports\\WWTP RMP ExecSum.doc"
    }
  ]
}