{
  "FacilityID": 4516,
  "FacilityName": "Continental Deli Foods",
  "FacilityStr1": "1300 South Lake Street",
  "FacilityStr2": null,
  "FacilityCity": "Cherokee",
  "FacilityState": "IA",
  "FacilityZipCode": "51012",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19035",
  "LEPC": null,
  "FacilityLatDecDegs": "42.730833",
  "FacilityLongDecDegs": "-95.555556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5569397,
  "ParentCompanyName": "Foodbrands America",
  "Company2Name": null,
  "CompanyDUNS": 5569397,
  "Company2DUNS": 0,
  "OperatorName": "Continental Deli Foods",
  "OperatorStr1": "1300 South Lake Street",
  "OperatorStr2": null,
  "OperatorCity": "Cherokee",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "51012",
  "OperatorZipCodeExt": null,
  "FTE": 625,
  "OtherEPAFacilityID": "IAR000000786",
  "EPAFacilityID": "100000056093",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Cherokee, Iowa",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-11-04 00:00:00",
  "DeRegistrationEffectiveDate": "2014-11-01 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 42.73048,
  "FRS_Long": -95.55893,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5257,
      "AltID": "Ammonia",
      "FacilityID": 4516,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 5633,
          "ProcessID": 5257,
          "ChemicalID": 56,
          "Quantity": 27550.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5368,
          "ProcessID": 5257,
          "NAICSCode": "311612",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2073,
              "Process_NAICS_ID": 5368,
              "SafetyReviewDate": "1998-11-01 00:00:00",
              "PHA_Date": "1999-03-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-01-01 00:00:00",
              "TrainingReviewDate": "1999-01-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-01-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "compressors, suction accumulators, high pressure receivers, condensers, air handlers, chiller coils, and oil pots",
              "ChangeMgmtDate": "1999-02-01 00:00:00",
              "ChangeMgmtReviewDate": "1998-12-01 00:00:00",
              "PreStartupReviewDate": "1999-04-01 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-12-19 00:00:00",
              "HotWorkPermitReviewDate": "1997-06-01 00:00:00",
              "ContractorSafetyReviewDate": "1998-05-21 00:00:00",
              "ContractorSafetyEvalDate": "1999-03-01 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2308,
                  "PreventionProgram3ID": 2073,
                  "ProcessChemicalID": 5633
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4516,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-06-04 00:00:00",
    "ERTrainingDate": "1999-11-08 00:00:00",
    "CoordinatingAgencyName": "Cherokee Fire Department",
    "CoordinatingAgencyPhone": "7122253906",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4516,
      "SummaryText": "\nEXECUTIVE SUMMARY\n\nAccident Release Prevention Program and Emergency Response Policy\nIt is the policy of the Continental Deli Foods (Continental Deli) facility management to implement the requirements of this Risk Management Program (RMP) in accordance with the USEPA regulations under 40 CFR Part 68 and with the corresponding regulations under OSHA's Process Safety Management (PSM) program. The objective is to minimize the risk of a release of a hazardous material and if a release occurs, to minimize the potential impact to Continental Deli employees, the public and the environment. This objective will be accomplished by utilizing general good operating procedures, providing appropriate training to all employees, and coordinating response activities, as necessary, with the local emergency response providers.\nContinental Deli's management is committed to providing the resources necessary to implement this policy.\nFacility Description\nContinental Deli operates a meat processing operation at this facility. Continental Deli produces wholesale deli products including hams, canadian bacon, a variety of sausages and roast beef. Operations at the facility include smokehouses, ovens and a number of coolers and chillers. Figure 1-1 shows the facility location and Figure 1-2 shows the facility layout.\nOne chemical, ammonia, is utilized at the facility in sufficient quantities to be subject to the requirements of 40 CFR Part 68, RMP. Ammonia is used as a refrigerant throughout the facility.\nWorst-Case and Alternative-Case Release Scenarios\nRMP regulations require that each facility complete worst-case and alternative-case release scenarios. USEPA has defined a worst-case release as the release of the entire contents of the largest vessel that contains a regulated substance in a 10-minute period. This release rate is then evaluated using modeling techniques and/or reference tables to define the distance to a specified endpoint (concentration or overpressure). The distance to th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4516,
      "SummaryText": "e endpoint is affected by several factors including molecular weight, volatility, heat of combustion, and physical setting (urban or rural).\nThe alternative release scenario for each covered process must be one that is more likely to occur than the worst-case scenario and that reaches an endpoint off site, unless no such scenario exists. The alternative release scenario is evaluated using the same techniques as the worst-case scenario to define the distance to the specified endpoint.\nUnder 40 CFR 68 Subpart B '68.22(e), the RMP rule identifies surface roughness as a parameter to be used in the hazard assessment to determine the physical setting of the site, urban or rural.  \"Urban means there are many obstacles in the immediate area; obstacles include buildings or trees.  Rural means there are no buildings in the immediate area and the terrain is generally flat and unobstructed.\"\nDue to the presence of trees, hills, and other structures in the immediate vicinity of the Cherokee, Iowa, facility, an urban dispersion environment was assumed.\nAmmonia\nThe data provided in the document \"Model Risk Management Program and Plan for Ammonia Refrigeration\" (May 1996) was used to estimate the toxic endpoint distance for the worst-case and alternative ammonia release scenarios. The EPA's \"RMP Off-site Consequence Analysis Guidance\" (May 1996) was not used to determine the toxic endpoint since it classifies ammonia as a \"neutrally buoyant gas.\" The worst-case ammonia release would involve liquid and would come from a pressurized liquid system; the released gas should be classified as a \"dense gas\" (a result of evaporative cooling). The ammonia refrigeration document provides calculated endpoint distances for typical meteorological conditions.\nThe worst-case release scenario for an anhydrous ammonia release included a release of all the contents of the low-pressure accumulator in a 10-minute period (per EPA guidelines). This release translates to a release of 6,888 pounds of ammon"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4516,
      "SummaryText": "ia in 10 minutes or 688.8 lbs/min. Other assumptions included in the worst-case assessment are: the ammonia is a liquefied gas; the low-pressure accumulator is not diked; the release does not take place indoors; the nearfield dispersion environment is characterized as urban; 10-minute averaging period; the wind speed is 1.5 meters/sec and the atmospheric stability is classified as F (stable). The results of the worst-case assessment for ammonia show that the plume must travel 0.98 miles (1.58 kilometers) before dispersing to the endpoint concentration of 200 ppm. Figure 1-3 shows the worst-case release area.\nThe selected alternative release scenario for the ammonia system is a release from the shearing of a 1-inch liquid pipe located on the roof. A release rate of 2,140 pounds of air per minute was calculated for this scenario.\nThe ammonia refrigeration document provides calculated endpoint distances for typical meteorological conditions (3 m/s wind speed, D atmospheric stability, 50% relative humidity. Other assumptions include no active or passive mitigation measures are currently in place and an urban dispersion environment in the nearfield. The results of the alternative-release scenario for an ammonia release indicates that the endpoint concentration of 200 ppm is reached at 0.3 miles (0.48 kilometers) from the release point. Note that this represents an overestimate of the distance as the ammonia released from the relief valve is assumed to be a dense gas. Figure 1-4 shows the alternate release area.\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\nThe Cherokee, Iowa, facility is governed by a set of OSHA and USEPA regulations that require planning and facility activities intended to prevent a release of hazardous material, or if a release inadvertently occurs, to minimize the consequences of a release to the employees of the facility, the public and to the environment.  These regulations include:\n* 40 CFR Part 68, Accidenta"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4516,
      "SummaryText": "l Release Prevention\n* 40 CFR Part 112, Spill Prevention, Control and Countermeasure\n* 40 CFR Part 264, Hazardous Waste Contingency Plan\n* 29 CFR Part 119, Process Safety Management\nThe key concepts in Continental Deli's release prevention program are employee participation, appropriate design and maintenance of equipment, and appropriate training of all employees.\nEmployee participation in the release prevention program is encouraged and supported by Continental Deli management. Continental Deli management and hourly personnel are members of the PSM committee. Key personnel are responsible for conducting and implementing the findings from the Process Hazard Analysis (PHA) for the ammonia system. Continental Deli employees are also members of the facility emergency response team.\nContinental Deli policy is to construct all new equipment, systems, and facilities to ensure the appropriate safety and release prevention systems are included from the beginning of each project. Continental Deli maintains a computerized program of maintenance activities to ensure that key systems are maintained appropriately to minimize the risk of a release.\nContinental Deli is committed to providing appropriate training to all employees regarding safety procedures. Each new employee is provided comprehensive safety training during their initial orientation for the facility. In addition, Continental Deli conducts regularly scheduled safety training for all employees each year. Additional training is provided to maintenance personnel for the systems they are responsible for. Members of Continental Deli's emergency response team receive annual training to ensure that response actions are promptly and safely completed.\nFive Year Accident History\nContinental Deli has not had a release of ammonia from the Cherokee, Iowa, facility that has affected employees, the public or the environment within the last five years.\nEmergency Response Program\nContinental Deli has personnel trained in emergency "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4516,
      "SummaryText": "response at the facility during hours of operation. These personnel receive annual training on emergency procedures and response techniques.\nPlanned Changes to Improve Safety\nContinental Deli completes a thorough review of the ammonia system each time a design change is implemented. Continental Deli is committed to using these methods to identify and implement ways to improve the safety of the system. The PSM committee is involved with any modification of the Standard Operating Procedures (SOPs), Process and Instrumentation Diagrams (P&IDs), and the Emergency Response Plan. Currently, the PSM committee is in the process of modifying the portion of the system located in the basement. Equipment is being replaced and relocated to a safer and more accessible location.\n\n"
    }
  ]
}