{
  "FacilityID": 45164,
  "FacilityName": "Waco Thermal Manufacturing Plant",
  "FacilityStr1": "8400 Imperial Drive",
  "FacilityStr2": null,
  "FacilityCity": "Waco",
  "FacilityState": "TX",
  "FacilityZipCode": "76712",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48309",
  "LEPC": "Mclennan County LEPC",
  "FacilityLatDecDegs": "31.488417",
  "FacilityLongDecDegs": "-097.208806",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Coca-Cola North America",
  "Company2Name": null,
  "CompanyDUNS": 3296175,
  "Company2DUNS": null,
  "OperatorName": "Coca-Cola North America",
  "OperatorStr1": "One Coca-Cola Plaza",
  "OperatorStr2": null,
  "OperatorCity": "Altanta",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30301",
  "OperatorZipCodeExt": null,
  "FTE": 326,
  "OtherEPAFacilityID": "TXR000056226",
  "EPAFacilityID": "100000155333",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-12-06 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2006-03-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-03-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2006-03-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-03-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.6",
  "FRS_Lat": 31.488417,
  "FRS_Long": -97.208806,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R05",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 65318,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 45164,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 86508,
          "ProcessID": 65318,
          "ChemicalID": 56,
          "Quantity": 37600.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 66879,
          "ProcessID": 65318,
          "NAICSCode": "311421",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 38278,
              "Process_NAICS_ID": 66879,
              "SafetyReviewDate": "2003-10-31 00:00:00",
              "PHA_Date": "2003-12-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-03-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2006-02-09 00:00:00",
              "TrainingReviewDate": "2003-12-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2005-03-01 00:00:00",
              "EquipmentInspectionDate": "2005-03-01 00:00:00",
              "EquipmentTested": "Complete Ammonia Refrigeration System",
              "ChangeMgmtDate": "2004-09-01 00:00:00",
              "ChangeMgmtReviewDate": "2006-03-06 00:00:00",
              "PreStartupReviewDate": "2004-09-01 00:00:00",
              "ComplianceAuditDate": "2005-03-01 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "2000-07-15 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2005-03-08 00:00:00",
              "HotWorkPermitReviewDate": "2005-09-01 00:00:00",
              "ContractorSafetyReviewDate": "2006-03-01 00:00:00",
              "ContractorSafetyEvalDate": "2005-06-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 55726,
                  "PreventionProgram3ID": 38278,
                  "ProcessChemicalID": 86508
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 45164,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2006-01-01 00:00:00",
    "ERTrainingDate": "2006-02-01 00:00:00",
    "CoordinatingAgencyName": "City of Waco Fire Department",
    "CoordinatingAgencyPhone": "2547501740",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 45164,
      "SummaryText": "Coca-Cola North America ¿ Waco Thermal Manufacturing Plant\nRisk Management Plan for Ammonia\n\nExecutive Summary\n\n1.  Accidental Release Prevention and Emergency Response Policies\n\nCoca-Cola North America is strongly committed to employee, public, and environmental safety.  This commitment is inherent to our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with our regulated processes.  It is our policy to implement appropriate controls to prevent possible accidental releases of regulated substances.  However, if such an accidental release does occur, we are coordinated with the City of Waco Fire Department and the McLennan County LEPC for emergency response support.\n\n2.  The Stationary Source and the Regulated Substances Handled\n\nThis facility is used for the production of juice and fruit drink products.  Ammonia is the only RMP regulated substance present at this facility in a threshold quantity.  It is utilized as the primary cooling media in our closed-loop refrigeration system.  The ammonia refrigeration system has been operational since December of 1998.  The system¿s purpose is to provide cold storage capabilities for certain products.  The amount of ammonia currently present in the refrigeration system totals approximately 37,600 pounds.  Due to the size and characteristics of our ammonia refrigeration system, as well as Process Safety Management (PSM) applicability, this facility is covered under Program 3 of the RMP regulations.\n\n3.  The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n\nTo evaluate both the worst case and alternative release scenarios, the EPA model, RMP*Comp Version 1.07, was used.  RMP*Comp is designed as a planning tool to be used in assessing and identifying high-priority hazards at a facilit"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 45164,
      "SummaryText": "y for the Risk Management Program.  This model incorporates the EPA¿s most recent Off-site Consequence Analysis guidance.\n\nThe worst case scenario would involve the catastrophic failure of the low-pressure receiver.  Since no control measures prevent the entire system from releasing due to failure of the receiving tank, a release quantity of the entire system (37,600 pounds) is assumed.   As specified in the RMP Guidance for Ammonia Refrigeration, the worst case scenario assumes the release occurs over a period of 10 minutes, yielding a release rate of 2,070 pounds per minute.  The vessel is located inside the facility engine room, however, the release rate is considered passively mitigated due to the presence of an overhead door to the outside.  Under worst case weather conditions (Class F atmospheric stability and 1.5 m/s wind speed) as required by the RMP rule, RMP*Comp yielded a distance of 1.7 miles to the toxic endpoint of 0.14 mg/L (200 ppm) (¿zone of influence¿).  The estimated residential population for the zone of influence is approximately 13,549 based on 2000 consensus data calculated by LANDVIEW 6 software.  Other public receptors identified within the zone of influence include schools and commercial/industrial areas.  No environmental receptors are known to be located within the zone of influence.\n\nSeveral alternative release scenarios were evaluated; however, these scenarios, when modeled, did not reach a toxic endpoint offsite.  For the purpose of this RMP submission, the following alternative release scenario was chosen because it is one of the few that would reach an endpoint offsite as required by the RMP rule.  The scenario chosen involves the slow leak of ammonia from a source equivalent to a 0.50 inch diameter hole in the high pressure part of the ammonia system.  This scenario could be representative of multiple situations such as a small hole in a vessel or pipe, a pinpoint hole in a condenser coil, or a packing leak around a valve stem.  Due"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 45164,
      "SummaryText": "to the presence of an alarm system and isolation valves, the release would be stopped within a 5-10 minute timeframe.  Under average weather condition, RMP*Comp yielded a distance to toxic endpoint of 0.1 miles.  The majority of area within the zone of influence exhibits open topography, with neighboring residences and industrial buildings being the only offsite receptors identified.  The estimated residential population for the zone of influence is zero, based upon 2000 census data calculated by LANDVIEW 6 software.\n\n4.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nThe facility has taken all necessary steps to comply with the accidental release prevention requirements set forth in 40 CFR Part 68.  Our facility is also subject to the OSHA PSM standard under 29 CFR 1910.119, as well as the EPCRA Section 302 and 311/312 notification/reporting requirements.  The following sections briefly describe the elements of the accidental release prevention program that is in place at our facility.\n\nProcess Safety Information\n\nCoca-Cola North America maintains a detailed record of safety information that describes the chemical hazards, operating parameters, and equipment designs associated with the ammonia refrigeration system.\n\nProcess Hazard Analysis\n\nAs part of the ammonia refrigeration system installation process, and as required under PSM, the facility conducted a comprehensive study to ensure that hazards associated with its ammonia refrigeration system are identified and controlled efficiently.  These studies, using ¿What If¿ scenarios, will be repeated every 5 years by a team of qualified personnel with expertise in refrigeration engineering and process operations.  Any findings related to the process hazard analysis will be addressed in a timely manner.\n\nOperating Procedures\n\nFor the purpose of safely conducting activities related to our ammonia refrigeration system, Coca-Cola North America maintains written operating pro"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 45164,
      "SummaryText": "cedures.  These procedures address various modes of operation including startup, normal operations, emergency operations, normal shutdown, and emergency shutdown.  The information is regularly reviewed and is readily accessible to all operators and contractors who work with the ammonia refrigeration system.\n\nTraining\n\nCoca-Cola North America has a comprehensive training program in place to ensure that employees who are working with the ammonia refrigeration system are competent in all relevant operating procedures.  Refresher training is provided at least every three (3) years or more frequently as needed.\n\nMechanical Integrity\n\nCoca-Cola North America carries out and documents maintenance checks on ammonia refrigeration system equipment to ensure proper operation.  Process equipment examined by these checks includes among others:  pressure vessels, piping systems, pressure relief valves, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in applicable maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\n\nWritten procedures are in place at Coca-Cola North America to manage changes in ammonia refrigeration system technology, equipment, and procedures.  Process operators, maintenance personnel, or any other employee whose job tasks are affected by an ammonia refrigeration system modification are promptly made aware of, and offered training to deal with, the modification.\n\nPre-startup Reviews\n\nPre-start up safety reviews are conducted any time the ammonia refrigeration system, or any of its components, are opened for repairs, tie-ins, or modifications.  These reviews are conducted to confirm that construction, equipment, operating procedures, and maintenance procedures are suitable for safe startup prior to placing e"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 45164,
      "SummaryText": "quipment into operation.\n\nCompliance Audits\n\nCoca-Cola North America will conduct audits on a regular basis to ensure that the provisions set out under the RMP rule are being properly implemented.  These audits will be carried out at least every three (3) years and any corrective actions required as a result of the audits shall be undertaken in a safe and prompt manner.\n\nIncident Investigation\n\nCoca-Cola North America promptly investigates any incident that has resulted in, or could reasonably result in, an accidental release of ammonia.  These investigations are undertaken to identify the situation leading to the incident, as well as any corrective actions implemented to prevent the release from reoccurring.  All incident investigation reports will be retained for a minimum of five (5) years.\n\nEmployee Participation\n\nCoca-Cola North America truly believes that accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information related to RMP implementation, including Process Hazard Analyses (PHA) information.\n\nContractors\n\nOn occasion, our company hires experienced contractors to conduct specialized maintenance and/or construction activities related to the ammonia refrigeration system.  Prior to selecting a contractor, a thorough evaluation is made of the contractor¿s safety performance.  Coca-Cola North America has a strict policy of informing the contractors of known potential hazards related to the contractor¿s work with the ammonia refrigeration system.  Contractors are also informed of all the procedures for emergency response should an accidental release of ammonia occur.\n\n5.  Five-year Accident History\n\nThere have been no accidental releases at this site within the past 5 years.\n\n6.  Emergency Response Plan\n\nCoca-Cola North America Emergency Response Policy focuses on evacuation of the facility in"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 45164,
      "SummaryText": "the event of an ammonia emergency, with local emergency response agencies performing all rescue, firefighting, first-aid, medical treatment, and other response functions.  The facility maintains a written Emergency Response Plan to document specific procedures to be implemented in the event of various emergencies, including an ammonia release.  The Emergency Response Plan includes procedures for facility evacuation, as well as for notification of the local emergency response agencies which are responsible for notifying the public.  The plan is promptly updated to reflect any pertinent changes taking place within the facility that would require modified procedures.\n\nThe McLennan County LEPC is the Local Emergency Planning Committee (LEPC) with which our Emergency Response Plan has been coordinated.  The Waco Fire Department is the primary emergency response agency for all facility emergencies, including ammonia releases.\n\n7.  Planned Changes to Improve Safety\n\nThe facility has no currently planned changes to the ammonia refrigeration system, but will periodically assess opportunities to improve the safety of that system."
    }
  ]
}