{
  "FacilityID": 45173,
  "FacilityName": "Nogales International Wastewater Treatment Plant",
  "FacilityStr1": "865 Rio Rico Industrial Park",
  "FacilityStr2": null,
  "FacilityCity": "Rio Rico",
  "FacilityState": "AZ",
  "FacilityZipCode": "85648",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04023",
  "LEPC": "Santa Cruz County LEPC",
  "FacilityLatDecDegs": "31.456667",
  "FacilityLongDecDegs": "-110.968056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "S1",
  "LatLongDescription": "WR",
  "FacilityURL": "www.ibwc.state.gov",
  "FacilityEmailAddress": "sallyspener@ibwc.state.gov",
  "FacilityDUNS": null,
  "ParentCompanyName": "US Section, International Boundary & Water Comm.",
  "Company2Name": "City Of Nogales, Arizona",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "USIBWC",
  "OperatorStr1": "865 Rio RIco Industrial Park",
  "OperatorStr2": null,
  "OperatorCity": "Rio Rico",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85648",
  "OperatorZipCodeExt": null,
  "FTE": 9,
  "OtherEPAFacilityID": "AZ0020150",
  "EPAFacilityID": "100000120086",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-10-19 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2006-03-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-03-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2006-03-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2011-04-25 00:00:00",
  "DeRegistrationEffectiveDate": "2011-03-14 00:00:00",
  "AnniversaryDate": "2011-03-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.6",
  "FRS_Lat": 31.456667,
  "FRS_Long": -110.968056,
  "FRS_Description": "WATER RELEASE PIPE",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 65348,
      "AltID": "Chlorination of effluent",
      "FacilityID": 45173,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 86564,
          "ProcessID": 65348,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 66909,
          "ProcessID": 65348,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 38304,
              "Process_NAICS_ID": 66909,
              "SafetyReviewDate": "1999-03-24 00:00:00",
              "PHA_Date": "2004-02-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Safety Audit",
              "PHACompletionDate": "1998-05-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Chlortainer chlorine containment system",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-02-01 00:00:00",
              "TrainingReviewDate": "2004-02-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-02-01 00:00:00",
              "EquipmentInspectionDate": "2006-01-06 00:00:00",
              "EquipmentTested": "Chlorination vessels and systems 1 & 2",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2004-02-10 00:00:00",
              "PreStartupReviewDate": "2004-02-01 00:00:00",
              "ComplianceAuditDate": "2004-10-29 00:00:00",
              "AuditCompletionDate": "2005-09-01 00:00:00",
              "IncidentInvestigationDate": "1999-05-18 00:00:00",
              "InvestigationChangeDate": "1999-05-18 00:00:00",
              "ParticipationPlansReviewDate": "1998-05-21 00:00:00",
              "HotWorkPermitReviewDate": "1998-05-21 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-05-18 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 55778,
                  "PreventionProgram3ID": 38304,
                  "ProcessChemicalID": 86564
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 45173,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2005-02-01 00:00:00",
    "ERTrainingDate": "2005-03-01 00:00:00",
    "CoordinatingAgencyName": "Rio Rico Fire District",
    "CoordinatingAgencyPhone": "5202818421",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 45173,
      "SummaryText": "EXECUTIVE SUMMARY\n                                 Facility and the regulated substances handled:\n\nThe Nogales International Wastewater Treatment Plant (NIWTP) is an international wastewater treatment plant that treats wastewater from Nogales, Arizona and Nogales, Sonora (Mexico).  The plant has a design flow of 17.2 million gallons per day (mgd) and consists of grit basins, bar screens, detriter grit tanks, complete and partial mix aerated lagoons, dual media filtration, chloringe disinfection, and the addition of sulfur dioxide to remove excess chlorine.  The facility uses between 300 to 500 pounds of chlorine per day.  The chlorine storage building is a cinder block building with the capacity to store 4 cylinders of chlorine (2000 lbs each).  Currently the facility stores up to 4000 lbs of chlorine.  Granular calcium hypochlorite is also stored at the facility in a separate building.\n\nThe City of Nogales, Arizona (City) and the U.S. Section of the International Boundary and Water Commission (USIBWC) jointly own the plant.  It is currently being operated by the USIBWC under a National Pollutant Discharge Elimination System (NPDES) permit of July 2001 and an Aquifer Protection Permit of March 2003.  Design for an upgraded plant, with a design flow of 14.0 mgd, is scheduled for 2006.  \n\nAccidental release prevention and emergency response policies at facility:\n\nUSIBWC Safety and Health Policy Statement:\n\nThe USIBWC's goal is to provide safe and efficient performance-based management and operating services to all employees of the USIBWC.  We strongly believe that all accidents are preventable and that all tasks can be completed without injury or property damage.  Our commitment to proactive safety management; continuously improving processes; complying with state, federal, and local requirements (as applicable); and employee involvement will cultivate a strong safety culture and assist in the achievement of the Commissioner's goal of Zero Accidents.\n\nThe USIBWC Saf"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 45173,
      "SummaryText": "ety Manager establishes and provides for the necessary policies, procedures, and resources for implementing an effective accident prevention process.\n\nWorst case release scenario and the alternative release scenario:\n\nThe worst-case and the alternative release scenarios were completed using RPM*Comp, Version 1.06.\n\nThe worst case scenario was based on the release of the total quantity in one chlorine vessel (2000 lbs) through a liquid spill and vaporization in 10 minutes.  At a distance of 2.2 miles, the estimated residential population within distance to endpoint is 2,600 (the 1990 U.S. Census Bureau population reported for this zip code was 813).  Other public receptors within the distance to endpoint are schools, recreation, and major commercial, office or industrial areas.  The release would occur inside of, and be contained in, a Chlortainer® unit, in an enclosed building space, in direct contact with outside air, with safety shut-off valves and audible and electronic emergency alarms. A continuous monitoring chlorine gas detector is on-hand and should an accidental release occur, an alarm would be activated in the administrative building.  For after- hours releases, the alarm would activate an automatic call out system.\n\nThe alternative scenario was selected based on the most likely release to occur, a hole in the liquid space of tank, contained in a Chlortainer® unit.  At a distance of 0.8 mile, the estimated residential population within distance to endpoint is 700.  Other public receptors within the distance to endpoint are recreation, and major commercial, office or industrial areas.  The release would occur in an enclosed building space, in direct contact with outside air, with safety shut-off valves and audible and electronic emergency alarms. A continuous monitoring chlorine gas detector is on-hand and should an accidental release occur, an alarm would be activated in the administrative building.  For after-hours releases, the alarm would activate an au"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 45173,
      "SummaryText": "tomatic call out system.     \n\nGeneral accidental release prevention program and chemical-specific prevention steps:\n\nThe facility has participated in emergency planning exercises, and coordinated, with the Arizona Emergency Response Commission (AERC), the Local Emergency Planning Committee (LEPC), and the Rio Rico Fire Department (RRFD).  An Emergency Planning and Community Right-to-Know Act (EPCRA) Tier II inventory of the bulk storage of hazardous chemicals is submitted annually, and in February of 2005, an emergency response plan questionnaire was completed and submitted to the aforementioned agencies.  A hazard communication training program is in place and monthly safety meetings are held.  During May 2005, a drill of the NIWTP Emergency Response Plan was conducted with the local Emergency Planning Committee. The drill simulated a major uncontrollable leak in a one-ton chlorine cylinder. The Rio Rico Fire District, Tubac Fire Department, and the Nogales Fire Department were the principle responders. The exercise served to familiarize the Fire Departments with the NIWTP system and to review NIWTP staff procedures.\n\nThe facility has an emergency response plan that includes policies for the prevention of accidental releases of chlorine gas, sulfur dioxide, and calcium hypochlorite.  Personnel have been trained and fitted with self contained breathing apparatus which are stored and accessible in case of an accidental release.  Personnel are trained in the proper procedures for handling, storing, and using chlorine gas, sulfur dioxide, and calcium hypochlorite, and connecting/disconnecting the pressurized cylinders.  A chlorine repair kit is located in the control room of the administrative building, and a spill kit including booms is accessible to personnel.  All operations personnel are 40 hour Hazwoper trained.     \n\nFive-year accident history:\n\nThe facility has had no accidental releases in the last five years.\n\nEmergency response program: \n\nAn emergency respon"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 45173,
      "SummaryText": "se program is in place which includes planned notification procedures to the local emergency response units in the order of proximity to the facility, and the public through the Emergency Services Coordinator.  Procedures for evacuation of personnel including transport location, route, and accounting are included in the facility plan.  A site map and transportation routes to the wastewater facility in relation of the local area have been provided to the AERC, LEPC, and RRFD.  Cellular phones and handheld radios are available and would be used by facility personnel in an emergency situation.  The chlorine storage building is a cinder block building with the capacity to store 4 cylinders of chlorine (2000 lbs each).  The building has safety shut-off valves and audible and electronic emergency alarms in case of leaks. Continuous monitoring chlorine gas and sulfur dioxide detectors are on-hand to monitor gas leaks.  Should an accidental release occur, an alarm would be activated in the administrative building.  For after-hours releases, the alarm would activate an automatic call out system.\n\nPlanned changes to improve safety:\n\nIn order to avoid tampering with empty cylinders, the facility installed an eight foot fence around the loading dock of the chlorine storage building.  The facility is being upgraded to lessen the dependence on extremely hazardous substances while improving the quality of the treated effluent. Chlorine cylinders in service are contained in Chlortainers® for safety.  The chlortainers were installed in 2003 and 2004.  There are currently failsafes on the Chlortainers®  that are tied into the gas alarm system which automatically shuts down the gas feeds if chlorine gas is detected in either the control room of the chlorine building or in the actual tank room, this will occur during a power failure as well. \n\nAggressive environmental compliance and safety and health programs are in place to ensure compliance with applicable regulations, continuously m"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 45173,
      "SummaryText": "onitor procedures and implement strategies for improvements.  Corrections to the Risk Management Plan will be submitted as required.\nEXECUTIVE SUMMARY\r\n                                 Facility and the regulated substances handled:\r\n\r\nThe Nogales International Wastewater Treatment Plant (NIWTP) is an international wastewater treatment plant that treats wastewater from Nogales, Arizona and Nogales, Sonora (Mexico).  The plant has a design flow of 17.2 million gallons per day (mgd) and consists of grit basins, bar screens, detroiter grit tanks, partial and complete mix aerated lagoons, dual media filtration and ultraviolet  light disinfection.  The disinfection of effluent is assisted by the addition of gaseous chlorine prior to the ultraviolet disinfection, and the addition of sulfur dioxide to remove excess chlorine.  The facility uses between 200 and 300 pounds of chlorine per day.  The chlorine storage building is a cinder block building with the capacity to store 8 cylinders of chlorine (2000 lbs each).  Currently the facility stores up to 4000 lbs of chlorine.  Granular calcium hypochlorite is also stored at the facility.\r\n\r\nThe City of Nogales, Arizona (City) and the U.S. Section of the International Boundary and Water Commission (USIBWC) jointly own the plant.  It is currently being operated by the USIBWC under a National Pollutant Discharge Elimination System (NPDES) permit and a Groundwater Protection Permit of May 1990.\r\n\r\nAccidental release prevention and emergency response policies at facility:\r\n\r\nUSIBWC Safety and Health Policy Statement:\r\n\r\nThe USIBWC's goal is to provide safe and efficient performance-based management and operating services to all employees of the USIBWC.  We strongly believe that all accidents are preventable and that all tasks can be completed without injury or property damage.  Our commitment to proactive safety management; continuously improving processes; complying with state, federal, and local requirements (as applicable); and"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 45173,
      "SummaryText": "employee involvement will cultivate a strong safety culture and assist in the achievement of the Commissioner's goal of Zero Accidents.\r\n\r\nThe USIBWC Safety and Health Manager establishes and provides for the necessary policies, procedures, and resources for implementing an effective accident prevention process.\r\n\r\nWorst case release scenario and the alternative release scenario:\r\n\r\nThe worst-case and the alternative release scenarios were completed using RPM*Comp, Version 1.06.\r\n\r\nThe worst case scenario was based on the release of the total quantity in one chlorine vessel (2000 lbs) through a liquid spill and vaporization in 10 minutes.  At a distance of 2.2 miles, the estimated residential population within distance to endpoint is 2,000 (the 1990 U.S. Census Bureau population reported for this zip code was 813).  Other public receptors within the distance to endpoint are recreation, and major commercial, office or industrial areas.  The release would occur in an enclosed building space, in direct contact with outside air, with safety shut-off valves and audible and electronic emergency alarms. A continuous monitoring chlorine gas detector is on-hand and should an accidental release occur, an alarm would be activated in the administrative building.  For after- hours releases, the alarm would activate an automatic call out system.\r\n\r\nThe alternative scenario was selected based on the most likely release to occur, a hole in the liquid space of tank.  At a distance of 0.8 mile, the estimated residential population within distance to endpoint is 500.  Other public receptors within the distance to endpoint are recreation, and major commercial, office or industrial areas.  The release would occur in an enclosed building space, in direct contact with outside air, with safety shut-off valves and audible and electronic emergency alarms. A continuous monitoring chlorine gas detector is on-hand and should an accidental release occur, an alarm would be activated in the admin"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 45173,
      "SummaryText": "istrative building.  For after-hours releases, the alarm would activate an automatic call out system.     \r\n\r\nGeneral accidental release prevention program and chemical-specific prevention steps:\r\n\r\nThe facility has participated in emergency planning exercises, and coordinated, with the Arizona Emergency Response Commission (AERC), the Local Emergency Planning Committee (LEPC), and the Rio Rico Fire Department (RRFD).  An Emergency Planning and Community Right-to-Know Act (EPCRA) Tier II inventory of the bulk storage of hazardous chemicals is submitted annually, and in February of 1998, an emergency response plan questionnaire was completed and submitted to the aforementioned agencies.  A hazard communication training program is in place and monthly safety meetings are held.  \r\n\r\nThe facility has an emergency response plan that includes policies for the prevention of accidental releases of chlorine gas, sulfur dioxide, and calcium hypochlorite.  Personnel have been trained and fitted with self contained breathing apparatus which are stored and accessible in case of an accidental release.  Personnel are trained in the proper procedures for handling, storing, and using chlorine gas, sulfur dioxide, and calcium hypochlorite, and connecting/disconnecting the pressurized cylinders.  A chlorine repair kit is located in the control room of the administrative building, and a spill kit including booms is accessible to personnel.  \r\n\r\nFive-year accident history:\r\n\r\nThe facility has had no accidental releases in the last five years.\r\n\r\nEmergency response program: \r\n\r\nAn emergency response program is in place which includes planned notification procedures to the local emergency response units in the order of proximity to the facility, and the public through the Emergency Services Coordinator.  Procedures for evacuation of personnel including transport location, route, and accounting are included in the facility plan.  A site map and transportation routes to the wastewater facil"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 45173,
      "SummaryText": "ity in relation of the local area have been provided to the AERC, LEPC, and RRFD.  Cellular phones and handheld radios are available and would be used by facility personnel in an emergency situation.  The chlorine storage building is a cinder block building with the capacity to store 8 cylinders of chlorine (2000 lbs each).  The building has safety shut-off valves and audible and electronic emergency alarms in case of leaks. Continuous monitoring chlorine gas and sulfur dioxide detectors are on-hand to monitor gas leaks.  Should an accidental release occur, an alarm would be activated in the administrative building.  For after-hours releases, the alarm would activate an automatic call out system.\r\n\r\nPlanned changes to improve safety:\r\n\r\nIn order to avoid tampering with empty cylinders, the facility is planning to install an eight foot fence around the loading dock of the chlorine storage building.  The facility is being upgraded to lessen the dependence on extremely hazardous substances while improving the quality of the treated effluent.  These upgrades are expected to be completed within the next three to five years.\r\n\r\nAggressive environmental compliance and safety and health programs are in place to ensure compliance with applicable regulations, continuously monitor procedures and implement strategies for improvements.  Corrections to the Risk Management Plan will be submitted as required."
    }
  ]
}