{
  "FacilityID": 45282,
  "FacilityName": "CENTRAL WATER PLANT No. 2",
  "FacilityStr1": "F.M. 2021",
  "FacilityStr2": null,
  "FacilityCity": "Pollock",
  "FacilityState": "TX",
  "FacilityZipCode": "75969",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48005",
  "LEPC": "Angelina County LEPC",
  "FacilityLatDecDegs": "31.406667",
  "FacilityLongDecDegs": "-094.762778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "CENTRAL WATER CONTROL AND IMPROVEMENT DISTRICT",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "WAYNE RICE",
  "OperatorStr1": "5307 U.S. HIGHWAY 69 N",
  "OperatorStr2": null,
  "OperatorCity": "POLLOCK",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75969",
  "OperatorZipCodeExt": null,
  "RMPContact": "WAYNE RICE",
  "RMPTitle": "SUPERINTENDENT",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000151015",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-05-20 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-03-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-03-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-03-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-04-14 00:00:00",
  "DeRegistrationEffectiveDate": "2009-03-31 00:00:00",
  "AnniversaryDate": "2011-03-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 31.4297,
  "FRS_Long": -94.8391,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS BLOCK/TRACT-1990-CENTROID",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 65492,
      "AltID": "22131",
      "FacilityID": 45282,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 67053,
          "ProcessID": 65492,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 86770,
          "ProcessID": 65492,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 586770,
          "ProcessID": 65492,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 45282,
      "SummaryText": "1. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES - This facility is a water treatment plant which produces drinking water for a portion of the Central Water Control & Improvement District (WCID).  The regulated chemical in use at the water plant is chlorine which is used for disinfection as required by the Texas Natural Resources Conservation Commission (TNRCC).  It is the policy of the  Central WCID to provide a safe environment not only for the employees of the WCID but for all surrounding members of the water system.\n\nThe chlorine system is managed and equipped to minimize any release of harmful chemical from this facility.  Arrangements have been made with local volunteer fire departments as well as the City of Lufkin Fire Departments and County Law enforcement officials for evacuation of people within the community should a need arise.\n\n\n2. FACILITY AND REGULATED SUBSTANCES - The water treatment plant's primary purpose is to provide drinking water which meets the standards required by State and Federal agencies.  This process involves the removal of iron and other impurities and requires that the water meet certain bacteriological criteria.  In order to meet the criteria it is necessary to destroy any bacteria that may exist in the water through the use of chlorine.  The most cost effective method for this disinfection is through the use of chlorine gas. \n\nChlorine is purchased for use at this facility in one ton (2000 lb) cylinders.  This site will have two cylinders on hand at any one time.  However, due to ordering schedules and management techniques, the actual chlorine on hand at any time is normally less than 2500 -3000 lbs.\n\n\n3. WORST CASE SCENARIO - Due to chlorinator design and management procedures, the worst case scenario situation for this facility would be the failure of  the fusible plug of the chlorine cylinder.  This is a plug that the Chlorine Institute has installed on the one ton cylinder which melts when exposed to temperatur"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 45282,
      "SummaryText": "es in excess of 160 degrees Fahrenheit so as to release the chlorine and prevent explosive tendencies.  Should this plug completely fail, it is estimated that the release of 2000 lbs of chlorine will occur in approximately 10 minutes.  By using the RPMComp program supplied by the EPA, the toxic endpoint is 1.3 miles assuming a wind speed of 3.4 mph at an ambient temperature of 77 degrees F.  Using a compensation factor of 1.0123 for the higher temperatures normal for the East Texas area the toxic endpoint becomes 1.316 miles.  Due to the fact that this facility is located in a heavily forested area with a highly variable topography, the urban setting was used in this determination due to the dispersal tendencies of this terrain. \n\n\n4. ALTERNATIVE RELEASE SCENARIO - Due to chlorinator design and management procedures, the alternative scenario situation for this facility would be the failure of a valve on the one ton chlorine cylinder.  Should the packing gland fail and the valve fail to shut, some release of chlorine gas will occur (the lower valve will produce chlorine liquid, however this valve is never in use at this facilty).  Based on the same assumptions and calculation method used in the above worst case determination, the toxic endpoint for the alternative scenario is 0.101 miles.\n\n\n5. GENERAL ACCIDENT RELEASE PREVENTION PROGRAM - The risk of chlorine release at this facility is minimized through the use of a vacuum operated chlorinator and cylinder management.  The system uses only one chlorinator at a time (no dual automatic switchover system) which will only allow chlorine withdrawal from the cylinder when a vacuum is produced at the eductor system.  In other words, if the water well is not running, no chlorine is withdrawn from the cylinder.  Should the feed line from the cylinder become damaged or removed, no chlorine will escape.  Cylinder changeover is based on a chlorine scale which is closely monitored.  Cylinders are reordered approximately one week"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 45282,
      "SummaryText": " prior to the current cylinder is expected to be emptied to minimize the inventory of chlorine on site.  All employees that perform maintenance to the chlorine system and change cylinders are trained by the superintendent in the safety procedures and use of the Self Contained Breathing Apparatus (SCBA).  Review of these procedures is done on a bi-annual basis.\n\n\n6. FIVE YEAR ACCIDENT HISTORY - There have been no accidents or release incidents at this facility in the past five years.\n\n\n7. EMERGENCY RESPONSE PROGRAM - Should an chlorine incident occur, immediate steps will be taken by the superintendent to evaluate the need of calling for an evacuation of the affected area and the need of involving CHEMTREC for cylinder repair.  Should evacuation be necessary, the superintendent will notify the County Emergency Officials such as the Sheriff's Department and Fire departments to begin a house to house evacuation of the affected area as shown on the graphic Plant2.jpg file attached with this report.  Local Radio and TV stations in the area will also be notified to help speed evacuation."
    }
  ]
}