{
  "FacilityID": 45293,
  "FacilityName": "Central Elmore Water and Sewer Authority",
  "FacilityStr1": "65 Lake Point Road",
  "FacilityStr2": null,
  "FacilityCity": "Eclectic",
  "FacilityState": "AL",
  "FacilityZipCode": "36024",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01051",
  "LEPC": "Elmore County LEPC",
  "FacilityLatDecDegs": "32.698333",
  "FacilityLongDecDegs": "-086.054444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G5",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 555656029,
  "ParentCompanyName": "Central Elmore Water and Sewer Authority",
  "Company2Name": null,
  "CompanyDUNS": 555656029,
  "Company2DUNS": 0,
  "OperatorName": "Central Elmore Water and Sewer",
  "OperatorStr1": "65 Lake Point Road",
  "OperatorStr2": null,
  "OperatorCity": "Eclectic",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36024",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000006799",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-03-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-03-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-03-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-04-14 00:00:00",
  "DeRegistrationEffectiveDate": "2009-03-03 00:00:00",
  "AnniversaryDate": "2011-03-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 32.69833,
  "FRS_Long": -86.05444,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) STANDARD POSITION (SA OFF)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R06",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 65503,
      "AltID": null,
      "FacilityID": 45293,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 86781,
          "ProcessID": 65503,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 67064,
          "ProcessID": 65503,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 38394,
              "Process_NAICS_ID": 67064,
              "SafetyReviewDate": "2006-01-10 00:00:00",
              "PHA_Date": "2006-03-01 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2006-03-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2005-06-18 00:00:00",
              "TrainingReviewDate": "2006-01-10 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2005-11-01 00:00:00",
              "EquipmentInspectionDate": "2005-11-15 00:00:00",
              "EquipmentTested": "Fire Extinguishers, Chlorine Hoists, Pumps, Lab Equipment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2005-08-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2005-08-01 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2006-12-10 00:00:00",
              "HotWorkPermitReviewDate": "2005-05-31 00:00:00",
              "ContractorSafetyReviewDate": "2005-08-01 00:00:00",
              "ContractorSafetyEvalDate": "2005-08-01 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 55910,
                  "PreventionProgram3ID": 38394,
                  "ProcessChemicalID": 86781
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 45293,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2005-07-01 00:00:00",
    "ERTrainingDate": "2005-07-01 00:00:00",
    "CoordinatingAgencyName": "Elmore County Emergency Management",
    "CoordinatingAgencyPhone": "3345676451",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 45293,
      "SummaryText": "\nTABLE OF CONTENTS\n\nSECTION 1 EXECUTIVE SUMMARY    1\n\nSECTION 2 PLAN REQUIREMENTS    4\n\nSECTION 2.1 INTRODUCTION    4\n\nSECTION 2.2 PROGRAM LEVEL DETERMINATION    4\n\nSECTION 2.3 GENERAL REQUIREMENTS    4\n\n\n\nSECTION 3 HAZARD ASSESSMENT    5\n\n\n\nSECTION 3.1 TOXICOLOGY/PHYSICAL PROPERTIES    5\n\nSECTION 3.2 HAZARD REVIEW    5\n\n     TABLE 3.1 HAZARD REVIEW CHECKLIST    6\n\nSECTION 3.3 \"WORST CASE\" SCENARIO    10\n\nSECTION 3.4 ALTERNATE RELEASE\" SCENARIO    11\n\n\n\nSECTION 4 EMERGENCY RESPONSE    12\n\nSECTION 4.1 INTRODUCTION    12\n\nSECTION 4.2 RESPONSE PROCEDURE    12\n\nSECTION 4.3 LEAK DETECTION PROCEDURES    13\n\nSECTION 4.4 AGENCY COORDINATION    14\n\n     TABLE 4.1 EMERGENCY CONTACT NUMBERS    14\n\nSECTION 4.5 EMPLOYEE TRAINING    15\n\nSECTION 4.6 COMMUNITY TRAINING    15\n\nSECTION 5 PREVENTION PLAN    16\n\nSECTION 5.1 INTRODUCTION    16\n\nSECTION 5.2 SAFETY CONSIDERATION    16\n\nSECTION 5.3 CERTIFICATIONS    17\n\nSECTION 5.4 OPERATING PROCEDURES    18\n\n\n\nSECTION 6 AUDITS        19\n\nSECTION 6.1 REVIEW SCHEDULE    19\n\nSECTION 6.2 TRAINING PERSONNEL    19\n\nSECTION 6.3 REPORTING    19\n\nSHEETS\n\n1.  HAZARD ANALYSIS EPA \"WORST CASE\" AND ALTERNATE RELEASE SCENARIOS\n\n2.  STREET MAP WITH OFF-SITE CONSEQUENCE ANALYSIS\n\nATTACHMENTS\n\nA.  EPA RMPLAN SUBMITTAL FORM\n\nB.  TIER TWO REPORT\n\nC.  MSDS SHEETS\n\nD.  COORDINATION FLOW CHART\n\nE.  RELEASE CONFIRMATION FORM\n\n  F.  RMPlan IMPLEMENTATION PERSONNEL CHART\n\n  \n\n  TABLE OF CONTENTS\n\n  continued\n\n  \n\n  \n\n  \n\n  G. EMPLOYEE TRAINING CERTIFICATES\n\n  H. COORDINATION LETTERS\n\n  I.   HAZARD ANALYSIS CHECKLIST\n\n  J.  CHLORINE CYLINDER INSPECTION\n\n  K. AEMA FORM 20\n\n\n\n\n\nSection 1    Executive Summary \n\n\n\nThe Central Elmore Water Authority (hereinafter Central Elmore) has developed a Risk Management Plan (RMPlan) for a new water treatment facility in an effort to protect human health, to protect the environment and meet applicable federal regulations.  This facility will produce drinking water to all of Elmore County east of the Coosa River and west of Tallassee.  This includes the communities of Central, Rockford, Eclectic, Red Hill, Friendship, "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 45293,
      "SummaryText": "and Wetumpka. The facility is located at:\n\n\n\n       Central Elmore Water Authority\n\n       65 Lakepoint Road\n\n       Eclectic, AL  36024\n\n\n\nThis RMPlan has been developed to meet the standards published in the 40 Code of Federal Register (CFR) part 68.  In order to meet the accidental release prevention provision under the Clean Air Act ?112(r)(7), the Environmental Protection Agency (EPA), promulgated these regulations.  The provisions require facilities that exceed the cited threshold quantities for certain chemicals to develop a RMPlan.  The goal of a RMPlan is to focus on reducing the risk of accidental releases of certain chemicals; thereby, preventing harm to employees as well as potentially catastrophic impacts to the public.  Over 60 accidental releases of regulated chemicals at water treatment plants (WTP?s) and wastewater treatment facilities in the United States were reported between 1986 and 1995.1\n\n\n\nChlorine is currently stored and/or used in the water treatment process at these facilities and the quantities stored on site exceed the 2,500-pound threshold for coverage under the RMP Program.  Currently, chlorine is delivered to the facilities in 1-ton cylinders.  Typically, five, 2,000-pound cylinders are on-site.\n\n\n\nIn order to illustrate the areas that could be impacted from a release of the chemicals into the atmosphere, a hazard analysis was conducted to determine the offsite consequences.  Two analyses were performed in order to estimate the offsite consequences from two release scenarios.  The first release scenario is the case defined by the Environmental Protection Agency (EPA) as the ?worst case? scenario.  This scenario assumes that the largest vessel is full and it releases the entire contents of the containers during a ten-minute period.  The second scenario (or alternative scenario) is based on a situation more likely to occur which will cause a release of chemicals at the facility.  The radius of impact was determined based on the guidance"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 45293,
      "SummaryText": " provided in Chapter 4: ?Offsite Consequence Analysis? of the General Guidance for Risk Management Programs dated October 27, 1998 and the Compliance Guidance and Model Risk management Program for Water Treatment Plants.  The distance to the end point concentration was determined with the aide of the Computer Program Aerial Locations of Hazardous Atmospheres, version 5.2.1 (ALOHA).  The National Safety Council developed this program for emergency planners.  ALOHA works in conjunction with the Computer-Aided Management of Emergency Operations (CAMEO) database and Mapping Operation for Response, Planning and Local Operational Task (MARPLOT) program.\n\n\n\nIn all release scenarios, the toxic end point concentration remained the same.  The toxic end point for chlorine is three parts per million (ppm) or 0.0087 milligrams per liter (mg/l) which is the endpoint concentration published in the CFR Part 68.  The American Industrial Hygiene Association (AIHA) has listed these concentrations as the ?maximum airborne concentration?, at which nearly all individuals could be exposed to for up to one hour without experiencing or developing life threatening health effects.  This level is referred to as the Emergency Response Planning Guideline (ERPG-2) concentration.  \n\n\n\nResults of the hazard analyses for the EPA ?worst case? scenario led to an area defined by a 2.2-mile radius for chlorine.  This 2.2-mile radius encompasses 15.2 square miles.  The estimated population within this area is 100.  The alternative off-site consequence analysis yields significantly smaller areas.  A valve failure was assumed to occur for the alternate analysis.  The resulting area is described by a 0.3-mile radius circle around the plant.\n\n\n\nThe key to a successful risk management program is to first define hazard, risk and undertake a comprehensive approach to prevention.  The Center for Chemical Process Safety has defined hazard as:\n\n\n\nA chemical or physical condition that has the potential for causing "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 45293,
      "SummaryText": "damage to people, property or the environment2\n\n\n\nOnce hazards are identified on the site, then, an evaluation of the risk involved will lead to a systematic identification, evaluation, and control of potential losses that may arise in operation from future events such as fires, explosions, or toxic chemical releases.  The Water Treatment Plant will operate in accordance with the procedures outlined in the plant?s Operation and Maintenance Manual.  The manual sets forth inspections and maintenance requirements of the equipment.  Throughout this RMPlan, the emergency readiness procedures and regular training schedules are emphasized.  One of the goals of implementing these procedures and schedules is to minimize the chance of a release occurring.  If the plant employees practice preventative maintenance and are well trained in emergency procedures, if a release occurs, they will be successful in preventing and minimizing personnel injury.\n\n\n\nAll employees who perform work at the water treatment facilities are required to know the locations of the emergency telephone numbers and names of individuals to contact in case of a release.  If an emergency occurs, each employee will have an assigned task.  This risk management plan enhances the standard operating procedures because it provides a clear checklist that identifies predetermined individuals and agencies that require notification and coordination in case of an emergency.  This RMPlan details which individuals will respond to the release to contain it and it outlines the agencies that will be responsible for evacuating the appropriate areas, and for sounding the ?all clear? once the leak is contained.  The plan also includes procedures for the periodic review of readiness.\n\n\n\nNo releases have occurred at the facility.  One of the goals of this Risk Management Plan is to maintain a high level of safety at the plant.\n\n    \n\n       This plan includes the following sections:\n\n* Program requirements\n\n* Hazard Assessment\n\n* "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 45293,
      "SummaryText": "Emergency Response Plan\n\n* Prevention Plan\n\n* Audit Schedules\n\nMaterial Safety Data Sheets (MSDS), Tier 2 reports, employee training certificates and release confirmation and report forms will be maintained as part of this document.\n\n\n\n\n\nSection 2    Plan Requirements\n\nSection 2.1    Introduction\n\nFacilities that store certain chemicals in quantities that exceed a threshold quantity listed in 40 Code of Federal Register (CFR) Part 68, are required to develop and implement a Risk Management Plan (RMPlan).  Currently, the quantity of chlorine stored at the facility exceeds the published threshold amount.  Specific requirements, which must be addressed in each facility?s RMPlan, depend upon the program level in which it falls.  The program level determination of a facility depends on several factors, including off-site consequence and coverage under other regulations.\n\n\n\nSection 2.2    Program Level Determination\n\n\n\nCurrently, there are three program levels associated with the Risk Management Program.  A facility will be included in Program Level 1 if it exceeds one of the threshold quantities, but does not have off-site consequences as determined by a hazard assessment.  Program Level 2 covers those facilities that exceed a threshold quantity, has off-site consequences, but are not regulated by the Occupational Health & Safety Administrative (OSHA) or state equivalent.  Facilities that fall into Program Level 3 are subject to OSHA regulations or state equivalent, when they exceed a threshold quantity and have potential off-site consequence or the industry has one of the specified Standard Industrial Classification (SIC) codes published in the 40 CFR Part 68.  Currently, municipalities are not subject to federal OSHA regulations, and Alabama does not have a state OSHA equivalent.  The off-site consequence analysis (Reference Section 3) indicates that there could be off-site consequences if a chemical release of chlorine occurs at the water treatment plant; therefore, this facil"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 45293,
      "SummaryText": "ity is covered in Program Level 2.\n\n\n\nSection 2.3    General Requirements\n\n\n\nRegulations published in 40 CFR Part 65 outlines five specific requirements for program Level 2 facilities.  By June 21, 1999, each facility covered under the Risk Management Program rule must have completed and submitted to the EPA the facility registration for the Risk Management Plan.  The EPA has requested that all submittals be transmitted electronically in a format generated with their program, with appropriate figures or maps.  For reference, a copy of the form has been attached as Attachment A.  A facility in Program Level 2 must conduct and/or complete the following:\n\n\n\n    * Conduct a hazard analysis. \n\n      * Develop a prevention plan.\n\n    * Implement an emergency response plan.\n\n    * Report any chemical accidents in the past five years.\n\n    * Registrar facility with the EPA.\n\n\n\nSection 3    Hazard Assessment\n\n\n\n    Section 3.1    Toxicology/Physical Properties\n\n\n\nIt is imperative that employees are informed about the physical properties and potential health hazards of the chemicals located at the facility.  Mishandling of the chemicals can lead to severe injury or even death; therefore, it is vital that information regarding the substances is available to all employees.  In addition, chemical interaction information should be readily available to all employees as well, since some chemicals are incompatible with each other.\n\n\n\nChlorine is listed and regulated as an extremely hazardous chemical under Section 304 and can cause severe injury or death.  Chlorine is delivered to the water treatment facilities as a liquefied, compressed gas.  Chlorine gas is not explosive or flammable; however, it may support combustion.  It is a strong oxidizer and may react violently with substances such as water, ammonia, fuel oil, etc.  Chlorine gas is denser than air (density 2.49) and tends to settle in low areas.  It has a greenish-yellow color, and a strong pungent irritating odor with an odor thres"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 45293,
      "SummaryText": "hold of approximately 3.5 ppm.  At standard temperature and pressure 1 ppm chlorine is equal to 2.76 milligrams per cubic meter in air.\n\n\n\nThe primary health hazard from chlorine exposure is damage to the respiratory system.  It can also irritate the mucous membranes and targets the eyes, and skin.  In extreme cases, death by suffocation can result.  Frostbite may also occur if direct contact is made with liquefied chlorine.  The National Institute for Occupational Safety and Health (NOISH) lists 10-ppm chlorine in air as immediately dangerous to life or health (IDLH).  NIOSH recommends a ceiling value of 0.5 ppm chlorine in air while OSHA regulations list 1.0 ppm chlorine in air as the ceiling value.\n\n\n\nSection 3.2    Hazard Review\n\n\n\nThis hazard assessment included a review of the plants operating conditions.  This review included a review of operating conditions, site conditions, and human factors.  The review was completed in a checklist format and is included as Table 3.1.\n\n\n\n\n\nHazard Analysis Checklist\n\nCentral Elmore Water Authority\n\n65 Lakepoint Road\n\nRisk Management Plan\n\nDate:  02/22/03\n\n\n\nSiting\nYes/No/NA\nComments\n1. Do storage, use, and transfer areas have easy access for emergency response?\nYes\n\n2. Are storage, use, and transfer areas free of combustible or incompatible materials and isolated from hydrocarbons in accordance with NFPA Standard No. 49, Hazardous Chemicals Data?\nYes\n\n3. Are storage, use, and transfer areas isolated from sources of corrosion, fire, and explosion and protected from vehicle impact?\nYes\n\nGeneral Conditions, Operation and Maintenance\n\n\n4. Are work areas clean?\nYes\n\n5. Are adequate warning signs posted?\nYes\n\n6. Is lighting sufficient for all operations?\nYes\n\n7. Are the right tools provided and used?\nYes\n\n8. Is PPE provided and adequate?\nYes\nEscape respirator (SCBA)\n9. Are containers and tanks protected from vehicle traffic? \nYes\n\n10. Are containers, tanks, and feed line areas kept free of any objects that can fall on them (e.g., la"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 45293,
      "SummaryText": "chlorine leaks and spills depends on the effectiveness and competence of the employees on site who can assess a situation and act accordingly.  It is the responsibility of the supervisors to train their employees to use personal protective and other safety equipment properly.  It is also the responsibility of the supervisors to educate their employees properly handling chlorine and the dangers related to the mishandling of the chemical.  In addition, employees should participate in periodic drills to review the appropriate responses and know first aid procedures as well as who to call in case of an emergency.  These drills should include designating a person to check the chlorine monitors and wind direction indicators to determine if an evacuation is necessary, an evacuation plan, the proper safety equipment and the proper respiratory protection to wear as well as the procedure for obtaining further assistance.  The telephone numbers of the chlorine suppliers should be posted near each telephone.  \n\n\n\nIn addition, the number for the Chlorine Institute?s Emergency Plan (CHLOREP) through CHEMTREC in the United States is (800) 424-9300.  CHEMTREC is typically used to provide assistance to emergencies involving the transportation of chlorine; however, they can provide information and assistance to on-site emergencies, as well.  They will have a listing of the locations of all chlorine emergency kits available for your plant of the proper registration was done when the kits were delivered.\n\n\n\nIf a leak occurs, it may be necessary to contact local authorities to assist with evacuation.  In some instances, depending on whether there has been a ?reportable quantity? leaked, some governmental agencies must be contacted for chlorine emissions.  If an evacuation is necessary, then potentially exposed persons should move to a point upwind of the leak since chlorine is heavier than air.  If evacuation seems impractical, all air conditioners and air intake systems should be turne"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 45293,
      "SummaryText": "dders, shelves)?\nYes\n\n11. Are leak detectors with local and remote audible and visible alarms present operable, and tested (or is alternate means used to measure concentrations)?\nYes\n\n12. Are emergency repair kits available for each type of supply present (not required if you rely on off-site emergency response)?\nNo\n\n13. Are appropriate emergency supplies and equipment present, including PPE and SCBAs (not required if off-site response)?\nYes\n\n14. Are written operating procedures available to the operators?\nYes\n\n15. Are preventative maintenance, inspections, and testing performed as recommended by the manufacturer and industry groups and documented?\nYes\nNot Documented\nHuman Factors\n\n\n16. Have operators been trained on the written operating procedures and the use of PPE in normal operations and have you certified that they have the required knowledge, skills, and ability to do their duties safely?\nNo\nTraining is planned\n17. Do the operators follow the written operating procedures?\nYes\n\n18. Do the operators understand the applicable operating limits on temperature, pressure, flow and level?\nYes\n\n19. Are controls accessible and easily understood?\nYes\n\n20. Are labels adequate on instruments and controls?\nYes\n\n21. Are all major components, valves, and piping clearly and unambiguously labeled?\nYes\nPiping is color coded\n22. Are all components mentioned in the procedures adequately labeled?\nYes\n\n23. Have operators been trained on the correct response to alarms and conditions that exceed the operating limits of the system?\nYes\n\n24. Are operators provided enough information to diagnose alarms?\nYes\n\n25. Are contractors used at the facility?\nYes\n\n26. Are safe work practices such as lockout/tagout, hot work and line opening procedures followed?\nYes\nContractor responsible for training employees\n27. Are personnel trained in the emergency response plan and the use of emergency kits, PPE and SCBAs?\nYes\n\nHazard Recognition\nYes/No/NA\nComments\n28. Are MSDSs readily available to those op"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 45293,
      "SummaryText": "erating and maintaining the system?\nYes\n\n29. Do employees understand the toxicity, mobility, and ability of chlorine to sustain combustion?\nYes\nContractor responsible for training employees\n30. Do employees understand the consequences of confining liquid chlorine without a thermal expansion device?\nYes\nContractor responsible for training employees\n31. Do employees understand the effect of moisture on the corrosive potential of chlorine?\nYes\nContractor responsible for training employees\n32. Do employees understand the effects of fire and elevated temperature on the pressure of confined chlorine and the potential for release?\nYes\nContractor responsible for training employees\nContainer Shipment Unloading\n\n\n33. Is truck inspected for wheel chocks, proper position, and condition of crane?\nYes\nInspection sheet required\n34. Are adequate warning signs posted?\nYes\n\n35. Are containers inspected for leakage, general condition, currency of hydrostatic test, and valve protective housing before accepting shipment?\nYes\n\n36. Are containers places in the 6 o?clock / 12 o?clock position for storage to reduce chance of liquid leak through valve?\nYes\n\nBuildings housing Chlorine Systems\n\n\n37. Does the building conform with local building and fired codes?\nYes\n\n38. Is the building constructed of noncombustible materials?\nNo\n\n39. If flammable materials are stored or used in the same building, are they separated from the chlorine areas by a fire wall?\nNo\n\n40. Are two or more exits provided from each chlorine storage and process area and building?\nNo\n\n41. Is the ventilation system appropriately designed for indoor operations (and scrubbing, if required) by local codes in effect at the time of construction or major modification?\nYes\n\n42. Are the exhaust duct near floor level and the intake elevated?\nYes\n\n43. Can the exhaust fan be remotely started and stopped?\nYes\n\nPiping And Appurtenances\n\n\n44.  Do piping specifications meet Chlorine Institute Pamphlet 6 requirements for the service?\nYes\n\n45"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 45293,
      "SummaryText": ".  Do you require suppliers to provide documentation that all piping and appurtenances are certified ?for chlorine service? by the manufacturer?\nYes\n\n46. Are piping systems properly supported, adequately sloped to allow drainage, and with a minimum of low spots?\nYes\n\n47. Is all piping protected from all risks of excessive fire or heat?\nNo\n\n48. Is an appropriate liquid expansion device or vapor pressure relief provided on every line segment or device that can be isolated?\nYes\nVacuum type system\nVoluntary Practices and Design Stage Review Items (?No? answers do not require corrective action)\nYes/No/NA\nComments\n49. Have you avoided locating storage, use, and transfer areas up hill from adjacent operations?\nYes\n\n50. Are storage, use, and transfer areas located away from sewer openings and other underground structures?\n           Yes\n\n51. Are storage, use, and transfer areas downwind or separated from most operations and support areas and ventilation intakes based on prevailing wind direction?\nYes\n\n52. Are storage, use, and transfer areas located away from residences and facility boundaries?\nYes\n\n53. Is ambient working area temperature normally comfortable?\nYes\n\n54. Are windsocks provided in a visible location?\nYes\n\n55. Are equipment, containers, and railcars inspected daily?\nYes\n\n56. Is the system designed to operate at lowest practical temperatures and pressures?\nYes\n\n57. If chlorine demand is low enough, is the system designed to feed gaseous chlorine from the storage container, rather than liquid?\nYes\n\n58. Have the length of liquid chlorine lines been minimized (reduces quantity of chlorine in lines available for release)?\nYes\n\n59. Are low pressure alarms and automatic shut-off valve provided on chlorine feed lines?\nYes\nAutomatic shut-only\n60. Are vent-controlled spill collection sumps provided and floors sloped toward sumps for stationary tanks and railcars?\nNo\n\n61. Are vaporizers provided with automatic gas line shut-off valve, downstream pressure reducing valve, g"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 45293,
      "SummaryText": "as flow control valve, temperature control system and interlocks to shut down gas flow on low vaporizer temperature, and appropriate alarms in a continuously manned control room?\nN/A\n\n62. Do vaporizers have a limited heat input capacity?\nN/A\n\n63. Are curbs, sumps, and diking that minimize the surface of potential spills provided for stationary tanks and railcars?\nNo\n\n\n\n\n\nChecklist Completed By (Name):  Rick Ailiff\nSignature:\nDate Completed:  02/22/03\nCorrective Action Resolution Review By (Name):\nDate by Which All Corrective Actions Were Resolved:\n\n\n\n\n\n\n\n\n\n\n\n\nSection 3.3 ?Worst Case? Scenario\n\n\n\nThe EPA requires that for each chemical that exceeds the threshold quantity, a ?worst case? scenario should be performed to estimate the off-site consequence.  The EPA defines the ?worst case? scenario as follows:\n\n\n\n?The largest single vessel, container or pipe that contains the chemical \n\nof concern releases the entire contents as a gas when full during a ten \n\nminute time period.?\n\n    \n\nThe definition also assumes that during the release, atmospheric conditions are a class F stability, ambient air temperature is 77 degrees Fahrenheit (F), and wind speed is 1.5 meters per second, and the release occurs outside at ground level. \n\n\n\nThe worse case scenario would include a toxic gas release of 1090 pounds in a 10 minute period into rural surroundings.  The toxic endpoint would be .0087 mg/l:  basis ERPG-2.  The estimated distance to the toxic endpoint is 2.2 miles with a wind speed of 3.4 mph and an air temperature of 77 degrees F.  The offsite impact would affect approximately 100 people in the rural area.\n\n\n\nThe alternative release scenario would be for a toxic gas release of 52 pounds/minute in a release duration of 60 minutes.  The estimated distance to the toxic endpoint would be .3 miles.\n\n\n\nSection 4    Emergency Response\n\nSection 4.1    Introduction\n\nA coordinated effort is required to respond effectively, in the event that there is a release of chemicals from the site.  This"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 45293,
      "SummaryText": " plan identifies the parties and outlines response methods.  The response must be a joint effort between the water system, county sheriff department, fire department, and Hazard Material (Hazmat) team in order for it to be successful.  Once an alarm has been sounded, it is the water system?s responsibility to first confirm the release, and then to notify the proper response agency.  911 emergency service is available at the plant and will be used in case of a confirmed major release.  If a release is confirmed, it will be the on site superintendent's responsibility to sound the appropriate alarm.\n\n\n\n   Section 4.2    Response Procedure\n\n\n\nIt is critical to have a response procedure documented and rehearsed so that in case of an emergency, proper procedures are carefully followed.  During normal business hours, an on-site individual will be assigned as the supervisor that is responsible for implementing the plan.  The supervisor shall have thoroughly reviewed this emergency plan, and have detailed knowledge of the chemical hazards and their physical properties of the chemicals used at this facility.  He must also be capable of and have the authority to make the decision to either respond to the leak or evacuate the facility.  The on-site supervisor shall be responsible for contacting and notifying the required agency.  A flow chart has been prepared and is attached.  The chart illustrates the procedures to be followed once a release is suspected, and who shall be contacted.  The on-site supervisor shall complete a Release Confirmation Form and furnish information such as an estimated time of release, the quantity released, and location of the release to emergency personnel responding to the release. All employees at the water plant shall be informed of the emergency procedures, their responsibilities, and be furnished a copy of the Release Response Flow Chart.  Maps illustrating the potential impact area will be displayed on site in a location accessible and visible to "
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 45293,
      "SummaryText": "all employees and the public.\n\n\n\nOnce a release is suspected, the site supervisor shall be notified immediately.  After the supervisor has been notified, he shall have an individual designated who will be responsible for notifying all of the on-site personnel of the suspected release.  All other personnel, except for the confirmation team, shall prepare for immediate evacuation and move uphill and away from the suspected release.  The on-site supervisor shall designate a second person that shall accompany the supervisor during the release confirmation.  The team shall be equipped with a radio that is in contact with a third person who should be positioned in a safe location.  The third person will be responsible for immediately notifying all parties in the event that the confirmation team becomes incapacitated.\n\n\n\n\n\n\n\n\n\n Section 4.3    Leak Detection Procedures\n\n         In case of a minor leak the following procedures should be followed:\n\n \n\n1. Use 26? Baune ammonia water and hold it near suspected points. White fumes will indicate the exact location\n\n2. Keep your head higher than the leak and take a position that allows wind to blow gas away from you.\n\n3. If leak is in equipment, close valves on chlorine container. If the leak in the container cannot be stopped, try to move the container to a safe, open area.\n\n4. If chlorine is escaping as a liquid, rotate the container so that the leak is in the uppermost portion. Chlorine thus escapes as a gas not a liquid. Liquid chlorine vaporized in the air, and the amount if gas produced is about 15 time greater than from a gas leak through an opening of the same size.\n\n5. Never put water on a chlorine leak. The water will increase the rate of corrosion and make the leak larger.\n\n6. Water may warm the chlorine and cause the chlorine to escape faster.\n\n7. If the operating system cannot use the chlorine fast enough, the chlorine should be passed into an alkaline solution, which will absorb it. Such a solution can be made using caustic "
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 45293,
      "SummaryText": "soda or soda ash.\n\n8. Leaks around valve stems can often be stopped by closing the valve or packing gland nut.\n\n9. Leaks at valve discharge outlet can often be stopped by replacing gasket or adapter connection.\n\n10. Leaks on fusible plugs, tank valve base threads, tank car seat gaskets, safety valves and dome cover plates usually require special handling and emergency equipment.\n\n11. Pinhole leaks in containers should be stopped by driving a hardwood peg or metal drift pin into the hole; the container should then be emptied as soon as possible.\n\n12. In an emergency situation, do not hesitate to contact your chlorine manufacturer, re-packer, or local supplier.\n\n13. Overfilled containers should be returned to manufacturers, or excess chlorine consumed immediately.\n\n\n\nIn case of a major release, the procedures outlined in Section 4.2 should be followed.\n\n\n\n\n\n\n\n Section 4.4    Agency Coordination\n\nIf a release occurs at the water treatment facility, it is critical that all agencies are fully informed of the associated risk of the chemicals stored at the facility.  Letters, maps and a copy of the Tier 2 report have been submitted to the Elmore County Sheriff Department, Elmore County EMA and the Holtville/Slapout Volunteer Fire Department.  The following is a list of the agencies, telephone numbers, and contact names:\n\n\n\n\n\nTable 4.1\n\nEMERGENCY CONTACT NUMBERS\n\nFIVE STAR WATER SUPPLY DISTRICT\n\nWATER TREATMENT FACILITIES\n\nEMERGENCY RESPONSE PLAN\n\n\n\nFACILITY\nPHONE NUMBER\nCONTACT PERSON\nElmore County Sheriff Department\n(334) 567-5546\nSheriff Bill Franklin\nElmore County EMA\n(334) 567-6541\nCindy Mann\nEclectic Fire Department\n(334) 541-2148\nDavid Ingram\nAlabama Marine Police\n1-800-432-7389\nLarry Kelly\nAlabama Power Company\n(334) 567-6169\nHarlem Baker\n\n\n\n\nAt a minimum, an annual meeting should be conducted on site by the Eclectic Fire Department. This meeting can be scheduled with an annual fire inspection. During the inspection the types of chemical used, their dangers and the eme"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 45293,
      "SummaryText": "rgency response plan can be reviewed.  In addition to the fire department each of the other agencies should be encourage to tour the plant as frequently as they feel is necessary to keep up to date and refreshed on the emergency response plan and layout of the facility.\n\n\n\n\n\nSection 4.5    Employee Training\n\n\n\nCentral Elmore will maintain an emergency chlorine kit.  At a minimum, the supervisor and designated assistant shall be properly trained in the use of chlorine, dangers, and the proper use of the repair kit.  All personnel involved in the chlorination process shall be trained in the use and dangers of chlorine.  Employee training should be conducted as recommended by the Chlorine Institute.  Copies of training certificates should be maintained as part of this document.  All personnel involved with the process should review this manual.  In general, the training requirements are as follows:\n\n\n\n1. Instruction detailing physical, chemical and toxicological properties of the chemical.\n\n2. Instruction and drills using emergency equipment.\n\n3. Instruction and drills using the emergency repair kits.\n\n4. Instruction and drills implementing the emergency response plan, and administering first aid.\n\n5. Instruction detailing reporting of releases.\n\n\n\nSection 4.6    Community Awareness\n\n\n\nA vital part of implementing an effective emergency response plan is to have community awareness and involvement.  An informed public will make an evacuation successful.  Once the RMPlan is submitted to the EPA, the information about the quantities of hazardous chemicals used at this facility and their location will be available to the public via the Internet.  In addition, it is recommended that public service notices be placed in the local paper or other media outlets.  These notices should include information concerning how the public will be notified, the evacuation route they should take, and where further information will be disseminated.\n\n\n\nSection 5    Prevention Program\n\n\n\nSection 5.1    In"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 45293,
      "SummaryText": "troduction\n\nIn the prevention program, elements such as general safety information, a hazard review, operating procedures and compliance audits are included. This prevention plan includes two categories.  The first category is prevention through maintenance and the second is prevention of injury through training.  Employees should be educated by attending routine safety meetings sponsored by the Plant, attend mandatory safety education classes, and working together to make their surroundings a reminder of proper safety procedures.  Hanging visual reminders such as posters, maintaining a safety suggestion box can be effective methods of prevention awareness.  In addition, assigning personnel to different duties or tasks in case of an emergency, and designating personnel to be responsible for safety equipment maintenance are all vital to a successful prevention program.\n\n       \n\n    The following are names and numbers that each employee should be aware of in case of \n\n    an emergency and these numbers should be posted at each telephone location:\n\n       \n\n       \n\nEMERGENCY TELEPHONE NUMBERS\nFire Station\n911\n Ambulance Service of Wetumpka\n(334) 567-4311\nWetumpka Medical Center\n(334) 514-1910\nElmore Community Hospital\n(334) 567-4311\nElmore County Sheriff Department\n(334) 567-5546\nChlorine Supplier\n\n(Harcross Chemical, Inc.)\n(334) 457-5316\n(Industrial Chemical, Inc.)\n(334) 476-2042\n(Jones Chemical, Inc.)\n(800) 595-2436\nAlabama Power Company \n(334) 567-6169\nAEMA\n1-800-843-0699\n       \n\nSection 5.2    Safety Information\n\n\n\nPreparedness for an emergency dealing with a chlorine leak or spill is essential since chlorine accumulation magnifies rapidly in the atmosphere and once a leak is identified, immediate action must be taken.  Whenever possible, no person should work alone on a chlorine leak.  An emergency plan of action should be implemented and include training or personnel who could become involved in a chlorine related emergency.\n\n\n\nEffective emergency response in handling "
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 45293,
      "SummaryText": "d off; and individuals should retreat to the highest point of the building on the side away from the release.  When a person is outdoors, and they do not have respiratory protection, they should cover their mouth and nose with a wet handkerchief or cloth to reduce the effects of the exposure.\n\n\n\nPersonal protection equipment should be available outside of chlorine rooms, near each use point, away from areas likely subject to contamination.  Respiratory equipment should be selected based on evaluation of hazards and the degree of potential exposure.  Canister gas masks (25 ppm, maximum) or chemical cartridge respirators (up to 10 ppm) would offer adequate protection where the oxygen content in the air is greater than 19.5%.  If there is no monitoring equipment available to sample the air in the area of the leak, then a self-contained breathing apparatus (SCBA) with a full-face piece is recommended.\n\n\n\nSection 5.3    Certifications\n\n\n\nEach employee at the water treatment facilities should be required to attend an instructional class detailing this RMPlan.  At the completion of the class, each employee will be assigned a responsibility to perform as part of the emergency response plan. This training should be updated annually, and the training records should be maintained as part of this document.\n\n\n\n. \n\n\n\n\n\nSection 5.4    Cylinder Changing Procedures\n\n\n\n1. Using a cylinder wrench, turn ton container valve clockwise to close.  Be certain valve is closed before removing regulator/ton adapter combination.\n\n\n\n2. With water supply to ejector (vacuum to regulator), ensure that rotameter ball drops to zero indicating no residual gas flow through regulator.\n\n\n\n3. If no gas flow exists, remove regulator/ton adapter assembly by loosening ton adapter yoke handle and lifting assembly from ton container valve.  Turn off water supply to ejector.\n\n\n\n4. Replace empty ton container with a full one.  Remove projective hood and MAKE SURE THE CONTAINER VALVES ARE ALIGNED VERTICALLY.  Remove th"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 45293,
      "SummaryText": "e upper (gas) valve cap and ensure the valve outlet is clean and free of dirt and residue.\n\n\n\n5. REMOVE OLD LEAD GASKET FROM TON ADAPTER INLET AND DISCARD.  Replace with new lead gasket.  NEVER re-use lead gasket.\n\n\n\n6. Position regulator/ton adapter assembly on gas (upper) valve ensuring lead gasket is in place.  Tighten ton adapter yoke handle until secure and lead gasket is slightly compressed.\n\n\n\n7. Open cylinder valves slightly and quickly re-close.\n\n\n\n8. Test for gas leaks using accepted procedures, on the ton adapter inlet and the regulator inlet, if regulator has been replaced.\n\n\n\n9. If leak is detected, re-check that ton container valve is closed and remove regulator/inlet adapter assembly.  Repair leak before proceeding.\n\n\n\n10. After ensuring no leaks exist and with regulator/inlet adapter assembly properly installed, open ton container valve approximately ? turn.  Cylinder wrench should always remain on container valve when in use.\n\n\n\n11. Turn on ejector water supply and set proper feed rate on regulator.\n\n\n\nSection 6    Audits\n\n\n\nSection 6.1    Review Schedule\n\n\n\nThis plan should be reviewed at a minimum of once a year. If a release occurs at the facility, an investigation should be conducted immediately in order to determine the reason for the release so steps can be taken to prevent future incidents. In case of a release the plan should be reviewed to determine if additional procedures should be added to prevent future incidents. The RMPlan submittal to the EPA should be updated immediately following any inventory change.  If any other chemical is added to the system, a review should be conducted to determine if it is subject to the RMPlan regulations.  The EPA also requires that the plan be updated at a minimum of every five years.\n\n\n\nSection 6.2    Training Personnel\n\n\n\nAs part of the preventive maintenance and safety program, an annual refresher-training course should be conducted.  The training should include a refresher of the RMPlan, which includes the sa"
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 45293,
      "SummaryText": "fety program, prevention program, and emergency response.  As part of the safety program, a review of chemical hazards, use and maintenance of the safety equipment, and use of the emergency repair kits should be completed. The person conducting the training should be familiar with the use and hazards of chlorine, up to date on OSHA regulations, and knowledgeable of personal protective equipment. \n\n\n\nSection 6.3    Reporting\n\n\n\nThe reporting threshold for a chlorine release is 10 pounds under EPCRA. Any release above the threshold quantities should be reported on the Alabama Emergency Management Agency (AEMA) Form 20.  (Form 20 is attached).\n\n\n\nIf a release occurs, the emergency reporting number is 1-800-843-0699.\n\n\n\n1 EPA Accidental Release Information Program (ARIP) database\n\n2 Center for Chemical Process Safety, 1989.  Guidelines for Chemical Process Quantitative Risk Analysis.  New York: AICHE.\n\nRisk Management Plan                  Central Elmore Water Supply District___Feb 2003\n\n_\n\n\n\n2\n\n\n\n\n\n\n\n\n\n\n\nRisk Management Plan            Central Elmore Water Supply District____Feb 2003_\n\n\n\n\n\n2\n\n\n\n\n\n18\n\n\n\n\n\n\n\n"
    }
  ]
}