{
  "FacilityID": 45368,
  "FacilityName": "Vandenberg AFB",
  "FacilityStr1": "1515 Iceland Avenue, Room 181C",
  "FacilityStr2": null,
  "FacilityCity": "Vandenberg AFB",
  "FacilityState": "CA",
  "FacilityZipCode": "93437",
  "Facility4DigitZipExt": "5319",
  "FacilityCountyFIPS": "06083",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.724680",
  "FacilityLongDecDegs": "-120.548220",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G3",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "Danilo.Narciso@vandenberg.af.mil",
  "FacilityDUNS": null,
  "ParentCompanyName": "n/a (military installation)",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "30th Space Wing",
  "OperatorStr1": "1515 Iceland Avenue, Room 181C",
  "OperatorStr2": null,
  "OperatorCity": "Vandenberg AFB",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93437",
  "OperatorZipCodeExt": "5319",
  "FTE": 5700,
  "OtherEPAFacilityID": "934375DDSF747NE",
  "EPAFacilityID": "100000064431",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-10-11 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2006-04-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-04-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2006-04-06 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-04-06 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.6",
  "FRS_Lat": 34.73249,
  "FRS_Long": -120.57044,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "0.3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R08",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 65603,
      "AltID": "HSF (Fuel)",
      "FacilityID": 45368,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 86907,
          "ProcessID": 65603,
          "ChemicalID": 2,
          "Quantity": 450000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 86908,
          "ProcessID": 65603,
          "ChemicalID": 38,
          "Quantity": 480000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 67164,
          "ProcessID": 65603,
          "NAICSCode": "54171",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 38449,
              "Process_NAICS_ID": 67164,
              "SafetyReviewDate": "2003-03-01 00:00:00",
              "PHA_Date": "2005-12-16 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2006-06-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Material incompatibility",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Gas-liquid separators",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Leak Monitoring (IAS)",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Leak Monitoring (IAS)",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2006-01-13 00:00:00",
              "TrainingReviewDate": "2006-01-13 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Disaster Control Exercise",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Computer Based Competency",
              "MaintenanceReviewDate": "2003-03-01 00:00:00",
              "EquipmentInspectionDate": "2004-01-08 00:00:00",
              "EquipmentTested": "Scrubber systems",
              "ChangeMgmtDate": "2001-11-14 00:00:00",
              "ChangeMgmtReviewDate": "2003-03-01 00:00:00",
              "PreStartupReviewDate": "1996-09-30 00:00:00",
              "ComplianceAuditDate": "2002-05-01 00:00:00",
              "AuditCompletionDate": "2002-05-01 00:00:00",
              "IncidentInvestigationDate": "1998-09-30 00:00:00",
              "InvestigationChangeDate": "1998-09-30 00:00:00",
              "ParticipationPlansReviewDate": "2003-03-01 00:00:00",
              "HotWorkPermitReviewDate": "2003-03-01 00:00:00",
              "ContractorSafetyReviewDate": "2006-01-13 00:00:00",
              "ContractorSafetyEvalDate": "2006-01-13 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 55974,
                  "PreventionProgram3ID": 38449,
                  "ProcessChemicalID": 86907
                },
                {
                  "PrimaryKey": 55975,
                  "PreventionProgram3ID": 38449,
                  "ProcessChemicalID": 86908
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 45368,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2005-08-01 00:00:00",
    "ERTrainingDate": "2005-12-05 00:00:00",
    "CoordinatingAgencyName": "Vandenberg AFB Fire Department",
    "CoordinatingAgencyPhone": "8056063111",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "AFI 10-2501 Full Spectrum Threat Response Planning and Operations"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 45368,
      "SummaryText": "Vandenberg Air Force Base (AFB) is the third largest Air Force installation in the nation encompassing over 99,100 acres in Santa Barbara County, California.  Its unique geography provides America with its primary means to launch polar orbiting satellites without over flying populated areas.  This mission¿which is crucial to national security as well as the burgeoning interest in communications, land resources surveillance, and space research¿is dependent on the continued launching of an array of space boosters.  Additionally, the Air Force conducts operational testing of Minuteman and Peacekeeper intercontinental ballistic missiles (ICBMs) at Vandenberg AFB; these ICBMs are launched into broad ocean area targets or toward instrumented target sites on the Marshall Islands.  Vandenberg AFB also manages the Western Range¿a vast network of radar, telemetry, and optical sensors stretching across the Pacific Ocean¿in which all three services conduct a variety of aeronautical and missile flight activities.\nWhile Vandenberg AFB comprises some 2,000 buildings and 2,000 residences for military personnel, only 15 percent of its total area is developed.  The remainder provides the buffer needed to preclude encroachment by local development and to protect outlying communities from launch anomalies and associated operational hazards.  Restrictive easements affecting development on adjacent private land further limit potential risk to the public.  Significantly, over the last 45 years, more than 1,800 launches of space boosters and ICBMs have been conducted at Vandenberg AFB, and there is no known instance of serious injury or death to anyone in the surrounding communities as a result of a chemical release due to the launches themselves or to supporting operations.\nWith this submittal, Vandenberg AFB is making a conscientious effort to fully comply with Section 112r of the Clean Air Act Amendments of 1990, as implemented by the Code of Federal Regulations, Title 40, Part 68 (40 C"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 45368,
      "SummaryText": ".\nEmergency Response Program\nVandenberg AFB possesses significant emergency response capabilities that include its own Fire Department, Disaster Control Group, and Security Police Force, in addition to contracted support for handling accidental releases of regulated hypergolic propellants and other hazardous substances.\nThe overall base emergency response program is managed by the Readiness Flight (30 CES/CEX) in accordance with Air Force Instruction (AFI) 10-2501, Full Spectrum Threat Response (FSTR) Planning and Operations.  In particular, the Readiness Flight is responsible for developing and updating 30 SW FSTR Plan 10-2, ¿Vandenberg Full Spectrum Threat Response Plan.¿  In coordination with the Readiness Flight, the Environmental Flight, 30 CES/CEV, also develops and updates Vandenberg¿s 30 SW Plan 32-4002-A, ¿Hazardous Materials Emergency Response Plan,¿ which conforms to the National Response Team¿s Integrated Contingency Plan format.\nThe Vandenberg AFB Fire Department, 30 CES/CEF, is the local agency that responds as First Responder at the Technician Level to an accidental release of hazardous materials on the base.  This Fire Department comprises over 100 firefighters who staff five fire stations strategically positioned across the base.  One fire station is located within a three-minute response time of the Hypergolic Storage Facility.  This Fire Department is also seasonally augmented by a 20-person Hot-Shot crew that is specially trained to respond to wildland fires.\nThe Vandenberg AFB Fire Department is fully compliant with National Fire Protection Agency standards and has mutual aid agreements with Santa Barbara County, the City of Lompoc, the City of Santa Maria, the California Forestry Department, and the Los Padres National Forest.  Per the Santa Barbara County Integrated Hazardous Materials Management System (IHMMS) Operation Agreement, the base Fire Department approves and maintains the Business Response Plans and hazardous material inventor"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 45368,
      "SummaryText": "FR 68), as well as with the California Code of Regulations (CCR), Title 19, Division 2, Chapter 4.5, California Accidental Release Prevention (CalARP) Program.  The format developed by the Environmental Protection Agency (EPA) for this submittal is generally oriented toward accommodating commercial or government operated stationary sources that differ significantly from Vandenberg AFB in terms of physical size, complexity, emergency response capability, and organizational make-up.  Accordingly, additional detail and clarification are incorporated in this Executive Summary to provide the public clearer, more complete insight into the scope and effectiveness of Vandenberg AFB's accidental release prevention and emergency response policies.\nScope of the Vandenberg AFB Risk Management Plan\nThis Risk Management Plan (RMP) includes all covered process within the borders of Vandenberg AFB that are subject to Department of the Air Force oversight and control.  Under the Commercial Space Act, excess facilities on the base may be leased by private entities to conduct commercial activities that are not under the purview of the Department of the Air Force.  Compliance with EPA RMP and CalARP requirements for covered processes that solely support such commercial activities is the responsibility of the respective commercial owner and operator; such covered processes are not included in this RMP.\nThis RMP includes one process in which the EPA threshold of a regulated toxic or flammable substance is exceeded¿the Hypergolic Storage Facility.  This facility stores and handles the regulated toxics Dimethylhydrazine (UDMH) and Hydrazine in an approximately one-to-one mixture of the two typically referred to as Aerozine 50.  In addition, the Hypergolic Storage Facility is used to store significant quantities of the toxic Nitrogen Tetroxide, which is included in this Risk Management Plan in accordance with the General Duty Clause: Section 112(r)(1) of the Clean Air Act Amendments of 1990"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 45368,
      "SummaryText": "ies¿as prescribed by the California Health and Safety Code, Chapter 6.95¿that are developed by organizations assigned to or doing business on the base.  This information can be retrieved electronically in the event of an emergency.  Additionally, the base Fire Department conducts onsite facility inspections, as required, to identify potentially hazardous conditions that could lead to an accidental release.  It should be noted that the Vandenberg AFB Fire Department is advised of all operations involving the transfer of hypergolic propellants, which comprise the regulated substances at the Hypergolic Storage Facility.  During launch operations, Fire Department response elements are pre-positioned to expedite response in the event of an anomaly.\nVandenberg AFB also contracts for a Hypergolic Emergency Response Team (HERT) that can respond within 60 minutes of notification with scapesuit-qualified technicians; this emergency response team is capable of handling the hypergolic propellants described in this submittal.  It should be noted that scapesuit-qualified technicians are pre-positioned on location for hypergolic propellant transfer operations.\nThe Vandenberg AFB Command Post is staffed 24 hours a day, every day of the year, and provides a central point of contact in the event of an emergency on the base.  Its extensive suite of communications equipment includes hotlines to both the Santa Barbara County Emergency Services and the Lompoc Fire Dispatch Control Center.\nThe Disaster Control Group (DCG) comprises experienced, senior personnel who represent a cross-section of technical, logistical, medical, and communications expertise.  The DCG is headed by the On-Scene Commander who is responsible for managing onsite response to any major emergency on the base including an accidental release of hazardous materials.  The DCG conducts exercises in accordance with the 30 SW FSTR Plan 10-2, ¿Vandenberg Full Spectrum Threat Response Plan,¿ and 30 SW Plan 32-4002-A, ¿Hazardo"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 45368,
      "SummaryText": "ase of a hazardous material as of the date of this RMP submittal.\nGeneral Duty Clause: Section 112(r)(1) of the Clean Air Act Amendments of 1990¿the General Duty Clause¿makes it incumbent on owners and operators of stationary sources to identify hazards and to implement accidental release prevention measures relative to any other extremely hazardous substance that may not be included in the EPA list of regulated substances.  Accordingly, Vandenberg AFB identifies Nitrogen Tetroxide as a highly toxic substance that is stored on the installation in quantities that could pose a risk to the general public.  Nitrogen Tetroxide is used primarily as the oxidizer component of the hypergolic propellants employed by various space boosters launched from Vandenberg AFB; it is also occasionally used in smaller quantities as a propellant for satellites launched from Vandenberg AFB and in the PSRE of certain ICBMs tested at the base.\nAll aspects of Vandenberg AFB's RMP and CalARP programs¿to include OSHA Process Safety Management (PSM) standards and emergency response program planning and training¿encompass Nitrogen Tetroxide storage and operations to the same extent that they apply to the regulated hydrazines as described in this submittal.  It should be noted that a review of the base's five-year accident history reveals that there have been no reportable accidents involving base employees, contractors, and/or anyone in the general public as a result of exposure to a release of Nitrogen Tetroxide.  Vandenberg AFB fully intends to maintain every aspect of its current accidental release prevention program as it applies to Nitrogen Tetroxide as long as substantive quantities of this substance are stored or used at the base."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 45368,
      "SummaryText": "us Materials Emergency Response Plan.¿  This plan requires at least two exercises annually that involve a simulated release of hazardous materials.  These exercises are periodically coordinated with the Santa Barbara County Fire Protection Services Division and may include participation by emergency response elements from the nearby communities.\nManagement System\nThe management system that is in place at Vandenberg AFB to oversee the implementation of the risk management program elements is detailed in 30 SW Plan 32-7086, ¿Hazardous Materials Management Plan.¿  Specifically, the Hazardous Materials Risk Management Team, which is chaired by the Deputy Base Civil Engineer, convenes quarterly with fire, safety, environmental, readiness, bioenvironmental, legal, and other key agency representatives to review the status of the hazardous material management program and to oversee the development, implementation, and integration of the risk management program elements.\nAdditional Information\nNumber of Full Time Employees:  The number of full-time, on-base employees at Vandenberg AFB varies daily, but generally comprises 3,600 military personnel, 2,100 Civil Service personnel, and 3,100 contractor personnel, bringing the total number of full-time employees to approximately 8,800.\nDate of Most Recent Emergency Response Training for Facility Employees:  It should be noted that some aspect of emergency response training for facility employees and newcomers is conducted on a regular basis at Vandenberg AFB.  Specific emergency response training for the different categories of base employees¿to include firefighters, Disaster Control Group members, work-site employees, security police, newcomers, and first responders¿overlaps considerably, culminating in periodic base-wide exercises.  The date provided in this submittal for the most recent emergency response training for facility employees is the date of the most recent base wide exercise involving the simulated accidental rele"
    }
  ]
}