{
  "FacilityID": 45377,
  "FacilityName": "MEMC PASADENA, INCORPORATED",
  "FacilityStr1": "3000 N. SOUTH STREET",
  "FacilityStr2": null,
  "FacilityCity": "PASADENA",
  "FacilityState": "TX",
  "FacilityZipCode": "77503",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Southeast Regional LEPC",
  "FacilityLatDecDegs": "29.743000",
  "FacilityLongDecDegs": "-095.171200",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "WWW.MEMC.COM",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 826458978,
  "ParentCompanyName": "MEMC ELECTRONIC MATERIALS INCORPORATED",
  "Company2Name": null,
  "CompanyDUNS": 361834617,
  "Company2DUNS": 0,
  "OperatorName": "MEMC PASADENA, INCORPORATED",
  "OperatorStr1": "P.O. Box 2012",
  "OperatorStr2": null,
  "OperatorCity": "PASADENA",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77501",
  "OperatorZipCodeExt": "2012",
  "RMPContact": "JOHN T. WALTER",
  "RMPTitle": "ES&H MANAGER",
  "FTE": 145,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000097824",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-01412",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-04-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-04-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-04-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-12-15 00:00:00",
  "DeRegistrationEffectiveDate": "2016-12-15 00:00:00",
  "AnniversaryDate": "2011-04-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 29.74625,
  "FRS_Long": -95.17389,
  "FRS_Description": "SE CORNER OF LAND PARCEL",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 65612,
      "AltID": "POLYSILICON FACILITY",
      "FacilityID": 45377,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 67173,
          "ProcessID": 65612,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 86918,
          "ProcessID": 65612,
          "ChemicalID": 152,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 152,
            "ChemicalName": "Silane",
            "CASNumber": "7803-62-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 586918,
          "ProcessID": 65612,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 45377,
      "SummaryText": "Executive Summary - MEMC PASADENA, INCORPORATED\n\nAccidental Release and Emergency Response Policies\n\nWe are committed to operating the plant and maintaining all of our processes in a safe and responsible manner.  We use a combination of prevention and emergency response programs to help ensure the safety of our employees, our industrial neighbors, and the community to which we belong, and to ensure the protection of the environment as well.  This document provides a brief overview of the ongoing risk management activities that we have designed and implemented, including:\n? A description of our facility and the way we use materials regulated by EPA's RMP regulation\n? A summary of our assessment of potential offsite consequences should a release occur\n? An overview of our release prevention programs\n? A five-year accident history for releases of RMP regulated materials\n? An overview of our emergency response program\n\nFacility and Regulated Substances\n\nThe facility is the world's only supplier of ultra-high purity granular polysilicon.  This material is used in the manufacture of silicon wafers for the semiconductor industry.  The facility also produces ultra-high purity silane gas, which is sold to the semiconductor industry as well as being used as the raw material for the manufacture of granular polysilicon.  \n\nThe only RMP regulated substance at the facility is the silane gas.   Silane is a flammable gas. \n\nThe largest storage vessel of silane is underground, and can contain a maximum of 75,000 pounds of the substance as a refrigerated liquid.   The gas is packaged for sale, or used in closed systems to produce granular polysilicon.  Silane is normally shipped as a gas, in cylinders or tube trailers.\n\nWe have no RMP regulated toxic materials.\n\nWorst Case and Alternative Release Scenarios\n\nThe RMP rule requires that we provide information about the worst-case release scenario and alternative release scenario for our facility.   The following are brief summaries of t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 45377,
      "SummaryText": "hese scenarios.\n\nThe worst case scenario was modeled using the OCA Guidance provided by the EPA.  Our scenario involves the release of all 75,000 pounds of the largest storage vessel of silane, the liquid contents flashing to gas, and the gas igniting, within ten minutes.  Although this scenario is highly unlikely due to the underground storage of silane, we modeled it according to EPA guidance.  We assumed no mitigating circumstances or operational controls to minimize the release per EPA guidance.   Our modeling suggests there would be little environmental impact and no impact or damage to the community.    The product of combustion for silane is silicon dioxide (sand) so there would be no toxic smoke from combustion.\n\nThe alternative release scenario we selected involves a tube trailer used for transporting bulk quantities of silane to our customers.  This is a more realistic scenario because this is the only time this material is handled outside of closed processing systems at the facility.  The release quantity for this scenario is 6,000 pounds, or the complete contents of one bulk-shipping container.  Based on the release model, there would be minimal environmental impact and no damage to the community.\n\nGeneral Release Prevention Program \n\nWe take a systematic, proactive approach to preventing accidental releases of hazardous materials.  Our management systems address each of the key features of successful prevention programs including:\n\n? Process Safety Information\n? Process Hazard Analysis\n? Operating Procedures\n? Training\n? Preventative Maintenance and Mechanical Integrity\n? Management of Change\n? Pre-startup Reviews\n? Compliance Audits\n? Incident Investigation\n? Employee Participation\n? Permit to Work Systems including Hot Work Permits\n? Inspection Programs\n? Critical Instrument Checks\n? Contractor Qualification and Safety Programs\n\n \nAs part of our prevention efforts, we have implemented the following chemical-specific prevention factors:\n\n? Silane is st"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 45377,
      "SummaryText": "ored as a refrigerated liquid in underground tanks to reduce the possibility of tank damage and chemical release.\n? All process systems are computer controlled and monitored by highly-trained Chemical Operators.\n? All process systems have automated redundant emergency shutdown modes and alarms.\n? All changes to the process systems must be reviewed and approved by specialists in engineering, process technology, operations, maintenance, and environmental, safety and health.\n? All process systems are included in comprehensive, documented preventative maintenance, inspection, and mechanical integrity programs.\n? All employees must successfully complete comprehensive training programs to be qualified to work with our sophisticated processes and equipment.\n? All processes and vessels are connected to flare systems through pressure relief devices so that process upsets, should they occur, do not cause material to discharge directly to the atmosphere.\n\nFive-Year Accident History\n\nWe keep records for all significant incidents that occur at our facility.  For each incident we conduct formal investigations and identify and correct root causes of the events.\n\nSince construction in 1986, the plant has had no reportable accidents associated with the release of silane gas.\n\n\n\n\nEmergency Response Program\n\nWe maintain an integrated contingency plan, which consolidates the various federal, state, and local regulatory requirements for emergency response planning.  Our program is coordinated with our industrial neighbors, the City of Pasadena, and the South East Regional LEPC.  It provides the essential planning and training for effectively protecting our workers, the public, and the environment during emergency situations, and for notifying the public in the unlikely case of an incident.  \n\nOur emergency response team undergoes continuous training and must maintain adequate skill levels to remain certified as emergency responders.  In addition, we conduct frequent drills, internally a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 45377,
      "SummaryText": "nd with our neighbors, to ensure our plan is adequate and our people prepared for incidents that may arise.\n\nPlanned Changes to Improve Safety\n\nThe following is a list of improvements that we have implemented, or are implementing at the facility to prevent and/or better respond to accidental chemical releases:\n\n? Upgraded training for operations and maintenance personnel to state-of-the-art computer based training\n? Improved ESH management systems, and became ISO14001 certified.\n? Continual process hazard analysis to identify potential problems and implement changes\n? Upgrading instrumentation \n? Formal Product Stewardship program for silane."
    }
  ]
}