{
  "FacilityID": 45579,
  "FacilityName": "American Carbon Technologies, Inc.",
  "FacilityStr1": "564 Ecology Lane",
  "FacilityStr2": null,
  "FacilityCity": "Chester",
  "FacilityState": "SC",
  "FacilityZipCode": "29706",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45023",
  "LEPC": "Chester County LEPC",
  "FacilityLatDecDegs": "34.708540",
  "FacilityLongDecDegs": "-081.137490",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "American Carbon Technologies, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "American Carbon Technologies, Inc.",
  "OperatorStr1": "564 Ecology Lane",
  "OperatorStr2": null,
  "OperatorCity": "Chester",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29706",
  "OperatorZipCodeExt": null,
  "RMPContact": "A.P. Wierzbowski",
  "RMPTitle": "Plant Manager",
  "FTE": 20,
  "OtherEPAFacilityID": "110019982777",
  "EPAFacilityID": "100000195335",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-03-23 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-05-03 00:00:00",
  "ErrorReportDate": "2006-05-03 00:00:00",
  "ReceiptDate": "2006-05-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-05-01 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2012-12-06 00:00:00",
  "DeRegistrationEffectiveDate": "2012-12-05 00:00:00",
  "AnniversaryDate": "2011-05-01 00:00:00",
  "CBIFlag": 1,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Regulated substance was removed from site while plant operations are suspended",
  "_processes": [
    {
      "ProcessID": 65956,
      "AltID": null,
      "FacilityID": 45579,
      "ProgramLevel": 1,
      "CBI_Flag": 1,
      "_naics": [
        {
          "Process_NAICS_ID": 67522,
          "ProcessID": 65956,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 87316,
          "ProcessID": 65956,
          "ChemicalID": 78,
          "Quantity": 266500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 78,
            "ChemicalName": "CBI Acids",
            "CASNumber": "00-00-00",
            "Threshold": 0.0,
            "ChemType": "T",
            "flgCBI": 1,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 587316,
          "ProcessID": 65956,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 45579,
      "SummaryText": "\nRISK MANAGEMENT PLAN PURSUANT TO 40 CFR 68(G) for\nAmerican Carbon Technologies, Chester, South Carolina \n\nEXECUTIVE SUMMARY\n\nApril 2006\n\nNote: Per provisions of 40 CFR 68.151, information on details of the regulated process are excluded because they are claimed as confidential business information/trade secret (CBI).  A complete hard copy of the Risk Management Plan has been submitted to U.S. EPA.  \n\nAmerican Carbon Technologies (ACT) operates an industrial facility in Chester, SC for the production of a specialized type of carbon.  A portion of the ACT facility is subject to U.S. Environmental Protection Agency (U.S. EPA) regulations governing Accidental Release Prevention Requirements: Risk Management Programs (RMP) under Section 112(r) of the Clean Air Act (40 CFR Part 68).  This Risk Management Plan has been developed in accordance with the requirements specified under 40 CFR Part 68, Subpart G.\n   \nThe Risk Management Plan is comprised of an Executive Summary and Data Elements and has been submitted to U.S. EPA on a CD using RMP*Submit2004TM software.  The Executive Summary of the Risk Management Plan discusses and provides the applicable corporate policies and risk management systems.  The Data Elements provide specific details of the facility's Risk Management Program and include evaluation of a worst-case release scenario that, along with other requirements, establishes that the facility is regulated under RMP Program 1. \n\n\n    1.0   ACCIDENTAL PREVENTION AND EMERGENCY RESPONSE POLICY\n1.1       American Carbon Technologies Policy on the Environment, Accident Prevention and Emergency Response\n\nACT is committed to protecting the health of its employees, the surrounding community, and the environment.  ACT is committed to full compliance and adherence with all applicable laws and regulations regarding environmental protection, accident prevention and emergency response. To advance this policy, we\n\n* Strive to achieve continuous improvement of our environmental perfo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 45579,
      "SummaryText": "rmance;\n\n* Periodically review compliance and adherence with environmental requirements and identify opportunities to improve environmental and safety practices;\n \n* Anticipate and respond to community concerns about the actual and perceived impact of our operations on safety and the environment;\n\n* Design, build, and maintain facilities to ensure that they are operated in an environmentally sound and safe manner;\n  \n* Establish and maintain policies and procedures that reconfirm health, safety and safe operation;\n \n* Coordinate our safety and emergency response program with local community emergency response officials to facilitate safe, effective, and swift response to emergencies in the workplace; and\n  \n* Communicate environmental and safety policies to all employees and on-site contractors.\n\n1.2 Management System\n\nACT has developed a management system to implement and maintain compliance with the Risk Management Program.  This management system identifies lines of responsibility for the entire program and each of its key elements.  The Plant Manager has primary responsibility for developing and implementing the RMP.  The Plant Manager and the Electrical Engineer alternate on-call responsibilities (2 weeks on, 2 weeks off), with the Logistics Manager providing backup for these individuals if they are out of town.  The Shift Leader on duty is the primary Emergency Coordinator in the event of any spill or release, with immediate notification of the above-listed on-call personnel required.  Plant Operators are required to inspect storage and operating areas at least once per shift.  In addition, Operators log the material levels in each bulk storage tank twice per shift.\n\n2.0   PROCESS AND SUBSTANCE SUBJECT TO 40 CFR PART 68\n\n2.1 Description of the Regulated Process\n \nACT operates an industrial facility for the production of a specialized type of carbon.  The process takes place in an oven wherein a specific polymer raw material is mixed with a combination of subst"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 45579,
      "SummaryText": "ances (CBI), one of which is regulated under 40 CFR Part 68, and then thermally processed to form the carbon product.  The off-gas from the oven is treated by an afterburner and a scrubber.  The facility design also includes a backup scrubber to treat off-gas in the event that either the afterburner or primary scrubber fails.  The primary scrubber produces a weak sulfuric acid (H2SO4) as a by-product.  This acid is concentrated before shipment off-site for sale.\n\nA toxic substance (CBI) regulated under RMP is used in the process.  The regulated substance (CBI) is transported to the site via tank truck and is stored in an above-ground 14,000 gallon capacity tank.  Shipping and transfer of regulated substance (CBI)is carried out by trained qualified personnel provided by the vendor, using standard operating procedures that have been thoroughly reviewed for safety.  The portions of the carbon manufacturing process regulated under RMP (i.e., where the regulated substance (CBI) is present in concentrations exceeding 1% by weight) include the storage tank, pipe running to the process and the reactor vessel.  The storage tank is surrounded by a concrete dike which provides passive mitigation and the unloading area is designed to capture any spills that may occur. \n\n2.2 RMP Program Requirements\n\nThe U.S. EPA Risk Management Regulation identifies three levels of requirements for industrial processes.  Program 1 applies to the ACT manufacturing facility.  Program 1 applies when a process has the following attributes:\n\n1. There has been no release in the past 5 years associated with the regulated substance (CBI) that has led to offsite death, injury or emergency response/restoration.\n\nBecause the ACT facility is new and this risk management plan is required prior to the ACT facility storing more than the regulated quantity, there have been no releases of the regulated substance with off-site effects in the past 5 years.   \n\n2. The distance to toxic endpoint for a worst-case re"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 45579,
      "SummaryText": "lease is less than the distance to any public receptor.\n\nAs discussed in Section 3, the worst-case release will not affect public receptors as defined in the RMP regulation.\n\n3. Emergency response procedures have been coordinated with local emergency planning and response organizations.\n\nAs discussed in Section 5, ACT has contacted local emergency responders regarding the Chester facility.\n\nThe requirements under RMP Program 1 as specified in ? 68.12 are the following:\n\n1. Analyze the worst-case release scenario and document that the nearest public receptor is beyond the distance to a toxic or flammable endpoint;\n\n2. Complete the five-year accident history for the process which demonstrates that no off-site receptors have been affected;\n\n3. Ensure that response actions have been coordinated with local emergency planning and response agencies;\n\n4. Submit a single Risk Management Plan, including registration information and data elements documenting the worst-case release scenario and accident history; and\n \n5. Send letter with the Risk Management Plan signed by the responsible party representing ACT certifying that Program 1 requirements are met. \n    \n3.0  WORST-CASE RELEASE SCENARIO \n\nAs defined by 40 CFR Part 68, a worst-case release of a liquid is an instantaneous spill of the entire contents of the storage tank accounting for passive mitigation such as dikes and sumps.  The regulation specifies that the spill is assumed to occur when there are light winds (1.5 m/sec wind speed), stable atmospheric conditions (stability F) and a high temperature (highest daily temperature over past 3 years).  Modeling has demonstrated that under these conditions the maximum toxic endpoint distance does not reach off-site public or environmental receptors.  In accordance with revised Risk Management Plan requirements promulgated on April 9, 2004 and in deference to the chemical site security concerns of the U.S. Department of Homeland Security, this executive summary does not incl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 45579,
      "SummaryText": "ude further description of the worst-case release scenario. Specific information regarding the off-site hazards assessment for worst-case and alternative releases is included in the RMP data elements.\n\n4.0   FIVE-YEAR ACCIDENT HISTORY\n\nAs a new regulated process, there has been no accident that qualifies for reporting under the risk management program.  This means that there has been no accident resulting in the sudden release of the regulated substance (CBI) at the ACT facility that has caused on-site or off-site injury, significant on-site damage or any off-site emergency response or injury.  Standard ACT management practice requires immediate internal reporting of unusual events, including those in which any abnormal emission of regulated chemicals is observed or suspected.  The incident information is reviewed by supervisory staff and a determination is made as to whether a reportable quantity on any chemical listed as requiring reports to regulatory authorities is involved.  If so, the appropriate authorities are promptly notified.\n\n\n5.0   EMERGENCY RESPONSE PROGRAM\n\nIt is the policy of the ACT to place the highest priority on employee safety and health and on protection of the community from all plant-induced environmental conditions.  Experience has shown that proper planning and an organized approach will reduce the effects of emergency events.  Prompt internal and external communications, emergency equipment, and trained personnel are the key ingredients of this plan.  ACT policy provides for external communications with local and county-wide response agencies.  The Chester Fire Department, which has the lead responsibility in responding to major releases or fires at the facility, is aware of the regulated substance (CBI) and other potentially hazardous substances present at the facility."
    }
  ]
}