{
  "FacilityID": 45605,
  "FacilityName": "Stillwater Water Treatment Plant",
  "FacilityStr1": "1022 W. Yost Lake Road",
  "FacilityStr2": null,
  "FacilityCity": "Stillwater",
  "FacilityState": "OK",
  "FacilityZipCode": "74075",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40119",
  "LEPC": "Payne County LEPC",
  "FacilityLatDecDegs": "36.204722",
  "FacilityLongDecDegs": "-097.074167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.stillwater.org",
  "FacilityEmailAddress": "staylor@stillwater.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Stillwater",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Stillwater Water Treatment Plant",
  "OperatorStr1": "PO Box 1449",
  "OperatorStr2": null,
  "OperatorCity": "Stillwater",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74074",
  "OperatorZipCodeExt": null,
  "RMPContact": "Scott Taylor",
  "RMPTitle": "Water Treatment Superintendent",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000102685",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-02-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-03-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-05-08 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-05-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-05-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 36.20194,
  "FRS_Long": -97.07139,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 65991,
      "AltID": "Chlorine",
      "FacilityID": 45605,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 67558,
          "ProcessID": 65991,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 87356,
          "ProcessID": 65991,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 587356,
          "ProcessID": 65991,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 45605,
      "SummaryText": "Our Facility and Regulated Substances\n\nThe Stillwater Water Treatment Plant is a municipally owned 18 million gallon water treatment facility which produces a clean and bacteriologically safe potable water meeting federal and state requirements. One of the chemicals used in the disinfection process is Chlorine.  \n\nThe water treatment plant purchases chlorine in one (1) ton steel cylinders and are kept in an enclosed building with a ventilation system that is connected to a Chlorine Scrubber System.  This Scrubber system is automatically engaged when chlorine gas is detected in the room.  The maximum quantity stored at the water treatment facility is 12,000 pounds.\n\nRelease Prevention and Emergency Response Policies and Chemical specific Prevention Steps\n\nThe Stillwater Water Treatment Plant is dedicated to the safety of their employees and to the citizens living in the area.  The water plant utilizes employee training, written policies, maintenance procedures, technology, and emergency backup systems to achieve a safe working environment and to limit the potential of a chlorine gas release to the atmosphere. \n \nTraining:  \nAll new employees work with an experienced plant operator to achieve on the job training.\n\nAnnually, all employees, must receive 4 hours renewal training as per Oklahoma Department of Environmental Quality rules and regulations for license recertification.\n\nAll Stillwater employees attend quarterly safety training under PEOSH regulations.\nAll water plant employees attend monthly safety meetings.\n\nChlorine System Policy\n\nTwo operators will always be present when working on chlorine cylinders or in the chlorine room.\n\nThe exhaust fan will be turned on before operator enters the chlorine building.\n\nOne of the two operators will remain outside of the chlorine room and observe the other operator while he is in the room.\n\nWhen changing leads from one cylinder to another cylinder, a new lead washer will always be used.\n\nOperators will immediately notify "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 45605,
      "SummaryText": "the Supervisor of any changes, in or around the chlorine building.\n\nOnly authorized employees are allowed in the chlorine building.\nIn the case of a chlorine release, evacuate the area, then call the Fire Department and call your supervisor.\n\nMaintenance Procedures\n\n Daily:\nCheck all flexible connectors for damage or deterioration, if any is evident, replace immediately.\n\nInspect all isolated valves and replace if any deterioration is evident.\n\nInspect chlorine booster pumps.\n\nVisually inspect all piping, both gas and water, for any signs of damage.\n\nCheck both chlorinator and chlorine storage rooms to assure they are clean and orderly.\n\nWeekly:\n    Inspect all vents and fans to insure they are operating correctly.\n\n    Inspect lighting for proper operation.\n    \nCheck SCBA tanks for proper pressure.  Check facemasks and air hoses for nicks or cracks.\n\nMonthly:\nHoist system\nCheck hoist and travel limit device.  If any problem is found correct it immediately.\n\nInspect cables and lifting bar.  If excessive wear or damage is found, replace immediately.\n\nInspect trolley wheels, fasteners, track wheel stud nuts and suspension bolts.\n\nCheck cables and leads for broken wires, loose or corroded terminals, and damaged insulation.\n\nCheck wheels for bearing wear, as indicated by excessive looseness of wheel on stud.  Also check track for wear.\n\nAnnualy the entire hoist system is inspected and certifed by Gaffy Crane.\n\n    \nChlorine Scales\n    Inspect for wear each time chlorine cylinders are replaced.\n\n    Re-set tare weights to 4000 lbs. after replacing new cylinders.\n\n    Check for frayed wire insulation and loose connections.\n\nChlorine Detectors (Tank storage room and chlorinator feeder room)\nCheck chlorine detectors control module for proper operation\nMix a week solution of sodium hypochlorite in squeeze bottle.  Place next to gas sensor and puff vapor toward sensor.  Check chlorine alarm system for; local alarm notification, SCADA alarm notification and auto start of chlorine gas scrubber sys"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 45605,
      "SummaryText": "tem.\n\nCheck Chlorine Scrubber System to ensure unit pump and blower are running normal.  Check to ensure that all louvers in the Chlorine storage room activate.\n\nReset Scrubber System and return to automatic controls.\n\nReport any abnormalities immediately to Plant Supervisor and/or Plant Superintendent.\n\nAnnually\nThoroughly inspect flexible connectors(whips) and replace any discolored or damaged connectors.\n\nThoroughly inspect manifold isolation valves and replace any discolored or damaged valves.\n\nReplace exhaust fans drive belt and lubricate motor\n\nRebuild chlorine ejectors as per manufacturers instructions\n\nRegulators with flow indicator should be inspected and rebuilt as per manufacturers recommendations.\n\nRotometers should be disassembled and cleaned on an annual basis and replace all O-rings.\n\nChlorinators should be disassembled and inspected annually and the Loss of\nVacuum/High Vacuum Switch needs to be rebuilt as per manufactures recommendations.\n\nTechnology\nComputers:  SCADA system for operations and monitoring the water treatment plant.\n\nChlorine Gas Scrubber System:  The City of Stillwater water treatment plant installed a scrubber system to the chlorine storage facility.  This unit is fully automatic and will energize when chlorine gas is detected.  This unit is capable of treating up to 4,700 lbs of chlorine with a maximum outlet concentration of 5 mg/L.\n\nSecurity:  The City of Stillwater water treatment plant keeps all plant building doors locked and have installed alarms on all exterior doors.  Security cameras have been installed throughout the plant for added perimeter security.  These cameras are monitored by the water plant staff and can be monitored by the Stillwater Emergency Coordination and Communications Center.\n\nEmergency Backup Systems\n\nThe City of Stillwater installed a 2,000,000 watt diesel backup generator at the treatment facility.  This unit is fully automatic and will energize 15 seconds after a loss of power.  This unit is maintained"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 45605,
      "SummaryText": " and monitored by Stillwater Power.\n\nThe water treatment facility has a trailer mounted 180KVA generator that is used to power individual buildings/chemical systems and remote pumping stations.\n\nAll major systems and/or components have redundant backup motors, chemical feeders, electrical feeds, etc., and can be operated by the computer SCADA system, local operator interface stations and can be manually energized at the unit.\n\nFive Year Accident History\n\nThe Stillwater Water Treatment Facility did not have any accidental release of chlorine in the past five years\n\nEmergency Response Program\n\nThe staff at the water treatment plant are not first responders.  All chemical release emergencies will be handled by the Stillwater Fire Department (hazmat).  Chemical releases and other emergency procedures are outlined in the Operations Handbook.\n\nPlanned Changes to Improve Safety\n\nThe Stillwater Water Treatment plant is currently requiring all chemical suppliers to conduct annual chemical safety meetings for all of water plant employees. \n"
    }
  ]
}