{
  "FacilityID": 4575,
  "FacilityName": "City Of Cocoa Beach Water Reclamation Facility",
  "FacilityStr1": "1600 Minuteman Causeway",
  "FacilityStr2": null,
  "FacilityCity": "Cocoa Beach",
  "FacilityState": "FL",
  "FacilityZipCode": "32931",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12009",
  "LEPC": "District 6 LEPC",
  "FacilityLatDecDegs": "28.318056",
  "FacilityLongDecDegs": "-80.616667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "www.ci.cocoa-beach.fl.us/government/water.html",
  "FacilityEmailAddress": "dblanchard@ci.cocoa-beach.fl.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Cocoa Beach",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City Of Cocoa Beach",
  "OperatorStr1": "1600 Minuteman Causeway",
  "OperatorStr2": null,
  "OperatorCity": "Cocoa Beach",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32931",
  "OperatorZipCodeExt": null,
  "RMPContact": "Darby Blanchard",
  "RMPTitle": "Utilities System Administrator",
  "FTE": 28,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000056208",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-11-06 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2003-03-14 00:00:00",
  "DeRegistrationEffectiveDate": "2003-01-01 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 28.31825,
  "FRS_Long": -80.63294,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5324,
      "AltID": "Chlorination",
      "FacilityID": 4575,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5437,
          "ProcessID": 5324,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5709,
          "ProcessID": 5324,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505709,
          "ProcessID": 5324,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4575,
      "SummaryText": "The City of Cocoa Beach Water Reclamation Facility has utilized chlorine gas for chlorination (disinfection) of the facility's effluent from the treatment of wastewater for over thirty years.  Throughout this time, the Facility has had no documented large scale accidental releases of chlorine.  As part of this Risk Management Program the Facility has re-reviewed and formally established a complete program which includes the assessment of hazards, a thorough prevention program and an emergency response program.\n\nThe Facility is a municipal wastewater treatment facility.  As stated above, the chlorine is used to disinfect the Facility's effluent as required by the Florida Department of Environmental Protection.  Eight one ton cylinders containing gaseous chlorine liquified under pressure is the maximum quantity that is maintained on-site.  The cylinders are delivered to the site and unloaded by the Facility's chemical vendor on an as needed basis.  The cylinders are connected/disconnected by the Facility's trained operators.\n\nThe worst case release scenario involves the release of all the contents of one full cylinder.  Using the EPA mandated factors, the distance to the toxic endpoint is 1.3 miles.  The alternate case release scenario involves the rupture of the one inch diameter pipe manifold connected to two cylinders upstream of the vacuum regulator and automatic switchover valve.  Using the EPA standard factors, the distance to the toxic endpoint is 0.1 miles.  Other release scenarios involving lesser released quantities and shorter distances to toxic endpoint were also evaluated.  The worst case scenario was agreed to be a 'highly unlikely' event while the alternate scenarios are more likely and were discussed more in regards to emergency response.  Also the EPA mandated and standard meterologic condition factors used in the analyses are not 'average' conditions at the Facility.   The coastal weather conditions at the Facility are usually less calm than that lis"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4575,
      "SummaryText": "ted by EPA and would result in quicker dispersion of the chlorine during a release.   \n\nThe Facility has had no accidentental releases of chlorine within the past five years which resulted in injuries or impacts as defined by EPA.\n\nThe Facility has in place a prevention program which covers all aspects of the Facility's operations on and around the chlorination process system.  Written procedures are followed by trained staff on all activities.  The entire system is inspected at least one time each shift during the 24 hour per day, 365 days per year operation and manning of the Facility.  Any concerns are addressed promptly by the operations staff and the maintenance staff which is on 24 hour per day standby.  The Facility's prevention program coincides with the City-wide Safety Program.  The Safety Program and this Risk Management Program have been approved and adopted by the City Commission.\n\nImmediate and limited emergency response would be completed by the facility's staff upon a release.  A release would most likely be witnessed during a cylinder delivery or changeout.  Automatic detectors and alarms are also in place.  Staff would complete minor activities such as closing valves and reorientating the cylinder in order to lessen the release.  If the release continues, 9-1-1 would be called and the facility  evacuated.  Brevard County Fire and Rescue would then respond and notify other effected parties including law enforcement, school board and emergency management.  Brevard County maintains a trained and equipped team for hazardous material releases.  All municipalities in Brevard County rely on this team for response to these types of events.  The team would then complete all activities as needed which may include repair of cylinder, evacuation, spill cleanup, environment tests, etc.\n\nThe Facility is currently evaluating other disinfection methods to possibly lessen the amount of chlorine which is required to be stored and utilized.  Funds are currently progr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4575,
      "SummaryText": "ammed in the City's Capital Improvement Program for these upgrades/changeouts to another method.  Florida Department of Environmental Protection requires that the Facility maintain a certain residual amount of chlorine in the Facility's effluent which is supplied as reclaimed water for irrigation purposes.  Therefore the need for chlorine will not be completely removed."
    }
  ]
}