{
  "FacilityID": 45826,
  "FacilityName": "Nalco Sugar Land Plant",
  "FacilityStr1": "7701 Highway 90-A",
  "FacilityStr2": null,
  "FacilityCity": "Sugar Land",
  "FacilityState": "TX",
  "FacilityZipCode": "77478",
  "Facility4DigitZipExt": "0087",
  "FacilityCountyFIPS": "48157",
  "LEPC": "Fort Bend LEPC",
  "FacilityLatDecDegs": "29.619167",
  "FacilityLongDecDegs": "-095.637500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "SE",
  "FacilityURL": "www.nalco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 868159013,
  "ParentCompanyName": "Nalco Company",
  "Company2Name": null,
  "CompanyDUNS": 4962403,
  "Company2DUNS": 0,
  "OperatorName": "Nalco Company",
  "OperatorStr1": "P.O. Box 87",
  "OperatorStr2": null,
  "OperatorCity": "Sugar Land",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77487",
  "OperatorZipCodeExt": "0087",
  "RMPContact": "John S. Wantuch",
  "RMPTitle": "Plant Manager",
  "FTE": 185,
  "OtherEPAFacilityID": "TXD008084618",
  "EPAFacilityID": "100000135481",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-01538",
  "SafetyInspectionDate": "2003-08-15 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-06-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-06-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-06-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-06-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 29.61905,
  "FRS_Long": -95.64186,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 66342,
      "AltID": "Vinyl Acetate Mono M-223",
      "FacilityID": 45826,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 67926,
          "ProcessID": 66342,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 87922,
          "ProcessID": 66342,
          "ChemicalID": 29,
          "Quantity": 45000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 587922,
          "ProcessID": 66342,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 66343,
      "AltID": "Epichlorohydrin S-704",
      "FacilityID": 45826,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 67927,
          "ProcessID": 66343,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 87923,
          "ProcessID": 66343,
          "ChemicalID": 21,
          "Quantity": 146300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 21,
            "ChemicalName": "Epichlorohydrin  [Oxirane, (chloromethyl)-]",
            "CASNumber": "106-89-8",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 587923,
          "ProcessID": 66343,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 66344,
      "AltID": "Ethylenediamine S-859",
      "FacilityID": 45826,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 67928,
          "ProcessID": 66344,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 87924,
          "ProcessID": 66344,
          "ChemicalID": 26,
          "Quantity": 91400.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 26,
            "ChemicalName": "Ethylenediamine  [1,2-Ethanediamine]",
            "CASNumber": "107-15-3",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 587924,
          "ProcessID": 66344,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 66345,
      "AltID": "Cyclohexylamine S-786",
      "FacilityID": 45826,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 67929,
          "ProcessID": 66345,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 87925,
          "ProcessID": 66345,
          "ChemicalID": 31,
          "Quantity": 66900.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 31,
            "ChemicalName": "Cyclohexylamine  [Cyclohexanamine]",
            "CASNumber": "108-91-8",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 587925,
          "ProcessID": 66345,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 66346,
      "AltID": "Trimethylamine S-697",
      "FacilityID": 45826,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 67930,
          "ProcessID": 66346,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 87926,
          "ProcessID": 66346,
          "ChemicalID": 113,
          "Quantity": 142900.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 113,
            "ChemicalName": "Trimethylamine [Methanamine, N,N-dimethyl-]",
            "CASNumber": "75-50-3",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 587926,
          "ProcessID": 66346,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 45826,
      "SummaryText": "1.0      Introduction\nAt the Nalco Company, Sugar Land Plant, we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented for the handling and use of substances regulated by the EPA RMP rule, including the following:\n\n?     A description of our facility and use of substances regulated by the EPA RMP rule,\n?     Our accidental release prevention and emergency response policies,\n?     A synopsis of our off-site consequence analysis reporting,\n?     Our general accidental release prevention program and specific release prevention steps for the RMP regulated substances,\n?     A five-year history of accidents associated with the RMP regulated substances, and \n?     Our emergency response program.\n\n2.0      Stationary Sources and Regulated Substances\nThe Sugar Land Plant produces numerous chemical products using a variety of raw materials and processing operations.  From these different raw materials and operations, the plant annually produces more than 100 million pounds of specialty chemicals for our customers.  Approximately 185 employees work year round at our facility to meet the needs of oilfield producers, refiners, and chemical plants.  In our processes, we use the following chemicals that the EPA has regulated as either toxic or flammable substances under the RMP rule, in quantities in excess of the applicable threshold amount:\n\n?     Toxics\n   o     Vinyl Acetate\n   o     Epichlorohydrin\n   o     Ethylenediamine\n   o     Cyclohexylamine\n?     Flammables\n   o     Trimethylamine\n\nOur accidental release prevention programs and our contingency planning efforts help us to effectively manage the pote"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 45826,
      "SummaryText": "ntial hazards that are posed to our employees, the public, and the environment.\n\n3.0      Offsite Consequence Analysis Reporting\nThe EPA RMP rule requires that we provide information to the EPA and emergency responders about the worst-case and the alternative release scenarios for the RMP regulated chemicals at our facility.    It is worth noting that the RMP definition of a potential worst-case scenario results in an event that is far beyond any reasonable expectation.  The alternative release scenarios represent more credible events; however, they are not as likely to occur with our mitigation measures implemented.  Nalco?s RMP does include both worst-case and alternative case scenarios for the toxic and flammable chemicals. \n\n4.0      General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\nWe maintain a number or programs to help prevent accidental releases of regulated chemicals and to ensure safe operations.\n\nThe accident prevention programs in place include the following:\n?     Process Safety Information: We have a program in place to ensure that information is available regarding the hazards of the regulated chemicals, the processes that handle these chemicals, and the equipment in the process.  This information is used to identify and understand hazards posed by these chemicals and processes.\n?     Process Hazard Analysis: Under our procedure from process hazard analysis, we perform detailed hazard analyses to identify hazards, to assess the likelihood of those hazards (including accidental releases), and to evaluate the consequences of these hazards.  Analyses are performs on both new and existing processes.  Hazard analyses for regulated chemical storage include a review of material unloading, storage, and transfer operations.\n?     Operating Procedures: We have developed written procedures for the operation of all our processes.  These procedures provide clear instructions for safely conducting activities involved with each covered process. "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 45826,
      "SummaryText": " These procedures are reviewed and certified at least annually.  We also have written procedures for safe work practices to provide for the control of hazards during operations, such as lockout/tagout, confined space entry, opening of process piping (line-opening), and control over the entrance into the plant by support personnel.\n?     Training: Every employee involved in operating a covered process is trained in the written operating procedures.  The training includes specific safety and health hazards, emergency operating procedures, and safe work practices.  Refresher training is provided at least every three years.\n?     Mechanical Integrity: We have an extensive mechanical integrity programs with written procedures to help ensure that our process equipment is inspected and maintained.  Employees with mechanical integrity responsibilities are trained to ensure that they can perform their job tasks safely.\n?     Management of Change: We have a written management of change program to ensure that changes to a covered process are adequately reviewed before they are implemented.\n?     Pre-Startup Safety Review: Similar to management of change, we have written procedure for the review of new or significantly modifies equipment, before that equipment is started up.  The review is conducted to confirm that the equipment is properly designed and installed and that the associated procedures are in place and are adequate.\n?     Incident Investigation:  When an incident or near-miss occurs, we have a written procedure for reporting incidents and investigating them appropriately.  The purpose of these investigations is to determine the cause of the incident or near-miss and to identify corrective actions, which can help prevent a recurrence of that event.\n?     Hot Work Permit: We have a written procedure and permit for hot work, conducted on or near a covered process, operations.  The procedure and permit are intended to ensure that the hot work is adequately reviewed prior to starting and "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 45826,
      "SummaryText": "is monitored during the operation.  \n?     Contractors: We have written procedures and policies regarding our use of contractors in and around covered processes.  These procedures are used to confirm that contractor employees have been adequately trained, have safe work practices, and have been informed of the potential hazards.\n?     Employee Participation: We encourage all our employees to actively participate in the development and use of our accidental release prevention programs.\n?     Compliance Audits: We have a program in place to evaluate compliance with the RMP rule every three years to verify that the procedures and practices are adequate and are being followed.\n\nAs part of our prevention efforts, we have implemented the following chemical-specific steps:\n\n?     Control emissions from production operations that handle RMP chemicals.\n?     Vapor return for unloading of RMP chemicals to storage tanks.\n\nThese individual elements of our prevention program work together to help prevent accidental chemical releases.\n\nIn addition to accidental release prevention, we have also implemented the following release mitigation steps:\n\n?     Dikes around chemical storage tanks,\n?     Foam/Water sprinkler systems throughout the production buildings,\n?     Foam systems in flammable product and raw material warehouses\n?     Emergency communication and alarm system,\n?     Firewater monitors and fire hydrants,\n?     Fire extinguishers,\n?     Dedicated firewater system with diesel engine backup,\n?     Over a million gallons of firewater stored on-site,\n?     Monitoring of on-site regulated chemical inventories,\n?     On-site emergency response team,\n?     Reduction in the surface area of diked areas around regulated chemicals,\n?     Continuous emissions monitoring from the thermal oxidizers, and \n?     Containment area for the unloading of tank trucks of epichlorohydrin and cyclohexylamine.\n\n5.0      Five-Year Accident History\nWe maintain records for all significant accidental chemical releases that occur at our facility.  During t"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 45826,
      "SummaryText": "he past five years, our facility has not experienced any accidental releases of EPA RMP regulated materials that caused significant on-site impacts (i.e., death, injury, or significant property damage) or off-site impacts (i.e., death, injury, evacuation, sheltering-in-place, property damage, or environmental damage).\n\n6.0      Emergency Response Program\nWe maintain an integrated contingency plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning.  Our program provides the essential planning and training for more effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, we coordinate our plan with the community emergency response plan.\n\nWe have an on-site emergency response team.  Team members are trained and properly equipped to respond to a variety of emergency situations, including fires and chemical releases.  We also coordinate emergency response with the local police/fire departments, Local Emergency Planning Commissions (LEPC), and other county emergency responders.  Our emergency response training includes drills, which are conducted annually with all the emergency responders.\n\n7.0      Planned Changes to Improve Safety\nWe have many upcoming events and projects planned for 2006 and 2007.  Nalco Company at Sugar Land will set into motion multiple projects to improve safety at the facility.  Some of the projects were suggestions or hazards recognized by employees, such as a major project to either repair or rebuild multiple roads within the facility to reduce the hazards associated with forklift traffic.   \n\nOther projects include improving fall protection at our 2nd Street truck loading area and railcar loading area.  Nalco is also looking at ways to reduce the summer heat in Bldg. 35, as well as ways to improve our forklift inspection program.  Within the production areas a project to recondition or relocate safety showers/eye washes is planned.  "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 45826,
      "SummaryText": "Within industrial hygiene, improvements are being made in how exposures are identified through a Job Exposure Profile program.  Along with the industrial hygiene program a major upgrade for the Job Safety Analysis program is scheduled.  Our training coordinator has made major improvements in our Computer Based Training program, for the first time in 2006 most of our annual training is delivered through CBT.  Upgrades to the respiratory center and central supply are also scheduled to improve Personal Protective Equipment availability and maintenance. \n\nTwo major events in the near future will include a Voluntary Protection Programs (VPP) recertification audit and RC14000 certification audit."
    }
  ]
}