{
  "FacilityID": 45985,
  "FacilityName": "Brenntag Great Lakes, LLC - Ft. Wayne",
  "FacilityStr1": "2529 Ferguson Road",
  "FacilityStr2": null,
  "FacilityCity": "Ft Wayne",
  "FacilityState": "IN",
  "FacilityZipCode": "46809",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18003",
  "LEPC": "Allen County LEPC",
  "FacilityLatDecDegs": "41.046667",
  "FacilityLongDecDegs": "-085.120000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": "kbagin@brenntag.com",
  "FacilityDUNS": 41167107,
  "ParentCompanyName": "BRENNTAG NORTH AMERICA INC.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Brenntag Great Lakes, LLC",
  "OperatorStr1": "2529 Ferguson Road",
  "OperatorStr2": null,
  "OperatorCity": "Ft Wayne",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46809",
  "OperatorZipCodeExt": null,
  "RMPContact": "Richard Zielinski",
  "RMPTitle": "Branch Manager",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000044123",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Formerly Brenntag Mid-South, Inc. (22)",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-07-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-06-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-06-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-06-10 00:00:00",
  "DeRegistrationEffectiveDate": "2008-04-30 00:00:00",
  "AnniversaryDate": "2009-05-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 40.98915,
  "FRS_Long": -85.17152,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 66531,
      "AltID": "CHLORINE STORAGE",
      "FacilityID": 45985,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 68119,
          "ProcessID": 66531,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 88138,
          "ProcessID": 66531,
          "ChemicalID": 62,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 588138,
          "ProcessID": 66531,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 66532,
      "AltID": "SULFUR DIOXIDE STORAGE",
      "FacilityID": 45985,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 68120,
          "ProcessID": 66532,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 88139,
          "ProcessID": 66532,
          "ChemicalID": 49,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 588139,
          "ProcessID": 66532,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 45985,
      "SummaryText": "Executive Summary\n\nThe Brenntag Great Lakes, LLC ? Ft. Wayne facility is a chemical warehouse and distribution facility, located in Ft. Wayne, Indiana.  Brenntag Great Lakes, LLC is part of Brenntag North America, Inc.  Brenntag Great Lakes, LLC is an advanced distribution company providing customers worldwide with products, chemicals and advanced materials.  Our major operations are located in the Midwest and employ over 200 people.\n\nIt is the world-wide policy of Brenntag to design, blend and distribute its products, and to manage those products throughout their life cycle in a manner that protects the environment and safeguards employees, customers, and the public from unacceptable risk.  This facility participates in the Responsible Distribution Process program of the National Association of Chemical Distributors.  The Distribution Process program brings chemical distribution plants and local communities together through communication and cooperative emergency planning.  It is our company policy to adhere to all applicable federal, state, and local regulations. \n\nBrenntag maintains health, safety, and environmental manuals, which contain company policies for risk management, training, product stewardship, community outreach, and hazard communication among other topics.  The manuals also include emergency action plans, emergency response plans, and transportation emergency plans.  The facility is in compliance with OSHA regulations.\n\nIn accordance with the RMP Submit Users Manual 2004, the following elements and their descriptions have been included in this Executive Summary:\n\n1.    Accidental Release Prevention and Emergency Response Policies\nBrenntag ? Ft. Wayne is strongly committed to employee, public and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as; design, installation, operating procedures, maintenance, and employee training associated with the various processes "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 45985,
      "SummaryText": "at the facility.  It is Brenntag ? Ft. Wayne?s policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, Brenntag ? Ft. Wayne is completely coordinated with the Ft. Wayne Fire Dept., which provides highly trained emergency response personnel to control and mitigate the effects of a release.\n\n2.    The Stationary Source and the Regulated Substances Handled\nThe Brenntag ? Ft. Wayne facility?s primary activities encompass distribution of chemical products.  There are currently two regulated substances present at the facility.  These substances include chlorine, and sulfur dioxide (anhydrous).  The sulfur dioxide, and chlorine are received prepackaged in different size containers.  Chlorine, and sulfur dioxide, are materials only handled for resell to customers.  The maximum inventory of chlorine at the facility is 30,000 pounds.  Sulfur dioxide (anhydrous), is present at the facility in quantities of 10,000 pounds.\n\n3.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nThe Brenntag ? Ft. Wayne facility has taken all the necessary steps to comply with the accidental release prevention requirements set forth under 40 CFR Part 68 of the EPA.  The facility was designed and constructed in accordance with the NFPA 30 -1996 Standard.\nThe following sections briefly describe the elements of the release prevention program that is currently in place at the stationary source.\n\nProcess Safety Information\nBrenntag ? Ft. Wayne maintains a detailed record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nBrenntag ? Ft. Wayne conducts comprehensive studies to ensure that hazards associated with the distribution processes are identified and controlled efficiently.  The methodology used to carry out these analyses is     ?WHAT IF?  The studies are undert"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 45985,
      "SummaryText": "aken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of three years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nBrenntag ? Ft. Wayne maintains written operating procedures for the purposes of safely conducting activities associated with the distribution processes.  These procedures address various modes of operation such as used in normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved with the processes.\n\nTraining\nBrenntag ? Ft. Wayne has a comprehensive training program in place to ensure that employees that are operating processes are completely competent in the operating procedures associated with these processes.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided at least every three (3) years, and more frequently, as needed.\n\nMechanical Integrity\nBrenntag ? Ft. Wayne carries out highly documented maintenance checks on process equipment to ensure proper functions.  Maintenance checks are performed on process equipment and also on lift trucks and tractor/trailer trucks.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training, as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner. Outside contractors also participate in the maintenance process.\n\nManagement of Change\nWritten procedures are in place at Brenntag ? Ft. Wayne to manage changes in chemicals, technology, equipment and procedures.  Process operators, maintenance personnel, or any other employee whose "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 45985,
      "SummaryText": "job tasks are affected by a modification in process conditions, are promptly made aware of the modification and offered appropriate training.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications of established processes, are conducted as a regular practice at Brenntag ? Ft. Wayne.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nBrenntag ? Ft. Wayne conducts audits on a regular basis to determine whether the provisions set forth under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions resulting from the audits are undertaken in a safe and timely manner.\n\nIncident Investigation\nBrenntag ? Ft. Wayne promptly investigates any incident that has resulted in, or could reasonably result in, a catastrophic release of a regulated substance.  These investigations are conducted to identify the situation leading to the incident as well as to determine corrective actions that will prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nBrenntag ? Ft. Wayne truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, employees have access to all information developed for the RMP rule along with information resulting from process hazard analyses.\n\nContractors\nOn occasion, Brenntag ? Ft. Wayne hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of the contractor?s safety performance is conducted.  Brenntag ? Ft. Wayne has a strict policy of informing the contractors of known potential hazards related to the contract"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 45985,
      "SummaryText": "or?s work and the processes.  Contractors are also informed of procedures for emergency response in the unlikely event that a regulated substance is accidentally released.\n\n4.    Five-year Accident History\nBrenntag ? Ft. Wayne has had zero accident releases in five years at this facility. \n\n5.    Emergency Response Plan\nBrenntag ? Ft. Wayne has a written emergency response plan in place to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes that take place within the processes that would require a modified emergency response.\n\nThe Emergency Response Plan has been reviewed, coordinated and verified with Allen County, which is the Local Emergency Planning Committee (LEPC).\n\n6.    Planned Changes to Improve Safety\nBrenntag ? Ft. Wayne?s safety program is designed to prevent fires, explosions, and accidental chemical releases.  The program requires safety audits, inspection, maintenance programs, and safety training for employees and contract workers.  Facility personnel are always encouraged to listen to the concerns of the community and to consider these concerns when designing and implementing process safety systems.\n\nBrenntag continues to improve its safety record by conducting incident investigations and safety compliance audits.  Brenntag also utilizes continuous training on emergency procedures, and participating in outreach activities, which include: educating and training customers, fire departments, and emergency response teams.  Brenntag practices continuous training of emergency procedures through regular safety meetings, and all incidents and near misses "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 45985,
      "SummaryText": "are thoroughly investigated and reviewed by the Health and Safety personnel at each facility.  \n\nSeveral developments and findings have resulted from the implementation of the various elements of the Brenntag ? Ft. Wayne accidental release prevention program.  Brenntag ? Ft. Wayne constantly strives to improve the safety of the processes at the Ft. Wayne facility through both the incident investigation program, and the safety committee.  Brenntag ? Ft. Wayne will continue to train employees in the operating procedures to define how tasks related to process operations should be performed."
    }
  ]
}