{
  "FacilityID": 46060,
  "FacilityName": "Bayer ACN Railcar at Dow Massey Railyard",
  "FacilityStr1": "437 MacCorkle Avenue",
  "FacilityStr2": null,
  "FacilityCity": "South Charleston",
  "FacilityState": "WV",
  "FacilityZipCode": "25303",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "54039",
  "LEPC": "Kanawha Putnam LEPC",
  "FacilityLatDecDegs": "38.357778",
  "FacilityLongDecDegs": "-081.707500",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Bayer Corporation",
  "Company2Name": null,
  "CompanyDUNS": 64960248,
  "Company2DUNS": null,
  "OperatorName": "DOW Chemical Co",
  "OperatorStr1": "501 2nd Avenue",
  "OperatorStr2": null,
  "OperatorCity": "South Charleston",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "25303",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": "25303CWSTV437MA",
  "EPAFacilityID": "100000195834",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-12-12 00:00:00",
  "SafetyInspectionBy": "DOT-Federal Railroad Administration",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2006-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-13 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.6",
  "FRS_Lat": 38.35838,
  "FRS_Long": -81.70072,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "51",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 66643,
      "AltID": "Acrylonitrile Tank Car",
      "FacilityID": 46060,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 88303,
          "ProcessID": 66643,
          "ChemicalID": 25,
          "Quantity": 190000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 68232,
          "ProcessID": 66643,
          "NAICSCode": "48821",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 39095,
              "Process_NAICS_ID": 68232,
              "SafetyReviewDate": "1999-12-20 00:00:00",
              "PHA_Date": "1999-12-20 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-06-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "No bottom valves, dedicated rail cars",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fire water spray monitors",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Cameras, security checks, survelliance",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-07-29 00:00:00",
              "TrainingReviewDate": "2002-06-27 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "CSX Computer Assissted Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-03-01 00:00:00",
              "EquipmentInspectionDate": "1999-01-01 00:00:00",
              "EquipmentTested": "Acrylonitrile tank car (UTLX 202987)",
              "ChangeMgmtDate": "2004-02-01 00:00:00",
              "ChangeMgmtReviewDate": "2002-12-31 00:00:00",
              "PreStartupReviewDate": "1993-04-07 00:00:00",
              "ComplianceAuditDate": "2002-02-18 00:00:00",
              "AuditCompletionDate": "2003-10-23 00:00:00",
              "IncidentInvestigationDate": "2003-07-29 00:00:00",
              "InvestigationChangeDate": "2003-08-01 00:00:00",
              "ParticipationPlansReviewDate": "1997-07-02 00:00:00",
              "HotWorkPermitReviewDate": "2003-01-01 00:00:00",
              "ContractorSafetyReviewDate": "2002-02-18 00:00:00",
              "ContractorSafetyEvalDate": "2004-02-23 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 56855,
                  "PreventionProgram3ID": 39095,
                  "ProcessChemicalID": 88303
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 46060,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-02-19 00:00:00",
    "ERTrainingDate": "2004-03-19 00:00:00",
    "CoordinatingAgencyName": "Kanawha Putnam LEPC",
    "CoordinatingAgencyPhone": "3047441838",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 8,
      "FacilityID": 46060,
      "SummaryText": "rylonitrile railcars, and all transfers and unloading is done through a transfer line on the top of the railcar.  This prevents any leaks, drips, or releases from the bottom of the railcar and prevents spills during transfer or unloading operations. \n? Cameras:  The acrylonitrile railcar is under surveillance by area cameras that are watched from a main control room.  This is in addition to the field surveillance.\n? Fire Water Spray Monitors:  A water spray system that knocks down acrylonitrile vapors to limit and control any vapor release. \n? Vendor Railcar Tracking System:  The acrylonitrile vendor uses a proprietary railcar tracking system to track the location and condition of each loaded and empty acrylonitrile railcar.  The vendor provides periodic reports from this railcar tracking system to Bayer.   \n? Vendor Railcar Mechanical Integrity Program:  The acrylonitrile vendor has a Mechanical Integrity Program for testing, inspection, and maintenance of the acrylonitrile railcars.  This program ensures the structural integrity of the railcar tank and supporting devices such as valves, gaskets, pressure relief devices, hoses, instruments, and coupling systems.\n? Surveillance: Railyard operating employees, security personnel, and RESCAR employees make routine unit walk-throughs to make sure the railcars are secure and all safety equipment and systems are operating properly.\n? Bayer RailTrac Railcar Tracking System:  Bayer uses a proprietary railcar tracking system called RailTrac.  This railcar tracking system provides daily reports on the location, condition, status, product, freight weight, destination, carrier, etc., for acrylonitrile supplier railcars.    \n? Vendor Emergency Response Systems:  The acrylonitrile vendor has various emergency response systems for responding to any railcar incident nationwide as needed.\n? Railroad Transportation Notification and Coordination:  The CSX Railroad Company provides notification and coordination for all acrylonitrile ra"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 46060,
      "SummaryText": "BAYER\nACN RAILCAR AT DOW MASSEY RAILYARD\nRISK MANAGEMENT PLAN\n\nEXECUTIVE SUMMARY\n\n\nIntroduction:\n\nHISTORY\n\nBest known for its flagship product, Bayer Aspirin, Bayer is a research-based company which produces a broad range of health care, life sciences and chemical products that help diagnose and treat diseases, purify water, preserve local landmarks, protect crops, advance automobile safety and durability and improve people's lives.  Headquartered in Pittsburgh, Bayer had sales of $10.1 billion in 2000 and is one of Fortune magazine's Most Admired Companies. The company employs 23,200 people. Bayer is investing $9 billion in capital expenditures and research and development from 2000 through the year 2004. 2000 capital investment and R&D expenditures were projected to total $1.6 billion. It is a member of the worldwide Bayer Group, a $29 billion international health care, polymers and chemicals group based in Leverkusen, Germany. The Bayer Group (BAYG.DE) stock is a component of the DAX, and is listed on multiple foreign exchanges.\n\nIn April 2000, Bayer acquired the global Polyols Business of Lyondell Chemical Company, including the facilities in South Charleston and Institute, WV. Bayer did not purchase the assets at the Lyondell North Charleston Distribution Terminal.  In 1998, Lyondell Chemical Company acquired the assets of ARCO Chemical Company (ACC), including the facilities in South Charleston and Institute, West Virginia.  In 1989, ARCO Chemical Company purchased the Polyols Manufacturing facilities from Union Carbide Corporation, which included the facilities in South Charleston and Institute, West Virginia.  In December 1999, Aventis was launched through the merger of  Hoechst AG and Rhône-Poulenc S.A.  In 2003 Bayer purchased the Aventis facilities. In 2001, Dow purchased Union Carbide Corporation.  The Bayer South Charleston and Institute facilities are located within the existing Dow (formerly Union Carbide Corporation) South Charleston Plant, and withi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46060,
      "SummaryText": "n the Bayer Crop Science (formerly Aventis) Plant in Institute, WV. Also included in this acquisition were urethanes research and development facilities located within the Dow (formerly Union Carbide) South Charleston Technical Center.  \n\nIn South Charleston and Institute, West Virginia, Bayer directly employs about 110 people and provides employment for about 120 people under contract from Dow (formerly Union Carbide) and Bayer Crop Science (formerly Aventis). \n\n\n\n\n\nPRODUCTS\n\nBayer produces Polyols products that form the basis for polyurethanes, coatings, adhesives, sealants, and elastomers of all kinds.  Products made from these materials fill the supermarket shelves and go into automobiles, housing, clothing and other necessities that improve the quality of life by making products safer, healthier and more convenient.\n\nThe products made at our South Charleston and Institute, West Virginia facilities belong to a family of chemicals called polyether polyols, and are derived from a chemical called propylene oxide, which is supplied by a Lyondell plant on the Gulf Coast.  Polyols are used primarily in polyurethane foams for products ranging from bedding and furniture, to automotive applications such as seat cushions and energy absorbing instrument panels and side panels.  Nearly two-thirds of all the auto seats in the U.S. today are made using the Bayer polyols products from the Kanawha Valley. Other polyols products we make here are used by our customers for applications as diverse as roof coatings, varnishes, roller blade wheels, and bowling balls.  All of the products are shipped to customers in other states or are exported to Europe, Asia, and South America.\n\nAnother product from our West Virginia facilities is technology. The scientists and technicians at our South Charleston Technical Center work closely together with our manufacturing organization here to develop new or improved polyols products and process technologies. These new technologies can then be used"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46060,
      "SummaryText": "by other Bayer polyos manufacturing sites around the world.\n\n\nRESPONSIBLE CARE®\n\nBayer is fully committed to the principles of Responsible Care, which is an initiative of the American Chemistry Council (ACC to improve industry performance in the areas of environment, health and safety, to improve the industry¿s safe management of chemicals, and to respond to public concerns. The American Chemistry Council (ACC) was formerly called the Chemical Manufacturers Association (CMA).  Since 1990, emissions of hazardous chemicals to the air from the Bayer South Charleston and Institute West Virginia facilities have been reduced by over 90% through improving processes and eliminating inefficient operations.  We have also made continuous improvements in our safety performance every year and rank among the industry leaders in this important aspect.  It is a policy of Bayer to establish goals for continuous improvement in the areas of health, safety, and the environment based on sound science, risk assessment and benefit analysis, against which we will measure, audit and communicate our performance.\n\nAnother initiative for continuous improvement is called Operational Excellence. Operational Excellence was formerly called Manufacturing Excellence under Lyondell Chemical Company and ARCO Chemical Company. Operational Excellence, based on the Manufacturing Excellence Program launched in 1991 by ARCO Chemical Company, is a program of corporate standards and management systems which incorporates all of the Responsible Care®  Codes of Management Practices, best practices in the chemical industry, and Bayer¿s own rigorous management systems. Operational Excellence, incorporates a system of Operational Excellence Standards based on the Manufacturing Excellence Standards which ensure superior performance and continuous improvement in the following five key areas: safety and health, environmental, product quality, manufacturing reliability, and efficiency. The Operational Excellence Syst"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 46060,
      "SummaryText": "em consists of 43 performance standards in the key manufacturing functional areas (e.g. HES, Operations, Maintenance, Engineering, Supply Chain), and a system of Bayer Facility Audits and Third Party Audits to evaluate compliance with the performance standards. The Third Party Audit System evaluates the regulatory compliance, reliability, and liability associated with the following types of third parties:  Waste Sites, Terminals, Tollers, Key Suppliers, and Transporters.  A rigorous auditing process evaluates how well our facility is meeting the high standards of Operational Excellence.  Audit teams composed of experts, from various Bayer facilities and the corporate auditing department, examine performance, site conditions, and documentation to make sure the Operational Excellence Standards are met.\n\n\nI. Accidental Release Prevention and Emergency Response Policies\n\nBayer has a contract with Dow (formerly Union Carbide Corporation) to use the Dow Massey Railyard to stage and store chemical raw material railcars until they are needed in the Bayer South Charleston Plant.  Bayer purchased the Lyondell contracts with Union Carbide, and then Dow purchased Union Carbide. Bayer has a contract with Dow to obtain emergency response services from the Dow South Charleston Plant Emergency Response Team.  The South Charleston Plant provides emergency response services to the Dow Massey Railyard.  \n\nThe Dow South Charleston Massey Railyard is committed to storing chemical railcars in a safe and responsible manner.  Dow and Bayer have implemented a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as to protect the environment.  These programs include Bayer¿s Operational Excellence requirements, Dow¿s Responsible Care® requirements, and governmental requirements, such as the Environmental Protection Agency¿s (EPA) Risk Management Program (RMP) rule (40 CFR Part 68) and"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 46060,
      "SummaryText": "the Occupational Safety and Health Administration¿s (OSHA) Process Safety Management (PSM) Standard (29 CFR Part 1910.119).  This document is intended to satisfy the RMP Plan requirements of the RMP rule and to provide the public with a description of the risk management program at the facility.\n\n\n\n\n\n\nII. STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe Massey Railyard is owned by Dow and is separated from the South Charleston Plant by the CSX Railroad property. The Dow Massey Rail Yard is used to temporarily store tank cars for eventual processing at the South Charleston Plant. The rail yard is managed by the South Charleston Plant, but is not considered contiguous by EPA definition with the South Charleston Plant. The CSX Railroad property sits between the Massey Railyard and the South Charleston Plant. No chemical unloading takes place at the Massey Rail Yard.  Bayer has a contract with Dow to use the Dow Massey Railyard to store chemical raw material railcars until they are needed in the Bayer South Charleston Plant.  \n\nACN is a chemical raw material used to make certain grades of Polyether Polyols. Bayer stores railcars containing acrylonitrile (ACN) at the Dow Massey Railyard.  An ACN Supplier owns the ACN Railcar(s) and Bayer owns the ACN material inside the ACN Railcar(s) once it is placed into the Massey Railyard by CSX.  CSX delivers the ACN Railcar(s) to the Massey Railyard for a storage period of 1 to 30 days.  Once CSX places the ACN Railcar(s) in the Massey Railyard, the ACN Railcar(s) is no longer under active shipping papers.  Upon request from Bayer and Dow, CSX transfers the ACN Railcar(s) from Massey Railyard, through the CSX Railroad property, onto the South Charleston Plant to the Bayer ACN Unloading Station within the South Charleston Plant.  The South Charleston Plant is owned by Dow, Bayer is a tenant in the facility, and Bayer leases part of the South Charleston Plant for its operations. Bayer  stores 1 to 7 ACN Railcars at the Massey Railyar"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 46060,
      "SummaryText": "d during a typical month.  The South Charleston Plant is covered under the RMP Regulations. Bayer and Dow store and use RMP regulated chemicals at the South Charleston Plant.  The South Charleston Plant facilities of both Bayer and Dow are covered by the RMP Program Level 3.  \n\nThere are no Bayer employees located at the Union Carbide Massey Railyard.  \n\nThe polyols we make at the South Charleston Plant and the Institute Plant are used by our customers to manufacture polyurethane foams for such applications as furniture cushions, mattresses, and for automotive applications such as seat cushions and energy absorbing instrument panels and side panels. Other customer applications include various coatings, adhesives, sealants, and elastomers. \n\nBayer stores an RMP-regulated toxic substance at the Dow Massey Railyard in sufficient quantity to be covered by the RMP rule. \n\nBayer stores threshold quantities of the following RMP-regulated toxic substance at the Dow Massey Railyard:\n\t\n? Acrylonitrile \n\n\nBayer does not handle, process, or store threshold quantities of any RMP-regulated flammable chemicals at the Dow Massey Railyard.\n\n\nIII. Offsite Consequence Analysis Scenarios\n\nThe Risk Management Program rule requires that covered stationary sources handling regulated substances conduct off-site consequence analyses (OCA) to evaluate the potential off-site impact of a worst-case scenario (WCS) and an alternative release scenario (ARS) for each regulated toxic chemical on site.  RMP also requires covered sources to evaluate one worst-case scenario and one alternative release scenario for a single chemical representing the class of flammables.  \n\nAll of these scenarios are developed using guidelines established in the RMP rule.  In developing worst-case scenarios, companies must presume the release of the entire quantity of the largest container of a regulated chemical over a 10-minute period.  Only passive mitigation systems, such as those that do not require energy or actio"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 46060,
      "SummaryText": "n by an employee to initiate can be considered.  U.S. EPA acknowledges that these worst-case scenarios are unlikely to occur, so the RMP rule also requires that companies develop alternative release scenarios based on more credible release assumptions. \n\nAlternative release scenarios differ from worst-case scenarios in several important ways.  They may be based on actual incident history or on events which are more likely to occur, and allow the use of both active and passive mitigation to reduce the potential impact of a release on the community outside the facility.\n\nEPA¿s Off-Site Consequence Analysis (OCA) Guidance Tables were used for evaluating the consequences of the WCS and ARS for both regulated flammable and toxic materials.  Use of these tables resulted in the determination of a release endpoint distance. The EPA-recommended LANDVIEW program was used to estimate the number of people potentially affected in each scenario.  The West Virginia Kanawha/Putnam County Emergency Services Maps and CD-ROM Program were utilized to identify the public and environmental receptors located within the scenario endpoint distance.\n\nAccording to the RMP rule, the release endpoint distance is intended to provide an estimate of the maximum possible area that might be affected for each scenario.  It is intended to ensure that potential risks to the public health are recognized.  For toxic releases, the endpoint is the distance beyond which chemical concentrations are low enough that an average individual could be exposed for up to one hour without suffering irreversible or debilitating health effects.   For flammable releases, the endpoint distance is that distance beyond which the community would be subject to a pressure wave of less than 1 psi resulting from the formation of an exploding vapor cloud.  Below this value little or no impact to the community is expected.\n\nThe RMP rule requires that we provide information about the worst case and alternative case scenarios in our"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 46060,
      "SummaryText": "facility Risk Management Plans.  The following are brief summaries of these hypothetical scenarios.  Unless otherwise specified, no credit was taken for administrative controls or mitigation measures in the worst case scenarios. However, chemical-specific steps that would likely be taken to prevent or mitigate the effects of each scenario are listed immediately following the scenario description. The alternative release scenario descriptions include those mitigation measures that were considered, and any measures for which credit was not taken are listed.  More information on the facility¿s general accident prevention program is described in Section IV.\n\n\nA)  Regulated Toxic Substances\n\n1. Worst Case Scenario(s)\n\n1.1  Worst Case Scenario ¿ acrylonitrile \n\nThe worst case scenario for acrylonitrile assumes a catastrophic failure of the acrylonitrile railcar, releasing 190,000 pounds of acrylonitrile as a liquid, leading to a vapor cloud release.  According to EPA¿s Off-Site Consequence Analysis (OCA) Guidance Table, this release could impact off-site public receptors.\n\nNo passive mitigation measures were used in this analysis.\n\nThis worst case scenario does not allow credit to be taken for the following safety and prevention systems which are in place to prevent this scenario from occurring, and to mitigate its effects should it occur: \n\n? Safety Relief Valve:  A pressure relief valve which relieves at excessive pressure to prevent a railcar overpressure and rupture.\n? Department of Transportation / Federal Railroad Administration:  Requirements for special leak detection procedures and plugging of vents and drains to contain leaks or releases. \n? Dedicated Railcars:  Railcars are dedicated for acrylontrile storage only.  This avoids cross-contamination with other chemical materials and ensures proper equipment setup (safety relief device sizing, specific gasket material, specific transfer line fittings, etc.)\n? No Bottom Valves:  There are no bottom valves on the ac"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 46060,
      "SummaryText": "ilcars to ensure proper transportation, consignment, movement, and placement.  CSX verifies proper execution of all placement instructions.\n? Weighmaster Training/Certification:  A formal training, testing and certification program that ensures proper skill and knowledge prior to independently handling the railcars.  This program requires weighmasters to be trained to inspect, load and unload railcars. \n\n\n\n2. Alternative Release Scenario(s)\n\n2.1 Alternative Release Scenario ¿ acrylonitrile\n\nThe alternative release scenario for acrylonitrile assumes a weld fatigue failure causing a 0.196 inch hole in the railcar tank shell, releasing 948 pounds of acrylonitrile, during a 60-minute period, as a liquid, leading to a vapor cloud release.  This scenario assumes a release rate of 15.8 pounds per minute for 60 minutes.  According to EPA¿s Off-Site Consequence Analysis (OCA) Guidance Table, this release could impact off-site public receptors.\n\nNo passive mitigation measures were used in this analysis.\n\nThe following active mitigation measures were used in this analysis:\n? Surveillance: Railyard operating employees, security personnel, and RESCAR employees make routine unit walk-throughs to make sure the railcars are secure and all safety equipment and systems are operating properly. \n? Cameras:  The acrylonitrile railcar is under surveillance by area cameras that are watched from a main control room.  This is in addition to the field surveillance.\n? Railroad Transportation Notification and Coordination:  The CSX Railroad Company provides notification and coordination for all acrylonitrile railcars to ensure proper transportation, consignment, movement, and placement.  CSX verifies proper execution of all placement instructions.\n\nThis scenario assumes that the leak is detected and stopped over a 60-minute period due to security guard surveillance, monitoring the area cameras, and coordination with CSX Railroad Company.  \n\nThis alternative release scenario does not allow cred"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 46060,
      "SummaryText": "it to be taken for the following safety and prevention systems which are in place to prevent this scenario from occurring, and to mitigate its effects should it occur: \n\n? Safety Relief Valve:  A pressure relief valve which relieves at excessive pressure to prevent a railcar overpressure and rupture.\n? Department of Transportation / Federal Railroad Administration:  Requirements for special leak detection procedures and plugging of vents and drains to contain leaks or releases. \n? Dedicated Railcars:  Railcars are dedicated for acrylontrile storage only.  This avoids cross-contamination with other chemical materials and ensures proper equipment setup (safety relief device sizing, specific gasket material, specific transfer line fittings, etc.)\n? No Bottom Valves:  There are no bottom valves on the acrylonitrile railcars, and all transfers and unloading is done through a transfer line on the top of the railcar.  This prevents any leaks, drips, or releases from the bottom of the railcar and prevents spills during transfer or unloading operations. \n? Fire Water Spray Monitors:  A water spray system that knocks down acrylonitrile vapors to limit and control any vapor release. \n? Vendor Railcar Tracking System:  The acrylonitrile vendor uses a proprietary railcar tracking system to track the location and condition of each loaded and empty acrylonitrile railcar.  The vendor provides periodic reports from this railcar tracking system to Bayer.   \n? Vendor Railcar Mechanical Integrity Program:  The acrylonitrile vendor has a Mechanical Integrity Program for testing, inspection, and maintenance of the acrylonitrile railcars.  This program ensures the structural integrity of the railcar tank and supporting devices such as valves, gaskets, pressure relief devices, hoses, instruments, and coupling systems.\n? Bayer RailTrac Railcar Tracking System:  Bayer uses a proprietary railcar tracking system called RailTrac.  This railcar tracking system provides daily reports on the locat"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 46060,
      "SummaryText": "ion, condition, status, product, freight weight, destination, carrier, etc., for acrylonitrile supplier railcars.    \n? Vendor Emergency Response Systems:  The acrylonitrile vendor has various emergency response systems for responding to any railcar incident nationwide as needed.\n? Weighmaster Training/Certification:  A formal training, testing and certification program that ensures proper skill and knowledge prior to independently handling the railcars.  This program requires weighmasters to be trained to inspect, load and unload railcars. \n\nB)  Regulated Flammable Substances\n\nBayer does not handle, process, or store threshold quantities of any RMP-regulated flammable chemicals at the Dow Massey Railyard.\n\n\nIV. General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nGeneral Program\n\nThe Bayer Kanawha Valley (South Charleston Plant and Institute Plant) West Virginia general accident prevention program consists of compliance with the EPA RMP rule and the OSHA PSM standard, and implementation of Bayer's Operational  Excellence Standards, Dow¿s (formerly Union Carbide's) Operational Safety Program and Dow's (formerly Union Carbide¿s) Episodic Risk Management System.  \n\nThe key elements of these systems include the following:\n\nSafety Relief Valve:  A pressure relief valve which relieves at excessive pressure to prevent a railcar overpressure and rupture.\nDepartment of Transportation / Federal Railroad Administration:  Requirements for special leak detection procedures and plugging of vents and drains to contain leaks or releases. \nDedicated Railcars:  Railcars are dedicated for acrylontrile storage only.  This avoids cross-contamination with other chemical materials and ensures proper equipment setup (safety relief device sizing, specific gasket material, specific transfer line fittings, etc.)\nNo Bottom Valves:  There are no bottom valves on the acrylonitrile railcars, and all transfers and unloading is done through a transfer line on the t"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 46060,
      "SummaryText": "op of the railcar.  This prevents any leaks, drips, or releases from the bottom of the railcar and prevents spills during transfer or unloading operations. \nCameras:  The acrylonitrile railcar is under surveillance by area cameras that are watched from a main control room.  This is in addition to the field surveillance.\nFire Water Spray Monitors:  A water spray system that knocks down acrylonitrile vapors to limit and control any vapor release. \nVendor Railcar Tracking System:  The acrylonitrile vendor uses a proprietary railcar tracking system to track the location and condition of each loaded and empty acrylonitrile railcar.  The vendor provides periodic reports from this railcar tracking system to Bayer.   \nVendor Railcar Mechanical Integrity Program:  The acrylonitrile vendor has a Mechanical Integrity Program for testing, inspection, and maintenance of the acrylonitrile railcars.  This program ensures the structural integrity of the railcar tank and supporting devices such as valves, gaskets, pressure relief devices, hoses, instruments, and coupling systems.\nSurveillance: Railyard operating employees, security personnel, and RESCAR employees make routine unit walk-throughs to make sure the railcars are secure and all safety equipment and systems are operating properly.\nBayer RailTrac Railcar Tracking System:  Bayer uses a proprietary railcar tracking system called RailTrac.  This railcar tracking system provides daily reports on the location, condition, status, product, freight weight, destination, carrier, etc., for acrylonitrile supplier railcars.    \nVendor Emergency Response Systems:  The acrylonitrile vendor has various emergency response systems for responding to any railcar incident nationwide as needed.\nRailroad Transportation Notification and Coordination:  The CSX Railroad Company provides notification and coordination for all acrylonitrile railcars to ensure proper transportation, consignment, movement, and placement.  CSX verifies proper execution o"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 46060,
      "SummaryText": "f all placement instructions.\nEquipment Design:  Vessels (including shipping containers) and other process equipment are designed according to recognized industry standards and/or governmental requirements.\nProcess Safety Information: Chemical hazard, process technology, and equipment information is  documented, maintained up-to-date, and available to operating personnel.\nProcess Hazard Analysis: A rigorous practice of reviewing new processes or changes to existing processes at the design stage to identify and mitigate potential safety, health, and environmental issues before the process is installed and operated.  Scheduled process hazard/risk reviews are conducted to revalidate initial process hazard reviews on a periodic basis.  Process hazard analyses are conducted every five years to identify major process hazard scenarios and to recommend corrective action(s) needed to prevent their occurrence.\nEpisodic Risk Management System:  Periodic reviews are conducted to identify hazards which could have significant community impact and to recommend corrective action(s) needed to prevent their occurrence.  These reviews utilize advanced quantitative risk assessment techniques.\nOperational Safety Standards: A company sponsored operational safety program that meets OSHA Process Safety requirements.  Design requirements for active and passive mitigation controls used to prevent major process hazards are documented in the operational safety standards.\nOperating Procedures:  Operating procedures provide detail on how to safely operate a process and are maintained up-to-date.  All operating procedures are based on process hazard/risk reviews.\nWeighmaster Training/Certification:  A formal training, testing and certification program that ensures proper skill and knowledge prior to independently handling the railcars.  This program requires weighmasters to be trained to inspect, load and unload railcars. \nTechnical Staff Training and Support:  Trained technical staff employees a"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 46060,
      "SummaryText": "re available 24 hours a day to support operations.\n\n\n\nMechanical Integrity Program:  Vessels (including shipping containers) and other process equipment are periodically tested and inspected to ensure safe operation of process equipment, following recognized standards and/or government requirements.  This program includes testing, inspection and maintenance of critical equipment, including pressure relief devices, hoses, piping, instruments, and shutdown systems.\nMaterial Analysis: Analysis of key chemical raw materials to ensure they meet specifications prior to charging into the process reactor.   Bayer obtains a Certificate of Analysis from the supplier for all raw material  shipments.\nQuality Assurance:  The plant has a system to ensure that purchased equipment and materials meet established engineering standards and specifications. \nManagement of Change:  The plant has a management system to ensure that modified facilities and processes are safe for operation. Design and pre-startup safety reviews are conducted for facility or process changes before the changes are implemented.   \nPre-Startup Safety Reviews:  Reviews are conducted just prior to startup to ensure that modified facilities and processes are safe for operation.\nIncident Investigation:  The plant has a program to ensure accidents, incidents, and near miss events are properly investigated to determine the Root Cause(s) and Contributing Cause(s), and to implement corrective action(s) that are needed to prevent recurrence.\nEmployee Participation:  The plant has a program to involve employees in prevention program elements.\nPermits:  The plant uses a variety of work permits to control those activities that represent work outside of regular plant operations.  These include Lockout/Tagout, Hot Work, Line Breaking and Confined Space Entry permits.  Employees are involved in designing, implementing and following the permits.  \n? Lockout/Tagout ¿ Isolation of equipment to be serviced from energy sources.  Th"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 46060,
      "SummaryText": "is prevents chemical releases and injuries to workers from unexpected energization, start-up, or release of stored energy.\n? Hot Work ¿ Protects employees and property by preventing fires and explosions.  It ensures, among other things, that no flammable materials are present when an open spark or flame may be present for maintenance activities. The plant has a procedure to ensure that welding, cutting and brazing are safely performed in areas where flammable or combustible material may be present.\n? Line Breaking ¿ Requires isolation and draining of lines to be opened.  It details required personal protective equipment based on the chemical contained in the line.\n? Confined Space Entry ¿ System using engineering and administrative controls, along with personal protective equipment, to protect the health and safety of personnel working within confined spaces, such as tanks.\nContractor Safety Program:  The plant has a program to ensure that contractors are properly trained and perform their work in compliance with safety requirements.  Contractors must meet rigorous safety performance requirements before being allowed to work on process equipment.  Contractor employees and regular plant employees must follow all of the same plant safety procedures and requirements. \n\n\nCompliance Audits:  Periodic corporate-led and plant-led audits are conducted to ensure that process operations comply with governmental, Bayer and Dow (formerly Union Carbide) requirements.\nEmergency Procedures:  Plant and process specific emergency response procedures and  training to ensure proper response and notification in the event of a release.\nOperational Excellence Standards: Rigorous corporate standards that we follow to ensure that we operate our facilities in a safe and environmentally sound manner.  Our compliance to these standards is routinely audited by corporate experts.  We have Operational Excellence Standards (formerly called Manufacturing Excellence Standards) that define managemen"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 46060,
      "SummaryText": "t systems in the following areas: Environmental, Health and Safety; Technical; Operations; Maintenance; Transportation and Storage; Quality; and Purchasing/Third Parties.  Operational Excellence (formerly called Manufacturing Excellence) is Bayer¿s comprehensive program to ensure that all the elements listed above are implemented and maintained at the Bayer South Charleston and Institute Plants.   The Operational Excellence program includes accountabilities for timely and proper implementation of the program elements.\n\nThese general prevention elements and the chemical specific steps discussed in the previous section are parts of an overall management system to prevent accidental chemical releases.  Our company and our employees are committed to the standards that these management systems set.  We have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\n\n\nV. Five-Year Accident History\n\nIn the last five years there has not been an accident or incident involving an EPA RMP chemical stored by Bayer or Lyondell at the Union Carbide Massey Railyard that resulted in an on-site death, injury, or property damage; or a known off-site death, injury, evacuation, shelter-in-place, property damage, or environmental damage. \n\n\nVI. Emergency Response Program\n\nThe Dow (formerly Union Carbide) South Charleston Plant provides emergency response services to the Dow (formerly Union Carbide) Massey Railyard.  Bayer has a contract with Dow to obtain emergency response services from the Dow Emergency Response Team at the South Charleston Plant, and the Dow Emergency Operations Center (EOC).  The South Charleston Plant maintains a highly trained emergency response team to provide safe and appropriate response to any type of plant emergency and hazardous materials incident.  It also participates in local fire and industrial mutual aid systems through the Kanawha Putnam Emergency Planning Committee (KPEPC).    \n\nThe South Charl"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 46060,
      "SummaryText": "eston Plant, which provides emergency response services to the Dow Massey Railyard, maintains a written emergency response program to protect worker and public safety, as well as the environment.  The South Charleston Plant emergency response program includes all of the details from the Massey Railyard , and provisions to handle the hazards at the Massey Railyard.  The program consists of procedures for responding to releases of hazardous substances, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response including:\n? Proper first-aid and medical treatment for exposures \n? Evacuation plans and accounting for personnel after an evacuation\n? Notification of local emergency response agencies and the public if a release occurs\n? Post-incident cleanup and decontamination requirements, and\n? Inspecting, testing, maintaining, and using emergency response equipment.\nThe emergency response program is updated when necessary based on modifications made to facility processes.\n\nThe South Charleston Plant maintains a trained emergency squad to handle fires, explosions, toxic vapor releases, spills, and medical emergencies.   The plant emergency squad trains and drills with local emergency responders to enhance their skills and tactics for responding to an accidental chemical release.   Critiques are held on drills and actual events.  In addition to the plant emergency squad, Dow (formerly Union Carbide) staffs a Hazardous Emergency Leak Prevention (HELP) team in the Kanawha Valley that responds to accidental releases within the Massey Railyard and from transportation equipment throughout the continental United States.  \n\nThe emergency response program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Detailed emergency response plans are developed and coordinated with the Kanawha Putnam E"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 46060,
      "SummaryText": "mergency Planning Committee and the community.\n\n\nVII. Planned Changes to Improve Safety\n\nThe following is a list of improvements that we are planning to implement at the facility to help prevent and/or better respond to accidental chemical releases:\n? Continue use and implementation of the Apollo Root Cause Analysis problem solving technique to investigate incidents, to identify causes of process problems, and to develop  effective solutions to prevent their recurrence.\n? Continue use of Acrylonitrile suppliers with dedicated railcars, Vendor Railcar Tracking Systems, Vendor Emergency Response Systems, and Vendor Railcar Mechanical Integrity Programs.  \n? Upgrade to emergency response computer database to improve ability to calculate release quantities and to increase reference data to improve emergency response capability"
    }
  ]
}