{
  "FacilityID": 46083,
  "FacilityName": "LT Farms",
  "FacilityStr1": "2888 Herring Road",
  "FacilityStr2": null,
  "FacilityCity": "Arvin",
  "FacilityState": "CA",
  "FacilityZipCode": "93203",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.143889",
  "FacilityLongDecDegs": "-118.860000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Daniel Tran",
  "OperatorStr1": "2888 Herring Road",
  "OperatorStr2": null,
  "OperatorCity": "Arvin",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93203",
  "OperatorZipCodeExt": null,
  "FTE": 65,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000195914",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Cold Storage",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-07-14 00:00:00",
  "ErrorReportDate": "2006-07-14 00:00:00",
  "ReceiptDate": "2006-07-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-07-07 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2011-11-28 00:00:00",
  "DeRegistrationEffectiveDate": "2011-11-21 00:00:00",
  "AnniversaryDate": "2011-07-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 66671,
      "AltID": "cold storage",
      "FacilityID": 46083,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 88343,
          "ProcessID": 66671,
          "ChemicalID": 56,
          "Quantity": 8540.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 68260,
          "ProcessID": 66671,
          "NAICSCode": "111998",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 24565,
              "Process_NAICS_ID": 68260,
              "SafetyReviewDate": "2006-06-27 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2006-06-27 00:00:00",
              "ChangeCompletionDate": "2006-11-27 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Create detailed written standard operating procedures",
              "OpProceduresReviewDate": "2006-06-27 00:00:00",
              "TrainingReviewDate": "2006-06-27 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2006-06-27 00:00:00",
              "EquipmentInspectionDate": "2006-06-05 00:00:00",
              "EquipmentTested": "drive computer wiring",
              "ComplianceAuditDate": "2006-06-27 00:00:00",
              "AuditCompletionDate": "2006-11-27 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "LT Farms is committed to providing our employees with a safe workplace by providing them with safety information and emergency action procedures.",
              "_chemicals": [
                {
                  "PrimaryKey": 25705,
                  "PreventionProgram2ID": 24565,
                  "ProcessChemicalID": 88343
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 46083,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2006-06-27 00:00:00",
    "ERTrainingDate": "2006-07-05 00:00:00",
    "CoordinatingAgencyName": "Kern County Env. Health Dept",
    "CoordinatingAgencyPhone": "6618628700",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46083,
      "SummaryText": "\nExecutive Summary \n\n\n\n1.    Accidental Release Prevention and Emergency Response Policies:\n\n\n\nLT Farms is committed to employee, public and environmental safety.  This commitment is demonstrated by its accidental release prevention program that includes management practices in areas such as operating procedures, equipment maintenance, hazard analysis and employee training associated with the processes at our facility. \n\n\n\nIt is the policy of LT Farms to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n\n\n\n2.    The Stationary Source and the Regulated Substances Handled:\n\n\n\nThe facility's primary activity is the temporary cold storage of fruits and vegetables.  There is one regulated substance present at this facility.  This substance is anhydrous ammonia and is used as a refrigerant in the cold storage refrigeration equipment.\n\n\n\nGiven the amount of ammonia present and the ability to affect offsite receptors, this is a Program Level 2 RMP.  \n\n\n\n3.    The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario:\n\n\n\nTo perform the required offsite consequence analysis, the EPA's RMP *Comp(TM) and 2000 US Census data for LandView 5 were used.  The following paragraphs provide details of the chosen scenarios.\n\n\n\nThe worst case:\n\nThe worst case release scenario involves a catastrophic release from the receiver tank.  In this scenario 8540 lbs. of Ammonia is released.  Ammonia liquefied under pressure is released to a pool with total vaporization assumed within 10 minutes.  A rural setting was used in RMP Comp.  The regulatory required atmospheric conditions were used: Class D atmospheric stability and 1.5 meters/second wind speed to a toxic endpoint of 0.14 mg/L.  \n\n\n\nThe maximum distance to the toxic endpoint is 2.7 miles and affects 139 persons. \n\n\n\nAlternative Scenarios to Off Site\n\n\n\nTo calculate a release rate that w"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46083,
      "SummaryText": "ould show offsite consequence, alternative release scenarios involves the release of ammonia vapor from a shaft seal @ 85 pounds-per-minute that is assumed to be controlled in 30 minutes, at class D atmospheric stability and 3.0 meters/second wind speed, the toxic endpoint of 0.14 mg/L of ammonia.  The release rates were increased until RMP Comp no longer gave the ?less than? 0.1 miles for the scenario.  At this rate the endpoint is definitely off the site.  Census data indicates there are no off-site receptors\n\n\n\nAlternative Most Likely Scenarios\n\n\n\nThe alternative release scenario involves the release of 750 lbs. of ammonia vapor from a shaft seal that is assumed to be controlled in 30 minutes at a release rate of 25 lbs per minute.  No passive mitigation systems were taken into account to calculate the scenario and the release is assumed to be controlled by the manual shutdown of the system.  At class D atmospheric stability and 3.0 meters/second wind speed, the maximum distance to the toxic endpoint of 0.14 mg/L of ammonia is less than 0.1 miles.  Census data indicates there are no off-site receptors\n\n\n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps:\n\n\n\nLT Farms has taken all the necessary steps to comply with the Risk Management Program requirements set out under CCR Title 19, Division 2, Chapter 4.5.  The following sections briefly describe the elements of the release prevention program that is in place at our cold storage facility.\n\n\n\nSafety Information:\n\n\n\nLT Farms maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\n\n\nThis section will include a Material Safety Data Sheet for Anhydrous Ammonia and manufacturer?s equipment specifications.\n\n\n\nProcess Hazard Review:\n\n\n\nLT Farms has conducted a hazard review to ensure that hazards associated with the processes are identified and controlled.  Ammonia refrig"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46083,
      "SummaryText": "eration plants are very different from complex chemical processing operations.  Many of the operations in chemical processing are not found in refrigeration plants.  There are no chemical reactions.  Moreover, ammonia refrigeration is a mature industry.  While there are new developments leading to more efficient operations, the design principles are fully available.  A complete understanding of the safe design and operating envelope is available to design practitioners in the industry.  Hazard reviews can result in findings or recommendations for improvements to prevent potential releases.  The management system includes that these findings or recommendations are promptly brought to resolution.  \n\n\n\nThe study will be re-evaluated at a regular interval of every five years or whenever major changes in the process are proposed.  Any findings related to the hazard analysis will be addressed in a timely manner.  \n\n\n\nThe most recent review of hazards was performed on June 27, 2006.\n\n\n\nOperating Procedures:\n\n\n\nFor the purposes of safely conducting activities within the covered processes, LT Farms is creating written operating procedures through its outside refrigeration contractors and primary documentation of the equipment as provided by the manufacturer.  These procedures will address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is periodically reviewed and is readily accessible to operators involved in the processes.\n\n\n\nTraining:\n\n\n\nLT Farms has a training program in place to ensure that employees who are operating the refrigeration system process are competent in the operating procedures associated with the process.  Refresher training is provided at least annually and more frequently as needed.\n\n\n\nMaintenance Program:\n\n\n\nLT Farms carries out routine maintenance checks on process equipment to ensure proper operations"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 46083,
      "SummaryText": ".  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Maintenance operations are carried out by qualified, contracted personnel with previous training in maintenance practices.  Furthermore, these contracted personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nCompliance Audits:\n\n\n\nCompliance audits provide a means by which the management of a plant assures itself that employees are properly carrying out their duties for preventing accidental releases.  \n\n\n\nLT Farms has conducted an audit for this first RMP submission to determine whether the provisions set out under the RMP rule are being implemented.  \n\n\n\nThis most recent compliance audit was conducted on June 27, 2006.  \n\n\n\nAdditional audits will be carried out at least every 3 years and any corrective actions required as a result of the audits will be undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation:\n\n\n\nLT Farms will promptly investigate any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  Such investigations will be undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports of incidents will be retained for a minimum of 5 years.\n\n\n\n5.    Five-year Accident History:\n\n\n\nNone\n\n\n\n6.    Emergency Response Plan:\n\n\n\nLT Farms carries a written Emergency Action Plan to deal with accidental releases of hazardous materials.  The plan includes evacuation procedures and location, notification of local emergency response agencies and the public.\n\n\n\nTo ensure proper functioning, emergency response equipment is regularly inspected and serviced.  The plan is periodically reviewed and updated to reflect any changes that affe"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 46083,
      "SummaryText": "ct the plan\n\n\n\n7.    Planned Changes to Improve Safety:\n\n\n\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Ongoing safety inspections and further employee training are some of the major steps we want to take to improve safety at our facility.   These changes are expected to be implemented by 11/01/2006.\n\n"
    }
  ]
}