{
  "FacilityID": 46228,
  "FacilityName": "Ridgemont Plant",
  "FacilityStr1": "15906 Ridgeroe",
  "FacilityStr2": null,
  "FacilityCity": "Houston",
  "FacilityState": "TX",
  "FacilityZipCode": "77053",
  "Facility4DigitZipExt": "3723",
  "FacilityCountyFIPS": "48157",
  "LEPC": "Fort Bend LEPC",
  "FacilityLatDecDegs": "29.592111",
  "FacilityLongDecDegs": "-095.455500",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A6",
  "LatLongDescription": "CE",
  "FacilityURL": "www.cityofhouston.gov",
  "FacilityEmailAddress": "Dannelle.belhateche@cityofhouston.net",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City Of Houston",
  "OperatorStr1": "P.O. Box 1562",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77251",
  "OperatorZipCodeExt": "1562",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000128122",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-05-03 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2006-08-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-08-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2006-08-04 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-01-22 00:00:00",
  "DeRegistrationEffectiveDate": "2013-09-04 00:00:00",
  "AnniversaryDate": "2011-08-04 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.6",
  "FRS_Lat": 29.592111,
  "FRS_Long": -95.4555,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 66864,
      "AltID": "Chlorination",
      "FacilityID": 46228,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 88602,
          "ProcessID": 66864,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 68462,
          "ProcessID": 66864,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 24620,
              "Process_NAICS_ID": 68462,
              "SafetyReviewDate": "1999-03-05 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-04-06 00:00:00",
              "ChangeCompletionDate": "1999-04-30 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Update MSDS",
              "OpProceduresReviewDate": "1999-05-25 00:00:00",
              "TrainingReviewDate": "1999-01-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-28 00:00:00",
              "EquipmentInspectionDate": "1999-05-12 00:00:00",
              "EquipmentTested": "Wallace and Tiernan Analyzers/ Hach Analyzers",
              "ComplianceAuditDate": "2006-02-28 00:00:00",
              "AuditCompletionDate": "2006-03-20 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1998-12-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 25761,
                  "PreventionProgram2ID": 24620,
                  "ProcessChemicalID": 88602
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 46228,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-01 00:00:00",
    "ERTrainingDate": "1999-05-23 00:00:00",
    "CoordinatingAgencyName": "City of Houston Fire Department",
    "CoordinatingAgencyPhone": "7132475000",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46228,
      "SummaryText": "CITY OF HOUSTON DISCLOSURE\n\nThe following executive summary for the City of Houston Ridgemont Plant was originally prepared and sealed by Rod McCrary, P.E. of Turner Collins & Braden Inc.  The City of Houston is resubmitting this executive summary to Lourdes Carrion of the Environmental Protection Agency (EPA) for the following reasons:\nAs of __ the City of Houston learned that the EPA does not have any records of the City Houston 2004 RMP submittal for the Ridgemont Plant.  Consequently, the City forward a copy of the original RMP in question to the EPA on Friday, June 23, 2006; along with a copy of the disk that was provided to the City of Houston by Turn Collins & Braden Inc.\nUpon receipt of the copy, Mrs. Carrion further advised Prentiss Watkins, Senior Project Manager of the City¿s Compliance Group, although the City correctly provide the EPA with the information requested: the disk that the consultant gave the City is not in the proper format.\n·\tAs a result Mrs. Carrion is requesting that the City of Houston provide another disk copy of the Ridgemont Plant RMP using the RMP*Submit 2004TM.  \n·\tIn addition, Mrs. Carrion advised the City to change applicable sections of the Ridgemont Plant RMP since contact information originally provided to Turner Collins & Braden Inc. for the 2004 RMP submittal has changed.  Consequently, the following sections of the Ridgemont RMP has been updated:  \n?\t1.6 Owner or Operator\n?\t1.7 Name and title of person or position responsible for Part 64 RMP implementation\n?\t1.8 Emergency Contact\n?\t1.9 Other points of contact\n?\t8.8 Compliance audits \n[Note that these updated have also been made to satisfy EPA requirements found in chapter 6 and chapter 7, of the EPA¿s ¿RMP*Submit 2004TM User Manual.¿]\n·\tAs a result, the City restates that the ¿Executive Summary ¿ is being re-submitted: but not changed, to satisfy all software requirements.\n·\tNote that it is our understanding that this re-submittal of the Ridgemont Plant RMP also changes the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46228,
      "SummaryText": "Plant¿s original anniversary date from June 16, 2009, to a new date that will be assigned by the EPA upon receipt of the disk containing this document.\n\nTitle:\tSenior Assistant Director \n\t\nName:\tDannelle Belhateche, P.E.   \nSignature:\t\nExecutive Summary for the City of Houston Ridgemont Plant\n\n1.\tAccident Release Prevention and Emergency Response Polity\nRidgemont Plant is strongly committed to employee, public and environmental safety. This commitment is demonstrated by a comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at its facility.   It is policy to implement appropriate controls to prevent possible releases of regulated substances.\n2.\tThe Stationary Sources and the Regulated Substances Handled\nThe facility¿s primary activities encompass treating ground water. Ridgemont Plant has one regulated substance present at its facility.  The substance is chlorine, which is used for disinfection.  The maximum inventory of chlorine at this facility is 6,000 pounds.\n3.\tThe General Accident Release Prevention Program and the Chemical Specific Prevention Steps.\nRidgemont Plant has taken all the necessary steps to comply with the accidental release prevention requirements set put under 40 CFR part 68 of the EPA.  The following sections briefly describe the elements of the release prevention program that is in place at the stationary source.\nPROCESS SAFETY INFORMATION\nRidgemont Plant maintains a detailed record of safety information that describes the chemical hazards, operating parameters, an equipment designs associated with the processes.\nPROCESS HAZARD ANALYSIS\nRidgemont conducts comprehensive studies to ensure that hazards associated with its processes are identified and controlled efficiently.  The methodology used to carry out these analyses is inspection of the plant to identify deficiencies throughout the system.  The studies are un"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46228,
      "SummaryText": "dertaken by a tem of qualified personnel with expertise in engineering and process operation and are revalidated routinely.  Any findings related to the hazard analysis are addressed in a timely manner.\nOPERATION PROCEDURES\nFor the purposes of safely conducting activities within the facility¿s covered processes, Ridgemont maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, and normal shutdown.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\nTRAINING \nRidgemont Plant has a comprehensive training program in place to ensure that employees who are responsible for processes are competent in the operating procedures associated with these processes.  Refresher training is provided as needed\nMECHANICAL INTEGRITY\nRidgemont Plant carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment by these checks includes among others: pressure valves, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\nMANAGEMENT OF CHANGE\nWritten procedures are in place at Ridgemont Plant to manage changes in process chemicals, technology, equipment and procedures.  The most recent review/revision of maintenance procedures was performed on Ridgemont Plant process operators, maintenance personnel, or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with all the modifications.\nPRE-STARTUP REVIEWS\nPre-startup"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 46228,
      "SummaryText": "safety reviews related to new processes and to modifications in established processes are conducted at Ridgemont Plant. These reviews are conducted to confirm that construction, equipment, operating, and maintenance procedures are suitable for safe startup prior to placing equipment into operations.\nCOMPLIANCE AUDITS\nRidgemont Plant conducts audits on a regular basis to determine whether the provisions set out under the RMP rules are being implemented.  These Audits are carried out at least once every three years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\nINCIDENT INVESTIGATION\nRidgemont Plant promptly investigates any incident that has resulted in, or could reasonably result in, a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release form reoccurring.  All reports are retained for a minimum of five years.\nEMPLOYEE PARTICIPATION\nRidgemont Plant truly believes that process safely management and accident prevention is a team effort.  Employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, employees have access to all information created as part of the facility¿s implementation of the RMP rules, including information resulting from process hazard analyses in particular.\nCONTRACTORS\nOn occasions, Ridgemont Plant hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of contractor is carried out.  Ridgemont Plant has a strict policy of informing the contractors of known potential hazards related to the contractor¿s work and processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n4.\tFive-year Accident"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 46228,
      "SummaryText": "History\nRidgemont Plant has had an excellent record of preventing accidental release of a regulated substance over the last five years.  Due to stringent release prevention policies, there have been on accidental releases. \n5.\tEmergency Response plan\nRidgemont Plant carries a written emergency response plan to deal with accidental release of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, and information of local emergency response agencies and the public.\nTo ensure proper functioning, the facility¿s emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within Ridgemont processes that would require a modified emergency response."
    }
  ]
}