{
  "FacilityID": 46288,
  "FacilityName": "Atlas Cold Storage",
  "FacilityStr1": "2525 Bergey Road",
  "FacilityStr2": null,
  "FacilityCity": "Hatfield",
  "FacilityState": "PA",
  "FacilityZipCode": "19440",
  "Facility4DigitZipExt": "0009",
  "FacilityCountyFIPS": "42091",
  "LEPC": "Montgomery County LEPC",
  "FacilityLatDecDegs": "40.291389",
  "FacilityLongDecDegs": "-075.300556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.atlascold.com",
  "FacilityEmailAddress": "atlasinquiries@atlascold.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Atlas Cold Storage Holdings",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Atlas Cold Storage Holdings",
  "OperatorStr1": "5255 Young Street",
  "OperatorStr2": "Suite 900",
  "OperatorCity": "Toronto",
  "OperatorStateFIPS": null,
  "OperatorZipCode": null,
  "OperatorZipCodeExt": null,
  "RMPContact": "Tim Groff",
  "RMPTitle": "General Manager",
  "FTE": 160,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000028481",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-07-06 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Hatfield, PA",
  "NoAccidents": 0,
  "ForeignStateProv": "Ontario",
  "ForeignZipCode": "M2N 5P8",
  "ForeignCountry": "CA",
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-08-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-08-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-08-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.4",
  "FRS_Lat": 40.28983,
  "FRS_Long": -75.30438,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 66963,
      "AltID": "Ammonia Refrigeration #3",
      "FacilityID": 46288,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 68563,
          "ProcessID": 66963,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 88707,
          "ProcessID": 66963,
          "ChemicalID": 56,
          "Quantity": 6100.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 588707,
          "ProcessID": 66963,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 66964,
      "AltID": "Ammonia Refrigeration #2",
      "FacilityID": 46288,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 68564,
          "ProcessID": 66964,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 88708,
          "ProcessID": 66964,
          "ChemicalID": 56,
          "Quantity": 17500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 588708,
          "ProcessID": 66964,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46288,
      "SummaryText": "Atlas Cold Storage\n\nHatfield\n\nEXECUTIVE SUMMARY OF\n THE EPA RISK MANAGEMENT PLAN \n\n\n\nAtlas Cold Storage Management has implemented the requirements of the Risk Management Plan at this location in order to operate this facility in accordance with regulations and support of best industry standards.  The ultimate objective is to minimize the risk of an accidental ammonia release.  The facility management has developed an Employee Emergency Action and Fire Prevention Plan.  Along with the emergency procedures and training, a plan is coordinated with local emergency responders to ensure a fast and efficient response in the event of an accidental hazardous material release, a fire or other emergency situation.  Atlas Cold Storage provides emergency response training for employees through the use of specialists in the industry that are authorized to train.  Atlas Cold Storage believes it is important that employees that participate in emergency response situations are adequately trained in handling emergency situations with anhydrous ammonia systems.  This specialized HAZMAT training follows the guidelines of federal, state and local regulatory agencies.\n\nThe management believes that cooperative emergency response training must include company employees, local emergency responders and regulatory agency people in order to provide a safe workplace and a safe environment.  In an emergency, all employees are trained to cooperate with other support personnel as directed by the Emergency Response IncidentCommander.                                                                                                                                                             \nIn order to prevent a potential accidental ammonia release at Atlas Cold Storage, the Company has an ongoing review process for design and operating procedures.  This assists in ensuring the refrigeration systems comply with OSHA, EPA and all other local, state regulatory agency safety standards, as well as its ow"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46288,
      "SummaryText": "n internal standards.\n                                                                                                                                                                                      Atlas Cold Storage Hatfield is a refrigerated warehousing and distribution facility. The large majority of products stored are refrigerated foods for human consumption and inherently pose no known environmental or safety risks.  Ammonia, a regulated substance, is the commonly used refrigerant in industrial grade refrigeration systems that maintain low storage temperatures and can be safely managed by trained operators.  The ammonia refrigeration process functions within a closed piping network serving the facility operations.  The refrigeration systems in this facility contains approximately 23,600  pounds of ammonia inventory for this process.  Two refrigeration systems operate in individual cold storage warehouses on the property.  Plant 2 has an ammonia charge of approximately 6100 pounds and Plant 3 has an ammonia charge of approximately 17,500.\n\n\nAtlas Cold Storage is committed to safe management and operation of the closed Ammonia Refrigeration System.  Maintenance employees are trained to observe operational procedures designed to be as fail-safe as possible to prevent accidental release of ammonia at any time.  Should any accidental release occur, all refrigeration employees are certified Emergency Hazardous Material Responders and are required to observe safe emergency response procedures.  They are trained to work in conjunction with the local Emergency Planning Commission to minimize the impact of any accidental releases.\n\nAs part of Atlas Cold Storage's safety programs, we have adopted the OSHA Process Safety Management Plan as required and is an integral part of our base safety manual.  The OSHA PSM Program has been implemented and covers the entire scope of safe operation of the ammonia refrigeration system from start-up and normal operations to potent"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46288,
      "SummaryText": "ial emergency response operations and turn around after emergencies.  Normal operations rely on the following:                                                              \n? The Maintenance Management Procedures are used to perform preventative\n maintenance and to maintain records of all maintenance work performed.  This\n helps to ensure that the closed ammonia system continues to work safely,\n reliably and efficiently in the originally intended manner.\n \n? Any set specifications of systems temperature, pressure, level or power \n interruption, that are exceeded or violated will normally trigger an alarm and\n safety shutdown.  Maintenance technicians are notified of a deviation from\n normal operational specifications through indicator or alarm systems.\n \n? In the event of deviations, technicians are trained to analyze the situation,\n follow personal safety procedures at all times, determine that everything\n is under control and correct problems and/or deviations.\n \n? If a problem cannot be corrected immediately, the equipment needing\n repair service will be safely locked out of service until such time as\n repairs have been completed.\n  \n? If a problem cannot be safely handled by the Maintenance Personnel, procedures are in place to obtain the required resources to correct the situation.\n \n During the past five years one accidental release at this facility that exceeded the reportable quantity of 100 pounds was reported to the appropriate agencies.   \n \n \n EMERGENCY READINESS INCLUDES THE THE FOLLOWNG PROGRAMS:\n \n? Written procedures for emergency operations include emergency evacuation\n procedures, emergency shutdown instructions, emergency response training\n, emergency response coordination with the LEPC, regulatory agency\n notification and other pertinent information.\n \n? The Emergency Response Plan is a coordinated effort with the LEPC  for managing emergency responses.                        and provides emergency contact information.  It also provides forms for"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 46288,
      "SummaryText": " logging                                                                    emergency operations from beginning to end of these operations and forms                                                                             to facilitate a systematic incident investigation and corrective measures to                                                                       prevent recurrence of a similar incident.\n \n? The Emergency Response Training program includes all refrigeration\nemployees and close working relationship local emergency responders.  This establishes an effective\nand informed mutual emergency response team that is familiar with system and\npotential hazards in this facility.\n\nIt is the intent of Atlas Cold Storage to not only meet any regulatory requirement, but also take a pro-active approach into implementing these requirements as part of a working safety plan.  Atlas Cold Storage is in a constant review process of its operations and industry standards to provide a safe working environment for our employees, customers and neighbors."
    }
  ]
}