{
  "FacilityID": 4630,
  "FacilityName": "Perdue Farms Incorporated, Bridgewater Facility",
  "FacilityStr1": "100 Quality St.",
  "FacilityStr2": null,
  "FacilityCity": "Bridgewater",
  "FacilityState": "VA",
  "FacilityZipCode": "22812",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51165",
  "LEPC": "Harrisonburg Joint LEPC",
  "FacilityLatDecDegs": "38.388194",
  "FacilityLongDecDegs": "-78.966806",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "SE",
  "FacilityURL": "www.perdue.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 139297006,
  "ParentCompanyName": "Perdue Farms Incorporated",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Perdue Farms Incorporated",
  "OperatorStr1": "31149 Old Ocean City Road",
  "OperatorStr2": null,
  "OperatorCity": "Salisbury",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21802",
  "OperatorZipCodeExt": "1537",
  "RMPContact": "Sid Schultz",
  "RMPTitle": "Complex Manager",
  "FTE": 800,
  "OtherEPAFacilityID": "VAD988225827",
  "EPAFacilityID": "100000056066",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1995-10-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Bridgewater, VA",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 38.38858,
  "FRS_Long": -78.9693,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5393,
      "AltID": "Poultry Plant Refrig",
      "FacilityID": 4630,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5506,
          "ProcessID": 5393,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5788,
          "ProcessID": 5393,
          "ChemicalID": 56,
          "Quantity": 60321.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505788,
          "ProcessID": 5393,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4630,
      "SummaryText": "Executive Summary for Perdue Farms Bridgewater, Virginia, Food Processing Plant\n\nDESCRIPTION OF THE FACILITY AND THE REGULATED SUBSTANCE:\nPerdue Farms Incorporated, founded in 1920, is the largest poultry producer in the Northeast and the third largest in the United States.  Headquartered in Salisbury, Maryland, the family owned privately held company has operations in 14 states.  Twenty processing facilities produce about 50 million pounds of poultry products each week.  Perdue Farms also has grain storage and merchandising operations and is ranked among the top 20 largest U.S. grain companies.  Perdue also manufactures edible oils, speciality feeds, livestock feed ingredients and premium pet food ingredients.\n\nThe Perdue Farms Bridgewater facility is located in Rockingham County, Virginia, in the town of Bridgewater.  The facility is a further poultry processing plant which employs approximately 800 assocaites to receive chicken and turkey meat plus other raw ingredients to form, prepare and package for distribution to the market place.  The facility normally operates 24 hours per day, 5 days per week.\n\nThe regulated substance at the Bridgewater facility, covered by 40 CFR Part 68, is anhydrous ammonia (R-717).  The facility utilizes anhydrous ammonia as an integral part of its refrigeration system.  The refrigeration sytem consists of several storage vessels, compressors, condensers, piping and air handling units throughout the facility in order to maintain proper food safety temperatures.  The total quantity of anhydrous ammonia on-site is 60,321 pounds distributed throughout the refrigeration components.\n\n\nACCIDENTIAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES:\nAs a concerned member of the community, the company takes its role as a responsible corporate citizen very seriously.  All Perdue facilities are operated to protect employees, contractors and the public from injury and illiness, and to minimize environmental impact.  A company-wide safety and wel"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4630,
      "SummaryText": "lness program stresses safe work conditions and safe work practicies.  Perdue's policy is to inspect, maintain and operate equipment and facilities to prevent accidents, including the release of hazardous materials; and to train employees in prevention, as well as to prepare them to respond rapidly and effectively should an accident occur.\n\nPerdue Farms has developed and implemented a Spill Prevention Control and Countermeasures plan (SPCC) and a Process Safety Management plan (PSM) as part of an overall chemical management program.  The program involves local managers and a wide range of senior management personnel, including the Director of Environmental Services and the Director of Safety and Security.  Additionally, Perdue conducts regular safety meetings and provides a wide variety of environmental, health and safety training to its staff.\n\n\nGENERAL ACCIDENTIAL RELEASE PREVENTION PROGRAM:\nThe Perdue Farms Bridgewater facility maintains a Process Safety Management plan in accordance with the Occupational Safety and Health Administration (OSHA) regulation 29 CFR 1910.119.  The maintenance personnel at the facility utilize a preventative maintenance program for all the system components.  As part of the program, trained refrigeration personnel routinely inspect the refrigeration system operating parameters and conduct routine maintenance, as needed.\n\n\nWORST-CASE RELEASE SCENARIO:\nThe predicted worst-case scenario for the refrigeration system is the catastrophic failure of one of the High Pressure Receivers (HPR-3) located in the rear of the plant, at the compressor room.  The vessel has a maximum storage capacity of 29,677 pounds of anhydrous ammonia.  Using DEGRADIS dispersion modeling software, the calculated distance to the toxic endpoint is 1.16 miles, affecting residents, schools, parks, recreation areas and agricultural land.  The estimated population within the 1.16-mile radius is 4,259, based on information provided by the U.S. Census Bureau.\n\n\nALTERNATIVE"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4630,
      "SummaryText": " RELEASE SCENARIOS:\nThirteen alternative release scenarios were considered.  A total of four release scenarios were chosen as most probable and were further examined.  The four refrigeration system components that were deemed to cause a probable alternative release scenario are:\n\n     1> Pressure Relief Valve failure on the High Pessure Receiver (HPR-2)\n     2> Pressure Relief Valve failure on the Recirculator Receiver (RR-HS4)\n     3> Pump Seal failure on the Recirculator Receiver (RR-HS4)\n     4> Puncture/Line Break on the High Pressure Receiver (HPR-3)\n\nAlternative scenario #1 (Pressure Relief Valve failure on the High Pressure Receiver, HPR-2) release rate was calculated to be 44.51 pounds per minute.  Based on a 5-minute response time, the distance to the toxic endpoint was determined to be 0.07 miles, affecting a population of approximately 13.\n\nAlternative scenario #2 (Pressure Relief Valve failure on the Recirculator Receiver, RR-HS4) release rate was calculated to be 48.07 pounds per minute.  Based on a 5-minute response time, the distance to the toxic endpoint was determined to be 0.07 miles, affecting a population of approximately 13.\n\nAlternative scenario #3 (Pump Seal failure on the Recirculator Receiver, RR-HS4) release rate was calculated to be 352.9 pounds per minute.  Based on a 10-minute response time, the distance to the toxic endpoint was determined to be 0.11 miles, affecting a population of approximately 32.\n\nAlternative scenario #4 (Puncture/Line Break on the High Pressure Receiver, HPR-3) release rate was calcuated to be 853.19 pounds per minute.  Based on a 15.21-minute response time, the distance to the toxic endpoint was determined to be 0.75 miles, affecting a population of approximately 316.\n\n\nFIVE-YEAR ACCIDENT HISTORY:\nPerdue's Bridgewtaer facility has not had a serious accident involving anhydrous ammonia that caused death, associate injuries and property or environmental damage within the last five years.\n\n\nEMERGENCY RESPONSE PROGRAM"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4630,
      "SummaryText": ":\nIn the event of an emergency involving our refrigeration system, Perdue's Bridgewater facility has a well defined incident command system.  The written Emergency Response program includes procedures to safely evacuate the facility, minimize and/or contain the release and notify the appropriate local fire department and LEPC officials.  Perdue continues to train our associates on hazardous responses and awareness, and conducts mock training routinely.  Perdue officials have discussed the company's response program with our local LEPC and fire department representatives.\n\nAs part of our Risk Management Plan (RMP), Perdue Farms has developed a RMP Communication Plan.  The goals of the plan are to:\n\n     1> Educate the public on the potential risks of regulated substances used by Perdue;\n     2> Respond to any concerns that RMP disclosures may cause with honest, fact-based communications;\n     3> Be fully prepared to effectively respond to any accidental release scenario.\n\nProactive materials about disclosure information, how the company is prepared to deal with an incident, and how the community should respond; and a process for announcing that an incident has occured (to be used as needed) are being prepared.  In addition, training and information materials for Perdue managers and employees, community officials, civic groups, media, environmental groups, emergency response personnel and the public in general will be available.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY:\nAs part of Perdie's continual improvement philosophy, all Perdue facilities continue to identify and update system components and techniques to ensure safety."
    }
  ]
}