{
  "FacilityID": 4632,
  "FacilityName": "Peach State Chemical",
  "FacilityStr1": "511 Hillcrest Ind. Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Macon",
  "FacilityState": "GA",
  "FacilityZipCode": "31204",
  "Facility4DigitZipExt": "3473",
  "FacilityCountyFIPS": "13021",
  "LEPC": "Georgia Dnr",
  "FacilityLatDecDegs": "32.845389",
  "FacilityLongDecDegs": "-83.671972",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Forehand Chemical Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dwayne Forehand",
  "OperatorStr1": "511 Hillcrest Ind. Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Macon",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31204",
  "OperatorZipCodeExt": "3473",
  "RMPContact": "Dwayne Forehand",
  "RMPTitle": "President",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000056182",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-03-19 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-08-31 00:00:00",
  "DeRegistrationEffectiveDate": "2012-08-31 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 32.84579,
  "FRS_Long": -83.6729,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "EPA has administratively marked this facility as 'Closed'.",
  "_processes": [
    {
      "ProcessID": 5395,
      "AltID": "Hydrofluoric Acid Area",
      "FacilityID": 4632,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5508,
          "ProcessID": 5395,
          "NAICSCode": "325998",
          "_desc": {
            "NAICS_CODE": "325998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5790,
          "ProcessID": 5395,
          "ChemicalID": 55,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505790,
          "ProcessID": 5395,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4632,
      "SummaryText": "Executive Summary for Peach State Chemical\n\n1.Accidental Release Prevention and Emergency Response Policies\nWe at Peach State Chemical are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as safety information, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n2.The Stationary Source and the Regulated Substances Handled\nWe have one regulated substance present at our facility.  Hydrofluoric Acid, 70% Solution.\n\nThe maximum inventory of hydrofluoric acid, 70% solution at our facility is 40,000 pounds. This regulated substance will be stored and handled in 55-gallon plastic (polyethylene) drums. These drums were manufactured and tested according to the requirements of DOT 49CFR 178. Specifications for Plastic Drums.  \n\n3.The Worst Case Release Scenario and the Alternative Release Scenario. including administrative controls and mitigation measures to limit the distances for each reported scenario\nTo perform the required offsite consequence analysis for our facility, we used EPA's RMP*Comp.  The worse case scenario will be a liquid spill and vaporization of hydrofluoric acid 70%. We are considering Dike, Enclosure, Drains and a Sump as passive mitigation systems available for the scenario: The Alternative release scenario will be a liquid release of hydrofluoric acid, 70% from a plastic drum damaged with a forklift during handling operations. For the calculations of the toxic endpoint we considered the same passive mitigation components plus sprinkler system, neutralization and toxic fumes scrubber as active mitigation components available. Our results from the worse case scenario indicate that we could have public receptors within the distance to the endpoint, therefore we are repo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4632,
      "SummaryText": "rting a prevention program level 2 for our facility. \n\n4.The General Accidental Release Prevention Program Level 2 and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA. The following sections briefly describe the elements of the release prevention program level 2 that is in place at our stationary source.\n\nProcess Safety Information\nPeach State Chemical maintains a detailed record of safety information that describes the chemical hazards (MSDS), operating parameters and equipment designs associated with the process that involves our regulated substance.\n\nProcess Hazard Analysis\nOur facility conducted a comprehensive study to ensure that hazards associated with our process were identified and controlled efficiently. The methodology used to carry out this analysis was Industry Check list method as recommended by CMA's Warehouse Assessment Protocol.  The study was conducted by a team of qualified personnel with expertise in engineering and process operations and will be revalidated at intervals of three years.  Any findings related to the hazard analysis were addressed in a timely manner.  The most recent PHA/update was performed on 06/01/1999.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Peach State Chemical maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operation, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nPeach State Chemical has a comprehensive training program in place to ensure that employees who are operating the process with the regulated substance are competent in the operating procedures associated with this process.  Refresher trai"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4632,
      "SummaryText": "ning is provided at least every year and more frequently as needed.\n\nMechanical Integrity\nPeach State Chemical carries out highly documented maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks includes among others; acid transfer pumps, and hoses. Qualified personnel carry out maintenance operations with previous training in maintenance practices. Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nCompliance Audits\nPeach State Chemical will conduct internal audits on a regular basis to determine whether the provisions set out under the RMP rule are properly implemented.  The most recent compliance audit was conducted on 06/15/1999.  These audits will be carried out at least every 3 years and any corrective actions required as a result of the audits will be implemented in a safe and prompt manner.\n\nIncident Investigation\nPeach State Chemical will investigate any incident that could result in a catastrophic release of a regulated substance.  These investigations will be taken to identify the situation that lead to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports will be retained for a minimum of 5 years.\n\n5.Five-year Accident History\nPeach State Chemical has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n6.Emergency Response Plan\nPeach State Chemical is a small operation with few employees. We feel it is more appropriate to have in place an emergency action plan that will ensure employee safety, rather than an emergency response plan. We will adopt a policy as a non-responding facility. Peach State Chemical will provide all required information regarding inventories and characteristics of "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4632,
      "SummaryText": "the regulated substance that have in our facility to the local emergency planning commission (LEPC) to be included in the community emergency response plan."
    }
  ]
}