{
  "FacilityID": 46407,
  "FacilityName": "SSWI INC",
  "FacilityStr1": "510 Pride Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Hammond",
  "FacilityState": "LA",
  "FacilityZipCode": "70401",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22105",
  "LEPC": "Tangipahoa Parish LEPC",
  "FacilityLatDecDegs": "30.516944",
  "FacilityLongDecDegs": "-090.423333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "C1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "SSWI INC",
  "OperatorStr1": "510 Pride Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Hammond",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70401",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000196771",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-09-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-09-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-09-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-03-29 00:00:00",
  "DeRegistrationEffectiveDate": "2017-03-14 00:00:00",
  "AnniversaryDate": "2011-09-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 67155,
      "AltID": "Cold Storage",
      "FacilityID": 46407,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 88927,
          "ProcessID": 67155,
          "ChemicalID": 56,
          "Quantity": 11900.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 68755,
          "ProcessID": 67155,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 39437,
              "Process_NAICS_ID": 68755,
              "SafetyReviewDate": "2006-03-28 00:00:00",
              "PHA_Date": "2006-05-15 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2006-08-15 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2006-05-15 00:00:00",
              "TrainingReviewDate": "2006-05-20 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2006-05-31 00:00:00",
              "EquipmentInspectionDate": "2006-03-18 00:00:00",
              "EquipmentTested": "Components/Equipment in the Compressor Room",
              "ChangeMgmtDate": "2006-05-15 00:00:00",
              "ChangeMgmtReviewDate": "2006-05-15 00:00:00",
              "PreStartupReviewDate": "2006-05-15 00:00:00",
              "ComplianceAuditDate": "2006-07-15 00:00:00",
              "AuditCompletionDate": "2006-08-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2006-05-15 00:00:00",
              "HotWorkPermitReviewDate": "2006-05-15 00:00:00",
              "ContractorSafetyReviewDate": "2006-05-15 00:00:00",
              "ContractorSafetyEvalDate": "2006-05-15 00:00:00",
              "CBI_Flag": 0,
              "Description": "This facility opened in March 2005 and has been designed with various safety features. During the design phase and construction of the facility, the plant including the refrigeration system was engineered with safety features to prevent accidents. The plant's owner, safety manager and the maintenance manager of this facility assisted in the design and engineering of the facility.",
              "_chemicals": [
                {
                  "PrimaryKey": 57275,
                  "PreventionProgram3ID": 39437,
                  "ProcessChemicalID": 88927
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 46407,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Hammond Fire Department",
    "CoordinatingAgencyPhone": "9855423473",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46407,
      "SummaryText": "A. Description of Accidental Release Prevention and Emergency Policies\nSSWI INC of Hammond Louisiana recognizes management's responsibility in the protection of its employees, equipment, property, the community, and environment. The control of accidents has been and will continue to be a basic responsibility of all personnel in the company.\n\nTo accomplish SSWI of Hammond La's goal in controlling accidental losses, the facility has established a comprehensive Safety Program that not only includes government mandated safety programs, but also includes safety programs and activities that have been identified industry wide for the prevention of accidents. The objectives of SSWI of Hammond Louisiana's Safety Program are to achieve maximum productivity, efficiency and safety performance.\n\nOne of the activities associated with SSWI of Hammond Louisiana's Safety Program is the development and implementation of accidental release prevention and emergency response program. These programs are designed to comply with OSHA's Process Safety Management (PSM) standard (Process Safety Management of Highly Hazardous Chemicals, Title 29 Code of Federal Regulations 1910.119) and the EPA's Risk Management Program (RMP) Regulation (Risk Management Programs for Accidental Release Prevention, Title 40 Code of Federal Regulations Part 68). SSWI Inc of Hammond La's Safety Manager is responsible for the management of the accidental release prevention and emergency response programs.\n\nThe purpose of the accidental release prevention and emergency response program is to prevent the release of ammonia and to minimize the consequences of ammonia releases. The accidental release prevention and emergency response program is also established for the prevention and response to fires, explosions, terrorist acts, and other types of incidents that may result in catastrophic accidents. As a whole these programs are designed to prevent accidental fatalities, injuries and illnesses, and any physical damage"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46407,
      "SummaryText": ".\n\nB. Stationary Sources and Regulated Substances Handled\nThe facility operates a [NAICS#49312 (Refrigerated Warehousing and Storage Facility)] freezer warehouse at 510 Pride Boulevard Hammond, La 70401. An ammonia refrigeration system is in operation to maintain the storage and holding temperatures for neopryne products.\n\nThe facility operates an (compound) ammonia refrigeration system, which provides cooling throughout the facility. The amount of anhydrous ammonia (CAS#7664-41-7) contained in this refrigeration system is not in the excess of the threshold quantity of 10,000 pounds yet. SSWI of Hammond Louisiana's inventory in the refrigeration system is 11,900 pounds. Due to the volume of ammonia and with the remote possibility of a release of ammonia from the refrigeration system, which could pose a risk to offsite public receptors and have offsite impacts, our refrigeration system is subject to the Program Level 3 requirements of EPA's RMP.\n\nC. Summary of Worst-case and Alternative Release Scenarios\n1. Worst-Case\nThe worst-case release scenario at that facility involves the release of  6,400 pounds of ammonia over a 10-minute period due to over-filling high pressure receiver during a pump-down. The maximum level of vessel HPR  is limited to 80% of the vessel. \n\nThe worst-case scenario is unlikely for the following reasoons:\n-Industry standards and quality controls were followed in the design and construction of the equipment in the ammonia refrigeration system.\n-Ammonia is not corrosive in this process.\n-Pressure safety relief valves limit the operating pressures in this receiver.\n-The facility utilizes a preventive maintenance program to maintain the on-going integrity of the vessel.\n-The facility has a training program that insures only qualified personnel operate the system.\n-The facility requires that all PSM elements as well as company maintenance policies to be followed.\n-The facility has coordinated its emergency response system with the local fire depart"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46407,
      "SummaryText": "ment, and trains with them at least once a year.\n\n2. Alternative Release Scenarios\nA. First Alternate Release Scenario\nThe release of 190 pounds per minute of anhydrous ammonia over a 10 minute period due to a puncture of a 1/2-inch {hi-pressure} schedule 80 pipe feeding an evaporator valve station on the roof with pumped liquid. This scenario could occur during a maintenance procedure or unsecured equipment striking this line. The modeled OCA (Off-site Consequece Analysis) for this scenario has a radius of less than 0.6 miles. The population impacted by this scenario is 7 residents and surrounding businesses.\n\nThe alternate release scenarios are unlikely for the following reasons:\n-SSWI of Hammond La has policies to enforce only that competent personnel work on the system and has the power to remove any offending employee and/or contractor from the companies payroll and or contracts.\n-The system was designed using standard using standard practices and is maintained by rigid company standards.\n-The maintenance program includes a mechanical integrity audit system.\n-The maintenance program includes a shift monitoring procedure of the refrigeration system by fully trained personnel.\n-Low level controls, sensors for ammonia monitoring, and maintaining a safe ammonia liquid supply to the vessels acts as active mitigation before the release poses a threat to offsite receptors.\n-The piping is routed to avoid impact from traffic sources. A majority of the pipes are located on the roof.\n-Forklift operators have been trained and certified by the company, and trained in the locations and operations of the ammonia refrigeration evaporators that are located within their working areas.\n-Industry standards were followed for the manufacturing of the ammonia vessels, and the vessels were supplied by a reputable company meeting the guidelines spelled out in the Company's Process Safety Management's Contractors requirements as well as requirements for chemical suppliers.\n-The facility"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 46407,
      "SummaryText": " requires that all PSM elements as well as company maintenance policies be followed.\n-The facility has trained emergency response personnel and established response procedures, so on site personnel can respond quickly to isolate any potential ammonia releases.\n-The facility maintains equipment to support the emergecy response teams so they can address vessel repair specific to ammonia in the event of a leak.\n-Only trained and authorized personnel have access to the Ammonia System.\n-House keeping and maintenance practices are enforced to keep the area and plant clear of debris.\n\nD: Description of Accidental Release Prevention Program\nThe prevention program consists of the following elements:\n\n1. Employee Participation:\nThis program ensures that the employees are involved in establishing and implementing the prevention program. Employees are also invloved when a process hazard analysis is conducted. The program also ensures that the employees have complete access to the program on company property. Regularly scheduled meetings are held to discuss any concerns.\n2. Process Safety Information:\nWritten information has been collected which enables the employees or members of the general public to identify and understand the potential hazards in the refrigeration system. This written information includes the MSDS program as well as a description of the design of the refrigeration system. The written information also includes the MSDS on the ammonia in the refrigeration, standards, guidelines, and basic information about the chemistry of the refrigeration system, and the thermodynamic properties of the refrigeration system.\n3. Process Hazards Analysis:\nA formal analysis using the What-If/Checklist Technique was conducted prior to the start-up of the system to identify potential hazards. For each Management of Change and at regularly scheduled intervals, a Process Hazard Analysis will be conducted and the corporate review team will review its recommendations.\n4. Operating Pro"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 46407,
      "SummaryText": "cedures:\nWritten operating procedures have been developed that describes the steps to be followed to operate the refrigeration system safely. Every Management of Change and any operation involving the refrigeration system that was not previously identified will have an operating procedure developed and implemented for the actions required.\n5. Training\nA training scheduled has been established and implemented which ensures that all employees understand their responsibility during an emergency situation, whether its evacuating the building, reponding to a release, or various other responsibilities during and after an ammonia release. Additional training schedules have been established and implemented for the operators of the ammonia refrigeration system.\n6. Contractors:\nAll contractors will be screened and evaluated prior to any work on or near the ammonia refrigeration system. The contractors will also be periodically evaluated to ensure they perform their work duties safely.\nAll contractors that work on the refrigeration system will also be required to have an ongoing safety program that includes compliance to 29 CFR 1910.120, 1910.38, 1910.119, AND 1910.134.\n7. Pre-Startup Safety Review:\nA Pre-Startup Safety Review will be completed for all new ammonia projects prior to its start-up to verify that all safety programs are established, all the training has been completed by all individuals involved, and construction has been completed according to design standards and guidelines.\n8. Mechanical Integrity:\nA Mechanical Integrity program is established to ensure that the ammonia refrigeration system is built to the established codes and is maintained to the manufacturer's recommendations. Preventive maintenance procedures are also established to ensure the refrigeration system is maintained properly to minimize unexpected breakdown or failures.\n9. Hot Work Permit:\nA hot work program has been established and implemented so that any cutting, welding, or burning operation "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 46407,
      "SummaryText": "on the ammonia refrigeration system must be authorized by the general manager or the maintenance manager.\n10. Management of Change:\nThese procedures ensure that the general manager and the maintenance manager properly review all changes made to the systems.\n11. Incident Investigation:\nThese procedures ensure that any incident (and near misses) are investigated, reviewed, and documented using an investiation team.\n12. Compliance Audit:\nAn audit of the Process Safety Management Program and Risk Management Plan will be performed on a regular schedule to ensure that the program is being continually implemented and working properly.\n\nE. Five-year Accident History\nNo ammonia release incidents have occurred at this facility.\n\nF. Description of the Emergency Response Program\nAn Emergency Response Program has been established an implemented at the facility. The program contains procedures describing hoe the facility will respond to ammonia leaks, as well as other emergencies, including evacuation procedures. The emergency response program consists of the following elements:\n1. Organization Plan and Responsibilities\n2. Communication Procedures\n3. Detailed Action Plans\n4. Fire Assistance Procedures\n5. Emergency Medical Treatment Procedures\n6. Evacuation Plans\n7. Description of Outside Assistance\n8. Site Re-Entry Procedures\n9. Training Program and Drills\n10. Risk Management Plan\n11. Process Management Plan"
    }
  ]
}