{
  "FacilityID": 4644,
  "FacilityName": "PVS TECHNOLOGIES, INC. (AUGUSTA)",
  "FacilityStr1": "2404 DOUG BARNARD PARKWAY",
  "FacilityStr2": null,
  "FacilityCity": "AUGUSTA",
  "FacilityState": "GA",
  "FacilityZipCode": "30906",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13245",
  "LEPC": "Richmond County LEPC",
  "FacilityLatDecDegs": "33.342778",
  "FacilityLongDecDegs": "-81.951111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 151369303,
  "ParentCompanyName": "PVS CHEMICALS, INC.",
  "Company2Name": null,
  "CompanyDUNS": 5630273,
  "Company2DUNS": 0,
  "OperatorName": "TOM BASILE",
  "OperatorStr1": "2404 DOUG BARNARD PARKWAY",
  "OperatorStr2": null,
  "OperatorCity": "AUGUSTA",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30906",
  "OperatorZipCodeExt": null,
  "RMPContact": "TOM BASILE",
  "RMPTitle": "PLANT MANAGER",
  "FTE": 5,
  "OtherEPAFacilityID": "GAD 001 309 749",
  "EPAFacilityID": "100000057911",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2001-10-15 00:00:00",
  "DeRegistrationEffectiveDate": "2001-06-28 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 33.36331,
  "FRS_Long": -81.97114,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5407,
      "AltID": "Liquid Ferric Chloride",
      "FacilityID": 4644,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5520,
          "ProcessID": 5407,
          "NAICSCode": "32518",
          "_desc": {
            "NAICS_CODE": "32518",
            "NAICS_DESCRIPTION": "Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5805,
          "ProcessID": 5407,
          "ChemicalID": 62,
          "Quantity": 360000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505805,
          "ProcessID": 5407,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4644,
      "SummaryText": "PVS Technologies, Inc. is a manufacturer and marketer of chemicals, i.e., ferrous and ferric chloride solutions, used in the treatment of industrial and municipal water.  Liquid ferric chloride is primarily used in water/wastewater treatment and phosphate removal.  PVS Technologies, Inc. operates a ferric chloride manufacturing facility that is located on 2404 Doug Barnard Parkway, Augusta, Georgia 30396.\n\nThe ferric chloride production process uses liquid chlorine as a reagent.  Chlorine, the 17th element on the periodic table, is commonly used in the purification of potable water.  Other uses include hospital sanitation, swimming pool treatment, etc.  Chlorine is also a basic ingredient in the production of phamaceutical and agricultural products as well as consumer products such as vinyl chloride siding for houses, PVC pipes for plumbing, etc.  The same properties that make chlorine valuable as a commodity also necessitate the adoption of safety precautions in its handling.\n\nIn concert with our overall commitment to Responsible Care, it is our policy to design, operate and maintain our manufacturing facility in such a manner that minimizes any risks to our employees, our local community and the environment.  In brief, our goal is as follows: \"No accidents, injuries or environmental mishaps.\"  The PVS Technologies-Augusta Facility has no accidents as defined under the RMP rule in the previous five years.\n\nIn addition to our pledge for full compliance with all applicable federal, state and local rules and regulations, we have been actively engaged in developing and applying not only innovative and sound technology but also safe operating standards to our production process.  Our chlorine unloading system is designed in accordance with the Chlorine Institute standards.  We conduct Hazard and Operability (HAZOP) studies on all chlorine related process designs and modifications.  Pre-startup safety reviews are also performed whenever necessary.  Ambient chlorine senso"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4644,
      "SummaryText": "rs (local and perimeter) and automatic shutoff valves are in place in order to detect and minimize any chlorine releases to the atmosphere.  A two-stage scrubber system is installed for proper neutralization of any residual levels of chlorine from our process.  Routine safety audits (tailored to the Dupont Safety Audit Program) are conducted by both supervisors and plant employees.  A preventive maintenance program is in place for properly planning and documenting the repair and/or maintenance of our process equipment.  The employee training program, including the annual PVS 32-Hour training requirement, the OSHA 24-Hour HAZWOPER training (initial and refresher) and others, are conducted in order to maintain and/or enhance process safety.  Our Emergency Response Plan includes specific guidelines for getting the right people (both on-site and off-site) to the scene quickly.\nIn the event of an emergency involving a chlorine release, PVS Technologies personnel are trained in measures to control the release.  In addition, our Emergency Response Plan has been provided to local response organizations for inclusion into the Community Emergency Response Plan. \n\nThe regulated material, i.e., liquid chlorine, is brought to the manufacturing facility by railcars that are unloaded directly into the process.  Access to the site is restricted to authorized facility employees, supervisory staff and approved contractors.  The maximum inventory of chlorine stored at the Augusta facility is 360,000 pounds (two railcars).  One railcar is hooked up to the production process at any time.\n\nThe worst-case scenario, as required by USEPA, involves the failure of a 90-Ton chlorine railcar, thus releasing the entire content to the atmosphere within ten minutes.  The release would have off-site consequences.  The alternate case scenario involves the release from a ruptured chlorine transfer hose at the railcar unloading station.  The chlorine ambient system will shut off the automatic valves a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4644,
      "SummaryText": "t the car and the reactors.  The full chlorine content of the section in between the two valves, i.e., 149 pounds, is instantaneously released to the atmosphere.  The liquid chlorine flashes immediately to vapor and fine droplets and is carried downwind.  This release wouldl have off-site consequences.\n\nThrough the use of employee suggestions, periodic safety meetings, safety audits and formal process safety reviews, PVS Technologies continuously evaluates the safety of our processes and operating procedures and makes improvement as appropriate.  No major process changes are planned."
    }
  ]
}