{
  "FacilityID": 46572,
  "FacilityName": "Miller Breweries East, Inc. (Eden, NC)",
  "FacilityStr1": "863 East Meadow Road",
  "FacilityStr2": null,
  "FacilityCity": "Eden",
  "FacilityState": "NC",
  "FacilityZipCode": "27288",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37157",
  "LEPC": "Rockingham County LEPC",
  "FacilityLatDecDegs": "36.520833",
  "FacilityLongDecDegs": "-079.712500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.millerbrewing.com",
  "FacilityEmailAddress": "hancock.quinton@mbco.com",
  "FacilityDUNS": 149390416,
  "ParentCompanyName": "Miller Products Company",
  "Company2Name": null,
  "CompanyDUNS": 149390267,
  "Company2DUNS": 0,
  "OperatorName": "Miller Breweries East, Inc.",
  "OperatorStr1": "P. O. Box 3327",
  "OperatorStr2": null,
  "OperatorCity": "Eden",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27288",
  "OperatorZipCodeExt": null,
  "RMPContact": "Quinton Hancock",
  "RMPTitle": "Environmental Coordinator",
  "FTE": 664,
  "OtherEPAFacilityID": "27288MLLRB863EA",
  "EPAFacilityID": "100000166839",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "03116T16",
  "SafetyInspectionDate": "2003-09-03 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-09-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-09-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-09-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-09-13 00:00:00",
  "DeRegistrationEffectiveDate": "2016-08-30 00:00:00",
  "AnniversaryDate": "2011-09-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 36.51499,
  "FRS_Long": -79.71573,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "12.2",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 67327,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 46572,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 68928,
          "ProcessID": 67327,
          "NAICSCode": "31212",
          "_desc": {
            "NAICS_CODE": "31212",
            "NAICS_DESCRIPTION": "Breweries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 89105,
          "ProcessID": 67327,
          "ChemicalID": 56,
          "Quantity": 100000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 589105,
          "ProcessID": 67327,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46572,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe Miller Brewing Company is committed to promoting a safe working environment and has developed and implemented several programs to ensure chemical safety. The facility operates an ammonia refrigeration process and has several methods for ensuring employee and public safety associated with this process.  The facility has developed procedures, plans and policies for the operation of the ammonia process and for dealing with unexpected accidental releases.  The Miller Brewing Company has implemented and regularly updates a process safety management program which enhances safety by regular maintenance and inspections, hazard analysis, compliance audits, employee and contractor training, employee participation, ammonia monitoring/detection, and other activities.  The Miller facility has an Emergency Response Team complete with state-of-the-art emergency response equipment.  The team is trained to quickly and effectively respond to a release of hazardous materials.  The facility also has emergency response procedures and plans to promote chemical safety in the event of an emergency situation.\n\nThe Miller Brewing Company is engaged in the beer production business.  The facility consists of several buildings where brewing processes are conducted.  As part of the brewing process, an ammonia refrigeration system is utilized.  Due to the quantity of ammonia maintained on-site, the facility is subject to the Risk Management Program regulations which are meant to promote safety at the facility and general public level.\n\nA worst-case release scenario was modeled using computer software to determine the greatest impact a release of ammonia from the facility could reasonably cause.  This scenario is based on a complete and total release of ammonia from the largest ammonia vessel located at the facility. Computer modeling was used to reasonably evaluate the impacts from such a release. Pursuant to the April 9, 2004 revisions (69 FR 18819) to Section 68.155(c) of"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46572,
      "SummaryText": " the RMP rule, details of the off-site consequence analysis of the worst case release scenario are included in the individual elements of the RMP Plan.\n\nAn alternative release scenario was also modeled using the EPA lookup tables.  The alternative release scenario is based on a release or small leak  (i.e. 11/16 inch) in a relief valve associated with the Kathabar unit at the facility.  The alternative release scenario is a scenario which is more likely to occur than the worst-case scenario. Computer modeling was used to reasonably evaluate the impacts from such a release. Pursuant to the April 9, 2004 revisions (69 FR 18819) to Section 68.155(c) of the RMP rule, details of the off-site consequence analysis of the alternate release scenario are included in the individual elements of the RMP Plan.\n\nIn the previous five years, the Miller facility has not had any accidental releases which resulted in any deaths, injuries, or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering-in-place, property damage, or environmental damage from the ammonia process.\n\nThe Miller facility is also subject to the Process Safety Management regulations under the Occupational Safety and Health Administration (OSHA).  As a result of these regulations, the Miller facility has implemented and regularly updates a program to further enhance process safety which involves operating procedures, training, mechanical integrity (maintenance related issues), pre-start-up-review, management of change, compliance audits, incident investigation, employee participation, hot work (welding) permits, and contractor safety.\n\nThe emergency response plan at the Miller facility is regularly updated and contains information and procedures relative to initial response, evacuation, fire response, chemical releases, severe weather, bomb threats, facility specific information (site maps/drawings, security, communication system, emergency organization), emergency/spill preve"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46572,
      "SummaryText": "ntion, post emergency procedures, training summary, and administrative management of change.  \n\nThe emergency response team receives extensive annual training to deal with an accidental release at the facility.  \n\nThe emergency response plan for the facility has been submitted to and coordinated with the Eden Fire Department, the Eden Police Department, Rockingham County Emergency Management, and the Moorehead Hospital."
    }
  ]
}