{
  "FacilityID": 4661,
  "FacilityName": "UNI-KOOL PARTNERS, INC",
  "FacilityStr1": "710 WEST MARKET ST",
  "FacilityStr2": null,
  "FacilityCity": "SALINAS",
  "FacilityState": "CA",
  "FacilityZipCode": "93901",
  "Facility4DigitZipExt": "3140",
  "FacilityCountyFIPS": "06053",
  "LEPC": null,
  "FacilityLatDecDegs": "36.68425",
  "FacilityLongDecDegs": "-121.672944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "UNI-KOOL PARTNERS, INC",
  "OperatorStr1": "710 WEST MARKET ST",
  "OperatorStr2": null,
  "OperatorCity": "SALINAS",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93901",
  "OperatorZipCodeExt": "3140",
  "RMPContact": "STEPHEN KOVACICH",
  "RMPTitle": "General Manager",
  "FTE": 35,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000056994",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-05-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-07-15 00:00:00",
  "DeRegistrationEffectiveDate": "2000-11-01 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 36.68116,
  "FRS_Long": -121.66455,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5425,
      "AltID": null,
      "FacilityID": 4661,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5538,
          "ProcessID": 5425,
          "NAICSCode": "32518",
          "_desc": {
            "NAICS_CODE": "32518",
            "NAICS_DESCRIPTION": "Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5824,
          "ProcessID": 5425,
          "ChemicalID": 56,
          "Quantity": 43000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505824,
          "ProcessID": 5425,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4661,
      "SummaryText": "    EXECUTIVE SUMMARY\n\na)  Release Prevention and Emergency Response Policies:\n\nThe Uni-Kool Ice House  Facility utilizes inspection procedures to review refrigeration equipment prior to seasonal startup and during operations.  These procedures identify potential sources of release and equipment corrections required to prevent these releases.  The equipment is reviewed by on-site personnel, mechanical engineers, and refrigeration contractors as required.\n\nOn-site personnel provide initial emergency response.  On-site personnel will make a preliminary assessment in the event of a release and will provide first response.  First response may include emergency equipment shutdown, system isolation, or controlled operation such as pump down to prevent or reduce and off-site release.  Emergency response for a major release event will be provided by local fire and police departments.\n\nEmergency response training will be conducted yearly and as required for new employees.  Records will be kept of all training performed at the site for a minimum of (5) years.\n\nTraining and familiarity with the companys Safety and Operating Procedures and Emergency Response Plan are required by all persons responsible for Ammonia refrigeration maintenance and operations.  Maintenance and operations personnel will also be required to become familiar with this RMP.\n\nb)   Description of Source and Substance Handled:\n\n     The Cooling Facility utilizes anhydrous ammonia as the refrigerant in their produce and cold storage            operations.\n\n    The refrigeration equipment consists of  a Block Ice Refrigeration system as a stationary source,  Stationary Vacuum Tubes ,  Pressure Cooler Room and Portable high side trailer skids with Vacuum Tubes for produce cooling operations\n\nc)    Worst case and Alternative Release Scenarios:\n\n     The worst case and alternative release scenarios were evaluated using the methodologies recommended in the RMP Off-site Consequence Analysis Guidance as prepared b"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4661,
      "SummaryText": "y the EPA.  As part of this guidance a Model Risk Management Program and Plan for Ammonia Refrigeration was prepared to identify specific release scenarios for ammonia-based refrigeration systems.  The atmospheric conditions used are as specified in this guidance and the regulations.\n\nThe worst case release considers the complete release of the maximum  charge in any individual system within a 10 minute period.   The alternative release considers the release of low-pressure liquid ammonia from a flange or connection leak on the piping system outside the building.  No mitigation measures are considered for each release.  \nAs a result of the off-site consequence analysis,  administrative and passive controls limit the release of the Ammonia in the system. For the worst case scenario, gas is released for a period of 10 minutes,  the maximum distance to the toxic endpoint was calculated at 12,250 ft.  For the alternative release scenario,  the maximum extent of the release is 308 feet off-site in any direction\n\nThe results of the worst case and alternative case release scenarios are presented in Section 4, Off-site Consequence Analysis.\n\nd)   Accidental Release Prevention Program\n\nAs described above, the program consists of pre-startup inspection, emergency response, and regular training.  A thorough review of the system including a Hazard and Operability Study (HazOp) was perfomed on June 9, 1999.  Equipment corrections and updates were made for those items determined to have the highest potential for off-site releases.  Safety and equipment operational training will be conducted annually and will include equipment operational procedures, emergency response procedures, review of Business Rssponse Plan procedures, and evacuation procedures.   \n\ne)     Five year Accident History:\n\nNo reportable releases or accidents relating to the release of ammonia have occurred  at the facility in the last five (5) years.\n\nf)   Emergency Response Program:\n\n    The facility has impleme"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4661,
      "SummaryText": "nted the State and County mandated Acutely Hazardous Materials Emergency Response Plan,or Business Response Plan (BRP).  This plan outlines procedures for emergency ammonia release response as well as general facility response.\n\ng)    PLANNED SAFETY IMPROVEMENTS\n     Safety improvements have been identified during the preparation of this program.  These improvements have been documented and a schedule will be developed for their implementation.  Some of these improvements include change out of pressure relief valves every five(years), restraints to portable equipment, and operational procedures."
    }
  ]
}