{
  "FacilityID": 46895,
  "FacilityName": "Springs Global US,Inc - Grace Complex",
  "FacilityStr1": "294 West Grace Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Lancaster",
  "FacilityState": "SC",
  "FacilityZipCode": "29721",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45057",
  "LEPC": "Lancaster County LEPC",
  "FacilityLatDecDegs": "34.708333",
  "FacilityLongDecDegs": "-080.849923",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.springs.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 611724613,
  "ParentCompanyName": "Springs Global US, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 611724613,
  "Company2DUNS": 0,
  "OperatorName": "Springs Global US, Inc.",
  "OperatorStr1": "PO Box 70",
  "OperatorStr2": null,
  "OperatorCity": "Ft. Mill",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29716",
  "OperatorZipCodeExt": null,
  "RMPContact": "Lanette Small",
  "RMPTitle": "Chief Chemist",
  "FTE": 2800,
  "OtherEPAFacilityID": "SCD 00316-3052",
  "EPAFacilityID": "100000147931",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "1460-0003-0014",
  "SafetyInspectionDate": "2003-08-26 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-10-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-10-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-10-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-11-06 00:00:00",
  "DeRegistrationEffectiveDate": "2007-10-26 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 34.70778,
  "FRS_Long": -80.85583,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "124000",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 67879,
      "AltID": "Water treatment",
      "FacilityID": 46895,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 69484,
          "ProcessID": 67879,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 89824,
          "ProcessID": 67879,
          "ChemicalID": 62,
          "Quantity": 110000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 589824,
          "ProcessID": 67879,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46895,
      "SummaryText": "It has always been the policy of Springs for the company and its subsidiaries to comply throughout the world with all laws and regulations involving environmental, safety, and health matters.  The Company is committed to continuous efforts to improve environmental, safety, and health performance.  This policy is embodied in the Springs of Achievement, especially the values of Planning for the Future and Personal and Family well being.  This policy applies not only to Springs, but also to each of its subsidiaries worldwide.\n\nFacility Overview:  The Springs Global US, Inc. facility in Lancaster, South Carolina, referred to as the Grace Complex, is a textile manufacturing and distribution facility producing printed, dyed, and finished fabric.  The facility is regulated under RMP due to on-site chlorine storage in excess of the RMP applicabillity threshold. Chlorine is used for water treatment which serves the purpose of treating process water used at the facility.  Chlorine is stored in a railcar having a capacity of 110,000 pounds.\n\nChemical safety Overview:  The facilities overall approach and commitment to chemical safety is demonstrated by 1) the existing management, training, procedure and maintenance systems in place at the facility, and 2) the hazard assessment, prevention program, and emergency response provisions implemented since the last RMP submittal specifically for chlorine.  The management structure and oversite to ensure safety is documented in the facility's RMP and includes compliance with applicable regulations, codes, and standards (OSHA PSM Standard and US EPA 40 CFR 68).\n\nRelease Scenarios:  Worst case and alternative release scenario assessments were conducted for the facilities single largest vessel based on US EPA's Offsite Consequence Analysis guidance.  The worst-case release scenario for chlorine is a 10 minute gaseous ground release of 110,000 pounds of chlorine and the alternate release scenario assumes a puncture in a supply line resultin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46895,
      "SummaryText": "g in a release rate of 2,000 pounds per minute of chlorine.  Public receptors were determined to be located within the impact zone of both the worst-case and alternative releases.  The resulting worst-case and alternative release impact zones were 9.9 miles and 0.6 miles, respectively.\n\nFive-Year Accident History:  Due to our excellent accident release prevention programs, Springs has had no RMP reportable accidents/releases of chlorine within the five years preceeding this submittal.\n\nPrevention Program:  The prevention program provisions are specifically intended to minimize the probability and/or consequence of any accidental chlorine release from the facility and include such measures as process hazard analysis, operating procedures, training, contractors, pre-startup safety, mechanical integrity, hot work pemit, management of change, incident investigation, emergency planning and response, and compliance audits.  The facility prevention program is an on-going system based on periodic training, incident investigations, audits, procedure revisions, and RMP updates as required to reflect facility change and RMP requirements.\n\nEmergency Response Program:  The facility's Emergency Response Program has been perfected to produce the maximum effective response in the least amount of time.  The facility has coordinated response with the local Fire Department to ensure that they will respond to any accidential release from the chlorine system.  The facility has also established a notification mechanism to ensure Chem Trec will be properly notified when any response is needed for a chlorine release.  Based on this coordination with the local emergency responders, the facility is not required to implement additional RMP emergency response program requirements.\n\nSafety Management and Change:  The facility is committed to ensuring its operations are safe and in accordance with all RMP requirements, and has established a senior manager responsible for RMP development, impleme"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46895,
      "SummaryText": "ntation, and compliance.  This manager is committed to maintain the safety of the RMP covered chlorine system through active adherence to the appropriate procedures and codes.  To ensure that the appropiate changes occur as necessary to maintain/improve safety, on-going hazard reviews, training, audits, maintenance, and investigations will be conducted as required by RMP.  Updates to the RMP will be completed as necessary in response to these activities.   \n\nSummary:  As documented in this submittal, the RMP for the facility has been maintained and updated in accordance with all 40 CFR 68 requirements and the facility has certified compliance.  Springs takes pride in and is committed to conducting business in strict conformity with all applicable laws in a safe and responsible manner.  The very highest priority is placed on the health and safety of Spring's associates and the community in which we conduct business.  Springs has been a leader in the industry with environmental and health and safety programs, as exemplified by the numerous awards that Springs has been presented."
    }
  ]
}