{
  "FacilityID": 47132,
  "FacilityName": "Firestone Polymers Pilot Plant",
  "FacilityStr1": "381 West Wilbeth Road",
  "FacilityStr2": null,
  "FacilityCity": "Akron",
  "FacilityState": "OH",
  "FacilityZipCode": "44301",
  "Facility4DigitZipExt": "2465",
  "FacilityCountyFIPS": "39153",
  "LEPC": "Summit County LEPC",
  "FacilityLatDecDegs": "41.042500",
  "FacilityLongDecDegs": "-081.539167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 101538549,
  "ParentCompanyName": "Bridgestone Procurement Holdings USA",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 1288109,
  "OperatorName": "Firestone Polymers, LLC",
  "OperatorStr1": "P.O. Box 26611",
  "OperatorStr2": null,
  "OperatorCity": "Akron",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44319",
  "OperatorZipCodeExt": "0006",
  "RMPContact": "Daniel F. Graves",
  "RMPTitle": "Manager Product Development",
  "FTE": 82,
  "OtherEPAFacilityID": "OHD000817239",
  "EPAFacilityID": "100000102177",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-03-09 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-08-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-11-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-11-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-11-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 41.03995,
  "FRS_Long": -81.54095,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 68213,
      "AltID": "Pilot Plant Operations",
      "FacilityID": 47132,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 69827,
          "ProcessID": 68213,
          "NAICSCode": "325212",
          "_desc": {
            "NAICS_CODE": "325212",
            "NAICS_DESCRIPTION": "Synthetic Rubber Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 90307,
          "ProcessID": 68213,
          "ChemicalID": 120,
          "Quantity": 70000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 120,
            "ChemicalName": "1,3-Butadiene",
            "CASNumber": "106-99-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 590307,
          "ProcessID": 68213,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 47132,
      "SummaryText": "THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nThe Firestone Polymers facility in Akron is a small-scale experimental laboratory and pilot plant located on a 35-acre tract four miles south of Akron?s downtown district. The plant is surrounded by light industrial and residential areas. We develop new synthetic rubber products that will ultimately be manufactured on a commercial scale at our facilities in Texas and Louisiana. These products include styrene-butadiene and polybutadiene rubber used in vehicle tires, plastics modification, adhesives, asphalt modification, and other products.\n\nAnnually, we pay over $200,000 in city, county and state taxes, spend over $1,000,000 in goods and services, and pay over $500,000 for freight and utility services.\n\nOne of the chemicals we use as a raw material brings us under the EPA Risk Management Program (RMP) Rule. This is 1,3-butadiene, identified as a flammable substance under the RMP rule. We have long had in place the types of accident prevention programs and emergency contingencies required by this rule and continue to believe that effective safety and environmental practices are an integral aspect of sustainable business.\n\nTHE ACCIDENTIAL RELEASE PREVENTION PROGRAM AND EMERGENCY RESPONSE POLICIES AT THE STATIONARY SOURCE\n\nIt is Firestone?s policy to meet or exceed all safety, health and environmental regulations and industrial standards that apply to our facility. We put significant resources into compliance with the OSHA Process Safety Management and related OSHA standards, and have expanded our programs to meet the specifics of the EPA RMP Rule. These programs help maintain extremely low levels of risks to our workers, contractors, the public, and the environment. This is achieved through a two-tier approach of defense-in-depth: (1) We minimize the possibility of a serious plant upset through proven engineering and procedural safeguards. (2) We thoroughly plan contingencies in coordination with local responding"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 47132,
      "SummaryText": " agencies for the unlikely event of a serious accident. The success of our practices is reflected in our strong safety record to date. \n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nOur commitment of resources to our Process Safety Management (PSM) program is ongoing and we take pride in its success. The program is intended to prevent unwanted deviations from normal, daily operations, and to cope with any upsets in a way that will minimize the potential for harm within our facility fenceline and beyond. \n\n\nFirestone does not consider safety to be a stand-alone practice but, rather, a fundamental element of all aspects of our daily operations:\n\n- Changes in our process operations go through a Management of Change procedure that systematically addresses and resolves any potential safety implications of the change\n- Preventive maintenance on pre-established frequencies is performed on all equipment that plays a role in the prevention or mitigation of process upsets to ensure that it is fully capable of meeting its design intent.\n- Based on extensive written procedures, our personnel are trained, periodically retrained, and tested on the proper operations and maintenance of our facility, and on contingency actions under abnormal conditions.\n- We conduct detailed, systematic process hazard analyses to identify what hypothetically could go wrong in the facility and, when warranted, make further plant or procedural improvements.\n- Our equipment, instruments, and controls are designed for safety, complying with applicable regulatory and industry standards. Much of our facility is computer-controlled with operator back up, incorporating continual internal checks, emergency shutdowns, and alarms. Outdoor storage vessels at the facility are surrounded by concrete walls (dykes) in case of the unlikely event of a major chemical spill.\n\nOur process safety practices closely reflect the specific nature of the chemicals we use. This inclu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 47132,
      "SummaryText": "des our operating procedures, maintenance procedures, process designs, and personal protective equipment.\n\nTHE FIVE-YEAR ACCIDENT HISTORY\n\nWe have had no events at the Firestone facility that would qualify for inclusion in the RMP 5- year accident history.\n\nTHE EMERGENCY RESPONSE PROGRAM\n\nOur written emergency response plan is a set of detailed contingency procedures that are coordinated with the Summit County LEPC, the Akron Fire Department, and other local responders. We train all new personnel on the plan, conduct refresher training annually, and keep our personnel aware of any changes to the plan. Our emergency response plan complies with the RMP Rule and other applicable EPA and OSHA requirements.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nContinuous safety improvement at our facility is achieved through day-to-day adherence to our Process Safety Management practices. Our program involves ongoing identification, analysis, and implementation of safety enhancement measures.\n\nTHE WORST-CASE RELEASE SCENARIOS AND THE ALTERNATE RELEASE SCENARIOS\n\nUnder the RMP rule we have considered a worst case scenario (WCS). We believe this WCS to be extremely unlikely to occur. It involves spontaneous, catastrophic failure of our largest storage vessel containing butadiene followed by a vapor cloud explosion. Based on use of the EPA Offsite Consequence Analysis Guidance, this scenario has offsite impact. A more credible scenario, called an alternative release scenario (ARS), was also analyzed.\n\nAs required by the RMP Rule, we chose a hypothetical ARS that is severe enough to have effect beyond our fenceline. The selected ARS is highly unlikely, and guarded against by Firestone?s Process Safety Management program. In this hypothetical ARS, the operator is pumping butadiene from a railcar to a storage tank when the transfer hose suddenly ruptures resulting in a spill. This scenario requires that a highly reliable safeguard fails: the excess flow valve on the railcar that would cut-off t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 47132,
      "SummaryText": "he flow in the event of a hose rupture. The operator is assumed to take 5 minutes to shut off the flow after the hose rupture occurs. The released vapor is then assumed to ignite resulting in an explosion. Based on use of the EPA Guidance, the effects of the explosion are calculated to extend 121 yards, which is marginally beyond our fenceline, reaching our industrial neighbors, but not reaching the general public. The safeguards in place against this scenario are the excess flow valve on the railcar, along with a minimal likelihood of there being an ignition source present because of our adherence to National Fire Protection Association standards. Further precautions include performing continual preventive maintenance on the hose, replacing it at prescribed time intervals, and pressure testing it before use to detect a leak should one be imminent. This and similar scenarios will continue to be extremely unlikely because of our strong program of process safety. The results of this program have been acknowledged by awards we have received over the past several years from the Summit County Safety Council and the Ohio Division of Safety and Hygiene, recognizing accomplishments such as operating over 1,000,000 man-hours without a lost time injury as of October, 2006."
    }
  ]
}