{
  "FacilityID": 47204,
  "FacilityName": "Cargill, Inc.",
  "FacilityStr1": "1710 16th St., S.E.",
  "FacilityStr2": "N/A",
  "FacilityCity": "Cedar Rapids",
  "FacilityState": "IA",
  "FacilityZipCode": "52401",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19113",
  "LEPC": "Linn County LEPC",
  "FacilityLatDecDegs": "41.970278",
  "FacilityLongDecDegs": "-091.644444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 94783594,
  "ParentCompanyName": "Cargill, Inc.",
  "Company2Name": "N/A",
  "CompanyDUNS": 6249189,
  "Company2DUNS": null,
  "OperatorName": "Mike Rizor",
  "OperatorStr1": "1710 16th St., S.E.",
  "OperatorStr2": "PO Box 1467",
  "OperatorCity": "Cedar Rapids",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52401",
  "OperatorZipCodeExt": "1467",
  "FTE": 248,
  "OtherEPAFacilityID": "IAD 098 026545",
  "EPAFacilityID": "100000127267",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "Not issued yet",
  "SafetyInspectionDate": "2006-08-03 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2006-12-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-12-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2006-12-06 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-12-06 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 41.97089,
  "FRS_Long": -91.64764,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R08",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 68306,
      "AltID": "Propylene Oxide",
      "FacilityID": 47204,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 90413,
          "ProcessID": 68306,
          "ChemicalID": 12,
          "Quantity": 65265.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 69923,
          "ProcessID": 68306,
          "NAICSCode": "311221",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 40064,
              "Process_NAICS_ID": 69923,
              "SafetyReviewDate": "2006-03-31 00:00:00",
              "PHA_Date": "2006-03-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Diversion to reactor vessel",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Underground storage, Diversion to reactor vessel",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2006-06-01 00:00:00",
              "TrainingReviewDate": "2006-06-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2006-09-29 00:00:00",
              "EquipmentInspectionDate": "2006-10-30 00:00:00",
              "EquipmentTested": "PO transfer line",
              "ChangeMgmtDate": "2006-04-06 00:00:00",
              "ChangeMgmtReviewDate": "2006-04-01 00:00:00",
              "PreStartupReviewDate": "2006-11-01 00:00:00",
              "ComplianceAuditDate": "2006-11-28 00:00:00",
              "AuditCompletionDate": "2007-11-28 00:00:00",
              "IncidentInvestigationDate": "2006-10-26 00:00:00",
              "InvestigationChangeDate": "2006-10-26 00:00:00",
              "ParticipationPlansReviewDate": "2006-06-01 00:00:00",
              "HotWorkPermitReviewDate": "2006-07-18 00:00:00",
              "ContractorSafetyReviewDate": "2006-10-16 00:00:00",
              "ContractorSafetyEvalDate": "2006-05-17 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 58149,
                  "PreventionProgram3ID": 40064,
                  "ProcessChemicalID": 90413
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 47204,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Cedar Rapids Fire Department",
    "CoordinatingAgencyPhone": "3192865200",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 47204,
      "SummaryText": "Cargill Inc. owns and operates a wet corn milling facility in Cedar Rapids, Iowa which is subject to U.S. EPA regulations governing Accidental Release Prevention Requirements: Risk Management Programs under Section 112(r) of the Clean Air Act (40 CFR Part 68).  The June 2004 Risk Management Plan (RMP) update was developed in accordance with the requirements specified under 40 CFR Part 68.  The plan certified that Cargill Corn Milling Division has instituted a RMP at the Cedar Rapids, Iowa facility.\n\nEPA requires a review of this RMP if a change at the facility would change the worst-case off-site consequence analysis. Ethylene Oxide will no longer be used at this facility making the current worst-case off-site consequence analysis invalid.  The review in this case must include updates and revalidations of the entire plan and a certification that the plan is true, accurate, and complete.  This November 2006 update to the Cargill facility plan include the elimination of Ethylene Oxide (EO) as a covered process, the review of the parameters and assumptions used to determine accidental release scenarios, 2000 Census data, and recent prevention program and emergency response activities. The remaining covered process and regulated substance on-site is Propylene Oxide (PO) which is stored in an underground storage tank. Because the PO is contained in a underground storage tank the worst case analysis was conducted by analyzing a release from a filling line connected to the tank.\n\nCargill¿s policy is to conduct all business activities in a manner that protects the environment and the health and safety of our employees, contractors, customers and the public.\n\nEnvironment.  Cargill will comply with all applicable laws and regulations; promote waste reduction, resource and property conservation and environmental protection; and train employees to be knowledgeable about all environmental matters relevant to their work.\n\nHealth and Safety.  Cargill will design, construct, mainta"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 47204,
      "SummaryText": "in and operate facilities to protect human and physical resources; provide and require use of adequate protective equipment and measures, and insist that all work, however urgent, be done safely.\n\nFood and Product Safety.  Cargill will provide safe food, feed, and materials for people and animals by using production, storage and transportation facilities that ensure the safety of products; choose suppliers that meet our requirements for safe raw materials and ingredients; and provide employees the training and resources they need to meet their individual responsibilities.\n\nThe Cargill Foods Corn Milling Division facility in Cedar Rapids is designed, maintained and operated so as to minimize adverse impacts to its employees, local communities and the environment.  Plant management makes information available to the local community regarding the hazards and risks in operating the facilities and the prevention techniques in place.  This includes insuring that all regulatory reporting requirements are met.\n\nPlant management is fully informed as to the materials that are stored or used on-site and aware of the possible risk associated with their handling, storage, use, disposal or accidental release.  Material Safety Data Sheets (MSDS) for all materials utilized at the facility are maintained on-site.  The facility maintains inspection records and up-to-date procedures to insure the proper control of hazardous materials. Procedures and systems are devised which include provisions for the periodic testing, review, and update of the emergency response programs. \n\nEmployees are trained and periodically retrained in the methods of detection of hazardous material releases, the potential physical and health risks associated with the materials, and methods for protecting themselves, co-workers, and the public.  The facility investigates, corrects, and reports in writing all incidents involving hazardous materials having caused, or having the potential for causing, injury or los"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 47204,
      "SummaryText": "s.\n\nThe processes subject to the risk management regulations are also subject to Occupational Safety and Health Administration (OSHA) Process Safety Management Standard (PSM).  Cargill has a PSM program utilized for the prevention of accidental chemical releases of ethylene oxide and propylene oxide at the Cedar Rapids Corn Milling facility that includes the following elements: Employee Training and Participation, Process Safety Information, Process Hazards Analysis, Operating Procedures, Training, Contractors, Pre-Startup Safety Review, Mechanical Integrity, Hot Work Permit, Management of Change, Incident Investigation, Emergency Planning and Response, and Compliance Audits.  Cargill Cedar Rapids Corn Milling facility's safety program incorporates continuous improvement through use of on-going evaluations of safety and programs.\n\nIn conjunction with the current RMP and PSM programs in place at the Cedar Rapids Corn Milling facility, there is a standard management practice that requires internal reporting of unusual events, including those in which any abnormal emission of regulated chemicals is observed or suspected.  The incident information is reviewed and a determination is made as to whether a reportable quantity on any chemical listed as requiring reports to regulatory authorities is involved.  If so, the appropriate authorities are notified.\n\nDuring the past 5 years (November 2001 to November 2006), there has been no accident involving any RMP regulated substance that qualifies for reporting under 40 CFR Part 68.  This means that no accident has resulted in reportable on-site injury, off-site injury, evacuations, sheltering in place, or damage to property or the environment.\n\nCargill¿s Cedar Rapids Corn Milling facility has established an Emergency Action Plan to ensure appropriate steps are taken to protect the public health and the environment, as well as the safety of the plant employees.  The EAP is designed to address foreseeable emergency situations at"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 47204,
      "SummaryText": "the facility and provide appropriate hazard and emergency preparedness information to employees, contractors, emergency response personnel, and the community.  Emergency situations can include fire, explosion, chemical release or spill, bomb threats, weather emergencies and other natural emergencies.  Cargill has developed procedures to be followed in the event of an emergency and a command structure to evaluate an emergency to determine the appropriate action to be taken to remedy it.  Cargill staff have a ¿First Response¿ capability and are able to administer basic first aid and CPR.  Cargill will rely on the Cedar Rapids Fire Department, CRFD or Linn County HAZ-MAT team, and Area Ambulance/Paramedic Services for assistance as required to control and resolve emergencies.\n\nCargill¿s Cedar Rapids Corn Milling facility, under the RMP program, as well as its existing PSM and earlier SARA Title III Community Right-to-Know Act compliance programs has organized its management system to effectively address foreseeable hazards and potential risks.  Both the advanced planning aspects of process design, operating procedures, and emergency preparedness, and the operational elements of system maintenance, safe operating practices and ongoing personnel training are necessary to support a continual improvement in facility safety.  These programs are documented so that information about safe handling of chemicals at the facility is readily available to all employees and in the event questions arise from public officials regarding potential risks to the community.  All of these features of the RMP and the integrated risk management program at the Cedar Rapids Corn Milling facility lead to operations that are safe today, but will be even safer tomorrow."
    }
  ]
}