{
  "FacilityID": 47295,
  "FacilityName": "Johnson & Johnson Sales and Logistics Company, LLC",
  "FacilityStr1": "400 West Lincoln Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Lititiz",
  "FacilityState": "PA",
  "FacilityZipCode": "17543",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42071",
  "LEPC": "Lancaster County LEPC",
  "FacilityLatDecDegs": "40.160610",
  "FacilityLongDecDegs": "-076.317389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1325919,
  "ParentCompanyName": "Johnson & Johnson",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Johnson & Johnson Sales and Logisti",
  "OperatorStr1": "400 West Lincoln Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Lititiz",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "17543",
  "OperatorZipCodeExt": null,
  "FTE": 928,
  "OtherEPAFacilityID": "PAD003008943",
  "EPAFacilityID": "100000190768",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "36-05007",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2006-12-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-12-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2006-12-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2016-12-14 00:00:00",
  "DeRegistrationEffectiveDate": "2016-07-01 00:00:00",
  "AnniversaryDate": "2011-12-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 40.1632,
  "FRS_Long": -76.31768,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 68447,
      "AltID": "Distribution Center Stora",
      "FacilityID": 47295,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 90571,
          "ProcessID": 68447,
          "ChemicalID": 98,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 90572,
          "ProcessID": 68447,
          "ChemicalID": 107,
          "Quantity": 49000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 70066,
          "ProcessID": 68447,
          "NAICSCode": "325412",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 47295,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2006-12-01 00:00:00",
    "ERTrainingDate": "2006-02-01 00:00:00",
    "CoordinatingAgencyName": "Lancaster Emergency Management",
    "CoordinatingAgencyPhone": "7176641200",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 47295,
      "SummaryText": "storage.\nThrough the use of these technologies and systems, we will continue to move forward toward our objective of zero waste discharge through continual improvement.\nJohnson & Johnson Sales and Logistics Company, LLC is committed to complying with relevant environmental legislation, regulations and corporate environmental policy.\nJohnson & Johnson Sales and Logistics Company, LLC is committed to actively supporting public outreach initiatives and programs.\n\nJohnson & Johnson Sales and Logistics Company, LLC Lititz's safety policy is as follows:\n§ Johnson & Johnson Sales and Logistics Company, LLC is committed to conducting our operations safely and to prevent lass, whether it be injury/illness to colleagues, damage to property or interruption of the business process.\n§ It is our goal to provide a safe and healthy workplace for all colleagues, visitors and contractors. § We are committed to continual improvement of our safety and health performance.\n§ We will strive to be proactive in our efforts to improve production processes. The elimination of potential safety and health risks will be a fundamental consideration in the design and operation of our processes.\n§ We will systematically identify and evaluate potential hazards and move forward toward our goal of a zero accident workplace.\n§ We are committed to maintaining a comprehensive safety &health management system. We will periodically monitor performance and initiate actions necessary to correct identified deficiencies.\n§ Johnson & Johnson Sales and Logistics Company, LLC is committed to complying with all relevant safety &health legislation, regulations and corporate policy. § Johnson & Johnson Sales and Logistics Company, LLC recognizes that for safety to succeed there must be a cooperative effort dependent on the total commitment of all. The Johnson & Johnson Sales and Logistics Company, LLC Management Team earnestly solicits each colleague's assistance as a member of our accident prevention team to help i"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 47295,
      "SummaryText": "n the recognition and elimination of hazards within the facility. Observed hazardous conditions or practices should be corrected and / or reported promptly to supervision. Every colleague has the responsibility to work safely and to adhere to applicable job procedures.\n\n(b) Stationary source and regulated substances handled:\nThe Johnson & Johnson Sales and Logistics Company, LLC Lititz facility is a Synthetic Minor air source under Title V and has a Pennsylvania Department of Environmental Protection issued air permit Na. 36-05007. The facility also is covered under the Clean water Act 40CFR 112 for pharmaceutical mixing and compounding. The site has an EPA wastewater permit Na. PAP 120320. The site is a large quantity generator of hazardous waste and has an EPA ID Number PAD003008943.\n\nThe Johnson & Johnson Sales and Logistics Company, LLC Lititz site is also a PSM site for alcohol.\n\nThe Johnson & Johnson Sales and Logistics Company, LLC Lititz Logistic Center is a regional center for the distribution of consumer healthcare products. A single product Micatin(TM), an aerosol consumer product stored in the Logistic center, is covered by RMP requirements. The propellant in Micatin is an 80/20 mixture of isobutane and propane. Warehouse storage of Micatin is the sole RMP applicable processes at the facility. Storage is in cardboard shipping boxes containing four ounce steel cans on pallets.\n(c)\tThe general accidental release prevention program and chemical-specific prevention steps: \nWhile the chances of a worst-case situation actually occurring are incalculable, such a scenario by definition is within the realm of possibility. That is why Johnson & Johnson Sales and Logistics Company, LLC's first emergency management priority is accidental release prevention.\n\nWorst Case Release Scenarios were modeled using EPA's RMP'' Comp v1.07.\n\nTo protect the facility's employees, the surrounding community, and the environment; Pifzer's operations adhere to the accident-prevention"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 47295,
      "SummaryText": "elements required under the U.S. Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Standard and the U.S. Environmental Protection Agency's (EPA) Risk Management Program (RMP) Rule. The facility's PSM procedures and policies address all of the required elements of the PSM Standard and RMP Rule Prevention Program 1 elements.\n\n(d)\tGeneral accidental release prevention and chemical specific prevention steps\nThe facility is accessed control via key card and manned guard station. Sprinklers and fire extinguishers are provided. The site has an on-site Emergency Response Team. GE Gaps conducts annual fire safety inspections of the facility.\n\n(e.) Five year accident history\nNo reportable incidents have occurred at the facility in the past five years. \n\n(h) Emergency response program\nThe facility has an extensive Consolidated Emergency Response Plan that includes the requirements under the Superfund Amendments and Reauthorization Act (SARA) and regularly communicates with the Lititz and Lancaster Emergency Management Agency (LEMA) and local emergency-response organizations on matters pertaining to emergency preparedness and chemical storage. The site has an Emergency Response Team (ERT) trained to 24 hr HAZWOPER standards. ERT members are also trained in medical response procedures. Annual drills are conducted with local emergency management agencies and the facility conducts 6 in-house training drills each year for the site ERT. The drills are designed to train for response to materials found and handled on site. The Micatin product is included in the emergency response plans.\n\n(i) Planned changes:\nNone"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 47295,
      "SummaryText": "(a) Release prevention and emergency response policies\n(a) Release prevention and emergency response policies\nJohnson & Johnson Sales and Logistics Company, LLC located in Lititz Pennsylvania is a manufacturer and distributor of consumer healthcare products. The site has a manufacturing facility and handles ingredients that are used in the manufacture of drug products. The Micatin product requiring a RMP submission is not manufactured at the Lititz site. Micatin is received at the Lititz Logistics Center for warehousing and distribution to customers. The Micatin product is the first material handled at Lititz containing a Risk Management Planning (RMP) reportable material.\n\nThe Johnson & Johnson Sales and Logistics Company, LLC Lititz site is an ISO 14001 certified facility. Johnson & Johnson Sales and Logistics Company, LLC Lititz is the first pharmaceutical plant in the US to be ISO 14001 certified achieving its' certification in 1997. It is certified by Lloyd's Register Quality Assurance (LRQA). As such, the site receives extensive surveillance audits of it¿s' managements system which includes emergency preparedness and response. The Johnson & Johnson Sales and Logistics Company, LLC Lititz facility is a Charter Member of the EPA national Environmental Performance Track and most recently received the 2003 and 2006 EPA Performance Track Award for the Most Outstanding Environmental Performance.\n\nJohnson & Johnson Sales and Logistics Company, LLC Lititz's environmental policy is follows:\nJohnson & Johnson Sales and Logistics Company, LLC Lititz colleagues are committed to being environmentally responsible corporate citizens. This will entail:\nBeing proactive in our efforts to improve production processes to eliminate waste.\nSeeking out and considering current technologies in environmentally preferred packaging, reusable material handling and recycling systems, waste water discharge reduction, solid waste handling and disposal, and\nhazardous materials handling and"
    }
  ]
}