{
  "FacilityID": 47381,
  "FacilityName": "F&B Pump Station",
  "FacilityStr1": "2416 F&B Road",
  "FacilityStr2": null,
  "FacilityCity": "College Station",
  "FacilityState": "TX",
  "FacilityZipCode": "77843",
  "Facility4DigitZipExt": "1584",
  "FacilityCountyFIPS": "48041",
  "LEPC": "Brazos County LEPC",
  "FacilityLatDecDegs": "30.623944",
  "FacilityLongDecDegs": "-096.357639",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Texas A&M University",
  "Company2Name": "Physical Plant Department, Utilities Division",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Texas A&M University",
  "OperatorStr1": "1584 TAMU",
  "OperatorStr2": null,
  "OperatorCity": "College Station",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77843",
  "OperatorZipCodeExt": "1584",
  "RMPContact": "Nathan G. Jones",
  "RMPTitle": "Supt. for Utilities Operations",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000141919",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-02-20 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-01-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-01-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-01-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-05-04 00:00:00",
  "DeRegistrationEffectiveDate": "2009-12-15 00:00:00",
  "AnniversaryDate": "2012-01-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 30.62392,
  "FRS_Long": -96.35769,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) PRECISE POSITION",
  "HorizontalAccMeasure": "0.2",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 68610,
      "AltID": "Chlorination",
      "FacilityID": 47381,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 70230,
          "ProcessID": 68610,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 90868,
          "ProcessID": 68610,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 590868,
          "ProcessID": 68610,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 47381,
      "SummaryText": "Executive Summary\n\nThis document was developed to comply with the U. S. Environmental Protection Agency's Risk Management Program as directed under Section 112(r) of the Clean Air Act Amendments of 1990, 40CFR, Part 68.  The use and storage of chlorine in excess 2500 pounds at this facility is the process that is covered under this regulation.\n\n1.  Accidental Release Prevention and Emergency Response Policies\n\nTexas A&M University is strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\nAny release or potential release of chlorine will be addressed promptly with qualified personnel and procedures.  Texas A&M University Utility employees are responsible for operation and maintenance at this facility.  The employees are qualified and trained to handle routine equipment failures and leaks.  Uncontrolled releases of chlorine will be handled by the Texas A&M University Hazardous Materials Response (HazMat) Team.  This team is part of the University's Environmental Health and Safety Department and is trained to handle various hazardous material and waste spills associated with University activities.  The HazMat Response Team also works in association with the City of College Station Fire Department (who also have response capabilities on campus) on various on- and off-campus scenarios.\n\nTexas A&M University actively participates in the Brazos County Local Emergency Planning Committee.\n\n2.  The Facilities and the Regulated Substances\n\nF&B Pump Stations' primary activities include the booster pump stations, storage and chlorination for consumable water delivered to the Texas A&M University?s Main and Riverside Campus?."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 47381,
      "SummaryText": "  There is one regulated substances present at our facilities.  That substance is chlorine.  Chlorine is used for disinfection of consumable water.                                        \n\nThe maximum inventory of chlorine at the F&B Pump Station is 10,000 lbs.\n\n3.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nTexas A&M University has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68 of the EPA.   The following sections briefly describe the elements of the release prevention program that is in place at our facility.\n\nProcess Safety Information\nF&B Pump Station maintains a detailed record of safety information that describes the hazards of chlorine, operating parameters and equipment designs associated with the chlorine feed processes.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Texas A&M University maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nTexas A&M University has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Texas A&M University also maintains the training of personnel responsible for emergency response. \n\nMechanical Integrity\nTexas A&M University carries out documented maintenance checks on process equipment to ensure proper operations.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies ident"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 47381,
      "SummaryText": "ified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at the F&B Pump Station to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nCompliance Audits\nTexas A&M University conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nTexas A&M University promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\n4.  Five-year Accident History\nTexas A&M University has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n5.  Emergency Response Plan\nTexas A&M University maintains a written emergency response plan to deal with accidental releases of regulated materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nThe University HazMat Team maintains the necessary emergency response equipment to respond to chlorine releases from the F&B Pump Station.  In addition, the plan is promptly updated to reflect any per"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 47381,
      "SummaryText": "tinent changes taking place within our processes that would require a modified emergency response.\n\nTexas A&M University actively participates in the Brazos County Local Emergency Planning Committee in dealing with both campus and local emergency situations.\n\n6.  Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  We have installed a fail safe (vacuum) system for feeding chlorine and installed new leak detection equipment.  We have tied chlorine detection alarms into a central dispatch.  We have automated the entire production system which includes automatic dialing on pagers and cell phones upon activation of the chlorine detection equipment.  In the near future we are looking to replace the chlorine delivery systems with low concentration liquid sodium hypochlorite systems."
    }
  ]
}