{
  "FacilityID": 47393,
  "FacilityName": "Ratto Bros., Inc.",
  "FacilityStr1": "6312 Beckwith Road",
  "FacilityStr2": null,
  "FacilityCity": "Modesto",
  "FacilityState": "CA",
  "FacilityZipCode": "95358",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06099",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.681389",
  "FacilityLongDecDegs": "-121.110833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 64159627,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ron Ratto",
  "OperatorStr1": "6312 Beckwith Road",
  "OperatorStr2": null,
  "OperatorCity": "Modesto",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95358",
  "OperatorZipCodeExt": null,
  "FTE": 313,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000185596",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-12-20 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-01-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-01-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-01-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-01-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 37.68194,
  "FRS_Long": -121.11333,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 68630,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 47393,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 90894,
          "ProcessID": 68630,
          "ChemicalID": 56,
          "Quantity": 29000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 70250,
          "ProcessID": 68630,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 40269,
              "Process_NAICS_ID": 70250,
              "SafetyReviewDate": "2006-10-27 00:00:00",
              "PHA_Date": "2004-01-31 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2006-11-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Diffusion Tank",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "SCADA",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "High liquid level alarm; update training, mechanical integrity, response programs; contact fire department re: response activities",
              "OpProceduresReviewDate": "2006-12-20 00:00:00",
              "TrainingReviewDate": "2006-11-30 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": "RETA exams",
              "MaintenanceReviewDate": "2006-12-11 00:00:00",
              "EquipmentInspectionDate": "2006-09-20 00:00:00",
              "EquipmentTested": "Annual IIAR Equipment Safety Inspections",
              "ChangeMgmtDate": "2006-10-05 00:00:00",
              "ChangeMgmtReviewDate": "2006-10-20 00:00:00",
              "PreStartupReviewDate": "2004-01-31 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "2006-11-01 00:00:00",
              "InvestigationChangeDate": "2006-11-30 00:00:00",
              "ParticipationPlansReviewDate": "2006-08-16 00:00:00",
              "HotWorkPermitReviewDate": "2006-11-30 00:00:00",
              "ContractorSafetyReviewDate": "2006-11-30 00:00:00",
              "ContractorSafetyEvalDate": "2006-12-04 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 58498,
                  "PreventionProgram3ID": 40269,
                  "ProcessChemicalID": 90894
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 47393,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Stanislaus County Dept. of Env. Res",
    "CoordinatingAgencyPhone": "2095256700",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 47393,
      "SummaryText": "1.   ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nRatto Bros. uses anhydrous ammonia for process refrigeration.  Ammonia is the only hazardous chemical used at this facility that is subject to the CalARP program or federal RMP requirements.\n\nThis facility recognizes the hazards associated with the use of highly hazardous chemicals.  As a reflection of our policy to adhere to all applicable federal, state, and local laws and regulations, we submit this plan to address the hazards inherent with the use of ammonia.  Our program addresses safety precautions regarding the handling and operation of this covered system as well as proper training for those who operate and maintain the system.  The company training policy requires that all employees will be properly trained for a job position before assignment to that job.\n\nOur accidental release prevention program is clearly defined by the OSHA Process Safety Management (PSM) Program for this facility.  This prevention program follows industry-recommended standards for preventing unnecessary human exposures and reducing the threat to the health of our employees as well as to members of the community and the surrounding area.  Safety depends upon the manner in which we handle these chemicals, the safety devices inherent in the design of this facility and its processes, and the training that we provide our personnel.  This Plan is updated as required by law.\n\nOur Emergency Action Plan (EAP) details the response this facility will take as a result of an uncontrolled release of ammonia.  The Plan includes procedures for notification of the local emergency responders.  This EAP also includes a specific protocol for responding to an ammonia release and assigns an Emergency Coordinator to implement the response.  This Plan is current and updated as required by law and conforms to the requirements for an Emergency Action Plan as per 29 CFR ? 1910.38.\n\nThis facility has also coordinated with the local emergency res"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 47393,
      "SummaryText": "ponders and will maintain close contact to ensure that the responders are familiar with the system and with the general safety and accidental release program at our plant.\n\nIt is the policy of this facility to devote the time, energy, and capital toward maintaining prevention and response programs appropriate to the inherent dangers with the use of hazardous chemicals.\n \n2.   THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nThe Stationary Source\n\nThe Ratto Bros., Inc. produce facility is located at 6312 Beckwith Road in Modesto, California between Hammett and Hart roads.  The facility lies approximately 3 miles west of State Highway 99 in a rural area comprised primarily of farmland and farm residences.  The small town of Salida is located about 2 miles northeast of the facility.  The Stanislaus River drains in a southwesterly direction about 4 miles north of the facility until it joins the San Joaquin River approximately 8 miles southwest of the facility.  \n\nRatto Bros., Inc. is a family owned grower-shipper located in Modesto and in Oakland, California.  The company has been in business since 1905 and was established in rich farmland in the vicinity of the Oakland Airport.  Operations in the Modesto area were begun in the 1960's and, today, almost all of the operations are in Modesto.  \n\nRatto Bros. farms nearly 1,000 acres.  The farming operation is unique in that small blocks (normally less than 2 acres) are planted with a particular crop.  Planting and picking is performed daily nearly year-round in order to provide a continuous supply of product to customers.  More than 1400 blocks are planted per year; during the growing season, the operation typically manages more than 450 blocks at any given time.   \n\nForty (40) commodities are produced at this facility.  The primary crops are greens such as leaf lettuces, collard, parsley and basil, cabbages and root crops such as daikon and celery root.  Most of the production is for the fresh market, but the opera"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 47393,
      "SummaryText": "tion also supplies fresh bulk basil to the local tomato canneries.\n\nMost of the sales are to the grocery chains that service central California, but Ratto Bros. also sells to brokers and distributors.  Production is supplemented with product purchased from the Salinas Valley, the Imperial Valley, Arizona, and Mexico.  These are all buy-sell transactions; there are no contract growers at this time.\n\nRatto Bros. harvests-to-order; the majority of sales are ordered, harvested and shipped within a 12-hour period.  Most commodities are field-packed by full-time harvest crews.  The freshly packed cartons are transported to the dock where they are hydro-cooled and placed in cold storage.  Root crops that require washing are harvested in bulk, washed and are packed on the dock.  \n\nThe Regulated Substance Handled\n\nThe Ratto Bros. facility utilizes approximately 29,000 lbs. of anhydrous ammonia at a maximum as a heat transfer fluid in the plant refrigeration system.  The system is a single-stage mechanical refrigeration system that utilizes a recirculated liquid evaporator feed.  The system operates 24 hours a day each day of the year; the system is attended 12 hours a day.\n\nThe primary system components include:\n\n?   Three (3) high-temperature compressors (one reciprocating, two screw)\n?   Two (2) evaporative condensers\n?   One (1) high-pressure/thermosiphon receiver\n?   One (1) economizer accumulator\n?   Two (2) flooded Hydrovac and surge drum units\n?   One (1) Hydrocooler\n?   One (1) liquid recirculator package\n?   Two (2) ammonia pumps, and\n?   Eighteen (18) storage cooler evaporators.\n\nThe condensers are located on the Engine Room roof, while the compressors, receivers, accumulators, and ammonia pumps are located in the Engine Room.  \n\nAdditional system components include:\n\n?   Oil pots\n?   Automatic and manual valves\n?   Ammonia diffusion tank (all relief valve discharge lines lead to the diffusion tank for mixing with water in the event of a release from a system compo"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 47393,
      "SummaryText": "nent PRV).\n\nSafety systems include:\n\n?   Pressure relief and relief piping system to ammonia diffusion tank\n?   Compressor control panels to shut down the compressor operation if safe operating conditions are exceeded\n?   Liquid level float switches\n?   Ventilation system for continuous and emergency ventilation of the Engine Room\n?   Ammonia detection and alarm system for response to elevated levels of ammonia vapor in the cooling and storage areas.        Detection will trigger the ventilation system, evacuation alarm, and/or fire department notification at preset levels.\n?   Emergency refrigeration control switch for emergency shutdown of the system\n?   Fire suppression system\n?   Fire extinguishers\n?   Emergency showers and eyewash stations\n\nThe operation and maintenance staff consists of a system supervisor and system operator.  The facility maintains an Emergency Action Plan for response to ammonia releases.  The Plan includes notification and evacuation protocols.\n\n3.   THE WORST CASE AND ALTERNATIVE RELEASE SCENARIOS\n\nThe methods to simulate the accidental release scenarios included the use of ALOHA, a computer simulation program developed by the National Oceanic and Atmospheric Administration (NOAA), Environmental Protection Agency (EPA), and the National Safety Council (NSC).  The program is designed to predict the dispersion of chemical vapors into the atmosphere as a result of pipe and tank failures and evaporation of liquid puddles.  The EPA Risk Management Program Guidance for Ammonia Refrigeration was also used to develop the mitigated worst-case release scenario and the alternate release scenario using validated equations.\n\nWorst-Case Release Scenario\n\nThe worst-case scenario is not the most likely scenario but serves to demonstrate the potential effects of catastrophic events.  Due to system controls such as proper operating procedures and equipment with inherent safety features, this scenario has a low likelihood of occurring.\n\nAlternative Case Rel"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 47393,
      "SummaryText": "ease Scenario\n\nThe alternative case release scenarios were modeled using typical site and weather conditions and variables appropriate to the particular release scenario.  The methodology used in the worst-case scenario (ALOHA) was also used for the alternative case release scenarios.  The alternative case release scenarios are those scenarios more likely to occur and that will reach an endpoint offsite, if one exists.\n\n4.   THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE CHEMICAL SPECIFIC PREVENTION STEPS\n\nThis facility complies with the California Accidental Release Prevention (CalARP) Program and OSHA?s Process Safety Management (PSM) Program.  Key prevention steps taken by this facility to maintain safety are outlined in the PSM Program.  These include the description of all system and equipment information, process hazard analysis, operator training, contractor qualification, operating procedures, pre-startup safety review, hot work permitting, management of change, mechanical integrity, incident investigation, compliance audits, and emergency response.\n\nThose who operate, maintain, or supervise the system will be trained to understand the principles of ammonia refrigeration and ammonia properties, an understanding of the process equipment and proper operating and maintenance procedures, recognition of abnormal conditions and the steps to correct deviations, and emergency shutdown procedures as appropriate to the level of involvement each employee will have with the process.\n\nThe general safety program includes hazardous communication, forklift operation, first aid, lockout-tagout, confined space entry, emergency response, use of personal protective equipment, and other programs as required.\n\n5.   THE FIVE-YEAR ACCIDENT HISTORY\n\nThere have been no reportable accidents in the last five years.\n\n6.   THE EMERGENCY RESPONSE PROGRAM\n\nEmployees are trained to understand the requirements of the Emergency Action Plan.  The Emergency Action Plan includes relea"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 47393,
      "SummaryText": "se notification for emergency responders and the procedures for evacuation.  The Emergency Coordinator implements the response in coordination with the local emergency responders (i.e. the fire department).  An alarm system includes ammonia detection for ventilation activation, an evacuation alarm, and automatic notification to the local fire department.\n\n7.   PLANNED CHANGES TO IMPROVE SAFETY\n\nA Process Hazard Analysis (PHA) was performed as required prior to initial startup of the system.  The PHA team developed a list of recommendations to improve safety by reducing potential hazards of the process.  All recommendations were implemented, deemed unnecessary since no improvements to safety would result from a particular recommendation, or implementation of the recommendation is planned for the future.  The items planned for the future include: \n\n?   Joint exercises with local fire department"
    }
  ]
}