{
  "FacilityID": 47449,
  "FacilityName": "City of Superior Wastewater Div. Of Public Works",
  "FacilityStr1": "51 East First Street",
  "FacilityStr2": null,
  "FacilityCity": "Superior",
  "FacilityState": "WI",
  "FacilityZipCode": "54880",
  "Facility4DigitZipExt": "3034",
  "FacilityCountyFIPS": "55031",
  "LEPC": "Douglas County LEPC",
  "FacilityLatDecDegs": "46.726903",
  "FacilityLongDecDegs": "-092.072125",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G3",
  "LatLongDescription": "AB",
  "FacilityURL": "www.ci.superior.wi.us",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 29514572,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dan Romans",
  "OperatorStr1": "51 East First Street",
  "OperatorStr2": null,
  "OperatorCity": "Superior",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54880",
  "OperatorZipCodeExt": "3034",
  "FTE": 36,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000150472",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-10-12 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Risk Management Plan for Chlorine",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-01-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-01-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-01-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-11-14 00:00:00",
  "DeRegistrationEffectiveDate": "2016-11-14 00:00:00",
  "AnniversaryDate": "2012-01-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 46.72686,
  "FRS_Long": -92.07211,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "0.1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 68730,
      "AltID": "chlorination",
      "FacilityID": 47449,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 91032,
          "ProcessID": 68730,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 70350,
          "ProcessID": 68730,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 40349,
              "Process_NAICS_ID": 70350,
              "SafetyReviewDate": "2005-11-07 00:00:00",
              "PHA_Date": "2005-11-07 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-10-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-21 00:00:00",
              "TrainingReviewDate": "2005-01-25 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2005-01-25 00:00:00",
              "EquipmentInspectionDate": "2005-01-25 00:00:00",
              "EquipmentTested": "chlorine delivery system",
              "ChangeMgmtDate": "1990-02-01 00:00:00",
              "ChangeMgmtReviewDate": "2005-11-07 00:00:00",
              "PreStartupReviewDate": "1990-02-01 00:00:00",
              "ComplianceAuditDate": "1999-05-18 00:00:00",
              "AuditCompletionDate": "1999-07-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-21 00:00:00",
              "HotWorkPermitReviewDate": "2005-06-29 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-21 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-21 00:00:00",
              "CBI_Flag": 0,
              "Description": "Ventilation System: The chlorine ventilation fan draws air into an exhaust duct located near the floor of the ton container room.  Supply air comes in through a louver located near the ceiling in the chlorinator room. The supply air louver opens with the operation of the exhaust fan. The exhaust fan is set to turn on immediately when anyone enters the chlorine room. It will remain on as long as anyone is in the room. It is also set to go on if chlorine is detected in the room. The exhaust fan can also be turned on manually via a switch located outside the chlorine room and will run continuously until shut off.\nRelief System:  A pressure relief valve on the vacuum line to the chlorinators is installed which will vent chlorine gas if a vacuum is lost in the gas line.  Chlorinators are also vented in case vacuum in the gas line is lost.\nElectrical Classification: No explosive and combustible gasses are stored in the chlorine area.  Electrical conduit is rigid metal and controllers are NEMA 4.  Lights and switches are NEMA 1.\nDesign Codes and Standards: Original design was in the early 1970?s.  New chlorinators were installed in 1990, and ORP controllers were installed in 1994.  Since 1990, new equipment was installed in accordance with Recommended Standards for Wastewater Facilities, 1990 Edition and applicable sections of Wisconsin Administrative Code NR 110.\nSafety Systems: Vacuum regulators are attached directly to the chlorine ton containers.  Any break in the line will result in the gas supply being shut off.  A pressure relief valve will vent the gas line in case of vacuum loss.  The chlorinators will shut down and vent the chlorinator if there is a loss of vacuum.\nA chlorine gas sensor is located in the chlorinator room and in the storage building.  They are connected to a gas analyzer located in the control room.  If chlorine gas is detected at 10 ppm, an alarm will sound in the control room with a flashing light to indicate which sensor is detecting chlorine.\nA chlorine specific half mask respirator is required to be used when the operators are changing a ton container.  This respirator is only slight protection from incidental gas leaks, which may occur from a poor seal.  They are not to be worn in an atmosphere known to contain chlorine.  A self-contained breathing apparatus is located just outside the chlorination room and is required to investigate chlorine leaks.The City of Superior WWTP complies with the OSHA Process Safety Management rule.  This comprehensive plan covers all aspects of dealing with a hazardous chemical such as chlorine.\nThe major objective of our process safety management of chlorine is to prevent unwanted releases, which could expose employees and others to serious hazards. Our process safety management program applies a systematic approach to evaluating the whole process. Using this approach the process design, process technology, operational and maintenance activities and procedures, nonroutine activities and procedures, emergency preparedness plans and procedures, training programs, and other elements which impact the process are all considered in the evaluation. Our process safety management is a proactive identification, evaluation and mitigation or prevention of chemical releases that could occur as a result of failures in process, procedures or equipment.\nOur process safety plan incorporates employee participation, process safety information, process technology information, a Process Hazard Analysis, Operating Procedures and Practices, Employee Training, Contractor Safety Requirements, Pre-Startup Safety Procedures, Maintenance Requirements to Maintain Mechanical Integrity, A Management of Change Policy, An Pre-Startup Review, Compliance Audits, and Accident Investigation Procedures.",
              "_chemicals": [
                {
                  "PrimaryKey": 58606,
                  "PreventionProgram3ID": 40349,
                  "ProcessChemicalID": 91032
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 47449,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2005-11-07 00:00:00",
    "ERTrainingDate": "2005-01-25 00:00:00",
    "CoordinatingAgencyName": "Douglas County Emergency Response",
    "CoordinatingAgencyPhone": "7153951391",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 47449,
      "SummaryText": "FACILITY DESCRIPTION:\nThe Wastewater Treatment Plant is located at 51 East 1st street in Superior, on the waterfront of the Superior Bay.  The elevation of the plant is lower than that of the surrounding homes and highways.  The plant has four chlorine containers, one-ton each, on site at all times.  Two chlorine containers are in use and are located in a room constructed with concrete floor, concrete block and brick walls, and an aluminum ceiling.   Two containers are in storage and are located in an unheated, garage area with a concrete floor and aluminum walls and ceiling.   There are two entrances to each area.  A chlorine leak detector is located in each area with alarms wired into the plant operator's control room.  The plant is manned with one operator 24 hours a day. Between the hours of 7 a.m. and 4:30 p.m. Monday through Friday there is a potential of 32 employees on site. The plant area is fenced with an entry gate.  The on duty operational personnel have direct radio communications with the Douglas County Emergency Communications Center. Phone lines are also available.  \nWORST CASE SCENARIO:\nThe worst case scenario was calculated using a model scenario in the EPA Guidance document Risk Management Program Guidance for Wastewater Treatment Plants. It assumes a total loss of two full interconnected chlorine one-ton cylinders.  This would occur on a day with an atmospheric stability of F and a wind speed of 1.5 meters per second.  The calculated distance to the endpoint is a circle with a radius of 1.9 miles.\nThis scenario does not take into account the mitigating factors at the City of Superior WWTP.  The chlorine cylinders are housed inside a concrete block room when interconnected.  The wall structure would restrict the dispersion of the gas.  The cylinders in the storage building are not connected together.  For both tanks to rupture at the same time, a fire or explosion would need to occur.  The storage building is constructed of non-flammable materials"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 47449,
      "SummaryText": ", and no flammables are allowed in the building.  There are chlorine alarms in both the chlorinator room and the storage building.  \nThe likelihood of this scenario actually happening is quite remote.\nALTERNATIVE SCENARIO\nThe alternative scenario was calculated using a model scenario in the American Water Works Association's book Compliance Guidance and Model Risk Management Program for Water Treatment Plants.  This scenario assumes a release occurs from a one-ton cylinder due to a bad connection or valve failure. The release is restricted to the 5/16-inch diameter valve body opening.  Assuming a 60-minute duration, the total escaped gas would be 317 lbs.  This corresponds to a circle with a 0.48-mile radius.\nThe likelihood of this scenario happening is more realistic than the worst case scenario.  There is the possibility of the valve being damaged during change-out of the cylinders or off loading the cylinders from the supplier.  However, even this occurrence would be quite rare.\n\nCHLORINATION SYSTEM\nThe chlorine is dispensed via a vacuum system, which will shut off the flow of chlorine in the event of a loss of vacuum.  \nStaff is trained regularly to fully understand the safety and health hazards of chlorine and the chlorine processes they work with.  \nThe City of Superior WWTP has instituted a preventative maintenance program with checklists outlining things to observe, record and adjust.  Every two years, a licensed technician services the chlorination system and equipment maintenance training is provided to all operational staff.  \nACCIDENTAL RELEASE PREVENTION PROGRAM\nThe City of Superior WWTP complies with the OSHA Process Safety Management rule.  This comprehensive plan covers all aspects of dealing with a hazardous chemical such as chlorine.\nThe major objective of our process safety management of chlorine is to prevent unwanted releases, which could expose employees and others to serious hazards. Our process safety management program applies a systematic a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 47449,
      "SummaryText": "pproach to evaluating the whole process. Using this approach the process design, process technology, operational and maintenance activities and procedures, nonroutine activities and procedures, emergency preparedness plans and procedures, training programs, and other elements which impact the process are all considered in the evaluation. Our process safety management is a proactive identification, evaluation and mitigation or prevention of chemical releases that could occur as a result of failures in process, procedures or equipment.\nOur process safety plan incorporates employee participation, process safety information, process technology information, a Process Hazard Analysis, Operating Procedures and Practices, Employee Training, Contractor Safety Requirements, Pre-Startup Safety Procedures, Maintenance Requirements to Maintain Mechanical Integrity, A Management of Change Policy, An Pre-Startup Review, Compliance Audits, and Accident Investigation Procedures.\n5 YEAR ACCIDENT HISTORY\nWe have had no accidental releases of chlorine in the last 5 years.\nPLANNED CHANGES TO IMPROVE SAFETY\nTraining in chlorine safety is provided for all staff, not just operational staff.  The every two year maintenance and operational training will also be occurring this summer.  \nThe City of Superior has a comprehensive safety program that addresses PPE, lockout/tagout, confined space entry, hazard communications, fire prevention, first aid, etc.  The human resources department is continually updating and improving on these policies.\nA mechanical hoist and trolley was installed to provide greater control over the transfer of the cylinders from the storage facility to the chlorination room.\nEMERGENCY RESPONSE PROGRAM\nThe City of Superior WWTP has adopted a set of emergency response procedures to address a full array of events.  Responses are defined for fires, explosions, extended power failure, medical emergencies, flooding, loss of water, natural gas leak, methane leak, chlorine gas l"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 47449,
      "SummaryText": "eak, sulfur dioxide gas leak, bomb threats, etc.  These procedures include floor plans for all of the buildings at the plant and evacuation routes from every room are defined.\nEach scenario lists the names and phone numbers of the supervisory personnel or outside responders to be notified.  The tasks required are identified as are the responsible employees.\nThe City of Superior WWTP has worked with the Douglas County Emergency Response Coordinator to develop an emergency response plan to be used in the case of an emergency requiring evacuation of Superior residents.  This plan was also sent to the City of Duluth.\nThe Superior Fire Department will be the responder in the case of a chlorine leak acting in the role of the Regional Hazmat Response Team.  They have been supplied with a map of the plant, locations of all chemicals of concern, a key to the front gate, and a copy of the Douglas County Emergency Response Plan for the City of Superior Wastewater Treatment Plant.  They have toured the facility to become familiar with the locations of the chemicals on site."
    }
  ]
}