{
  "FacilityID": 4764,
  "FacilityName": "Westvaco Corporation",
  "FacilityStr1": "1724 Westvaco Road",
  "FacilityStr2": "P.O. Box 278",
  "FacilityCity": "Wickliffe",
  "FacilityState": "KY",
  "FacilityZipCode": "42087",
  "Facility4DigitZipExt": "0278",
  "FacilityCountyFIPS": "21007",
  "LEPC": "Ballard County LEPC",
  "FacilityLatDecDegs": "36.944444",
  "FacilityLongDecDegs": "-89.081111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 45736402,
  "ParentCompanyName": "Westvaco Corporation",
  "Company2Name": null,
  "CompanyDUNS": 1316397,
  "Company2DUNS": null,
  "OperatorName": "Westvaco Corporation",
  "OperatorStr1": "1724 Westvaco Road",
  "OperatorStr2": "P.O. Box 278",
  "OperatorCity": "Wickliffe",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "42087",
  "OperatorZipCodeExt": "0278",
  "FTE": 620,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000059937",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1994-11-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2018-02-23 00:00:00",
  "DeRegistrationEffectiveDate": "2018-01-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 36.944409,
  "FRS_Long": -89.07988,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5539,
      "AltID": "Raw water filter plant",
      "FacilityID": 4764,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 5953,
          "ProcessID": 5539,
          "ChemicalID": 62,
          "Quantity": 40000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5655,
          "ProcessID": 5539,
          "NAICSCode": "322121",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2249,
              "Process_NAICS_ID": 5655,
              "SafetyReviewDate": "1997-02-10 00:00:00",
              "PHA_Date": "1994-04-23 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1995-12-26 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "vacuum regulators",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "vacuum regulators",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "equipment change - regulators",
              "OpProceduresReviewDate": "1997-08-04 00:00:00",
              "TrainingReviewDate": "1998-04-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1996-03-14 00:00:00",
              "EquipmentInspectionDate": "1998-05-21 00:00:00",
              "EquipmentTested": "tubing from chlorine cylinders to main manifold",
              "ChangeMgmtDate": "1996-04-23 00:00:00",
              "ChangeMgmtReviewDate": "1994-03-11 00:00:00",
              "PreStartupReviewDate": "1994-03-11 00:00:00",
              "ComplianceAuditDate": "1997-01-30 00:00:00",
              "AuditCompletionDate": "1998-02-07 00:00:00",
              "IncidentInvestigationDate": "1996-04-16 00:00:00",
              "InvestigationChangeDate": "1997-02-07 00:00:00",
              "ParticipationPlansReviewDate": "1994-09-28 00:00:00",
              "HotWorkPermitReviewDate": "1998-01-31 00:00:00",
              "ContractorSafetyReviewDate": "1998-03-31 00:00:00",
              "ContractorSafetyEvalDate": "1997-08-31 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2511,
                  "PreventionProgram3ID": 2249,
                  "ProcessChemicalID": 5953
                }
              ]
            }
          ],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 5656,
          "ProcessID": 5539,
          "NAICSCode": "32211",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4764,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1997-03-14 00:00:00",
    "ERTrainingDate": "1998-05-07 00:00:00",
    "CoordinatingAgencyName": "Ballard County LEPC",
    "CoordinatingAgencyPhone": "2706659928",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 4764,
      "SummaryText": "release, most people at or beyond the endpoint would be able to walk away from the exposure with no long-term health effects.  However, some short-term effects may be felt.\n\nThe worst-case release scenario for chlorine consists of the rupture of a 1 ton cylinder and the release of 2,000 pounds (907 kg).  Several overly conservative assumptions are included in this worst-case release scenario.  These assumptions include: the instantaneous release of the entire contents of the cylinder, the accident occurs on the hottest day, there will be very light wind, and no response by automatic systems or personnel can be factored in to the modeling.  This release scenario will affect areas outside the mill site. There are both public and environmental receptors within this area.\n\nThe alternative release scenario for chlorine consists of the release of 10 pounds (3.15 kg) of chlorine over a ten minute period from the failure of a lead gasket on the cylinder regulator at the raw water filter plant.  The ten-minute period includes the response and repair time identified by mill personnel.  Modeling was conducted that identified the distance to endpoint, which is within the plant boundary where the public is restricted from access.\n \n\nAccidental Release Prevention Program and Chemical-specific Prevention\n\nThe Wickliffe mill has always focused on ways to prevent accidental releases of hazardous substances.  In 1994, the Wickliffe mill implemented the fourteen elements of OSHA's Process Safety Management (PSM) program.  The EPA RMP rule, which was published in 1996, established various levels of prevention program requirements.  The chlorine at the raw water filter plant is a Program 3 level process.  The Program level is essentially the same as the OSHA PSM program, except that the RMP program focuses on protecting the public and the environment.  Program 3 requires twelve of the fourteen elements of the OSHA PSM program.  A prevention program to meet these requirements has been d"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4764,
      "SummaryText": "eveloped for chlorine at the raw water filter plant.  The prevention program focuses on the following twelve elements:\n\n* Process safety information\n* Pre-startup review\n* Process hazard analysis\n* Compliance audit\n* Operating procedures\n* Incident investigation\n* Training\n* Employee participation\n* Mechanical integrity\n* Hot work permits\n* Management of change\n* Contractors\n\nIn addition to the required prevention program elements, Westvaco has implemented safety features specific to the hazardous substances used at the Wickliffe mill.  Chlorine is supplied to the mill in Department of Transportation (DOT) approved one ton cylinders.  Chlorine is fed through a short section of piping to a mixer where it is safely absorbed into the mill's raw water feed.  The entire feed system is operated under a vacuum.  If the vacuum is lost, the cylinder valve will close automatically.  The materials of construction and delivery system all meet the specifications of the suppliers.  Chlorine detectors are located throughout the areas where chlorine is present in the raw water filter plant.  These alarms are set to trigger below a concentration that would be dangerous to the operator.  The alarms are audible within the chlorine area and also alarm in the power center control room where displays are constantly monitored.  \n\n\nFive Year Accident History\n\nThere have been no accidents at the Wickliffe mill involving the covered processes within the last five years that resulted in death, injuries, or significant property damage onsite or known offsite deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.\n\nEmergency Response Program\n\nWestvaco has developed a written emergency response program centered on the mill's emergency disaster plan to help make the appropriate response to accidental releases of hazardous substances.  The program includes information specific to the chlorine process at the raw water filter plant.  The information includes:\n\n*"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 4764,
      "SummaryText": "Evaluation of the accidental release, determine evacuation needs, determine necessary assistance, make appropriate public and management notification\n* Controlling and containing accidental releases, including the use of emergency response equipment and the inspection, testing, and maintenance of that equipment\n* Providing first aid and emergency medical treatment to treat accidental exposure to hazardous substances\n* Training for employees in relevant procedures\n* Procedures to review and update the emergency response program and update employees as necessary.\n\nThe Wickliffe mill maintains an emergency response team of more than one hundred members.  All workers, contractors, and visitors are trained in appropriate evacuation procedures.  Westvaco routinely conducts emergency response training and drills and each mill area conducts periodic evacuation drills.\n\nThe Wickliffe mill emergency response plan complies with the requirements 29 CFR 1910.38(a) as required by the Process Safety Management rule and has been communicated to local responders.  Information has been supplied to local responders as part of the TAB Q-7 for the Wickliffe mill.  Westvaco has several workers that participate on the Local Emergency Planning Committee (LEPC) and local fire and rescue squads.\n\n\nPlanned Changes to Improve Safety\n\nWestvaco continually strives to improve the safety of processes at the mill.  The chlorine process safety is reviewed through a periodic review of the hazard and operability study (HAZOP), management of change procedures, incident investigation programs, safety action teams, and solicitation of safety suggestions from employees."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4764,
      "SummaryText": "ed and uncoated paper.  As part of the raw water filter plant for the mill's incoming water treatment, chlorine, a regulated substance, is stored in sufficient quantities to be subject to the RMP rule.  This is a Program Level 3 process and there is the potential to have 40,000 pounds of chlorine on site at one time.\n\n\nOffsite Consequence Analysis\n\nWestvaco performed an analysis of the potential offsite consequence that an accidental release of chlorine could have on the public or the environment.  The RMP regulations require the analysis of both worst-case release scenarios and alternative release scenarios.  Westvaco does not expect a worst-case release to ever occur based on the fact that no similar incident has occurred at the Wickliffe mill since start-up in 1970.  However, the analysis was done as required by the RMP rule and included in this report.  The alternative release scenario evaluated is intended to represent a release, which might occur based on experience and knowledge of the process.  The alternative release scenario is most appropriate in working with the Local Emergency Planning Committee to evaluate the emergency response plan.  While Westvaco believes that these releases are unlikely at the Wickliffe mill, we have evaluated the offsite impacts of these accidental releases as required by the rule.\n\nThe RMP rule specifies that for a Program 3 level process that both a worst case and alternative release scenarios be evaluated.  Westvaco has conducted offsite consequence analysis for both release scenarios using a refined modeling technique.  The DEGADIS air dispersion model was used for this analysis.  The model is a dense gas dispersion model that has been approved for use in evaluating offsite consequences under the RMP.  The purpose of performing the modeling is to determine the distance to which certain effects may be experienced by public or environmental receptors.  This distance is called an endpoint distance.  When evaluating an accidental"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 4764,
      "SummaryText": "RISK MANAGEMENT PLAN\nEXECUTIVE SUMMARY\n\nWESTVACO CORPORATION - WICKLIFFE, KY\n\n\nWestvaco Corporation (Westvaco) owns and operates a pulp and paper mill in Wickliffe, Kentucky.  Westvaco is committed to operating the mill in a manner that is safe for its employees, the public, and the environment.  As a demonstration of that commitment, Westvaco has developed and implemented Environmental, Safety and Health policies to serve as guiding principles for all Westvaco employees and operations.  The Environmental Policy includes the following:\n\nWestvaco has a longstanding record of environmental leadership and responsible stewardship.  The company is committed to maintaining high environmental quality standards, which meet or exceed those established by all relevant environmental laws, regulations and other applicable requirements. \n\nThe Safety Policy further includes:\n\nOperating safely, with a constant focus on accident prevention and occupational health programs, is the most efficient way to manage our business.  It is the best way to safeguard our employees and the communities in which we are located.\n\nWestvaco believes that adherence to these policies is the responsibility of each employee.  Westvaco has established a management system to implement these policies across the company.  Adherence to these policies has a direct bearing on the performance of the corporation.  Therefore, compliance with the policies is included in evaluation of both managers and corporate executives.  Monthly senior management meetings begin with a report on environmental, safety and health activities.  Westvaco's Board of Directors Committee on the Environment, Safety and Health meets regularly to examine reports from senior management.\n\nAs part of Westvaco's commitment to Environmental, Safety and Health operations at the Wickliffe mill, systems have been established to ensure safe operation of the processes at the facility.  One component of the system is a Risk Management Plan (RMP) t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4764,
      "SummaryText": "hat assists in managing risks and complies with the requirements of the Environmental Protection Agency's (EPA's) regulation found in 40 CFR 68, Accidental Release Prevention Requirements: Risk Management Programs.  One of the requirements of the rule is to submit a risk management plan describing the program at the mill.  This document is intended to satisfy the risk management plan requirement of the rule and provide an accurate description of the program at the Westvaco Wickliffe mill.\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nWestvaco is committed to the safety of its workers, contractors and the public, and the preservation of the environment, through the prevention of accidental releases of hazardous materials.  The mill has systems in place that provide reasonable controls to prevent foreseeable releases of hazardous substances.  These controls include initial and ongoing training for operators, and several programs to help ensure safety and health.  Environmental policies are met during design, installation, operation, and maintenance of process equipment.  Additionally, several programs and audit systems exist to continually evaluate hazards at the mill.\n\nIn the event of an accidental release, Westvaco personnel control and contain the release in a manner that will reduce the risk of exposure to workers, the public, and the environment.  Westvaco has more than one hundred emergency responders trained in dealing with releases of materials specific to the mill.  Procedures in place outline the responsibilities of the incident commander to oversee response and coordinate activities with local emergency response personnel.  Materials on site and response activities have been reviewed with the Local Emergency Planning Committee and the State Disaster and Emergency Response Coordinator. \n\n\nWestvaco and Regulated Substances\n\nThe Westvaco Wickliffe, Kentucky mill is an integrated pulp and paper mill which manufactures bleached pulp and coat"
    }
  ]
}