{
  "FacilityID": 4769,
  "FacilityName": "Borden Chemical, Inc., Alexandria Plant",
  "FacilityStr1": "3901 Sugar House Road",
  "FacilityStr2": null,
  "FacilityCity": "Alexandria",
  "FacilityState": "LA",
  "FacilityZipCode": "71302",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22079",
  "LEPC": "Rapides Parish LEPC",
  "FacilityLatDecDegs": "31.253889",
  "FacilityLongDecDegs": "-92.435",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 942200932,
  "ParentCompanyName": "Borden, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1338797,
  "Company2DUNS": null,
  "OperatorName": "Borden Chemical,inc.",
  "OperatorStr1": "P.O. Box 5403",
  "OperatorStr2": null,
  "OperatorCity": "Alexandria",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "71407",
  "OperatorZipCodeExt": null,
  "FTE": 29,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000059688",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 31.253803,
  "FRS_Long": -92.435692,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5545,
      "AltID": "Phenol-formaldehyde resin",
      "FacilityID": 4769,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 5959,
          "ProcessID": 5545,
          "ChemicalID": 1,
          "Quantity": 104000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5662,
          "ProcessID": 5545,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2253,
              "Process_NAICS_ID": 5662,
              "SafetyReviewDate": "1999-05-31 00:00:00",
              "PHA_Date": "1999-12-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-05-29 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "hand held montiors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-08 00:00:00",
              "TrainingReviewDate": "1999-06-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-07 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "emergency genrator",
              "ChangeMgmtDate": "1999-06-03 00:00:00",
              "ChangeMgmtReviewDate": "1996-03-01 00:00:00",
              "PreStartupReviewDate": "1999-01-27 00:00:00",
              "ComplianceAuditDate": "1998-11-05 00:00:00",
              "AuditCompletionDate": "1999-05-25 00:00:00",
              "IncidentInvestigationDate": "1999-05-11 00:00:00",
              "InvestigationChangeDate": "1999-06-03 00:00:00",
              "ParticipationPlansReviewDate": "1996-03-01 00:00:00",
              "HotWorkPermitReviewDate": "1996-03-01 00:00:00",
              "ContractorSafetyReviewDate": "1998-03-28 00:00:00",
              "ContractorSafetyEvalDate": "1996-11-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2515,
                  "PreventionProgram3ID": 2253,
                  "ProcessChemicalID": 5959
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4769,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-11-30 00:00:00",
    "ERTrainingDate": "1998-09-28 00:00:00",
    "CoordinatingAgencyName": "Rapides Parish Planning Committee",
    "CoordinatingAgencyPhone": "3184875857",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "LAC 33:III.5911.B1"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 4769,
      "SummaryText": "e toxic endpoint for formaldehyde (0.012 mg/l or 10 ppm) is 0.55 miles from the reactor.  The duration of exposure above 10 ppm at any distance from the reactor is predicted to be 140 seconds.\n\nWe believe that this distance is conservative for two reasons.  First, the amount of formaldehyde in the reactor at the time of a release is expected to be lower than the amount used in the model.  Second, the model assumes that the formaldehyde released will be coupled with the liquid release.  In an actual release, some of the formaldehyde is expected to disengage from the liquid and rise with vented water vapor.  Detailed safeguards are in place to prevent a release from the resin reactor, constraints on resin manufacturing procedures, automatic process controls, a quench system, preventive maintenance, and operator training.\n\nAlternative Release Scenario - Formaldehyde\n\nAs a result of a hose failure the entire contents of formaldehyde truck is spilled into the unloading containment area.  This area is dike and trenched and would contain the entire contents of truck. In addition, there is a manually operated sump pump.  This pump once activated would recover the all of the spilled material in less than three hours.  \n\n4. Accidental release prevention program and chemical specific prevention steps\n\nThis plant has a comprehensive process safety management program that is in compliance with the EPA Accidental Release Prevention Rule, the OSHA Process Safety Management Standard, and all applicable state codes and regulations.  A safety management system is in place to assure on-going compliance.  This management system includes the Safety Manual, a list of site safety responsibilities, a file system to maintain records of compliance, and a monthly Safety Committee meeting, where a management control checksheet is used to verify that tasks were completed on schedule.  The Plant Manager has overall responsibility for this program.\n\nProcess stewards are assigned to maintain a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4769,
      "SummaryText": "nd improve the safety of their units.  Their duties include keeping operation procedures up-to-date, training operators so they can safely carry out theses procedures, assuring that the plant is run safely on a daily basis when necessary, investigating incidents in their unit. All employees participate in the safety program through team-based activities to improve safety and plant operation.\n\nEach Process Steward maintains an Operating Guide that includes process safety information, operating procedures, and a training certification program. Operators use this Operating Guide as a training tool and for reference. By applying the information it contains their actions will prevent accidental releases.\nProcess hazard analyses are conducted on an on-going basis to identify hazards and recommend safeguards that will prevent an accidental release. As a result of initial process hazard reviews, a significant investment was made in process control Systems. Several interlocks have been installed to insure safety including an automatic deluge system.  This system will flood the reactor with water removing excess heat should the batch become unstable. \n\nTwo methods are used to assure that changes to plant equipment, procedures, or processes do not cause accidents. For equipment and procedure changes, a Change Worksheet initiates a safety review. This review may include process hazard analysis.\nChanges to product formulations initiate a review by a chemist, process engineer, and the plant manager. Training is performed as needed to assure that those affected by the change understand its impact. Pre-Start-up Safety Reviews are performed to assure that the plant can be started up safely after a significant change is made.\n\nA preventive maintenance program maintains the mechanical integrity of process equipment. A database is used to manage the preventive maintenance schedule.  Each month scheduled equipment inspections, tests, or servicing are performed. The schedule is based on"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4769,
      "SummaryText": "guidelines in the safety manual, Borden' reactor safety standard and plant experience to reduce the likelihood of an accidental release caused by equipment failures.\n\nThe requirements in the Safety Manual include safe work practices, which prevent accidental releases. One important section describes safety measures for welding or other hot work, which includes a permit system to reduce the risk of fire. The Safety Manual also includes requirements for locking out equipment for maintenance. These procedures reduce the likelihood that a valving error will lead to a release.\n\nContractors, who periodically perform work in the plant, are given safety orientations to brief them on plant hazards and safety practices. Contractor safety programs and performance are evaluated prior to their selection for jobs that impact process safety.\nIncidents that cause or could have caused a release are investigated and recommendations are made to prevent recurrence. These recommendations may lead to improvements in equipment, procedures, operating conditions, or training.\n\nPeriodically a safety professional from another Borden Chemical location conducts a\ncomprehensive audit of the safety program. Addressing recommendations from this audit keeps the safety program effective.\n\n5. Five-year accident history\nThere have been no reportable accidents at the facility in the last five years.\n\n6.  Emergency response program\nThe plant operating staff is trained in Hazard Communication, First Aid, fire prevention and emergency procedures as a part of Borden's Safety Program.  In addition, Borden has a contractual agreement with an outside environmental service contractor to provide a well trained and equipped Emergency Response Team should an upset condition exceed the capabilities of plant personnel. This team is available on a 24 hour, seven day a week basis.  \n.\n\n7.  Planned changes to improve safety\nNo significant programs are changes are planned."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 4769,
      "SummaryText": "1. Accidental release prevention and emergency response polices\n\nAs stated in our Worldwide Health, Safety, and Environmental Policy and Principles, Borden Chemical, Inc. is committed to health, safety, and environmental excellence.  To accomplish this we integrate health, safety, and environmental planning into all business activities.  This includes complying with applicable laws, responsibly managing risks, and working collaboratively with others in addressing health safety, and environmental issues.\n\nIn the Borden Chemical, Inc. Safety Manual, the Safety Policy Statement clearly states that safety will not be compromised to achieve any other operational or business objective.  This manual defines requirements and guidelines developed to prevent injuries and accidental releases. \nIncluded in the Safety Manual is Emergency Response Polices that states that safety is the top priority in all emergency response situations.  This policy refers to the plant's Emergency Response Plan for specific procedures for handling releases of hazardous materials. \n\n2. Stationary source and regulated substances handled\n\nThis facility makes neat phenol-formaldehyde resins, and RTU (ready-to-use) resins, which are mixtures of neat phenol-formaldehyde resins and various combinations of natural ingredients such as pecan shells, corn flour, and wheat flour.  These products are primarily used in manufacture of forest products such as plywood and OSB.\n\n\n3. Worst-Case release scenarios and alternative release scenarios\n\nWorst Case Release Scenario\n \nTemperature control fails while making a batch of phenol-formaldehyde resin.  As a result, the heat of reaction boils the reactor contents until the pressure reaches 5 psig, when the installed rupture discs burst.  Pressure inside the reactor forces vapor and liquid through the rupture disc vent piping, discharging water vapor, formaldehyde vapor, and liquid resin into the atmosphere.\n\nWhen modeled as a worst case release, the distance to th"
    }
  ]
}