{
  "FacilityID": 4772,
  "FacilityName": "Consolidated Papers, Inc- Wisconsin River Division",
  "FacilityStr1": "2627 Whiting Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Stevens Point",
  "FacilityState": "WI",
  "FacilityZipCode": "54481",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55097",
  "LEPC": "Portage County LEPC",
  "FacilityLatDecDegs": "44.488889",
  "FacilityLongDecDegs": "-89.575556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.consolidatedpapers.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 74771502,
  "ParentCompanyName": "Consolidated Papers, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6130777,
  "Company2DUNS": 0,
  "OperatorName": "Consolidated Papers, Inc.",
  "OperatorStr1": "231 First Avenue North",
  "OperatorStr2": null,
  "OperatorCity": "Wisconsin Rapids",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54495",
  "OperatorZipCodeExt": null,
  "RMPContact": "David S. Orcutt",
  "RMPTitle": "Environmental Supervisor",
  "FTE": 530,
  "OtherEPAFacilityID": "54481CNSLD2627W",
  "EPAFacilityID": "100000059866",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Sulfur Dioxide",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2000-01-13 00:00:00",
  "DeRegistrationEffectiveDate": "2000-01-10 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 44.48648,
  "FRS_Long": -89.56997,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5550,
      "AltID": null,
      "FacilityID": 4772,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5667,
          "ProcessID": 5550,
          "NAICSCode": "322121",
          "_desc": {
            "NAICS_CODE": "322121",
            "NAICS_DESCRIPTION": "Paper (except Newsprint) Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5964,
          "ProcessID": 5550,
          "ChemicalID": 49,
          "Quantity": 73000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505964,
          "ProcessID": 5550,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4772,
      "SummaryText": "Consolidated Papers, Inc. (CPI) is committed to operating in a manner that is safe for CPI workers, the public, and the environment.  As part of this commitment, CPI has established procedures to help ensure safe operation of the processes at its facilities.  CPI's Wisconsin River Division (Wisconsin River) has developed a risk management program (RMP) that complies with the requirements of the Environmental Protection Agency's (EPA's) regulation 40 CFR Part 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule) and helps to manage the risks of the covered substances and processes.  One of the requirements of the RMP rule is to submit a risk management plan describing the risk management program at Wisconsin River.  This document is intended to satisfy the risk management plan requirements of the RMP rule.\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nIn April 1967, CPI adopted a corporate environmental policy that guides the continuous improvement of its environmental performance as it strives to prevent pollution and achieve the objective of operating facilities with minimal environmental impact.  This policy was updated in November 1996.  The corporate environmental policy statement is publicly available on CPI's Internet website.  As part of its risk reduction objective, CPI will strive to minimize environmental, health, and safety risks to its employees and the communities in which it operates by employing safe technologies and operating procedures.  CPI will be constantly prepared for emergencies.  CPI will continually inform its employees and public of its progress in safety and environmental issues.  \n\nCPI is one of 26 Wisconsin paper companies voluntarily participating in the Wisconsin Paper Council's Pollution Prevention Partnership with the Wisconsin Department of Natural Resources.  As part of this membership, CPI produces an annual report that illustrates CPI and the Wisconsin paper industry's commitme"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4772,
      "SummaryText": "nt to voluntarily reduce the release of substances that could have adverse environmental impacts.  CPI's Pollution Prevention Partnership Progress Report is available to the public.  \n\nCPI has also pledged to voluntarily align its corporate Environmental Management System to ISO 14001 international standards and to adhere to the American Forest and Paper Association's Environmental Health and Safety Principles.\n\n\nFACILITY DESCRIPTION AND THE REGULATED SUBSTANCES HANDLED\n\nCPI is North America's largest producer of coated printing papers and a major manufacturer of supercalendered printing papers for the printing and publishing industries.  In addition, CPI is the leading manufacturer of coated specialty papers used in consumer product packaging and labeling.  CPI also produces elemental chlorine-free kraft pulp for its own use from virgin wood fiber and recycled pulp from printed and post-consumer wastepaper.  Other products manufactured by CPI include paperboard and paperboard products.\n\nCPI is headquartered in Wisconsin Rapids, Wisconsin.  It owns and operates paper and pulp manufacturing facilities in Biron, Kimberly, Appleton, Niagara, Stevens Point, Whiting, and Wisconsin Rapids, Wisconsin, as well as in Duluth, Minnesota.  It also operates wastewater treatment plants in Stevens Point, Niagara, Kimberly, and Wisconsin Rapids, Wisconsin to treat wastewater generated by the pulp and paper manufacturing plants.  Wastewater treatment is also done at the facilities in Duluth, Minnesota.\n\nThe Wisconsin River Division is a pulp and paper mill owned and operated by CPI in Stevens Point, Wisconsin.  At this facility, groundwood pulp and thermomechanical pulp are produced and then used to manufacture lightweight groundwood coated printing papers.  The coated paper product is used for brochures, advertising inserts, corporate annual reports and brochures, catalogs, magazines, and other printed materials. \n\nSulfur dioxide is the only chemical regulated by the RMP rule that "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4772,
      "SummaryText": "are stored or handled at this facility in total quantities greater than or equal to the threshold quantities.  The sulfur dioxide is stored in an aboveground tank with a design capacity of 7,000 gallons.  Administrative controls limit the total quantity of sulfur dioxide stored in the tank to 85% of capacity, which equates to 5,950 gallons.  The quantity of sulfur dioxide stored in the tank is 72,942 lb.  Sulfur dioxide is a toxic gas liquefied by pressure in the storage tank and is used to bleach pulp.\n\nWORST-CASE RELEASE AND ALTERNATIVE RELEASE SCENARIOS\n\nWorst-Case Release Scenario\n\nThe worst-case release scenario involving sulfur dioxide is defined as the rupture of the sulfur dioxide storage tank, instantaneously releasing its entire contents directly to the surrounding ground.  With the administrative controls that limit the tank storage to 85% of the tank's design capacity, the tank stores approximately 72,942 lb (5,950 gallons) of sulfur dioxide.  Prior to unloading a shipment of sulfur dioxide, the Pulp Mill Shift Supervisor verifies that the load can be added to the tank while maintaining less than 85% capacity.  The attending pipefitter and tank truck driver monitor the unloading process until it is concluded.\n\nThe entire spill is assumed to evaporate into the atmosphere.  This scenario was modeled using the Dense Gas Dispersion (DEGADIS) model to predict the toxic endpoint.  The worst-case release of sulfur dioxide is predicted to have offsite impacts on public and environmental receptors.\n\nAlternative Release Scenario\n\nSince the worst-case release scenario predicted offsite impacts, an alternative release scenario involving sulfur dioxide is reported.  The alternative release scenario is defined as a failure of the tubing connecting the sulfur dioxide tank to the process equipment.  Approximately 57,805 lb of sulfur dioxide are released.  The Areal Locations of Hazardous Atmospheres (ALOHA) model was used to predict the toxic endpoint.  The worst-case r"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4772,
      "SummaryText": "elease of sulfur dioxide is predicted to have offsite impacts on public receptors.\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nAs part of its corporate environmental policy, CPI will continue to protect the environment and the health and well-being of fellow employees and communities by monitoring existing facilities to ensure that they meet all legal requirements through the use of safe technologies and operating procedures.\n\nThe Wisconsin River Division complies with the prevention and emergency response procedures from all applicable regulations including certain applicable sections of RCRA and the Occupational Safety and Health Administration (OSHA) Emergency Action Plans (29 CFR 1910.38).\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThere have been no accidents at the Wisconsin River Division in the past five years that resulted in any adverse onsite or offsite impacts.\n\n\nEMERGENCY RESPONSE PROGRAM\n\nWisconsin River's emergency response program includes a written Emergency Response Plan that discusses procedures to be followed in the case of a general emergency and specific procedures for the handling of sulfur dioxide spills to prevent and minimize the effects of an emergency involving this chemical. \n\n\n\nPLANNED CHANGES FOR SAFETY IMPROVEMENTS\n\nThis facility will undergo regular scheduled maintenance and update to meet any new or revised applicable regulation and industry standard to continue to operate safely.  Plans are in place to eliminate sulfur dioxide by the year 2000 (end of 1999)."
    }
  ]
}