{
  "FacilityID": 47741,
  "FacilityName": "Alltech Inc.",
  "FacilityStr1": "3031 Catnip Hill Pike",
  "FacilityStr2": null,
  "FacilityCity": "Nicholasville",
  "FacilityState": "KY",
  "FacilityZipCode": "40356",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21113",
  "LEPC": "Jessamine County LEPC",
  "FacilityLatDecDegs": "37.932800",
  "FacilityLongDecDegs": "-084.554700",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dr. Pearse Lyons",
  "OperatorStr1": "3031 Catnip Hill Pike",
  "OperatorStr2": null,
  "OperatorCity": "Nicholasville",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "40356",
  "OperatorZipCodeExt": null,
  "FTE": 250,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000198261",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-03-22 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-03-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-03-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-02-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-12-12 00:00:00",
  "DeRegistrationEffectiveDate": "2013-08-02 00:00:00",
  "AnniversaryDate": "2012-02-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 69202,
      "AltID": null,
      "FacilityID": 47741,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 92001,
          "ProcessID": 69202,
          "ChemicalID": 57,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 70847,
          "ProcessID": 69202,
          "NAICSCode": "311119",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 47741,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2006-12-01 00:00:00",
    "ERTrainingDate": "2007-01-26 00:00:00",
    "CoordinatingAgencyName": "Local Fire and Police Department",
    "CoordinatingAgencyPhone": "8598875447",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 47741,
      "SummaryText": "\nRISK MANAGEMENT PROGRAM \n\nEXECUTIVE SUMMARY\n\n\n\n\n\nAlltech is a Biotechnology facility that primarily manufactures Animal Feed Supplements that are an additive to animal feed.\n\n\n\nAlltech provides employees with a safe and healthy workplace by being proactive in all phases of the manufacturing operations.  Safety must be a part of every job, and be given the same attention, effort and importance that is give to quality, cost and production.  Management personnel have the responsibility to see that processes are engineered, maintained and operated in a safe manner.  Department Supervisors are responsible for ensuring the safety of their employees and prevention of accidents.  The Safety Committee is charged with providing guidance to assist Supervisors with this responsibility.  Employees are responsible for following Alltech policies and procedures.  Employees are encouraged to inform Supervisors of hazardous conditions or unsafe work practices.  \n\n\n\nAlltech has a Safety Program that informs all employees of the hazards of chemicals used in the workplace and in the event of a spill or leak the actions that will be taken to minimize injuries and damage to the environment.  Alltech has in place a Process Safety Management Program, Emergency Response Program, Hazard Communication Program, Emergency Management Plan, Chemical Warehouse Safety, Alltech Safety Manual, New Employee Safety Orientation, and conducts Safety Training once a month consisting of safety and chemical awareness.   Alltech has an in-house Emergency Response Team to respond to emergencies in the Plant.  \n\n\n\nThe facility has the following engineering and administrative controls applicable to the hazards and their interrelationships:  The engineering controls used to ensure there are no incidents are: security lighting, cameras, perimeter fencing (around the process equipment), and 24/7 armed security at the facility.  All tanks used to store the hazardous chemicals have high level alarms to notify person"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 47741,
      "SummaryText": "nel when filling the tanks.  There is a containment area around the storage tanks to prevent any hazardous chemical from migrating to storm drains and/or surrounding areas.  The administrative controls that are used to prevent accidental releases of Aqua Ammonia are: limited number of employees who are involved in the manufacturing process using this chemical.  Employees involved in these processes are placed with an experienced employee to learn the processes.  Additionally, all processes at Alltech are conducted using a batch card (recipe) outlining the quantity and type of raw materials that will be used to make the finished product.  \n\n\n\nThere have been no incidents within the last five years.\n\n\n\nThe plans developed for Emergency Response have been coordinated with the LEPC, local Fire Department, and Police Department.  The Alltech Emergency Response Team trains on a monthly basis and we conduct an evacuation drill at least once a year.  In the event there was a major release beyond the capability of the Emergency Response Team, Alltech contracts with PECCO Inc. to pick up waste water on a routine basis, and in the event there is a major spill they will provide a hazardous materials response team to cleanup and dispose of the spilled materials.\n\n\n\nAlltech is continually evaluating the processes to find improved manufacturing techniques to minimize the use of hazardous chemicals.  If hazardous chemicals must be used the system is evaluated to determine new mitigation and control procedures as well as new equipment and technology to improve the processes for the overall safety of the employees.\n\n\n\n\n\n"
    }
  ]
}