{
  "FacilityID": 47788,
  "FacilityName": "Southern Family Foods, LLC",
  "FacilityStr1": "184 Bryan Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Shannon",
  "FacilityState": "MS",
  "FacilityZipCode": "38868",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28081",
  "LEPC": "Lee County LEPC",
  "FacilityLatDecDegs": "34.171944",
  "FacilityLongDecDegs": "-088.697778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "UN",
  "LatLongDescription": "CE",
  "FacilityURL": "www.saralee.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 46871559,
  "ParentCompanyName": "Sara Lee Foods",
  "Company2Name": null,
  "CompanyDUNS": 39125570,
  "Company2DUNS": 5213962,
  "OperatorName": "Sara Lee Foods - Tupelo Facility",
  "OperatorStr1": "184 Bryan Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Shannon",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "38868",
  "OperatorZipCodeExt": null,
  "FTE": 167,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000084507",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-08-16 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2007-03-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-03-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2007-02-28 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2012-04-12 00:00:00",
  "DeRegistrationEffectiveDate": "2012-04-05 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 34.16966,
  "FRS_Long": -88.69883,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "61",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C06",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 69289,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 47788,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 92120,
          "ProcessID": 69289,
          "ChemicalID": 56,
          "Quantity": 25205.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 70934,
          "ProcessID": 69289,
          "NAICSCode": "311612",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 40718,
              "Process_NAICS_ID": 70934,
              "SafetyReviewDate": "2006-11-06 00:00:00",
              "PHA_Date": "2006-11-06 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2007-03-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2006-11-06 00:00:00",
              "TrainingReviewDate": "2007-01-10 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Manuals for system operation/shutdown",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-01-10 00:00:00",
              "EquipmentInspectionDate": "2004-09-30 00:00:00",
              "EquipmentTested": "compressors, pumps, vessels,controls",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2006-11-06 00:00:00",
              "PreStartupReviewDate": "2003-06-20 00:00:00",
              "ComplianceAuditDate": "2006-11-06 00:00:00",
              "AuditCompletionDate": "2007-03-30 00:00:00",
              "IncidentInvestigationDate": "2001-08-02 00:00:00",
              "InvestigationChangeDate": "2002-01-20 00:00:00",
              "ParticipationPlansReviewDate": "2006-11-06 00:00:00",
              "HotWorkPermitReviewDate": "2006-11-06 00:00:00",
              "ContractorSafetyReviewDate": "2006-11-06 00:00:00",
              "ContractorSafetyEvalDate": "2006-11-06 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 59476,
                  "PreventionProgram3ID": 40718,
                  "ProcessChemicalID": 92120
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 47788,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2006-11-06 00:00:00",
    "ERTrainingDate": "2006-05-06 00:00:00",
    "CoordinatingAgencyName": "Lee County Emergency Management",
    "CoordinatingAgencyPhone": "6628419020",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 47788,
      "SummaryText": "Executive Summary\nSara Lee Corporation ¿ Tupelo, Mississippi Facility\n\n1.1 \tCorporate Commitment\n\nSara Lee Corporation has a basic and long-standing commitment to responsible stewardship of the environment, protection of the community, protection of employee health, and assurance of product safety.  This commitment extends to the processes covered by the requirements of EPA¿s Risk Management Plan (RMP).  The Tupelo, Mississippi facility of Sara Lee Foods (Sara Lee Tupelo) has developed management systems to prevent the release of regulated substances, especially in locations that may cause detrimental effects to employees, the community, or the environment. These management systems comply with the various applicable governmental regulations. The systems were developed through systematic evaluation of process design, process technology, operational procedures, maintenance activities, non-routine procedures, emergency preparedness, training, and several other factors.\n\nSara Lee Tupelo has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, our trained personnel will respond to control and contain the release.\n\nSara Lee Tupelo plans to meet or surpass all regulatory requirements.  In the attempt to accomplish this goal, management systems at the Tupelo facility have been developed in such a way that the hazards are identified, understood, and controlled to prevent accidents.  \n\n1.2 \tBackground Data\n\nSara Lee Tupelo manufactures pork sausage and a variety of other meat products marketed under the familiar brand name of ¿Sara Lee Foods.¿  Sara Lee has been in operation at this facility has been for over 5 years providing quali"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 47788,
      "SummaryText": "ty meat products and currently provides about 210 jobs to the local community.\n\nIn accordance with Title 40 of the Code of Federal Regulations Chapter 68 (40 CFR 68) promulgated by the Environmental Protection Agency (EPA), Sara Lee Tupelo submits this Risk Management Plan (RMP) for operations at their Tupelo, Mississippi facility.\n\n1.3 \tAccidental Release Prevention and Emergency Response Policy\n\nSara Lee Tupelo is committed to protecting the health of its employees, the surrounding community, and the environment. Therefore, it is Sara Lee Tupelo¿s policy to maintain compliance with 40 CFR 68 as well as Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) regulations promulgated as Title 29 of the Code of Federal Regulations, Chapter 1910, Section 119 (29 CFR 1910.119), and OSHA¿s Hazardous Operations and Emergency Response regulations (29 CFR 1910.120). \n\n1.4 \tStationary Sources and Regulated Substances\n\nThe Tupelo facility operates one process that has more than a threshold quantity of a regulated substance.  That process is the plant-wide ammonia refrigeration process. Low temperatures are required in the food processing areas of the plant within standards set by the United States Department of Agriculture (USDA).  These low temperatures ensure quality and safety in the final products.  Anhydrous ammonia, an industry-standard refrigerant for meat processing plants, is utilized as refrigerant to maintain the food processing areas of the facility within the required range of operating temperatures. \n\nAnhydrous ammonia is the RMP regulated chemical. The refrigeration system, consisting of receivers, compressors, evaporators, condensers, recirculators, and piping, can contain quantities over the 10,000 pound threshold. This process is a Program 3 process as defined by the risk management program rule (40 CFR Part 68).\n\n1.5 \tRelease Scenarios\n\nIn accordance with 40 CFR 68 Subpart B, Sara Lee Tupelo evaluated off-site consequences for r"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 47788,
      "SummaryText": "eleases of anhydrous ammonia.  Both a worst-case scenario and an alternate-case scenario were developed.\n\n1.6 \tAccidental Release Prevention Program\n\nTo prevent and mitigate accidental releases of anhydrous ammonia, Sara Lee Tupelo has implemented precautionary measures. These precautionary measures comply with OSHA¿s PSM regulations and were evaluated and engineered for potential anhydrous ammonia releases.   Examples of some of the controls installed to prevent catastrophic releases of ammonia are vents, pressure relief valves, backup pumps, manual and automatic shutoffs, and electrical distribution system grounding.  In addition, Sara Lee Tupelo has trained approximately eight employees to respond to potential ammonia releases.  These trained employees comprise the facility¿s Process Safety Team.\n\nSara Lee Tupelo has developed Standard Operating Procedures (SOP) for all employees and contractors that have contact with the ammonia refrigeration system.  These procedures incorporate safety measures.  These safety procedures were developed by refrigeration system operators and are reviewed at a frequency sufficient to ensure that they reflect current operating practice, including changes that result from technology improvements and changes in the equipment and facility. \n\nSara Lee Tupelo encourages employee participation in development of the control measures used at the plant by means of company newsletters and training sessions.  Any changes to the operating procedures are communicated to affected employees following written management of change procedures established by Sara Lee Tupelo.\n\nSara Lee Tupelo understands that maintaining the refrigeration system in good working order is essential to preventing accidental releases. Therefore, Sara Lee Tupelo has implemented a preventative maintenance program.  The preventative maintenance program is managed using log sheets to ensure that regular maintenance occurs on the system. These log sheets are maintained in the E"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 47788,
      "SummaryText": "ngineering Department for three years. Also, to ensure the mechanical integrity of critical refrigeration system components, equipment tests are performed. Specifically, the equipment is tested for corrosion.  Refrigeration equipment consists of pressure vessels, headers, pumps, valves, and piping.\n\nTo ensure that Sara Lee Tupelo¿s control measures are effective in maintaining the safe operation of the plant, regularly scheduled audits are performed on the ammonia refrigeration system:\n\n¿\tIn accordance with the Process Safety Management (PSM) program, Sara Lee Tupelo conducts detailed PSM compliance audits at least every three years.  Each audit incorporates review of process safety information, process hazard analysis, operating procedures, training programs, system mechanical integrity, management of change, pre-start up review procedures, compliance audit procedures, incident investigation procedures, employee participation programs, hot work permit procedures, and contractor safety procedures.\n¿\tThe following audits by outside agencies are conducted:\n?\tThe USDA on a continuous basis audits Sara Lee Tupelo.\n?\tThe facility¿s insurance carrier conducts independent audits on a variable annual to biennial basis.\n\n1.7 \tFive-year Accident History\n\nSara Lee Tupelo has an outstanding record of accident prevention. This good record is demonstrated by the fact that over the past five years there have been no accidental releases of anhydrous ammonia that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n1.8 \tEmergency Response Program\n\nSara Lee Tupelo has documented emergency response procedures in a document entitled Emergency Action Plan (EAP) to facilitate response efforts in the event of an off-site hazardous substance release.  Included in the EAP are measures to be taken internally by Sara Lee Tupelo as well as measures to be taken by off"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 47788,
      "SummaryText": "-site response agencies.\n\nTo ensure that the local government response agencies are familiar with Sara Lee Tupelo¿s emergency response procedures, current copies of the EAP are provided for review to the Lee County Emergency Planning Committee (LEPC).\n\nTo plan for hazardous substance release with off-site efforts, Sara Lee Tupelo¿s EAP includes procedures and equipment to mitigate the release, procedures to inform local response agencies, evacuation procedures, and procedures for public communication.  The facility has also arranged emergency response assistance with a local clean-up contractor, Ferguson-Harbour, Inc.\n\nIn the event of a hazardous substance release with off-site effects, the general public will be warned using the following methods:\n?\tFacility alarm whistle or klaxon;\n?\tPolice and fire vehicles equipped with public address systems; and\n?\tDoor-to-door notification of residents if necessary.\n1.9 \tPlanned Changes to Improve Safety\n\nAmmonia refrigeration is a mature industry employing known technology.  Yet, the plant remains abreast of current innovations that improve safety.  To this end, the Sara Lee Corporation is an active member of International Institute of Ammonia Refrigeration (IIAR) and the Refrigeration Engineers Training Association (RETA).  This involvement enables the facility to learn and implement the most modern safety system improvements as they emerge within the ammonia refrigeration industry.  Recently installed equipment and maintenance tracking systems enhance reliable operation of the RMP covered process. Some of the most recent planned improvements include an expanded operator training program and preventative maintenance scheduling system.\n\n1.10 \tRisk Management Plan Changes\n\nIn accordance with 40 CFR 68.195, Sara Lee Tupelo will correct this RMP for changes as follows:\n\nNew accident history information ¿ For any accidental release meeting the five-year accident history reporting criteria, Sara Lee Tupelo will submit the required"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 47788,
      "SummaryText": "data with respect to that accident within six months of the release time or by the time RMP is updated under 40 CFR 68.190, whichever is earlier.\n\nEmergency contact changes ¿ Within one month of any change in the emergency contact information required under 40 CFR 68.160(b)(6), Sara Lee Tupelo shall submit a correction of that information."
    }
  ]
}