{
  "FacilityID": 4779,
  "FacilityName": "City of Findlay Water Pollution Control Center",
  "FacilityStr1": "1201 South River Road",
  "FacilityStr2": null,
  "FacilityCity": "Findlay",
  "FacilityState": "OH",
  "FacilityZipCode": "45840",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39063",
  "LEPC": "Hancock County LEPC",
  "FacilityLatDecDegs": "41.0475",
  "FacilityLongDecDegs": "-83.663056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "ci.findlay.oh.us",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Findlay",
  "Company2Name": null,
  "CompanyDUNS": 781411301,
  "Company2DUNS": null,
  "OperatorName": "City of Findlay",
  "OperatorStr1": "1201 South River Road",
  "OperatorStr2": null,
  "OperatorCity": "Findlay",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45840",
  "OperatorZipCodeExt": null,
  "FTE": 33,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000060051",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-07-10 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2001-08-22 00:00:00",
  "DeRegistrationEffectiveDate": "2001-07-09 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 41.04568,
  "FRS_Long": -83.66417,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5558,
      "AltID": "Chlorination System",
      "FacilityID": 4779,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 6000,
          "ProcessID": 5558,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5675,
          "ProcessID": 5558,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2263,
              "Process_NAICS_ID": 5675,
              "SafetyReviewDate": "1998-10-22 00:00:00",
              "PHA_Date": "1998-10-22 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-01 00:00:00",
              "TrainingReviewDate": "1999-06-01 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-01 00:00:00",
              "EquipmentInspectionDate": "1999-05-01 00:00:00",
              "EquipmentTested": "Chlorinators, scales, injectors",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-01 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2544,
                  "PreventionProgram3ID": 2263,
                  "ProcessChemicalID": 6000
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4779,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Findlay Fire Department",
    "CoordinatingAgencyPhone": "4194224242",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4779,
      "SummaryText": "The City of Findlay's Water Pollution Control Center utilizes more than a threshold quantity of chlorine (2,500 pounds) in their process.  Therefore, this facility is required to submit a Risk Management Plan (RMP) as defined in '68.150 by June 21, 1999.  Public employees are covered under the State of Ohio's Public Employee Risk Reduction Program (PERRP), which has adopted by reference the requirements of OSHA's (PSM) standard.  Based on the March 1999 revised USEPA RMP Guidance for WWTPs, the Findlay Water Pollution Control Centert is subject to the OSHA Process Safety Management (PSM) standard because of the Ohio law and is therefore subject to the Program 3 requirements of the RMP Regulations.\n\n\n'68.155(a) Accidental Release and Emergency Response Policies\n\nThe Findlay Water Pollution Control Center has documented emergency response procedures in place, as documented in the facility's Emergency Action Plan.  This plan has been endorsed by the City staff responsible for the operation and maintenance of the Findlay WPCC.  The City of Findlay WPCC has procedures in place, including both onsite activities and coordination with offsite responders, that must be followed in the event of a chlorine leak.  All personnel involved in handling chlorine are trained with regard to chlorine safety and accident prevention.\n\n\n'68.155(b) Stationary Source and Substance Handled\n\nThe stationary source subject to 40 CFR Part 68 is the City of Findlay WPCC Chlorination Facility.  The Findlay WPCC has a design capacity of 11 million gallons per day (MGD) and treats domestic and industrial wastewater generated from the City of Findlay and the Village of Arcadia.  The facility is divided into two individual rooms, the Chlorination Room and the Control Room,  and has an outside Storage/Unloading area.  \n\nThe chlorine ton containers are stored and actively connected to the manifold in the outdoor covered Storage/Unloading area.  Provisions are made to house six (6) one-ton containers.  Tw"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4779,
      "SummaryText": "o chlorine containers are placed on scales and are connected to the manifold.  The remaining four tanks under the covered area are stored on truions.  As the manifolded containers are exhausted, containers are moved from storage to the scales and the empty containers are placed on truions until the next shipment of chlorine is received.  Chlorine gas is fed under pressure from the containers through the manifold adjacent to the scale to the  vacuum regulator.  From the vacuum regulator, chlorine is fed under a vacuum to the Chlorinator Room.  Two vacuum chlorinators and one chlorine injector are provided for solution chlorine feed at various process locations.  Vacuum chlorine feed reduces the likelihood of a release into the environment.\n\nA chlorine leak detector is installed in the Chlorination Room to alert the plant staff quickly in the event of a chlorine leak.  The chlorine leak detector is located next to the chlorinators.  A warning light automatically lights when the chlorine level reaches 1 ppm and an audible alarms automatically sound inside and outside of the building when chlorine levels reach 3 ppm.  \n\n'68.155(c) Offsite Consequence Analysis\n\nAs a Program 3 Process with one toxic gas, one worst-case release scenario and one alternative release scenario have been assessed for the Chlorination Facility.  The City of Findlay WPCC has chosen to use the US EPA Risk Management Program Guidance for Wastewater Treatment Plants (40 CFR Part 68), US EPA 550-B-98-010, October 1998, (WWTP Guidance), as a source to determine off-site consequences.  This guidance specifically addresses the chemicals commonly found at WWTPs. \n \nThe worst-case release scenario was determined in accordance with the requirements provided in 40 CFR 68.22 and 40 CFR 68.25(b,c).  For the Findlay Water Pollution Control Cener the worst-case scenario is a total release from one of the one-ton containers of chlorine (greatest amount held in a single vessel) over 10 minutes.  This results in o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4779,
      "SummaryText": "ffsite impacts. The facility is also required to complete at least one alternative release scenario that reaches an endpoint offsite.  The alternative release scenario was evaluated in accordance with the guidelines provided in 40 CFR 68.22 and 40 CFR 68.28.  The most likely release scenario is identified based on the results of the Process Hazard Analysis (PHA).  The alternative release scenario for chlorine that results in offsite impacts is a vapor release through a 5/16 inch opening from a valve failure or break in the flexible tubing line.  \n\n'68.155(d) Accidental Release Prevention Program\n\nThe Findlay WPCC facility has a documented Prevention Program for the chlorination facility that documents release prevention measures.  These prevention measures include elements such as employee participation, process safety information, process hazard analysis, operating procedures, training, contractors, pre-startup review, mechanical integrity, hot work permits, management of change, incident investigation, and compliance audits.  \n\nFindlay WPCC is equipped with leak detection monitoring to decrease response time in the event of a chlorine leak.  A chlorine leak detector is located next to the chlorinators.  A warning light automatically lights when the chlorine level reaches 1 ppm and an audible alarms automatically sound inside and outside of the building when chlorine levels reach 3 ppm.  Also, Findlay WPCC employees who are involved in chlorine operations are trained in specific procedures regarding handling and storage of chlorine at the facility.\n\n'68.155(e) Five-Year Accident History\n\nThe Findlay WPCC facility has had no accidental releases of chlorine in the last five years that have resulted in on-site injuries or off-site injuries or other impacts. \n\n'68.155(f) Emergency Response Program\n\nThe City of Findlay WPCC is a non-responding facility, as defined by OSHA and EPA (29 CFR 1910.120 and 40 CFR part 311).  Therefore the City of Findlay WPCC has developed an"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4779,
      "SummaryText": "Emergency Action Plan to ensure employee safety instead of an Emergency Response Program, as allowed by 40 CFR 68.90(b). The Findlay WPCC facility Emergency Action Plan outlines actions required to respond to a chlorine emergency and has coordinated this plan with the City Fire Department.  City Fire Department personnel are the designated first responders in the event of a chlorine emergency.  Findlay WPCC employees are not designated responders to a chlorine release.  As specified in 40 CFR 68.90, Findlay WPCC's Emergency Action Plan meets the exception listed in 40 CFR 68.90(b) and therefore, the facility is not required to have the Emergency Response Program of 40 CFR 68.95.\n\n'68.155(g) Safety Improvements\n\n Recommendations for safety improvements were identified in the Process Hazard Analysis (PHA) which was completed per OSHA 29 CFR 1910.119(e) in October of 1998.  Recommended improvements were identified in three main categories: Standard Operating Procedures, Maintenance, and Training.  According to the Process Safety Management Plan, any safety improvements will be investigated concerning their impacts on other systems and/or procedures prior to implementation.  Additional recommendations may be made upon review of any accidents and/or when the PHA is updated every five years."
    }
  ]
}