{
  "FacilityID": 4780,
  "FacilityName": "Richard Miller Water Treatment Plant",
  "FacilityStr1": "5651 Kellogg Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Cincinnati",
  "FacilityState": "OH",
  "FacilityZipCode": "45228",
  "Facility4DigitZipExt": "1123",
  "FacilityCountyFIPS": "39061",
  "LEPC": "Hamilton County LEPC",
  "FacilityLatDecDegs": "39.073056",
  "FacilityLongDecDegs": "-84.423056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Cincinnati Water Works",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Cincinnati Water Works",
  "OperatorStr1": "5651 Kellogg Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Cincinnati",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45228",
  "OperatorZipCodeExt": "1123",
  "FTE": 150,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000060024",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-12 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 39.07306,
  "FRS_Long": -84.42306,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5559,
      "AltID": "Chlorination Facility",
      "FacilityID": 4780,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 6001,
          "ProcessID": 5559,
          "ChemicalID": 62,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5676,
          "ProcessID": 5559,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2264,
              "Process_NAICS_ID": 5676,
              "SafetyReviewDate": "1999-06-02 00:00:00",
              "PHA_Date": "1997-04-11 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-06-02 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Chlorine Scrubber",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1997-06-27 00:00:00",
              "TrainingReviewDate": "1997-06-27 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-05-30 00:00:00",
              "EquipmentInspectionDate": "1999-06-02 00:00:00",
              "EquipmentTested": "Chlorine ton container, connections, valves, and flexible tubing.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1997-06-27 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1997-06-27 00:00:00",
              "HotWorkPermitReviewDate": "1997-06-27 00:00:00",
              "ContractorSafetyReviewDate": "1997-06-27 00:00:00",
              "ContractorSafetyEvalDate": "1997-06-27 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Richard Miller WTP Post-Chlorination facility is divided into several individual rooms dedicated to specific tasks:  the Storage/Unloading Room, Chlorinator Room, Scrubber Room, Electrical Room, Transformer Room, and Breathing Air Room.  The storage room houses five banks of 12 one-ton containers that store chlorine as a pressurized liquid.  One bank is solely for storage of the chlorine ton containers, and the other four banks hold the ton containers that are connected to the process.  In any one of the four process banks of containers, six one-ton containers remain on-line at all times while the remaining containers are on stand-by for automatic changeover when the contents of the on-line containers are exhausted.  Chlorine gas is fed from the containers through the  automatic changeover system.  Vacuum chlorinators and associated chlorine injectors are provided for solution chlorine feed at various process locations.  Vacuum chlorine feed reduces the likelihood of a release into the environment.",
              "_chemicals": [
                {
                  "PrimaryKey": 2545,
                  "PreventionProgram3ID": 2264,
                  "ProcessChemicalID": 6001
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4780,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "HAZMAT Response Unit, Rescue 52",
    "CoordinatingAgencyPhone": "5133522314",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4780,
      "SummaryText": "The Cincinnati Water Works, Richard Miller Water Treatment Plant (WTP) utilizes more than a threshold quantity of chlorine (2,500 pounds) in their process.  Therefore, this facility is required to submit a Risk Management Plan (RMP) as defined in '68.150 by June 21, 1999 (three years after publication of the final rule).  Public employees are covered under the State of Ohio's Public Employee Risk Reduction Program (PERRP), which has adopted by reference the requirements of OSHA's (PSM) Standard.  Based on the March 1999 revised USEPA RMP Guidance for Wastewater Treatment Plants (WWTPs) (EPA 550-B-98-010), the Richard Miller WTP is subject to the OSHA Process Safety Management (PSM) Standard and is therefore subject to Program 3 requirements of the RMP Regulation.\n\n'68.155(a) Accidental Release and Emergency Response Policies\n\nThe Richard Miller WTP has documented emergency response procedures in place, as documented in the facility's Emergency Action Plan.  This plan has been endorsed by the City staff responsible for the operation and maintenance of the Richard Miller WTP.  The Richard Miller WTP has procedures in place, including both onsite activities and coordination with offsite responders, that must be followed in the event of a chlorine leak.  All personnel involved in handling chlorine are trained with regard to chlorine safety and accident prevention.\n\n'68.155(b) Stationary Source and Substance Handled\n\nThe stationary source subject to 40 CFR Part 68 is the Richard Miller WTP Post-Chlorination Facility.  The Richard Miller WTP has a capacity of 220 million gallons of water per day (MGD) and treats surface water to drinking water standards.  The Richard Miller WTP Post-Chlorination Facility is divided into several individual rooms dedicated to specific tasks:  the Storage/Unloading Room, Chlorinator Room, Scrubber Room, Electrical Room, Transformer Room, and Breathing Air Room.  \n\nThe Storage Room houses five banks of 12 one-ton containers that store chlorin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4780,
      "SummaryText": "e as a pressurized liquid.  One bank is solely for storage of the chlorine ton containers, and the other four banks hold the ton containers that are connected to the process.  In any one of the four process banks of containers, six one-ton containers remain on-line at all times while the remaining containers are on stand-by for automatic changeover when the contents of the on-line containers are exhausted.  Chlorine gas is fed from the containers through the  automatic changeover system.  Vacuum chlorinators and associated water operated injectors are provided for solution chlorine feed at various process locations.  Vacuum chlorine feed reduces the likelihood of a release into the environment.\n\nThe Post-Chlorination Facility is equipped with many safety features to prevent any public exposure in the event of a chlorine leak.  Several chlorine leak detectors are located throughout the Storage Room and one in the Chlorinator Room.  To allow safety personnel time to respond to emergencies, audible alarms automatically sound inside and outside of the building when chlorine levels reach 0.5 ppm.  At 3 ppm the building ventilation system automatically shuts down to contain the chlorine inside the building at which time the scrubber system may be manually activated to remove the chlorine from the  facility air. In addition, the chlorine header was placed below grade to minimize the likelihood of the header being ruptured by a ton container falling on it during placement.\n\n'68.155(c) Offsite Consequence Analysis\n\nAs a Program 3 Process with one toxic gas, one worst-case release scenario and one alternative release scenario will be assessed for the Post-Chlorination Facility.  The Richard Miller WTP has chosen to use the US EPA Risk Management Program Guidance for Wastewater Treatment Plants (40 CFR Part 68), US EPA 550-B-98-010, October 1998, (WWTP Guidance), as a guide to determine off-site consequences.  This guidance specifically addresses the chemicals commonly found a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4780,
      "SummaryText": "t WWTPs.  The chlorination process for WTPs is similar to the chlorination process at WWTPs.  Therefore, this guidance document is applicable to the Richard Miller WTP's chlorination process.\n\nThe worst-case release scenario was determined in accordance with the requirements provided in 40 CFR 68.22 and 40 CFR 68.25(b,c). The worst case release scenario for chlorine is the loss of 2,000 lbs (largest vessel) in 10 minutes.  This results in a release rate of 200 lb/min and does have offsite impacts.  For the alternative release scenario, the most likely release scenario is identified based on the results of the Process Hazard Analysis (PHA).  However, if this scenario does not reach an endpoint offsite, 40 CFR 68.28 requires a different scenario be chosen that will potentially reach an endpoint offsite.  At Richard Miller WTP, the most likely release scenario of chlorine identified in the PHA will not reach an endpoint offsite due to the active mitigation of the chlorine scrubber.  The chlorine scrubber is connected to the Post-Chlorination Facility and would be used in the event of a chlorine leak.   Due to the definition of alternative release in 40 CFR 68.28, Richard Miller WTP is required to identify a less likely scenario that results in an endpoint offsite as their alternative release scenario for the RMP.  Therefore, the alternative release scenario for chlorine that results in offsite impacts is a vapor release through a 3/16 inch opening from a valve, gasket, union, flexible tubing or piping.  This alternative release scenario accounts for the passive mitigation of the chlorination building but does not consider the active mitigation of the scrubber.  \n\n'68.155(d) Accidental Release Prevention Program\n\nThe Richard Miller WTP facility has a documented Prevention Program for the Post-Chlorination Facility that documents release prevention measures.  These prevention measures include elements such as employee participation, process safety information, process ha"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4780,
      "SummaryText": "zard analysis, operating procedures, training, contractors, pre-startup review, mechanical integrity, hot work permits, management of change, incident investigation, and compliance audits.  \n\nRichard Miller WTP is equipped with many safety features to prevent any public exposure in the unlikely event of a chlorine leak.  Several chlorine leak detectors are located throughout the Storage Room and one in the Chlorinator Room.  To allow safety personnel time to respond to emergencies, audible alarms automatically sound inside and outside of the building when chlorine levels reach 0.5 ppm.  At 3 ppm the building ventilation system automatically shuts down to contain the chlorine inside the building at which time the scrubber system may be manually activated to remove the chlorine from the  facility air.  In addition, the chlorine header was placed below grade to minimize the likelihood of the header being ruptured by a ton container falling on it during placement.  Richard Miller WTP employees who are involved in chlorine operations are trained in specific procedures regarding handling and storage of chlorine at the facility.\n\n'68.155(e) Five-Year Accident History\n\nThe Post-Chlorination facility was completed in 1997.  No accidents, as described under 40 CFR Part 68.42(a), have occurred at this facility since it began operation.\n\n'68.155(f) Emergency Response Program\n\nThe Richard Miller WTP is a non-responding facility, as defined by OSHA and EPA (29 CFR 1910.120 and 40 CFR part 311).  Therefore the Richard Miller WTP has developed an Emergency Action Plan to ensure employee safety instead of an Emergency Response Program, as allowed by 40 CFR 68.90(b). The Richard Miller WTP facility Emergency Action Plan outlines actions required to respond to a chlorine emergency and has coordinated this plan with Rescue 52.  Rescue 52 personnel are the designated first responders in the event of a chlorine emergency.  Richard Miller WTP employees are not designated responders to a c"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4780,
      "SummaryText": "hlorine release.  As specified in 40 CFR 68.90, Richard Miller WTP's Emergency Action Plan meets the exception listed in 40 CFR 68.90(b), and therefore the facility is not required to have the Emergency Response Program of 40 CFR 68.95.\n\n'68.155(g) Safety Improvements\n\nRecommendations for safety improvements were identified in the Process Hazard Analysis (PHA) which was completed per OSHA 29 CFR 1910.119(e) on April 11, 1997.  Recommended improvements were identified in three main categories: Standard Operating Procedures, Maintenance, and Training.  According to the PSM, any safety improvements will be investigated concerning their impacts on other systems and/or procedures prior to implementation.  Additional recommendations may be made upon review of any accidents and/or when the PHA is updated every five years."
    }
  ]
}