{
  "FacilityID": 47806,
  "FacilityName": "Nash Finch Company - Lumberton, NC Division",
  "FacilityStr1": "121 Cold Storage Road",
  "FacilityStr2": null,
  "FacilityCity": "Lumberton",
  "FacilityState": "NC",
  "FacilityZipCode": "28360",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37155",
  "LEPC": "Robeson County LEPC",
  "FacilityLatDecDegs": "34.661111",
  "FacilityLongDecDegs": "-079.107694",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.nashfinch.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6962294,
  "ParentCompanyName": "Nash Finch Company",
  "Company2Name": null,
  "CompanyDUNS": 6962294,
  "Company2DUNS": 0,
  "OperatorName": "Nash Finch Company",
  "OperatorStr1": "PO Box 1709",
  "OperatorStr2": null,
  "OperatorCity": "Lumberton",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28359",
  "OperatorZipCodeExt": null,
  "RMPContact": "Russ Hoade",
  "RMPTitle": "Sr. Director of Distribution",
  "FTE": 243,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000177961",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-27 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-03-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-03-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-03-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-03-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 34.66111,
  "FRS_Long": -79.10769,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-NEAREST INTERSECTION",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 69325,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 47806,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 70972,
          "ProcessID": 69325,
          "NAICSCode": "42441",
          "_desc": {
            "NAICS_CODE": "42441",
            "NAICS_DESCRIPTION": "General Line Grocery Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 92167,
          "ProcessID": 69325,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 592167,
          "ProcessID": 69325,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 47806,
      "SummaryText": "The Nash Finch Company - Lumberton Distribution Center business is food products warehousing and distribution to client grocery stores and distribution centers.  The principal building includes a perishable warehouse with an ammonia refrigeration system which contains over 10,000 pounds of ammonia.  The closed ammonia refrigeration system contains a maximum intended inventory of 15,000 pounds of ammonia.\nThe facility has an active Process Safety Management Program.  Access to the ammonia equipment is restricted to only a select few trained, authorized operating/maintenance personnel.  All service work is preformed by a service contractor.  The majority of the distribution piping and critical isolation valves which contain ammonia are located outside of thte refrigerated spaces, above the roof, and, therefore, are not susceptible to damage from accidental, inadvertent contact by lift trucks and lifted loads.  However, air cooling units are located within the refrigerated spaces, but so as to minimize susceptibility to inadvertent contact, all equipment and associated piping within those spaces are located as high as possible within the space.\n\nA hazard analysis was completed for this facility and worst case and alternative case scenarios were completed.\n\nAn OSHA-prescribed Process Safetey Management Program is in place at the Perishable Warehouse.  Under that program, the major components of the process are inspected frequently.  Operating conditions are constantly monitored by a computerized system with integral alarms that notify process operators of an upset.  The readily distinguished odor of ammonia alerts persons in the constantly inhabited areas where amminia containing piping and equipment is located, and electronic ammonia detectors are located in each room where ammonia piping and equipment is located.  These ammonia detectors are remotely monitored for ammonia levels.  Shutoff valves which allow operator to isolate section of piping/equipment from areas of"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 47806,
      "SummaryText": " safety, such as the somewhat isolated compressor room area, are installed and are readily accessible.  The compressor room area is well vented with high volume fans, asnd is readily accessible in case of a release in that area.\nAs testimony to the overall safety of the ammonia refrigeration at this facility, and the diligence of the process operators, no accidents have occurred within the last five years which have necessitated an offsite response or have had any offsite consequences.  \nThe Robeson Conuty LEPC is charged with the primary responsibility for emergency response at this location.  Nash Finch - Lumberton has adopted the INTEGRATED CONTINGENCY PLAN format preferred by EPA and OSHA for preparing and implementing its onsite Emergency Action and Response Plan.  Under this plan, emergency training and practive drills will be frequent and will cover a multitude of potential scenarios.  Key managers will become involved immediately upon the recognition and characterization of all non-incidential ammonia releases, and their duties will be as follows: (a) coordination of and direction to  onsite and external emergency responders; (b) notification of agencies and on-site safety and security; ( c) protection and continuation of business operation and employee welfare; and (d) communication with the public as necessary.  Nash Finch Company continues to investigate and implement changes to the ammonia process in order to improve safety and minimize risks associated with it.  The annual operating budget includes sufficient allocation of fiscal resources to continuously maintain and improve the process and promote the training of opoerators and supervisory personnel."
    }
  ]
}