{
  "FacilityID": 48116,
  "FacilityName": "Warneck Pump Station",
  "FacilityStr1": "23557 NYS Rt. 37",
  "FacilityStr2": null,
  "FacilityCity": "Watertown",
  "FacilityState": "NY",
  "FacilityZipCode": "13601",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36045",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "44.006667",
  "FacilityLongDecDegs": "-075.903056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": "www.danc.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 175359876,
  "ParentCompanyName": "Development Authority of the North Country",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Robert Juravich",
  "OperatorStr1": "Dulles State Office Building",
  "OperatorStr2": "317 Washington Street",
  "OperatorCity": "Watertown",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13601",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bryon Perry",
  "RMPTitle": "General Manager",
  "FTE": 9,
  "OtherEPAFacilityID": "13601WRNCK23557",
  "EPAFacilityID": "100000047102",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-04-22 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-04-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-04-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-04-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-03-07 00:00:00",
  "DeRegistrationEffectiveDate": "2019-03-07 00:00:00",
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 44.00498,
  "FRS_Long": -75.90115,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 69762,
      "AltID": "Sewage Treatment",
      "FacilityID": 48116,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 71424,
          "ProcessID": 69762,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 92751,
          "ProcessID": 69762,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 592751,
          "ProcessID": 69762,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48116,
      "SummaryText": "On June 20, 1996, the U.S. Environmental Protection Agency (USEPA) published the Final RMP Rule [61 Federal Register 31667] requiring all facilities to develop and implement a risk management program by June 20, 1999.  The Final Rule, which appears in Section 40 of the Code of Federal Regulation (CFR) Section 68 (amended), applies to stationary sources which have more than a threshold quantity of a regulated substance in a process.  The Development Authority of the North Country (Authority) has developed this RMP to meet the requirements of these regulations and to help minimize the potential for negative impacts on human health and the environment as a result of the hazardous materials used at the facility.\n\nThe Development Authority of the North Country is a New York State agency that uses chlorine gas to control odors in wastewaters that are processed through the Warneck Sewage Pump Station facility. The Warneck Pump Station facility handles domestic sewage that is transmitted from local communities and the U.S. Department of Army's Fort Drum facility to the City of Watertown's Wastewater Treatment Plant. The chlorine used at the Warneck Pump Station in the City of Watertown, NY is listed as a regulated substance in 40 CFR '68.130.  The threshold quantity for chlorine is 2,500 pounds.  The chlorine room at the Warneck Pump Station may contain as much as 8,000 pounds of chlorine at one time stored in one-ton canisters.\n\nComprehensive preventative and emergency response policies are a key component to the Authority's approach to minimizing potential risks to the environment and human health. The Development Authority of the North Country's is committed to maintaining the health and safety of employees.  It is the policy of the Authority to take appropriate measures to protect the health and safety of employees in the performance of their assigned work, giving full regard to evolving industry practices and regulatory requirements. The Authority shall follow operatin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48116,
      "SummaryText": "g practices that will safeguard employees and the public. The overall responsibility for employee safety at all Authority facilities is with the Authority Board of Directors, Executive Director, and the facility managers. The Authority will provide appropriate professional advice and counsel to help meet the health and safety policies and responsibilities when applicable. The Health and Safety Committee, made up of employee's from various departments and payrolls, makes recommendations to assist and guide communication in health and safety policies. Employees are responsible for following the health and safety program, complying with all rules and regulations.  Employees must work in a safe manner while performing all normal and emergency or unusual activities.  Employees are expected to use sound judgment during all activities to promote job safety at all times.  Management participates in periodic inspections to ensure that policies and procedures are enforced.\n\nThe Development Authority of the North Country operates its facilities in a manner that complies with all applicable federal, state and local regulatory requirements including the Occupational Safety & Health Administration's Process Safety Management program. As part of this program, the Authority has developed a written program that includes employee participation, process safety information, process hazard analysis, operating and maintenance procedures, enmployee and contractor training, startup safety reviews, mechanical integrity checks, hot work permits, management of change, incident investigation, emergency planning and response, and complaince auditing. This program provides a systematic process to minimize the potential for negative impacts as a result of a hazardous material release from the Authority's Warneck Pump Station.  \n\nAs part of the Risk Management Process the Development Authority is required to report details on its accident history for the last five years. The Authority has had zero"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48116,
      "SummaryText": " accidental releases related to its chlorine process in the past five years. \n   \nThe Authority's Emergency Response program consists of coordination and communication with local resonders, personnel training and drills, and continued focus on improved health and safety programs. Specifically, the Authority provides several training programs designed to increase operator effectiveness in an emergency response situation including HAZWOPER, annual drills, SCBA and personal protective equipment training, chlorine canister repair training, etc. All of these training programs are refreshed annually with each Operator. Local responders are periodically involved in coordinated site drills to increase awareness regarding the facility and potential emergency response strategies. The Development Authority Facilities are equipped with alarm monitoring equipment that will automatically notify employees and emergency response personnel in the event of a chlorine release 24 hours a day, 265 days per year. This alarm notification system will allow emergency response crews to quickly respond to an emergency siutation any time of the day or night. Through an extensive training program, emergency responders are ready to effectively deal with any potential incidents in a manner that protects human health and the environment.  \n\nOverall, the Development Authority believes that it has established thorough programs and procedures to address health and safety at its facilities. These efforts are ongoing and include monthly safety meetings, scheduled training throughout the year for all employees, continued focus on improved preventative maintenance programs for facility equipment. Through these ongoing efforts the Development Authority believes that it will be able to strenghthen its existing programs and continue to develop safer ways to manage their facilities and protect employees."
    }
  ]
}