{
  "FacilityID": 48131,
  "FacilityName": "CVC Specialty Chemicals, Inc. - Maple Shade Plant",
  "FacilityStr1": "2980 Rt 73 North",
  "FacilityStr2": null,
  "FacilityCity": "Maple Shade",
  "FacilityState": "NJ",
  "FacilityZipCode": "08052",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34005",
  "LEPC": "Maple Shade Township OEM",
  "FacilityLatDecDegs": "39.959167",
  "FacilityLongDecDegs": "-074.988611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "cvcchem.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 68310150,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "CVC specialty Chemicals, Inc.",
  "OperatorStr1": "2980 Rt 73 North",
  "OperatorStr2": null,
  "OperatorCity": "Maple Shade",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08052",
  "OperatorZipCodeExt": null,
  "FTE": 40,
  "OtherEPAFacilityID": "NJR000004010",
  "EPAFacilityID": "100000151444",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-08-08 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "USEPA and New Jersey RMP Submission",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2007-04-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-04-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2007-04-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2024-06-04 00:00:00",
  "DeRegistrationEffectiveDate": "2023-12-31 00:00:00",
  "AnniversaryDate": "2012-04-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 39.9591,
  "FRS_Long": -74.9879,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "163",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 69784,
      "AltID": "Specialty Epoxy Prod.",
      "FacilityID": 48131,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 92780,
          "ProcessID": 69784,
          "ChemicalID": 21,
          "Quantity": 308700.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 71446,
          "ProcessID": 69784,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 40991,
              "Process_NAICS_ID": 71446,
              "SafetyReviewDate": "2005-06-22 00:00:00",
              "PHA_Date": "2005-06-22 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "1.  emergency relief catch tank; 2.  overflow catch tank",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Security Measures",
              "OpProceduresReviewDate": "2006-04-19 00:00:00",
              "TrainingReviewDate": "2006-11-26 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": "Outside (vendor)",
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2006-03-30 00:00:00",
              "EquipmentInspectionDate": "2007-01-26 00:00:00",
              "EquipmentTested": "1. R106 agitator gear box and temperature evulation, hybrid vacuum system performance inspection, all reactors integrity tested,R105 reactor bottom valve actuator operation.",
              "ChangeMgmtDate": "2006-03-30 00:00:00",
              "ChangeMgmtReviewDate": "2005-11-22 00:00:00",
              "PreStartupReviewDate": "2006-06-02 00:00:00",
              "ComplianceAuditDate": "2006-11-20 00:00:00",
              "AuditCompletionDate": "2007-12-30 00:00:00",
              "IncidentInvestigationDate": "2006-12-05 00:00:00",
              "InvestigationChangeDate": "2006-01-25 00:00:00",
              "ParticipationPlansReviewDate": "2005-06-22 00:00:00",
              "HotWorkPermitReviewDate": "2005-06-22 00:00:00",
              "ContractorSafetyReviewDate": "2006-12-28 00:00:00",
              "ContractorSafetyEvalDate": "2005-06-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 59885,
                  "PreventionProgram3ID": 40991,
                  "ProcessChemicalID": 92780
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 48131,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2006-11-26 00:00:00",
    "ERTrainingDate": "2006-11-26 00:00:00",
    "CoordinatingAgencyName": "Maple Shade Township Fire Company",
    "CoordinatingAgencyPhone": "8567791335",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48131,
      "SummaryText": "II. General Information and Regulated Substances Handled\n\nCVC Specialty Chemicals, Inc. (CVC) purchased the Maple Shade, New Jersey facility from Akzo-Nobel Chemicals, Inc. in June 1995.  Full occupancy of the site took place in November 1995 after completion of construction activities to upgrade and convert the site for research and development and small scale manufacturing of specialty epoxy monomers and resins based on epichlorohydrin chemistry.\n\nThe Maple Shade, New Jersey site is the Corporate Headquarters for CVC and serves as the principle site for scale-up, semi-works and small scale manufacturing of epoxy resins and monomers.  CVC handles only one of the listed EPA RMP or NJDEP TCPA listed chemicals above threshold quantities - epichlorohydrin.  Epichlorohydrin is the basic building blocks chemical used in epoxy manufacturing and provides the basis for the site risks management and accident prevention plans.\n\nEpichlorohydrin is handled on site in bulk in quantities that do not exceed 308,700 lb.  Storage facilities include one 15,000-gallon aboveground storage tank for fresh epichlorohydrin storage and one 6,000-gallon storage tank for recycle epichlorohydrin storage.  Process equipment includes four reactors that are 1,200-gallons, 2,000-gallons and two 4,100 gallon reactors in capacity.\n\nThe epoxy resins and monomers (modifiers) produced by CVC are used primarily in the specialty coatings industry.  Applications include civil engineering coatings such as floor coatings, tank and secondary containment linings, and structural steel primers.  Other common uses include adhesives, and specialty automotive and aviation coatings and composites.\n\nIII. Accidental Release Prevention and Emergency Response Policies\n\nThe Maple Shade facility is designed and operated to minimize the potential for on-site or off-site safety and environmental impact to employees and the surrounding community.  In 1995, the facility was upgraded with the help of a major engineering/const"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48131,
      "SummaryText": "ruction firm to provide state of the art engineering controls for manufacturing specialty epoxies.\n\nThe company management has demonstrated its commitment to safety and environmental compliance by involving the expertise of employees and consulting engineers in the principals of Process Safety Management.  Since the June start-up in 1996, the company has not had an accidental release involving the hazardous chemical.  There have been no incidents to date of an on-site or off-site injury or illness due to epichlorohydrin handling or exposure.\n\nAccidental Release Prevention is managed by CVC using methodology encouraged by OSHA PSM and the New Jersey Toxic Catastrophic Prevention Act (TCPA).  The CVC Maple Shade Facility is operated as an RMP Program 3 facility.  Engineering and operational protocols include:\n\nProcess Safety Information - Process, equipment and chemical safety reviews were conducted prior to start-up and as an on-going policy for refresher training and any process changes.\n\nProcess Hazard Analysis - Hazard and operability studies (HAZOP) are used for all facility hazard analysis.  Action plans are documented and implemented for all risk reduction items.\n\nStandard Operating Procedures - SOP's are documented and updated on a continuous basis and include start up, shut down and normal operating procedures for manufacturing epoxy resins.\n\nTraining - A training schedule for all operating personnel is planned, executed and documented on an annual basis.  Training includes required regulatory training for hazard communications, hazardous waste, emergency response and process training.  Refresher training is conducted as required.\n\nMechanical Integrity - Preventive maintenance (PM) procedures are in place to assure continuing safe operation of process equipment.  A work order and PM system is utilized to monitor equipment integrity and reliability.  A computer maintenance management system (CMMS) was implemented.\n\nIncident Investigation - CVC actively utilize"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48131,
      "SummaryText": "s an incident investigation procedure to document and follow-up are all near-miss and full scale safety, operating and environmental related accidents.\n\nMaintenance - Safe work permits including Line Entry, Hot Work, Electrical Lockout and Confined Space are in place.  Contractor safety procedures and orientation requirements are enforced for all contact project work.\n\nManagement of Change and Pre-Start-up Review - CVC has in place a Process Change Authorization (PCA) procedure that requires a full safety, environmental and operating review and approval prior to implementation of any material or procedural process change.  Pre-Start-Up safety reviews are conducted prior to any new process start-up.\n\nEmergency Response - CVC has a full Emergency Response (ER) and Discharge Prevention, Containment and Countermeasure (DPCC) Plan in place.  ER and DPCC manuals were first established in 1997. In 2003 Emergency drill exercises with the Township's Fire Company and LEPC officials, NJDEP and county residents were conducted.  Internal Company emergency response and evacuation exercises are on-going and documented as part of the safety program.\n\nCompliance Audit - Annual internal compliance audits for EPA RMP and NJDEP developed and implemented and have been improved upon.  Site performance will be measured against required RMP elements and a report with remedial actions issued on an annual basis.\n\nIV. Planned Safety Improvements\n\nCVC, as a new operating company, plans to continuously enhance existing procedures and solidify the company philosophy and prevention program elements required by EPA, RMP and NJDEP TCPA.  \n                                                                                                                                                                 Hazard and Operability Study (HAZOP) - A second, more comprehensive HAZOP of the epoxy manufacturing unit was completed in July, 2002. New technical personnel were added in 2002, a Chemical Engineer, PHD a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 48131,
      "SummaryText": "s Director of Technology, Maintenance Manager and a Manager of Health, Safety and Environmental.  All professional personel with years of operating experience. Since installation of the two 4,100 gallon reactor units in June, 2001 continious procedural and engineering control improvements are being performed to further safeguard the proven production plant. A new 15,000-gallon stainless steel storage tank for epichlorohydrin was installed in 2002.\n\nEmergency Response Drills are planned and will involve the local fire and rescue squad, LEPC and NJDEP.  New emergency response and safety equipment and gear will be added to expand and improve response capabilities.\n\nSecondary containment improvements to the process area and tank farm was finished in 2002.\n\nIn 2003 CVC had indicated the process of becoming a ISO 9000 certified company, expected to receive final certification in 2004. Final audit in February 2004.\n\nA label maker was purchased in 2003 in order to facilitate relabeling the process equipment.\n\nAdditional out door Lighting and a security policy was written and initial training was conducted in 2003, training will be finished and security fencing will be upgraded in 2004. \n\nConstruction of a new warehouse for finished product and shipping was started in late 2003 and expected to be finished in 2004.\n\nAll unessential personnel will move off site in a leased office in 2004.\n\n In 2004 Security policy was rewritten at the end 2004 and training to begin in 2005. Upgrades to Gates were performed which included fencing around Compactors scheduled in 2005 is finish upgrades to primeter fencing. Local ordiance mandates a 6 foot high max with no barbed wire. CVC is seeking a variance to increase to 8 foot with barbed wire.\n\n\nKnox box installed for local fire department, also response equipment upgraded for handling potential threats from terrorist. \n\nIn 2005 around March the plant will be going to a seven day around the clock operation.\n\nIn 2005 Security fencing was not"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 48131,
      "SummaryText": "approved by the township of Maple shade for a 8 foot barbed wire fence. CVC was only granted a 8 foot no barbed wire fence. CVC only changed the South fence with the 8 foot no barbed wire. The rest of the fencing as kept 6 foot with barbed wire that was alrady grandfathered. Security camers is being quoted and expected to be installed for 2007.\n\nAround the clock operation is in effect for CVC 7 days a week.\n\nThe five year revalidation process was performed in 2005 on the process hazard analysis with the risk assessment. Submitted along with the annual report with new recommendation and corrective action.\n\nPopulation count has updated in the RMP using landview.\n\nDrill in 2006 went well included local emergency responders, community and other department response.\n\nSecurity equipment was purchased and installation of gate, video survaliance to finished in early 2007.\n\nNO changes made to RMP data, Installation of new Locker rooms and lunch rooms and flooring.\n\nAdditional clean up was performed along with upgrades in lighting.\n\nTwo management employees resigned in 2006, process engineers. New Manager in Production for 2006."
    }
  ]
}