{
  "FacilityID": 48189,
  "FacilityName": "Dollarhide Gas Plant",
  "FacilityStr1": "35 miles s.w. of Andrews, Texas",
  "FacilityStr2": "State Hwy 128",
  "FacilityCity": "Andrews",
  "FacilityState": "TX",
  "FacilityZipCode": "79714",
  "Facility4DigitZipExt": "0029",
  "FacilityCountyFIPS": "48003",
  "LEPC": "Andrews County LEPC",
  "FacilityLatDecDegs": "32.146944",
  "FacilityLongDecDegs": "-103.056667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 877634014,
  "ParentCompanyName": "Chevron MidContinenet L.P.",
  "Company2Name": null,
  "CompanyDUNS": 1345164,
  "Company2DUNS": 0,
  "OperatorName": "Chevron MidContinenet L.P.",
  "OperatorStr1": "15 Smith Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Midland",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79705",
  "OperatorZipCodeExt": null,
  "FTE": 22,
  "OtherEPAFacilityID": "TXD980747588",
  "EPAFacilityID": "100000087498",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-00841",
  "SafetyInspectionDate": "2004-07-21 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-05-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-05-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-05-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-07-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 32.14667,
  "FRS_Long": -103.05722,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) STANDARD POSITION (SA ON)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "C04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 69855,
      "AltID": "Natural Gas Liquid Extrac",
      "FacilityID": 48189,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 92866,
          "ProcessID": 69855,
          "ChemicalID": 155,
          "Quantity": 681873.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 74028,
              "ProcessChemicalID": 92866,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 74029,
              "ProcessChemicalID": 92866,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 74030,
              "ProcessChemicalID": 92866,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 74031,
              "ProcessChemicalID": 92866,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 74032,
              "ProcessChemicalID": 92866,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 74033,
              "ProcessChemicalID": 92866,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 74034,
              "ProcessChemicalID": 92866,
              "ChemicalID": 98
            }
          ]
        },
        {
          "ProcessChemicalID": 92867,
          "ProcessID": 69855,
          "ChemicalID": 98,
          "Quantity": 55039.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 71522,
          "ProcessID": 69855,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 48189,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Andrews County LEPC",
    "CoordinatingAgencyPhone": "4325241419",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48189,
      "SummaryText": "Risk Management Plan\nDollarhide Gas Plant\n\nExecutive Summary\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES     \n\nThe Dollarhide Gas Plant has a long-standing commitment to worker and public safety.  This commitment is demonstrated by our efforts in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, facility trained personnel will evaluate the situation, take actions within the capabilities of the facility, and/or notify the necessary outside agencies\n  \nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES     \n\nThe Dollarhide Gas Plant, located 35 miles southwest of Andrews, Texas on Hwy.128, operates a variety of processes to extract natural gas liquids from natural gas.  The Dollarhide Gas Plant has regulated flammables, including: Propane, Normal Butane, Isobutane, Ethane, and Methane.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM \n\nThe following is a summary of the accident prevention program in place at the Dollarhide Gas Plant.  Processes at the Dollarhide  Gas Plant which are regulated by the Environmental Protection Agency?s (EPA?s) risk management program (RMP) regulation are also subject to the Occupational Safety and Health Administration?s (OSHA?s) process safety management (PSM) standard.  This summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.\n\nEmployee Participation\n\nThe Dollarhide Gas Plant encourages employees to participate in all facets of process safety management and accident prevention.  Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a process hazard analysis (PHA) team.  Employees have access to all information created "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48189,
      "SummaryText": "as part of the facility?s accident prevention program.  Specific ways that employees can be involved in the accident prevention program are documented in an employee participation plan that is maintained at the facility and addresses each accident prevention program element.  In addition, the facility has a number of initiatives under way that address process safety and employee safety issues.  These initiatives include forming teams to promote both process and personal safety.  The teams typically have members from various areas of the plant, including operations, maintenance, engineering, and plant management.\n\nProcess Safety Information\n\nThe Dollarhide Gas Plant keeps a variety of technical documents that are used to help maintain safe operation of the processes.  These documents address chemical properties and associated hazards, limits for key process parameters and specific inventories, and equipment design basis/configuration information.  The Dollarhide maintains up-to-date process safety information.  A table summarizing the reference documents and their location is readily available as part of the written employee participation plan to help employees locate any necessary process safety information.\n\nChemical-specific information, including exposure hazards and emergency response/ exposure treatment considerations, is provided in material safety data sheets (MSDSs).  For specific process areas, the facility has documented safety-related limits for specific process parameters (e.g., temperature, level, composition) in Operator Procedure Manual. The facility maintains the process within these limits by using process controls and monitoring instruments, trained personnel, and protective instrument systems (e.g., automated shutdown systems).\n\nThe facility also maintains files that provide information about the design and construction of process equipment.  This information includes:  material of construction, design and construction of process equipment.  This "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48189,
      "SummaryText": "information, in combination with procedures and equipment operating history, provides a basis for inspection and maintenance activities, as well as for evaluating proposed process and facility changes so safety features in the process are not compromised.\n\nProcess Hazard Analysis (PHA)\n\nThe Dollarhide Gas Plant has a comprehensive program to identify and control hazards associated with the various processes are identified and controlled.  Within this program, each process is systematically examined to identify potential hazard controls in place to manage these hazards, and recommend additional controls, as appropriate.\n\nThe Dollarhide Gas Plant uses hazard and operability studies (HAZOP?s), which are conducted using a team of employees who have operating and maintenance experience as well as engineering expertise.  This team identifies and evaluates potential hazard of the process as well as accident prevention and mitigation measures, and the team makes suggestions for additional prevention and/or mitigation measures. \n\nThe PHA team findings are forwarded to local management for resolution. Implementation of mitigation options in response to PHA findings is based on a relative risk ranking assigned by the PHA team.  The approved mitigation options in response to PHA team findings are tracked until they are completed.  The final resolution of each finding is documented and retained.\n\nThe Dollarhide Gas Plant periodically updates and revalidates the hazard analysis results.  These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating.  The results and findings from these updates are documented and retained.  Once again, the team findings are forwarded to management for consideration, and the final resolution of the findings is documented and retained.\n\nOperating Procedures\n\nThe Dollarhide Gas Plant maintains written procedures that address various modes of process operations, such as (1)"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 48189,
      "SummaryText": " Initial startup, (2) normal startup, (3) normal operations, (4) temporary operations, (5) consequences of deviation (6) normal shutdown, and (7) emergency shutdown.  These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.  These procedures are periodically reviewed and annually certified as current and accurate.  The procedures are kept current and accurate by revising them as necessary to reflect changes.  In addition, the Dollarhide Gas Plant maintains information on how to respond to upper or lower limit exceedances for specific process or equipment parameters.  This information, along with written operating procedures, is readily available to operators in the process unit and for other personnel to use as necessary to safely perform their job tasks.\n\nTraining\n\nTo complement the written procedures for process operations, the Dollarhide Gas Plant has implemented a comprehensive training program for all employees involved in operating a process.  New employees receive basic training in process operations if they are not already familiar with such operations.  After successfully completing this training, a new operator is paired with a senior operator to learn process-specific duties and tasks.  After operators demonstrate adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently. In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  This refresher training is conducted at least every 3 years, or more frequently upon request.  All of this training is documented for each operator, including the means used to verify demonstrate (e.g., via verbal and written tests, skills demonstration, etc.) that the operator understood the training.\n\nContractors\n\nThe Dollarhide Gas Plant uses contractors to supplement its workforce durin"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 48189,
      "SummaryText": "g periods of increased maintenance or construction activities. Because some contractors work on or near process equipment, the facility has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site safety rules, and (6) inform facility personnel of any hazards that they find during their work.  This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices prior to their beginning work.  In addition, the Dollarhide Gas Plant evaluates contractor safety programs and performance during the selection of a contractor.  Facility personnel periodically monitor contractor performance with regard to their safety obligations.\n\nPre-startup Safety Reviews (PSSRs)\n\nThe Dollarhide Gas Plant conducts a PSSR for any new facility or facility modification that requires a change in the process safety information.  The purpose of the PSSR is to see that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides one additional check that construction is in accordance with the design specifications and that all supporting systems are operationally ready. A PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\n\nMechanical Integrity)\n\nThe Dollarhide Gas Plant has established practices and procedures to maintain process equipment, pressure vessels, piping systems, relief systems, controls, pumps and compressors in a safe operating condition.  The basic aspects of this program include: (1) conducting training, "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 48189,
      "SummaryText": "(2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, (5) applying quality assurance measures.  In combination, these activities form a system that maintains the mechanical integrity of the process.\n\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their jobs in a safe manner. Written procedures provide that work is performed in a consistent manner and serve as basis for training.  Inspections and tests are performed to help verify that equipment functions as intended and that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels).  If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service.  This may require that a management of change team review the use of the equipment and determine what actions are necessary.   \n  \nAn integral part of the mechanical integrity program is quality assurance.  The Dollarhide Gas Plant incorporates quality assurance measures into equipment purchases and repairs. This helps determine that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\n\nSafe Work Practices\n\nThe Dollarhide Gas Plant has long-standing safe work practices in place to help provide worker and process safety.  Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to isolate energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping or equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work), and (5) a permit and procedure to verify that adequate precautions are in place befor"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 48189,
      "SummaryText": "e entry into a confined space.  These procedures (and others), along with training of affected personnel, form a system to help perform operations and maintenance activities safely.\n\nManagement of Change\n\nThe Dollarhide Gas Plant has a comprehensive system to manage changes to all covered processes.  This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented.  Changes are reviewed to (1) determine that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, as well as procedures are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided any necessary training on the change.\n\nIncident Investigation\n\nThe Dollarhide Gas Plant promptly investigates all incidents related to a covered process that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident.  The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to facility management for resolution.  Corrective actions taken in response to the investigation team's findings and recommendations are tracked until they are complete.  The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings.  Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during fu"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 48189,
      "SummaryText": "ture PHAs and PHA revalidation. \n\nCompliance Audits\n\nTo help determine that the accident prevention program is functioning properly, the Dollarhide Gas Plant periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  Compliance audits are conducted at least every 3 years.  Both hourly and staff personnel participate in these audits.  The audit team develops findings that are forwarded to facility management for resolution.  Corrective actions taken in response to the audit team's findings are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained.  \n\nCHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe processes at the Dollarhide Gas Plant have hazards that must be managed for continued safe operation.  The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\n\nUniversal Prevention Activities\n\nThe accident prevention program summarized previously is applied to all RMP-covered processes at the Dollarhide Gas Plant.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n\nSpecialized Safety Features\n\nThe Dollarhide Gas Plant has safety features on many units to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of (mitigate) a release.  The following types of safety features are used in the covered processes: \n  \nRelease Detection\n\n1.    Hydrocarbon (if applicable - and hydrogen sulfide) detectors with alarms.\n\nRelease Containment/Control\n\n1. Process relief valves that discharge to a flare to capture and incinerate episodic releases\n\n2. Valves to permit isolation of the process (manual or automated)\n\n3. Automated shutdown systems for specific process parameters (e.g., high temperature"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 48189,
      "SummaryText": ")\n\n4. Curbing or diking to contain liquid releases\n\n5. Redundant equipment and instrumentation (e.g., uninterruptible power supply for process control system, backup firewater pump)\n\n6. Atmospheric relief devices.\n\nRelease Mitigation\n\n1. Fire suppression and extinguishing systems \n\n2. Deluge system for specific equipment\n\n3. Trained emergency response personnel\n\n4. Personal protective equipment (e.g., chemical protective clothing, self-contained breathing apparatus)\n\n5. Blast-resistant shield to help protect control systems and personnel.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe Dollarhide Gas Plant has an excellent record of accident prevention over the past 5 years.  There have been no accidental releases of regulated substances that resulted in onsite or offsite effects during the prior five years at the Dollarhide Gas Plant.  In case of an incident, we will investigate the incidents to determine ways to prevent similar incidents from recurring. \n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nThe Dollarhide Gas Plant maintains a written emergency, which is in place to help protect worker and public safety as well as the environment.  The Emergency Action Plan identifies steps to be taken in case of an accidental release including: proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs. Employees receive training in these procedures as necessary to perform their specific emergency duties.  The Emergency Action Plan is updated when necessary, based on modifications made to processes or other Dollarhide Gas Plant facilities.  The Emergency Action Plan changes are administered through the MOC process, which includes informing and/or training affected personnel in the changes.\n\nThe overall emergency response program for the Dollarhide Gas Plant has been coordinated with local Andrews County, Andrews Fire Department.  This coordinatio"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 48189,
      "SummaryText": "n includes periodic meetings with the Local Emergency Planning Committee (LEPC), which includes local emergency response officials, local government officials, and industry representatives.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Dollarhide Gas Plant resolves findings from PHAs, some of which result in modifications to the process.  The following types of changes are expected over the next few years in response to PHA, safety audit, and incident investigation findings:"
    }
  ]
}