{
  "FacilityID": 48209,
  "FacilityName": "Clackamas Distribution Center Remodel",
  "FacilityStr1": "16800 S.E. Evelyn St.",
  "FacilityStr2": null,
  "FacilityCity": "Clackamas",
  "FacilityState": "OR",
  "FacilityZipCode": "97015",
  "Facility4DigitZipExt": "9576",
  "FacilityCountyFIPS": "41005",
  "LEPC": "Oregon LEPC",
  "FacilityLatDecDegs": "45.401295",
  "FacilityLongDecDegs": "-122.562714",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.safeway.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 602453441,
  "ParentCompanyName": "Safeway Inc.",
  "Company2Name": null,
  "CompanyDUNS": 9137209,
  "Company2DUNS": 0,
  "OperatorName": "Safeway,Inc (Environmental Affairs)",
  "OperatorStr1": "4410 Rosewood Drive",
  "OperatorStr2": null,
  "OperatorCity": "Pleasanton",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94588",
  "OperatorZipCodeExt": "3492",
  "FTE": 550,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000062219",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-10-14 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-05-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-04-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-04-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-02-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 45.40228,
  "FRS_Long": -122.56446,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C06",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 69877,
      "AltID": "Produce Remodel",
      "FacilityID": 48209,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 92894,
          "ProcessID": 69877,
          "ChemicalID": 56,
          "Quantity": 26685.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 71545,
          "ProcessID": 69877,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 41063,
              "Process_NAICS_ID": 71545,
              "SafetyReviewDate": "2005-02-01 00:00:00",
              "PHA_Date": "2005-01-26 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2005-06-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Additional precautionary signage and the erection of condenser platforms to facilitate safe maintenance activities.",
              "OpProceduresReviewDate": "2004-08-09 00:00:00",
              "TrainingReviewDate": "2004-04-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-04-01 00:00:00",
              "EquipmentInspectionDate": "2004-06-14 00:00:00",
              "EquipmentTested": "Compressors, evaporators, condenser",
              "ChangeMgmtDate": "2004-04-01 00:00:00",
              "ChangeMgmtReviewDate": "2004-04-01 00:00:00",
              "PreStartupReviewDate": "2005-02-17 00:00:00",
              "ComplianceAuditDate": "2003-05-04 00:00:00",
              "AuditCompletionDate": "2003-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-06-10 00:00:00",
              "HotWorkPermitReviewDate": "2004-06-10 00:00:00",
              "ContractorSafetyReviewDate": "2004-06-10 00:00:00",
              "ContractorSafetyEvalDate": "2004-06-10 00:00:00",
              "CBI_Flag": 0,
              "Description": "Ammonia Refrigerated Warehousing.",
              "_chemicals": [
                {
                  "PrimaryKey": 59974,
                  "PreventionProgram3ID": 41063,
                  "ProcessChemicalID": 92894
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 48209,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Clackamas Fire Department",
    "CoordinatingAgencyPhone": "5036558911",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48209,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies\n\nThe management and staff of the Clackamas Distribution Center are committed to operating the Distribution Center with the highest regard for the safety of the public, Distribution Center personnel, and the environment.  To ensure the safety of the public, Distribution Center personnel, and the environment, the Distribution Center has implemented a management system that integrates the elements of OSHA's Process Safety Management (PSM) standard, 29 CFR 1910.119 and EPA's Risk Management Program (RMP) rule, 40 CFR part 68.  The policies and procedures integrated under the Distribution Center's management system specifically address prevention of the release of anhydrous ammonia, and emergency response to an accidental release of ammonia.\n\nDescription of Processes, and Regulated Substances Handled at the Clackamas Distribution Center\n\nThe Clackamas Distribution Center operates several refrigerated warehouses and freezers.  Anhydrous ammonia is used as a refrigerant in the mechanical compression refrigeration system at the Clackamas Distribution Center.  Ammonia is handled in a closed-loop process that consists of the following general stages:  Liquid storage; Expansion; Evaporation; Compression; and Condensation.\n\nMechanical refrigeration is a physical process, rather than a chemical process:  the ammonia undergoes no chemical changes in the refrigeration cycle.  Heat is removed from the product being refrigerated or frozen as ammonia changes phase from liquid to vapor.  By reliquefying the ammonia vapor, the ammonia can be used continuously in the refrigeration cycle.\n\nThe ammonia refrigeration system is the only process at the Clackamas Distribution Center which is subject to the EPA RMP rule (and the OSHA PSM standard).  Anhydrous ammonia is the only regulated substance handled in the ammonia refrigeration system.\n\nAt ambient temperature and pressure, ammonia is a colorless gas with a characteristic, irr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48209,
      "SummaryText": "itating odor.  Ammonia is highly soluble in water.  Ammonia is the third highest-volume chemical produced in the United States.  The chemical formula of ammonia is NH3.  Anhydrous ammonia is handled both as a pressurized liquid at ambient temperature and as a refrigerated liquid at or below ambient pressure within the Clackamas Distribution Center refrigeration system.\n\nAccidental Release Prevention Program\n\nThe Distribution Center's accidental release prevention program consists of the following elements:  Process Safety Information; Process Hazard Analysis; Operating Procedures; Training; Contractors; Pre-Startup Safety Review; Mechanical Integrity; Hot Work Permit; Management of Change; Incident Investigation; Compliance Audits; and Employee Participation.  The purpose and scope of each element is briefly described below.\n\nProcess Safety Information - The purpose of compiling the required Process Safety Information is to enable Distribution Center personnel who work with the ammonia refrigeration system to identify and understand the hazards posed by ammonia refrigeration.  The Distribution Center's Process Safety Information procedure addresses:  Information requirements pertaining to the hazards of ammonia; Information requirements pertaining to the technology of the process; Information requirements pertaining to the equipment in the process; and Process Safety Information accessibility requirements.\n\nProcess Hazard Analysis - The purpose of the Distribution Center's PHA procedure is to describe the method for conducting process hazard analyses of the Distribution Center's ammonia refrigeration system.  The Distribution Center's PHA procedure addresses:  PHA methodology; PHA scope; PHA team requirements; Employee participation requirements; System established to promptly address the PHA team's recommendations; PHA update and revalidation requirements; PHA report retention requirements; and PHA report distribution requirements.\n\nOperating Procedures - The purpo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48209,
      "SummaryText": "se of the Distribution Center's Operating Procedure policy is to provide a method for developing and implementing written operating procedures to give clear instructions for safely conducting activities associated with the Distribution Center's ammonia refrigeration system.  The Distribution Center's Operating Procedure policy addresses:  Development and implementation of written procedures to provide clear instructions for safely conducting activities involved in each covered process; Development and documentation of process operating limits; Development and documentation of process safety and health considerations; Operating procedure accessibility requirements; Operating procedure review requirements; and Safe work practice requirements for employees and contractors to provide for control of hazards during operations.\n\nTraining - The purpose of the Distribution Center's Training procedure is to ensure that personnel involved in operating the Distribution Center's ammonia refrigeration system have received and understood training in:  an overview of the Distribution Center's ammonia refrigeration system; the operating procedures required in the Operating Procedures element of the Distribution Center's PSM program; safety and health hazards associated with the Distribution Center's ammonia refrigeration system; and applicable safe work practices.  The Distribution Center's Training procedure addresses:  Initial training requirements; Refresher training requirements; Documentation of employee training; and Testing to ensure that required training has been understood.\n\nContractors - The purpose of the Distribution Center's Contractors procedure is to establish a method for ensuring that all contractors are adequately trained to perform work on or near the Distribution Center's ammonia refrigeration system.  The Distribution Center's Contractors procedure addresses the responsibilities of the Distribution Center and the contract employer with respect to ensuring the s"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 48209,
      "SummaryText": "afety of contractors working on or near the Distribution Center's ammonia refrigeration system.\n\nPre-Startup Safety Review - The purpose of the Distribution Center's Pre-Startup Safety Review procedure is to ensure that new or modified facilities that handle regulated substances are safely started up.  The Distribution Center's Pre-Startup Safety Review procedure (PSSR) addresses:  PSSR Checklist completion prior to startup of new or modified facilities; The method for determining when a PSSR shall be performed, and PSSR Team selection; The system to ensure that new Process Safety Information has been compiled; The system to ensure that all materials and construction are in accordance with design specifications; The system to ensure that all safety, operating, maintenance, and emergency procedures are in place and adequate; The system to ensure that a Process Hazard Analysis has been performed for new facilities, and that recommendations have been addressed prior to startup; The system to ensure that Management of Change requirements are met prior to start-up of modified facilities; The system to ensure that operations and maintenance employees are trained prior to start-up; and Documentation of the Pre-Start Safety Review.\n\nMechanical Integrity - The purpose of the Distribution Center's Mechanical Integrity policy is to establish the requirements of the Mechanical Integrity program at the Clackamas Distribution Center.  The purpose of the Mechanical Integrity program is to ensure that process equipment used to handle anhydrous ammonia is designed, constructed, and maintained to minimize the risk of accidental release.  The Distribution Center's Mechanical Integrity program addresses the following activities as they relate to the Distribution Center's ammonia refrigeration system:  Training in the Distribution Center's ammonia refrigeration system and its hazards, and in the safe conduct of maintenance activities; Inspection and testing; Correcting deficiencies in e"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 48209,
      "SummaryText": "quipment; and Quality assurance in fabrication, installation, and maintenance.\n\nHot Work Permits - The purpose of the Distribution Center's Hot Work Permit procedure is to define how Hot Work Permits are issued and to ensure compliance with permit requirements before and during hot work.  The Distribution Center's Hot Work Permit procedure addresses:  General requirements; The Hot Work Permit; Authorization of hot work; Fire prevention precautions; and Fire watchers.\n\nManagement of Change - The purpose of the Distribution Center's Management of Change procedure is to establish the Distribution Center's requirements for managing changes to the Distribution Center's ammonia refrigeration system.  This procedure provides direction in identifying, reviewing, and authorizing process changes prior to their implementation in order to minimize their potential impact on safety and health.  The Distribution Center's Management of Change Procedure addresses the following:  Identifying process changes; Reviewing process changes; Training necessitated by process changes; Updating Process Safety Information; Updating operating procedures; and Authorizing process changes.  Specific actions included within reviewing process changes are:  documenting the technical basis for the proposed change; assessing the impact of the proposed change on safety and health; modifying operating procedures, as necessary; and documenting and tracking the intended duration of the change (temporary vs. permanent).\n\nIncident Investigation - The purpose of the Distribution Center's Incident Investigation procedure is to provide a method for  reporting, investigating, and preventing reoccurrence of incidents that result in or could reasonably have resulted in a catastrophic release of ammonia.  The Distribution Center's Incident Investigation procedure addresses:  Reporting incidents; The procedure for initiating an incident investigation; The establishment of an Incident Investigation Team, and requireme"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 48209,
      "SummaryText": "nts for the selection of Team members; Investigating the incident; Preparation of the Incident Investigation Report and the minimum requirements of the Report; The system established to promptly address and resolve the report findings and recommendations; and The method for reviewing the findings of the Incident Investigation with all operating, maintenance, and other affected personnel (including contract employees) whose work assignments are relevant to the findings.\n\nCompliance Audits - The purpose of the Distribution Center's Compliance Audits procedure is to establish the requirements for an audit that verifies that the Distribution Center is meeting the requirements of OSHA's Process Safety Management (PSM) standard, and EPA's Risk Management Program rule.  The Distribution Center's Compliance Audits procedure requires triennial review of the Distribution Center's PSM program/RMP Prevention Program procedure documents, and evaluation of the implementation of these procedures by conducting records reviews, employee interviews, and field inspections.  The Distribution Center's Compliance Audit procedure also requires that recommendations be formulated to resolve any identified deficiencies.  The Distribution Center's Compliance Audits procedure addresses:  Pre-audit activities; Conduct of the PSM program/RMP Prevention Program compliance audit; and Post-audit activities, including taking action to resolve any identified deficiencies.\n\nEmployee Participation - The purpose of the Distribution Center's Employee Participation procedure is to document the method of actively involving Distribution Center employees in the development and conduct of the Distribution Center's Process Safety Management elements.  The purpose of involving employees in the development and conduct of the Distribution Center's PSM elements is to foster commitment to the enhancement of process safety.  The Distribution Center's Employee Participation procedure addresses:  The method of consult"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 48209,
      "SummaryText": "ing employees (and their representatives) on the conduct and development of each element in the Distribution Center's process safety management program; and The method for providing employees (and their representatives) access to all process safety management documents and records.\n\nFive-year Accident History\n\nOver the past five years (February 2000 - February 2005), the Clackamas Distribution Center has not had any ammonia releases that resulted in deaths, injuries, property damage, environmental damage, or offsite evacuations.\n\nEmergency Response Program\n\nThe Distribution Center has an emergency action plan that addresses the following:  Evacuation; Emergency release notification; and First aid/medical management.  The Distribution Center's emergency response program is coordinated with the local fire department.\n\nAll Distribution Center employees receive training in the emergency action plan.  The local fire department is invited to participate in the Distribution Center's emergency action plan drills, in order to familiarize fire department personnel with the Distribution Center's process and emergency procedures.\n\nPlanned Changes to Improve Safety\n\nThe Distibution Center has recently completed construction on an ammonia refrigeration system renovation project; the system will begin operation in Febraury 2005. This is a state-of-the-art system that replaces 2 older compressor rooms with a single cental compressor room, new piping, ammonia vessels, evaporators and condensers, a computerized refrigeration control system, ammonia detection throughout and revised RMP Prevention Programs.  \n\nIn conjunction with the Management of Change for this installation, a Process Hazard Analysis was conducted in January 2005.  The Process Hazard Analysis included:\n- Hazard and Operability (HAZOP) study;\n- series of safety checklists; and\n- facility inspection.\n\nThe mitigation measures resulting from this study include additional additional precautionary signage and the installat"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 48209,
      "SummaryText": "ion of condenser platforms to assist maintenance operations.  All action items resulting from this study are due to be completed by July 2005."
    }
  ]
}