{
  "FacilityID": 48258,
  "FacilityName": "Sonora Gas Plant",
  "FacilityStr1": "5.5 SE on FM 1691",
  "FacilityStr2": "P.O. Box 1008",
  "FacilityCity": "Sonora",
  "FacilityState": "TX",
  "FacilityZipCode": "76950",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48435",
  "LEPC": "Sutton County LEPC",
  "FacilityLatDecDegs": "30.506900",
  "FacilityLongDecDegs": "-100.588850",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G7",
  "LatLongDescription": "OT",
  "FacilityURL": "http://www.dcpmidstream.com/",
  "FacilityEmailAddress": "gvrhoadarmer@dcpmidstream.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "DCP Midstream, LP.",
  "Company2Name": null,
  "CompanyDUNS": 610437142,
  "Company2DUNS": 610437142,
  "OperatorName": "DCP Midstream, LP.",
  "OperatorStr1": "370  17th Street",
  "OperatorStr2": "Suite 2500",
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80202",
  "OperatorZipCodeExt": "5609",
  "FTE": 11,
  "OtherEPAFacilityID": "TX0988026522",
  "EPAFacilityID": "100000065573",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "O-00125",
  "SafetyInspectionDate": "2004-04-16 00:00:00",
  "SafetyInspectionBy": "Corp. Compliance Review",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": "05/10/2007 - C04- ownership change -Ann.04/17/2011",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2007-06-12 14:30:02",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-05-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2007-05-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-04-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 30.509167,
  "FRS_Long": -100.579444,
  "FRS_Description": "AIR RELEASE STACK",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 70004,
      "AltID": "Gas Plant",
      "FacilityID": 48258,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 93105,
          "ProcessID": 70004,
          "ChemicalID": 155,
          "Quantity": 1372881.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 74057,
              "ProcessChemicalID": 93105,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 74058,
              "ProcessChemicalID": 93105,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 74059,
              "ProcessChemicalID": 93105,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 74060,
              "ProcessChemicalID": 93105,
              "ChemicalID": 94
            }
          ]
        },
        {
          "ProcessChemicalID": 93106,
          "ProcessID": 70004,
          "ChemicalID": 98,
          "Quantity": 180000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 71683,
          "ProcessID": 70004,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 41175,
              "Process_NAICS_ID": 71683,
              "SafetyReviewDate": "2005-12-10 00:00:00",
              "PHA_Date": "2006-06-30 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-04-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Ground water monitoring wells",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2005-05-19 00:00:00",
              "TrainingReviewDate": "2005-06-06 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-05-15 00:00:00",
              "EquipmentInspectionDate": "2006-01-20 00:00:00",
              "EquipmentTested": "Plant vessels internal inspections",
              "ChangeMgmtDate": "2006-01-12 00:00:00",
              "ChangeMgmtReviewDate": "2006-01-12 00:00:00",
              "PreStartupReviewDate": "2006-01-12 00:00:00",
              "ComplianceAuditDate": "2004-12-10 00:00:00",
              "AuditCompletionDate": "2005-06-15 00:00:00",
              "IncidentInvestigationDate": "2005-05-22 00:00:00",
              "InvestigationChangeDate": "2005-09-23 00:00:00",
              "ParticipationPlansReviewDate": "2006-02-24 00:00:00",
              "HotWorkPermitReviewDate": "2006-04-03 00:00:00",
              "ContractorSafetyReviewDate": "2005-12-29 00:00:00",
              "ContractorSafetyEvalDate": "2005-06-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 60167,
                  "PreventionProgram3ID": 41175,
                  "ProcessChemicalID": 93105
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 48258,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2006-04-03 00:00:00",
    "ERTrainingDate": "2005-12-20 00:00:00",
    "CoordinatingAgencyName": "Sutton Co. Fire/Ambulance/Sheriff",
    "CoordinatingAgencyPhone": "3253872288",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 7,
      "FacilityID": 48258,
      "SummaryText": "lop corrective actions to prevent a recurrence of the incident or a similar incident.  The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to Sonora Gas Plant management for resolution.  Corrective actions taken in response to the investigation team=s findings and recommendations are tracked until they are completed.  The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings.  Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHAs and PHA revalidations.\n\nCompliance Audits\n\nTo help ensure that the accident prevention program is functioning properly, the Sonora Gas Plant periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  Compliance audits are conducted at least every 3 years.  Personnel from other gas plants compose the Audit Team.  Both hourly and staff personnel participate as audit team members.  The audit team develops findings that are forwarded to Sonora Gas Plant management for resolution.  Corrective actions taken in response to the audit team's findings are traced until they are completed.  The final resolution of each finding is documented, and the two most recent audit reports are retained.\n\n\n\nSummary of Process Hazards, Safety Features, and Hazard Analysis Findings\n\nThe processes at the Sonora Gas Plant have hazards that must be managed to ensure continued safe operations.\n\nUniversal Prevention Activities\n\nThe accident prevention program summarized previously is applied to all EPA RMP covered processes at the Sonora Gas Plant.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by (1) equipment failures and (2) human errors.\n\nSpeci"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 48258,
      "SummaryText": "RMP ¿ Level 3 Facility\nDCP Midstream, LP\nSonora Gas Plant\nSonora, Texas\nEPA Facility Identifier #  1000 0006 5573 \n\n Executive Summary\n\nAccidental Release Prevention and Response Policies\n\nDCP Midstream¿s Sonora Gas Plant has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, our trained personnel will respond to control and contain the release.  We also work closely with our public emergency responders providing them with training and equipment so that they can respond safely and efficiently to emergencies that might occur at our facility.\n\nDescription of the Stationary Source and Regulated Substances \n\nThe Sonora Gas Plant, Southeast of Sonora, TX operates a variety of processes to produce petroleum products (e.g., natural gas, propane, butane, condensate) from gas wells.  The Sonora Gas Plant handles methane; ethane, propane and butane which are regulated flammables. The Sonora Gas Plant does not use, process or store a reportable quantity of toxic regulated substances.\n\nFive-Year Accident History\n\nWithin the past five years the processes have had no accidental release that caused offsite impacts provided in the risk management program rule (40 CFR 68.10(b)(1)).\n\n \n \nGeneral Accidental Release Prevention Program/Chemical-Specific Prevention Steps\n\nThe following is a summary of the accident prevention program in place at the Sonora Gas Plant.  Because processes at the Sonora Gas Plant that are regulated by the EPA Risk Management Program (RMP) regulation are also subject to the OSHA Process Safety Management (PSM) standard, this summary addresses each of the OSHA PSM elements and describes the management system in plac"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48258,
      "SummaryText": "e to implement the accident prevention program.\n\nEmployee Participation \n\nThe Sonora Gas Plant provides for and encourages employees to participate in all facets of process safety management and accident prevention.  Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a process hazard analysis (PHA) team.  Employees have access to all information created as part of the Sonora Gas Plant accident prevention program.  Specific ways that employees can be involved in the accident prevention program are documented in an employee participation plan that is maintained at the Sonora Gas Plant and addresses each accident prevention program element.  In addition, The Sonora Gas Plant has a number of initiatives under way that address process safety and employee safety issues.  These initiatives include a safety committee to promote both process and personal safety.  The committee typically has members from various areas of the plant, including operations, maintenance, and local plant management.\n\nProcess Safety Information\n\nThe Sonora Gas Plant keeps a variety of technical documents that are used to help maintain safe operation of the processes.  These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information.  Specific employees within the Sonora Gas Plant are assigned responsibility for maintaining up-to-date process safety information.  This information is readily available as part of the written employee participation plan to help employees locate any necessary process safety information.\n\n Chemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets.  This information specifically addresses known corrosion concerns and any known hazards associated with the ina"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48258,
      "SummaryText": "dvertent mixing of chemicals.  For specific process areas, the Sonora Gas Plant has documented safety-related limits for specific process parameters (e.g., temperature, level, composition).  The Sonora Gas Plant ensures that the process is maintained within these limits using process controls and monitoring instruments, highly trained personnel, and protective instrument systems (e.g., automated shutdown systems).\n\nThe Sonora Gas Plant also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, electrical rating of equipment, etc.  This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\nProcess Hazard Analysis (PHA)  \n\nThe Sonora Gas Plant has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled.  Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\nThe Sonora Gas Plant primarily uses the HazOp analysis technique to perform these evaluations.  This analysis is recognized as one of the most systematic and thorough hazard evaluation techniques.  The analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise.  This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary.\n\nThe PHA team findings are forwarded to local and corporate management for resolution.  Implementation of mitigat"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 48258,
      "SummaryText": "ion options in response to PHA findings is based on a relative risk ranking assigned by the PHA team.  This ranking helps ensure that potential accident scenarios assigned the highest risk receive immediate attention. \nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the Sonora Gas Plant periodically updates and revalidates the hazard analysis results.  These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating.  The results and findings from these updates are documented and retained.  Once again, the team findings are forwarded to management for consideration and the final resolution of the finds is documented and retained.\n\n Operating Procedures\n\nThe Sonora Gas Plant maintains written procedures that address various modes of process operations, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process.  These procedures can be used as a reference by experienced operators, and provide a basis for consistent training of new operators. These procedures are periodically reviewed and annually certified as current and accurate.  The procedures are maintained current and accurate by revising them as necessary to reflect changes made through the management of change process.\n\nTraining\n\nTo complement the written procedures for process operations, the Sonora Gas Plant has implemented a comprehensive training program for all employees involved in operating a process.  New employees receive initial training in Sonora Gas Plant operations.  After successfully completing this training, a new operator is paired with a senior operator to learn process-specific duties and tasks.  After operators demonstrate (e.g., tests, skill demonstration) having adequate knowledge to perform the duties and tasks in a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 48258,
      "SummaryText": "safe manner on their own, they can work independently.  In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  This refresher training is conducted at least every 3 years.  All of this training is documented for each operator, including the means used to verify that the operator understood the training.\n\nContractors\n\nThe Sonora Gas Plant uses contractors to supplement its workforce during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipment, the Sonora Gas Plant has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site safety rules, and (6) inform gas plant personnel of any hazards that they find during their work.  This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices prior to their beginning work.  In addition, the UPR Purchasing Department evaluates contractor safety programs and performance during the selection of a contractor. DCP Midstream personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\n\n Pre-startup Reviews\n\nThe Sonora Gas Plant conducts a pre-startup safety review (PSSR) for any new facility or facility modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel, and the equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides one additional check to make sure construction is in accordance w"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 48258,
      "SummaryText": "ith the design specifications and that all supporting systems are operationally read.  A PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention program requirements were properly implemented.\n\nMechanical Integrity\n\nThe Sonora Gas Plant has well-established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition.  The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures.  In combination, these activities form a system that maintains the mechanical integrity of the process.\n\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their job in a safe manner.  Written procedures help ensure that work is performed in a consistent manner and provide a basis for training.  Inspections and tests are performed to help ensure that equipment functions as intended, and to verify that equipment is within acceptable limits (e.g., adequate wall thickness).  If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or a group of experts will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.\n\nAnother integral part of the mechanical integrity program is quality assurance.  The Sonora Gas Plant incorporates quality assurance measures into equipment purchases and repairs.  This helps ensure that new equipment is suitable for its intended use and that proper materials and"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 48258,
      "SummaryText": "spare parts are used when repairs are made.  Pre-startup safety reviews are also used to support the quality assurance program.\n\nSafe Work Practices\n\nThe Sonora Gas Plant has long-standing safe work practices in place to help ensure worker and process safety.  Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment that is being worked on, (3) a procedure for safe removal of hazardous materials before process piping or equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work), and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space.  These procedures (and others), along with training of affected personnel, form a system to help ensure operations and maintenance activities are performed safely.\n\nManagement of Change\n\nThe Sonora Gas Plant has a comprehensive system to manage changes that affect any covered processes.  This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures and other facility changes be properly reviewed and authorized before being implemented.   Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, as well as procedures are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided any necessary training on the change.\n\nIncident Investigation\n\nThe Sonora Gas Plant promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts and deve"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 48258,
      "SummaryText": "alized Safety Features\n\nThe Sonora Gas Plant has safety features on many units to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of (mitigate) a release.  The following types of safety features are used in the covered processes: \n\n\nRelease Detection\n\n1. Process relief valves that discharge to a vent system to handle episodic releases\n\n2. Valves to permit isolation of the process (manual or automated)\n\n3. Automated shutdown systems for specific process parameter (e.g., high level, high temperature)\n4. Curbing or diking to contain liquid releases\n\n5. Redundant equipment and instrumentation (e.g., uninterruptible power supply for process control system, backup firewater pump)\n\n6. Atmospheric relief devices\n\nRelease Mitigation\n\n1. Fire suppression and extinguishing systems\n\n2. Personal protective equipment \n\n3. Spacing of equipment in accordance with IRI spacing guideline.  \n\n4. Emergency shutdowns strategically placed around the plant, that automatically shuts in the inlet and outlet and blows the plant down through the vent system.\n\nEmergency Response Program\n\nThe gas plant maintains a written emergency response program, which is in place to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response, including proper first-aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post incident cleanup and decontamination procedures.  In addition the Sonora Gas Plant has procedures that address maintenance, inspection and testing of emergency response equipment, as well as instructions that address the use of emergency response equipmen"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 48258,
      "SummaryText": "t.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is updated as necessary.  Any significant changes to the emergency response program are administered through the management of change (MOC) process, which includes informing and/or training affected personnel in the changes.\n The overall emergency response program for the Sonora Gas Plant is coordinated with the Sonora Fire Department.  The Sonora Gas plant conducts periodic emergency drills that involve the local emergency response organizations.  The Sonora Gas Plant provides training and equipment to local emergency responders so that they are familiar with any unique hazards that they may encounter when responding to emergencies at our facilities.\n\n  PLANNED CHANGES TO IMPROVE SAFETY\n \n The Sonora gas plant resolves all findings from PHAs, some of which result in modifications to the process. The following types of changes are planned over the next few years in response to PHA, safety audit, and incident investigation findings:\n \n* Incident response drills involving off-site emergency responders\n* Process Hazards Analysis revalidations\n* Management of change \n* Mechanical Integrity & Quality Assurance\n* Compliance audits \n* Continued focus on the The Goal is Zero for injuries and incidents.\n* Implement MAXIMO program for all equipment preventive maintenance (tracking history)"
    }
  ]
}