{
  "FacilityID": 48250,
  "FacilityName": "Brenntag Southeast Inc.",
  "FacilityStr1": "173 Fortis Drive",
  "FacilityStr2": null,
  "FacilityCity": "Duncan",
  "FacilityState": "SC",
  "FacilityZipCode": "29334",
  "Facility4DigitZipExt": "7407",
  "FacilityCountyFIPS": "45083",
  "LEPC": "Spartenburg County",
  "FacilityLatDecDegs": "34.875000",
  "FacilityLongDecDegs": "-082.128611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "bbiehl@brenntag.com",
  "FacilityDUNS": 47372503,
  "ParentCompanyName": "Brenntag Inc.",
  "Company2Name": null,
  "CompanyDUNS": 92963644,
  "Company2DUNS": 0,
  "OperatorName": "Brenntag Southeast Inc.",
  "OperatorStr1": "2000 East Pettigrew St.",
  "OperatorStr2": null,
  "OperatorCity": "Durham",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27703",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bruce Biehl",
  "RMPTitle": "Director Regulatory Affairs",
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000043311",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-03-17 00:00:00",
  "SafetyInspectionBy": "Internal safety audit",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Duncan, SC facility",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-05-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-05-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-05-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-05-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 34.87944,
  "FRS_Long": -82.12853,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 69993,
      "AltID": "Chlorine storage",
      "FacilityID": 48250,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 71671,
          "ProcessID": 69993,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 93094,
          "ProcessID": 69993,
          "ChemicalID": 62,
          "Quantity": 118000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 593094,
          "ProcessID": 69993,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 69994,
      "AltID": "Sulfur Dioxide Storage",
      "FacilityID": 48250,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 71672,
          "ProcessID": 69994,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 93095,
          "ProcessID": 69994,
          "ChemicalID": 49,
          "Quantity": 60000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 593095,
          "ProcessID": 69994,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 69995,
      "AltID": "Epichlorohydrin",
      "FacilityID": 48250,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 71673,
          "ProcessID": 69995,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 93096,
          "ProcessID": 69995,
          "ChemicalID": 21,
          "Quantity": 80000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 21,
            "ChemicalName": "Epichlorohydrin  [Oxirane, (chloromethyl)-]",
            "CASNumber": "106-89-8",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 593096,
          "ProcessID": 69995,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48250,
      "SummaryText": "Brenntag Southeast, Duncan, SC\n\n1.Accidental Release Prevention and Emergency Response Policies\nAll material at this facility is handled in closed containers. No transfer of chemical product is preformed. We at Brenntag Southeast Inc. are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances. We belong to the National Association of Chemical Distributors and adhere to the Responsible Distribution Process.\n\n\n2.The Stationary Source and the Regulated Substances Handled\nOur facility's primary activities encompass Chemical distribution.  We have 1 regulated substance present at our facility. These substances include and Chlorine.  Chlorine is used for distribution to mainly drinking water purification systems.\n\n3.To perform the required offsite consequence analysis for our facility, we have used the EPA's RMP*Comp(TM).  The following paragraphs provide details of the chosen scenarios.\n\n4.The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition.    The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nBrenntag Southeast Inc. maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensiv"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48250,
      "SummaryText": "e studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is Checklist.   Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA/update was performed on 07/25/2001.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Brenntag Southeast Inc. maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nBrenntag Southeast Inc. has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided.\n\nMechanical Integrity\nBrenntag Southeast Inc. carries out documented maintenance checks on process equipment to ensure proper operations.  Containers are DOT certified and examined by checks include among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Brenntag Southeast Inc. to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to de"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48250,
      "SummaryText": "al with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Brenntag Southeast Inc. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nBrenntag Southeast Inc. conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nBrenntag Southeast Inc. promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nBrenntag Southeast Inc. truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Brenntag Southeast Inc. has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 48250,
      "SummaryText": "the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n5.Five-year Accident History\nBrenntag Southeast Inc. has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n6.Emergency Response Plan\nBrenntag Southeast Inc. carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nSpartanburg County is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n7.Planned Changes to Improve Safety\nWe continually look at ways to improve safety at our facilities through regular safety meetings, safety audits, and participation in local emergency response activities."
    }
  ]
}