{
  "FacilityID": 4829,
  "FacilityName": "BHC Trap Falls Water Treatment Plant",
  "FacilityStr1": "505 Huntington Street",
  "FacilityStr2": null,
  "FacilityCity": "Shelton",
  "FacilityState": "CT",
  "FacilityZipCode": "06484",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "09001",
  "LEPC": "Shelton LEPC",
  "FacilityLatDecDegs": "41.263889",
  "FacilityLongDecDegs": "-73.140778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.bhcco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Aquarion Corporation",
  "Company2Name": null,
  "CompanyDUNS": 50633890,
  "Company2DUNS": 0,
  "OperatorName": "BHC Company",
  "OperatorStr1": "505 Huntington Street",
  "OperatorStr2": null,
  "OperatorCity": "Shelton",
  "OperatorStateFIPS": "CT",
  "OperatorZipCode": "06484",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Stamos",
  "RMPTitle": "Treatment Supervisor",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000060211",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-03-24 00:00:00",
  "DeRegistrationEffectiveDate": "2000-01-31 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 41.26452,
  "FRS_Long": -73.13891,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5635,
      "AltID": "Water treatment",
      "FacilityID": 4829,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5754,
          "ProcessID": 5635,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 6080,
          "ProcessID": 5635,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506080,
          "ProcessID": 5635,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4829,
      "SummaryText": "The Trap Falls Water Treatment Plant (Trap Falls) has four one-ton cylinders of chlorine on-line at a time - two active cylinders and two cylinders on standby for automatic switchover when the active cylinders are empty.  There is a vacuum regulator to automatically switch from the active set of tanks to the standby set when the pressure drops and the gas cylinders are empty.\n\nThe facility has chlorine detectors to monitor for chlorine leaks in the chlorine storage and chlorinator rooms.  Chlorine sensors are located approximately six inches above floor level in both rooms.  The detector will alarm at the main control room panel and there are both audible and visible alarms in the vicinity of the chlorine rooms.  There are appropriate exhaust systems in the chlorine storage and chlorinator rooms designed to vent chlorine gas from the buildings and to provide a minor level of workers safety.  \n\nTrap Falls normally stores a maximum of 12 one-ton cylinders onsite at any one time.  All cylinders are stored indoors.  During chlorine deliveries, the delivery truck backs up to the unloading area.  The building doors are opened and the chlorine cylinders are brought inside using a crane system.\n\nNormally the chlorine storage and chlorinator rooms doors remain closed unless chlorine is being unloaded.  All chlorine cylinders are stored within the chlorine storage room.  If a chlorine leak is detected by one of the sensors in the chlorine storage and chlorinator rooms, the chlorine alarm will activate.  There is an automatic ventilation system capable of changing the air in the chlorine rooms if the chlorine leak alarm is activated.  However, this automatic system is normally overridden by plant personnel and run in manual mode with the intent of containing any leak that may occur within the chlorine rooms. \n\nEach technician receives an initial 24 hour training program with an annual 8 hour refresher.  The safety managers and safety committee comprised of employees from every"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4829,
      "SummaryText": " department meet on a monthly basis for the purpose of limiting the number of accidents of any type.\n\nThe facility has not had an accidental release from this covered process in the five years prior to the submission of this Risk Management Plan (RMP).\n\nThe worst-case scenario involves the unmitigated release to the atmosphere of the contents of a 2,000-pound chlorine cylinder over a period of ten (10) minutes.  The cylinder discharges a dense gas release under worst case meteorological conditions of F Stability and 1.5 meters per second.  \n\nThe release rate and the worst-case impact area are determined using Exhibit 4-3 in the EPA's Risk Management Plan Guidance for Wastewater Treatment Plants (EPA 550-B-98-010 October 1998) and RMP*Comp.  The distance to the toxic endpoint is 3.0 miles based on rural topography.  The rural topography assumption is appropriate for this analysis because the facility buildings are not extremely tall and there are no extremely tall buildings and/or hilly terrain surrounding the facility. \n\nLandview III was used to determine the number of persons living within the impact area based on census data.  According to Landview III's census database, there are approximately 34,000 people living within the worst-case impact radius of 3.0 miles.  \n\nMARPLOT3.2 was used to plot the worst-case radius and determine the presence of public receptors, other than residences, within the impact area.  Located within this area are seven schools, six cemeteries, three religious institutions and recreational areas and parks.  \n\nThe most likely release case (alternative case scenario) is that no chlorine will be released outside of the chlorine storage room.  An alarm would sound when the chlorine leak detectors detect an air concentration of chlorine above their set point and an emergency response team would be at the location within a few minutes to an hour (depending on the time of day) to shut the system down.\n\nIn order to evaluate the alternative case sc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4829,
      "SummaryText": "enario that results in a release that is not contained, it is necessary to assume that the automatic shut-off fails and that an emergency response team is unable to shut off the leaking chlorine cylinder.  Under those unlikely assumptions, the following release scenario was addressed.  A steady-state leak of up to 5 pounds per minute of chlorine either as a gaseous or a two-phase release.  The duration of such a release is estimated to be approximately 36 minutes.  It should be noted that a completely filled one-ton cylinder has a maximum gaseous discharge rate of about 500 pounds per day (0.35 pounds per minute).  Significant gaseous discharges above this rate will result in the cylinder freezing up and the discharge stopped. It is also assumed that the cylinder discharges a dense gas release under meteorological conditions of D Stability and 3.0 meters per second at an ambient temperature of 25:C.\n\nThe alternative case impact area was determined using Exhibit 4-12 in the EPA's Risk Management Plan Guidance for Wastewater Treatment Plants (EPA 550-B-98-010 October  1998) and RMP*Comp.  The distance to the toxic endpoint is 0.1 miles based on rural topography.  The rural topography assumption is appropriate for this analysis because the facility buildings are not extremely tall and there are no extremely tall buildings and/or hilly terrain surrounding the facility.  \n\nLandview III was used to determine the number of persons living within the impact area based on census data.  According to Landview III's census database, there are approximately 20 people living within the alternative case impact radius of 0.1 mile.  \n\nMARPLOT3.2 was used to plot the alternative case impact radius and determine the presence of public receptors, other than residences, within the impact area.  There are no schools, hospitals, parks or other sensitive receptors located within this area."
    }
  ]
}