{
  "FacilityID": 4831,
  "FacilityName": "Agrilink Foods Inc. - Uvalde",
  "FacilityStr1": "2369 West Hacienda Rd",
  "FacilityStr2": null,
  "FacilityCity": "Uvalde",
  "FacilityState": "TX",
  "FacilityZipCode": "78801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48463",
  "LEPC": "Uvalde County LEPC",
  "FacilityLatDecDegs": "29.237778",
  "FacilityLongDecDegs": "-99.831389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Agrilink Foods Inc.",
  "Company2Name": "Pro-Fac Cooperative",
  "CompanyDUNS": 2212611,
  "Company2DUNS": 64255938,
  "OperatorName": "Paulino Morin",
  "OperatorStr1": "P.O. Box 367",
  "OperatorStr2": "2369 West Hacienda Rd",
  "OperatorCity": "Uvalde",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78801",
  "OperatorZipCodeExt": null,
  "RMPContact": "Paulino Morin",
  "RMPTitle": "Plant Manager",
  "FTE": 200,
  "OtherEPAFacilityID": "TXR000019893",
  "EPAFacilityID": "100000060266",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2003-07-10 00:00:00",
  "DeRegistrationEffectiveDate": "2003-06-04 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 29.23778,
  "FRS_Long": -99.83139,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5637,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 4831,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5756,
          "ProcessID": 5637,
          "NAICSCode": "31141",
          "_desc": {
            "NAICS_CODE": "31141",
            "NAICS_DESCRIPTION": "Frozen Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 6082,
          "ProcessID": 5637,
          "ChemicalID": 56,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506082,
          "ProcessID": 5637,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4831,
      "SummaryText": "This is to inform all interested persons, including employees that Agrilink Foods, Inc. is complying with OSHA's Process Safety Management Standard (Process Safety Management or PSM), Title 29 code of Federal Regulations (CFR) 1910.119, and EPA's Risk Management Program regulations (RMP program), Title 40 CFR Part 68, to manage the risks involved with the storage, handling, and processing of hazardous chemicals.  In this way we promote overall plant, worker, and public safety.  These programs enable our facility to minimize the occurence, and minimize the consequences, of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents.  Overall, these programs prevent accidental fatalities, injuries and illnesses and avoid physical property damage.\n\nOur safety programs are applied to any activity involving hazardous chemicals including any use, storage, manufacturing, handling, or the on-site movement of such chemicals, or combination of these activities.  Any group of vessels which are interconnected and separate vessels which are located such that a hazardous chemical could be involved in a potential release shall be considered a single process.\n\nOur safety programs minimize accidents because they focus on the rules, procedures, and practices which govern individual processes, activities, or equipment.  These rules are detailed and improved as necessary.  They are also comminicated to and accepted by all employees at the facility.  \n\nDescription of System\nThe ammonia refrigeration process at the facility is a two stage, closed loop design.  This system changes the state of ammonia from a gas to a liquid and operates very similar to a household refrigerator.  \n\nThe first stage function is to maximize freezing capabilities by working with very low head pressure.  This enables this system to operate consistenly with -10 to -12 inches of vaccum.  \n\nThe second stage function is to eliviate discharge pressure on the first"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4831,
      "SummaryText": " stage.  This stage is able to work with head pressure within the allowable operating discharge pressures.  This stage is also used for chilling capabilities throughout the plant.  Working at 24 to 26 psig suction and 150 to 180 psi discharge.  This refrigeration system is used for various freezing capabilites such as blast freezing, IQF freezing, stroage warehouse freezer, product chilling, and cool room storage for Okra, Carrots, Peas, and all Southern Greens.    \n\nThe refrigeration system consists of approximately 1500 hp on the low side and approximately 2500 hp on the high side combine with eight condensors, four recirrculators, three intercoolers, and two thermo syphen vessels, which are supplied by two main receivers.  \n\nWorst-Case Scenario\nFailure of the high-pressure receiver containing 36,000 pounds of ammonia with the receiver quantity limited to 40,000 pounds of vessel capacity resulting in an ten minute release.  Under worst case weather conditions, ammonia could travel 3.6 miles before dispersing enough to no longer pose a hazard to the public or the environment.  This scenario is unlikely for the following reasons:  worst case weather conditions are only likely in the winter, only certified vessels are installed and operated to manufacuters specifications, pressure safety relief valves limit operating pressure in vessel, the accident prevention program in place at the facility including the Mechanical Integrity program for regular maintenance, inspection and testing, and replacement of equipment if necessary, Allen Bradly refrigeration system in place to detect ammonia leaks and high working pressures this system is equiped with automated softwear desiged to isolate various vessels, auxerlery shutdown system would automatically page \"on-call\" technician to eliminate a potential operating hazard. \n\nAlternative Release Scenario\nFailure of 1/4 inch diameter pipe would result in the release of approximately 6000 pounds of ammonia over a period of 60 minut"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4831,
      "SummaryText": "es.  Under common weather conditions, ammonia could travel 0.2 miles before dispersing enough to no longer pose a hazard to the public or environment.  The 1/4 inch pipe was chosen because it is a point at which ammonia can be evacuated for maintenance procedures.  This scenario is unlikely because the equipment is isolated prior to any maintenance procedures, only qualified technicians are allowed to perform such duties, all 1/4 inch piping and/or valves are a special alloy steel and are schedule 80 seamless material, Preventative Maintenance program would include various inspections and testing to be conducted on each piece of equipment, replacement of equipment and/or materials as needed.\n\nPrevention Program\nThe general accident prevention program and ammonia-specific prevention steps was developed as required to comply with OSHA PSM Standard 29 CFR 1910.119 and EPA RM Program regulations in 40 CFR Part 68.  The key prevention steps at the facility consist of the following:\n\n-  Process Safety Information\n-  Process Hazard Analysis\n-  Standard  Operating Procedures\n-  Training\n-  Mechanical Integrity Program\n-  Management of change\n-  Pre-startup Safety Review\n-  Compliance Audits\n-  Incident Investigation\n-  Employee Participation\n-  Hot Work Permit\n-  Contractor Qualifications\n\nFive Year Accident History\nAgrilink Foods - Uvalde has not had any reportable accidents in the last five years.  \n\nEmergency Response Plan\nUvalde facilitiy's emergency response program is based on OSHA requirements for Emergency Action Plans (29 CFR 1910.38 and 1910.119) and Hazwoper (29 CFR 1910.120).  We have trained employees for emergency response and maintain a written emergency response plan.  This plan is coordinated with the Uvalde Fire Department and our Local LEPC.  We conduct quarterly drills for implementation of the emergency response plan at the facility.  We also have a contract with Boots and Coots for any clean-up."
    }
  ]
}