{
  "FacilityID": 48432,
  "FacilityName": "LaBelle Warehouse",
  "FacilityStr1": "871 Industrial Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "LaBelle",
  "FacilityState": "FL",
  "FacilityZipCode": "33975",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12051",
  "LEPC": "District 9 LEPC",
  "FacilityLatDecDegs": "26.750048",
  "FacilityLongDecDegs": "-081.426644",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "The Dumont Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "The Dumont Company",
  "OperatorStr1": "812 Eyrie Drive",
  "OperatorStr2": null,
  "OperatorCity": "Oviedo",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32765",
  "OperatorZipCodeExt": null,
  "RMPContact": "David Rivers",
  "RMPTitle": "Complaince Manager",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000103096",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-04-25 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-06-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-06-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-05-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-04-17 00:00:00",
  "DeRegistrationEffectiveDate": "2012-03-31 00:00:00",
  "AnniversaryDate": "2012-05-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 26.75278,
  "FRS_Long": -81.27278,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "ADDRESS MATCHING-BLOCK FACE",
  "HorizontalAccMeasure": "1.5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 70233,
      "AltID": "Storage",
      "FacilityID": 48432,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 71924,
          "ProcessID": 70233,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 93395,
          "ProcessID": 70233,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 593395,
          "ProcessID": 70233,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48432,
      "SummaryText": "It is the Dumont Companies policy to provide the highest level release prevention for any hazardous materials including those covered by federal statute 40 CFR part 68. All employees are trained to high levels of preparedness to cope with such eventualities. A policy of providing emergency response information is and has been a central part of Dumont's policies. In advance of this program Dumont has provided local responders, such as fire departments, facility layouts, etc. The company has also extended complimentary training to some county governmental agencies.\n\nThe Dumont Company is a distributor of industrial chemicals primarily serving water, wastewater treatment, agricultural and industrial customers. The business has a total of four on-site employees and would be considered small in comparison to other similarly titled business. The only materials stored in sufficient quantities to warrant reporting under SARA Title III at the Labelle stationary site is Chlorine, CAS# 7782-50-5.\n\nDumont performs the following functions at its Labelle operations facility pertaining to Federal Regulations contained in 40 CFR 68.\n1.Receives, unloads and stores vessels containing a material covered under 40 CFR 68\n(specifically - chlorine) from vendors.\n2.Reloads and transports subject transport vessels to customers premises.\n3.Transports, unloads, and stores empty subject vessels.\n4.Reloads empty subject vessels on vendor transportation..\n5.Normal storage quantities are four ton containers and forty-five one hundred fifty pound\ncontainers.\n\nDumont does not in its normal course of business perform any of the following functions with the material subject to the regulation sited.\n1.Dumont does not consume subject material.\n2.Dumont does not produce the material or convert the material to another form.\n3.Dumont does not package or repackage the subject material.\n4.Dumont does not open subject vessels for inspection or other purposes.\n\nBecause of the nature of the operation defined, "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48432,
      "SummaryText": "the safety history of the Dumont organization, the attention  \nto the safety program documented within this program, and its position related to public receptors, environment receptors and emergency responders, the risk of potential releases and related dangers are assessed as minimal to minimal-moderate. The worst case scenario would be a rupture of a ton cylinder of Chlorine gas, if unmitigated would have an end point of 1.3 miles.\nAs latter defined in additional Risk Management Plan (RMP) documentation, the following factors are stated for summary.\nA.Dumont's record pertaining to releases of said material and is outstanding - (No reportable\nreleases).\nB.Dumont has instituted safety measures and procedures to minimize release impact.\nC.Dumont's facility is located in an industrial area that is a low density small urban/ rural\nenvironment.\nD.No major public receptors are located in a quarter mile radius.\nE.No major environmental areas of concern are located in a quarter mile radius.\nF.At the expected release rate of thirty-five pounds per hour or less, the impact area of concern\nis approximately 1500' for a 10 PPM effect. (60 minute release-Urban Conditions).\nG.Potential for catastrophic danger is one or more of the subject vessels is statistically minute.\nH. Risk analysis of all potential practical risks confirm findings. \n\nA worst case scenario of a ruptured ton containers is envisioned is 1.3 miles. Local responders have copies of our response procedures and plant layout, etc.\n\nIn general, the accident release program consists of close inspection of received subject material containers, valves, fuse plugs, etc., enforced handing procedures designed to minimize the container damage risks, training in the characteristics, handing, and leak containment devices for the subject material. Product hazard analysis have been performed and a system of procedures installed to negate as many of these potential hazards as possible."
    }
  ]
}