{
  "FacilityID": 48479,
  "FacilityName": "Aurora Cooperative - Harvard East Site",
  "FacilityStr1": "N. Furnas Ave & N. Depot St",
  "FacilityStr2": null,
  "FacilityCity": "Harvard",
  "FacilityState": "NE",
  "FacilityZipCode": "68944",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31035",
  "LEPC": "Clay County LEPC",
  "FacilityLatDecDegs": "40.617222",
  "FacilityLongDecDegs": "-098.091111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Aurora Cooperative Elevator Company",
  "Company2Name": null,
  "CompanyDUNS": 7491392,
  "Company2DUNS": 0,
  "OperatorName": "Aurora Cooperative Elevator Company",
  "OperatorStr1": "605 12th Street",
  "OperatorStr2": "P.O. Box 209",
  "OperatorCity": "Aurora",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68818",
  "OperatorZipCodeExt": null,
  "RMPContact": "Doug Salmon",
  "RMPTitle": "Compliance & Safety Manager",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000192962",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-09-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-09-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-05-17 00:00:00",
  "DeRegistrationEffectiveDate": "2019-05-01 00:00:00",
  "AnniversaryDate": "2010-09-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 70313,
      "AltID": null,
      "FacilityID": 48479,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 72005,
          "ProcessID": 70313,
          "NAICSCode": "11511",
          "_desc": {
            "NAICS_CODE": "11511",
            "NAICS_DESCRIPTION": "Support Activities for Crop Production"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 93510,
          "ProcessID": 70313,
          "ChemicalID": 56,
          "Quantity": 420000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 593510,
          "ProcessID": 70313,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48479,
      "SummaryText": "Aurora Cooperative is a full-service agricultural supply company. This nurse tank storage area located at the corner of N. Furnas Ave. and N. Depot St. in Harvard, NE serves Clay County as a retail source of anhydrous ammonia, an affordable form of nitrogen fertilizer for crop production.\n\nAurora Cooperative Elevator Company\nAnhydrous Ammonia Risk Management Plan\nExecutive Summary\n\nAccidental Release Prevention and Emergency Response Policies:\n\nAurora Cooperative is dedicated to the safe handling of all products used, stored and sold in the business of supplying agricultural inputs for the production of grain and livestock. As such, Aurora Cooperative has developed policies and procedures for the safe handling and storage of anhydrous ammonia as well as response to potential releases. These include:\n1.    A commitment to meet regulatory requirements related to the safe handling and storage of anhydrous ammonia.\n2.    Training programs for all employees involved with handling anhydrous ammonia.\n3.    Regular and thorough preventative maintenance of fixed and portable anhydrous ammonia equipment to assure compliance with regulations as well as to identify and correct potential defects.\n4.    The training and equipping of key operations personnel to take aggressive emergency response actions using proper personal protective equipment in accordance with 29CFR1910.120(q).\n5.    Coordination of emergency response plans and public protective actions with Local Emergency Responders and Local Emergency Planning Committees, where active.\n\nDescription of the Facility and Product Handled:\n\nAurora Cooperative is a full-service agricultural supply company. This plant, located at the corner of N. Furnas Ave and N. Depot St. in Harvard, NE, serves Clay County as a retail source of anhydrous ammonia, an affordable from of nitrogen fertilizer for crop production.\n\nAccidental Release Prevention Program:\n\nThe accidental release prevention program for anhydrous ammonia storage facilities at Aurora Coo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48479,
      "SummaryText": "perative involves five primary objectives:\n1.    Operator Training. All anhydrous ammonia plant operators receive training on the hazards and safety procedures related to handling anhydrous ammonia. This includes:\n2.    Physical Hazards, emergency procedures and first aid.\n3.    Plant normal and emergency start-up, operating, and shutdown procedures.\n4.    Plant inspection and maintenance procedures.\n5.    Plant design, including physical protection from identified hazards such as vehicular collision and installation of emergency shutoff valves.\n\nFive-Year Accident History:\n\nThis fixed facility has experienced no reportable accidental releases in the past five years.\n\nEmergency Response Program:\n\nEmergency response to an accidental release of anhydrous ammonia is accomplished by one of three methods, depending on the severity and anticipated duration of the release.\n1.    For minor releases, most commonly caused by a valve leak or failure during operation and that are quickly isolated, trained operators, working from an upwind and safe location will isolate the leak to minimize the amount of product released. Safety equipment available to operators at all times includes indirect vented goggles, chemical resistant gloves, and air purifying respirators.\n2.    For a more serious release that may be difficult to isolate, trained operators will notify city and county emergency management via the local sheriff?s office emergency telephone number along with a description of the difficulty, expected duration, recommended community protective actions and the need for assistance, if any. Hazmat-trained operators working with local emergency responders will don appropriate personal protective equipment to isolate the release. Protective actions for the public will be implemented as well as actions to minimize environmental impact from the release.\n3.    In the event of a release that cannot be isolated due to the nature of the damage/failure or due to the lack of adequate personal protective equipmen"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48479,
      "SummaryText": "t, the county emergency management organization will be notified via local sheriff?s office emergency telephone number, along with a description of the nature of the problem, recommended community protective actions and request for assistance, if any. Hazmat-trained operators, working with local emergency managers will implement necessary actions to protect the public and minimize the environmental impact of the release.\n\nPlanned Changes to Improve Safety:\n\nPlanned improvements to current programs and policies include:\n1.    Enhanced training and coordination with local emergency responders and planners.\n2.    Implementation of a uniform maintenance program for fixed facilities and portable equipment. \n3.    Enhance the written review policy for Aurora Cooperative?s Emergency Response procedures.\n"
    }
  ]
}